{
  "1529.TW": {
    "city": "Taoyuan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Klingon Aerospace Inc.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "LUXE CO. LTD.",
    "state": null,
    "summary": "Klingon Aerospace Inc. designs, manufactures, installs, and trades in electrical products. It provides switchboards, and potential and current transformers; and electrical supplies, such as circuit breakers, reactors, resistors, high-voltage direct current power supply equipment, and other products. The company also offers network monitoring products, including remote terminal units, supervisory control and data acquisition systems, communication software and hardware, and others. In addition, it is involved in the design and construction of wind power, substation, and cogeneration turnkey works; and water and electricity distribution and construction turnkey works, as well as the provision of repair and test services, and sheet metal parts and aluminum products. Further, the company offers gas isolated switchgear facilities; electrostatic dust facilities; metal clad switchgears; load and motor control centers; matching system reactors; annular tube current transformers; and oil immersion type and molded case transformers, as well as systems engineering and electric power turnkey engineering services. It also provides in-flight solutions, such as air cable, Wi-Fi, mobile, and shopping solutions; and wind power generators and wind/solar hybrid street lights. The company was formerly known as Luxe Electric Co., Ltd. and changed its name to Klingon Aerospace Inc. Klingon Aerospace Inc. was founded in 1978 and is based in Taoyuan City, Taiwan.",
    "website": "http://www.luxe.com.tw",
    "zipcode": null
  },
  "1537.TW": {
    "city": "Nantou City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Kung Long Batteries Industrial Co.,Ltd",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "KUNG LONG BATTERIE",
    "state": null,
    "summary": "Kung Long Batteries Industrial Co.,Ltd manufactures and sells lead-acid batteries in Taiwan and internationally. It offers products for use in cycling high-power, electric car, deep-cycle, renewable energy, and solar energy applications. The company was founded in 1990 and is headquartered in Nantou City, Taiwan.",
    "website": "http://www.klb.com.tw",
    "zipcode": "54067"
  },
  "1597.TW": {
    "city": "Tainan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Chieftek Precision Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "CHIEFTEK PRECISION CO LTD",
    "state": null,
    "summary": "Chieftek Precision Co., Ltd. researches, develops, manufactures, and sells linear motion components in Taiwan. It offers compact linear motor and moving magnet stage products, linear motor servo drivers, magnetic encoders, iron core and ironless linear motors, DD motors, standard 4-row ball bearing linear guides, wide 4-row ball bearing linear guides, standard 4-row roller-type linear guides, miniature linear guides, industrial robots, and ST miniature stroke slide series products, as well as photovoltaic and semiconductor process equipment. The company also provides external NBR seal, metal and plastic caps, metal stopper on rail, and lubrication kit and grease gun. It also exports its products to the United States, Europe, Asia, and internationally. Chieftek Precision Co., Ltd. was founded in 1998 and is headquartered in Tainan City, Taiwan.",
    "website": "http://www.chieftek.com",
    "zipcode": "74145"
  },
  "1605.TW": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Walsin Lihwa Corporation",
    "market": "tw_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "WALSIN LIHWA CORP",
    "state": null,
    "summary": "Walsin Lihwa Corporation manufactures and sells bare copper wires, wires and cables, and specialty steel products in Asia, the United States, Europe, and internationally. The company offers copper bars, power cables, communication cables, optical cables, and industrial cables for construction, electric engineering, information appliance, power, and telecommunications companies for the use in shipbuilding, heavy machinery, solar and wind power generation, electric vehicles, and robotics; and copper rods, connectors, and components for the cable and wire, communications cable, heavy electronics, and home electrical appliance industries. It also provides stainless steel products, including billets/slabs/ingots, wire rods, straight bars, cold-and hot-rolled coils, precision foils, seamless pipes and tubes, and steel cables and wires, as well as smelting, rolled stainless steel and carbon steel products, and precision alloy wires for construction component, crankshaft, machine tool, plumbing, heat exchanger, drain, and petrochemical industries. In addition, the company engages in the development, construction, operation, management, and rental of residences, offices, markets, estate complexes, and hotels, as well as offers after-sales services. Further, it designs, installs, and manages solar power systems; and manufactures and sells copper alloys, alloy materials, flat-rolled products, and medium and heavy specialty steel plates. Additionally, the company provides mechanical, electrical, communications, and power systems; light emitter diode and solar power assemblies; solar module assemblies; and electronic devices and modules; and construction, business and assets management, consulting, advertising, and commerce services. It also constructs, rents, and sells buildings and industrial factories; and engages in the property management and housing leasing, and solar power businesses. Walsin Lihwa Corporation was founded in 1966 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.walsin.com",
    "zipcode": "11047"
  },
  "1616.TW": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Evertop Wire Cable Corporation",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "EVERTOP WIRE CABLE  CORP",
    "state": null,
    "summary": "Evertop Wire Cable Corporation engages in the research and development, manufacture, and sale of wires and cables in Taiwan. The company offers bare and electrical wires; and power, communication, optical fiber, solar, electrical hybrid, water-resistant type, and electric vehicle cables under the EVERTOP brand. Its products are used in the building infrastructure, such as offices, residences, schools, hospitals, and industrial parks; and public transportation, including subways, tunnels, high-speed rail systems, stations, and airports. The company was founded in 1988 and is headquartered in Taipei City, Taiwan.",
    "website": "http://www.evertop.com",
    "zipcode": null
  },
  "2061.TWO": {
    "city": "Kaohsiung",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Feng Ching Metal Corporation",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "FENG CHING METAL CORPORATION",
    "state": null,
    "summary": "Feng Ching Metal Corporation produces and sells copper wires and enameled copper wires primarily for use in electronic, electrical appliance, and communication technology industries in Taiwan and internationally. The company was founded in 1983 and is based in Kaohsiung, Taiwan.",
    "website": "http://www.fcm.com.tw",
    "zipcode": "802"
  },
  "2420.TW": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Zippy Technology Corp.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "ZIPPY TECHNOLOGY CORP",
    "state": null,
    "summary": "Zippy Technology Corp. manufactures and sells micro switches, industrial power supplies, and LED keyboards worldwide. The company offers power supplies for file servers, industrial PCs, storage systems, workstations, blade servers, communication systems, industrial equipment, medical devices, telecom/broadcast systems, and wind power equipment. It also provides sealed, rotary, push, low torque, side mini, slide, rocker, hook, tact, detect, and encoder switches, as well as snap action micro switches for use in consumer electronics, as well as computer, communication device, home appliance, industrial equipment, automotive, medical device, and military applications. The company sells its products under the ZIPPY and EMACS brand names, as well as provides ODM and OEM services. Zippy Technology Corp. was founded in 1983 and is headquartered in New Taipei City, Taiwan.",
    "website": "http://www.zippy.com.tw",
    "zipcode": "23141"
  },
  "2438.TW": {
    "city": "Taoyuan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Enlight Corporation",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ENLIGHT CORP",
    "state": null,
    "summary": "Enlight Corporation develops, produces, and sells LED lighting products in Taiwan. The company's products include LED tubes, laminate lights, bulb lights, flat lights, tablet lights, embedded lights, ceiling lights and lamps, remote control desk lamps, projection lamps and lights, recessed lamps, patio lights, spotlights, track lights, box lights and lamps, and dimmers, as well as track lighting products and household appliances. It also engages in the mechanical and electrical businesses, such as steam piping and hot oil piping works, and equipment installation and glue system piping engineering solutions. The company was founded in 1982 and is based in Taoyuan City, Taiwan.",
    "website": "http://www.enlightcorp.com.tw",
    "zipcode": "333"
  },
  "2440.TW": {
    "city": "Hsinchu",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Space Shuttle Hi-Tech Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "SPACE SHUTTLE HI-TECH CO",
    "state": null,
    "summary": "Space Shuttle Hi-Tech Co., Ltd., together with its subsidiaries, manufactures and sells telecommunication wires and cables. The company operates through four divisions: Wires, Electrical Products, Optical Cables, and Optic Electrical. It offers a range of wires for the computer, communication cable, and electronic products. The company sells its products in Taiwan, Mainland China, Japan, Australia, Europe, and the United States. Space Shuttle Hi-Tech Co., Ltd. was founded in 1985 and is headquartered in Hsinchu, Taiwan.",
    "website": "http://www.spaces.com.tw",
    "zipcode": "307"
  },
  "2457.TW": {
    "city": "Taoyuan",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Phihong Technology Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "PHIHONG TECHNOLOGY COMPANY LTD",
    "state": null,
    "summary": "Phihong Technology Co., Ltd. manufactures and sells power supply products in Taiwan and internationally. The company offers power adaptors, power over Ethernet products, EV chargers, and worksite radios for personal electronics, networking, POS, small home appliance, medical, industrial, construction, and electric vehicle applications. It serves telecom, datacom, personal electronics, and industrial markets. The company was formerly known as Phihong Enterprise Co., Ltd. and changed its name to Phihong Technology Co., Ltd. in June 2003. Phihong Technology Co., Ltd. was founded in 1972 and is headquartered in Taoyuan, Taiwan.",
    "website": "http://www.phihong.com.tw",
    "zipcode": "33383"
  },
  "2489.TW": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "AmTRAN Technology Co.,Ltd",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "AMTRAN TECHNOLOGY",
    "state": null,
    "summary": "AmTRAN Technology Co.,Ltd engages in the production and sale of flat-panel TVs in Taiwan and internationally. It offers OEM/ODM display; MFG LCD monitor; PDs audio device; mouse; and webcam. The company was founded in 1994 and is headquartered in New Taipei City, Taiwan.",
    "website": "http://www.amtran.com.tw",
    "zipcode": null
  },
  "2492.TW": {
    "city": "Taoyuan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Walsin Technology Corporation",
    "market": "tw_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "WALSIN TECHNOLOGY CORP",
    "state": null,
    "summary": "Walsin Technology Corporation manufactures and sells passive components worldwide. The company provides multiple-layer ceramic chip capacitors/arrays, chip-resistors/arrays and networks, RF filters, inductors, disc capacitors, varistors, antennas, chip fuses, thin film products, safety components, modules, etc. Its products are used in mobile device, networking, automotive, industrial, power supply, IoT, green energy, PC and peripherals, and lighting. The company was incorporated in 1992 and is headquartered in Taoyuan City, Taiwan.",
    "website": "http://www.passivecomponent.com",
    "zipcode": "32668"
  },
  "3002.TW": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "AHOKU Electronic Company",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "AHOKU ELECTRONIC",
    "state": null,
    "summary": "AHOKU Electronic Company provides smart home solutions. The company offers travel adapters and converters, USB chargers, power sockets, cabinet power strips, outlets surge protectors, wireless IP cameras, wireless chargers, Wi-Fi travel routers, car inverters, AC plugs, battery backups, alarm sensors, passive infrared sensors, smart sockets, moisture sensors, and night vision cameras, as well as wireless security cameras, door and window sensors, and Bluetooth smart sockets. AHOKU Electronic Company was founded in 1983 and is based in Taipei City, Taiwan.",
    "website": "http://www.ahoku.com",
    "zipcode": "114"
  },
  "3003.TW": {
    "city": "Changhua",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "K.S. Terminals Inc.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "KS TERMINALS INC",
    "state": null,
    "summary": "K.S. Terminals Inc. manufactures and sells electrical terminals, wire accessories, lighting systems, electric vehicle charging connectors, automotive connectors, nylon cable ties, and green energy connectors in Taiwan and internationally. Its electrical terminal products include insulated and non-insulated copper terminals, insulated quick disconnectors, din terminals, cord end terminals, water proof heat shrinkable terminals with adhesive tubing, butt splice and other connectors, stainless steel ties, JIS terminals, battery modular connectors, and tools, as well as copper tubular lugs. The company also offers continual type terminals, and white goods terminals and housings. The company was formerly known as Ken Shing Industrial shop and changed its name to K.S. Terminals Inc. in 1978. K.S. Terminals Inc. was founded in 1973 and is headquartered in Changhua City, Taiwan.",
    "website": "http://www.ksterminals.com.tw",
    "zipcode": "507"
  },
  "3043.TW": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Powercom Co., Ltd",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "POWERCOM CO",
    "state": null,
    "summary": "Powercom Co., Ltd provides power management products in Taiwan and internationally. It offers online and offline uninterruptible power supply (UPS), three phase UPS, line-interactive UPS, functional UPS, accessories, auto voltage regulator, inverter, and other products. The company was founded in 1987 and is headquartered in New Taipei City, Taiwan.",
    "website": "http://www.upspowercom.com",
    "zipcode": "235"
  },
  "3071.TWO": {
    "city": "Pingtung",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Adda Corporation",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "ADDA CORP",
    "state": null,
    "summary": "Adda Corporation designs, manufactures, and sells electronic thermal management products primarily for the information technology industry worldwide. The company offers CPU cooler modules, blower fans, DC axial-flow/blower fans, AC axial-flow fans, and waterproof fans; thermal modules; and accessories, such as metal finger guards and plastic filters. Adda Corporation was incorporated in 1978 and is based in Pingtung, Taiwan.",
    "website": "http://www.adda.com.tw",
    "zipcode": "90049"
  },
  "3092.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Hotron Precision Electronic Industrial Co.,Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "HOTRON PRECISION ELECTRONIC IND",
    "state": null,
    "summary": "Hotron Precision Electronic Industrial Co.,Ltd. manufactures and supplies various wires and cables for signal transmission, telecommunication, IT, power, auto, medical appliances, and other industries in Taiwan. It offers electronic, electric, and other wires and cables. The company also provides copper rods, wires, and fine wires; tooling for metal press/plastic injection; metal pressed work products; insulation composite Mylar Al. foils; and various wire cables and PC board connectors. In addition, it offers terminals, wire assemblies, and molds; PVC plastic formulations and pellets; and plastic extrusion and injection products. Hotron Precision Electronic Industrial Co.,Ltd. was founded in 1991 and is headquartered in Taipei City, Taiwan.",
    "website": "http://www.hotron-ind.com",
    "zipcode": "114"
  },
  "3163.TWO": {
    "city": "Hsinchu City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Browave Corporation",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "BROWAVE CORPORATION",
    "state": null,
    "summary": "Browave Corporation operates as an original equipment manufacturing/original design manufacturing development, production, and sales company in the optical fiber communication industry in Taiwan and internationally. Its products include compact coarse wavelength division multiplexers and demultiplexers; splitter modules; add/drop filters; amplifier components consisting of isolators and gain flattening filters; fused biconic taper WBC/WDM coupler and planar lightwave circuit splitters; fan-out cabling systems, adapters, and patchcords/pigtails; MPO/MTP cables; and fiber arrays, collimators, and pigtails. The company also provides optical devices and optical module products, such as isolators, couplers, DWDM, IPD, EDFA, ROSA, BOSA, etc. Its products are used in long haul communications network, metropolitan area network, central office fiber-to-the-home, and cloud data center applications. In addition, the company provides contract manufacturing services. Browave Corporation was founded in 1998 and is headquartered in Hsinchu City, Taiwan.",
    "website": "http://www.browave.com",
    "zipcode": "30075"
  },
  "3211.TWO": {
    "city": "Taoyuan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Dynapack International Technology Corporation",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "DYNAPACK INTERNATIONAL TECHNOLO",
    "state": null,
    "summary": "Dynapack International Technology Corporation designs, manufactures, and supplies portable battery packs in Taiwan. The company offers its products for various applications, including notebook/ultrabook PCs, tablet PCs/e-books, smartphones, handy scanners, 2-way radios, power banks, cable modems, server UPSs, and e-bike batteries. The company was founded in 1998 and is based in Taoyuan, Taiwan.",
    "website": "http://www.dynapack.com.tw",
    "zipcode": "333"
  },
  "3226.TWO": {
    "city": "Tainan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Topower Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "TOPOWER COMPUTER IND CO LTD",
    "state": null,
    "summary": "Topower Co., Ltd. manufactures and sells auto parts, power supply and LED products, and auto lamps in Taiwan. It offers auto parts, such as car and truck parts, and auto accessories; ATX and IPC power supply products; and LED products, including bulbs, candle lights, downlights, T bars, mini bulbs, spotlights, and tubes, as well as auto and truck lamps, and LED universal lights. The company was formerly known as Topower Computer Industrial Co., Ltd. Topower Co., Ltd. was founded in 1986 and is headquartered in Tainan City, Taiwan.",
    "website": "http://www.topower.com.tw",
    "zipcode": "712"
  },
  "3290.TWO": {
    "city": "Taoyuan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Donpon Precision Inc.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "DONPON PRECISION INC",
    "state": null,
    "summary": "Donpon Precision Inc. researches, develops, manufactures, and sells automotive electronic products and plastic precision components in Taiwan and Mainland China. The company is involved in mold design, manufacturing, plastic molding, painting and printing, and assembly and processing of professional OEM electrical equipment. It provides automotive electronic products, such as rear-view camera and mirror, HUD, steering wheel switches, audio panel, auto parts molds, air filters, chargers, and trim products, as well as safety products. The company offers camera, backlight module, headphones, power chargers, and mobile phone accessories; and touch glass products, including auto monitors, and mobile phone, tablet PC, and laptop application products. Donpon Precision Inc. was founded in 1995 and is based in Taoyuan City, Taiwan.",
    "website": "http://www.donpon.com",
    "zipcode": "338"
  },
  "3308.TW": {
    "city": "Taoyuan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Bestec Power Electronics Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "BESTEC POWER ELECTRONICS CO",
    "state": null,
    "summary": "Bestec Power Electronics Co., Ltd. designs, fabricates, markets, and sells switching power supply products worldwide. It provides LED drivers, adapters, open frames, and server/IPC products under the Bestec brand for lighting, medical, ITE, NB and PC, networking, and industrial applications. The company was founded in 1988 and is headquartered in Taoyuan City, Taiwan.",
    "website": "http://www.bestec.com.tw",
    "zipcode": "333"
  },
  "3323.TWO": {
    "city": "Taoyuan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Celxpert Energy Corporation",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "CELXPERT ENERGY CORPORATION",
    "state": null,
    "summary": "Celxpert Energy Corporation produces and sells battery packs in Taiwan. Its products are used in notebook and tablet, network product, smart phone, power tool, E-bike/E-Moto, and energy storage and UPS battery packs. The company was founded in 1997 and is headquartered in Taoyuan, Taiwan.",
    "website": "http://www.celxpert.com.tw",
    "zipcode": "325"
  },
  "3332.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Cincon Electronics Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "CINCON ELECTRONICS CO",
    "state": null,
    "summary": "Cincon Electronics Co., Ltd. designs, manufactures, sells switch mode power conversion products to the communications, computer, industrial, medical, consumer, and lighting markets worldwide. Its products include single and multiple output DC-DC converters from 1W to 750W, single and multiple output AC adapters from 5W to 150W, open frame AC-DC power supplies from 5W to 700W, and LED power supplies from 15W to 150W. The company also provides modified standard and custom power conversion products. In addition, it offers accessories; and operates iDALI, an app for digital lighting control solution. The company was founded in 1991 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.cincon.com",
    "zipcode": null
  },
  "3432.TW": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Tai Twun Enterprise Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "TAI TWUN ENTERPRISE CO LTD",
    "state": null,
    "summary": "Tai Twun Enterprise Co., Ltd. manufactures and sells various components and products. The company offers cooler and heat pipe components; single card, IO, FPC, board, and battery connectors; and other components that are used in NB PC, mobile phone, 3.5G HSDPA, MFP printer, DVD, and LCD TV applications. It also provides consumer electronics products, such as AC USB adaptors, car chargers, and USB card readers. Tai Twun Enterprise Co., Ltd. was founded in 1988 and is headquartered in New Taipei City, Taiwan.",
    "website": "http://www.taitwun.com.tw",
    "zipcode": "23586"
  },
  "3484.TWO": {
    "city": "Taoyuan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Solteam Electronics Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "SOLTEAM ELECTRONICS CO LTD",
    "state": null,
    "summary": "Solteam Electronics Co., Ltd. engages in the design, development, manufacture, and sale of modular parts and components for power tool, home appliance, automotive, medical, and IT industries worldwide. It offers switches, inlets/outlets, adapters, battery holders, controller modules, EV parts, surrounding/other products, aquarium peripherals, optical products, and medical devices. The company was founded in 1992 and is headquartered in Taoyuan, Taiwan.",
    "website": "http://www.solteam.com.tw",
    "zipcode": "33051"
  },
  "3504.TW": {
    "city": "Hsinchu City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Young Optics Inc.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "YOUNG OPTICS INC",
    "state": null,
    "summary": "Young Optics Inc. engages in the research, design, manufacture, and sale of optical components, engines, and modules in Taiwan. The company offers plastic injection molds; machining parts, including metal barrel, spacer, retainer, cam ring, and flange products; components, such as plastic lens, glass molding lens, glass grinding lens, color wheels, glass light tunnels, reflection prisms, color filters, x-plates, mirrors, UVIR, and waveguide products; DLP evaluation modules, and DLP LED and UV engines; machine vision, projection, logo, smart head, ADAS, lidar, endoscope, fixed, and varifocal lens; and monocular HMD products. Young Optics Inc. was founded in 2002 and is based in Hsinchu, Taiwan.",
    "website": "http://www.youngoptics.com",
    "zipcode": "30076"
  },
  "3516.TWO": {
    "city": "Taoyuan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Electrical Equipment & Parts",
    "long_name": "ADO Optronics Corporation",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ADO OPTRONICS CORPROATION",
    "state": null,
    "summary": "ADO Optronics Corporation provides lighting products in Taiwan. It offers commercial lighting, indoor and outdoor LED lighting, and plastic injection products. The company was founded in 1991 and is based in Taoyuan, Taiwan.",
    "website": "http://www.adotek.com.tw",
    "zipcode": "334-55"
  },
  "3537.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Podak Co., LTD.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "PODAK CO LTD",
    "state": null,
    "summary": "Podak Co., LTD. operates as a sales agent in Taiwan and internationally. The company offers active and passive components, such as polymer solid, aluminum electrolytic, plastic, and gold capacitors, as well as variable resistors, inductors, power choke coils, diodes, transistors, chip fuses, integrated circuits, batteries, remote controls, motors, and other products. It also provides car electronic components, Blu-ray storage, power capacitor, smart energy saving, automatic equipment, and CO2 heat pumps, as well as high-definition closed-circuit television, consumer monitoring, and camera module solutions. Podak Co., LTD. was founded in 1987 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.podak.com.tw",
    "zipcode": "104"
  },
  "3550.TW": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Copartner Technology Corporation",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "COPARTNER TECHNOLOGY CORPORATIO",
    "state": null,
    "summary": "Copartner Technology Corporation manufactures and sells cable and wire products for information, communications, and electronics industries worldwide. It offers consumer market cables, including USB, SFP/QSFP, plenum HDMI, and display port cables; and transportation cables comprising vehicle, marine, and aircraft video/audio and control cables. The company also provides industrial cables, such as control, flexible, chain, and robot cables; medical cables consisting of medical equipment, medical auto bed control, auto control system, and non-invasive medical device cables; and green energy cables, including solar tracker and EV cables. In addition, it offers communication cables, such as RG type, AISG, coaxial communication, and LAN cables. The company was formerly known as Cablex Wire & Cable Mfg. Corp. and changed its name to Copartner Technology Corporation in August 2004. Copartner Technology Corporation was founded in 1987 and is headquartered in New Taipei City, Taiwan.",
    "website": "http://www.copartner.com.tw",
    "zipcode": "23511"
  },
  "3628.TWO": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Ablerex Electronics Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "ABLEREX ELECTRONICS CO LTD",
    "state": null,
    "summary": "Ablerex Electronics Co., Ltd. manufactures and sells uninterruptible power supplies (UPS) and power quality devices for use in industrial and informatics applications in Taiwan and internationally. The company offers energy storage systems; photovoltaic devices; UPS products and accessories; modular and standalone active power filters; automatic transfer switches; and battery monitoring systems. It also manufactures and sells solar energy equipment, as well as provides maintenance and technical services. The company was founded in 1994 and is headquartered in New Taipei City, Taiwan.",
    "website": "http://www.ablerex.com.tw",
    "zipcode": "23144"
  },
  "4576.TW": {
    "city": "Taichung",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Hiwin Mikrosystem Corp.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "HIWIN MIKROSYSTEM CORP",
    "state": null,
    "summary": "Hiwin Mikrosystem Corp. researches, develops, manufactures, and sells components, systems, and equipment for linear motion and control system in Taiwan. The company offers controllers and drives, servo and linear actuators, positioning measurement systems, stepping/servo linear motors, linear motor stages, torque motors and rotary tables, direct drive motors, rotary motors, and robots. It provides its products for use in semiconductor, optical component manufacturing, automation, medicare and healthcare, and rehabilitation equipment, as well as transportation applications. The company also sells its products in Germany, Japan, the United States, Italy, Switzerland, the Czech Republic, France, and Israel. Hiwin Mikrosystem Corp. was founded in 1997 and is headquartered in Taichung, Taiwan.",
    "website": "http://www.hiwinmikro.com.tw",
    "zipcode": "40852"
  },
  "5227.TWO": {
    "city": "Taoyuan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Advanced Lithium Electrochemistry (Cayman) Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "ADVANCED LITHIUM ELECTROCHEMIST",
    "state": null,
    "summary": "Advanced Lithium Electrochemistry (Cayman) Co., Ltd. researches, manufactures, and sells lithium iron phosphate Nano co-crystalline olivine materials (LFP-NCO) in China, other Asia countries, Italy, Taiwan, and internationally. The company also offers olivine-type structure lithium battery materials; and manufactures and distributes batteries, and cars and its peripherals. In addition, it manufactures and installs electricity generation, transmission, and distribution machinery. Advanced Lithium Electrochemistry (Cayman) Co., Ltd. was founded in 2007 and is headquartered in Taoyuan City, Taiwan.",
    "website": "http://www.aleees.com",
    "zipcode": "33068"
  },
  "5277.TWO": {
    "city": "Taoyuan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Electrical Equipment & Parts",
    "long_name": "ProLight Opto Technology Corporation",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "ProLight",
    "state": null,
    "summary": "ProLight Opto Technology Corporation engages in the research, development, manufacture, and sale of LED packaging products in Taiwan. The company offers LED products for use in entertainment, architecture, general, automotive, UV, IR, and plant growing lighting applications. The company was founded in 2004 and is based in Taoyuan City, Taiwan.",
    "website": "http://www.prolightopto.com",
    "zipcode": "320"
  },
  "5398.TWO": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Inalways Corporation",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "INALWAYS CORPORATION",
    "state": null,
    "summary": "Inalways Corporation engages in the electronic and power supply components manufacturing, and medical biotechnology businesses in Taiwan and internationally. The company provides IEC connectors, receptacles, power entry modules, wire assemblies, and AC ducks and DC jacks. It also offers prescription and OTC drugs, medical devices, and health supplements. The company was formerly known as Liwei Industrial Co., Ltd and changed its name to Inalways Corporation in July 2017. Inalways Corporation was founded in 1978 and is headquartered in New Taipei City, Taiwan.",
    "website": "http://www.inalways.com.tw",
    "zipcode": "22161"
  },
  "6109.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Atech OEM Inc.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ATECH TECHNOLOGY CO",
    "state": null,
    "summary": "Atech OEM Inc. designs, develops, manufactures, and sells magnetic components, power supply solutions, and wireless devices in Taiwan. It offers magnetic components, including signal and communication transformers, power transformers, and EMC components; power supply solutions, such as power supply units (PSUs), which includes wall-mounts, desktops, interchangeable AC pins, car chargers, PSR, high surge, AC-DC and DC-DC converters, POE power, and ODM products; open frames, telecom power products, and LED drivers; and medical and industrial PSUs; and wireless devices comprising Bluetooth modules, Bluetooth dongles/adapters, and WiFi modules. The company was founded in 1990 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.atechoem.com",
    "zipcode": "10607"
  },
  "6121.TWO": {
    "city": "Hsinchu City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Simplo Technology Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "SIMPLO TECHNOLOGY",
    "state": null,
    "summary": "Simplo Technology Co., Ltd. develops, produces, and sells battery packs worldwide. Its products include LEV power tool battery, handheld tool battery, and electric vehicle battery modules; household energy storage systems; smartphone, tablet, and laptop battery modules; power banks; wearable devices; and power banks, BT speaker, cleaning robots, wearable devices, and vacuum cleaner Li-ion battery modules. The company also provides machine parts, such as plastic moldings, injections/fixtures/films, metal stampings/trays, and die cut/busbar products; AGV products and automation equipment; and lab testing services, as well as power equipment, industrial robot controllers, machine arms, and industrial cameras. It offers its products for household appliances; and mobile devices, LEV, and EV applications, as well as for fit accessories. The company was formerly known as Simplo Company, Ltd. and changed its name to Simplo Technology Co., Ltd. in September 1998. Simplo Technology Co., Ltd. was founded in 1992 and is headquartered in Hsinchu, Taiwan.",
    "website": "http://www.simplo.com.tw",
    "zipcode": "30348"
  },
  "6133.TW": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Golden Bridge Electech Inc.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "GOLDEN BRIDGE ELECTECH INC",
    "state": null,
    "summary": "Golden Bridge Electech Inc. designs, manufactures, assembles, and sells various cable products in Taiwan. The company offers interconnect solutions for automotive electronics, including electrical harness, interior and car body equipment, and interior lighting; and sensors and electronics, such as plugs and inlet to recharge batteries for electric and plug-in hybrid vehicles. It also provides microphones, speakers, headsets, two-way radios, handheld devices, and intercom systems, as well as programming, cloning, and GPS cables. In addition, the company offers cables, cable assemblies, and integrated system solutions for a range of industrial sectors, including factory automation, drive technology, instrumentation, measurement and sensor technology, audio and video, and high temperature. Further, it provides high bandwidth data and termination cables for datacom and telecom markets; Thunderbolt cable, which connects to host systems or devices; various signal/control cables for power systems; and ultrasound transducer probe cables for medical device applications. Golden Bridge Electech Inc. was founded in 1976 and is headquartered in New Taipei City, Taiwan.",
    "website": "http://www.gbe.com.tw",
    "zipcode": null
  },
  "6164.TW": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Ledtech Electronics Corp.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "LEDTECH ELECTRONICS CORP",
    "state": null,
    "summary": "Ledtech Electronics Corp. produces and sells LED lamps and displays in Taiwan and internationally. The company offers PLCC and high power lighting class components; light modules/engines; flexible and rigid light strips; and standard, super bright, super flux, and bi-color lamps, as well as IR/PT lamps and light sensors. It also provides single digit, dual digit, three digit, four digit, alphanumeric, dot matrix, intelligent, light bar, bar array, and SMT displays; top view, chip LED, right angle, and UVA/UVC SMD products, as well as axial LED products with plastic holders; and backlights. The company was founded in 1977 and is headquartered in New Taipei City, Taiwan.",
    "website": "http://www.ledtech.com.tw",
    "zipcode": "231"
  },
  "6282.TW": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "AcBel Polytech Inc.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "ACBEL POLYTECH INC",
    "state": null,
    "summary": "AcBel Polytech Inc. develops, manufactures, and sells power management solutions worldwide. It provides a range of custom design and high quality power supplies ranging from 3W up to 10,000W per power module. The company offers industrial PSUs, adapters, medical PSUs, telecom PSUs, AC DC / DC DC converters, and EV PSU solution. Its products are used in information technology, communication, consumer electronics, networks, and industrial automation applications. The company was formerly known as API Technology Co., Ltd. and changed its name to AcBel Polytech Inc. in 1998. AcBel Polytech Inc. was founded in 1981 and is headquartered in New Taipei City, Taiwan.",
    "website": "http://www.acbel.com",
    "zipcode": "251"
  },
  "6290.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Longwell Company",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "LONGWELL CO",
    "state": null,
    "summary": "Longwell Company, together with its subsidiaries, produces and sells electronic components and cable products in Taiwan, China, the United States, Japan, and internationally. The company offers power cords for various applications, such as computers, telecommunications, consumer electronics, and home appliances; and electronic wires and cables, insulation tubes, and heat-shrinkable tubes for use in computers, home appliances, telecommunications, and other electronics products. It also provides cable assemblies for various market sectors, including computer, communication, and consumer electronic and networking industries; connectors primarily for mobile devices, computers, and GPS; wire, AC, and DC halogen free products; and USB output, desk top, car, and wireless chargers, as well as interchangeable plugs, AC and wall-mount adapters, EV charging units, and mechanical components and plastic parts. In addition, the company offers a range of support services. Longwell Company was founded in 1972 and is headquartered in Taipei City, Taiwan.",
    "website": "http://www.longwell.com",
    "zipcode": "104"
  },
  "6409.TW": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Voltronic Power Technology Corp.",
    "market": "tw_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "VOLTRONIC POWER TECHNOLOGY CORP",
    "state": null,
    "summary": "Voltronic Power Technology Corp. primarily designs, manufactures, markets, introduces, and sells uninterruptible power systems (UPS) in Taiwan and China. The company provides DC, standby, line interactive, and online UPS products; and solar power products, solar inverters, automatic voltage regulators, chargers, and accessories. It also offers ODM design and manufacturing of inverters. The company primarily serves the power market. The company was founded in 2008 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.voltronicpower.com",
    "zipcode": null
  },
  "6412.TW": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Chicony Power Technology Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "CHICONY POWER TECHNOLOGY CO LTD",
    "state": null,
    "summary": "Chicony Power Technology Co., Ltd. develops, manufactures and sells switching power supplies, electronic components, LED lighting modules, and smart building solutions in Asia, the United States, Europe, and internationally. Its power supply products include adapters and power products used in the area of server, storage, telecom, desk-top, gaming, ATM, open frame, and industry power. The company offers LED lamps, tubes, and indoor and outdoor LED luminaires and drivers. It also manufactures and sells transformers and plastic products. The company was founded in 2008 and is headquartered in New Taipei City, Taiwan.",
    "website": "http://www.chiconypower.com",
    "zipcode": "241"
  },
  "6558.TW": {
    "city": "Hsinchu City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Electrical Equipment & Parts",
    "long_name": "SYNergy ScienTech Corp.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "SYNERGY SCIENTECH CORP",
    "state": null,
    "summary": "SYNergy ScienTech Corp. designs, develops, manufactures, and sells rechargeable lithium-ion and lithium-ion polymer batteries in Taiwan and internationally. Its products are used in various portable electronic products, such as Bluetooth headsets, MP3 and DSC products, cellular phones, and notebook computers, as well as other products. SYNergy ScienTech Corp. was founded in 1997 and is headquartered in Hsinchu, Taiwan.",
    "website": "http://www.synst.com.tw",
    "zipcode": "30078"
  },
  "6559.TWO": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Electrical Equipment & Parts",
    "long_name": "High Power Lighting Corp",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "HPL",
    "state": null,
    "summary": "High Power Lighting Corp designs, manufactures, and sells LED chips and related components. Its products include UVA, UVB/UVC, IR, and color products. The company was founded in 2005 and is headquartered in New Taipei City, Taiwan.",
    "website": "http://www.hplighting.com.tw",
    "zipcode": "236"
  },
  "8038.TWO": {
    "city": "Taichung",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Changs Ascending Enterprise Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "CHANGS ASCENDING ENTERPRISE CO ",
    "state": null,
    "summary": "Changs Ascending Enterprise Co., Ltd. engages in the research and development, manufacture, and sale of rechargeable batteries and cell materials in Taiwan. The company offers vehicle batteries, including starter batteries for golf carts, forklifts, and hybrids and E-cars; and electronic storage systems (ESS) and uninterruptible power supply (UPS) systems for use in office and home applications, ESS UPC backup power, off the grid applications, and solar LED lights. It also provides grid and industrial ESS/UPS energy storage and back-up systems for large UPS, micro grid ESS, mission critical UPS, and traffic light back-up applications. The company was formerly known as Changs Enterprise Co., Ltd. and changed its name to Changs Ascending Enterprise Co., Ltd. in July 2000. Changs Ascending Enterprise Co., Ltd. was founded in 1997 and is based in Taichung, Taiwan.",
    "website": "http://www.caec.com.tw",
    "zipcode": "407"
  },
  "APWC": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Asia Pacific Wire & Cable Corporation Limited",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "Asia Pacific Wire",
    "state": null,
    "summary": "Asia Pacific Wire & Cable Corporation Limited, through its subsidiaries, manufactures and distributes telecommunications, power cable, and enameled and electronic wire products in Singapore, Thailand, Australia, the People's Republic of China, and other markets in the Asia Pacific region. The company offers telecommunications cable products, including copper-based and fiber optic cables for telephone and data transmissions; and armored and unarmored low voltage power transmission cable, which is used to transmit electricity to and within commercial and residential buildings, as well as to outdoor installations, such as street lights, traffic signals, and other signs. It also provides enameled wire for use in the assembly of a range of electrical products consisting of oil-filled transformers, refrigerator motors, telephones, radios, televisions, fan motors, air conditioner compressors, and other electric appliances. In addition, the company distributes wire and cable products; and offers project engineering services in the supply, delivery, and installation of power cables, as well as fabrication services for converting raw materials to wire and cable products. It serves government organizations, electric contracting firms, electrical dealers, and wire and cable factories. The company was founded in 1996 and is headquartered in Taipei, Taiwan. Asia Pacific Wire & Cable Corporation Limited is a subsidiary of Pacific Electric Wire & Cable Co., Ltd.",
    "website": "http://www.apwcc.com",
    "zipcode": "106"
  },
  "DLZ.SG": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Asia Pacific Wire & Cable Corporation Limited",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ASIA PACIF.WIRE&CABLE CORP.LTDR",
    "state": null,
    "summary": "Asia Pacific Wire & Cable Corporation Limited, through its subsidiaries, manufactures and distributes telecommunications, power cable, and enameled and electronic wire products in Singapore, Thailand, Australia, the People's Republic of China, and other markets in the Asia Pacific region. The company offers telecommunications cable products, including copper-based and fiber optic cables for telephone and data transmissions; and armored and unarmored low voltage power transmission cable, which is used to transmit electricity to and within commercial and residential buildings, as well as to outdoor installations, such as street lights, traffic signals, and other signs. It also provides enameled wire for use in the assembly of a range of electrical products consisting of oil-filled transformers, refrigerator motors, telephones, radios, televisions, fan motors, air conditioner compressors, and other electric appliances. In addition, the company distributes wire and cable products; and offers project engineering services in the supply, delivery, and installation of power cables, as well as fabrication services for converting raw materials to wire and cable products. It serves government organizations, electric contracting firms, electrical dealers, and wire and cable factories. The company was founded in 1996 and is headquartered in Taipei, Taiwan. Asia Pacific Wire & Cable Corporation Limited is a subsidiary of Pacific Electric Wire & Cable Co., Ltd.",
    "website": "http://www.apwcc.com",
    "zipcode": "106"
  }
}
