{
    "2543.TW": {
        "short_name": "HWANG CHANG GENERAL CONTRACTOR ",
        "long_name": "Hwang Chang General Contractor Co., Ltd",
        "summary": "Hwang Chang General Contractor Co., Ltd engages in construction activities in Taiwan. It undertakes the construction of public work and government contract turnkey, pumping station, baseball stadium, avenue, boulevard, road, highway, sewage treatment plant, underground station, expressway, sub-mountain diversion, and pipeline projects. The company was founded in 1981 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2597.TW": {
        "short_name": "RUENTEX ENGINEERING & CONST. CO",
        "long_name": "Ruentex Engineering & Construction Co., Ltd.",
        "summary": "Ruentex Engineering & Construction Co., Ltd. engages in the civil and architectural construction contracting business in Taiwan and internationally. The company is involved in the design, planning, and construction and project management of various projects, including housings, villas, office buildings, high-tech plants, etc. It also manufactures and sells precast concrete products. The company was founded in 1975 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "5515.TW": {
        "short_name": "CHIEN KUO CONSTRUCTION CO",
        "long_name": "Chien Kuo Construction Co., Ltd.",
        "summary": "Chien Kuo Construction Co., Ltd., together with its subsidiaries, engages in the construction business in Taiwan and China. The company offers construction services for residential buildings, factory and office buildings, public facilities, and commercial buildings; undertakes the related electrical and mechanical engineering of air-conditioning, water and electricity, fire-fighting, intelligent building, etc.; and manages electromechanical projects. It also manufactures and sells commercial concrete; and participates in concrete supply and pumping for construction of roads, bridges, and residential projects. The company is also involved in the procurement, planning, installation, and consultation activities; and provision of cargo handling, international trade, and computer software technology development and consultation services. Chien Kuo Construction Co., Ltd. was founded in 1931 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "5519.TW": {
        "short_name": "LONGDA CONSTRUCTION & DEVELOPME",
        "long_name": "LongDa Construction & Development Corporation",
        "summary": "LongDa Construction & Development Corporation engages in the provision of construction services primarily in Taiwan. It also involves in the real estate development and leasing, and hotel business. The company was founded in 1982 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Kaohsiung"
    },
    "5521.TW": {
        "short_name": "KUNG SING ENGINEERING",
        "long_name": "Kung Sing Engineering Corporation",
        "summary": "Kung Sing Engineering Corporation, together with its subsidiaries, engages in the construction business in Taiwan. Its projects include roads, bridges, tunnels, residential buildings, airports, and railways, as well as marine works. The company was founded in 1941 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "5536.TWO": {
        "short_name": "ACTER GROUP CORPORATION LTD",
        "long_name": "Acter Group Corporation Limited",
        "summary": "Acter Group Corporation Limited provides engineering services in Taiwan, Mainland China, and internationally. It offers construction, design, and maintenance services related to air conditioning, environmental control, clean room set-up, ventilation engineering, and energy technology services. The company also trades in ice water machines and energy storing equipment, as well as offers turnkey services. In addition, it is involved in the wholesale of electronic and chemical equipment; construction and set-up of freezing and electronic equipment, and air conditioners; construction business; design and manufacture of air and liquid containers; and trade of clean rooms and air conditioners. Further, the company provides machinery trading services, as well as acts as an agent for electronic equipment importing and exporting. Additionally, it engages in the design and construction of cleanrooms, electromechanical equipment, and process pipelines for high-tech electronics and biomedical industries. Acter Group Corporation Limited was founded in 1979 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "5547.TWO": {
        "short_name": "Jioushun",
        "long_name": "Jioushun Construction Co., Ltd.",
        "summary": "Jioushun Construction Co., Ltd. engages in the construction of luxury houses. The company was founded in 1993 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "6122.TWO": {
        "short_name": "KING POLYTECHNIC ENGINEERING",
        "long_name": "King Polytechnic Engineering Co., Ltd.",
        "summary": "King Polytechnic Engineering Co., Ltd. operates as an integrated engineering and construction company in Taiwan and internationally. Its services include project planning, design, procurement, construction, commissioning, project management, and turnkey services. The company offers process, civil and structure, piping, equipment, electrical, mechanical, instrument and control, fire protection, and environmental protection work solutions for petrochemical and chemical industries. It also plans, designs, and constructs HVAC systems, cleanrooms, biological cleanrooms, air abatement systems, purified water systems, gas systems, and chemical systems, as well as provides electrical, automatic control, monitoring, fire protection, water supply and drainage, pipeline, air conditioning system, purified water system, gas system, chemical system, and hook-up services for high-tech, microelectronics, electronics, flat panel, semiconductors, optoelectronics, biotechnology, and pharmaceutical industries. In addition, the company offers planning, design, and construction services for various types of infrastructure and public work projects; and constructs green buildings, as well as constructs commercial high-rise buildings, deluxe residential buildings, five-star hotels, luxury recreation villas, and public construction projects. The company was founded in 1982 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "6691.TWO": {
        "short_name": "YANKEY",
        "long_name": "Yankey Engineering Co., Ltd.",
        "summary": "Yankey Engineering Co., Ltd. offers engineering services in Taiwan. Its projects include clean room constant temperature and humidity engineering; HVAC commercial fine air conditioning; and high and low voltage transmission, fire system, process pipeline system, water supply and drainage system, process exhaust system, and monitoring and weak current system installation engineering, as well as green energy technology services. Yankey Engineering Co., Ltd. was founded in 1980 and is headquartered in New Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei"
    },
    "8926.TW": {
        "short_name": "TAIWAN COGENERATION CORP",
        "long_name": "Taiwan Cogeneration Corporation",
        "summary": "Taiwan Cogeneration Corporation, together with its subsidiaries, operates cogeneration plants in Taiwan. The company invests in independent power plants (IPPs), cogeneration plants, and renewable energy power plants utilizing solar, wind, geothermal, and biomass energy. It also offers engineering planning, design, procurement, project development, installation, construction, financing, commissioning, operation, maintenance, and management for IPPs, cogeneration plants, and transmission projects. In addition, the company provides technical support and consulting services for power project investment, project development, construction execution, and power plant operation and maintenance. Taiwan Cogeneration Corporation was founded in 1992 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "8936.TWO": {
        "short_name": "KUO TOONG INTERNATIONAL",
        "long_name": "Kuo Toong International Co., Ltd.",
        "summary": "Kuo Toong International Co., Ltd. designs, produces, and assembles water supply and division pipes in Taiwan. The company offers various concrete products, including prestressed concrete cylinder and non-cylinder pipes, reinforced concrete pipes, reinforced concrete cylinder pipes, concrete pipes for sewerage in jacking method, prestressed beams, precast prestressed concrete culverts, manholes for sewerage, shield-segments, and other concrete products. It also provides ductile iron pipes, DI flexible pipes, connecting closures, and accessories; and various steel pipe items comprising coated steel pipes for water service, polyethylene coated and lined steel pipes, steel pipes by jacking method, steel flexible pipe joints, connecting closures, fittings, and weight-coated offshore pipes. In addition, the company offers services for the design, manufacturing, and construction of water supply and division pipes through no-dig jacking methods; and specific mechanical equipment and plant set up, and operation of seawater desalination, water, and sewage water. Kuo Toong International Co., Ltd. was founded in 1978 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Kaohsiung"
    },
    "9933.TW": {
        "short_name": "CTCI CORP",
        "long_name": "CTCI Corporation",
        "summary": "CTCI Corporation provides engineering, procurement, and construction services in Asia, the Middle East, and the Americas. It offers services, such as project management; feasibility study and front-end engineering design; engineering; procurement; fabrication; construction; commissioning; intelligent solutions; automation and control; intelligent structure jacking and movement; ground freezing; and operations and maintenance services, as well as clean room, mechanical, electrical, and plumbing engineering solutions The company also provides stationery equipment, including pressure vessels; piping pre-fabrication and heat exchangers; pre-fabricated parts of package equipment; and assists with engineering works that comprise basic design, equipment sizing, engineering, and shop drawings; and performs equipment inspection/revamping, plant shut-down inspection, and plant maintenance works. In addition, it offers chemical additives consisting of antifouling agents, anti-polymerization additives, and corrosion inhibitors for petrochemical plants; antifoam, antifouling, additives, and emulsion breaking additives as well as corrosion inhibitors for refinery plants; and heavy metal chelate agents, heavy metal stabilizers, boiler water treatment additives, and active carbon products for incineration plants. Further, the company provides intelligent energy management system, an integrated software that monitors, analyzes, adjusts, and manages energy consumption. It serves hydrocarbon, power, environmental, transportation, and industrial markets. CTCI Corporation was incorporation in 1979 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    }
}