{"2601.TW": {"short_name": "FIRST STEAMSHIP COMPANY LTD", "long_name": "First Steamship Co., Ltd.", "summary": "First Steamship Company, Ltd. operates as a shipping company in Taiwan. The company engages in dry bulk carrier shipping operations that include the transportation of various bulk commodities comprising iron ores, coal, and agricultural products. It is also involved in vessel management operations; and the provision of crewing services, such as crewmember recruitment, selection, and training. The company owns and operates 10 vessels, including 1 Panamax, 2 Handysize, 3 Kansamax, and 4 Supramax vessels with a capacity of approximately 536,424 dead weight tonnage. First Steamship Company, Ltd. was founded in 1963 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Industrials", "industry": "Marine Shipping", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "2605.TW": {"short_name": "SINCERE NAVIGATION CORP", "long_name": "Sincere Navigation Corporation", "summary": "Sincere Navigation Corporation, a shipping transportation company, owns and operates bulk cargo vessels in Taiwan. Its fleet includes dry bulk carriers, tankers, and woodchip carriers. As of December 31, 2019, the company had a fleet of 17 vessels, including 3 very large crude carrier tankers and 14 dry bulk vessels of various tonnages. It serves coal and iron ore miner, steel, energy, and paper industries. The company was founded in 1960 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Industrials", "industry": "Marine Shipping", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "2606.TW": {"short_name": "U-MING MARINE TRANSPORT CORP", "long_name": "U-Ming Marine Transport Corporation", "summary": "U-Ming Marine Transport Corporation, together with its subsidiaries, engages in the marine transportation business worldwide. It owns and manages ships that transport dry bulk cargoes, such as cement, oil, coal, iron ore, and grain products. The company is also involved in trading vessels; and providing agency services, as well as the investment business. It operates 48 vessels with a total deadweight of 6.71 million tons. The company was formerly known as Yue Ming Transportation Co. The company was founded in 1968 and is based in Taipei, Taiwan. U-Ming Marine Transport Corporation is a subsidiary of The Far Eastern Group.", "currency": "TWD", "sector": "Industrials", "industry": "Marine Shipping", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "2609.TW": {"short_name": "YANG MING MARINE TRANSPORT CORP", "long_name": "Yang Ming Marine Transport Corporation", "summary": "Yang Ming Marine Transport Corporation, together with its subsidiaries, provides shipping, repair, and chartering services in Taiwan, North America, South America, Europe, Asia, and internationally. It also purchases and sells ships, containers, and chassis. In addition, the company acts as a property, shipping, forwarding, and inland forwarding agent; and shipping manager. Further, it is involved in the warehouse and terminal operations, as well as the provision of insurance, cargo consolidation, container transportation, stevedoring, and logistics services. Yang Ming Marine Transport Corporation was founded in 1972 and is headquartered in Keelung, Taiwan.", "currency": "TWD", "sector": "Industrials", "industry": "Marine Shipping", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Keelung"}, "2611.TW": {"short_name": "TZE SHIN INTERNATIONAL CO LTD", "long_name": "Tze Shin International Co. Ltd.", "summary": "Tze Shin International Co. Ltd. primarily provides transportation services in Taiwan. The company offers cargo freight, container, truck, and oil transportation services, as well as petrochemical and damage goods transportation services; and bulk logistic services. It also engages in the development, planning, and construction of factories, shopping malls, and residential buildings; and provides ticket sales management services. The company was formerly known as Tze Shin Transportation & Terminal Co.Ltd and changed its name to Tze Shin International Co. Ltd. in July 2002. Tze Shin International was founded in 1973 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Industrials", "industry": "Marine Shipping", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "5608.TW": {"short_name": "SHIH WEI NAVIGATION", "long_name": "Shih Wei Navigation Co., Ltd.", "summary": "Shih Wei Navigation Co., Ltd. operates as a dry cargo shipping company in Taiwan. It engages in the shipping transportation, shipping agency, and ship management and chartering, as well as ship sale and purchase activities. The company trades in various types of bulk cargo, such as steel products, ores, etc., as well as equipment, wooden cargos, wood pulps, general cargos, and logs. The company was founded in 1985 and is based in Taipei, Taiwan.", "currency": "TWD", "sector": "Industrials", "industry": "Marine Shipping", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "8367.TW": {"short_name": "CHIEN SHING HARBOUR SERVICE CO ", "long_name": "Chien Shing Harbour Service Co.,Ltd.", "summary": "Chien Shing Harbour Service Co.,Ltd. provides customs declaration, transportation, warehousing, ship stevedoring, and container terminal services in Taiwan. The company offers customs declaration services, including import and export declarations of general and bonded goods, and project production machinery; customs declarations of triangular trade and entreport trade; export and import declarations of the whole plant equipment; applying letter of tax exemption for import goods duty from industrial development bureau; consultation service of tariff laws and regulations; and consolidation service of bonded warehouse, warehousing, transportation, stevedoring, and container terminals. It also provides transportation services comprising drayage of local and long distance shipments; less than truckload and full truckload; shipments moving from port, warehouse, and factories, as well as arranges local pick-up and delivery shipment integration and shipments through one point for shipping locations; and configured transportation solutions. In addition, the company offers warehousing services, such as general warehouse, warehouse rental, distribution center, bonded warehouse, and outdoor piling field; integration of reforming the goods, processing, packaging change, labeling, etc.; and ship stevedoring services, including warehouse cargo turn-in and out, and longshoring services. Further, it provides container terminal services comprising empty container services, such as cleaning, repairing, and checking services; information of containers and goods movement; accounts receivable collection on behalf of freight ship companies; CFS import and export cargo handling, distribution, and measurement services; pre-cooling, power, and inspection services; customs declaration and transportation arrangement services; and receiving and delivery, crane unloading, storage, inspection, and transfer services. The company was founded in 1976 and is headquartered in Taichung City, Taiwan.", "currency": "TWD", "sector": "Industrials", "industry": "Marine Shipping", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung"}}