{"1517.TW": {"short_name": "LEE CHI ENTERPRISES CO", "long_name": "Leechi Machinery Industry Ltd. Co.", "summary": "Leechi Machinery Industry Ltd. Co. manufactures and sells bicycle components in Taiwan and internationally. Its product portfolio includes disc brakes, brakes and levers, seat posts, stems, handle bars, part accessories, and other products. The company provides its products under the PROMAX brand. The company was formerly known as Leechi Enterprise Co. Ltd. Leechi Machinery Industry Ltd. Co. was founded in 1973 and is headquartered in Changhua City, Taiwan.", "currency": "TWD", "sector": "Industrials", "industry": "Metal Fabrication", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Changhua"}, "2474.TW": {"short_name": "CATCHER TECHNOLOGY", "long_name": "Catcher Technology Co., Ltd.", "summary": "Catcher Technology Co., Ltd., together with its subsidiaries, manufactures and sells aluminum and magnesium extrusions, and stamping products and molds in Taiwan and China. It offers casing, internal components, molds, and thermal modules for electronic products. The company's products include upper case, lower case, keyboard cover, and monitor casings for notebook computers; casings for various server specifications and desktop computers; industrial computer casings and internal parts; and computer accessories, such as plugs and A/V connector casings. The company also produces customized thin and precision-oriented communication application products, such as phones and pad-like products, as well as communication accessories, such as earphones and camera heads; and consumer electronic products, such as digital still cameras, camcorders, MP3 products, and related accessories. In addition, it offers ventilation blades, air-power tools, automobiles, TVs and lightning equipment. Further, the company manufactures, sells, and develops varied metal products; and engages in the trading, leasing, and investing activities. The company was founded in 1984 and is headquartered in Tainan, Taiwan.", "currency": "TWD", "sector": "Industrials", "industry": "Metal Fabrication", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Tainan City"}, "3376.TW": {"short_name": "SHIN ZU SHING CO", "long_name": "Shin Zu Shing Co., Ltd.", "summary": "Shin Zu Shing Co., Ltd. manufactures and sells precision springs, stamped parts, and hinge assemblies in Taiwan. It also provides metal injection molding (MIM) and lathe products. The company offers its products for use in notebook and tablet PCs, LCD monitors, and MIM products, as well as communication, computer, and consumer products. The company was formerly known as Zu Shing Spring and Mechanical Co., Ltd. and changed its name to Shin Zu Shing Co., Ltd. in 1997. Shin Zu Shing Co., Ltd. was founded in 1965 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Industrials", "industry": "Metal Fabrication", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "4912.TW": {"short_name": "LEMTECH HOLDINGS CO LIMITED", "long_name": "Lemtech Holdings Co., Limited", "summary": "Lemtech Holdings Co., Limited manufactures and sells precision metal dies and metal stampings in Asia, Americas, and Europe. The company provides electronic product thermal modules, electronic product components, automotive components and building material components made by stamping and forming, as well as stamping die support for automotive and electronic product manufacturers; and stamping tools, heatsinks and thermal modules, slide rails, precision metal hinges, and mechanical assemblies. It serves automotive, cloud computing, smartphone, medical device, and industrial, as well as computing, consumer, and communication markets. The company was founded in 2003 and is based in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Industrials", "industry": "Metal Fabrication", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "6235.TW": {"short_name": "WAFFER TECHNOLOGY CORP", "long_name": "Waffer Technology Corporation", "summary": "Waffer Technology Corporation manufactures and sells light metal products. The company primarily engages in the provision of light-metal solution of magnesium and aluminum alloy, mold and tooling research and development, magnesium alloy injection and die-casting, CNC, and painting and assembly of vertical integration OEM/ODM processing. Its products include cosmetic and internal parts for notebooks; handheld scanners and mobile phone parts; camera, video cam, projector, and monitoring optical parts; and auto parts, as well as other products, such as wearable, tool, and sports products. The company also manufactures and processes automotive aluminum alloy die-cast tools, 3C product magnesium injection tools, and other light metal die-casting tools, as well as fixtures and gauges. It serves medical, industrial, telecommunications, construction, automotive, sporting goods, aeronautical, transportation, national defense, and other industries. The company was formerly known as Waffer Industrial Company, Limited and changed its name to Waffer Technology Corporation in 2000. Waffer Technology Corporation was founded in 1950 and is headquartered in Taoyuan City, Taiwan.", "currency": "TWD", "sector": "Industrials", "industry": "Metal Fabrication", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}}