{"2390.TW": {"short_name": "EVERSPRING INDUSTRY", "long_name": "Everspring Industry Co., Ltd.", "summary": "Everspring Industry Co., Ltd. produces and sells burglar alarms, surveillance devices, home automation appliances, and security lightings worldwide. The company offers smart home systems and alarm kits; and household control panel, a digital smart panel that utilizes a power line and single network cable to combine various household facilities, including access control, intercom, security, and scene control, as well as value-added services. It also provides household intercom, a touch screen for video communication and digital message transmission, as well as security services. The company was founded in 1980 and is based in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Industrials", "industry": "Security & Protection Services", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "3356.TW": {"short_name": "GEOVISION INC", "long_name": "GeoVision Inc.", "summary": "GeoVision Inc., together with its subsidiaries, operates as a digital and networked video surveillance company worldwide. It offers IP cameras; and surveillance systems, including VMS, NVR, mini, Linux-based standalone, recording server, mobile, and storage systems, as well as accessories, such as remote controls, joysticks, keyboards, and touch displays. The company also provides video management software; access control products, which include software, IP control panels and kits, controllers, readers, and accessories; license plate recognition products, such as IP LPR, DSP LPR, and analog LPR cameras, as well as vehicle management software; decoder boxes and HD video encoders; digital signage products, such as signage players and slim-bezel signage displays; PoE switches, extenders, adapters, and accessories, as well as gigabit PoE switches; and capture cards and IO products. In addition, it offers technical support, specs consultation, RMA, and logistics services. The company provides its products for various fields of industries, such as retail, commercial, government, transportation, hospitals, gaming, and residence through distributors, system integrators, and installers. GeoVision Inc. was founded in 1998 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Industrials", "industry": "Security & Protection Services", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "3454.TW": {"short_name": "VIVOTEK INC", "long_name": "Vivotek Inc.", "summary": "Vivotek Inc. provides security surveillance solutions worldwide. The company develops IP surveillance solutions that comprise network cameras, video servers and receivers, network video recorders, video management software, application software, and power over Ethernet switches, as well as offers cloud services. It also provides accessories comprising mounting kits, enclosures, covers, lens, power supply and box products, cables, joysticks, cabinets, cabinet accessories, storage products, water tanks, illuminators, and connectors. The company sells its products and services through distributors. Vivotek Inc. was founded in 2000 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Industrials", "industry": "Security & Protection Services", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "5484.TW": {"short_name": "EVER FOCUS ELECTRONICS", "long_name": "EverFocus Electronics Corporation", "summary": "EverFocus Electronics Corporation manufactures and sells security equipment worldwide. The company offers Edge Computer, a smart surveillance system that provide real-time surveillance footage and access to traffic and road conditions. It also provides multiple interface camera for industrial computers, including USB, RJ-45, etc. In addition, the company offers mobile app and management software that cover transportation, education, surveillance, retail, and medical health care; and vehicle surveillance products and accessories. EverFocus Electronics Corporation was founded in 1995 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Industrials", "industry": "Security & Protection Services", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "9917.TW": {"short_name": "TAIWAN SECOM CO", "long_name": "Taiwan Secom Co., Ltd.", "summary": "Taiwan Secom Co., Ltd. provides security services in Taiwan. It operates through four segments: Electronic System, Static Guard Service, Cash Delivery Service, and Logistics Service. The company manufactures, processes, and sells security-related equipment and parts, as well as offers corporate and building security guarding services; in-flight catering and related services; and cash delivery, logistic, air cargo transporting, building management, automated teller machine, custom broker, vehicle maintenance, educational and recreational, car parking lot, light controlling system, and technology support services. It also sells electric, telecommunication, fireproof, and other products; produces and sells instant foods; connects police-citizens; retails POS system; and rents automated external defibrillators and mini-storage, as well as rents and sells videos. In addition, the company manufactures and sells digital signage and monitors; wholesales and installs fire safety equipment; and retails and rents medical equipment. Further, it is involved in the provision of international trade, as well as acts as an insurance broker. The company was founded in 1977 and is based in Taipei, Taiwan.", "currency": "TWD", "sector": "Industrials", "industry": "Security & Protection Services", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}}