{
    "1503.TW": {
        "short_name": "SHIHLIN ELEC & ENGINEERING",
        "long_name": "Shihlin Electric & Engineering Corporation",
        "summary": "Shihlin Electric & Engineering Corp. engages in the manufacture and sale of heavy electrical equipment, electrical machinery, electrical automotive equipment, and related parts in Taiwan, Mainland China, Vietnam, and internationally. It operates through Electric Distribution, Automobile Parts, Automation Equipment and Parts, and Others segments. The company offers automobile parts, such as starters, alternators, fuel pumps, wiper systems, fan motors, warm gear motors, clutch motors, exchange position motors, washer systems, ECU products, power window switches, auto rain sensors, and blind-spot warning systems; motorcycle parts, including AC generators, starters, and fuel pumps; and DC motors, which include gear, transaxle, DC, and right angle motors. It also provides breaker switchgear and systems consist of miniature circuit breakers, molded case circuit breakers, air circuit breakers, magnetic contactors/switches, manual motor starters, surge protective devices, and automatic transfer switches; and heavy electric systems, such as power and oil immersed transformers, cast resin transformers, pad and pole mounted transformers, PT/CT products, high voltage switches, capacitors, and switchgears. In addition, the company offers factory automation products, including AC drives, HMI products, AC servo motors and drives, and temperature controllers; and automatic handling systems, as well as digital products. Further, it is involved in the operating, sale, and maintenance of vending machines; manufacture and sale of aluminum alloy die-casting, lathe, cutting, and molding products; import and export trade and agency business; competitive and recreational sports business; and sale and lease of commercial buildings. Shihlin Electric & Engineering Corp. was founded in 1955 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "1504.TW": {
        "short_name": "TECO ELECTRIC & MACHINERY CO",
        "long_name": "TECO Electric & Machinery Co., Ltd.",
        "summary": "TECO Electric & Machinery Co., Ltd. engages in the manufacture, installation, wholesale, and retail of electronic equipment, telecommunication equipment, office equipment, and home appliances worldwide. It offers low, medium, and high voltage motors; system and automation products comprising AC servo driving systems, programmable logic controllers, human-machine interfaces, and robots; electromechanical engineering and power equipment; and household and air conditioning appliances. The company also develops wind turbines, electric cars, and PV power station products; and integrates Internet of Things, and cloud-end products and systems, as well as provides solutions for smart-card applications in various fields. In addition, it manufactures and sells switches, busway and related components, touch-tone phone systems, billing boxes, generators, reducers, electric control products, and air conditioners mechanical equipment; repairs electric appliances; provides business management consulting services; invests in securities; offers fiber optic cables, interconnects, transceivers/media converters, patch cords, and LC connectors and adapters; and constructs commercial buildings. Further, the company offers investment consultancy services for domestic and foreign industrial parks and lands; communication network information technology; science park development; develops and sells software; and provides storage and energy technical services. Additionally, it engages in the real estate business; coil wound motors and hydroelectric power; international trading; commissioned sale of phone and IC cards; production of data storage and processing equipment; provision of various business documents management, printing, and other mail services; services related to information software, data processing, and electronic information supply; and import, sale, and lease of franking machines. The company was founded in 1956 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "1507.TW": {
        "short_name": "YUNG TAY ENGINEERING",
        "long_name": "Yungtay Engineering Co., Ltd.",
        "summary": "Yungtay Engineering Co., Ltd., together with its subsidiaries, engages in the design, construction, sale, installation, repair, and maintenance of elevators, escalators, food delivery machines, central air conditioning units, and elevator motors in Taiwan and internationally. The company offers passenger, high speed, villa, machine room less, observation, medical and freight elevators, and escalators and automatic sidewalks. It is also involved in the real estate rental business. The company was founded in 1966 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "1513.TW": {
        "short_name": "CHUNG HSIN ELECTRIC & MACHINERY",
        "long_name": "Chung-Hsin Electric and Machinery Manufacturing Corp.",
        "summary": "Chung-Hsin Electric and Machinery Manufacturing Corp. manufactures and sells electric motors and generators in Taiwan and internationally. It operates through Electricity power, Engineering, and Service segments. It offers gas insulated switchgears, gas circuit breakers, gas insulated transmission lines and combined switchgears, fuse cutouts, load break switchgears, and low voltage switchgears; electro-mechanical, electronic single phase, and polyphase meters; and equipment for the monitoring and control of the electric facilities at power plants, wind farms, transformer stations, and distribution feeders. The company also provides precision air-conditionings for computer rooms, blowers for chiller systems, and chiller machines; alternators and diesel-electric engine sets; diesel generators; backup power fuel, cell systems; micro-grid systems; machine tool products; and precision machines for fabrication and welding, sheet metal works, surface treating, and inspection and test. In addition, it offers GIS/GCB welding tanks and enclosures, GIS/GCB aluminum casting tanks and enclosures, GIL enclosures, GIS/GCB aluminum conductors, stainless steel and aluminum vacuum chambers, and machining services and customer made parts; gas insulated transformer neutral grounding of disconnecting switch systems; DC power switchgears and neutral grounding resistors for transformers; and casting aluminum alloy conductors and pressure vessels for high-voltage GCB and ABS. Further, the company undertakes contracts for power generation and substation projects; constructs automatic parking facilities; and sells and rents residence and building properties. Additionally, it provides engineering, urban regeneration, energy management, and parking management services. The company was formerly known as Chung-Hsin Electric Factory and changed its name to Chung-Hsin Electric and Machinery Manufacturing Corp. in 1962. The company was founded in 1956 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "1514.TW": {
        "short_name": "ALLIS ELECTRIC",
        "long_name": "Allis Electric Co.,Ltd.",
        "summary": "Allis Electric Co.,Ltd. produces and sells transformers, switching devices, and electronic products worldwide. The company offers uninterruptible power supply products for computers, network servers, data centers, telecommunication products, semiconductor manufacturing products, and petrochemical equipment; switching mode rectifiers and parallel inverters for telecom application; solar products; and DC power supply and battery chargers, which provide DC power equipment used in telephone exchanges, satellite base-stations, microwave links, rural telecommunications, railway switching controls, and switchgears. It also provides transmission and distribution pole line hardware and apparatus, such as switches, and transmission and distribution pole line hardware products; high-voltage metal-clad switchgears, gas-insulated switchgears, high and low voltage switchgears, motor control centers, control panels, and distribution panels; and oil-immersed, cast resin, dry type, amorphous core, and cast resin potential and current transformers. In addition, the company engages in the planning, design, installation, testing, operating manual, training, and after service on power station monitoring, as well as planning, managing, and servicing to procure, supply, and install electrical, mechanical, air-conditioning, environmental, and water drainage equipment and system projects. Its products are used in IT, telecommunication, industrial, wireless, utility, and supervisory control and data acquisition applications. The company was founded in 1968 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "1515.TW": {
        "short_name": "REXON INDUSTRIAL",
        "long_name": "Rexon Industrial Corp.,Ltd",
        "summary": "Rexon Industrial Corp.,Ltd designs, manufactures, and sells bench power tools in the United States, Canada, Europe, Japan, and other Asian markets. The company offers power tools, including sawing, drilling, demolishing, grinding, polishing/sanding, cutting, planning/routing, and other products. It also provides fitness equipment, such as treadmills, as well as offers after sale services. The company was formerly known as KuoHsing Machinery Ltd. and changed its name to Rexon Industrial Corp.,Ltd in 1976. The company was founded in 1972 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "1528.TW": {
        "short_name": "ANDERSON INDUSTRIAL CORP",
        "long_name": "Anderson Industrial Corporation",
        "summary": "Anderson Industrial Corporation designs, manufactures, and sells computer numerical control (CNC) machineries in Germany, Taiwan, China, the United States, Australia, Brazil, Thailand, and internationally. It provides single and multi-spindle circuit boards; and spindles for use in milling, engraving, mold processing, 3C glass panel processing, high-speed grinding, PCB industry, and advanced materials processing applications. The company also offers CNC routers, MONFORTS, metal cutting machines, PCB routing and tool grinding machines, CNC Akut-series, CNC Laskut-series, and print and graphic machines for aerospace, automotive, composites material, marine, railway, wood, metal processing, and other industries. In addition, it provides tooling products, precision and electronic machineries, lumber and wood panels, building materials, and plates and other products. The company also imports and exports its products. Anderson Industrial Corporation was founded in 1972 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "1530.TW": {
        "short_name": "AWEA MECHANTRONIC CO",
        "long_name": "Awea mechantronic co.,ltd",
        "summary": "Awea mechantronic co.,ltd researches, designs, manufactures, assembles, tests, monitors, sells, and services various CNC machines in Taiwan and internationally. It offers vertical, production bridge, high-speed bridge, 5-face bridge, horizontal, and 5-axis milling, as well as horizontal boring machines; and tapping and automation products. The company was founded in 1986 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "1531.TW": {
        "short_name": "KAULIN MANUFACTURING",
        "long_name": "Kaulin Mfg. Co., Ltd.",
        "summary": "Kaulin Mfg. Co., Ltd. develops, manufactures, and sells industrial sewing machines in Taiwan and internationally. The company's products include overlock; interlock; mulit-needle double chainstich; lockstitch; electric button holing; button sewing/bar-tracking; flatseamer; bandknife cutting; single thread chain-stitch button attaching; feed-off-the arm double chain stitch; cloth cutting; portable bag closer; zig-zag stitching; single, two, and three needle chainstitch; and other machines, as well as automatic sewing machines. Its machines are used in stitching various products, such as knitwear, jeans, and sportswear. The company was founded in 1965 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "1539.TW": {
        "short_name": "CHIU TING MACHINERY CO",
        "long_name": "Chiu Ting Machinery Co., Ltd.",
        "summary": "Chiu Ting Machinery Co., Ltd. designs, manufactures, and sells bench top and stationery woodworking machinery worldwide. It offers table saw, parallelogram jointer, and snipe planer series products. The company sells its products to importers, distributors, and retailers. Chiu Ting Machinery Co., Ltd. was founded in 1980 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "1540.TW": {
        "short_name": "ROUNDTOP MACHINERY INDUSTRY",
        "long_name": "Roundtop Machinery Industries Co., Ltd.",
        "summary": "Roundtop Machinery Industries Co., Ltd. designs and manufactures machine tools in Taiwan and internationally. The company provides vertical machining, high speed horizontal/vertical and horizontal machining, horizontal boring and milling, double column multi-axis/5-face machining, double column fixed/moving multi-axis/5-face machining, turning, and gantry type machining centers. It also offers slant-bed CNC super lathes; flat-bed CNC lathes and CNC screw cutting machines; and order-made machines. The company was founded in 1979 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "1560.TW": {
        "short_name": "KINIK CO",
        "long_name": "Kinik Company",
        "summary": "Kinik Company produces and sells various abrasives, cutting tools, and reclaimed wafers in Taiwan and internationally. The company offers various conventional grinding wheels, diamond/CBN grinding wheels, DLC coatings, reclaimed wafers, porous ceramic chuck tables, CMP diamond disks, ultra precision machining tools, dicing blades, diamond rollers, wafer grinding wheels, diamond and CBN honey comb wheels, and anti-slip type vacuum chucks. Kinik Company was founded in 1953 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "1580.TWO": {
        "short_name": "SINMAG EQUIPMENT CORPORATION",
        "long_name": "Sinmag Equipment Corporation",
        "summary": "Sinmag Equipment Corporation engages in the manufacture, retail, and wholesale of baking and food service equipment. The company offers bakery equipment, including spiral mixers, divider rounders, moulders, make up lines, sheeters, proofers, cake machines, planetary mixers, deck ovens, proofers, convection ovens, rack and tunnel ovens, slicers, refrigerators, workbenches, food service equipment, and others. It also provides kitchen equipment comprising pizza equipment, combi oven/convection oven/steamer, rotisseries, fryers, Chinese/western kitchen equipment, meat processing and refrigeration equipment, dishwashers, stainless steel sinks and tubes, and showcases. The company sells its products in Taiwan, China, the United States, and internationally. Sinmag Equipment Corporation was founded in 1983 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "1583.TW": {
        "short_name": "GOODWAY MACHINE CORP.",
        "long_name": "Goodway Machine Corp.",
        "summary": "Goodway Machine Corp. develops, manufactures, and sells turning machines. It provides multi-axis turning, vertical turning, horizontal turning, swiss turning, and wheel turning products; grinders; and automation turning products, including bar feeders, gantry loading systems, loading and unloading systems, parts catchers and probes, tool presenters, and steady rests. The company offers its products through a network of dealers in Asia, the Americas, Africa, Europe, and Oceania. Goodway Machine Corp. was founded in 1975 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "1590.TW": {
        "short_name": "AIRTAC INTERNATIONAL GROUP",
        "long_name": "AirTAC International Group",
        "summary": "AirTAC International Group, through its subsidiaries, manufactures and supplies pneumatic equipment worldwide. The company offers standard, miniature, compact/ultracompact, multi-mounting, twin- and tri-rod, slide table, rodless, rotary table, twist clamp, clamp, unclamping, and stopper cylinders, as well as air grippers and accessories. It also provides solenoid, air, manual control, mechanical control and other, and fluid control valves; air preparation units, including F.R.L. combination, FR.L. combination, filter and regulator, filter, regulator, lubricator, soft star-up and safe on-off valve, air distribution block, drain, and pressure gauge units. In addition, the company offers accessories, such as shock absorbers, polyurethane tubings, fittings, silencers, and speed controllers; and standard digital pressure switches. Further, it provides HRBS blade swing cylinders, HFKP dust-proof pneumatic fingers, DSC cylinders, stainless mini cylinders, diaphragm cylinders; and proportional solenoid, 6D integrated, 6V400/600 solenoid, 2WA valves. Additionally, the company offers shut-off, slow open, assembled pressure regulator, quick drain, shuttle, and double pressure valves; DPH analog output digital display switches, DPS digital display air pressure switches, DPHF acid and alkali resistant digital display switches, DPSW/DPHW waterproof digital display switches, and strong magnetic sensors; standard linear guideway, LSD ball screws, dust-proof standard linear guideway, and LRW wide micro linear guideway; belt driven linear slider, screw slider, and linear module actuators; stepping and servo motors; and B60 clean products and air indicators. Its products are used in automotive, machinery manufacturing, metallurgy, electronics, environmental protection, lighting and textile, ceramics, medical equipment, food, and packaging automatic industrial fields. The company was founded in 1988 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2070.TWO": {
        "short_name": "CHING CHAN OPTICAL TECHNOLOGY C",
        "long_name": "Ching Chan Optical Technology Co., Ltd.",
        "summary": "Ching Chan Optical Technology Co., Ltd. manufactures fastener equipment worldwide. The company offers sorter machines for screw/bolt, nut/washer, rod/stud, and eddy current series; second hand machines; and accessories for sorting machines. It also provides screw and bolt making machines, including standard and long stroke bolt, bolt parts, and high performance formers; process monitoring products; automated guided vehicle systems comprising warehouse and transferring robots; and intellectual automation production integration. Ching Chan Optical Technology Co., Ltd. was founded in 1992 and is headquartered in Kaohsiung City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Kaohsiung"
    },
    "2233.TW": {
        "short_name": "TURVO INTERNATIONAL CO LTD",
        "long_name": "TURVO International Co., Ltd.",
        "summary": "TURVO International Co., Ltd. provides modular solutions in the machining industry in Taiwan and internationally. The company primarily offers precision parts for industrial use. It also provides professional metal processing services, including machining, automation integration, heat treatment, and forging. The company's products have application in auto parts, such as engine common rail parts, variable timing system parts, suspension system parts, and other parts; medical parts comprising insulin syringe parts; bike hubs, shock absorber, etc.; industrial components that include various industrial use sleeves, connecting rings, compressor parts, etc.; and optical lens, which comprise connecting rings and cum to lens applications. TURVO International Co., Ltd. was founded in 1987 and is based in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "2421.TW": {
        "short_name": "SUNONWEALTH ELECTRIC MACHINE IN",
        "long_name": "Sunonwealth Electric Machine Industry Co., Ltd.",
        "summary": "Sunonwealth Electric Machine Industry Co., Ltd., together with its subsidiaries, manufactures and sells precision motors, mini fans, and thermal modules worldwide. The company offers DC fans and blowers, AC and EC fans, mini fans and blowers, cooling modules, and ventilation fans, as well as fan accessories, such as metal finger guards, plastic guards, metal filter guards, plastic filter guards, and AC cords under the SUNON brand. It serves clients operating in the IT, automobile electronic, optical electronic, and network communication industries. The company was incorporated in 1980 and is headquartered in Kaohsiung City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Kaohsiung"
    },
    "2464.TW": {
        "short_name": "MIRLE AUTOMATION",
        "long_name": "Mirle Automation Corporation",
        "summary": "Mirle Automation Corporation manufactures and sells automation system integrators and related products. It offers automated equipment for clean room FPD transporter and material-handling, such as CF in-line C/V systems, LCD/LCM auto packing/palletizing systems, clean room stockers, burr checkers, bonders, LD/ULD and CSLD products, dense packing/unpacking systems, in-line aging systems, and equipment for clean room robot applications; and robotic application systems for general, optronic, and semiconductor industries. The company also provides IT products, including IBM systems, servers, bladecenters, and storage and system networking products, as well as POS products; storage management, enterprise asset management, virtualization infrastructure, security, and AS/RS system solutions; and IT services comprising virtual desktop infrastructure, Oracle DB technical support, server and Linux integration and virtualization, warranty maintenance, virtualized storage management, enterprise project management, and enterprise private cloud management services. In addition, it offers servo drivers, injection molding controllers, and air condition system controllers, as well as controllers for various industries; and clean room automatic and general environmental material handling systems, and ancillary systems. Further, the company provides special purpose equipment, such as optical glass molding presses, liquid management auto samplers, and food industry machinery. It serves the FPD, semiconductor, automobile, IT, machinery, food, solar cell, LED, and touch panel industries. Mirle Automation Corporation was founded in 1989 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "3167.TW": {
        "short_name": "TALIANG TECHNOLOGY CO",
        "long_name": "Taliang Technology Co., Ltd.",
        "summary": "Taliang Technology Co., Ltd. designs, develops, manufactures, and sells semiconductor inspection, resin panel cutters, and CNC engraving and milling machines in Taiwan. It provides optoelectronics, including glass panel processing machinery for touch panel, cover glass, sensor glass, or one glass processing applications; automatic edge coating machines; and PCB routing and drilling machines. The company also offers semiconductor inspection solution comprising FVI for carrier tape inspection; IR reel, semi-auto IR, and IR wafer for sidewall chipping around the die inspection; PRIM HBM for HBM chip type in reel inspection; wafer map that replaces human eye inspection of map; and testing handler for QFN/DFN/SOT/SOP IC inspection and packaging. The company was founded in 1980 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "3219.TWO": {
        "short_name": "AETHERTEK TECHNOLOGY CO LTD",
        "long_name": "Aethertek technology co., Ltd",
        "summary": "Aethertek technology co. Ltd designs, manufactures, and sells automation machinery related equipment in Taiwan. The company was formerly known as Service & Quality Group Co., Ltd. Aethertek technology co. Ltd was founded in 1992 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "3402.TWO": {
        "short_name": "WHOLETECH SYSTEM HITECH LIMITED",
        "long_name": "Wholetech System Hitech Limited",
        "summary": "Wholetech System Hitech Limited provides turnkey and system integration services in Taiwan. It offers bulk gas, specialty gas supply, hookup turnkey and consultant, and gas hook-up systems; clean room, MEP, process exhaust, pure water treatment, fire, and cooling systems; and vacuum piping systems, vacuum piping fittings, vacuum ball valves, and deposit improvement engineering services. The company also provides gas cabinets and racks, and VMP/P systems; monitoring hardware and software, such as GIS, HPM, FMCS, and heating jackets; scrubbers; and automation engineering software, custom application software, and mobile IoT smart facility management system. In addition, it provides wet process equipment and chemical supply systems comprising semiconductor, LED, solar energy, and LCD panels. The company was formerly known as Wholetech Engineering Co., Ltd. and changed its name to Wholetech System Hitech Limited in 2001. Wholetech System Hitech Limited was founded in 1990 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "3485.TWO": {
        "short_name": "EF",
        "long_name": "Eclat Forever Machinery Co., Ltd.",
        "summary": "Eclat Forever Machinery Co., Ltd. engages in the research, development, and production of production equipment for touch panels, liquid crystal displays, plasma display panels, printed circuit boards, and other related equipment in Taiwan and internationally. It offers display production equipment, including touch panel solutions, cleaning equipment, development equipment, and etching and stripping equipment; automated logistics equipment consisting of substrate automated equipment and automated coating solutions; automated glass and film roll-to roll unwinding and rewinding equipment, as well as film-tearing laminating equipment; and exposure equipment, such as UV LED automatic and semi-automatic exposure machines. The company was founded in 1994 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "3498.TWO": {
        "short_name": "USUN TECHNOLOGY CO LTD",
        "long_name": "Usun Technology Co., Ltd.",
        "summary": "Usun Technology Co., Ltd. engages in the flat panel display, customization equipment, intelligent manufacturing system integration, and PCB/FPC industrial automation businesses in Taiwan. It provides dense unpackers; automated handling systems; tap cleaners; polarizers/E papers/OCA/LOCA laminators; PR/OC/PI slit coaters; and LCM+B/L module auto assembly lines. The company also offers mask production equipment, timber industry equipment, de-mura+gamma turing automatic detection equipment, laser scanning system, AVI materials loading and unloading machine, goods retrieval equipment, open cap and remove film machine, auto laminators, automatic sole edge grinding machines, lithium battery production equipment, and LENS mounts. In addition, it provides pallet based automatic storage systems, bin storage systems, warehousing management systems, and sorting systems; and PCB and CCL auto assembly systems, laminated steel auto cleaners, and CCL auto testing and cutting systems, as well as article holders. Usun Technology Co., Ltd. was founded in 1981 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "3580.TWO": {
        "short_name": "UVAT TECHNOLOGY CO LTD.",
        "long_name": "UVAT Technology Co., Ltd.",
        "summary": "UVAT Technology Co., Ltd. engages in the design and development of physical vapor deposition equipment and coating machines in Taiwan and internationally. The company offers sputtering equipment for use in touch panel, solar cells, LED, biotechnology, semiconductor, surface decoration coating, functional coating, and plasma treatment fields. The company also provides OEM coating services comprising appearance coatings, such as surface decorative coating, non conductive vacuum metallization/NMVM, color coating, and optical coating; and functional film coatings, including electromagnetic interference coating, anti-reflective coating, AF/AS coating, IC carrier, heat dissipating substrates, and barrier layer, as well as offers coating services for the LED industry. In addition, it provides coating services for touch screen industry consisting of indium-tin-oxide and touch module circuits; and biotechnology industry, including bio sensors, as well as offers other anti-finger print film coating services. UVAT Technology Co., Ltd. was founded in 2002 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "4431.TWO": {
        "short_name": "Mytrex",
        "long_name": "Mytrex Health Technologies, Inc.",
        "summary": "Mytrex Health Technologies, Inc. designs, develops, manufactures, and sells non-woven materials and special medical supplies in Taiwan and internationally. It provides electrostatic filtration materials for medical and industrial mask media, and other filtration applications; and composite nonwoven products for coolant and air filter, vacuum filter bag, HEPA and cabin filter, water filtration compound material applications. The company also offers thermal insulation products for glove, sock, shoe, hat, clothing material, and mask insulation material applications; and linen laundry and leasing, logistic, and medical supplies for hospitals. Mytrex Health Technologies, Inc. was founded in 1990 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "4506.TWO": {
        "short_name": "GOLDEN FRIENDS CO",
        "long_name": "Golden Friends Corporation",
        "summary": "Golden Friends Corporation, together with its subsidiaries, manufactures and sells elevators, escalators, and generators in Taiwan. It operates in three segments: Sales, Maintenance, and GFC Shanghai. The company offers passenger, high speed, and home elevators, as well as escalators/moving walks and pneumatic vacuum elevators. It is also involved in sale and manufacture of elevators and parts; sale of vacuum pneumatic shuttle; and sale and installation of diesel generators. The company's products are used in offices and factories, shopping malls, hotels, mansions, hospitals, public constructions, and institutes projects. Golden Friends Corporation was founded in 1974 and is headquartered in Taipei, Taiwan. Golden Friends Corporation is a subsidiary of Changjiang Property Co., Ltd.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "4510.TWO": {
        "short_name": "KAO FONG MACHINERY CO",
        "long_name": "Kao Fong Machinery Co., Ltd",
        "summary": "Kao Fong Machinery Co., Ltd operates in the mold processing industry in Taiwan and internationally. It offers double column, vertical, horizontal, high speed double column, moving cross rail double column, and gantry machining centers, as well as drilling and tapping machining centers. The company was formerly known as Kao Fong Iron Factory and changed its name to Kao Fong Machinery Co., Ltd. in 1972. Kao Fong Machinery Co., Ltd was founded in 1968 and is based in Taichung, Taiwan. Kao Fong Machinery Co., Ltd is a subsidiary of Hota Industrial Mfg. Co., Ltd.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "4526.TW": {
        "short_name": "TONG-TAI MACHINE TOOL CO",
        "long_name": "Tongtai Machine & Tool Co., Ltd.",
        "summary": "Tongtai Machine & Tool Co., Ltd. manufactures and sells machines worldwide. The company offers machine tools, such as vertical machining, 5-axis machining, tapping, horizontal machining, 5-axis horizontal machining, multi-tasking turning, and ultrasonic assisted machining centers, as well as boring and milling machines, horizontal and vertical CNC lathes, and wheel machines; and PCB machines, including drilling and routing machines. It also provides laser drilling and marking machines; and additive manufacturing machines consisting of metal powder direct energy deposition and subtractive manufacturing, metal powder bed fusion, and sand binder jetting machines. The company was founded in 1969 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Kaohsiung"
    },
    "4532.TW": {
        "short_name": "RECHI PRECISION",
        "long_name": "Rechi Precision Co., Ltd.",
        "summary": "Rechi Precision Co., Ltd. develops, produces, and sells compressors in Taiwan and internationally. It offers inverter and constant-speed rotary compressors; BLDC motors; inverter controllers; and heat pump water heaters. The company was founded in 1989 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "4533.TWO": {
        "short_name": "SHIEH YIH MACHINERY INDUSTRY CO",
        "long_name": "Shieh Yih Machinery Industry Co., Ltd.",
        "summary": "Shieh Yih Machinery Industry Co., Ltd. manufactures and sells mechanical press equipment. The company offers automation press production line solutions; servo presses; straight side mechanical presses; link mechanical presses; special application presses; and C frame and solid frame mechanical presses. It serves clients in Europe, the United States, Thailand, and Mexico. The company was formerly known as Shieh Yih Chuang Ironworks Co. and changed its name to Shieh Yih Machinery Industry Co., Ltd. in 1982. Shieh Yih Machinery Industry Co., Ltd. was founded in 1962 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "4537.TWO": {
        "short_name": "STMC",
        "long_name": "Shuz Tung Machinery Industrial Co., Ltd.",
        "summary": "Shuz Tung Machinery Industrial Co., Ltd. manufactures and sells machinery and automation equipment in Taiwan and China. The company provides pipe/tube benders, such as auto, semi-auto, and special customer pipe benders; bicycle manufacture equipment, which include pre-preparations, fork preparations, front fork processes, frame assembling's, wheel/rim makings, bike assembling's, EN testers, handlebar processes, and fixtures; and end forming machinery, such as pipe shape forming, pipe end forming, and pipe end processing machines. It also offers auto integration that include intelligent welding robots, ATV welding robot sets, intelligent handling robots, auto saddle products, and laser cuttings; hydroforming OEM for application in bicycle, gardening, lighting, transportation, and bath industries; laser welding solution; and 3D laser cutting machine. Shuz Tung Machinery Industrial Co., Ltd. was founded in 1978 and is based in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung City"
    },
    "4563.TWO": {
        "short_name": "QUASER MACHINE TOOLS INC",
        "long_name": "Quaser Machine Tools, Inc.",
        "summary": "Quaser Machine Tools, Inc. manufactures and sells machine tools in Europe, Asia, North America, South America, Africa, and Oceania. It offers vertical, 5-axis mill-turn, pallet, horizontal, and multi face 5 axes M/C machine tools, as well as FMC series products. The company was founded in 1991 and is based in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung City"
    },
    "4566.TW": {
        "short_name": "GLOBALTEK FABRICATION CO LTD",
        "long_name": "GLOBAL TEK FABRICATION CO., Ltd.",
        "summary": "GLOBAL TEK FABRICATION CO., Ltd. manufactures and sells precision parts and subassemblies. It offers products for manufacturers of airbag inflators, steering systems, engines renovation systems, EGRs, turbochargers, DCTs, belt tension systems, assembly cam shaft systems, AEBs, ELSDs, transmission system components, etc., as well as jack heads, oil servers, and heat exchange systems. The company also provides products for use in various industrial applications, including industrial instrumentation, wafer fab equipment, bicycles, and aviation industry. It operates in Asia, the United States, Europe, Canada, Mexico, South America, Brazil, and internationally. The company was founded in 2000 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "4568.TWO": {
        "short_name": "KOGE MICRO TECH CO LTD",
        "long_name": "Koge Micro Tech Co., Ltd.",
        "summary": "Koge Micro Tech Co., Ltd. designs, produces, and sells various precision pumps and valves worldwide. The company offers air, vacuum, water, gear, and electromagnetic pumps; and one, two, and three-way, as well as combined and linearÂ\u0096type solenoid valves. It also provides rotary diaphragm, diaphragm, air linear, piezoelectric, and centrifugal pumps. In addition, the company offers OEM/ODM services. Its products are used in fuel cell, energy and environment, environmental monitoring, detection analysis, medical devices, automotive products, healthcare equipment, beauty care apparatus, and household appliance fields. Koge Micro Tech Co., Ltd. was founded in 1978 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "4572.TW": {
        "short_name": "DREWLOONG PRECISION INC",
        "long_name": "Drewloong Precision, Inc.",
        "summary": "Drewloong Precision, Inc. produces and sells aero structural and engine parts, landing gear parts, and special tools to aircraft manufacturers. The company was founded in 1990 and is headquartered in Kaohsiung City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Kaohsiung"
    },
    "4575.TWO": {
        "short_name": "CHUMPOWER",
        "long_name": "Chumpower Machinery Corporation",
        "summary": "Chumpower Machinery Corp. manufactures PET blow molding molding machines in Taiwan and internationally. The company's products are used in various application, such as mineral water, carbonated beverages, seasonings, tea, fruit juice, distilled water, alcoholic beverages, cooking oil, cleaning agents, cosmetics, fizzy drinks, cosmetic cleanser, detergents, tennis ball cans, medicine bottles, heat-resisting bottles etc. The company was founded in 1981 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "4577.TWO": {
        "short_name": "Ofuna",
        "long_name": "Ofuna Technology Co., Ltd.",
        "summary": "Ofuna Technology Co., Ltd. manufactures and distributes industrial machinery and equipment in Taiwan. It produces drilling machines, routing machines, and spindles. The company was founded in 1991 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "4578.TWO": {
        "short_name": "Sogotec",
        "long_name": "Sogotec Precision Co., Ltd.",
        "summary": "Sogotec Precision Co., Ltd. develops and manufactures CNC machines in Taiwan. It offers printed circuit board (PCB) routing machines, PCB drilling machines, laser application machines, and automation machines. The company was founded in 1990 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei City"
    },
    "4580.TWO": {
        "short_name": "VALUE VALVES CO LTD",
        "long_name": "Value Valves Co., Ltd.",
        "summary": "Value Valves Co., Ltd. engages in the research, development, design, manufacture, inspection, and marketing of valves in Taiwan. The company offers butterfly, check, damper, ball, globe, gate, and customized valves. Its products are used in petroleum and petrochemical products, steel, shipbuilding, energy, water treatment, paper, air-conditioning, electronic, and other industrial fields. The company was founded in 1980 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6125.TWO": {
        "short_name": "KENMEC MECHANICAL ENGINEERING",
        "long_name": "Kenmec Mechanical Engineering Co., Ltd.",
        "summary": "Kenmec Mechanical Engineering Co., Ltd. engages in the planning, design, manufacturing, and sale of logistics centers and intelligent automation integration services in Taiwan. It offers storage equipment, automated packaging equipment, logistic center, material handling equipment systems, automated agriculture/farming equipment, lithium batteries, and heat conduction/heat dissipation equipment. The company was formerly known as Guang Yun Machinery Engineering Co., Ltd. and changed its name to Kenmec Mechanical Engineering Co., Ltd. in March 1987. Kenmec Mechanical Engineering Co., Ltd. was founded in 1976 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei City"
    },
    "6208.TWO": {
        "short_name": "HIGHLIGHT TECH CORP",
        "long_name": "Highlight Tech Corp.",
        "summary": "Highlight Tech Corp. designs, manufactures, and sells integrated vacuum coating chamber solutions for original equipment manufacturers worldwide. It offers cylindrical, box, D shape, spherical, polygon, bell jar, large, and aluminum vacuum chambers, as well as vacuum modules and systems; vacuum chamber kits; ultra-high vacuum chambers; and vacuum valves, such as vacuum poppet valves, aluminum alloy angle valves, vacuum gate valves, vacuum butterfly valves, rectangular gate valves, pendulum valves, teflon coating vacuum valves, vacuum ball valves, vacuum check valves, vent valves, metal valves, and vacuum valve kits. The company also provides vacuum components, including elbows-tees-crosses, vacuum flanges, teflon bellows, hydroformed vacuum bellows, centering rings, vacuum clamps, adaptor fittings, vacuum viewports, vacuum feedthroughs, and vacuum accessories, as well as KF, ISO, and CF components; and vacuum pumps comprising edwards turbomolecular pumps, scroll and refurbished vacuum pumps, and Ebara dry pump repair kits. In addition, it offers sanitary fittings comprising ferrule blanks, fittings, gaskets, clamps, and adaptors, as well as sanitary valves; perfluoroelastomer O'rings; IC dispensing machines; and centrifugal vacuum mixers. Further, the company provides vacuum pump and valves overhaul services; and refurbished vacuum pump services. Highlight Tech Corp. was founded in 1997 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Tainan City"
    },
    "6215.TW": {
        "short_name": "AUROTEK CORP",
        "long_name": "Aurotek Corporation",
        "summary": "Aurotek Corporation, together with its subsidiaries, manufactures and sells automation and robotic components under the Aurotek brand in Japan, rest of Asia, Europe, and the United States. Its products include automation and robotics components, such as motors, reducers, sensors, PLC controllers, couplings, ball screws, linear axis actuators, linear bearing systems, motion controllers, motion control ICs, CNC systems, robot control systems, visual identity systems, automatic guided vehicles, self-lube bearings, precision stages, wicking materials, and environmental equipment. The company also offers FA and equipment comprising PCB depaneling systems, robot systems, optical communication machines, DeMeet 3D CNC coordinate measuring machines, and electric screw drivers; and patterning technology and applications, patterned technology and equipment, automatic optical inspection equipment, and laser processing equipment. In addition, it provides isolation and damping devices, natural ventilation systems, and EcoColor external venetian blinds. The company provides solutions to self-lubricated parts; transmissions; power transmissions; drive systems; controllers and robotics for PCB, SMT, LCD, optical, solar, and semiconductor equipment; architectural applications/designs for window operators; seismic isolation systems; and anti-earthquake devices. Aurotek Corporation was founded in 1980 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "6438.TW": {
        "short_name": "SYMTEK AUTOMATION ASIA CO LTD",
        "long_name": "Symtek Automation Asia Co., Ltd.",
        "summary": "Symtek Automation Asia Co., Ltd. designs and manufactures automation system solutions. The company offers automation equipment for printed circuit board, flexible board, IC substrate and packaging, high density interconnect board, and ceramic substrate applications. It is also involved in the design and provision of customized machines for applications in laser technology equipment, TFT-LCD flat panel screens, LEDs, touch panels, and LGP; and wafer, cell, and module manufacturing machines, including inspection systems, as well as intelligent automation integration services. The company was formerly known as SCHMID Automation Asia Co., Ltd. Symtek Automation Asia Co., Ltd. was founded in 1999 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "6618.TWO": {
        "short_name": "UHT",
        "long_name": "UHT Unitech Co., Ltd.",
        "summary": "UHT Unitech Co., Ltd. manufactures and sells medium and high grade carbon fiber in Taiwan and internationally. Its products are used in aerospace, automotive, energy, and other sectors. The company is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "6667.TWO": {
        "short_name": "TRUSVAL TECHNOLOGY CO LTD",
        "long_name": "Trusval Technology Co., Ltd.",
        "summary": "Trusval Technology Co., Ltd. provides solutions in the field of water supply system, waste treatment, and system integration. The company offers functional water supply systems, including CO2-DIW, O3-DIW, H2-DIW, and NH3-DIW dissolvers; and waste water treatment advanced processes that include waste acid De H2O2, waste solvent De H2O2, waste solvent De DMSO/DMSO2, waste water degrade IPA, and waste IPA and solvent reclaim, as well as reclaim of copper sulfate by electrolysis. It also provides system integration solutions, such as chemical supply, slurry supply, gas supply, waste chemical collection, and automatic electronics control systems; and engages in the planning, design, construction, and maintenance of equipment, instruments, and field pipes for the facility system in the hi-tech industries. In addition, the company is involved in the semiconductor business. Trusval Technology Co., Ltd. was founded in 1995 and is based in Miaoli, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Miaoli"
    },
    "6706.TW": {
        "short_name": "FITTECH CO LTD",
        "long_name": "Fittech Co.,Ltd",
        "summary": "Fittech Co.,Ltd provides automatic equipment and system integration services for the optoelectronic, semiconductor, and laser industries. The company offers LED probing and testing equipment, including LED chip and wafer probing and testing systems; fully automatic LED wafer prober systems; auto flip-chip probers; auto LED chip probers and tester; high accuracy automatic chip counters; and automatic detaching tape systems. It also provides LD probing and testing equipment, such as VCSEL(PD) probing and testing systems, and edge emitting laser probing and sorting systems; and laser micromachining equipment comprising automatic dual-arm laser wafer and laser wafer marking systems, fully-auto laser marking (inking) systems, and semi-auto PCB laser drilling systems, as well as semi-auto laser cutting, drilling, and scribing systems. In addition, the company offers laser metal machining equipment, including handheld laser cleaning and welding machines; and OEM and LED OEM services. Its products are also used in other photonics and optics, electronics, automotive, and manufacturing industries. The company operates in Taiwan, China, and rest of Asia, as well as internationally. Fittech Co.,Ltd is headquartered in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung City"
    },
    "6793.TWO": {
        "short_name": "TIENLI OFFSHORE",
        "long_name": "Tien Li Offshore Wind Technology Co., Ltd.",
        "summary": "Tien Li Offshore Wind Technology Co., Ltd. produces and sells wind turbine blades, wind turbine molds, and other products. It also provides offshore wind operation and maintenance, as well as blade or composite materials research and development technical advisory services. The company was founded in 1998 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei City"
    },
    "6812.TWO": {
        "short_name": "SAULTECH",
        "long_name": "Saultech Technology Co., Ltd",
        "summary": "Saul Tech Technology Co., Ltd. develops, manufactures, and sells precision equipment. It offers IC products in various series, such as wafer to tray, wafer to wafer, wafer to tape, and multi-function sorter products; LED mapping sorters and mini LED die attachments; and LD bar attachments. The company is based in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "8092.TWO": {
        "short_name": "CHIEN WEI PRECISE TECHNOLOGY CO",
        "long_name": "Chien Wei Precise Technology Co., Ltd.",
        "summary": "Chien Wei Precise Technology Co., Ltd. manufactures and sells precise molding and measuring machines, and machine tools worldwide. Its products include 2D/3D precise measuring instruments, precision JIG grinders, machining centers, vertical grinding machines, IC-semiconductor special accessories, trimming and forming products, ultra-precision optics, and DVD molds. The company was founded in 1981 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Kaohsiung"
    },
    "8996.TW": {
        "short_name": "KAORI HEAT TREATMENT CO",
        "long_name": "Kaori Heat Treatment Co., Ltd.",
        "summary": "Kaori Heat Treatment Co., Ltd. develops, manufactures, and sells heat exchanger solutions in Taiwan and internationally. It offers brazed plate heat exchangers for use in HVAC, refrigeration, cooling, heating, heat recovery, green energy, and other industries, as well as for residential applications; and accessories, such as connectors, flanges, insulation foams, and stud bolts. The company was founded in 1970 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    }
}