{
    "5607.TW": {
        "short_name": "FARGLORY FREE TRADE ZONE INVEST",
        "long_name": "Farglory Free Trade Zone Investment Holding Co., Ltd",
        "summary": "Farglory Free Trade Zone Investment Holding Co., Ltd operates free trade zone in Taiwan. The park provides enterprises various commercial services and facilities, including automated warehousing facilities; an economic and trading special operation zone which encompasses land, sea, and air transport; and an air cargo terminal, a forwarders building, an international logistics center, and an enterprise business center. The company was founded in 1991 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan",
        "zipcode": null,
        "website": "http://www.farglory-holding.com.tw",
        "market_cap": 7945774592
    },
    "6146.TWO": {
        "short_name": "SPORTON INTERNATIONAL INC",
        "long_name": "Sporton International Inc.",
        "summary": "Sporton International Inc. provides product testing and certification services in Taiwan and internationally. It offers mobile device services, including design consultation, training, testing, and certification that allow its customers to acquire certificates and promote products. The company also provides EMC compatibility, safety, radio device, cellphone handset, and NCC testing and certification services, as well as customization services; and sells anti magnetic components. Sporton International Inc. was founded in 1986 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.sporton.com.tw",
        "market_cap": 21112715264
    },
    "6721.TWO": {
        "short_name": "Sincere group",
        "long_name": "Sincere Security Co. Ltd.",
        "summary": "Sincere Security Co. Ltd. engages in the property management, electrical maintenance, environmental friendly cleaning, and security businesses. The company offers community, factory, and parking lot property management; and director general, administrative secretary, and other manpower dispatch services, as well as generator equipment installation and maintenance, electrical maintenance, central air conditioning system installation and maintenance, air conditioning cooling tower cleaning, water system repair and replacement, fire equipment installation and maintenance, and monitoring system installation services. It also provides environmental friendly cleaning services, such as airport, station, hospital, and building cleaning; floor waxing polishing; stone crystallization grinding; carpet, sofa chair, and office chair sterilization; disinfection; pool cleaning and water quality inspection; exterior wall cleaning; gardening planting; and waste removal services. In addition, the company offers security services, including guardian, system, and personal security, as well as central monitoring system control management services. It serves science parks, hypermarkets, commercial buildings, schools, golf courses, villas and residential areas, and government units. The company was founded in 2007 and is headquartered in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": null,
        "website": "http://www.sincere-group.com.tw",
        "market_cap": 1430000000
    },
    "8481.TW": {
        "short_name": "TRANSART GRAPHICS CO LTD",
        "long_name": "Transart Graphics Co., Ltd.",
        "summary": "Transart Graphics Co., Ltd. operates in the screen print industry worldwide. The company manufactures and sells customized stickers and water transfer/heat transfer decals for the purpose of corporate identity and decorating products. It also offers self-adhesive sticker serial, nameplates and graphic overlays, dry rub-on transfer, color printed thermal forming plastic, brushed metal-like nameplates, and titanium flash. The company primarily serves bicycle, sporting goods, and various other industries. Transart Graphics Co., Ltd. was founded in 1973 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "407",
        "website": "http://www.transart.com.tw",
        "market_cap": 5474684416
    },
    "8905.TWO": {
        "short_name": "EAGLE COLD STORAGE ENTERPRISES",
        "long_name": "Eagle Cold Storage Enterprise Co., Ltd.",
        "summary": "Eagle Cold Storage Enterprise Co., Ltd. engages in the processing and trade of vegetables and meat products in Taiwan. It offers frozen beef, hot pot meat, and canned products, as well as imports and sells meat, french fries, green beans, and other commodities. The company also develops, constructs, leases, and sells residential houses. In addition, it is involved in the cold storage, warehousing, logistics, and distribution business. The company was founded in 1990 and is based in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung City",
        "zipcode": null,
        "website": "http://www.cooleagle.com.tw",
        "market_cap": 3113559040
    },
    "8906.TWO": {
        "short_name": "FORWARD GRAPHIC ENTERPRISE CO. ",
        "long_name": "Forward Graphic Enterprise Co., Ltd.",
        "summary": "Forward Graphic Enterprise Co., Ltd. operates in the printing industry in Taiwan. The company provides product design, prepress, printing equipment, and post press services. It offers printing services for various packages, such as boxes, gift boxes, chocolate boxes, and bags; books; notebooks; catalogue/flyers; calendars; and special, DIY, and ECO friendly products. The company was founded in 1968 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.forward-net.com.tw",
        "market_cap": 431532736
    },
    "CRKT": {
        "short_name": "CIRMAKER TECHNOLOGY CORPORATION",
        "long_name": "Cirmaker Technology Corporation",
        "summary": "Cirmaker Technology Corporation engages in the manufacture, distribution, and assembling of various electronic parts and components for sale primarily in the Asian markets. It provides electronic terminals, electronic blocks and accessories, electronic panel control and locking components, power distribution blocks and accessories, electronic timer and relay sockets, optical fiber connectors and adapters, car audio components, DVD players, electronics, cooling fins and systems for laptop and personal computers, and electrical tools, and other devices. The company also manufactures LCD backlight components and produces voice over Internet Protocol telephones. Further, it distributes or resells crimping tools, switches, cable ties, meters, sirens, power cords, and terminal strips, as well as imports and exports computer chips and various electronic products. Cirmaker Technology Corporation sells its products through sales personnel and marketing agents. The company was organized in 1984 and is based in Taoyuan, Taiwan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan",
        "zipcode": "326",
        "website": "http://www.cirmaker.com.tw",
        "market_cap": 158289
    }
}