{
    "6624.TWO": {
        "short_name": "EVER-CLEAR ENVIRONMENTAL ENG CO",
        "long_name": "Ever-Clear Environmental Eng. Corp.",
        "summary": "Ever-Clear Environmental Eng. Corp. engages in the evaluation, design, construction, and commissioning service of wastewater treatment and organic waste gas treatment facilities. The company is involved in the evaluation/process design/detailed design of wastewater/sludge/underground water/organic waste gas treatment; upgrade or expansion of existed wastewater or organic waste gas treatment plant; reuse of industrial wastewater; and wastewater/sludge/underground water/organic waste gas treatment equipment manufacture and turnkey services. It also provides fine screens, flow measuring tanks, sludge scrapers, anaerobic biological treatment equipment, floating decanter system of sequential batch reactors, physical and chemical treatment equipment, sludge drying equipment, and air pollution control equipment. The company serves food, textile and dying, mechanical and automotive, leather, electric and optoelectronics, biotechnology and pharmaceutical, chemical, pulp and paper, and other industries. Ever-Clear Environmental Eng. Corp. was founded in 1999 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "6803.TWO": {
        "short_name": "ECOVE ENVIRONMENT CORP",
        "long_name": "ECOVE Environment Corp.",
        "summary": "ECOVE Environment Corp. provides engineering and environmental services to public and private entities in Taiwan, Macau, China, Southeast Asia, India, and the United States. It finances, plans, constructs, operates, and maintains energy-from-waste plants, hazardous and special waste treatment plants, water and wastewater treatment plants, photovoltaic power plants, and resource reclamation and treatment plants. The company's services include operations and maintenance, consulting, and investment and development of public and private entities. It also offers technical and consulting services, such as mechatronics system and equipment maintenance and upgrade, commissioning, and testing for energy-from-waste, railway, waste management, and public utility sectors. In addition, the company is involved in developing, operating, and managing photovoltaic power plants with a total capacity of 25 megawatts; and the recycling of PET bottles. The company was formerly known as KD Holding Corp. ECOVE Environment Corp. was founded in 1994 and is headquartered in Taipei, Taiwan. ECOVE Environment Corporation operates as a subsidiary of CTCI Corporation.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "7507.TWO": {
        "short_name": "ENRESTEC INC",
        "long_name": "Enrestec Inc.",
        "summary": "Enrestec Inc engages in the pyrolysis and recycling of used plastic, rubber, and organic wastes. It is also involved in the development of soil thermal desorption technology and application. The company was incorporated in 1994 and is based in Pingtung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Pingtung"
    },
    "8341.TW": {
        "short_name": "SUNNY FRIEND ENVIRONMENTAL TECH",
        "long_name": "Sunny Friend Environmental Technology Co., Ltd.",
        "summary": "Sunny Friend Environmental Technology Co., Ltd. engages in the medical waste incineration business in Taiwan and China. The company is involved in the collection, incineration, solidification, physicochemical, transportation, landfill, and treatment of hazardous, general business, and bio-medical wastes. It also manufactures and sells pollution control equipment. In addition, the company engages in the installation engineering for waste cleaning activities; environmental engineering consulting activities; and environmental protection engineering construction activities. Further, it is involved in the waste treatment, waste removal, material recovery, resource recycling, environmental testing and sanitation activities; and design and manufacture, test set-up, and operation of equipment. The company was formerly known as Sunny Friend Waste Disposal co., ltd. and changed its name to Sunny Friend Environmental Technology Co., Ltd. in July 2000. Sunny Friend Environmental Technology Co., Ltd. was founded in 1994 and is headquartered in Yunlin County, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Yunlin"
    },
    "8390.TWO": {
        "short_name": "JIIN YEEH DING ENTERPRISE CO.LT",
        "long_name": "Jiin Yeeh Ding Enterprises Corp.",
        "summary": "Jiin Yeeh Ding Enterprises Corp. engages in recycling and refining precious metals in Taiwan. It operates professional cleaning and recycling facilities that clean shutters, recycle precious metals, sift disintegrated materials, and prevent pollution, as well as owns recycling and cleaning vehicles. The company serves semiconductor, printer circuit, computer components, electro-optical, passive components, telecommunication, and other industries. Jiin Yeen Ding Enterprise Corp. was founded in 1997 and is based in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "8422.TW": {
        "short_name": "CLEANAWAY COMPANY LIMITED",
        "long_name": "Cleanaway Company Limited",
        "summary": "Cleanaway Company Limited operates as an intermediate treatment solidification company within the waste disposal process in Taiwan. It offers waste solidification and excavation, waste landfill, and waste clearing services. The company is also involved in waste disposal, waste clean-up, waste management, general investment, and enterprise management consultation activities. Its principal customers include those in the steel and iron, electronics, optoelectronics, petrochemicals, electroplating, leather processing, metal processing, and tenders of other public and private enterprises. The company was formerly known as Cleanaway Kang Lien Co Ltd. and changed its name to Cleanaway Company Limited in May 2009. Cleanaway Company Limited was founded in 1999 and is headquartered in Kaohsiung City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Kaohsiung"
    }
}