{
    "ALLN.SW": {
        "short_name": "ALLREAL N",
        "long_name": "Allreal Holding AG",
        "summary": "Allreal Holding AG operates as a real estate company in Switzerland. It operates through two divisions, Real Estate and Projects & Development. The Real Estate division invests in residential and commercial properties. This division also provides various real estate services, such as portfolio management, and real estate and building management. The Projects & Development division provides project development, real estate consultancy, and contract administration services. This division's services comprise development and realization of new buildings, and conversion or renovation of buildings for third parties or for resale; sale of residential property; and advising private individuals, companies, and institutional investors with regard to real estate transactions. Allreal Holding AG was founded in 1999 and is based in Baar, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Baar"
    },
    "CIE.SW": {
        "short_name": "CI COM SA",
        "long_name": "Compagnie Internationale pour la Communication",
        "summary": "Compagnie Internationale pour la Communication engages in the fields of corporate investment, granting of loans, advancements, and related activities in Switzerland and Europe. It offers equity securities portfolios for investment. The company was founded in 1928 and is headquartered in Geneva, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Geneva"
    },
    "EPH.SW": {
        "short_name": "EPH EUROPEAN PROPERTY",
        "long_name": "Eastern Property Holdings Limited",
        "summary": "Eastern Property Holdings Ltd. is an investment company listed on SIX Swiss Exchange which holds interest in office, residential and retail properties. EPH is managed by Valartis International Ltd. a wholly-owned subsidiary of Valartis Group AG.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "None"
    },
    "HIAG.SW": {
        "short_name": "HIAG IMMOBILIEN N",
        "long_name": "HIAG Immobilien Holding AG",
        "summary": "HIAG Immobilien Holding AG, together with its subsidiaries, engages in the management and redevelopment of properties in Switzerland. The company operates through Yielding Portfolio, Redevelopment Portfolio, Cloud Services, and Others segments. Its property portfolio includes industrial and commercial, residential, retail, building land, distribution and logistics, office, and other properties. The company also offers metal recycling services; and technology to independent partners based on multi-cloud platform. In addition, it is involved in the management, asset management, and technical administrative management of the pension funds, as well as provides human resources services to third parties. The company was founded in 1876 and is headquartered in Basel, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Basel"
    },
    "IREN.SW": {
        "short_name": "INVESTIS N",
        "long_name": "Investis Holding SA",
        "summary": "Investis Holding SA operates as a residential property company in Switzerland. It operates through Properties and Real Estate Services segments. The company develops, sells, and rents residential properties. It also offers property management services to residential buildings, commercial buildings, or shopping centers; and facility management services, such as the maintenance of buildings, as well as outdoor services for residential, office, commercial buildings, and shopping centers. The company was founded in 1994 and is headquartered in Zurich, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Zurich"
    },
    "MOBN.SW": {
        "short_name": "MOBIMO N",
        "long_name": "Mobimo Holding AG",
        "summary": "Mobimo Holding AG operates as a real estate company in Switzerland. It operates through two segments, Real Estate and Development. The Real Estate segment is involved in the long-term holding, operation, and management of investment properties, including commercial, industrial, and residential properties; provision of tenant support services; and marketing of residential, commercial, and retail space. This segment also offers facility management and related services for third-party customers. As of December 31, 2019, it had 139 properties. The Development segment develops, constructs, and sells condominiums; and develops turn-key real estate investments for institutional and private investors, as well as provides development services, including area, site, and project developments. The company was founded in 1999 and is headquartered in Lucerne, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Lucerne"
    },
    "NREN.SW": {
        "short_name": "Novavest Real Estate N",
        "long_name": "Novavest Real Estate AG",
        "summary": "Novavest Real Estate AG engages in the real estate activities in Switzerland. It develops, rents, and manages residential, mixed used, and office and commercial properties; courthouses, community buildings, schools, shopping centers, and hotels or leisure facilities; industrial plants; and conversion and renovation properties. The company is based in Zurich, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Zurich"
    },
    "PLAN.SW": {
        "short_name": "PLAZZA N",
        "long_name": "Plazza AG",
        "summary": "Plazza AG plans, develops, manages, and markets real estate properties and projects in Switzerland. It has a portfolio of residential, commercial, and office buildings, as well as garage/parking spaces. The company also provides property management services. Plazza AG is based in Zurich, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Zurich"
    },
    "PSPN.SW": {
        "short_name": "PSP N",
        "long_name": "PSP Swiss Property AG",
        "summary": "PSP Swiss Property AG, together with its subsidiaries, owns and operates real estate properties in Switzerland. It operates through Real Estate Investments and Property Management segments. The company owns, operates, and leases office, retail and commercial, and storage properties; and parking spaces. It owns 162 office and commercial properties; and 12 development sites and individual projects primarily in Zurich, Geneva, Basel, Bern, and Lausanne. PSP Swiss Property AG was founded in 1999 and is based in Zug, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Zug"
    },
    "PSPSF": {
        "short_name": "PSP SWISS PROPERTY AG",
        "long_name": "PSP Swiss Property AG",
        "summary": "PSP Swiss Property AG, together with its subsidiaries, owns and operates real estate properties in Switzerland. It operates through Real Estate Investments and Property Management segments. The company owns, operates, and leases office, retail and commercial, and storage properties; and parking spaces. It owns 162 office and commercial properties; and 12 development sites and individual projects primarily in Zurich, Geneva, Basel, Bern, and Lausanne. PSP Swiss Property AG was founded in 1999 and is based in Zug, Switzerland.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Switzerland",
        "city": "Zug"
    },
    "SFPN.SW": {
        "short_name": "SF Urban Properties N",
        "long_name": "SF Urban Properties AG",
        "summary": "SF Urban Properties AG operates as a real estate company in Switzerland. The company is involved in the development and management of existing real estate portfolio; and acquisition of new properties. It invests in commercial, residential, and development properties. The company was formerly known as Swiss Finance & Property Investment AG and changed its name to SF Urban Properties AG in April 2019. SF Urban Properties AG is based in Zurich, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Zurich"
    },
    "SPSN.SW": {
        "short_name": "SWISS PRIME SITE N",
        "long_name": "Swiss Prime Site AG",
        "summary": "Swiss Prime Site AG, through its subsidiaries, operates as a real estate company in Switzerland. The company operates in two segments, Real Estate and Services. The Real Estate segment purchases, sells, leases, and develops properties. The Services segment engages in the real estate service, assisted living, and retail and asset management business. Swiss Prime Site AG was founded in 1999 and is headquartered in Olten, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Olten"
    },
    "SWPRF": {
        "short_name": "SWISS PRIME SITE",
        "long_name": "Swiss Prime Site AG",
        "summary": "Swiss Prime Site AG, through its subsidiaries, operates as a real estate company in Switzerland. The company operates in two segments, Real Estate and Services. The Real Estate segment purchases, sells, leases, and develops properties. The Services segment engages in the real estate service, assisted living, and retail and asset management business. Swiss Prime Site AG was founded in 1999 and is headquartered in Olten, Switzerland.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Switzerland",
        "city": "Olten"
    },
    "VARN.SW": {
        "short_name": "VARIA US PROPERTIES N",
        "long_name": "Varia US Properties AG",
        "summary": "Varia US Properties AG, a real estate investment company, acquires, holds, and sells properties in the United States. It invests in low-moderate income and workforce multifamily housing properties. The company was founded in 2015 and is based in Zug, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Zug"
    },
    "WARN.SW": {
        "short_name": "WARTECK N",
        "long_name": "Warteck Invest AG",
        "summary": "Warteck Invest AG is involved in the rental of real estate properties such as apartments in Switzerland. Its portfolio includes 56 properties spread across 11 cantons. Warteck Invest AG is based in Basel and Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Basel"
    }
}