{
    "HIAG.SW": {
        "short_name": "HIAG IMMOBILIEN N",
        "long_name": "HIAG Immobilien Holding AG",
        "summary": "HIAG Immobilien Holding AG, together with its subsidiaries, engages in the management and redevelopment of properties in Switzerland. Its property portfolio includes industrial and commercial, residential, retail, building land, distribution and logistics, office, and other properties. The company also offers metal recycling services. In addition, it is involved in the management, asset management, and technical administrative management of the pension funds, as well as provides human resources services to third parties. The company was founded in 1876 and is headquartered in Basel, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Basel",
        "zipcode": "4052",
        "website": "http://www.hiag.com",
        "market_cap": "Small Cap"
    },
    "MOBN.SW": {
        "short_name": "MOBIMO N",
        "long_name": "Mobimo Holding AG",
        "summary": "Mobimo Holding AG operates as a real estate company in Switzerland. It operates in two segments, Real Estate and Development. The Real Estate segment is involved in the portfolio management; purchase and sale of investment properties; initial and subsequent letting of investment properties; and sale of condominiums. This segment also includes the tasks and services of site, property, and facility management. The Development segment develops investment properties for its own portfolio; construction projects for third-party investors; and condominiums, as well as acquires sites and building plots for development activities. This segment also responsible for construction projects commissioned by Mobimo; monitors construction activity; and manages the quality assurance process during the construction phase. The company develops commercial, industrial, and residential properties. As of December 31, 2020, it had 135 properties, as well as a rentable area of approximately 529,000 square meters. The company was founded in 1999 and is headquartered in Lucerne, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Lucerne",
        "zipcode": "6000",
        "website": "http://www.mobimo.ch",
        "market_cap": "Mid Cap"
    },
    "NREN.SW": {
        "short_name": "Novavest Real Estate N",
        "long_name": "Novavest Real Estate AG",
        "summary": "Novavest Real Estate AG engages in the real estate activities in Switzerland. It develops, rents, and manages residential, mixed used, and office and commercial properties; courthouses, community buildings, schools, shopping centers, and hotels or leisure facilities; industrial plants; and conversion and renovation properties. The company is based in Zurich, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Zurich",
        "zipcode": "8008",
        "website": "http://www.novavest.ch",
        "market_cap": "Small Cap"
    },
    "PSPN.SW": {
        "short_name": "PSP N",
        "long_name": "PSP Swiss Property AG",
        "summary": "PSP Swiss Property AG, together with its subsidiaries, owns and operates real estate properties in Switzerland. It operates through Real Estate Investments and Property Management segments. The company owns, operates, and leases office, retail and commercial, and storage properties; and parking spaces. It owns 160 office and commercial properties; and 16 development sites and individual projects primarily in Zurich, Geneva, Basel, Bern, and Lausanne. PSP Swiss Property AG was founded in 1999 and is based in Zug, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Zug",
        "zipcode": "6300",
        "website": "http://www.psp.info",
        "market_cap": "Mid Cap"
    },
    "PSPSF": {
        "short_name": "PSP SWISS PROPERTY AG",
        "long_name": "PSP Swiss Property AG",
        "summary": "PSP Swiss Property AG, together with its subsidiaries, owns and operates real estate properties in Switzerland. It operates through Real Estate Investments and Property Management segments. The company owns, operates, and leases office, retail and commercial, and storage properties; and parking spaces. It owns 160 office and commercial properties; and 16 development sites and individual projects primarily in Zurich, Geneva, Basel, Bern, and Lausanne. PSP Swiss Property AG was founded in 1999 and is based in Zug, Switzerland.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Zug",
        "zipcode": "6300",
        "website": "http://www.psp.info",
        "market_cap": "Mid Cap"
    },
    "ZUGN.SW": {
        "short_name": "ZUG ESTATES HOLDING AG",
        "long_name": "Zug Estates Holding AG",
        "summary": "Zug Estates Holding AG, together with its subsidiaries, conceives, develops, markets, and manages real estate properties in the Zug region, Switzerland. The company operates in two segments, Real Estate and Hotel & Catering. Its real estate portfolio includes shops, offices, and residential units, as well as other residential and commercial properties. The company also rents properties and provides property management services for third parties. In addition, it operates a city resort consisting of two business hotels, three restaurants, and serviced city apartments for business clients. Zug Estates Holding AG is based in Zug, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Zug",
        "zipcode": "6300",
        "website": "http://www.zugestates.ch",
        "market_cap": "Mid Cap"
    }
}