{
  "ABA.F": {
    "city": "Cologne",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Waste Management",
    "long_name": "ALBA SE",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "ALBA SE O.N.",
    "state": null,
    "summary": "ALBA SE provides environmental system services in Europe. It offers transport packaging, sales packaging/dual system, packaging, Kraft paper bags, deposit solutions, waste electrical and electronic equipment, recycled plastics, energy saving bulbs and fluorescent tubes, and sorting and battery recycling services; consultation services for packaging optimization, optimizing and recycling, EU chemicals regulation, Europe-wide packaging licensing, and clearing solutions; and reuse services for IT and communication equipment, and printer cartridges. The company also provides logistics and supply chain management services; disposal and waste management services; recycling services; and facility solutions, including property and facility management. ALBA SE was formerly known as INTERSEROH SE and changed its name to ALBA SE in July 2012. The company was founded in 1991 and is based in Cologne, Germany. ALBA SE is a subsidiary of Alba Europe Holding Plc & Co. Kg",
    "website": "http://www.interseroh.de",
    "zipcode": "51149"
  },
  "ZEF.F": {
    "city": "Frankfurt am Main",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Waste Management",
    "long_name": "ZhongDe Waste Technology AG",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ZHONGDE WASTE TECHNOLOGY",
    "state": null,
    "summary": "ZhongDe Waste Technology AG designs, invests in, constructs, operates, and finances power plants in Germany and China. The company operates through three segments: Engineering, Procurement & Construction (EPC) Projects; Built, Operate and Transfer Projects; and Incinerators. It operates energy-from-waste incineration plants that generate electricity from the disposal of solid municipal, medical, and industrial waste. The company also provides EPC contractor services, which include design, procurement, construction, and installation of energy-from-waste and incineration plants. ZhongDe Waste Technology AG was founded in 1996 and is headquartered in Frankfurt am Main, Germany.",
    "website": "http://www.zhongde-ag.com",
    "zipcode": "60325"
  }
}
