{
    "0Q0C.L": {
        "short_name": "TOSHIBA CORP TOSHIBA ORD SHS",
        "long_name": "Toshiba Corporation",
        "summary": "Toshiba Corporation, together with its subsidiaries, provides electronic devices and storage solutions worldwide. It operates through seven segments: Energy Systems & Solutions, Infrastructure Systems & Solutions, Building Solutions, Retail & Printing Solutions, Electronic Devices & Storage Solutions, Digital Solutions, and Others. The company provides energy systems and solutions, including nuclear, thermal, and renewable energy power generation systems; transmission and distribution, hydrogen energy, and heavy-ion therapy systems; and energy digital services. It also offers infrastructure systems and solutions, such as water supply and wastewater treatment, traffic control, defense and electronic, railway transportation, substation, broadcasting and network, security and automation, and motor/drive systems; and building solutions comprising elevators, escalators, building facilities, electrical construction materials, lighting equipment, airport ground lighting systems, stage and studio lighting systems, automotive light sources, industrial light sources and modules, air conditioners, multi systems for buildings, heat source systems, heat pump hot water supply systems, ventilating fans, ventilating systems, and cold-chain equipment. In addition, the company provides retail and printing solutions, including POS systems, multifunction peripherals, automatic identification systems, and inkjet heads; electronic devices and storage solutions, such as semiconductors, analog integrated circuits (ICs), microcontrollers, automotive digital ICs, hard disk drives, semiconductor manufacturing equipment, thermal print heads, and ceramics; and digital solutions comprising AI/analytics, ICT infrastructure, IoT solutions, security solutions, and managed services. Further, it offers rechargeable lithium-ion batteries, modules, and packs; and computers and tablets, visual products, and home appliances. Toshiba Corporation was founded in 1875 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "FANUN.MX": {
        "short_name": "FANUC CORPORATION",
        "long_name": "Fanuc Corporation",
        "summary": "Fanuc Corporation provides factory automation products in Japan, the United States, Europe, Asia, and internationally. The company offers CNC series products, servo motors, lasers, robots, compact machining centers, electric injection molding machines, wire-cut electric discharge machines, and ultra-precision machines. It also provides FANUC Intelligent Edge Link and Drive system, an open platform for the manufacturing industry. The company was incorporated in 1950 and is headquartered in Yamanashi, Japan.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Japan",
        "city": "Yamanashi"
    },
    "MISUN.MX": {
        "short_name": "MISUMI GROUP INC",
        "long_name": "MISUMI Group Inc.",
        "summary": "MISUMI Group Inc. engages in the factory automation and die components businesses worldwide. The company operates through three segments: FA Business, Die Components Business, and VONA Business. It offers mechanical components, including shafts, timing pulleys, linear bushings, flat belt conveyors, set collars, locating pins, gears, and couplings; and locator devices and measurement equipment, such as automatic stage units, actuators, optical measurement devices, and optical waveguide alignment products. The company also provides metal press/plastic mold components comprising punches, button dies, ejector pins, and sprue bushings. In addition, it distributes sensors and switches, pipefittings, screws, bolts, nuts, washers, castors, couplings, transformers, connectors, cables, transformers, end mills, hexagonal wrenches, milling chips, calipers, carts, work gloves, parts cleaners, and laboratory equipment and supplies. MISUMI Group Inc. was founded in 1963 and is headquartered in Tokyo, Japan.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Machine Tools & Accessories",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "NABCON.MX": {
        "short_name": "NABTESCO CORP",
        "long_name": "Nabtesco Corporation",
        "summary": "Nabtesco Corporation manufactures and sells equipment in the industrial, daily life, and environmental fields in Japan and internationally. It operates through Component Solutions, Transport Solutions, Accessibility Solutions, and Manufacturing Solutions segments. The company offers precision reduction gears for industrial robots' joints; hydraulic equipment, such as traveling unit for crawlers, control valve for mini excavators, and swing unit for hydraulic excavators; railroad vehicle equipment, such as railroad vehicle brake systems, door operating units, test equipment, brake shoes, seat turning equipment, and snow removal devices; and aircraft equipment comprising flight control actuation systems and high voltage electric power distribution units. It also provides air dryers and wedge brake chambers for commercial vehicles, and hydraulic clutch master cylinders for passenger vehicles; engine remote control systems for vessels; automatic doors and platform doors for buildings; automatic filters/sealers for retort pouch foods; and intelligent prosthetic knee joints, electric wheelchairs, stair lift with a wheelchair, and rollator with a speed control system, as well as new energy equipment comprising yaw and pitch drives, and solar tracking equipment. Nabtesco Corporation was founded in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "NIDECN.MX": {
        "short_name": "NIDEC CORPORATION",
        "long_name": "Nidec Corporation",
        "summary": "Nidec Corporation, together with its subsidiaries, designs, develops, produces, and sells motors, electronics and optical components, and other related products in Japan and internationally. The company offers medium- and large-size motors, small-size and precision motors, motor-related products, units and modules, automotive components, mechanical equipment, inspection and measuring equipment, electronic devices, sensors, and other products. Its products are used for applications in robotics, IoT products, automotive, home appliances, information technology, office automation, mobile devices and optical components, medical and health care products, housing equipment, commercial and professional products, and processing/inspection equipment. Nidec Corporation was founded in 1973 and is headquartered in Kyoto, Japan.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Japan",
        "city": "Kyoto"
    },
    "SMCN.MX": {
        "short_name": "SMC CORP",
        "long_name": "SMC Corporation",
        "summary": "SMC Corporation manufactures, processes, and sells automatic control equipment, sintered filters, and various types of filtration equipment worldwide. The company offers directional control valves, air cylinders, rotary actuators/air grippers, electric actuators/cylinders, vacuum equipment, air preparation equipment, modular F.R.L./pressure control equipment, lubrication equipment, fittings and tubings, flow control equipment, speed controllers, silencers/exhaust cleaners/blow guns/pressure gauges, switches/sensors/controllers, and static neutralization equipment. It also provides process valves, chemical liquid valves/fittings and needle valves/tubings, process pumps, temperature control equipment, process gas equipment, high vacuum equipment, industrial filters/sintered metal elements, pneumatic instrumentation equipment, and hydraulic equipment. The company was formerly known as Shoketsu Kinzoku Kogyo Co., Ltd. and changed its name to SMC Corporation in April 1986. SMC Corporation was founded in 1959 and is headquartered in Tokyo, Japan.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Japan",
        "city": "Tokyo"
    }
}