{
    "AFFLE.NS": {
        "short_name": "Affle (India) Limited",
        "long_name": "Affle (India) Limited",
        "summary": "Affle (India) Limited, a technology company, provides mobile advertisement services through information technology and software development services for mobiles in India and internationally. It offers MAAS platform, an end-to-end mobile advertising platform; RevX, a self-serve programmatic platform; Vizury Engage360, an omnichannel marketing platform; Mediasmart, a programmatic and proximity marketing platform; mFaaS for ad fraud detection; Shoffr, an online to offline marketing platform; mKr8, an ad authoring platform; mDMP, a data management platform; mCDP, a customer data platform for audience intelligence and engagement; affle reusable components for application development; and Marft, a multichannel commerce platform. The company serves e-commerce, fintech, gaming, healthtech, entertainment, foodtech, groceries, Edtech, government, and FMCG companies. Affle (India) Limited was incorporated in 1994 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gurugram"
    },
    "BAGFILMS.NS": {
        "short_name": "B.A.G. FILMS&MEDIA",
        "long_name": "B.A.G. Films and Media Limited",
        "summary": "B.A.G. Films and Media Limited, together with its subsidiaries, engages in the content production, distribution, and allied activities in India. It operates through Audio-Visual Production and Distribution, Leasing, FM Radio, and Television Broadcasting segments. The company operates News24, a national Hindi free to air news channel available; and E24, a Bollywood entertainment channel. It also operates FM radio stations under the name of Dhamaal24 in the cities of Hissar, Karnal, Patiala, Ranchi, Muzaffarpur, Dhule, Jalgaon, Ahemednagar, Simla, and Jabalpur. In addition, the company operates ISOMES, a media school; and the Greater Valley School, as well as leases properties, and production and broadcast equipment. Further, it is involved in the motion picture, video, and television programs production activities. The company was incorporated in 1993 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "BALAJITELE.NS": {
        "short_name": "BALAJI TELEFILMS",
        "long_name": "Balaji Telefilms Limited",
        "summary": "Balaji Telefilms Limited engages in the entertainment business in India and internationally. It operates through Commissioned Programmes, Films, and Digital segments. The company produces and distributes television content and films primarily in Hindi under the Balaji Telefilms brand name; and produces reality shows, events, and Bengali contents. It is also involved in the B2C digital content business under the brand name of ALT Balaji; and creates intellectual property rights. In addition, the company sells Indian ethnic wear and jewelry under the EK brand name; and operates Hoonur, a platform for media professionals and entertainment consumers. Balaji Telefilms Limited was founded in 1994 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "BCG.NS": {
        "short_name": "BRIGHTCOM GROUP",
        "long_name": "Brightcom Group Limited",
        "summary": "Brightcom Group Limited provides digital marketing solutions to businesses, agencies, and online publishers worldwide. It operates through Digital Marketing and Software Development segments. The company connects advertisers with their audience across various forms of digital media to deliver messages to the right audience. The company was formerly known as Lycos Internet Limited and changed its name to Brightcom Group Limited in September 2018. Brightcom Group Limited was incorporated in 1999 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "BHARTIARTL.NS": {
        "short_name": "BHARTI AIRTEL LTD",
        "long_name": "Bharti Airtel Limited",
        "summary": "Bharti Airtel Limited operates as a telecommunications company in 18 countries across Asia and Africa. It operates through Mobile Services India, Mobile Services Africa, Mobile Services South Asia, Airtel Business, Tower Infrastructure Services, Homes Services, Digital TV Services, and Others segments. The company's product offerings include 2G, 3G, and 4G wireless services, as well as mobile commerce, fixed line services, high speed home broadband, DTH, and enterprise services, including national and international long distance services to carriers. It also provides voice, data, video, network integration, data center, and managed services, as well as enterprise mobility applications and digital media solutions. In addition, the company operates submarine cable system; and provides telecom towers and related infrastructure for various mobile operators. As of March 31, 2020, it had approximately 423 million customers across its operations. The company was formerly known as Bharti Tele-Ventures Limited and changed its name to Bharti Airtel Limited in April 2006. Bharti Airtel Limited has collaboration with Qualcomm Technologies, Inc. for accelerating 5G. The company was founded in 1995 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "CINEVISTA.NS": {
        "short_name": "CINEVISTA LIMITED",
        "long_name": "Cinevista Limited",
        "summary": "Cinevista Limited produces serials, films, and ad films in India and internationally. It offers commercial television content in the areas of action, adventure, kids programming, drama, and soap; produces and distributes movies; and produces advertising commercials for various clients and advertisers. The company also owns and operates a five-acre property that is a one-stop shop for shooting needs; creates television software; and provides post production services, as well as rents equipment, such as recorders, cameras, digital triax set ups, and SEG video switchers. It offers its programming in various channels, including Sony TV, Sahara One, Zee TV, and MTV. The company was formerly known as Cinevistaas Limited and changed its name to Cinevista Limited in October 2012. Cinevista Limited was founded in 1982 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "CREATIVEYE.NS": {
        "short_name": "CREATIVE EYE LTD",
        "long_name": "Creative Eye Limited",
        "summary": "Creative Eye Limited engages in the television content production business in India. It produces television serials and movies. The company was founded in 1986 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "CYBERMEDIA.NS": {
        "short_name": "CYBER MEDIA (INDIA",
        "long_name": "Cyber Media (India) Limited",
        "summary": "Cyber Media (India) Limited engages in the print media business in India. It publishes various magazines, such as Dataquest, PCQuest, Voice&Data, DQ Channels, DQ Week, and Global Services. The company conducts events in the areas of IT, telecom, biotechnology, innovation, and entrepreneurship industries. It also operates ciol.com, a technology business website; and offers market research, consulting, and advisory services for information technology, telecommunications, semiconductor and electronics, government, infrastructure, energy and utilities, and healthcare and life sciences industries, as well as enterprise, SMB, and consumer user segments. In addition, the company provides content syndication services; marketing programs and custom publications for enterprises; and content management, editorial, and production services for publishers. Cyber Media (India) Limited was founded in 1982 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gurugram"
    },
    "DALALSTCOM.NS": {
        "short_name": "DSJ COMMUNICATION",
        "long_name": "DSJ Communications Limited",
        "summary": "DSJ Communications Limited prints and publishes newspapers and magazines in India. It is also involved in disseminating news and information through print, television, radio, and internet. The company was incorporated in 1989 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "DBCORP.NS": {
        "short_name": "D B CORP LTD",
        "long_name": "D. B. Corp Limited",
        "summary": "D. B. Corp Limited engages in newspaper printing and publishing, radio broadcasting, event management, and integrated internet and mobile interactive service businesses in India and internationally. The company operates through Printing/Publishing and Allied Businesses, and Radio segments. It publishes Dainik Bhaskar, Divya Bhaskar, Divya Marathi, Saurashtra Samachar, and DB Star newspapers in 3 languages, such as Hindi, Gujarati, and Marathi. The company also publishes Aha Zindagi, Bal Bhaskar, Young Bhaskar, Madhurima, Navrang, Kalash, Dharmdarshan, Rasik, and Lakshya magazines. In addition, it operates a network of 30 radio stations in 7 states under the 94.3 My FM brand name; 8 digital portals, such as dainikbhaskar.com, divyabhaskar.com, divyamarathi.com, jeevanmantra.in, homeonline.com, bollywoodbhaskar.com, moneybhaskar.com, and bhaskareducation.com; and 4 mobile applications comprising Dainik Bhaskar, Divya Bhaskar, Divya Marathi, and home online. D. B. Corp Limited was incorporated in 1995 and is headquartered in Bhopal, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bhopal"
    },
    "DEN.NS": {
        "short_name": "DEN NETWORKS LTD",
        "long_name": "DEN Networks Limited",
        "summary": "DEN Networks Limited distributes and promotes television channels through digital cable distribution network in India and internationally. It also offers cable TV, over-the-top entertainment, and broadband services. The company serves approximately 13 million households primarily in 13 states in India, including Delhi, Uttar Pradesh, Karnataka, Maharashtra, Gujarat, Rajasthan, Haryana, Kerala, West Bengal, Jharkhand, Bihar, Madhya Pradesh, and Uttarakhand. The company was formerly known as DEN Digital Entertainment Networks Limited and changed its name to DEN Networks Limited in June 2008. DEN Networks Limited was founded in 2007 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "DGCONTENT.NS": {
        "short_name": "Digicontent Limited",
        "long_name": "Digicontent Limited",
        "summary": "Digicontent Limited operates in the entertainment and digital innovation business in India. The company operates desimartini.com, a movie reviews and ratings Website that has a base of users who read movies reviews, entertainment news, and martini shots, as well as provides content sourcing services. It is also involved in the aggregation and creation of audio and multi-screen videos; and distribution of in-house creative and niche celeb based content to mobile and digital users, as well as operates an audio feed that plays music inside across various stores. In addition, the company maintains repository of images; and carries out media tool to build, promote, and amplify brand communication, as well as covers various brand activities, such as events promotions, parties, campaigns, and product launches in various HT media platforms. Further, it is involved in the dissemination of news, knowledge, information, entertainment, and content of general interest in English, Hindi, and any other language through various digital and economic media; and management of advertising time and space on its news websites, such as hindustantimes.com, livemint.com, and livehindustan.com. The company was formerly known as HT Digital Ventures Limited and changed its name to Digicontent Limited in October 2017. Digicontent Limited was incorporated in 2017 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "DISHTV.NS": {
        "short_name": "DISH TV INDIA LTD",
        "long_name": "Dish TV India Limited",
        "summary": "Dish TV India Limited, together with its subsidiaries, provides direct to home and teleport services primarily in India. It distributes its products and services through a network of distributors and dealers. As of December 30, 2020, the company offered approximately 719 channels and services, including 31 audio channels, and 76 high definition channels and services under the Dish TV, Zing, and d2h brands. The company has strategic partnership and collaboration with Amazon Prime Video, Amazon Alexa, ShortsTV, Zee5, Hungama Play, Voot, Sony Liv, and Alt Balaji to provide services to its Dish TV and d2h subscribers. Dish TV India Limited was incorporated in 1988 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "DNAMEDIA.NS": {
        "short_name": "DILIGENT MEDIA COR",
        "long_name": "Diligent Media Corporation Limited",
        "summary": "Diligent Media Corporation Limited engages in the online news distribution business in India. It operates an e-paper edition through epaper.dnaindia.com. The company also offers content through dna Syndication. Diligent Media Corporation Limited was founded in 2005 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "DQE.NS": {
        "short_name": "DQ ENTERTAINMENT I",
        "long_name": "DQ Entertainment (International) Limited",
        "summary": "DQ Entertainment (International) Limited provides animation production services for television, feature films, home video, online game art, and mobile and next generation console games worldwide. The company operates through Animation and Distribution segments. It provides training services for the production of animation television series and movies; and licensing and distribution for various markets, platforms, and product categories, such as international home video distribution, publishing, licensing and merchandising. The company also produces animation and visual effects content for feature films, television, video in 2D and 3D, and digital animation; and produces assets and full motion video creations for next generation consoles, PC, mobile, and online games. In addition, it produces and distributes live-action and feature films. The company was incorporated in 2007 and is based in Hyderabad, India. DQ Entertainment (International) Limited is a subsidiary of DQ Entertainment (Mauritius) Limited.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "DT0.SG": {
        "short_name": "DISH TV India Ltd. Reg. Sh. (GD",
        "long_name": "Dish TV India Limited",
        "summary": "Dish TV India Limited, together with its subsidiaries, provides direct to home and teleport services primarily in India. It distributes its products and services through a network of distributors and dealers. As of December 30, 2020, the company offered approximately 719 channels and services, including 31 audio channels, and 76 high definition channels and services under the Dish TV, Zing, and d2h brands. The company has strategic partnership and collaboration with Amazon Prime Video, Amazon Alexa, ShortsTV, Zee5, Hungama Play, Voot, Sony Liv, and Alt Balaji to provide services to its Dish TV and d2h subscribers. Dish TV India Limited was incorporated in 1988 and is based in Noida, India.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "STU",
        "market": "dr_market",
        "country": "India",
        "city": "Noida"
    },
    "ENIL.NS": {
        "short_name": "ENTERTAINMENT NETW",
        "long_name": "Entertainment Network (India) Limited",
        "summary": "Entertainment Network (India) Limited, together with its subsidiary, operates FM radio broadcasting stations in India. It operates broadcasting stations in 63 cities under the brand names of Radio Mirchi, Mirchi Love, Mirchi 95, and Kool FM; and 21 online radio stations. The company was incorporated in 1999 and is based in Mumbai, India. Entertainment Network (India) Limited is a subsidiary of Bennett, Coleman & Company Limited.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "EROSMEDIA.NS": {
        "short_name": "EROS INTL MEDIA",
        "long_name": "Eros International Media Limited",
        "summary": "Eros International Media Limited, together with its subsidiaries, engages in the production, exploitation, and distribution of films in India, the United Arab Emirates, and internationally. The company operates on a vertically integrated studio model controlling content, as well as provides distribution and exploitation across various formats, including cinema, digital, home entertainment, and television syndication. It also engages in the sourcing of Indian film content through acquisition, co-production, or production; exploiting and distributing films through music release, theatrical distribution, DVD and VCD release, television licensing, and cable or DTH licensing; and trading and exporting international rights. The company was founded in 1977 and is based in Mumbai, India. Eros International Media Limited is a subsidiary of Eros International Plc.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "GFLLIMITED.NS": {
        "short_name": "GFL LIMITED",
        "long_name": "GFL Limited",
        "summary": "GFL Limited operates and manages multiplex cinema theatres in India. It operates through Wind Energy Business, Power, and Theatrical Exhibition segments. The company operates and manages 147 multiplexes and 626 screens in 68 cities with a total seating capacity of 144,467 seats under the INOX brand name. It also manufactures wind turbine generators (WTGs), as well as provides engineering, procurement, and commissioning; operations and maintenance; and common infrastructure facilities to WTGs. In addition, the company is involved in the development of wind farms; real estate and property development; and generation and sale of wind energy, as well as services for the erection, procurement, and commissioning (EPC) of wind farms. The company was formerly known as Gujarat Fluorochemicals Limited and changed its name to GFL Limited in July 2019. The company was incorporated in 1987 and is based in Noida, India. GFL Limited is a subsidiary of Inox Leasing and Finance Limited.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "GTL.NS": {
        "short_name": "GTL LTD",
        "long_name": "GTL Limited",
        "summary": "GTL Limited operates as an infrastructure services company in India. The company offers services and solutions to address the network life cycle requirements of telecom operators, technology providers, and tower companies. The company provides network operation and maintenance services, such as network monitoring and operation, network field maintenance, technical support and process management, logistics and vendor management, and transition management services. It also offers energy management solutions in the areas of energy audits of telecom infrastructure, process improvement, technology upgradation, and alternate sources of energy. GTL Limited was founded in 1987 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "GTPL.NS": {
        "short_name": "GTPL HATHWAY LTD",
        "long_name": "GTPL Hathway Limited",
        "summary": "GTPL Hathway Limited, through its subsidiaries, provides cable television and broadband services. It operates through three segments: Cable Television, Internet, and EPC Project. The company engages in the distribution of television channels through digital cable distribution network. It has a network of approximately 40,000 kilometers of optical fiber cable. The company serves its customers in approximately 800 cities across 12 states in India, including Gujarat, Rajasthan, Maharashtra, Goa, Jharkhand, Bihar, Assam, West Bengal, Andhra Pradesh, Telangana, Uttar Pradesh, and Tamil Nadu. It also acts as an Internet service provider. The company was incorporated in 2006 and is headquartered in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Ahmedabad"
    },
    "HATHWAY.NS": {
        "short_name": "HATHWAY CABLE & DA",
        "long_name": "Hathway Cable and Datacom Limited",
        "summary": "Hathway Cable and Datacom Limited provides cable television network, Internet, and allied services. It operates through Broadband Business and Cable Television Segments. The company offers digital cable TV services; standard definition (SD) and high definition (HD) cable TV channel services; and SD and HD set-top boxes. It also provides home and business broadband services. In addition, the company operates H-tube, a channel for broadcasting videos; CCC Â\u0096 Cine Channel, a 24 hours movie channel; HMART, a shopping channel; and HFLICKS1 and HFLICKS2, which are entertainment channels. The company offers its cable TV services in approximately 350 cities and towns in India. Hathway Cable and Datacom Limited was incorporated in 1959 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "HMVL.NS": {
        "short_name": "HINDUSTAN MEDIA VE",
        "long_name": "Hindustan Media Ventures Limited",
        "summary": "Hindustan Media Ventures Limited engages in the printing and publication of newspapers and periodicals in India. The company's product line includes Hindustan, a daily newspaper that provides news relating to politics, business, entertainment, sports, and other general interests; and LiveHindustan.com, a Hindi news Website. It also provides Nandan, a monthly children's magazine that offers traditional and modern stories, poems, interactive columns and facts, and various educative columns; and Kadambini, a monthly socio-cultural magazine, which covers various subjects, including literature, art, culture, health, technology, fashion, travel, beauty, etc. The company was formerly known as Searchlight Publishing House Limited and changed its name to Hindustan Media Ventures Limited in November 2008. The company was founded in 1918 and is based in New Delhi, India. Hindustan Media Ventures Limited is a subsidiary of HT Media Limited.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "HTMEDIA.NS": {
        "short_name": "HT MEDIA LTD",
        "long_name": "HT Media Limited",
        "summary": "HT Media Limited, together with its subsidiaries, engages in the printing and publication of newspapers and periodicals in India. The company operates through three segments: Printing and Publishing of Newspapers and Periodicals, Radio Broadcast and Entertainment, and Digital. It publishes Hindustan Times, an English daily newspaper; Mint, a business daily newspaper; Brunch, a weekly lifestyle magazine; Hindustan, a Hindi daily newspaper; Hindustan Jobs, an employment weekly; Jaano English, an English learning supplement; Nandan, a monthly children's magazine; and Kadambini, a monthly women's magazine, as well as newspaper supplements. The company is also involved in FM radio broadcast and other related activities through its radio stations operating under the Fever 104, Fever, Radio One, and Radio Nasha brands in Delhi, Mumbai, Kolkata, Bengaluru, Hyderabad, Kanpur, Lucknow, Agra, Allahabad, Aligarh, Bareilly, and Gorakhpur, as well as Fever FM brand in Chennai. In addition, it operates Shine.com, a job portal; HT Campus.com, an education portal; Hindustantimes.com, a general news web portal; livemint.com, a business news web portal; Livehindustan.com, a Hindi news website; Desimartini.com, a movie review website; and HT Smartcast, a podcast platform. Further, the company operates Studymate learning centers; Bridge School of Management; and provides payroll processing and consultancy, mobile marketing, social media marketing, advertising, mobile CRM and loyalty campaigns, and business and management consultancy services, as well as mobile music content and ring tones. Additionally, it engages in the coaching/ tutorial classes conducting business, as well as sets up training centers. The company was founded in 1924 and is based in New Delhi, India. HT Media Limited is a subsidiary of The Hindustan Times Limited.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "IDEA.NS": {
        "short_name": "VODAFONE IDEA LTD",
        "long_name": "Vodafone Idea Limited",
        "summary": "Vodafone Idea Limited operates mobile telecommunications in India. The company offers 2G, 3G, and 4G services; prepaid, postpaid, and roaming services, as well as interconnect and long distance services; voice, data, and enterprise services, as well as various other value added services, including short messaging services, digital services, Internet of Things, etc. It also trades in handsets, data cards, and related accessories; and provides internet, mobile advertisement, toll free services, etc. Vodafone Idea Limited has approximately 293.7 million mobile subscribers. The company was formerly known as Idea Cellular Limited and changed its name to Vodafone Idea Limited in August 2018. Vodafone Idea Limited was incorporated in 1995 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "IMAGICAA.NS": {
        "short_name": "IMAGICAAWORLD ENT LTD",
        "long_name": "Imagicaaworld Entertainment Limited",
        "summary": "Imagicaaworld Entertainment Limited develops and operates theme-based entertainment destinations in India. It operates through Tickets, Food and Beverage, Merchandise, Rooms, and Other Operations segments. The company operates theme, water, and snow parks under the Imagicaa brand; and a hotel comprising 287 rooms under the Novotel Imagicaa brand. It also owns and operates a range of food and beverage outlets, restaurants, and candy stores under the Roberto's Food Court, The Imagica Capital, Red Bonnet American Diner, Arrmada, Sunbeatz Pizzeria & Bar, Red Bonnet Express, Ammos, Cones, and Sandy Sipss names; and stores that sell T-shirts, crop tops, formal shirts, sweatshirts, handbags, backpacks, and tote bags, as well as soft toys and pillows, sipper bottles, coffee mugs, and cocktail glasses. In addition, the company develops and leases real estate properties. The company was formerly known as Adlabs Entertainment Limited and changed its name to Imagicaaworld Entertainment Limited in April 2020. Imagicaaworld Entertainment Limited was incorporated in 2010 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "INDIAMART.NS": {
        "short_name": "IndiaMART InterMESH Ltd",
        "long_name": "IndiaMART InterMESH Limited",
        "summary": "IndiaMART InterMESH Limited operates an online B2B marketplace that connects buyers with suppliers in India and internationally. Its platform serves small and medium enterprises, large enterprises, and individuals. The company was founded in 1996 and is headquartered in Noida, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "INDUSTOWER.NS": {
        "short_name": "INDUS TOWERS LIMITED",
        "long_name": "Indus Towers Limited",
        "summary": "Indus Towers Limited provides telecom tower infrastructure sharing services. The company acquires, builds, deploys, owns, operates, and manages telecom towers and communication structures for various mobile operators. As of March 31, 2020, it owned and operated 42,053 towers with 75,715 co-locations in 11 telecommunications circles in India. The company was founded in 2006 and is headquartered in Gurugram, India. Indus Towers Limited is a subsidiary of Bharti Airtel Limited.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gurugram"
    },
    "INOXLEISUR.NS": {
        "short_name": "INOX LEISURE LTD",
        "long_name": "INOX Leisure Limited",
        "summary": "INOX Leisure Limited operates and manages multiplexes and cinema theatres under the INOX brand name in India. As of February 20, 2021, it operated 152 multiplexes and 643 screens in 69 cities. The company was founded in 1999 and is based in Mumbai, India. INOX Leisure Limited is a subsidiary of Gujarat Fluorochemicals Limited.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "IWY1.F": {
        "short_name": "SIFY TECHNO.LTD.ADR IR 10",
        "long_name": "Sify Technologies Limited",
        "summary": "Sify Technologies Limited provides integrated ICT solutions and services in India and internationally. The company operates in five segments: Telecom Services, Data Center Services, Cloud and Managed Services, Technology Integration Services, and Applications Integration Services. The Telecom Services segment offers internet protocol based virtual private network services, including intranets, extranets, and remote access applications; and last mile connectivity services. The Data Center Services segment provides co-location, regular backup, server load balancing, and remote backup solutions; shared hosting, network, and security services; storage and virtualization services; and managed voice services to resident enterprises. The Cloud and Managed Services segment offers on-demand hosting services; and remote and onsite infrastructure management services that manages and supports customer operating systems, applications, and database layers, as well as utility-based on-demand storage services. The Technology Integration Services segment provides data center build, network integration, information security, end user computing, and collaborative tools and solutions. The Applications Integration Services segment offers online assessment, web development, supply chain solutions, content management, sale of digital certificates; sale, implementation, and maintenance of industry specific application; and operates online portfolio, including sify.com and samachar.com, gateway to the Internet by offering communication and search tools. The company was formerly known as Sify Limited and changed its name to Sify Technologies Limited in October 2007. The company was founded in 1995 and is headquartered in Chennai, India.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "city": "Chennai"
    },
    "JAGRAN.NS": {
        "short_name": "JAGRAN PRAKASHAN L",
        "long_name": "Jagran Prakashan Limited",
        "summary": "Jagran Prakashan Limited engages in the printing and publication of newspapers and magazines in India. The company operates through Printing, Publishing and Digital; FM Radio Business; and Others segments. It offers Dainik Jagran, a daily newspaper; Nai Dunia & Nav Dunia, the Hindi newspapers; Inquilab, an Urdu daily newspaper; Sakhi, a Hindi magazine; Khet Khalihaan, a monthly agricultural magazine; Dainik Jagran Inext, an online Hindi newspaper; mid-day, a compact newspaper; mid-day Gujarati, a Gujarati newspaper; and Punjabi Jagran, a Punjabi daily newspaper. The company also provides web and text/voice-based value-added services and products in genres, such as news, education, blogging, health, classifieds, youth, and videos through the Jagran New Media portals. In addition, it offers a portfolio of out of home marketing services through hoardings and billboards, street furniture, railway stations and bus stands, metro network, ambient media, and retail signages, as well as innovative and clutter-breaking solutions. Further, the company provides marketing solutions, such as brand activations; events, conferences, and exhibitions; shopper and retail marketing; integrated media campaigns; rural marketing; creative services; and public health programs. It publishes 10 publications in 5 languages with approximately 400 editions/sub-editions; and operates 39 radio stations under the Radio City brand name. The company was founded in 1942 and is based in Kanpur, India. Jagran Prakashan Limited is a subsidiary of Jagran Media Network Investment Private Limited.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kanpur"
    },
    "JAINSTUDIO.NS": {
        "short_name": "JAIN STUDIOS",
        "long_name": "Jain Studios Limited",
        "summary": "Jain Studios Limited engages in the electronic media business in India. The company was incorporated in 1991 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "JUSTDIAL.NS": {
        "short_name": "JUST DIAL LTD",
        "long_name": "Just Dial Limited",
        "summary": "Just Dial Limited engages in the search engine business under the Justdial brand name in India and internationally. The company offers local search, search related, and software services through various platforms, including internet, mobile internet, over the telephone, and text. It also provides review and rating certification services under the JD Ratings name; and online payment services under the JD Pay name. In addition, the company engages in advertising and events businesses; and the operation of JD Social, a social media platform, as well as Search Plus, JD Maps, JD Omni, and other platforms. Further, it offers website development and maintenance services. As of July 31, 2020, the company had a database of 29.6 million listings. Just Dial Limited was incorporated in 1993 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "KSERASERA.NS": {
        "short_name": "KSS LTD",
        "long_name": "KSS Limited",
        "summary": "KSS Limited, a diversified media company, engages in the processing and content distribution of movies and advertisements primarily in India. The company operates through Movie Digitization, Miniplex Theater, Retail Gold Jewellery, Film Production & Distribution, and Others segments. It offers high definition cinema projection technology under the Sky Cinex Prime name. The company is also involved in the operation of cine restaurant and cine cafe under the CHHOTU MAHARAJ brand name; movable theatre to showcase movies under the Filmy Carvan brand name; provision of Knowledge Kampus education packages; and operation of Cherishgold.com, an e-commerce portal/virtual jewelry mall that offers a collection of gold, diamond, and gemstone jewelry. In addition, it engages in the distribution and retail of branded jewelry, jewelry products, and life style products. The company was formerly known as K Sera Sera Limited and changed its name to KSS Limited in December 2012. KSS Limited was incorporated in 1995 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "MATRIMONY.NS": {
        "short_name": "MATRIMONY COM LTD",
        "long_name": "Matrimony.com Limited",
        "summary": "Matrimony.com Limited online matchmaking services on internet and mobile platforms in India and internationally. The company operates through Matchmaking Services and Marriage Services segments. The company operates matrimonial sites, including BharatMatrimony.com, BengaliMatrimony.com, GujaratiMatrimony.com, HindiMatrimony.com, KannadaMatrimony.com, KeralaMatrimony.com, MarathiMatrimony.com, MarwadiMatrimony.com, OriyaMatrimony.com, PunjabiMatrimony.com, TamilMatrimony.com, TeluguMatrimony.com, UrduMatrimony.com, AssameseMatrimony.com, ParsiMatrimony.com, and SindhiMatrimony.com. It also operates regional matrimonial sites through MuslimMatrimony.com, ChristianMatrimony.com, SikhMatrimony.com, JainMatrimony.com, and BuddhistMatrimony.com; and offers social services through BharatBloodBank.com, BharatEyeBank.org, AbilityMatrimony.com, and HappyMarriages.com. In addition, the company operates community based sites, such as CommunityMatrimony.com; and exclusive matrimonial sites comprising EliteMatrimony.com, DivorceeMatrimony.com, ManglikMatrimony.com, and DefenceMatrimony.com. Further, it operates Matrimonybazar.com and Matrimonymandap.com to provide related marriage services that include wedding planners, venues, cards, and caterers, as well as mandap services. It operates approximately 148 retail outlets. The company was founded in 1997 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "MPSLTD.NS": {
        "short_name": "MPS LTD",
        "long_name": "MPS Limited",
        "summary": "MPS Limited provides platforms and services for content creation, full-service production, and distribution to the publishers, learning companies, corporate institutions, libraries, and content aggregators in India, Europe, the United States, and internationally. It operates through three segments: Content Solutions, Platform Solutions, and eLearning Solutions. The company offers content authoring and development solutions from PreKÂ\u009612 through higher education and professional development; publishing solutions; interactive systems; digital transformation and accessibility solutions; new media solutions; content assembly and transformation solutions; content fulfillment solutions; and marketing and customer support solutions. It also provides platforms, such as Digicore, a cloud-based digital publishing platform; MPSTrak, a cloud-based workflow and content management platform for books, journals, reference works, and media; mag+, which publishes content to mobile app; THINK360, an end-to-end order management and delivery platform; ScholarStor, a content hosting and delivery platform for publishers; SCHOLARLYStats, a cloud-based platform to empower librarians and institutions; MPSInsight, a cloud-based usage analytics platform that empowers publishers to access and analyze content usage analytics based on COUNTER standards; and TOPSIM solutions. In addition, the company offers eLearning solutions, including custom development, managed learning, mobile and micro learning, simulation, and gaming solutions, as well as augmented, virtual, and extended reality solutions; and operates experience centers and learning platforms. The company was formerly known as Macmillan India Limited and changed its name to MPS Limited in June 2009. The company was founded in 1892 and is based in Noida, India. MPS Limited is a subsidiary of ADI BPO Services Limited.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "MTENY": {
        "short_name": "MAHANAGAR TELEPHONE NIGAM",
        "long_name": "Mahanagar Telephone Nigam Limited",
        "summary": "Mahanagar Telephone Nigam Limited provides fixed-line telecommunication services in Delhi and Mumbai. It offers GSM and CDMA based mobile services; and Internet, broadband, ISDN, and leased line services, as well as telecom consultancy and engineering services, project management services, Wi-Fi solutions, e-governance projects, managed services, turnkey ICT solutions, GIS based services, capacity building and skill development services, etc. In addition, it provides mobile, international long distance, and Internet services in Mauritius. The company was incorporated in 1986 and is based in New Delhi, India.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "India",
        "city": "New Delhi"
    },
    "MTNL.NS": {
        "short_name": "MAHANAGAR TELEP NI",
        "long_name": "Mahanagar Telephone Nigam Limited",
        "summary": "Mahanagar Telephone Nigam Limited provides fixed-line telecommunication services in Delhi and Mumbai. It offers GSM and CDMA based mobile services; and Internet, broadband, ISDN, and leased line services, as well as telecom consultancy and engineering services, project management services, Wi-Fi solutions, e-governance projects, managed services, turnkey ICT solutions, GIS based services, capacity building and skill development services, etc. In addition, it provides mobile, international long distance, and Internet services in Mauritius. The company was incorporated in 1986 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "MUKTAARTS.NS": {
        "short_name": "MUKTA ARTS",
        "long_name": "Mukta Arts Limited",
        "summary": "Mukta Arts Limited engages in the production, distribution, and exhibition of films in India. It operates through five segments: Software Division, Equipment Division, Education, Theatrical Exhibition Division, and Others. The Software Division segment is involved in film/TV production and distribution operations. This segment produces/co-produces movies and television content, as well as offers related services; and acquires movie rights for overseas and Indian distribution. The Equipment Division segment provides production equipment to other production houses and independent producers on hire. The Education segment operates an education, research, and training institute that offer training in various skills related to films, television, and the media industry. The Theatrical Exhibition Division segment comprise of various services offered at theatres, including sale of tickets, catering of food and beverages, and providing advertising services at theatres, as well as related services. The Others segment engages in the facility rental business. Mukta Arts Limited was founded in 1982 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "NAUKRI.NS": {
        "short_name": "INFO EDGE",
        "long_name": "Info Edge (India) Limited",
        "summary": "Info Edge (India) Limited operates as an online classifieds company in the areas of recruitment, matrimony, real estate, and education and related services in India and internationally. It operates through Recruitment Solutions, 99acres, and Other segments. The company offers recruitment services through naukri.com, an online job website for job seekers and corporate customers, including hiring consultants/firms; firstnaukri.com, a job search network for college students and recent graduates; naukrigulf.com, a website catering to Middle East job markets; and quadranglesearch.com, a site that provides offline placement services to middle and senior management, as well as www.ambitionbox.com, www.jobhai.com, and www.bigshyft.com. It also provides 99acres.com, which offers listing of properties for sale, purchase, and rent; Jeevansathi.com, an online matrimonial classifieds services; and shiksha.com, an education classified website that helps students to decide their undergraduate and postgraduate options by providing useful information on careers, exams, colleges, and courses. In addition, it provides software consultancy and supply services; database services, including database processing and tabulation, online information and data retrieval, electronic data interchange, web search portal content, code and protocol conversion services, etc.; internet, computer, and electronic and related services; technical support; and other services in the field of information technology and product development, as well as brokerage services in the real estate sector. Additionally, the company is involved in the development of software, as well as acts as an investment adviser, financial and management consultant, investment manager, and sponsor of alternative investment funds. It also provides advertising space for colleges and universities on www.shiksha.com.Info Edge (India) Limited was incorporated in 1995 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "NAVNETEDUL.NS": {
        "short_name": "NAVNEET EDUCATION",
        "long_name": "Navneet Education Limited",
        "summary": "Navneet Education Limited publishes state board publication books and stationary products. The company operates through three segments: Publication, Stationery, and Others. The Publishing segment consists of supplementary books, such as workbooks, guides, and question banks, which are based on the latest prescribed syllabus by state education boards under the Vikas and Gala brand names. The Stationery segment offers paper based and non-paper based stationery under the Navneet and Youva brand names. Its stationery products include long books, notebooks, drawing books, scrap books, and office stationery, as well as pendrives and tablets. The Others segment engages in the generation of power by windmill; trading items; etc. It is involved in the school management business; and offers e-learning products and services under the Study Buddy brand. The company markets and sells its products under the Navneet, Vikas, Gala, Rise, Grafalco, Indiannica, YOUVA, Top Scorer, Top Class, and Touch brand names. It has operations in India, North and Central America, Africa, Europe, and internationally. The company was formerly known as Navneet Publications (India) Limited and changed its name to Navneet Education Limited in August 2013. Navneet Education Limited was founded in 1959 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "NAZARA.NS": {
        "short_name": "Nazara Technologies Ltd",
        "long_name": "Nazara Technologies Limited",
        "summary": "Nazara Technologies Limited operates as a diversified gaming and sports media platform in India, with presence in the Middle East, Africa, North America, and Asia. The company operates through Telco subscription, Early Learning, Freemium, E-sports, and Real Money Gaming segments. It offers interactive gaming, eSports, sports media, gamming subscription services, and gamified early learning ecosystems. The company engages in providing subscription/download of games/other contents through a consumer base. It owns the IP, including WCC and CarromClash in mobile games; Kiddopia in gamified early learning; Nodwin and Sportskeeda in eSports and eSports media; and Halaplay and Qunami in skill-based, fantasy and trivia games. Nazara Technologies Limited was formerly known as Nazara Technologies Private Limited. The company was incorporated in 1999 and is based in Mumbai, India with additional offices in Dubai and Singapore.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "NDTV.NS": {
        "short_name": "NEW DELHI TELEVISI",
        "long_name": "New Delhi Television Limited",
        "summary": "New Delhi Television Limited, together with its subsidiaries, engages in television media business in India, the United States, Europe, and internationally. The company operates through two segments, Television Media and Related Operations; and Retail/E-commerce. It operates NDTV 24X7, an English news channel; NDTV India, a Hindi news channel; and NDTV Profit- NDTV Prime, a business and infotainment channel. The company also operates various e-commerce platforms, such as Car and Bike.com, Gadgets 360Â°, BandBaajaa.com, SmartCooky, and Mojarto.com. New Delhi Television Limited was founded in 1988 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "NETWORK18.NS": {
        "short_name": "NETWORK 18 MEDIA",
        "long_name": "Network18 Media & Investments Limited",
        "summary": "Network18 Media & Investments Limited operates as a media and entertainment company in India. The company engages in television, digital content, filmed entertainment, ticketing and live, print, mobile content, and allied businesses. It operates business news channels, such as CNBC-TV18, CNBC Awaaz, and CNBC Bajar; general news channels, including CNN News18, News18 India, News18 International, and News18; and regional news channels comprising News18 network. The company also operates Hindi general entertainment channels consisting of Colors, Colors Rishtey, Rishtey Cineplex, MTV India, and MTV Beats; English entertainment channels, such as VH1, Comedy Central, and Colors Infinity; and regional entertainment channels consisting of Colors Kannada, Colors Super, Kannada Cinema, Colors Bangla, Colors Marathi, Colors Gujarati, Colors Oriya, and Colors Tamil. In addition, it operates kids entertainment channels comprising Nickelodeon, Sonic, Nick Jr., and Nick HD+; factual entertainment and lifestyle channels, such as HistoryTV18 and FYI TV18; VOOT, a Viacom18's video-on-demand platform; filmed entertainment channels, such as Viacom18 Motion Pictures; and IndiaCast, a content asset monetization channel, as well as integrated network solutions. Further, the company operates digital content websites, including MoneyControl, News18, CNBCTV18.com, In.com, and Firstpost, as well as bookmyshow.com, an online ticketing platform; and TopperLearning, a premier K-12 content, delivery, and assessment service provider. Additionally, it publishes Forbes India, Overdrive, Better Photography, and Better Interiors magazines; and produces films and TV shows. The company was formerly known as Network18 Fincap Private Limited and changed its name to Network18 Media & Investments Limited in December 2007. Network18 Media & Investments Limited was incorporated in 1996 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "NEXTMEDIA.NS": {
        "short_name": "NEXT MEDIAWORKS LT",
        "long_name": "Next Mediaworks Limited",
        "summary": "Next Mediaworks Limited, through its subsidiary, engages in radio broadcasting in India. It operates FM stations under the Radio One brand in Delhi, Mumbai, Chennai, Kolkata, Bengaluru, Pune, and Ahmedabad. The company was formerly known as Mid-Day Multimedia Limited and changed its name to Next Mediaworks Limited. Next Mediaworks Limited was incorporated in 1981 and is based in Mumbai, India. Next Mediaworks Limited is a subsidiary of HT Media Limited.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "NXTDIGITAL.NS": {
        "short_name": "NXTDIGITAL LIMITED",
        "long_name": "Nxtdigital Limited",
        "summary": "Nxtdigital Limited, through its subsidiaries, engages in the media and communications business in India. The company operates through Media and Communications and Real Estate segments. It distributes TV signals through a dual delivery platform consisting of the traditional terrestrial fiber route and the head end in the sky (HITS) satellite platform under the INDigital and NXTDIGITAL brand names. The company also provides broadband and internet services under the ONE Broadband brand name; and sells set top boxes. In addition, it operates land acquired for future development. The company was formerly known as Hinduja Ventures Limited and changed its name to Nxtdigital Limited in October 2019. Nxtdigital Limited was incorporated in 1985 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "ONMOBILE.NS": {
        "short_name": "ONMOBILE GLOBAL LT",
        "long_name": "OnMobile Global Limited",
        "summary": "OnMobile Global Limited provides telecom value added services in India and internationally. It offers apps and services under the ONMO brand name; and carrier services, such as ring back tones, videos, contests, and games. The company was formerly known as OnMobile Asia Pacific Private limited and changed its name to OnMobile Global Limited in August 2007. OnMobile Global Limited was founded in 2000 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "ORTEL.NS": {
        "short_name": "ORTEL COMMUNICATIO",
        "long_name": "Ortel Communications Limited",
        "summary": "Ortel Communications Limited, a regional cable television service provider, engages in the distribution of analog and digital cable television, high speed broadband, and voice over Internet protocol services. It operates through Cable TV, Broadband Service, Infrastructure Leasing, and Others segments. The company offers digital cable television services; and other value added services, such as high definition (HD), near video on demand, electronic program guide, and gaming and local content services. It also provides broadband services that enable home subscribers to access the broadband services by using DOCSIS technology; and SMEs and corporate subscribers to access high-speed Internet by using fiber to their premises. In addition, the company engages in leasing fiber infrastructure for telecommunication and Internet companies; and the provision of signal up linking services. It serves customers located in the states of Odisha, Andhra Pradesh, Telangana, Chhattisgarh, West Bengal, and Madhya Pradesh, India. The company operates approximately 14 HD channels. The company was founded in 1995 and is headquartered in New Delhi, India. Ortel Communications Limited is under Corporate Insolvency Resolution Process of the Insolvency and Bankruptcy Code 2016.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "PFOCUS.NS": {
        "short_name": "PRIME FOCUS",
        "long_name": "Prime Focus Limited",
        "summary": "Prime Focus Limited, together with its subsidiaries, engages in the motion picture, video, and television program post-production activities primarily in India, the United Kingdom, the United States, and Canada. It offers creative services, including visual effects, advertising, stereo 3D conversion, and feature and TV animation; equipment rental services; and post production services, such as digital intermediate/color grading, sound, and picture post services to the media and entertainment industry. The company also provides technology products comprising CLEAR, a hybrid cloud-enabled media enterprise resource planning suite that includes cloud MAM, operations cloud, broadcast cloud, production cloud, securescreener, and vision cloud modules, as well as cloud media services for broadcasters, studios, brands, and service providers; View-D, a stereoscopic 2D to 3D conversion; and Primetime Emmy, a DAX digital dailies. In addition, it is involved in the media and other investment activities; and provision of digital asset management, restoration, and visual special effects services, as well as operates a training institute. The company provides its services to Hollywood studios, OTT players, broadcasters, advertisers, production houses, and media companies. The company was founded in 1997 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "PNC.NS": {
        "short_name": "PRITISH NANDY COMM",
        "long_name": "Pritish Nandy Communications Ltd",
        "summary": "Pritish Nandy Communications Ltd, a media and entertainment company, engages in the production and exploitation of content in India. The company operates in Content and Wellness segments. It produces movies, documentaries, corporate films, TV serials, and digital series. The company is also involved in the wellness business, as well as owns Moksh, Power Yoga, Passion Yoga, Cool Yoga, and Couple Yoga brands. Pritish Nandy Communications Ltd was founded in 1993 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "PRESSMN.NS": {
        "short_name": "PRESSMAN ADVERTISI",
        "long_name": "Pressman Advertising Limited",
        "summary": "Pressman Advertising Limited operates as an advertising agency in India. The company offers advertising, design, media planning and buying, market research, and digital and public relations services, as well as sells space for print media and public relations. It serves various sectors, which include banking, insurance, and financial services; construction and real estate, consumer and lifestyle, CSR, education, food and drink, government, cement and engineering, infrastructure and mining, media and entertainment, pharma and healthcare, technology, and trade organization; and hotels, and travel and tourism. The company was incorporated in 1983 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "PVR.NS": {
        "short_name": "PVR LTD",
        "long_name": "PVR Limited",
        "summary": "PVR Limited, a theatrical exhibition company, engages in the exhibition, distribution, and production of movies. The company is also involved in the in-house advertisement, sale of food and beverages, gaming, and restaurant businesses. As of March 05, 2021, it operated a network of 844 screens at 177 properties in India and Sri Lanka. The company was incorporated in 1995 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gurugram"
    },
    "RADAAN.NS": {
        "short_name": "RADAAN MEDIAWORKS",
        "long_name": "Radaan Mediaworks India Limited",
        "summary": "Radaan Mediaworks India Limited operates in the media and entertainment industry in India. The company is involved in the production of content for tele-serials/films, digital content, events, game shows, etc.; distribution of films; theatrical play activities; and setting up of training courses, such as acting, dance, martial arts, yoga, etc. It produces serials in Tamil, Telugu, Malayalam, Hindi, Gujarati and Kannada languages. Radaan Mediaworks India Limited was founded in 1994 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "RADIOCITY.NS": {
        "short_name": "MUSIC BROADCAST",
        "long_name": "Music Broadcast Limited",
        "summary": "Music Broadcast Limited owns and operates FM radio stations under the Radio City brand name. Its radio stations deliver film, non-film, devotional, regional, and international music. The company operates 28 radio stations in 39 cities in India. It also operates radio stations that offer entertainment news, movie reviews, and photo galleries. In addition, the company operates online platform radiocity.in, which has 18 radio stations in 9 languages; and Â\u0091Radio City' youtube channels. The company was incorporated in 1999 and is based in Mumbai, India. Music Broadcast Limited is a subsidiary of Jagran Prakashan Limited.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "RAILTEL.NS": {
        "short_name": "Railtel Corp of Ind Ltd",
        "long_name": "RailTel Corporation of India Limited",
        "summary": "RailTel Corporation of India Limited provides broadband telecom and multimedia networks and services in India and internationally. The company operates through Telecom Services and Project Work Services segments. It offers E-office, HD video conferencing, data center, RailWire broadband, leased line, virtual private network, internet leased line, consultancy, signaling, rack and space collocation, tower collocation, NLD voice carriage, and aadhaar based services. The company also provides project services, including station Wi-Fi, content on demand, railway display network, national optical fiber network, and national knowledge network services, as well as NE-I AND NE-II services under USOF. It serves telecom operators, Internet service providers, MSOs, enterprises, banks, government institutions/ departments, educational institutions/universities, etc. The company was founded in 2000 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "RAJTV.NS": {
        "short_name": "RAJ TEL NETWORK",
        "long_name": "Raj Television Network Limited",
        "summary": "Raj Television Network Limited operates as a television satellite broadcaster in south India. It operates 14 channels in Tamil, Telugu, Kannada, Malayalam, and Hindi languages that broadcast movies, serials, debates, cultural, educational, cookery, handicrafts, comedy shows, game shows, music shows, news time, and religious programs in India, as well as parts of South East Asia, the Middle East, the United States, Europe, MENAP, Africa, and APAC regions. The company also provides advertisement services, as well as engages in subscription of channels. In addition, it is involved in the movie production and distribution business; and export of films in foreign market and Web casting movie content over the Internet. The company was founded in 1994 and is headquartered in Chennai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "RCOM.NS": {
        "short_name": "RELIANCE COMM LTD",
        "long_name": "Reliance Communications Limited",
        "summary": "Reliance Communications Limited provides enterprise voice, data, video, and IT infrastructure solutions to enterprises, over-the-top (OTT) players, and network operators in India and internationally. It offers business Internet, network, cloud networking, data center, enterprise voice, cloud telephony, and access number services; and collaboration services, which include audio and Web conferencing, as well as voice and various value-added wholesaling services for carriers and service providers. The company also builds, owns, and operates telecommunication towers, optic fiber cable assets, and related assets. In addition, it offers infrastructure and connectivity, and managed services. The company was formerly known as Reliance Communication Ventures Limited and changed its name to Reliance Communications Limited in June 2006. Reliance Communications Limited was incorporated in 2004 and is based in Navi Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Navi Mumbai"
    },
    "REDFY": {
        "short_name": "REDIFF.COM INDIA",
        "long_name": "Rediff.com India Limited",
        "summary": "Rediff.com India Limited provides online Internet based services in India and to the global Indian community. The company delivers news and information, enterprise email services, online shopping marketplace, and internet-based local TV advertising platform. Its websites provides sports and cricket; life style and movies; content on news, business, and finance; search facilities; and e-mail and shopping related channels. The company delivers its services on PCs, tablets, and mobile platforms. Rediff.com India Limited was founded in 1996 and is headquartered in Mumbai, India.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "India",
        "city": "Mumbai"
    },
    "ROUTE.NS": {
        "short_name": "ROUTE MOBILE LIMITED",
        "long_name": "Route Mobile Limited",
        "summary": "Route Mobile Limited provides cloud-communication platform services to enterprises, over-the-top players, and mobile network operators in Africa, the Asia Pacific, Europe, the Middle East, and North America. It offers messaging, voice, and email, as well as short messaging service (SMS) filtering, analytics, and monetization; and firewall, SMS hubbing, and instant virtual number solutions. The company provides its cloud-communication services to clients in the social media, banking and financial services, aviation, retail, Internet/e-commerce, logistics, healthcare, hospitality, media and entertainment, pharmaceuticals, and telecom sectors. Route Mobile Limited was founded in 2004 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "SABEVENTS.NS": {
        "short_name": "SAB EVENTS & GOV N",
        "long_name": "SAB Events & Governance Now Media Limited",
        "summary": "SAB Events & Governance Now Media Limited engages in the operation of digital media websites. The company operates Governance Now that provides participatory reportage and analysis related to governance of various institutions and processes through governancenow.com portal and YouTube video channel, as well as a fortnightly print magazine. It is also involved in the organization of various Virtual Conferences, Technology Masterclasses, and Visionary Talk series for government and public sector; and meetings, incentives, conferences, and exhibitions events. SAB Events & Governance Now Media Limited was incorporated in 2014 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "SABTN.NS": {
        "short_name": "SRI ADHIKARI BROS",
        "long_name": "Sri Adhikari Brothers Television Network Limited",
        "summary": "Sri Adhikari Brothers Television Network Limited engages in the content production and distribution businesses in India. It is also involved in the syndication of various content to broadcasters, aggregators, and satellite networks. The company operates MASTIII, a music channel; Dabangg, a Hindi general entertainment channel; Dhamaal Gujarat, a youth focused regional channel; a Maiboli, a Marathi channel; and Dillagi, a movie channel. Sri Adhikari Brothers Television Network Limited was founded in 1985 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "SAMBHAAV.NS": {
        "short_name": "SAMBHAAV MEDIA LTD",
        "long_name": "Sambhaav Media Limited",
        "summary": "Sambhaav Media Limited engages in the publishing of newspapers, magazines, and audio video media in India. The company offers Sambhaav Metro, an afternoon-daily; Abhiyyan, a Gujarati magazine; and VTVGujarati, a digital publication of news and entertainment. It also operates VTV News, a Gujarati news channel; Wise TV, an in-transit TV channel; and 13 stations, including FM radio stations in Jammu & Kashmir, as well as implements integrated vehicle tracking and passenger information systems for buses. In addition, the company is involved in the supply, installation, testing, integration and commissioning, and training for electrical smart power fence works in Pathankot. Further, it operates www.sambhaav.com, www.abhiyaanmagazine.com, and www.topfm.in web portals for news, entertainment, gaming, and knowledge sharing activities; and web applications. The company was formerly known as Pearl Energy and Infrastructures Limited. Sambhaav Media Limited was incorporated in 1990 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Ahmedabad"
    },
    "SANDESH.NS": {
        "short_name": "SANDESH",
        "long_name": "The Sandesh Limited",
        "summary": "The Sandesh Limited engages in editing, printing, and publishing newspapers and periodicals in India. It publishes SANDESH, a premier Gujarati daily newspaper; and Sandesh Pratyaksha Panchang, a periodical. The company also operates Sandesh News, a Gujarati news channel; Spotlight, an out of home media solution; and a Gujarati news app. The Sandesh Limited was founded in 1923 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Ahmedabad"
    },
    "SAREGAMA.NS": {
        "short_name": "SAREGAMA INDIA LTD",
        "long_name": "Saregama India Limited",
        "summary": "Saregama India Limited engages in the sound recording and publishing business in India and internationally. The company operates through Music, Films/TV Serials, and Publication segments. The Music segment manufactures and sells music storage devices, such as carvaan, mini carvaan, music cards, audio compact discs, digital versatile discs, etc., as well as deals with related music rights. The Films/TV Serials segment produces, sells, telecasts, and broadcasts films, TV serials, and pre-recorded programs, as well as deals in film rights. The Publication segment publishes OPEN, a weekly current affairs magazine. It also offers television software. The company was formerly known as Gramophone Company of India Ltd. The company was founded in 1901 and is headquartered in Kolkata, India. Saregama India Limited is as a subsidiary of Composure Services Private Limited.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "SCHAND.NS": {
        "short_name": "S CHAND AND COMPAN",
        "long_name": "S Chand and Company Limited",
        "summary": "S Chand and Company Limited, an education content company, develops and delivers content, solutions, and services for the early learning, K-12, and higher education segments in India. The company provides instructional resources to students from ages 4 through 18 years; test preparation, and college and university/technical and professional content; early learning content for 0-4 years of age; and digital and interactive content, as well as service offerings under the S Chand, Vikas, Madhubun, Saraswati, Chhaya Prakashani, mylestone, BPI, Smartivity, Risekids, Mystudygear, Intellitab, Ignitor, and Destination Success brands. It also offers Flipclass, a marketplace for tutoring. The company also exports its printed content to approximately 15 countries and digital content to countries in Asia, the Middle East, Africa, and internationally. S Chand and Company Limited was founded in 1970 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "SHEMAROO.NS": {
        "short_name": "SHEMAROO ENTERTAIN",
        "long_name": "Shemaroo Entertainment Limited",
        "summary": "Shemaroo Entertainment Limited engages in the motion picture, video, and television programme distribution activities in India. The company is involved in the movie production; and syndication business that distributes its content to satellite, cable, and terrestrial networks, as well as distributes videos, CRBT, live streaming, etc. through operator and own branded portals. It also deals in curating and providing content to DTH services on DTH platforms; and provides inflight eclectic mix of content service. In addition, the company offers Bollywood theme products, such as t-shirts, mugs and coasters, etc. through online and offline platforms. Further, it provides studio services comprising digital intermediate, digital restoration, VFX, telecine, film scanning, film grading, etc. to various content owners and distributors; brand solutions; and home entertainment products; and media industry courses, as well as offers mobile applications. Additionally, the company offers pre-loaded devotional speakers. Shemaroo Entertainment Limited was founded in 1962 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "SIFY": {
        "short_name": "Sify Technologies Limited - Ame",
        "long_name": "Sify Technologies Limited",
        "summary": "Sify Technologies Limited provides integrated ICT solutions and services in India and internationally. The company operates in five segments: Telecom Services, Data Center Services, Cloud and Managed Services, Technology Integration Services, and Applications Integration Services. The Telecom Services segment offers internet protocol based virtual private network services, including intranets, extranets, and remote access applications; and last mile connectivity services. The Data Center Services segment provides co-location, regular backup, server load balancing, and remote backup solutions; shared hosting, network, and security services; storage and virtualization services; and managed voice services to resident enterprises. The Cloud and Managed Services segment offers on-demand hosting services; and remote and onsite infrastructure management services that manages and supports customer operating systems, applications, and database layers, as well as utility-based on-demand storage services. The Technology Integration Services segment provides data center build, network integration, information security, end user computing, and collaborative tools and solutions. The Applications Integration Services segment offers online assessment, web development, supply chain solutions, content management, sale of digital certificates; sale, implementation, and maintenance of industry specific application; and operates online portfolio, including sify.com and samachar.com, gateway to the Internet by offering communication and search tools. The company was formerly known as Sify Limited and changed its name to Sify Technologies Limited in October 2007. The company was founded in 1995 and is headquartered in Chennai, India.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "India",
        "city": "Chennai"
    },
    "SILLYMONKS.NS": {
        "short_name": "Silly Monks Entertain Ltd",
        "long_name": "Silly Monks Entertainment Limited",
        "summary": "Silly Monks Entertainment Limited operates as an entertainment and media company in India. It is involved in the digital media publishing; movie/series/music/other creator content production; celebrity digital management; marketing and promotion on digital and traditional mediums; content distribution and syndication on satellite channels, cinema theatres, airborne, and other offline platforms; and online/digital advertising with Google AdWords. The company was founded in 2013 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "SITINET.NS": {
        "short_name": "SITI NETWORKS LTD",
        "long_name": "SITI Networks Limited",
        "summary": "SITI Networks Limited, a multi-system operator, provides cable television network, Internet, and allied services in India. Its product includes digital and analogue cable television, and broadband and local television channels. The company offers cable services through set top boxes. It also provides broadband Internet services. The company markets its products under the SITI brand. It serves approximately 11.3 million digital customers through 15 digital head ends, as well as a network of approximately 33,000 kilometers of optical fiber and coaxial cable in approximately 580 locations. The company was formerly known as SITI Cable Network Limited and changed its name to SITI Networks Limited in August 2016. SITI Networks Limited was founded in 1994 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "SUNTV.NS": {
        "short_name": "SUN TV NETWORK LTD",
        "long_name": "Sun TV Network Limited",
        "summary": "Sun TV Network Limited, together with its subsidiaries, engages in producing and broadcasting satellite television and radio software programming in the regional languages of South India. The company's flagship channel includes Sun TV. It also operates various other satellite channels, such as Surya TV, Gemini TV, and Udaya TV; SUN Bangla, an entertainment channel in Bengali; and SUNNXT, an OTT platform. The company operates television channels in Tamil, Telugu, Kannada, and Malayalam languages for viewers in India, Sri Lanka, Singapore, Malaysia, the United Kingdom, rest of Europe, the Middle East, the United States, Australia, South Africa, and Canada; and 24 frequency modulation radio stations across India. It provides entertainment in various genres of general entertainment, movies, music, news, kids, action, and life. The company is also involved in the theatrical distribution of movies; and the operation of SunRisers Hyderabad, an Indian Premier League franchise. In addition, it offers direct to home services. The company was incorporated in 1985 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "TATACOMM.NS": {
        "short_name": "TATA COMMUNICATION",
        "long_name": "Tata Communications Limited",
        "summary": "Tata Communications Limited provides telecommunications services worldwide. The company operates through Voice Solutions, Data and Managed Services, and Real Estate segments. It offers voice and data transmission services; Internet connectivity services; and other value-added services, such as unified conferencing and collaboration, managed hosting, mobile global roaming and signaling, transponder lease, and television up-linking, and other managed services, as well as sells and leases bandwidth on undersea cable systems. The company also provides network services, such as virtual private network, WAN Ethernet, Internet access, Internet with MDDoS, private line, and content delivery network services; application aware networking services; and cloud and data center services comprising managed hosting, managed storage and back-up, managed database, and co-location services. In addition, it offers managed security services, such as content security and privacy, secure application and access, network and infrastructure security, threat management, and risk and compliance; and mobility and Internet of Things services. Further, the company provides media and entertainment services, including video connect network, OTT platform as a service, live VDN, teleport, cloud master control, and workflow automation services; and leases premises. It serves service providers and enterprises. The company was formerly known as Videsh Sanchar Nigam Limited and changed its name to Tata Communications Limited in 2008. Tata Communications Limited was founded in 1986 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "TIPSINDLTD.NS": {
        "short_name": "TIPS INDUSTRIES",
        "long_name": "Tips Industries Limited",
        "summary": "Tips Industries Limited engages in the production and distribution of motion pictures; and acquisition and exploitation of music rights in India and internationally. The company operates in two segments, Music (Audio/Video) and Film Production/Distribution. It has a music library of approximately 29,000 songs across various languages and genres; and holds soundtrack copyrights of approximately 50 Hindi movies. The company also produces Hindi and Punjabi films. It operates through an owned distribution system. The company was founded in 1975 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "TOUCHWOOD.NS": {
        "short_name": "TOUCHWOOD ENTERTAI",
        "long_name": "Touchwood Entertainment Limited",
        "summary": "Touchwood Entertainment Limited engages in the event management activities in India. It provides wedding management, design and dÃ©cor, destination wedding, entertainment, political and corporate event, curated IPs, and exhibition services. Touchwood Entertainment Limited was founded in 1997 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "TTML.NS": {
        "short_name": "TATA TELESERVICES",
        "long_name": "Tata Teleservices (Maharashtra) Limited",
        "summary": "Tata Teleservices (Maharashtra) Limited provides wireline voice, data, and managed telecom services to enterprise customers in Maharashtra and Goa, India. The company provides its wireline and broadband services under the Tata Tele Business Services brand name. It offers cloud and software as a services comprising content delivery network, digital survey, document management, cloud CRM, endpoint security, fee collection, and live chat services; collaboration services, such as audio and web conferencing, international bridging, and webcasting services; and connectivity services, including business broadband, centrex, Internet lease line connection, L2 multicast, leased line, PRI, SIP trunk, smart VPN, and SmartOffice, a business connectivity solution. The company also provides Internet of Things solutions comprising asset management, fleet management tracking, school bus tracking, and workforce management solutions; and marketing solutions, such as call register, digital survey, hosted OBD and IVR, SMS solutions, and toll free services. As of December 31, 2019, it provided products and services to approximately 0.8 million direct exchange lines and had 17,000 kilometers of optical fiber transmission network. The company was incorporated in 1995 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "TV18BRDCST.NS": {
        "short_name": "TV18 BROADCAST LTD",
        "long_name": "TV18 Broadcast Limited",
        "summary": "TV18 Broadcast Limited, together with its subsidiaries, operates a television broadcasting network in India. The company operates business news channels, such as CNBC-TV18, CNBC Awaaz, and CNBC Bajar; general news channels, including CNN News18, News18 International, News18 India, and News18 regional channels; History TV18, a factual entertainment channel; FYI TV18, a lifestyle channel; Hindi mass entertainment channels consisting of Colors, Colors Cineplex, and Colors Rishtey; and regional entertainment channels, such as Colors Kannada, Colors Super, Colors Kannada Cinema, Colors Bangla, Colors Marathi, Colors Gujarati and Colors Gujarati Cinema, Colors Odia, and Colors Tamil. It also operates youth and music channels, including MTV India and MTV Beats; English channels comprising COMEDY CENTRAL, COLORS INFINITY, and VH1; kids channels consisting of Nickelodeon, Sonic, Nick Jr., and Nick HD+; Voot Kids and Voot Select channels; and IndiaCast, a content asset monetization channel, as well as integrated network solutions. The company was formerly known as ibn18 Broadcast Limited and changed its name to TV18 Broadcast Limited in June 2011. TV18 Broadcast Limited was incorporated in 2005 and is based in Mumbai, India. TV18 Broadcast Limited operates as a subsidiary of Network18 Media & Investments Limited.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "TVTODAY.NS": {
        "short_name": "TV TODAY NETWORK",
        "long_name": "T.V. Today Network Limited",
        "summary": "T.V. Today Network Limited, together with its subsidiaries, engages in television programming and broadcasting activities in India. The company operates through three segments: Television Broadcasting, Radio Broadcasting, and Newspaper Publishing. It operates Aaj Tak, a Hindi news channel; India Today Television, an English news channel; Dilli Aaj Tak; and Tez, a Hindi news channel. The company also operates three FM radio stations under the ISHQ 104.8 FM brand in Delhi, Mumbai, and Kolkata; and publishes newspaper. The company was incorporated in 1999 and is based in Noida, India. T.V. Today Network Limited is a subsidiary of Living Media India Limited.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "TVVISION.NS": {
        "short_name": "TV VISION LTD",
        "long_name": "TV Vision Limited",
        "summary": "TV Vision Limited engages in the television programming and broadcasting activities in India. The company operates Mastiii, a Hindi music television channel that provides youth and music genre content; Maiboli, a regional Marathi channel, which offers songs and movies; and Dabangg, a Hindi general entertainment channel in Bihar, Uttar Pradesh, and Jharkhand. It also provides Dhamaal, a youth focused channel for Gujarat with programs, including music and gujjubhai gags, as well as shows; Dillagi, a family entertainment channel, which provides movies that cover love, family, fun, and memories; and Happii-Fi, a digital platform agnostic and content aggregator, which offers comedy content. TV Vision Limited was incorporated in 2007 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "UFO.NS": {
        "short_name": "UFO MOVIEZ INDIA",
        "long_name": "UFO Moviez India Limited",
        "summary": "UFO Moviez India Limited operates a digital cinema distribution network and in-cinema advertising platform in India, the Middle East, Nepal, and internationally. The company delivers movies through its satellite-based digital cinema distribution network using its UFO-M4 platform; and Hollywood and Indian studio content through its D-Cinema network. It also sells and leases digital cinema equipment comprising digital projectors and industrial grade digital cinema servers to cinema theatres and franchisees, as well as sells lamps and spares; sells and leases projector consumables, 3D equipment, and 3D equipment peripherals; and offers digital mastering services. In addition, the company is involved in the caravan talkies, framez, club cinema, and NOVA cinema activities; and marketing an electronic ticketing platform. As of March 31, 2020, its network consisted of 5,508 screens, including 5,298 screens in India; and 210 screens in Mexico and the United States. The company also had advertising rights to 3,792 screens, with an aggregate seating capacity of approximately 2.1 billion viewers and a reach of approximately 1,231 cities and towns in India. UFO Moviez India Limited was incorporated in 2004 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "VERTOZ.NS": {
        "short_name": "Vertoz Advertising Ltd",
        "long_name": "Vertoz Advertising Limited",
        "summary": "Vertoz Advertising Limited provides media buying and programmatic advertising solutions worldwide. Its Ingenious Plex media buying platform offers real-time trading of digital advertising between advertisers and publishers. The company was formerly known as Vertoz Media Limited and changed its name to Vertoz Advertising Limited in June 2017. Vertoz Advertising Limited was founded in 2012 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "ZEEL.NS": {
        "short_name": "ZEE ENTERTAIN ENT",
        "long_name": "Zee Entertainment Enterprises Limited",
        "summary": "Zee Entertainment Enterprises Limited, together with its subsidiaries, engages in broadcasting satellite television channels. The company broadcasts channels, including Hindi entertainment channels, such as Zee TV, Zee TV HD, &tv, &tv HD, BIG Magic, and Zee Anmol; Hindi movie channels comprising Zee Anmol Cinema, Zee Cinema, Zee Action, Zee Classic, &pictures, and Zee Bollywood, as well as Zee Cinema HD and &pictures HD; and regional entertainment channels, including Zee Marathi, Zee Yuva, Zee Bangla, Zee Tamil, Zee Telegu, Zee Kannada, Zee Sarthak, Zee Punjab, Zee Keralam, Big Ganga, Zee Talkies, Zee Bangla Cinema, Zee Cinemalu, Zee Biskope, Zee Thirai, Zee Picchar, Zee Marathi HD, Zee Talkies HD, Zee Telugu HD, and Zee Bangla HD. It also broadcasts niche channels comprising Zee CafÃ©, Zee CafÃ© HD, &privÃ© HD, Zing, &flix, &flix HD, and Zee ETC Bollywood; and ZEE5, India.com, TheHealthSite.com, Bollywoodlife.com, Cricket Country, and BGR.in digital entertainment platforms, as well as broadcasts 35 channels in the international markets. In addition, the company operates Zee Studios, a film production and distribution studio, as well as Zee Music Company, a music publishing label; operates as a space selling agent for other satellite television channels; and sells media content, which includes programs/film rights/feeds/music rights. Further, it operates Zee LIVE, a live event; and Zee Theatre, a theatre. The company has approximately 1.3 billion viewers in 173 countries worldwide. The company was formerly known as Zee Telefilms Limited and changed its name to Zee Entertainment Enterprises Limited in January 2007. Zee Entertainment Enterprises Limited was founded in 1982 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "ZEEMEDIA.NS": {
        "short_name": "ZEE MEDIA CORP",
        "long_name": "Zee Media Corporation Limited",
        "summary": "Zee Media Corpor ation Limited engages in the broadcasting of satellite television channels in India. The company also sells television programs and contents; and provides advertisement and subscription services. It serves approximately 190 million viewers through 14 news channels in 8 languages, including 1 global English news channel under the WION name; 3 national news channels comprising Zee News, Zee Hindustan, and Zee Business; 10 regional news channels, such as Zee 24 Taas, Zee Punjab Haryana Himachal, Zee Madhya Pradesh Chattisgarh, Zee Rajasthan, Zee Kalinga News, Zee Bihar Jharkhand, Zee Salaam, Zee 24 Kalak, and Zee Uttar Pradesh Uttarakhand; and Zee 24 Ghanta. The company also operates 20 digital news platforms in 12 languages, including zeenews.com/hindi, zeenews.com, zeehindustan.in, wionews.com, zeesalaam.in, zee24taas.in, zee24ghanta.com, zeephh.com, zeempcg.com, zeerajasthan.com, zeeodisha.tv, zeebiharjharkhand.com, zee24kalak.in, zeeupuk.com, zeehindustantamil.in, zeebiz.com, zeehindustantelugu.in, zeehindustankannada.in, and zeehindustanmalayalam.in, as well as operates Zee News and WION apps serving approximately 450 million users. The company was formerly known as Zee News Limited and changed its name to Zee Media Corporation Limited in July 2013. Zee Media Corporation Limited was founded in 1999 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    }
}