{
  "AFFLE.NS": {
    "city": "Gurugram",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Advertising Agencies",
    "long_name": "Affle (India) Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "Affle (India) Limited",
    "state": null,
    "summary": "Affle (India) Limited, a technology company, provides mobile advertisement services through information technology and software development services for mobiles in India and internationally. It offers MAAS platform, an end-to-end mobile advertising platform; RevX, a self-serve programmatic platform; Vizury Engage360, an omnichannel marketing platform; Mediasmart, a programmatic and proximity marketing platform; mFaaS for ad fraud detection; Shoffr, an online to offline marketing platform; mKr8, an ad authoring platform; mDMP, a data management platform; mCDP, a customer data platform for audience intelligence and engagement; affle reusable components for application development; and Marft, a multichannel commerce platform. The company serves e-commerce, fintech, gaming, healthtech, entertainment, foodtech, groceries, Edtech, government, and FMCG companies. Affle (India) Limited was incorporated in 1994 and is based in Gurugram, India.",
    "website": "http://www.affle.com",
    "zipcode": "122018"
  },
  "BCG.NS": {
    "city": "Hyderabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Advertising Agencies",
    "long_name": "Brightcom Group Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "BRIGHTCOM GROUP",
    "state": null,
    "summary": "Brightcom Group Limited provides digital marketing solutions to businesses, agencies, and online publishers worldwide. It operates through Digital Marketing and Software Development segments. The company connects advertisers with their audience across various forms of digital media to deliver messages to the right audience. The company was formerly known as Lycos Internet Limited and changed its name to Brightcom Group Limited in September 2018. Brightcom Group Limited was incorporated in 1999 and is based in Hyderabad, India.",
    "website": "http://www.brightcomgroup.com",
    "zipcode": "500032"
  },
  "PRESSMN.NS": {
    "city": "Kolkata",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Advertising Agencies",
    "long_name": "Pressman Advertising Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "PRESSMAN ADVERTISI",
    "state": null,
    "summary": "Pressman Advertising Limited operates as an advertising agency in India. The company offers advertising, design, media planning and buying, market research, and digital and public relations services, as well as sells space for print media and public relations. It serves various sectors, which include banking, insurance, and financial services; construction and real estate, consumer and lifestyle, CSR, education, food and drink, government, cement and engineering, infrastructure and mining, media and entertainment, pharma and healthcare, technology, and trade organization; and hotels, and travel and tourism. The company was incorporated in 1983 and is based in Kolkata, India.",
    "website": "http://www.pressmanadvertising.in",
    "zipcode": "700020"
  },
  "TOUCHWOOD.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Advertising Agencies",
    "long_name": "Touchwood Entertainment Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "TOUCHWOOD ENTERTAI",
    "state": null,
    "summary": "Touchwood Entertainment Limited engages in the event management activities in India. It provides wedding management, design and décor, destination wedding, entertainment, political and corporate event, curated IPs, and exhibition services. Touchwood Entertainment Limited was founded in 1997 and is based in New Delhi, India.",
    "website": "http://www.touchwood.in",
    "zipcode": "110023"
  },
  "VERTOZ.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Advertising Agencies",
    "long_name": "Vertoz Advertising Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "Vertoz Advertising Ltd",
    "state": null,
    "summary": "Vertoz Advertising Limited provides media buying and programmatic advertising solutions worldwide. Its Ingenious Plex media buying platform offers real-time trading of digital advertising between advertisers and publishers. The company was formerly known as Vertoz Media Limited and changed its name to Vertoz Advertising Limited in June 2017. Vertoz Advertising Limited was founded in 2012 and is based in Mumbai, India.",
    "website": "http://www.vertoz.com",
    "zipcode": "400080"
  }
}
