{
    "AFFLE.NS": {
        "short_name": "Affle (India) Limited",
        "long_name": "Affle (India) Limited",
        "summary": "Affle (India) Limited, a technology company, provides mobile advertisement services through information technology and software development services for mobiles in India and internationally. It offers MAAS platform, an end-to-end mobile advertising platform; RevX, a self-serve programmatic platform; Vizury Engage360, an omnichannel marketing platform; Mediasmart, a programmatic and proximity marketing platform; mFaaS for ad fraud detection; Shoffr, an online to offline marketing platform; mKr8, an ad authoring platform; mDMP, a data management platform; mCDP, a customer data platform for audience intelligence and engagement; affle reusable components for application development; and Marft, a multichannel commerce platform. The company serves e-commerce, fintech, gaming, healthtech, entertainment, foodtech, groceries, Edtech, government, and FMCG companies. Affle (India) Limited was incorporated in 1994 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gurugram"
    },
    "VERTOZ.NS": {
        "short_name": "Vertoz Advertising Ltd",
        "long_name": "Vertoz Advertising Limited",
        "summary": "Vertoz Advertising Limited provides media buying and programmatic advertising solutions worldwide. Its Ingenious Plex media buying platform offers real-time trading of digital advertising between advertisers and publishers. The company was formerly known as Vertoz Media Limited and changed its name to Vertoz Advertising Limited in June 2017. Vertoz Advertising Limited was founded in 2012 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    }
}