{
    "BAGFILMS.NS": {
        "short_name": "B.A.G. FILMS&MEDIA",
        "long_name": "B.A.G. Films and Media Limited",
        "summary": "B.A.G. Films and Media Limited, together with its subsidiaries, engages in the content production, distribution, and allied activities in India. It operates through Audio-Visual Production and Distribution, Leasing, FM Radio, and Television Broadcasting segments. The company operates News24, a national Hindi free to air news channel available; and E24, a Bollywood entertainment channel. It also operates FM radio stations under the name of Dhamaal24 in the cities of Hissar, Karnal, Patiala, Ranchi, Muzaffarpur, Dhule, Jalgaon, Ahemednagar, Simla, and Jabalpur. In addition, the company operates ISOMES, a media school; and the Greater Valley School, as well as leases properties, and production and broadcast equipment. Further, it is involved in the motion picture, video, and television programs production activities. The company was incorporated in 1993 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "ENIL.NS": {
        "short_name": "ENTERTAINMENT NETW",
        "long_name": "Entertainment Network (India) Limited",
        "summary": "Entertainment Network (India) Limited, together with its subsidiary, operates FM radio broadcasting stations in India. It operates broadcasting stations in 63 cities under the brand names of Radio Mirchi, Mirchi Love, Mirchi 95, and Kool FM; and 21 online radio stations. The company was incorporated in 1999 and is based in Mumbai, India. Entertainment Network (India) Limited is a subsidiary of Bennett, Coleman & Company Limited.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "JAINSTUDIO.NS": {
        "short_name": "JAIN STUDIOS",
        "long_name": "Jain Studios Limited",
        "summary": "Jain Studios Limited engages in the electronic media business in India. The company was incorporated in 1991 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "NDTV.NS": {
        "short_name": "NEW DELHI TELEVISI",
        "long_name": "New Delhi Television Limited",
        "summary": "New Delhi Television Limited, together with its subsidiaries, engages in television media business in India, the United States, Europe, and internationally. The company operates through two segments, Television Media and Related Operations; and Retail/E-commerce. It operates NDTV 24X7, an English news channel; NDTV India, a Hindi news channel; and NDTV Profit- NDTV Prime, a business and infotainment channel. The company also operates various e-commerce platforms, such as Car and Bike.com, Gadgets 360Â°, BandBaajaa.com, SmartCooky, and Mojarto.com. New Delhi Television Limited was founded in 1988 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "NEXTMEDIA.NS": {
        "short_name": "NEXT MEDIAWORKS LT",
        "long_name": "Next Mediaworks Limited",
        "summary": "Next Mediaworks Limited, through its subsidiary, engages in radio broadcasting in India. It operates FM stations under the Radio One brand in Delhi, Mumbai, Chennai, Kolkata, Bengaluru, Pune, and Ahmedabad. The company was formerly known as Mid-Day Multimedia Limited and changed its name to Next Mediaworks Limited. Next Mediaworks Limited was incorporated in 1981 and is based in Mumbai, India. Next Mediaworks Limited is a subsidiary of HT Media Limited.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "RAJTV.NS": {
        "short_name": "RAJ TEL NETWORK",
        "long_name": "Raj Television Network Limited",
        "summary": "Raj Television Network Limited operates as a television satellite broadcaster in south India. It operates 14 channels in Tamil, Telugu, Kannada, Malayalam, and Hindi languages that broadcast movies, serials, debates, cultural, educational, cookery, handicrafts, comedy shows, game shows, music shows, news time, and religious programs in India, as well as parts of South East Asia, the Middle East, the United States, Europe, MENAP, Africa, and APAC regions. The company also provides advertisement services, as well as engages in subscription of channels. In addition, it is involved in the movie production and distribution business; and export of films in foreign market and Web casting movie content over the Internet. The company was founded in 1994 and is headquartered in Chennai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "SABTN.NS": {
        "short_name": "SRI ADHIKARI BROS",
        "long_name": "Sri Adhikari Brothers Television Network Limited",
        "summary": "Sri Adhikari Brothers Television Network Limited engages in the content production and distribution businesses in India. It is also involved in the syndication of various content to broadcasters, aggregators, and satellite networks. The company operates MASTIII, a music channel; Dabangg, a Hindi general entertainment channel; Dhamaal Gujarat, a youth focused regional channel; a Maiboli, a Marathi channel; and Dillagi, a movie channel. Sri Adhikari Brothers Television Network Limited was founded in 1985 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "SUNTV.NS": {
        "short_name": "SUN TV NETWORK LTD",
        "long_name": "Sun TV Network Limited",
        "summary": "Sun TV Network Limited, together with its subsidiaries, engages in producing and broadcasting satellite television and radio software programming in the regional languages of South India. The company's flagship channel includes Sun TV. It also operates various other satellite channels, such as Surya TV, Gemini TV, and Udaya TV; SUN Bangla, an entertainment channel in Bengali; and SUNNXT, an OTT platform. The company operates television channels in Tamil, Telugu, Kannada, and Malayalam languages for viewers in India, Sri Lanka, Singapore, Malaysia, the United Kingdom, rest of Europe, the Middle East, the United States, Australia, South Africa, and Canada; and 24 frequency modulation radio stations across India. It provides entertainment in various genres of general entertainment, movies, music, news, kids, action, and life. The company is also involved in the theatrical distribution of movies; and the operation of SunRisers Hyderabad, an Indian Premier League franchise. In addition, it offers direct to home services. The company was incorporated in 1985 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "TVTODAY.NS": {
        "short_name": "TV TODAY NETWORK",
        "long_name": "T.V. Today Network Limited",
        "summary": "T.V. Today Network Limited, together with its subsidiaries, engages in television programming and broadcasting activities in India. The company operates through three segments: Television Broadcasting, Radio Broadcasting, and Newspaper Publishing. It operates Aaj Tak, a Hindi news channel; India Today Television, an English news channel; Dilli Aaj Tak; and Tez, a Hindi news channel. The company also operates three FM radio stations under the ISHQ 104.8 FM brand in Delhi, Mumbai, and Kolkata; and publishes newspaper. The company was incorporated in 1999 and is based in Noida, India. T.V. Today Network Limited is a subsidiary of Living Media India Limited.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "TVVISION.NS": {
        "short_name": "TV VISION LTD",
        "long_name": "TV Vision Limited",
        "summary": "TV Vision Limited engages in the television programming and broadcasting activities in India. The company operates Mastiii, a Hindi music television channel that provides youth and music genre content; Maiboli, a regional Marathi channel, which offers songs and movies; and Dabangg, a Hindi general entertainment channel in Bihar, Uttar Pradesh, and Jharkhand. It also provides Dhamaal, a youth focused channel for Gujarat with programs, including music and gujjubhai gags, as well as shows; Dillagi, a family entertainment channel, which provides movies that cover love, family, fun, and memories; and Happii-Fi, a digital platform agnostic and content aggregator, which offers comedy content. TV Vision Limited was incorporated in 2007 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    }
}