{
    "DGCONTENT.NS": {
        "short_name": "Digicontent Limited",
        "long_name": "Digicontent Limited",
        "summary": "Digicontent Limited operates in the entertainment and digital innovation business in India. The company operates desimartini.com, a movie reviews and ratings Website that has a base of users who read movies reviews, entertainment news, and martini shots, as well as provides content sourcing services. It is also involved in the aggregation and creation of audio and multi-screen videos; and distribution of in-house creative and niche celeb based content to mobile and digital users, as well as operates an audio feed that plays music inside across various stores. In addition, the company maintains repository of images; and carries out media tool to build, promote, and amplify brand communication, as well as covers various brand activities, such as events promotions, parties, campaigns, and product launches in various HT media platforms. Further, it is involved in the dissemination of news, knowledge, information, entertainment, and content of general interest in English, Hindi, and any other language through various digital and economic media; and management of advertising time and space on its news websites, such as hindustantimes.com, livemint.com, and livehindustan.com. The company was formerly known as HT Digital Ventures Limited and changed its name to Digicontent Limited in October 2017. Digicontent Limited was incorporated in 2017 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.digicontent.co.in",
        "market_cap": 570370944
    },
    "INDIAMART.NS": {
        "short_name": "IndiaMART InterMESH Ltd",
        "long_name": "IndiaMART InterMESH Limited",
        "summary": "IndiaMART InterMESH Limited operates an online B2B marketplace that connects buyers with suppliers in India and internationally. Its platform serves small and medium enterprises, large enterprises, and individuals. The company was founded in 1996 and is headquartered in Noida, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201305",
        "website": "http://www.indiamart.com",
        "market_cap": 216927977472
    },
    "JUSTDIAL.NS": {
        "short_name": "JUST DIAL LTD",
        "long_name": "Just Dial Limited",
        "summary": "Just Dial Limited engages in the search engine business under the Justdial brand name in India and internationally. The company offers local search, search related, and software services through various platforms, including internet, mobile internet, over the telephone, and text. It also provides review and rating certification services under the JD Ratings name; and online payment services under the JD Pay name. In addition, the company engages in advertising and events businesses; and the operation of JD Social, a social media platform, as well as Search Plus, JD Maps, JD Omni, and other platforms. Further, it offers website development and maintenance services. As of July 31, 2020, the company had a database of 29.6 million listings. Just Dial Limited was incorporated in 1993 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400064",
        "website": "http://www.justdial.com",
        "market_cap": 59045171200
    },
    "MATRIMONY.NS": {
        "short_name": "MATRIMONY COM LTD",
        "long_name": "Matrimony.com Limited",
        "summary": "Matrimony.com Limited online matchmaking services on internet and mobile platforms in India and internationally. The company operates through Matchmaking Services and Marriage Services segments. The company operates matrimonial sites, including BharatMatrimony.com, BengaliMatrimony.com, GujaratiMatrimony.com, HindiMatrimony.com, KannadaMatrimony.com, KeralaMatrimony.com, MarathiMatrimony.com, MarwadiMatrimony.com, OriyaMatrimony.com, PunjabiMatrimony.com, TamilMatrimony.com, TeluguMatrimony.com, UrduMatrimony.com, AssameseMatrimony.com, ParsiMatrimony.com, and SindhiMatrimony.com. It also operates regional matrimonial sites through MuslimMatrimony.com, ChristianMatrimony.com, SikhMatrimony.com, JainMatrimony.com, and BuddhistMatrimony.com; and offers social services through BharatBloodBank.com, BharatEyeBank.org, AbilityMatrimony.com, and HappyMarriages.com. In addition, the company operates community based sites, such as CommunityMatrimony.com; and exclusive matrimonial sites comprising EliteMatrimony.com, DivorceeMatrimony.com, ManglikMatrimony.com, and DefenceMatrimony.com. Further, it operates Matrimonybazar.com and Matrimonymandap.com to provide related marriage services that include wedding planners, venues, cards, and caterers, as well as mandap services. It operates approximately 148 retail outlets. The company was founded in 1997 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600028",
        "website": "http://www.matrimony.com",
        "market_cap": 22891911168
    },
    "NAUKRI.NS": {
        "short_name": "INFO EDGE",
        "long_name": "Info Edge (India) Limited",
        "summary": "Info Edge (India) Limited operates as an online classifieds company in the areas of recruitment, matrimony, real estate, and education and related services in India and internationally. It operates through Recruitment Solutions, 99acres, and Other segments. The company offers recruitment services through naukri.com, an online job website for job seekers and corporate customers, including hiring consultants/firms; firstnaukri.com, a job search network for college students and recent graduates; naukrigulf.com, a website catering to Middle East job markets; and quadranglesearch.com, a site that provides offline placement services to middle and senior management, as well as www.ambitionbox.com, www.jobhai.com, and www.bigshyft.com. It also provides 99acres.com, which offers listing of properties for sale, purchase, and rent; Jeevansathi.com, an online matrimonial classifieds services; and shiksha.com, an education classified website that helps students to decide their undergraduate and postgraduate options by providing useful information on careers, exams, colleges, and courses. In addition, it provides software consultancy and supply services; database services, including database processing and tabulation, online information and data retrieval, electronic data interchange, web search portal content, code and protocol conversion services, etc.; internet, computer, and electronic and related services; technical support; and other services in the field of information technology and product development, as well as brokerage services in the real estate sector. Additionally, the company is involved in the development of software, as well as acts as an investment adviser, financial and management consultant, investment manager, and sponsor of alternative investment funds. It also provides advertising space for colleges and universities on www.shiksha.com.Info Edge (India) Limited was incorporated in 1995 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201304",
        "website": "http://www.infoedge.in",
        "market_cap": 602367852544
    },
    "REDFY": {
        "short_name": "REDIFF.COM INDIA",
        "long_name": "Rediff.com India Limited",
        "summary": "Rediff.com India Limited provides online Internet based services in India and to the global Indian community. The company delivers news and information, enterprise email services, online shopping marketplace, and internet-based local TV advertising platform. Its websites provides sports and cricket; life style and movies; content on news, business, and finance; search facilities; and e-mail and shopping related channels. The company delivers its services on PCs, tablets, and mobile platforms. Rediff.com India Limited was founded in 1996 and is headquartered in Mumbai, India.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400016",
        "website": "http://www.rediff.com",
        "market_cap": 4646666
    }
}