{"HMCN.MX": {"short_name": "HONDA MOTOR CO", "long_name": "Honda Motor Co., Ltd.", "summary": "Honda Motor Co., Ltd. develops, manufactures, and distributes motorcycles, automobiles, power products, and other products in japan, North America, Europe, Asia, and internationally. It operates through four segments: Motorcycle Business, Automobile Business, Financial Services Business, and Life creation and Other Businesses. The Motorcycle Business segment produces motorcycles, including sports, business, and commuter models; and various off-road vehicles, such as all-terrain vehicles and side-by-sides. The Automobile Business segment offers passenger cars, light trucks, and mini vehicles. The Financial Services Business segment provides various financial services, including retail lending and leasing services to customers, as well as wholesale financing services to dealers. The Life creation and Other Businesses segment manufactures and sells power products, such as general purpose engines, generators, water pumps, lawn mowers, riding mowers, robotic mowers, brush cutters, tillers, snow blowers, outboard marine engines, walking assist devices, and portable battery inverter power sources. This segment also offers HondaJet aircraft. The company also sells spare parts; and provides after-sale services through retail dealers directly, as well as through independent distributors and licensees. Honda Motor Co., Ltd. was founded in 1946 and is headquartered in Tokyo, Japan.", "currency": "MXN", "sector": "Consumer Goods", "industry": "Auto Manufacturers - Major", "exchange": "MEX", "market": "mx_market", "country": "Japan", "city": "Tokyo"}, "NSANYN.MX": {"short_name": "NISSAN MOTOR CO", "long_name": "Nissan Motor Co., Ltd.", "summary": "Nissan Motor Co., Ltd. manufactures and sells vehicles and automotive parts worldwide. It sells vehicles under the Nissan, Infiniti, Datsun, Heritage, and Motorsports brands. The company offers vehicle and vehicle parts; engines, manual transmissions, and multiplier/reducer units; automotive parts; axles; specially equipped vehicles; and motorsports engines. It also provides financial services, auto credit and car leasing, card business, insurance agency, and inventory finance, as well as engages in exterior and interior design for automobiles, and operations and consulting related to the analysis and assay of raw materials. In addition, the company engages in the provision of travel, environmental and engineering, production technology center, and facility services; ground and vehicle management, and information and logistics businesses; design, vehicle drawings and experiments, other engineering, electronic devices, and electronic equipment businesses; export and import of auto components and materials; and real estate businesses. Further, it is involved in promotion of motorsports, including race and motorsports event planning, and vehicle remodeling; sale of car parts and accessories for motorsports; and demonstration test and commercialization study for second-life use of lithium-ion batteries for automotive use. Additionally, the company imports and sells Renault vehicles and parts; and manages and plans professional soccer team and soccer schools. The company was founded in 1933 and is headquartered in Yokohama, Japan.", "currency": "MXN", "sector": "Consumer Goods", "industry": "Auto Manufacturers - Major", "exchange": "MEX", "market": "mx_market", "country": "Japan", "city": "Yokohama"}}