{"ATIC.JK": {"short_name": "Anabatic Technologies Tbk.", "long_name": "PT Anabatic Technologies Tbk", "summary": "PT Anabatic Technologies Tbk, through its subsidiaries, provides mission critical digital solution, digital outsourcing, and cloud and digital platform partner services in Indonesia. The company offers mission-critical solutions that cover end to end application, including hardware and software implementation, customization, and routine maintenance, as well as IT security solutions. It also provides business process outsourcing services related to human resources, such as temporary staffing, recruitment processing, digital sourcing, and employee hotline contact center services. In addition, the company offers IT infrastructure solutions that include high-end servers, storage, enterprise software, networks, and security for B2B customers. Further, the company engages in the trading and service, property, integrity system, building management, interior construction, Web design, office supplies and spare parts trading, computer and electronic trading, system integration, management consultation and software, money remittance, commodity trading, payment point online banking, and e-commerce activities. It serves banking, telecommunication, and pharmaceutical industries, as well as governments. The company was founded in 2001 and is headquartered in Tangerang, Indonesia. PT Anabatic Technologies Tbk is a subsidiary of PT Artha Investama Jaya.", "currency": "IDR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Tangerang"}, "BLUE.JK": {"short_name": "Berkah Prima Perkasa Tbk.", "long_name": "PT Berkah Prima Perkasa Tbk", "summary": "PT Berkah Prima Perkasa Tbk engages in trading and printing businesses in Indonesia. PT Berkah Prima Perkasa Tbk was founded in 2014 and is based in North Jakarta, Indonesia.", "currency": "IDR", "sector": "Technology", "industry": "Electronics & Computer Distribution", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Utara"}, "CASH.JK": {"short_name": "Cashlez Worldwide Indonesia Tbk", "long_name": "PT Cashlez Worldwide Indonesia Tbk", "summary": "PT Cashlez Worldwide Indonesia Tbk engages in the digital financial technology and payment services businesses in Indonesia. It creates mPOS (mobile point of sales) system, a concept of accepting payments using credit and debit cards or application-based debit cards on smartphones connected by a card reader through Bluetooth. The company provides applications that provide payment facilities, accepting payments using credit cards, debit cards, and digital payments, such as QR Code, Cashlez Link, OVO, and Go-Pay. Its products include Cashlez One, a payment instrument that can process various types of payment methods; Cashlez reader non printers; Cashlez reader printers; and Smartpoz, a POS application that facilitates business owners in running their business. PT Cashlez Worldwide Indonesia Tbk was founded in 2015 and is headquartered in West Jakarta, Indonesia.", "currency": "IDR", "sector": "Technology", "industry": "Software—Infrastructure", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Barat"}, "CCSI.JK": {"short_name": "Communication Cable Systems Ind", "long_name": "PT Communication Cable Systems Indonesia Tbk", "summary": "PT Communication Cable Systems Indonesia Tbk manufactures and sells optical fiber cables in Indonesia and internationally. The company also produces submarine cables; indoor, outdoor, and special cables; HDPE pipes; and accessories. It serves Internet telecommunication, oil and gas, power utility, railway transport authority, and private industries. The company was formerly known as PT. Siemens Kabel Optik. PT Communication Cable Systems Indonesia Tbk was founded in 1996 and is headquartered in Jakarta, Indonesia.", "currency": "IDR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "DCII.JK": {"short_name": "DCI Indonesia Tbk.", "long_name": "PT DCI Indonesia Tbk", "summary": "PT DCI Indonesia Tbk provides cloud and carrier neutral data center infrastructure services in Indonesia. It offers dedicated and shared space colocation services; cross connect services; Flexspace, which offers units of working space services; onsite technical support services; CloudConnect, an interconnection for enterprises; and DCI Internet Exchange. The company was founded in 2011 and is based in Jakarta, Indonesia. PT DCI Indonesia Tbk is a subsidiary of DCI International Holding Pte. Ltd.", "currency": "IDR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "DIVA.JK": {"short_name": "Distribusi Voucher Nusantara Tb", "long_name": "PT Distribusi Voucher Nusantara Tbk", "summary": "PT Distribusi Voucher Nusantara Tbk sells electric vouchers and operates as dealer of telecommunication products in Indonesia. It develops Diva Smart Outlet, a sales force automation platform for retailers or distributors for managing businesses; and Diva intelligent instant messaging, an instant messaging platform for B2B customers in the telecommunication, banking, and travel and tourism sectors. The company was founded in 2003 and is based in South Jakarta, Indonesia. PT Distribusi Voucher Nusantara Tbk is a subsidiary of PT 1 Inti Dot Com.", "currency": "IDR", "sector": "Technology", "industry": "Software—Application", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "South Jakarta"}, "ENVY.JK": {"short_name": "Envy Technologies Indonesia Tbk", "long_name": "PT Envy Technologies Indonesia Tbk", "summary": "PT Envy Technologies Indonesia Tbk provides solutions and services for digital cyber security, system integration and information, and telecommunication system integration. The company offers digital cyber security services, such as security incident, perimeter, and vulnerabilities management, as well as security events monitoring and on-site professional assistance; and telecommunication system integration services comprising core network hardware installation, and data communication and digital transmission system services. It also provides system integration and information services, including software, hardware, and hybrid information technology installation; data center and data recovery center; system integration e-commerce; security operation center; and cloud cyber security system integration. The company was founded in 2004 and is based in Kuningan, Indonesia.", "currency": "IDR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Kuningan"}, "GLVA.JK": {"short_name": "Galva Technologies Tbk.", "long_name": "PT Galva Technologies Tbk", "summary": "PT Galva Technologies Tbk supplies electronic products in Indonesia. The company operates through Business Solutions, IT Distribution, and Printing Solutions segments. It primarily sells computers, printers, displays, and audio-video equipment. The company also sells broadcasting products, audio visual and media products, PA and communication products, professional audio and lighting products, digital signage products, security systems, projectors, and accessories. In addition, it offers system integration, design, installation, integration, maintenance, and engineering support services; and a range of hardware and business process solutions, including scanning, archiving, document management, and managed print services, as well as distributes software. The company was founded in 1991 and is based in Jakarta Pusat, Indonesia. PT Galva Technologies Tbk is a subsidiary of PT Elsiscom Prima Karya.", "currency": "IDR", "sector": "Technology", "industry": "Electronics & Computer Distribution", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Pusat"}, "HDIT.JK": {"short_name": "Hensel Davest Indonesia Tbk.", "long_name": "PT Hensel Davest Indonesia Tbk", "summary": "PT Hensel Davest Indonesia Tbk engages in the financial technology and e-commerce business in Indonesia. It offers mobile bill payment application under the DavestPay brand, as well as a payment point service for business owners; operates an e-commerce platform to facilitate business owners to have their own e-commerce marketplace; and provides integrated financial services, such as money transfer, multifinance, lending, and payment gateway. The company was founded in 2013 and is based in South Jakarta, Indonesia.", "currency": "IDR", "sector": "Technology", "industry": "Software—Application", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "South Jakarta"}, "JSKY.JK": {"short_name": "Sky Energy Indonesia Tbk.", "long_name": "PT Sky Energy Indonesia Tbk", "summary": "PT Sky Energy Indonesia Tbk manufactures and sells solar modules for homes, and commercial and government sectors worldwide. The company offers polycrystalline, monocrystalline, and flexible solar panels, as well as portable solar kits and accessories; light-emitting diode bulbs, lamps, and lights; solar mounting systems; solar inverters and monitoring solutions; and energy storage solutions. It is also involved in the technical design, installation, and maintenance of solar power plants. The company was founded in 2008 and is based in Bogor, Indonesia.", "currency": "IDR", "sector": "Technology", "industry": "Solar", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Bogor"}, "KBLM.JK": {"short_name": "Kabelindo Murni Tbk.", "long_name": "PT Kabelindo Murni Tbk", "summary": "PT Kabelindo Murni Tbk manufactures cables and other related products for telecommunication industries and for the distribution of electricity in Indonesia. It offers bare conductors and twisted cables; low voltage power cables, such as building, control, and instrument cables; medium voltage power cables; and flexible cables. The company also provides special cables for industrial installation, such as power stations, oil and petrochemical plants, high-rise buildings, mass transit underground passenger systems, and control connection networks. In addition, it provides construction services. The company was formerly known as PT Kabel Indonesia and changed its name to PT Kabelindo Murni Tbk in 1979. PT Kabelindo Murni Tbk was founded in 1972 and is based in Jakarta, Indonesia.", "currency": "IDR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "KIOS.JK": {"short_name": "Kioson Komersial Indonesia Tbk.", "long_name": "PT Kioson Komersial Indonesia Tbk", "summary": "PT Kioson Komersial Indonesia Tbk, a technology company, provides telecommunications infrastructure services in Indonesia. It offers payment counters, credit sales, data packages, and sales of insurance products and financial services. The company engages in the trading, development, industrial printing, transportation, workshop, and agriculture business; and trade of telecommunications equipment, computers and spare parts, and mobile phone topup vouchers, as well as acts as distributor, agent, and as representative of agencies or engineering companies. The company was founded in 2015 and is headquartered in South Jakarta, Indonesia.", "currency": "IDR", "sector": "Technology", "industry": "Software—Application", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Selatan"}, "KPAY": {"short_name": "KINERJAPAY CORP", "long_name": "KinerjaPay Corp.", "summary": "KinerjaPay Corp. operates an e-commerce platform in Indonesia. The company's platform, KinerjaPay IP, an e-wallet service for bill transfers and online shopping; and allows top-up phone credit for users. It also provides KMALL, a virtual marketplace for B2B and B2C online transactions; and KGAMES that develops games. The company was formerly known as Solarflex Corp and changed its name to KinerjaPay Corp on February 2016. KinerjaPay Corp. was founded in 2010 and is based in Medan, Indonesia.", "currency": "USD", "sector": "Technology", "industry": "Software—Infrastructure", "exchange": "PNK", "market": "us_market", "country": "Indonesia", "city": "Medan"}, "LMAS.JK": {"short_name": "Limas Indonesia Makmur Tbk", "long_name": "PT Limas Indonesia Makmur Tbk", "summary": "PT Limas Indonesia Makmur Tbk provides stock information and news services, and value added telephone services primarily in Indonesia. It is also involved in the trading of hardware and software; and provision of supporting facility and information technology consultancy services. The company was formerly known as PT Limas Centric Indonesia Tbk and changed its name to PT Limas Indonesia Makmur Tbk in August 2014. PT Limas Indonesia Makmur Tbk was founded in 1996 and is based in Jakarta, Indonesia.", "currency": "IDR", "sector": "Technology", "industry": "Electronics & Computer Distribution", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "LUCK.JK": {"short_name": "Sentral Mitra Informatika Tbk.", "long_name": "PT Sentral Mitra Informatika Tbk", "summary": "PT Sentral Mitra Informatika Tbk provides hardware, software solutions, and services in Indonesia. The company operates through two segments, Trading and Rentals. It sells electronic items; and provides printer rental, click, and other services. The company was founded in 2008 and is based in Jakarta Selatan, Indonesia.", "currency": "IDR", "sector": "Technology", "industry": "Computer Hardware", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Selatan"}, "MKNT.JK": {"short_name": "Mitra Komunikasi Nusantara Tbk.", "long_name": "PT Mitra Komunikasi Nusantara Tbk", "summary": "PT Mitra Komunikasi Nusantara Tbk distributes and sells telecommunication products in Indonesia. The company offers smartphones, tablets/pads, prepaid vouchers, SIM cards, and network products. It also sells its products online. The company was founded in 2008 and is headquartered in South Jakarta, Indonesia.", "currency": "IDR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Selatan"}, "MLPT.JK": {"short_name": "Multipolar Technology Tbk.", "long_name": "PT Multipolar Technology Tbk", "summary": "PT Multipolar Technology Tbk provides information technology (IT) consulting, system integration, and IT systems management services in Indonesia. It offers IT hardware and integration services and network security appliances, including network infrastructure, enterprise server, enterprise storage, and self-service solutions; and application systems, such as banking, high availability, information management, business analytics, enterprise business, service oriented architecture, security, virtualization, and enterprise project management solutions, as well as related implementation services. The company also provides IT consulting services, which include IT strategy/IT planning, IT project management, and IT operations consulting services; and business process managed services comprising field operation managed, branch IT, merchant IT, IT operation managed, IT application managed, contact center, and mobile and payment services. It serves financial, telecommunication, government, health care, manufacturing, oil and gas, retail, and distribution sectors. The company was founded in 1975 and is headquartered in Jakarta, Indonesia. PT Multipolar Technology Tbk is a subsidiary of PT Multipolar Tbk.", "currency": "IDR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "MTDL.JK": {"short_name": "Metrodata Electronics Tbk.", "long_name": "P.T. Metrodata Electronics Tbk", "summary": "P.T. Metrodata Electronics Tbk, together with its subsidiaries, engages in the information communication and technology (ICT) business in Indonesia and internationally. The company's Distribution division sells hardware and software, and basic peripherals. Its Solution division provides maintenance services; sells hardware, system management software, middleware, serverware, and system level software; and rents hardware and software products. This division also offers solutions in the areas of design and blue print, consulting, implementation, support, maintenance, managed services, and certified training. The company's Consultation division provides professional services for consultation, implementation, and training; and sells software products. P.T. Metrodata Electronics Tbk also offers business transformation solutions; ICT retail products directly to the consumers as the end users; assembly services in computer field or wireless communication equipment area; and system integration services, as well as provides information technology products and personal computer products. The company was founded in 1983 and is based in Jakarta, Indonesia.", "currency": "IDR", "sector": "Technology", "industry": "Electronics & Computer Distribution", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "PTSN.JK": {"short_name": "Sat Nusapersada Tbk", "long_name": "PT Sat Nusapersada Tbk", "summary": "PT Sat Nusapersada Tbk provides electronic manufacturing services in Indonesia. The company offers metal stamping services for the electronics industry; management consulting services; and plastic molding and assembling services. It provides components, parts, and assemblies for network equipment and computers, consumer electronics and devices, multimedia peripherals, and automotive electronic components. The company also has operations in Singapore, Malaysia, Japan, the Philippines, Europe, and the United States. PT Sat Nusapersada Tbk was founded in 1990 and is headquartered in Batam, Indonesia.", "currency": "IDR", "sector": "Technology", "industry": "Electronic Components", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Batam"}, "SCNP.JK": {"short_name": "Selaras Citra Nusantara Perkasa", "long_name": "PT Selaras Citra Nusantara Perkasa Tbk", "summary": "PT Selaras Citra Nusantar Perkasa Tbk produces and sells household appliance products and medical equipment in Indonesia. It offers blenders, electric irons, gas stoves, electric fans, and air purifiers. The company is based in Bogor, Indonesia. PT Selaras Citra Nusantar Perkasa Tbk operates as a subsidiary of PT Sena Dwimakmur.", "currency": "IDR", "sector": "Technology", "industry": "Consumer Electronics", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Bogor"}, "SLIS.JK": {"short_name": "Gaya Abadi Sempurna Tbk.", "long_name": "PT Gaya Abadi Sempurna Tbk", "summary": "PT Gaya Abadi Sempurna Tbk develops and trades in electric vehicles and electronic products in Indonesia. It offers electric bicycles and motors, and MTB electric bicycles; and fans and LED light products. The company was founded in 1996 and is headquartered in Tangerang, Indonesia. PT Gaya Abadi Sempurna Tbk is a subsidiary of PT Selis Investama Indonesia.", "currency": "IDR", "sector": "Technology", "industry": "Electronics & Computer Distribution", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Tangerang"}, "SUPR.JK": {"short_name": "Solusi Tunas Pratama Tbk.", "long_name": "PT Solusi Tunas Pratama Tbk", "summary": "PT Solusi Tunas Pratama Tbk operates as an independent tower company in Indonesia. The company operates and rents base transceiver station (BTS) tower buildings or telecommunications towers, and other related telecommunication infrastructure. It operates greenfield and rooftop telecommunication towers, including four-legged supporting towers, three-legged self-supporting towers, camouflage towers, monopoles, and roof top towers, as well as mobile BTS. The company was founded in 2006 and is headquartered in Jakarta, Indonesia. PT Solusi Tunas Pratama Tbk is a subsidiary of PT Kharisma Indah Ekaprima.", "currency": "IDR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "WIFI.JK": {"short_name": "Solusi Sinergi Digital Tbk.", "long_name": "PT Solusi Sinergi Digital Tbk", "summary": "PT Solusi Sinergi Digital Tbk engages in the network infrastructure, application and software, out of home advertising media, and digital advertising businesses. The company operates fiber optic infrastructure, point of presence infrastructure, and base transceiver station towers. It also provides mobile apps, software integration, and web applications; and integrated advertising media in out of home environment. The company was founded in 2014 and is based in Jakarta, Indonesia.", "currency": "IDR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}}