{"ATIC.JK": {"short_name": "Anabatic Technologies Tbk.", "long_name": "PT Anabatic Technologies Tbk", "summary": "PT Anabatic Technologies Tbk, through its subsidiaries, provides mission critical digital solution, digital outsourcing, and cloud and digital platform partner services in Indonesia. The company offers mission-critical solutions that cover end to end application, including hardware and software implementation, customization, and routine maintenance, as well as IT security solutions. It also provides business process outsourcing services related to human resources, such as temporary staffing, recruitment processing, digital sourcing, and employee hotline contact center services. In addition, the company offers IT infrastructure solutions that include high-end servers, storage, enterprise software, networks, and security for B2B customers. Further, the company engages in the trading and service, property, integrity system, building management, interior construction, Web design, office supplies and spare parts trading, computer and electronic trading, system integration, management consultation and software, money remittance, commodity trading, payment point online banking, and e-commerce activities. It serves banking, telecommunication, and pharmaceutical industries, as well as governments. The company was founded in 2001 and is headquartered in Tangerang, Indonesia. PT Anabatic Technologies Tbk is a subsidiary of PT Artha Investama Jaya.", "currency": "IDR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Tangerang"}, "DCII.JK": {"short_name": "DCI Indonesia Tbk.", "long_name": "PT DCI Indonesia Tbk", "summary": "PT DCI Indonesia Tbk provides cloud and carrier neutral data center infrastructure services in Indonesia. It offers dedicated and shared space colocation services; cross connect services; Flexspace, which offers units of working space services; onsite technical support services; CloudConnect, an interconnection for enterprises; and DCI Internet Exchange. The company was founded in 2011 and is based in Jakarta, Indonesia. PT DCI Indonesia Tbk is a subsidiary of DCI International Holding Pte. Ltd.", "currency": "IDR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "ENVY.JK": {"short_name": "Envy Technologies Indonesia Tbk", "long_name": "PT Envy Technologies Indonesia Tbk", "summary": "PT Envy Technologies Indonesia Tbk provides solutions and services for digital cyber security, system integration and information, and telecommunication system integration. The company offers digital cyber security services, such as security incident, perimeter, and vulnerabilities management, as well as security events monitoring and on-site professional assistance; and telecommunication system integration services comprising core network hardware installation, and data communication and digital transmission system services. It also provides system integration and information services, including software, hardware, and hybrid information technology installation; data center and data recovery center; system integration e-commerce; security operation center; and cloud cyber security system integration. The company was founded in 2004 and is based in Kuningan, Indonesia.", "currency": "IDR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Kuningan"}, "MLPT.JK": {"short_name": "Multipolar Technology Tbk.", "long_name": "PT Multipolar Technology Tbk", "summary": "PT Multipolar Technology Tbk provides information technology (IT) consulting, system integration, and IT systems management services in Indonesia. It offers IT hardware and integration services and network security appliances, including network infrastructure, enterprise server, enterprise storage, and self-service solutions; and application systems, such as banking, high availability, information management, business analytics, enterprise business, service oriented architecture, security, virtualization, and enterprise project management solutions, as well as related implementation services. The company also provides IT consulting services, which include IT strategy/IT planning, IT project management, and IT operations consulting services; and business process managed services comprising field operation managed, branch IT, merchant IT, IT operation managed, IT application managed, contact center, and mobile and payment services. It serves financial, telecommunication, government, health care, manufacturing, oil and gas, retail, and distribution sectors. The company was founded in 1975 and is headquartered in Jakarta, Indonesia. PT Multipolar Technology Tbk is a subsidiary of PT Multipolar Tbk.", "currency": "IDR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "WIFI.JK": {"short_name": "Solusi Sinergi Digital Tbk.", "long_name": "PT Solusi Sinergi Digital Tbk", "summary": "PT Solusi Sinergi Digital Tbk engages in the network infrastructure, application and software, out of home advertising media, and digital advertising businesses. The company operates fiber optic infrastructure, point of presence infrastructure, and base transceiver station towers. It also provides mobile apps, software integration, and web applications; and integrated advertising media in out of home environment. The company was founded in 2014 and is based in Jakarta, Indonesia.", "currency": "IDR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}}