{
    "DIVA.JK": {
        "short_name": "Distribusi Voucher Nusantara Tb",
        "long_name": "PT Distribusi Voucher Nusantara Tbk",
        "summary": "PT Distribusi Voucher Nusantara Tbk sells electric vouchers and operates as dealer of telecommunication products in Indonesia. It develops Diva Smart Outlet, a sales force automation platform for retailers or distributors for managing businesses; and Diva intelligent instant messaging, an instant messaging platform for B2B customers in the telecommunication, banking, and travel and tourism sectors. The company was founded in 2003 and is based in South Jakarta, Indonesia. PT Distribusi Voucher Nusantara Tbk is a subsidiary of PT 1 Inti Dot Com.",
        "currency": "IDR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "South Jakarta",
        "zipcode": "12940",
        "website": "http://www.ptdvn.com",
        "full_time_employees": 180
    },
    "HDIT.JK": {
        "short_name": "Hensel Davest Indonesia Tbk.",
        "long_name": "PT Hensel Davest Indonesia Tbk",
        "summary": "PT Hensel Davest Indonesia Tbk engages in the financial technology and e-commerce business in Indonesia. It offers mobile bill payment application under the DavestPay brand, as well as a payment point service for business owners; operates an e-commerce platform to facilitate business owners to have their own e-commerce marketplace; and provides integrated financial services, such as money transfer, multifinance, lending, and payment gateway. The company was founded in 2013 and is based in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "South Jakarta",
        "zipcode": "12870",
        "website": "http://www.hdi.co.id",
        "full_time_employees": 10
    },
    "KIOS.JK": {
        "short_name": "Kioson Komersial Indonesia Tbk.",
        "long_name": "PT Kioson Komersial Indonesia Tbk",
        "summary": "PT Kioson Komersial Indonesia Tbk, a technology company, provides telecommunications infrastructure services in Indonesia. It offers payment counters, credit sales, data packages, and sales of insurance products and financial services. The company engages in the trading, development, industrial printing, transportation, workshop, and agriculture business; and trade of telecommunications equipment, computers and spare parts, and mobile phone topup vouchers, as well as acts as distributor, agent, and as representative of agencies or engineering companies. The company was founded in 2015 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12940",
        "website": "http://www.kioson.com",
        "full_time_employees": 88
    }
}