{
    "BGLC": {
        "short_name": "BIONEXUS GENE LAB CORP",
        "long_name": "BioNexus Gene Lab Corporation",
        "summary": "BioNexus Gene Lab Corporation, a molecular diagnostics company, develops and commercializes molecular diagnostic tests for the early detection of diseases and personalized health management, primarily focusing on cardiovascular, diabetes, and cancer-related indications primarily in Malaysia. Its non-invasive blood tests are used to analyze changes in ribonucleic acid for the detection of cancers, including nasopharyngeal, lung, liver, stomach, breast, cervical, prostate, and colon; bowel diseases, such as colitis and Crohn; and osteoarthritis. The company markets its blood screening process to health care providers, such as doctors, laboratories, and hospitals. BioNexus Gene Lab Corporation was founded in 2017 and is based in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "city": "Kuala Lumpur"
    },
    "BVA.SI": {
        "short_name": "Top Glove",
        "long_name": "Top Glove Corporation Bhd.",
        "summary": "Top Glove Corporation Bhd., an investment holding company, researches, develops, manufactures, and trades in gloves and rubber goods in Malaysia. The company offers medical examination, surgical, vinyl, and nitrile gloves; concentrate latex, formers, chemicals and chemical compounds, rubber dental dams, exercise bands, condoms, and rubber related products; packaging materials, boxes, and cartons; and disposable and medical face masks, engineering parts and rubber glove machinery, functional fillers, healthcare products, and homecare and personal care products. It also provides property investment, consultancy services, and electrical engineering works; clinical and specialist medical services; advisory and management services; management services in plantation sector, and processing of plantation produce; general trading; and industrial forest plantation, as well as forestry and industry services. In addition, the company trades in gloves and healthcare related products; distributes medical gloves, medical devices, and other hospital related products; operates as a special purpose vehicle solely for issuance of Perpetual Sukuk; organizes in-house trainings and public trainings/programs; and establishes and maintains fitness related business, including healthcare, slimming centers, gymnasiums, and other related activities. Further, it generates and supplies energy and electricity using biomass technology; and offers E-commerce activities for glove trading and other healthcare products. The company also exports its products to 195 countries worldwide. Top Glove Corporation Bhd. was founded in 1991 and is headquartered in Shah Alam, Malaysia.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Malaysia",
        "city": "Shah Alam"
    },
    "KPJHF": {
        "short_name": "KPJ HEALTHCARE",
        "long_name": "KPJ Healthcare Berhad",
        "summary": "KPJ Healthcare Berhad, an investment holding company, engages in the operation of specialist hospitals in Malaysia and internationally. The company provides pathology and laboratory services; management and engineering maintenance services for specialist hospitals; and medical and consultancy services for eye care, as well as maintenance services for medical equipment. It also operates a private university college of nursing and allied health; a pharmacy retail outlet; a dialysis centre; and retirement and aged care facilities, as well as operates and manages ambulatory care centre. In addition, the company engages in marketing and distributing medical, pharmaceutical, and consumer healthcare products; provision of information technology related services; and rental of software and human resource information system. Further, it provides general merchandise, human resource, building management, sterile, laundry, central kitchen, and training services. The company operates 28 hospitals in Malaysia; 2 hospitals in Indonesia; 1 hospital in Thailand; and 1 hospital in Bangladesh, as well as 4 retirement and aged care facilities in Malaysia and Australia. KPJ Healthcare Berhad was founded in 1981 and is based in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "city": "Kuala Lumpur"
    },
    "NHEL": {
        "short_name": "NATURAL HEALTH FARM HOLDINGS IN",
        "long_name": "Natural Health Farm Holdings Inc.",
        "summary": "Natural Health Farm Holdings Inc., a development stage company, operates as a biotechnology company that focuses on developing healthcare eco-system based on natural or naturopathic products. The company was formerly known as Amber Group, Inc. and changed its name to Natural Health Farm Holdings Inc. in March 2017. Natural Health Farm Holdings Inc. was founded in 2014 and is based in Rawang, Malaysia.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "city": "Rawang"
    },
    "Q0F.SI": {
        "short_name": "IHH",
        "long_name": "IHH Healthcare Berhad",
        "summary": "IHH Healthcare Berhad, an investment holding company, provides healthcare services. It provides primary care services, such as treatment of basic illnesses, routine check-ups, and vaccinations. The company also offers secondary services, including specialist consultation, local surgeries, emergency care, laboratory, diagnostics, and acute treatment services; tertiary care services comprising specialist consultative care, advanced treatment or complex surgery, and inpatient care services; and quaternary care services consisting of complex surgeries, such as, organ transplants, neurosurgery, cardiac surgery, and reconstructive plastic surgery. In addition, it provides a range of ancillary services, including diagnostics, analytical laboratory testing, therapeutic radiology, physiotherapy, and integrated rehabilitation and advanced molecular diagnostics services. Further, the company offers medical education and real estate investment trust services. It operated approximately 15,000 licensed beds across 77 hospitals in 10 countries worldwide. The company was formerly known as Integrated Healthcare Holdings Berhad and changed its name to IHH Healthcare Berhad in April 2012. IHH Healthcare Berhad was incorporated in 2010 and is based in Kuala Lumpur, Malaysia.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Malaysia",
        "city": "Kuala Lumpur"
    },
    "TGLVY": {
        "short_name": "TOP GLOVE CORP BHD",
        "long_name": "Top Glove Corporation Bhd.",
        "summary": "Top Glove Corporation Bhd., an investment holding company, researches, develops, manufactures, and trades in gloves and rubber goods in Malaysia. The company offers medical examination, surgical, vinyl, and nitrile gloves; concentrate latex, formers, chemicals and chemical compounds, rubber dental dams, exercise bands, condoms, and rubber related products; packaging materials, boxes, and cartons; and disposable and medical face masks, engineering parts and rubber glove machinery, functional fillers, healthcare products, and homecare and personal care products. It also provides property investment, consultancy services, and electrical engineering works; clinical and specialist medical services; advisory and management services; management services in plantation sector, and processing of plantation produce; general trading; and industrial forest plantation, as well as forestry and industry services. In addition, the company trades in gloves and healthcare related products; distributes medical gloves, medical devices, and other hospital related products; operates as a special purpose vehicle solely for issuance of Perpetual Sukuk; organizes in-house trainings and public trainings/programs; and establishes and maintains fitness related business, including healthcare, slimming centers, gymnasiums, and other related activities. Further, it generates and supplies energy and electricity using biomass technology; and offers E-commerce activities for glove trading and other healthcare products. The company also exports its products to 195 countries worldwide. Top Glove Corporation Bhd. was founded in 1991 and is headquartered in Shah Alam, Malaysia.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "city": "Shah Alam"
    }
}