{
    "0AI.F": {
        "short_name": "AWILCO DRILLING  LS -,01",
        "long_name": "Awilco Drilling PLC",
        "summary": "Awilco Drilling PLC provides drilling services to oil and gas companies in the United Kingdom and Norway. It owns and operates two semi-submersible drilling rigs. Awilco Drilling PLC was incorporated in 2009 and is based in Westhill, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Westhill"
    },
    "0YT.F": {
        "short_name": "HUNTING PLC  LS-,25",
        "long_name": "Hunting PLC",
        "summary": "Hunting PLC, together with its subsidiaries, manufactures and distributes tools and components for the upstream oil and gas industry worldwide. The company offers perforating guns and hardware, energetics charges, and instrumentation products; and connections, oil country tubular goods, drilling tools, subsea equipment, intervention tools, and electronics. It also provides mud motors and drill pipe products; deep hole drilling and precision machining services; and well intervention services. In addition, the company engages in the oil and gas exploration and production activities. Hunting PLC was founded in 1874 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "1T4.F": {
        "short_name": "TORM PLC A  DK-,01",
        "long_name": "TORM plc",
        "summary": "TORM plc, a product tanker company, engages in the transportation of refined oil products worldwide. The company transports gasoline, jet fuel, naphtha, and diesel oil. As of March 13, 2020, it operated a fleet of approximately 80 vessels. The company was founded in 1889 and is based in London, the United Kingdom. TORM PLC is a subsidiary of Njord Luxco.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "2UZ.F": {
        "short_name": "UPLAND RES. LTD",
        "long_name": "Upland Resources Limited",
        "summary": "Upland Resources Limited is a principal investment firm specializing in farm-ins and applications for open acreage. The firm seeks to invest in the oil and gas exploration and production sectors. Upland Resources Limited was founded in 2012 and is based in Saint Helier, Jersey with an additional office in Ashbourne, United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Jersey"
    },
    "3EQ.F": {
        "short_name": "ENQUEST PLC LS -,05",
        "long_name": "EnQuest PLC",
        "summary": "EnQuest PLC operates as an oil and gas development and production company, explores for, extracts, and produces hydrocarbons in the United Kingdom, North Sea, and Malaysia. The company operates in two segments, North Sea and Malaysia. It primarily holds interests in the Thistle/Deveron, Heather/Broom, the Dons area, Magnus, the Greater Kittiwake Area, Scolty/Crathes, Alma/Galia, and Kraken. The company also has interests in the non-operated Alba producing oil field, as well as the PM8/Seligi and PM409 production sharing contracts in Malaysia. In addition, it holds interests in 15 operated production licenses and 8 production hubs. As of December 31, 2019, the company had proved and probable reserves of 173 million barrels of oil equivalents. Further, it is involved in the construction, ownership, and operation of an oil pipeline; marketing and trading of crude oil; and leasing activities. EnQuest PLC was founded in 2010 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "3KX.F": {
        "short_name": "SDX ENERGY PLCLS 0,01",
        "long_name": "SDX Energy plc",
        "summary": "SDX Energy plc engages in the exploration, production, and development of oil and gas with a principal focus on North Africa. The company has interest in two producing assets, including 50% in North West Gemsa and 50% in Meseda located onshore in the Eastern Desert, adjacent to the Gulf of Suez, Egypt. It also holds a 55% interest in the South Disouq concession located in the Nile Delta region, Egypt; and a 75% interest in the Sebou concession situated in the Rharb Basin, Morocco. The company was incorporated in 2019 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "3NO.F": {
        "short_name": "NOSTRUM OIL + GAS  LS-,01",
        "long_name": "Nostrum Oil & Gas PLC",
        "summary": "Nostrum Oil & Gas PLC, an independent oil and gas company, engages in the exploration, development, and production of oil and gas in the pre-Caspian Basin. The company discovers and develops oil and gas reserves, as well as produces and sells crude oil, stabilized condensate, liquefied petroleum gas, and dry gas. Its principal producing asset is 100% owned Chinarevskoye field located in North-western Kazakhstan. The company operates proved and probable reserve of 138 mmboe. Nostrum Oil & Gas PLC was founded in 1997 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "4ED.F": {
        "short_name": "EGDON RESOURCES PLCLS0,01",
        "long_name": "Egdon Resources plc",
        "summary": "Egdon Resources plc, together with its subsidiaries, engages in the exploration and production of hydrocarbons in the United Kingdom. It holds 42 licenses in the proven oil and gas producing basins. The company was formerly known as New Egdon plc and changed its name to Egdon Resources plc in January 2008. Egdon Resources plc was founded in 1997 and is headquartered in Odiham, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Odiham"
    },
    "4VL.F": {
        "short_name": "GENEL ENERGY  LS -,10",
        "long_name": "Genel Energy plc",
        "summary": "Genel Energy plc, through its subsidiaries, engages in the oil and gas exploration and production activities. It operates through three segments: Oil Producing Assets, Miran and Bina Bawi Assets, and Exploration Assets. The company holds interests in the Taq Taq and Tawke oil producing fields, as well as Miran and Bina Bawi oil and gas assets in the Kurdistan Region of Iraq; and exploration assets in Somaliland and Morocco. It has proven and proven plus probable net working interest reserves of 99 and 150 million barrels of oil equivalent. Genel Energy plc is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "5EQ.F": {
        "short_name": "ENTEQ UPSTREAM PLC LS-,01",
        "long_name": "Enteq Upstream Plc",
        "summary": "Enteq Upstream Plc, together with its subsidiaries, provides reach and recovery products and technologies to the upstream oil and gas services market primarily in the United States. It designs, manufactures, and sells specialized parts and products for directional drilling and measurement for use in the energy exploration and services sector of the Oil and Gas industry. The company offers measurement while drilling, downhole connectivity systems, logging while drilling, at-bit system, and rotary steerable systems. Enteq Upstream PLC was founded in 2011 and is headquartered in Amersham, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Amersham"
    },
    "8Y6.MU": {
        "short_name": "WILDCAT PRETR.LS -,000028",
        "long_name": "Wildcat Petroleum Plc",
        "summary": "Wildcat Petroleum Plc intends to invest in businesses in the upstream sector of the petroleum industry. It focuses on the exploration, appraisal, development, and production of oil and gas. The company was incorporated in 2020 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "A3P.F": {
        "short_name": "SERICA ENERGY PLC  DL-,10",
        "long_name": "Serica Energy plc",
        "summary": "Serica Energy plc, an upstream oil and gas company, engages in the identification, acquisition, exploration, and exploitation of oil and gas reserves. Its primary focus is on the production and development in the United Kingdom North Sea, complemented by a portfolio of oil and gas exploration opportunities, including interests in offshore license blocks in the United Kingdom North Sea, and Namibia. The company holds 100% interest in the Keith oil fields; 98% interest Bruce gas fields; and 50% interest in the Rhum gas fields located in the northern North Sea. Serica Energy plc was founded in 2004 and is headquartered in Aberdeen, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Aberdeen"
    },
    "A3R.F": {
        "short_name": "ANGUS ENERGY PLC  LS-,002",
        "long_name": "Angus Energy plc",
        "summary": "Angus Energy plc, an investment holding company, engages in the development, production, and distribution of hydrocarbons to third parties in the United Kingdom. The company owns and operates the Brockham and Lidsey oil fields. It also holds a 51% interest in Saltfleetby Gas Field in Lincolnshire; 25% interest in the Balcombe field discovery; and a 12.5% interest in the A24 prospect. Angus Energy plc was founded in 2009 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "ADME.L": {
        "short_name": "ADM ENERGY PLC ORD 1P",
        "long_name": "ADM Energy plc",
        "summary": "ADM Energy plc operates as a natural resources investment company. The company invests in OML 113, an offshore license that covers an area of 835 square kilometers located in Nigeria. It also invests in mineral, metal, and oil and gas projects. ADM Energy plc has a cooperation agreement with Dubai Bridge Investments LLC to source and develop upstream oil and gas field investment opportunities jointly in Sub-Saharan Africa. The company was formerly known as MX Oil plc and changed its name to ADM Energy plc in June 2019. ADM Energy plc was incorporated in 2004 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "ANGS.L": {
        "short_name": "ANGUS ENERGY PLC ORD GBP0.002",
        "long_name": "Angus Energy plc",
        "summary": "Angus Energy plc, an investment holding company, engages in the development, production, and distribution of hydrocarbons to third parties in the United Kingdom. The company owns and operates the Brockham and Lidsey oil fields. It also holds a 51% interest in Saltfleetby Gas Field in Lincolnshire; 25% interest in the Balcombe field discovery; and a 12.5% interest in the A24 prospect. Angus Energy plc was founded in 2009 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "AWDR.OL": {
        "short_name": "AWILCO DRILLING PL",
        "long_name": "Awilco Drilling PLC",
        "summary": "Awilco Drilling PLC provides drilling services to oil and gas companies in the United Kingdom and Norway. It owns and operates two semi-submersible drilling rigs. Awilco Drilling PLC was incorporated in 2009 and is based in Westhill, the United Kingdom.",
        "currency": "NOK",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "OSL",
        "market": "no_market",
        "country": "United Kingdom",
        "city": "Westhill"
    },
    "AWL1.F": {
        "short_name": "REABOLD RESOURCES LS-,001",
        "long_name": "Reabold Resources Plc",
        "summary": "Reabold Resources Plc invests in upstream oil and gas projects. Its exploration licenses include PEDL 183 license area situated in the United Kingdom; Monroe Swell, West Brentwood, and Grizzly Island license areas located in the United States; Parta exploration license area situated in Romania; and Wessex Basin license area located in Corallian, the United Kingdom. The company was formerly known as Adventis Group plc and changed its name to Reabold Resources Plc in December 2012. Reabold Resources Plc was incorporated in 1998 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "AWLCF": {
        "short_name": "AWILCO DRILLING PLC",
        "long_name": "Awilco Drilling PLC",
        "summary": "Awilco Drilling PLC provides drilling services to oil and gas companies in the United Kingdom and Norway. It owns and operates two semi-submersible drilling rigs. Awilco Drilling PLC was incorporated in 2009 and is based in Westhill, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Westhill"
    },
    "B5T.F": {
        "short_name": "BORDERS+SOUTHN PETR.LS-01",
        "long_name": "Borders & Southern Petroleum plc",
        "summary": "Borders & Southern Petroleum plc operates as an independent oil and gas exploration company in the Falkland Islands. It is involved in the exploration and appraisal of hydrocarbons. The company holds a 100% interest in three production licenses covering an area of approximately 10,000 square kilometers in the Falkland Islands. Borders & Southern Petroleum plc was incorporated in 2004 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "BISI.L": {
        "short_name": "BISICHI PLC ORD 10P",
        "long_name": "Bisichi PLC",
        "summary": "Bisichi PLC engages in coal mining activities in the United Kingdom and South Africa. The company owns an interest in the Black Wattle Colliery located in South Africa. It also engages in the share dealing and retail property investment activities, as well as residential property development activity. The company was formerly known as Bisichi Mining Plc and changed its name to Bisichi PLC in March 2020. Bisichi PLC was incorporated in 1910 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "BLOE.L": {
        "short_name": "BLOCK ENERGY PLC ORD SHS GBP0.0",
        "long_name": "Block Energy Plc",
        "summary": "Block Energy Plc explores for, develops, and produces oil and gas in the Republic of Georgia. Its flagship Field is the West Rustavi Onshore Oil and Gas Field. The company was formerly known as Goldcrest Resources Plc and changed its name to Block Energy Plc in May 2017. Block Energy Plc was incorporated in 2005 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "BLVN.L": {
        "short_name": "BOWLEVEN PLC ORD 10P",
        "long_name": "Bowleven plc",
        "summary": "Bowleven plc engages in the exploration and appraisal of oil and gas properties in Africa. The company holds a 25% interest in the offshore shallow water Etinde permit that covers an area of approximately 461 square kilometers located in Cameroon. Bowleven plc was incorporated in 2001 and is based in Edinburgh, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Edinburgh"
    },
    "BO2.F": {
        "short_name": "BOWLEVEN PLC  LS -,10",
        "long_name": "Bowleven plc",
        "summary": "Bowleven plc engages in the exploration and appraisal of oil and gas properties in Africa. The company holds a 25% interest in the offshore shallow water Etinde permit that covers an area of approximately 461 square kilometers located in Cameroon. Bowleven plc was incorporated in 2001 and is based in Edinburgh, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Edinburgh"
    },
    "BOIL.L": {
        "short_name": "BARON OIL PLC ORD 0.025P",
        "long_name": "Baron Oil Plc",
        "summary": "Baron Oil Plc, together with its subsidiaries, engages in the exploration, development, and production of oil and gas reserves, and other related activities in South America, South East Asia, and the United Kingdom. The company holds 15% working interest in P2470 and P2478 offshore license; and 8% working interest in P1918 offshore license, which consists of the Colter prospect, as well as 8% working interest in PEDL330 and PEDL345 onshore licenses located in the United Kingdom. It also owns 100% interest in Peru Onshore Block XXI; and 25% interest in Timor-Leste Tl-S0-19-16 Psc offshore license. The company was formerly known as Gold Oil Plc and changed its name to Baron Oil Plc in July 2013. Baron Oil Plc was incorporated in 2004 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "BOR.L": {
        "short_name": "BORDERS & SOUTHERN PETROLEUM PL",
        "long_name": "Borders & Southern Petroleum plc",
        "summary": "Borders & Southern Petroleum plc operates as an independent oil and gas exploration company in the Falkland Islands. It is involved in the exploration and appraisal of hydrocarbons. The company holds a 100% interest in three production licenses covering an area of approximately 10,000 square kilometers in the Falkland Islands. Borders & Southern Petroleum plc was incorporated in 2004 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "BP": {
        "short_name": "BP p.l.c.",
        "long_name": "BP p.l.c.",
        "summary": "BP PLC engages in the energy business worldwide. It operates through three segments: Upstream, Downstream, and Rosneft. The Upstream segment is involved in the oil and natural gas exploration, and field development and production; midstream transportation, storage, and processing; and marketing and trading of liquefied natural gas (LNG), biogas, power, and natural gas liquids (NGLs). This segment also engages in the ownership and management of crude oil and natural gas pipelines; processing facilities and export terminals; and LNG processing facilities and transportation, as well as NGLs processing business. The Downstream segment refines, manufactures, markets, transports, supplies, and trades in crude oil, petroleum, and petrochemical products and related services to wholesale and retail customers. It offers gasoline, diesel, and aviation fuels; lubricants, and related products and services to the automotive, industrial, marine, and energy markets under the Castrol, BP, and Aral brands; and petrochemical products, such as purified terephthalic acid, paraxylene, acetic acid, olefins and derivatives, and specialty petrochemical products. The Rosneft segment engages in the exploration and production of hydrocarbons, as well as jet fuel, bunkering, bitumen, and lubricants activities. This segment also owns and operates 13 refineries in Russia; and approximately 3,000 retail service stations in Russia and internationally. The company also produces ethanol, bio-isobutanol, bio-power, and solar energy; transports hydrocarbon products through time-chartered and spot-chartered vessels; and holds interests in wind sites. BP PLC was founded in 1889 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "BP-A.L": {
        "short_name": "BP PLC 8% CUM 1ST PRF #1",
        "long_name": "BP p.l.c.",
        "summary": "BP PLC engages in the energy business worldwide. It operates through three segments: Upstream, Downstream, and Rosneft. The Upstream segment is involved in the oil and natural gas exploration, and field development and production; midstream transportation, storage, and processing; and marketing and trading of liquefied natural gas (LNG), biogas, power, and natural gas liquids (NGLs). This segment also engages in the ownership and management of crude oil and natural gas pipelines; processing facilities and export terminals; and LNG processing facilities and transportation, as well as NGLs processing business. The Downstream segment refines, manufactures, markets, transports, supplies, and trades in crude oil, petroleum, and petrochemical products and related services to wholesale and retail customers. It offers gasoline, diesel, and aviation fuels; lubricants, and related products and services to the automotive, industrial, marine, and energy markets under the Castrol, BP, and Aral brands; and petrochemical products, such as purified terephthalic acid, paraxylene, acetic acid, olefins and derivatives, and specialty petrochemical products. The Rosneft segment engages in the exploration and production of hydrocarbons, as well as jet fuel, bunkering, bitumen, and lubricants activities. This segment also owns and operates 13 refineries in Russia; and approximately 3,000 retail service stations in Russia and internationally. The company also produces ethanol, bio-isobutanol, bio-power, and solar energy; transports hydrocarbon products through time-chartered and spot-chartered vessels; and holds interests in wind sites. BP PLC was founded in 1889 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "BP-B.L": {
        "short_name": "BP PLC 9% CUM 2ND PRF #1",
        "long_name": "BP p.l.c.",
        "summary": "BP PLC engages in the energy business worldwide. It operates through three segments: Upstream, Downstream, and Rosneft. The Upstream segment is involved in the oil and natural gas exploration, and field development and production; midstream transportation, storage, and processing; and marketing and trading of liquefied natural gas (LNG), biogas, power, and natural gas liquids (NGLs). This segment also engages in the ownership and management of crude oil and natural gas pipelines; processing facilities and export terminals; and LNG processing facilities and transportation, as well as NGLs processing business. The Downstream segment refines, manufactures, markets, transports, supplies, and trades in crude oil, petroleum, and petrochemical products and related services to wholesale and retail customers. It offers gasoline, diesel, and aviation fuels; lubricants, and related products and services to the automotive, industrial, marine, and energy markets under the Castrol, BP, and Aral brands; and petrochemical products, such as purified terephthalic acid, paraxylene, acetic acid, olefins and derivatives, and specialty petrochemical products. The Rosneft segment engages in the exploration and production of hydrocarbons, as well as jet fuel, bunkering, bitumen, and lubricants activities. This segment also owns and operates 13 refineries in Russia; and approximately 3,000 retail service stations in Russia and internationally. The company also produces ethanol, bio-isobutanol, bio-power, and solar energy; transports hydrocarbon products through time-chartered and spot-chartered vessels; and holds interests in wind sites. BP PLC was founded in 1889 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "BPAQF": {
        "short_name": "BP",
        "long_name": "BP p.l.c.",
        "summary": "BP PLC engages in the energy business worldwide. It operates through three segments: Upstream, Downstream, and Rosneft. The Upstream segment is involved in the oil and natural gas exploration, and field development and production; midstream transportation, storage, and processing; and marketing and trading of liquefied natural gas (LNG), biogas, power, and natural gas liquids (NGLs). This segment also engages in the ownership and management of crude oil and natural gas pipelines; processing facilities and export terminals; and LNG processing facilities and transportation, as well as NGLs processing business. The Downstream segment refines, manufactures, markets, transports, supplies, and trades in crude oil, petroleum, and petrochemical products and related services to wholesale and retail customers. It offers gasoline, diesel, and aviation fuels; lubricants, and related products and services to the automotive, industrial, marine, and energy markets under the Castrol, BP, and Aral brands; and petrochemical products, such as purified terephthalic acid, paraxylene, acetic acid, olefins and derivatives, and specialty petrochemical products. The Rosneft segment engages in the exploration and production of hydrocarbons, as well as jet fuel, bunkering, bitumen, and lubricants activities. This segment also owns and operates 13 refineries in Russia; and approximately 3,000 retail service stations in Russia and internationally. The company also produces ethanol, bio-isobutanol, bio-power, and solar energy; transports hydrocarbon products through time-chartered and spot-chartered vessels; and holds interests in wind sites. BP PLC was founded in 1889 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "BPE.F": {
        "short_name": "BP PLC DZ/1 DL-,25",
        "long_name": "BP p.l.c.",
        "summary": "BP PLC engages in the energy business worldwide. It operates through three segments: Upstream, Downstream, and Rosneft. The Upstream segment is involved in the oil and natural gas exploration, and field development and production; midstream transportation, storage, and processing; and marketing and trading of liquefied natural gas (LNG), biogas, power, and natural gas liquids (NGLs). This segment also engages in the ownership and management of crude oil and natural gas pipelines; processing facilities and export terminals; and LNG processing facilities and transportation, as well as NGLs processing business. The Downstream segment refines, manufactures, markets, transports, supplies, and trades in crude oil, petroleum, and petrochemical products and related services to wholesale and retail customers. It offers gasoline, diesel, and aviation fuels; lubricants, and related products and services to the automotive, industrial, marine, and energy markets under the Castrol, BP, and Aral brands; and petrochemical products, such as purified terephthalic acid, paraxylene, acetic acid, olefins and derivatives, and specialty petrochemical products. The Rosneft segment engages in the exploration and production of hydrocarbons, as well as jet fuel, bunkering, bitumen, and lubricants activities. This segment also owns and operates 13 refineries in Russia; and approximately 3,000 retail service stations in Russia and internationally. The company also produces ethanol, bio-isobutanol, bio-power, and solar energy; transports hydrocarbon products through time-chartered and spot-chartered vessels; and holds interests in wind sites. BP PLC was founded in 1889 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "BPE5.DE": {
        "short_name": "BP PLC  DL-,25",
        "long_name": "BP p.l.c.",
        "summary": "BP PLC engages in the energy business worldwide. It operates through three segments: Upstream, Downstream, and Rosneft. The Upstream segment is involved in the oil and natural gas exploration, and field development and production; midstream transportation, storage, and processing; and marketing and trading of liquefied natural gas (LNG), biogas, power, and natural gas liquids (NGLs). This segment also engages in the ownership and management of crude oil and natural gas pipelines; processing facilities and export terminals; and LNG processing facilities and transportation, as well as NGLs processing business. The Downstream segment refines, manufactures, markets, transports, supplies, and trades in crude oil, petroleum, and petrochemical products and related services to wholesale and retail customers. It offers gasoline, diesel, and aviation fuels; lubricants, and related products and services to the automotive, industrial, marine, and energy markets under the Castrol, BP, and Aral brands; and petrochemical products, such as purified terephthalic acid, paraxylene, acetic acid, olefins and derivatives, and specialty petrochemical products. The Rosneft segment engages in the exploration and production of hydrocarbons, as well as jet fuel, bunkering, bitumen, and lubricants activities. This segment also owns and operates 13 refineries in Russia; and approximately 3,000 retail service stations in Russia and internationally. The company also produces ethanol, bio-isobutanol, bio-power, and solar energy; transports hydrocarbon products through time-chartered and spot-chartered vessels; and holds interests in wind sites. BP PLC was founded in 1889 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "GER",
        "market": "de_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "BPE5.F": {
        "short_name": "BP PLC  DL-,25",
        "long_name": "BP p.l.c.",
        "summary": "BP PLC engages in the energy business worldwide. It operates through three segments: Upstream, Downstream, and Rosneft. The Upstream segment is involved in the oil and natural gas exploration, and field development and production; midstream transportation, storage, and processing; and marketing and trading of liquefied natural gas (LNG), biogas, power, and natural gas liquids (NGLs). This segment also engages in the ownership and management of crude oil and natural gas pipelines; processing facilities and export terminals; and LNG processing facilities and transportation, as well as NGLs processing business. The Downstream segment refines, manufactures, markets, transports, supplies, and trades in crude oil, petroleum, and petrochemical products and related services to wholesale and retail customers. It offers gasoline, diesel, and aviation fuels; lubricants, and related products and services to the automotive, industrial, marine, and energy markets under the Castrol, BP, and Aral brands; and petrochemical products, such as purified terephthalic acid, paraxylene, acetic acid, olefins and derivatives, and specialty petrochemical products. The Rosneft segment engages in the exploration and production of hydrocarbons, as well as jet fuel, bunkering, bitumen, and lubricants activities. This segment also owns and operates 13 refineries in Russia; and approximately 3,000 retail service stations in Russia and internationally. The company also produces ethanol, bio-isobutanol, bio-power, and solar energy; transports hydrocarbon products through time-chartered and spot-chartered vessels; and holds interests in wind sites. BP PLC was founded in 1889 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "BPN.MX": {
        "short_name": "BP",
        "long_name": "BP p.l.c.",
        "summary": "BP PLC engages in the energy business worldwide. It operates through three segments: Upstream, Downstream, and Rosneft. The Upstream segment is involved in the oil and natural gas exploration, and field development and production; midstream transportation, storage, and processing; and marketing and trading of liquefied natural gas (LNG), biogas, power, and natural gas liquids (NGLs). This segment also engages in the ownership and management of crude oil and natural gas pipelines; processing facilities and export terminals; and LNG processing facilities and transportation, as well as NGLs processing business. The Downstream segment refines, manufactures, markets, transports, supplies, and trades in crude oil, petroleum, and petrochemical products and related services to wholesale and retail customers. It offers gasoline, diesel, and aviation fuels; lubricants, and related products and services to the automotive, industrial, marine, and energy markets under the Castrol, BP, and Aral brands; and petrochemical products, such as purified terephthalic acid, paraxylene, acetic acid, olefins and derivatives, and specialty petrochemical products. The Rosneft segment engages in the exploration and production of hydrocarbons, as well as jet fuel, bunkering, bitumen, and lubricants activities. This segment also owns and operates 13 refineries in Russia; and approximately 3,000 retail service stations in Russia and internationally. The company also produces ethanol, bio-isobutanol, bio-power, and solar energy; transports hydrocarbon products through time-chartered and spot-chartered vessels; and holds interests in wind sites. BP PLC was founded in 1889 and is headquartered in London, the United Kingdom.",
        "currency": "MXN",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "BSU.F": {
        "short_name": "BP PLC SP.ADR/6 DL -,25",
        "long_name": "BP p.l.c.",
        "summary": "BP PLC engages in the energy business worldwide. It operates through three segments: Upstream, Downstream, and Rosneft. The Upstream segment is involved in the oil and natural gas exploration, and field development and production; midstream transportation, storage, and processing; and marketing and trading of liquefied natural gas (LNG), biogas, power, and natural gas liquids (NGLs). This segment also engages in the ownership and management of crude oil and natural gas pipelines; processing facilities and export terminals; and LNG processing facilities and transportation, as well as NGLs processing business. The Downstream segment refines, manufactures, markets, transports, supplies, and trades in crude oil, petroleum, and petrochemical products and related services to wholesale and retail customers. It offers gasoline, diesel, and aviation fuels; lubricants, and related products and services to the automotive, industrial, marine, and energy markets under the Castrol, BP, and Aral brands; and petrochemical products, such as purified terephthalic acid, paraxylene, acetic acid, olefins and derivatives, and specialty petrochemical products. The Rosneft segment engages in the exploration and production of hydrocarbons, as well as jet fuel, bunkering, bitumen, and lubricants activities. This segment also owns and operates 13 refineries in Russia; and approximately 3,000 retail service stations in Russia and internationally. The company also produces ethanol, bio-isobutanol, bio-power, and solar energy; transports hydrocarbon products through time-chartered and spot-chartered vessels; and holds interests in wind sites. BP PLC was founded in 1889 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "BSU.SG": {
        "short_name": "BP PLC Reg. Shares(spon.ADRs)/6",
        "long_name": "BP p.l.c.",
        "summary": "BP PLC engages in the energy business worldwide. It operates through three segments: Upstream, Downstream, and Rosneft. The Upstream segment is involved in the oil and natural gas exploration, and field development and production; midstream transportation, storage, and processing; and marketing and trading of liquefied natural gas (LNG), biogas, power, and natural gas liquids (NGLs). This segment also engages in the ownership and management of crude oil and natural gas pipelines; processing facilities and export terminals; and LNG processing facilities and transportation, as well as NGLs processing business. The Downstream segment refines, manufactures, markets, transports, supplies, and trades in crude oil, petroleum, and petrochemical products and related services to wholesale and retail customers. It offers gasoline, diesel, and aviation fuels; lubricants, and related products and services to the automotive, industrial, marine, and energy markets under the Castrol, BP, and Aral brands; and petrochemical products, such as purified terephthalic acid, paraxylene, acetic acid, olefins and derivatives, and specialty petrochemical products. The Rosneft segment engages in the exploration and production of hydrocarbons, as well as jet fuel, bunkering, bitumen, and lubricants activities. This segment also owns and operates 13 refineries in Russia; and approximately 3,000 retail service stations in Russia and internationally. The company also produces ethanol, bio-isobutanol, bio-power, and solar energy; transports hydrocarbon products through time-chartered and spot-chartered vessels; and holds interests in wind sites. BP PLC was founded in 1889 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "BWLVF": {
        "short_name": "BOWLEVEN",
        "long_name": "Bowleven plc",
        "summary": "Bowleven plc engages in the exploration and appraisal of oil and gas properties in Africa. The company holds a 25% interest in the offshore shallow water Etinde permit that covers an area of approximately 461 square kilometers located in Cameroon. Bowleven plc was incorporated in 2001 and is based in Edinburgh, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Edinburgh"
    },
    "CAD.L": {
        "short_name": "CADOGAN PETROLEUM PLC ORD 3P",
        "long_name": "Cadogan Petroleum plc",
        "summary": "Cadogan Petroleum plc, together with its subsidiaries, engages in the exploration, development, and production of natural gas, oil, and condensate in Ukraine. It operates through Exploration and Production, Service, and Trading segments. The company held working interests in two license areas, such as Monastyretska and Bitlyanska located in the Carpathian basin. It also provides drilling and civil services to exploration and production companies; imports natural gas; and purchases and sells natural gas. Cadogan Petroleum plc was incorporated in 2004 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "CASP.L": {
        "short_name": "CASPIAN SUNRISE PLC ORD 1P",
        "long_name": "Caspian Sunrise plc",
        "summary": "Caspian Sunrise plc engages in the exploration and production of crude oil in Central Asia. The company has a 99% interest in its principal asset, the BNG Contract Area, which covers an area of 1,561 square kilometers located in the Mangistau Oblast in the west of Kazakhstan. The company was formerly known as Roxi Petroleum Plc and changed its name to Caspian Sunrise plc in March 2017. Caspian Sunrise plc was founded in 2006 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "CNE.L": {
        "short_name": "CAIRN ENERGY PLC ORD 21/13P",
        "long_name": "Cairn Energy PLC",
        "summary": "Cairn Energy PLC operates as an independent oil and gas exploration, development, and production company. It holds a portfolio of exploration, development, and production assets in the United Kingdom, Israel, Mauritania, Senegal, Cote d'Ivoire, Mexico, and Suriname. The company was incorporated in 2002 and is headquartered in Edinburgh, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Edinburgh"
    },
    "CPD.F": {
        "short_name": "CADOGAN PETROLEUM PLC",
        "long_name": "Cadogan Petroleum plc",
        "summary": "Cadogan Petroleum plc, together with its subsidiaries, engages in the exploration, development, and production of natural gas, oil, and condensate in Ukraine. It operates through Exploration and Production, Service, and Trading segments. The company held working interests in two license areas, such as Monastyretska and Bitlyanska located in the Carpathian basin. It also provides drilling and civil services to exploration and production companies; imports natural gas; and purchases and sells natural gas. Cadogan Petroleum plc was incorporated in 2004 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "CRNCD": {
        "short_name": "CAIRN ENERGY PLC",
        "long_name": "Cairn Energy PLC",
        "summary": "Cairn Energy PLC operates as an independent oil and gas exploration, development, and production company. It holds a portfolio of exploration, development, and production assets in the United Kingdom, Israel, Mauritania, Senegal, Cote d'Ivoire, Mexico, and Suriname. The company was incorporated in 2002 and is headquartered in Edinburgh, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Edinburgh"
    },
    "DOR.AX": {
        "short_name": "DORIEMUS CDI 1:1",
        "long_name": "Doriemus Plc",
        "summary": "Doriemus Plc operates as an oil and gas exploration and production company in the United Kingdom. The company owns a 10% participating interest in the Brockham oil field covering an area of 8.9 square kilometers (km2) located in the Weald Basin; and a 2.6% interest in the Petroleum Exploration and Development Licences (PEDL), including PEDL137 that covers 99.3 km2 and PEDL246 license totaling an area of 43.4 km2 located in the northern Weald Basin. It also owns a 5% participating interest in PEDL331, a 199.8 km2 onshore Isle of Wight PEDL; and a 2.64% interest in EL 2015/13 with an area of 2.572 km2 and in EL 2015/14 with an area of 2.923 km2 in Greenland. The company was formerly known as TEP Exchange Group PLC and changed its name to Doriemus plc in July 2013. Doriemus Plc was incorporated in 1999 and is headquartered in London, the United Kingdom.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "ASX",
        "market": "au_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "E65F.F": {
        "short_name": "VALARIS CL.A  DL -,10",
        "long_name": "Valaris plc",
        "summary": "Valaris plc provides offshore drilling services in various water depths worldwide. The company operates in three segments: Floaters, Jackups, and Other. As of September 30, 2020, it owned and operated 13 drillships, 4 dynamically positioned semisubmersible rigs, 1 moored semisubmersible rig, and 45 jackup rigs, including rigs under construction. The company was formerly known as Ensco Rowan plc and changed its name to Valaris plc in July 2019. The company was incorporated in 2009 and is based in London, the United Kingdom. On August 19, 2020, Valaris plc, along with its affiliates, filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the Southern District of Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "ECHO.L": {
        "short_name": "ECHO ENERGY PLC ORD 0.25P",
        "long_name": "Echo Energy plc",
        "summary": "Echo Energy plc, through its subsidiaries, operates as an exploration and gas focused E&P company in Latin America. The company's asset portfolio consists of Santa Cruz Sur and Tapi Aike. It also engages in holding Argentinian and Bolivian branch assets. The company was formerly known as Independent Resources plc. Echo Energy plc was incorporated in 2005 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "EDL.L": {
        "short_name": "EDENVILLE ENERGY PLC ORD 1P",
        "long_name": "Edenville Energy Plc",
        "summary": "Edenville Energy Plc engages in the exploration, development, and mining of energy commodities, primarily coal in Africa. Its principal project is the Rukwa project located in Tanzania. The company was incorporated in 2004 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "EDR.L": {
        "short_name": "EGDON RESOURCES PLC ORD 1P",
        "long_name": "Egdon Resources plc",
        "summary": "Egdon Resources plc, together with its subsidiaries, engages in the exploration and production of hydrocarbons in the United Kingdom. It holds 42 licenses in the proven oil and gas producing basins. The company was formerly known as New Egdon plc and changed its name to Egdon Resources plc in January 2008. Egdon Resources plc was founded in 1997 and is headquartered in Odiham, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Odiham"
    },
    "EGN.F": {
        "short_name": "EUROPA OIL+GAS HLDG LS-01",
        "long_name": "Europa Oil & Gas (Holdings) plc",
        "summary": "Europa Oil & Gas (Holdings) plc, together with its subsidiaries, engages in the exploration, development, and production of oil and gas properties in the United Kingdom, Morocco, and Ireland. The company owns a 99% working interest in the West Firsby and Crosby Warren fields; and a 65% non-operated interest in the Whisby-4 field located in the East Midlands, the United Kingdom. It also owns interests in the PEDL180 development license, as well as PEDL181, PEDL182, PEDL299, and PEDL343 exploration licenses in the United Kingdom; and FEL 3/19 and FEL 4/19 exploration licenses in Ireland. In addition, the company holds 75% interest in the Inezgane Permit located in the Morocco. Europa Oil & Gas (Holdings) plc was founded in 1995 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "ENOG.L": {
        "short_name": "ENERGEAN PLC ORD 1P",
        "long_name": "Energean plc",
        "summary": "Energean plc engages in the exploration, development, and production of oil and gas. It operates through four segments: Greece, Israel, Montenegro, and New Ventures. The company holds interests in 18 leases and licenses in the Eastern Mediterranean. Its flagship project is the Karish and Tanin development located to the offshore Israel. The company has 558 million barrels of oil equivalents of proven and probable, and contingent resources. It also provides financing services; and holds a gas transportation license. The company was formerly known as Energean Oil & Gas plc and changed its name to Energean plc in May 2020. Energean plc was founded in 2007 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "ENOG.TA": {
        "short_name": "ENERGEAN PLC",
        "long_name": "Energean plc",
        "summary": "Energean plc engages in the exploration, development, and production of oil and gas. It operates through four segments: Greece, Israel, Montenegro, and New Ventures. The company holds interests in 18 leases and licenses in the Eastern Mediterranean. Its flagship project is the Karish and Tanin development located to the offshore Israel. The company has 558 million barrels of oil equivalents of proven and probable, and contingent resources. It also provides financing services; and holds a gas transportation license. The company was formerly known as Energean Oil & Gas plc and changed its name to Energean plc in May 2020. Energean plc was founded in 2007 and is headquartered in London, the United Kingdom.",
        "currency": "ILA",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "TLV",
        "market": "il_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "ENQ.L": {
        "short_name": "ENQUEST PLC ORD 5P",
        "long_name": "EnQuest PLC",
        "summary": "EnQuest PLC operates as an oil and gas development and production company, explores for, extracts, and produces hydrocarbons in the United Kingdom, North Sea, and Malaysia. The company operates in two segments, North Sea and Malaysia. It primarily holds interests in the Thistle/Deveron, Heather/Broom, the Dons area, Magnus, the Greater Kittiwake Area, Scolty/Crathes, Alma/Galia, and Kraken. The company also has interests in the non-operated Alba producing oil field, as well as the PM8/Seligi and PM409 production sharing contracts in Malaysia. In addition, it holds interests in 15 operated production licenses and 8 production hubs. As of December 31, 2019, the company had proved and probable reserves of 173 million barrels of oil equivalents. Further, it is involved in the construction, ownership, and operation of an oil pipeline; marketing and trading of crude oil; and leasing activities. EnQuest PLC was founded in 2010 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "ENQ.ST": {
        "short_name": "EnQuest PLC",
        "long_name": "EnQuest PLC",
        "summary": "EnQuest PLC operates as an oil and gas development and production company, explores for, extracts, and produces hydrocarbons in the United Kingdom, North Sea, and Malaysia. The company operates in two segments, North Sea and Malaysia. It primarily holds interests in the Thistle/Deveron, Heather/Broom, the Dons area, Magnus, the Greater Kittiwake Area, Scolty/Crathes, Alma/Galia, and Kraken. The company also has interests in the non-operated Alba producing oil field, as well as the PM8/Seligi and PM409 production sharing contracts in Malaysia. In addition, it holds interests in 15 operated production licenses and 8 production hubs. As of December 31, 2019, the company had proved and probable reserves of 173 million barrels of oil equivalents. Further, it is involved in the construction, ownership, and operation of an oil pipeline; marketing and trading of crude oil; and leasing activities. EnQuest PLC was founded in 2010 and is based in London, the United Kingdom.",
        "currency": "SEK",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "STO",
        "market": "se_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "ENQUF": {
        "short_name": "ENQUEST PLC",
        "long_name": "EnQuest PLC",
        "summary": "EnQuest PLC operates as an oil and gas development and production company, explores for, extracts, and produces hydrocarbons in the United Kingdom, North Sea, and Malaysia. The company operates in two segments, North Sea and Malaysia. It primarily holds interests in the Thistle/Deveron, Heather/Broom, the Dons area, Magnus, the Greater Kittiwake Area, Scolty/Crathes, Alma/Galia, and Kraken. The company also has interests in the non-operated Alba producing oil field, as well as the PM8/Seligi and PM409 production sharing contracts in Malaysia. In addition, it holds interests in 15 operated production licenses and 8 production hubs. As of December 31, 2019, the company had proved and probable reserves of 173 million barrels of oil equivalents. Further, it is involved in the construction, ownership, and operation of an oil pipeline; marketing and trading of crude oil; and leasing activities. EnQuest PLC was founded in 2010 and is based in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "ENW.L": {
        "short_name": "ENWELL ENERGY PLC ORD 5P",
        "long_name": "Enwell Energy plc",
        "summary": "Enwell Energy plc, an independent oil and gas company, explores for, develops, and produces oil and gas in Ukraine. The company owns and operates a 100% production license in three gas and condensate fields in the Poltava region comprising the Mekhediviska-Golotvschinska and Svyrydivske fields, as well as the Vasyschevskoye field located in the Kharkiv region. It also holds 100% interest in the Svystunivsko-Chervonolutskyi exploration license located in Poltava region of north-eastern Ukraine. The company was formerly known as Regal Petroleum plc and changed its name to Enwell Energy plc in May 2020. Enwell Energy plc was incorporated in 2002 and is headquartered in London, the United Kingdom. Enwell Energy plc is a subsidiary of Pelidona Services Limited.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "EOG.L": {
        "short_name": "EUROPA OIL & GAS (HOLDINGS) PLC",
        "long_name": "Europa Oil & Gas (Holdings) plc",
        "summary": "Europa Oil & Gas (Holdings) plc, together with its subsidiaries, engages in the exploration, development, and production of oil and gas properties in the United Kingdom, Morocco, and Ireland. The company owns a 99% working interest in the West Firsby and Crosby Warren fields; and a 65% non-operated interest in the Whisby-4 field located in the East Midlands, the United Kingdom. It also owns interests in the PEDL180 development license, as well as PEDL181, PEDL182, PEDL299, and PEDL343 exploration licenses in the United Kingdom; and FEL 3/19 and FEL 4/19 exploration licenses in Ireland. In addition, the company holds 75% interest in the Inezgane Permit located in the Morocco. Europa Oil & Gas (Holdings) plc was founded in 1995 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "FKGD.F": {
        "short_name": "CAIRN EN.PLCLS-,016153846",
        "long_name": "Cairn Energy PLC",
        "summary": "Cairn Energy PLC operates as an independent oil and gas exploration, development, and production company. It holds a portfolio of exploration, development, and production assets in the United Kingdom, Israel, Mauritania, Senegal, Cote d'Ivoire, Mexico, and Suriname. The company was incorporated in 2002 and is headquartered in Edinburgh, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Edinburgh"
    },
    "FTI": {
        "short_name": "TechnipFMC plc",
        "long_name": "TechnipFMC plc",
        "summary": "TechnipFMC plc engages in the oil and gas projects, technologies, and systems and services businesses. It operates through three segments: Subsea, Technip Energies, and Surface Technologies. The Subsea segment designs and manufactures products and systems; performs engineering, procurement, and project management; and provides services used by oil and gas companies involved in offshore exploration and production of crude oil and natural gas. The Technip Energies segment designs and builds onshore facilities related to the production, treatment, transformation, and transportation of hydrocarbons and renewable feedstock; and designs, manufactures, and installs fixed and floating platforms for the offshore production and processing of oil and gas reserves. The Surface Technologies segment designs and manufactures systems, as well as provides services used by oil and gas companies involved in the land and shallow water exploration and production of crude oil and natural gas. This segment also designs, manufactures, and supplies technologically advanced wellhead systems, and high pressure valves and pumps used in stimulation activities for oilfield service companies, as well as provides installation, flowback, and other services for exploration and production companies. The company operates in Europe, Russia, Central Asia, the Americas, the Asia Pacific, Africa, and the Middle East. TechnipFMC plc was incorporated in 2015 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "GEGYF": {
        "short_name": "GENEL ENERGY",
        "long_name": "Genel Energy plc",
        "summary": "Genel Energy plc, through its subsidiaries, engages in the oil and gas exploration and production activities. It operates through three segments: Oil Producing Assets, Miran and Bina Bawi Assets, and Exploration Assets. The company holds interests in the Taq Taq and Tawke oil producing fields, as well as Miran and Bina Bawi oil and gas assets in the Kurdistan Region of Iraq; and exploration assets in Somaliland and Morocco. It has proven and proven plus probable net working interest reserves of 99 and 150 million barrels of oil equivalent. Genel Energy plc is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "GENL.L": {
        "short_name": "GENEL ENERGY PLC ORD 10P",
        "long_name": "Genel Energy plc",
        "summary": "Genel Energy plc, through its subsidiaries, engages in the oil and gas exploration and production activities. It operates through three segments: Oil Producing Assets, Miran and Bina Bawi Assets, and Exploration Assets. The company holds interests in the Taq Taq and Tawke oil producing fields, as well as Miran and Bina Bawi oil and gas assets in the Kurdistan Region of Iraq; and exploration assets in Somaliland and Morocco. It has proven and proven plus probable net working interest reserves of 99 and 150 million barrels of oil equivalent. Genel Energy plc is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "GHA.F": {
        "short_name": "BARON OIL PLC  LS -,00025",
        "long_name": "Baron Oil Plc",
        "summary": "Baron Oil Plc, together with its subsidiaries, engages in the exploration, development, and production of oil and gas reserves, and other related activities in South America, South East Asia, and the United Kingdom. The company holds 15% working interest in P2470 and P2478 offshore license; and 8% working interest in P1918 offshore license, which consists of the Colter prospect, as well as 8% working interest in PEDL330 and PEDL345 onshore licenses located in the United Kingdom. It also owns 100% interest in Peru Onshore Block XXI; and 25% interest in Timor-Leste Tl-S0-19-16 Psc offshore license. The company was formerly known as Gold Oil Plc and changed its name to Baron Oil Plc in July 2013. Baron Oil Plc was incorporated in 2004 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "GTC.L": {
        "short_name": "GETECH GROUP PLC ORD 0.25P",
        "long_name": "Getech Group Plc",
        "summary": "Getech Group Plc, together with its subsidiaries, provides geoscience and geospatial products and services to the companies and governments in the United Kingdom, rest of Europe, the Americas, the Asia Pacific, and Africa. It offers Globe, a geospatial information product that provides paleo geographic, structural geology, and paleoclimate data that controls the formation and location of oil and gas. The company also provides Regional Report information products that offer in-depth analysis for exploration areas. In addition, it assists governments and national oil companies with licensing round, data management, capacity building, and advisory services; and offers geoscience services, as well as geospatial solutions. Getech Group Plc has strategic partnerships with H2 Green Ltd. sGetech Group Plc was founded in 1986 and is based in Leeds, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Leeds"
    },
    "GUN.L": {
        "short_name": "GUNSYND PLC ORD 0.085P",
        "long_name": "Gunsynd Plc",
        "summary": "Gunsynd Plc is a private equity firm that specializes in buyout and project investments. The firm seeks to invest in natural resource and energy sector. The firm may make investments in all types of assets and there will be no investment restrictions on the type of investment that the company might make or the type of opportunity that may be considered. It seeks to invest specifically in Europe; however, it can consider investments in other regions if they are considered to be profitable by the board. The Firm may take any possible opportunity in the world. It also specializes in direct acquisitions, farm-ins, partnerships; earn Â\u0096 in joint ventures, debt of other loan structures, joint ventures direct or indirect interests in assets of projects. The firm might seek the both, minority and majority stake position in its investments and can indulge in multiple investments. The average holding period of the firm's investments is generally for medium to long term range, however it can also dispose its assets if there is an opportunity to make shareholders value. The firm may be active of passive investor depending upon the situation. The firm was formerly known as Evocutis plc and changed its name to Gunsynd Plc in August 2016. Gunsynd Plc was founded in 2005 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "HNTIF": {
        "short_name": "HUNTING",
        "long_name": "Hunting PLC",
        "summary": "Hunting PLC, together with its subsidiaries, manufactures and distributes tools and components for the upstream oil and gas industry worldwide. The company offers perforating guns and hardware, energetics charges, and instrumentation products; and connections, oil country tubular goods, drilling tools, subsea equipment, intervention tools, and electronics. It also provides mud motors and drill pipe products; deep hole drilling and precision machining services; and well intervention services. In addition, the company engages in the oil and gas exploration and production activities. Hunting PLC was founded in 1874 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "HRCXF": {
        "short_name": "HURRICANE ENERGY PLC",
        "long_name": "Hurricane Energy plc",
        "summary": "Hurricane Energy plc, together with its subsidiaries, discovers, appraises, and develops oil from fractured basement reservoirs. The company has a portfolio of contiguous offshore licenses on the United Kingdom Continental Shelf, West of Shetland. Its producing oil fields include Clair, Foinaven, and Schiehallion; licenses focuses on the Rona Ridge, a major NE-SW trending basement; and assets comprise Lancaster, Whirlwind, Lincoln, Halifax, and Warwick. Hurricane Energy plc has an estimated contingent resources of approximately 2 billion barrels of oil equivalent. The company was formerly known as Hurricane Exploration plc and changed its name to Hurricane Energy plc in April 2013. Hurricane Energy plc was founded in 2004 and is headquartered in Godalming, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Godalming"
    },
    "HTG.L": {
        "short_name": "HUNTING PLC ORD 25P",
        "long_name": "Hunting PLC",
        "summary": "Hunting PLC, together with its subsidiaries, manufactures and distributes tools and components for the upstream oil and gas industry worldwide. The company offers perforating guns and hardware, energetics charges, and instrumentation products; and connections, oil country tubular goods, drilling tools, subsea equipment, intervention tools, and electronics. It also provides mud motors and drill pipe products; deep hole drilling and precision machining services; and well intervention services. In addition, the company engages in the oil and gas exploration and production activities. Hunting PLC was founded in 1874 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "HUR.L": {
        "short_name": "HURRICANE ENERGY PLC ORD 0.1P",
        "long_name": "Hurricane Energy plc",
        "summary": "Hurricane Energy plc, together with its subsidiaries, discovers, appraises, and develops oil from fractured basement reservoirs. The company has a portfolio of contiguous offshore licenses on the United Kingdom Continental Shelf, West of Shetland. Its producing oil fields include Clair, Foinaven, and Schiehallion; licenses focuses on the Rona Ridge, a major NE-SW trending basement; and assets comprise Lancaster, Whirlwind, Lincoln, Halifax, and Warwick. Hurricane Energy plc has an estimated contingent resources of approximately 2 billion barrels of oil equivalent. The company was formerly known as Hurricane Exploration plc and changed its name to Hurricane Energy plc in April 2013. Hurricane Energy plc was founded in 2004 and is headquartered in Godalming, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Godalming"
    },
    "HUT.F": {
        "short_name": "HURRICANE ENERGY LS -,001",
        "long_name": "Hurricane Energy plc",
        "summary": "Hurricane Energy plc, together with its subsidiaries, discovers, appraises, and develops oil from fractured basement reservoirs. The company has a portfolio of contiguous offshore licenses on the United Kingdom Continental Shelf, West of Shetland. Its producing oil fields include Clair, Foinaven, and Schiehallion; licenses focuses on the Rona Ridge, a major NE-SW trending basement; and assets comprise Lancaster, Whirlwind, Lincoln, Halifax, and Warwick. Hurricane Energy plc has an estimated contingent resources of approximately 2 billion barrels of oil equivalent. The company was formerly known as Hurricane Exploration plc and changed its name to Hurricane Energy plc in April 2013. Hurricane Energy plc was founded in 2004 and is headquartered in Godalming, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Godalming"
    },
    "IGAS.L": {
        "short_name": "IGAS ENERGY PLC ORD 0.002P",
        "long_name": "IGas Energy plc",
        "summary": "IGas Energy plc operates as an oil and gas exploration and production company Britain. The company holds interests in the 55 licenses at onshore locations in the Weald Basin in the southern England; the Gainsborough Trough in the East Midlands; the Bowland Basin in the North West of England; and the Inner Moray Firth in Scotland. It also generates electricity. The company was founded in 2003 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "IGESF": {
        "short_name": "IGAS ENERGY PLC",
        "long_name": "IGas Energy plc",
        "summary": "IGas Energy plc operates as an oil and gas exploration and production company Britain. The company holds interests in the 55 licenses at onshore locations in the Weald Basin in the southern England; the Gainsborough Trough in the East Midlands; the Bowland Basin in the North West of England; and the Inner Moray Firth in Scotland. It also generates electricity. The company was founded in 2003 and is based in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "IOG.L": {
        "short_name": "INDEPENDENT OIL & GAS PLC ORD 1",
        "long_name": "Independent Oil and Gas plc",
        "summary": "Independent Oil and Gas plc explores for and develops oil and gas properties in the North Sea, the United Kingdom. It focuses on the development of hydrocarbons. The company 50% working interests in the Blythe gas field, Elgood, Elland, Nailsworth, Southwark, Goddard, and Abbeydale; and 100% interests in Harvey and Redwell properties in the North Sea. It also owns and operates pipelines. Independent Oil and Gas plc was incorporated in 2010 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "JKX.F": {
        "short_name": "JKX OIL + GAS PLC  LS-,10",
        "long_name": "JKX Oil & Gas plc",
        "summary": "JKX Oil & Gas plc, through its subsidiaries, engages in the exploration, appraisal, development, and production of oil and gas reserves. The company holds interests in various properties located in Ukraine, Russia, and Hungary. It has total reserves of approximately 84.4 million barrels of oil equivalent. JKX Oil & Gas plc was incorporated in 1995 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "JKX.L": {
        "short_name": "JKX OIL & GAS PLC ORD 10P",
        "long_name": "JKX Oil & Gas plc",
        "summary": "JKX Oil & Gas plc, through its subsidiaries, engages in the exploration, appraisal, development, and production of oil and gas reserves. The company holds interests in various properties located in Ukraine, Russia, and Hungary. It has total reserves of approximately 84.4 million barrels of oil equivalent. JKX Oil & Gas plc was incorporated in 1995 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "JPK.OL": {
        "short_name": "J.P. KENNY PETROLE",
        "long_name": "J.P. Kenny Petroleum Limited",
        "summary": "J.P. Kenny Petroleum Limited operates as an oil and gas exploration and production company in South America. It primarily focuses on acquiring oil and gas development and/or production assets with exploration upside in Colombia. The company is based in London, the United Kingdom.",
        "currency": "NOK",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "OSL",
        "market": "no_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "JWG1.F": {
        "short_name": "JOHN WOOD GR.LS-,04285714",
        "long_name": "John Wood Group PLC",
        "summary": "John Wood Group PLC, together with its subsidiaries, provides project management, engineering, consulting, and technical services to energy and built environment worldwide. It operates through four segments: Asset Solutions Europe, Africa, Asia, Australia; Assets Solutions Americas; Technical Consulting Solutions; and Investment Services. The company offers engineering, fabrication and construction, and bundled services; commissioning and decommissioning services; and operations and maintenance services. It also provides scaffolding, rope access, thermal insulation and industrial painting, specialist construction and civils, asbestos remediation, mechanical, and piping support services, as well as electrical, control, and instrumentation. In addition, the company offers project management, EPC/EPCM project, and construction and field services; environment and infrastructure solutions, including environmental studies, permitting and compliance, environmental remediation, public infrastructure, geotechnical and materials, and engineering and construction services. Further, it provides clean energy solutions, such as engineering, design, and project management; analytics, technology, and laboratories; safety, licensing, and regulatory; and plant operations and life extension services. Additionally, the company offers mineral resources and project assessments, mine planning and design, mineral processing and metallurgy, and material handling; and information management, IoT and connected devices, software and applications and analytics, visualization, and digital project delivery, as well as automation and control, and consulting solutions. The company also provides subsea and export systems comprising operational support and integrity; engineer, procure, and fabricate; flow assurance; subsea, umbilical, riser, and flowline; and pipelines and marine terminals. John Wood Group PLC is based in Aberdeen, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Aberdeen"
    },
    "K1P3.F": {
        "short_name": "IGAS ENERGY PLC  LS-,0002",
        "long_name": "IGas Energy plc",
        "summary": "IGas Energy plc operates as an oil and gas exploration and production company Britain. The company holds interests in the 55 licenses at onshore locations in the Weald Basin in the southern England; the Gainsborough Trough in the East Midlands; the Bowland Basin in the North West of England; and the Inner Moray Firth in Scotland. It also generates electricity. The company was founded in 2003 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "KWW.F": {
        "short_name": "VOLGA GAS PLC  LS-,01",
        "long_name": "Volga Gas plc",
        "summary": "Volga Gas plc, through its subsidiaries, explores, develops, and produces oil, gas, condensate, and liquid petroleum gas in the Volgograd and Saratov regions of Russia. It holds 100% interests in the Karpenskiy license covering an area of 4,166 square kilometers located in the Saratov region; Vostochny Makarovskoye and Dobrinskoye license located in the Volgograd region; and Urozhainoye-2 license located in the Saratov region, as well as Muradymosky. The company has proved plus probable reserves of 10.472 million barrels of oil and condensate; and 70.7 billion cubic feet of natural gas, as well as 198 tons of LPG. Volga Gas plc was incorporated in 2006 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "LBE.L": {
        "short_name": "LONGBOAT ENERGY PLC ORD 10P (RE",
        "long_name": "Longboat Energy plc",
        "summary": "Longboat Energy plc intends to focus on the North Sea oil and gas industry. The company was founded in 2019 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "LFD.F": {
        "short_name": "GCM RESOURCES PLC  LS-,10",
        "long_name": "GCM Resources Plc",
        "summary": "GCM Resources Plc operates as a resource exploration and development company. It primarily develops the Phulbari coal and power project that relates to thermal coal and semi-soft coking coal located in Bangladesh. GCM Resources Plc was incorporated in 2003 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "LMU1.F": {
        "short_name": "NOST.TERRA OIL+G. LS-,001",
        "long_name": "Nostra Terra Oil and Gas Company plc",
        "summary": "Nostra Terra Oil and Gas Company plc, together with its subsidiaries, engages in the exploitation of hydrocarbon resources in the United States. Its principal property is the 100% owned Mesquite asset, which covers an area of 1,984 net acres located on the Eastern Shelf of the Permian Basin, Texas. The company was incorporated in 2005 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "LYK1.F": {
        "short_name": "PARKMEAD GROUP  LS-,015",
        "long_name": "The Parkmead Group plc",
        "summary": "The Parkmead Group plc, an independent oil and gas company, engages in the exploration and production of oil and gas properties in Europe, North America, and internationally. It operates in three segments: Oil and Gas Exploration and Production; Energy Economics; and Pitreadie. The company produces gas from a portfolio of four fields across the Netherlands; and holds oil and gas interests in 24 exploration and production blocks under license. It also provides energy sector economics, valuation, and benchmarking services, as well as advises on energy policies and fiscal matters, and undertakes economic evaluations; and benchmarking and training services. In addition, the company is involved in the mixed farming; and renewable energy businesses. The Parkmead Group plc was incorporated in 2000 and is headquartered in Aberdeen, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Aberdeen"
    },
    "MLSEQ.PA": {
        "short_name": "SEQUA PETROLEUM NV",
        "long_name": "Sequa Petroleum N.V.",
        "summary": "Sequa Petroleum N.V., an oil and gas company, engages in the acquisition, exploration, appraisal, development, and production of onshore and offshore oil and gas assets worldwide. It holds a 75% interest in the Aksai license located in western Kazakhstan. The company was incorporated in 2013 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "NEBLQ": {
        "short_name": "NOBLE CORP PLC",
        "long_name": "Noble Holding Corporation plc",
        "summary": "Noble Holding Corporation plc operates as an offshore drilling contractor for the oil and gas industry worldwide. It provides contract drilling services using mobile offshore drilling units. As of November 6, 2020, the company operated a fleet of 19 drilling rigs consisted of 7 drillships and semisubmersibles and 12 jackups. The company was formerly known as Noble Corporation plc and changed its name to Noble Holding Corporation plc in November 2020. Noble Holding Corporation plc was founded in 1921 and is headquartered in London, the United Kingdom. On July 31, 2020, Noble Corporation plc, along with its affiliates, filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the Southern District of Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "NNH1.F": {
        "short_name": "PRESIDENT ENERG.PLC LS-01",
        "long_name": "President Energy Plc",
        "summary": "President Energy Plc engages in the exploration, evaluation, and production of oil and gas properties primarily in South America. The company holds exploration assets in Argentina, the United States, and Paraguay. It also sells hydrocarbons. The company was formerly known as President Petroleum Company PLC and changed its name to President Energy Plc in September 2012. President Energy Plc was founded in 2004 and is headquartered in Leeds, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Leeds"
    },
    "NOG.L": {
        "short_name": "NOSTRUM OIL & GAS PLC ORD 1P",
        "long_name": "Nostrum Oil & Gas PLC",
        "summary": "Nostrum Oil & Gas PLC, an independent oil and gas company, engages in the exploration, development, and production of oil and gas in the pre-Caspian Basin. The company discovers and develops oil and gas reserves, as well as produces and sells crude oil, stabilized condensate, liquefied petroleum gas, and dry gas. Its principal producing asset is 100% owned Chinarevskoye field located in North-western Kazakhstan. The company operates proved and probable reserve of 138 mmboe. Nostrum Oil & Gas PLC was founded in 1997 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "NTOG.L": {
        "short_name": "NOSTRA TERRA OIL AND GAS COMPAN",
        "long_name": "Nostra Terra Oil and Gas Company plc",
        "summary": "Nostra Terra Oil and Gas Company plc, together with its subsidiaries, engages in the exploitation of hydrocarbon resources in the United States. Its principal property is the 100% owned Mesquite asset, which covers an area of 1,984 net acres located on the Eastern Shelf of the Permian Basin, Texas. The company was incorporated in 2005 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "NTQ.L": {
        "short_name": "ENTEQ UPSTREAM PLC ORD 1P",
        "long_name": "Enteq Upstream Plc",
        "summary": "Enteq Upstream Plc, together with its subsidiaries, provides reach and recovery products and technologies to the upstream oil and gas services market primarily in the United States. It designs, manufactures, and sells specialized parts and products for directional drilling and measurement for use in the energy exploration and services sector of the Oil and Gas industry. The company offers measurement while drilling, downhole connectivity systems, logging while drilling, at-bit system, and rotary steerable systems. Enteq Upstream PLC was founded in 2011 and is headquartered in Amersham, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Amersham"
    },
    "NVGS": {
        "short_name": "Navigator Holdings Ltd.",
        "long_name": "Navigator Holdings Ltd.",
        "summary": "Navigator Holdings Ltd. owns and operates a fleet of liquefied gas carriers worldwide. The company provides international and regional seaborne transportation services of liquefied petroleum gas, petrochemical gases, and ammonia for energy companies, industrial users, and commodity traders. As of December 31, 2019, it operated a fleet of 38 semi- or fully-refrigerated liquefied gas carriers. The company was founded in 1997 and is based in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "NWF.L": {
        "short_name": "NWF GROUP PLC ORD 25P",
        "long_name": "NWF Group plc",
        "summary": "NWF Group plc, together with its subsidiaries, primarily engages in the sale and distribution of fuel oils in the United Kingdom. It operates through Fuels, Food, and Feeds segments. The Fuels segment sells and distributes domestic heating, industrial, and road fuels. This segment operates through a network of 19 depots. The Food segment is involved in the warehousing and distribution of grocery and other products to supermarket and other retail distribution centers. The Feeds segment manufactures and sells animal feeds and other agricultural products. NWF Group plc was founded in 1871 and is headquartered in Nantwich, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Nantwich"
    },
    "NYY.F": {
        "short_name": "NWF GROUP PLC  LS-,25",
        "long_name": "NWF Group plc",
        "summary": "NWF Group plc, together with its subsidiaries, primarily engages in the sale and distribution of fuel oils in the United Kingdom. It operates through Fuels, Food, and Feeds segments. The Fuels segment sells and distributes domestic heating, industrial, and road fuels. This segment operates through a network of 19 depots. The Food segment is involved in the warehousing and distribution of grocery and other products to supermarket and other retail distribution centers. The Feeds segment manufactures and sells animal feeds and other agricultural products. NWF Group plc was founded in 1871 and is headquartered in Nantwich, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Nantwich"
    },
    "OCS1.F": {
        "short_name": "PHAROS ENERGY PLC  LS-,05",
        "long_name": "Pharos Energy plc",
        "summary": "Pharos Energy plc engages in the exploration, development, and production of oil and gas properties. The company holds a 30.5% working interest in the Te Giac Trang Field of Block 16-1 located in the shallow water Cuu Long Basin, as well as a 25% working interest in the Ca Ngu Vang field of Block 9-2 situated in the shallow water Cuu Long Basin, offshore southern Vietnam; a 70% interest in the Blocks 125 & 126 located in the Phu Khanh Basin, offshore central Vietnam; and a 100% working interest in the onshore El Fayum concession in the Western Desert, Egypt. It also holds a 33.33 % working interest in eight licenses situated in Israel. The company was formerly known as SOCO International plc and changed its name to Pharos Energy plc in October 2019. Pharos Energy plc was founded in 1997 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "OD3.F": {
        "short_name": "ODFJELL DRILL.LTD. DL-,01",
        "long_name": "Odfjell Drilling Ltd.",
        "summary": "Odfjell Drilling Ltd. operates as an integrated offshore drilling, well service, and engineering company worldwide. The company operates through three segments: Mobile Offshore Drilling Units, Drilling & Technology, and Well Services. It operates drilling units and offers management services to owners of semisubmersibles, drillships, and jack-up; and project management and follow-up during construction, management of regulatory requirements, marketing and client relations, preparations for operation, and drilling operations. The company also provides integrated drilling services, such as onshore support, production drilling and completion, well maintenance, plugging and abandonment, facility maintenance planning, and project management for maintenance and modifications; and onceptual engineering and engineering design, compliance assurance and maintenance management, marine and operational support, and rig inspection services, as well as construction and commissioning support, modifications, and upgrades. In addition, it provides well services to the oil industry, including casing and tubular running, drill tool and tubular rental, well intervention, and wellbore cleaning services. The company was founded in 1914 and is headquartered in Aberdeen, the United Kingdom. Odfjell Drilling Ltd. is a subsidiary of Odfjell Partners Ltd.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Aberdeen"
    },
    "ODL.OL": {
        "short_name": "ODFJELL DRILLING",
        "long_name": "Odfjell Drilling Ltd.",
        "summary": "Odfjell Drilling Ltd. operates as an integrated offshore drilling, well service, and engineering company worldwide. The company operates through three segments: Mobile Offshore Drilling Units, Drilling & Technology, and Well Services. It operates drilling units and offers management services to owners of semisubmersibles, drillships, and jack-up; and project management and follow-up during construction, management of regulatory requirements, marketing and client relations, preparations for operation, and drilling operations. The company also provides integrated drilling services, such as onshore support, production drilling and completion, well maintenance, plugging and abandonment, facility maintenance planning, and project management for maintenance and modifications; and onceptual engineering and engineering design, compliance assurance and maintenance management, marine and operational support, and rig inspection services, as well as construction and commissioning support, modifications, and upgrades. In addition, it provides well services to the oil industry, including casing and tubular running, drill tool and tubular rental, well intervention, and wellbore cleaning services. The company was founded in 1914 and is headquartered in Aberdeen, the United Kingdom. Odfjell Drilling Ltd. is a subsidiary of Odfjell Partners Ltd.",
        "currency": "NOK",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "OSL",
        "market": "no_market",
        "country": "United Kingdom",
        "city": "Aberdeen"
    },
    "ORCP.L": {
        "short_name": "ORACLE POWER PLC ORD 0.1P",
        "long_name": "Oracle Power plc",
        "summary": "Oracle Power plc engages in the exploration and development of coal in Pakistan. The company is also involved in building a mine-mouth power plant. It primarily holds interests in the Thar Coalfield Block VI license area that covers an area of approximately 9,100 square kilometers located in the Sindh Province of South East Pakistan. The company was formerly known as Oracle Coalfields PLC and changed its name to Oracle Power plc in June 2017. Oracle Power plc was incorporated in 2006 and is based in London, the United Kingdom. Oracle Power plc is a subsidiary of Oracle Power Plc Group.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "OXFCF": {
        "short_name": "VELOCYS PLC",
        "long_name": "Velocys plc",
        "summary": "Velocys plc operates as a sustainable fuels technology company. It designs, develops, and licenses its Fischer-Tropsch technology for the generation of clean, low carbon, synthetic drop-in aviation and road transport fuel from municipal solid waste and residual woody biomass plants. The company has a collaboration with British Airways and Shell for the development of a waste-to-jet-fuel project in the United Kingdom. It has operations in the United States, the United Kingdom, and the Asia Pacific. The company was formerly known as Oxford Catalysts Group PLC and changed its name to Velocys plc in September 2013. Velocys plc was incorporated in 2006 and is headquartered in Oxford, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Oxford"
    },
    "PANR.L": {
        "short_name": "PANTHEON RESOURCES PLC ORD 1P",
        "long_name": "Pantheon Resources Plc",
        "summary": "Pantheon Resources Plc, through its subsidiaries, engages in the exploration and production of oil and gas in the United States. It owns 100% interests in Greater Alkaid project located in Alaska; and approximately 66,000 acres in the State of Alaska's North Slope. The company also holds interests in Tyler and Polk Counties, East Texas. The company was founded in 2005 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "PHAR.L": {
        "short_name": "PHAROS ENERGY PLC ORD 5P",
        "long_name": "Pharos Energy plc",
        "summary": "Pharos Energy plc engages in the exploration, development, and production of oil and gas properties. The company holds a 30.5% working interest in the Te Giac Trang Field of Block 16-1 located in the shallow water Cuu Long Basin, as well as a 25% working interest in the Ca Ngu Vang field of Block 9-2 situated in the shallow water Cuu Long Basin, offshore southern Vietnam; a 70% interest in the Blocks 125 & 126 located in the Phu Khanh Basin, offshore central Vietnam; and a 100% working interest in the onshore El Fayum concession in the Western Desert, Egypt. It also holds a 33.33 % working interest in eight licenses situated in Israel. The company was formerly known as SOCO International plc and changed its name to Pharos Energy plc in October 2019. Pharos Energy plc was founded in 1997 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "PMG.L": {
        "short_name": "PARKMEAD GROUP (THE) PLC ORD 1.",
        "long_name": "The Parkmead Group plc",
        "summary": "The Parkmead Group plc, an independent oil and gas company, engages in the exploration and production of oil and gas properties in Europe, North America, and internationally. It operates in three segments: Oil and Gas Exploration and Production; Energy Economics; and Pitreadie. The company produces gas from a portfolio of four fields across the Netherlands; and holds oil and gas interests in 24 exploration and production blocks under license. It also provides energy sector economics, valuation, and benchmarking services, as well as advises on energy policies and fiscal matters, and undertakes economic evaluations; and benchmarking and training services. In addition, the company is involved in the mixed farming; and renewable energy businesses. The Parkmead Group plc was incorporated in 2000 and is headquartered in Aberdeen, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Aberdeen"
    },
    "PMOIF": {
        "short_name": "PREMIER OIL",
        "long_name": "Premier Oil plc",
        "summary": "Premier Oil plc, an oil and gas company, engages in the exploration, production, and development of oil and gas properties in the Falkland Islands, Indonesia, Vietnam, the United Kingdom, and internationally. As of December 31, 2019, its proved and probable reserves (2P) were 175 million barrels of oil equivalent (mmboe); and 2P and estimated contingent resources were 847 mmboe. Premier Oil plc was founded in 1934 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "PMOIY": {
        "short_name": "PREMIER OIL",
        "long_name": "Premier Oil plc",
        "summary": "Premier Oil plc, an oil and gas company, engages in the exploration, production, and development of oil and gas properties in the Falkland Islands, Indonesia, Vietnam, the United Kingdom, and internationally. As of December 31, 2019, its proved and probable reserves (2P) were 175 million barrels of oil equivalent (mmboe); and 2P and estimated contingent resources were 847 mmboe. Premier Oil plc was founded in 1934 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "PNOR.OL": {
        "short_name": "PETRONOR E&P LTD",
        "long_name": "PetroNor E&P Limited",
        "summary": "PetroNor E&P Limited operates as an oil and gas exploration and production company in West Africa. It holds 6 licenses in the Republic of Congo, Senegal, Nigeria, and The Gambia, as well as has proved and probable reserves of 11.19 million barrels of oil. The company was founded 2017 and is headquartered in London, the United Kingdom.",
        "currency": "NOK",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "OSL",
        "market": "no_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "POS.L": {
        "short_name": "PLEXUS HOLDINGS PLC ORD 1P",
        "long_name": "Plexus Holdings plc",
        "summary": "Plexus Holdings plc, together with its subsidiaries, provides equipment and services for the oil and gas industry in the United Kingdom, rest of Europe, and internationally. It principally markets POS-GRIP, a patented method of engineering for oil and gas field wellheads, connectors, and metal-to-metal sealing, which includes deforming one tubular member against another in the elastic range to effect gripping and sealing. The company also provides commercial exploitation of subsea applications; and designs, fabricates, and manufactures valve related products. Plexus Holdings plc was founded in 1985 and is based in Weybridge, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Weybridge"
    },
    "PPC.L": {
        "short_name": "PRESIDENT ENERGY PLC ORD 1P",
        "long_name": "President Energy Plc",
        "summary": "President Energy Plc engages in the exploration, evaluation, and production of oil and gas properties primarily in South America. The company holds exploration assets in Argentina, the United States, and Paraguay. It also sells hydrocarbons. The company was formerly known as President Petroleum Company PLC and changed its name to President Energy Plc in September 2012. President Energy Plc was founded in 2004 and is headquartered in Leeds, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Leeds"
    },
    "PPP.L": {
        "short_name": "PENNPETRO ENERGY PLC ORD 1P",
        "long_name": "Pennpetro Energy Plc",
        "summary": "Pennpetro Energy Plc engages in the onshore oil and gas exploration and production in the United States. Its principal property is the undeveloped central portion of the Gonzales oil field that consists of leasehold petroleum mineral interests with approximately 1,000 leases on 2,500 acres of land and proven oil condensates located in the City of Gonzales, Texas. The company was founded in 2016 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "PQQB.F": {
        "short_name": "PREMIER OIL  LS-,125",
        "long_name": "Premier Oil plc",
        "summary": "Premier Oil plc, an oil and gas company, engages in the exploration, production, and development of oil and gas properties in the Falkland Islands, Indonesia, Vietnam, the United Kingdom, and internationally. As of December 31, 2019, its proved and probable reserves (2P) were 175 million barrels of oil equivalent (mmboe); and 2P and estimated contingent resources were 847 mmboe. Premier Oil plc was founded in 1934 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "PRES.L": {
        "short_name": "PRESSURE TECHNOLOGIES PLC ORD 5",
        "long_name": "Pressure Technologies plc",
        "summary": "Pressure Technologies plc, through its subsidiaries, designs and manufactures high-integrity and safety-critical components and systems for the oil and gas, defense, industrial gases, and hydrogen energy markets in the United Kingdom, Europe, and internationally. It operates through two segments, Cylinders and Precision Machined Components. The Cylinders segment designs, manufactures, and reconditions seamless high pressure gas cylinders. The Precision Machined Components segment manufactures specialized precision engineered valve wear parts used in the oil and gas industries. The company was founded in 1897 and is headquartered in Sheffield, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Sheffield"
    },
    "PXEN.L": {
        "short_name": "PROSPEX ENERGY PLC ORD 0.1P",
        "long_name": "Prospex Energy PLC",
        "summary": "Prospex Energy PLC operates as an oil and gas investment company in Europe. It holds interest in the Tesorillo Project that comprises two petroleum exploration licenses, the Tesorillo and Ruedalabola permits, which cover an area of approximately 38,000 hectares located in Cadiz Province in southern Spain; 50% economic interest in the exploration area of the EIV-1 Suceava Concession in Romania; and a 17% economic interest in the Podere Gallina exploration permit in Po Valley Basin, Italy. The company was formerly known as Prospex Oil and Gas Plc and changed its name to Prospex Energy PLC in July 2020. Prospex Energy PLC was incorporated in 1999 and is based in Essex, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Essex"
    },
    "QFI.L": {
        "short_name": "QUADRISE FUELS INTERNATIONAL PL",
        "long_name": "Quadrise Fuels International plc",
        "summary": "Quadrise Fuels International plc, together with its subsidiaries, manufactures and markets emulsion fuel for use in power generation, industrial and marine diesel engines, and steam generation applications in the United Kingdom. It produces oil-in-water emulsion-based fuels through its Multiphase Superfine Atomised Residue technology as a substitute for conventional heavy fuel oil. The company is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "R4Y.F": {
        "short_name": "ROCKHOPPER EXPLOR. LS-,01",
        "long_name": "Rockhopper Exploration plc",
        "summary": "Rockhopper Exploration plc, together with its subsidiaries, operates as an oil and gas exploration and production company primarily in the United Kingdom. It engages in the exploration, appraisal, and exploitation of its oil and gas acreage primarily in the North Falkland Basin and the Greater Mediterranean region. The company holds 95.50% working interest in the PL003a production license; 60.50% working interest in PL003b production license; 64% working interests in PL004a, PL004b, and PL004c production licenses; 100% working interest in PL005 production license; and 40% working interests in PL032 and PL033 production licenses in North Falkland Basin, as well as 100% working interests in PL010-PL016, PL025-PL029, and PL031 production licenses in South Falkland Basin. It also has 20% working interest in the A.C35.AG production license; 22.89% working interest in the Serra San Bernardo production license; and 100% working interest in the Aglavizza production license in Italy. The company was founded in 2004 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "RAKP.OL": {
        "short_name": "RAK PETROLEUM PLC",
        "long_name": "RAK Petroleum plc",
        "summary": "RAK Petroleum plc operates as an oil and gas investment company. It primarily holds 44.94% interests in DNO ASA through which it owns 106 licenses comprises three licenses in the Kurdistan Region of Iraq, 87 licenses in Norway, 12 licenses in the United Kingdom, two licenses in the Netherlands, one license in Ireland, and one license in Yemen. The company also holds 33.33% interest in Foxtrot International LDC, which operates offshore Block CI-27 comprising four producing gas fields with associated oil and condensates in Foxtrot and Mahi; and Block CI-502 and Block CI-12 offshore exploration licenses. RAK Petroleum plc was founded in 2005 and is based in Weybridge, the United Kingdom.",
        "currency": "NOK",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "OSL",
        "market": "no_market",
        "country": "United Kingdom",
        "city": "Weybridge"
    },
    "RBD.L": {
        "short_name": "REABOLD RESOURCES PLC ORD 0.1P",
        "long_name": "Reabold Resources Plc",
        "summary": "Reabold Resources Plc invests in upstream oil and gas projects. Its exploration licenses include PEDL 183 license area situated in the United Kingdom; Monroe Swell, West Brentwood, and Grizzly Island license areas located in the United States; Parta exploration license area situated in Romania; and Wessex Basin license area located in Corallian, the United Kingdom. The company was formerly known as Adventis Group plc and changed its name to Reabold Resources Plc in December 2012. Reabold Resources Plc was incorporated in 1998 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "RCKHF": {
        "short_name": "ROCKHOPPER EXPLORATION",
        "long_name": "Rockhopper Exploration plc",
        "summary": "Rockhopper Exploration plc, together with its subsidiaries, operates as an oil and gas exploration and production company primarily in the United Kingdom. It engages in the exploration, appraisal, and exploitation of its oil and gas acreage primarily in the North Falkland Basin and the Greater Mediterranean region. The company holds 95.50% working interest in the PL003a production license; 60.50% working interest in PL003b production license; 64% working interests in PL004a, PL004b, and PL004c production licenses; 100% working interest in PL005 production license; and 40% working interests in PL032 and PL033 production licenses in North Falkland Basin, as well as 100% working interests in PL010-PL016, PL025-PL029, and PL031 production licenses in South Falkland Basin. It also has 20% working interest in the A.C35.AG production license; 22.89% working interest in the Serra San Bernardo production license; and 100% working interest in the Aglavizza production license in Italy. The company was founded in 2004 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "RGPMF": {
        "short_name": "ENWELL ENERGY PLC",
        "long_name": "Enwell Energy plc",
        "summary": "Enwell Energy plc, an independent oil and gas company, explores for, develops, and produces oil and gas in Ukraine. The company owns and operates a 100% production license in three gas and condensate fields in the Poltava region comprising the Mekhediviska-Golotvschinska and Svyrydivske fields, as well as the Vasyschevskoye field located in the Kharkiv region. It also holds 100% interest in the Svystunivsko-Chervonolutskyi exploration license located in Poltava region of north-eastern Ukraine. The company was formerly known as Regal Petroleum plc and changed its name to Enwell Energy plc in May 2020. Enwell Energy plc was incorporated in 2002 and is headquartered in London, the United Kingdom. Enwell Energy plc is a subsidiary of Pelidona Services Limited.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "RHN.F": {
        "short_name": "ENWELL ENERGY PLC  LS-,05",
        "long_name": "Enwell Energy plc",
        "summary": "Enwell Energy plc, an independent oil and gas company, explores for, develops, and produces oil and gas in Ukraine. The company owns and operates a 100% production license in three gas and condensate fields in the Poltava region comprising the Mekhediviska-Golotvschinska and Svyrydivske fields, as well as the Vasyschevskoye field located in the Kharkiv region. It also holds 100% interest in the Svystunivsko-Chervonolutskyi exploration license located in Poltava region of north-eastern Ukraine. The company was formerly known as Regal Petroleum plc and changed its name to Enwell Energy plc in May 2020. Enwell Energy plc was incorporated in 2002 and is headquartered in London, the United Kingdom. Enwell Energy plc is a subsidiary of Pelidona Services Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "RKH.L": {
        "short_name": "ROCKHOPPER EXPLORATION PLC ORD ",
        "long_name": "Rockhopper Exploration plc",
        "summary": "Rockhopper Exploration plc, together with its subsidiaries, operates as an oil and gas exploration and production company primarily in the United Kingdom. It engages in the exploration, appraisal, and exploitation of its oil and gas acreage primarily in the North Falkland Basin and the Greater Mediterranean region. The company holds 95.50% working interest in the PL003a production license; 60.50% working interest in PL003b production license; 64% working interests in PL004a, PL004b, and PL004c production licenses; 100% working interest in PL005 production license; and 40% working interests in PL032 and PL033 production licenses in North Falkland Basin, as well as 100% working interests in PL010-PL016, PL025-PL029, and PL031 production licenses in South Falkland Basin. It also has 20% working interest in the A.C35.AG production license; 22.89% working interest in the Serra San Bernardo production license; and 100% working interest in the Aglavizza production license in Italy. The company was founded in 2004 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "RO1.F": {
        "short_name": "CASPIAN SUNRISE LS-,01",
        "long_name": "Caspian Sunrise plc",
        "summary": "Caspian Sunrise plc engages in the exploration and production of crude oil in Central Asia. The company has a 99% interest in its principal asset, the BNG Contract Area, which covers an area of 1,561 square kilometers located in the Mangistau Oblast in the west of Kazakhstan. The company was formerly known as Roxi Petroleum Plc and changed its name to Caspian Sunrise plc in March 2017. Caspian Sunrise plc was founded in 2006 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "ROXIF": {
        "short_name": "CASPIAN SUNRISE PLC",
        "long_name": "Caspian Sunrise plc",
        "summary": "Caspian Sunrise plc engages in the exploration and production of crude oil in Central Asia. The company has a 99% interest in its principal asset, the BNG Contract Area, which covers an area of 1,561 square kilometers located in the Mangistau Oblast in the west of Kazakhstan. The company was formerly known as Roxi Petroleum Plc and changed its name to Caspian Sunrise plc in March 2017. Caspian Sunrise plc was founded in 2006 and is based in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "SCIR.L": {
        "short_name": "SCIROCCO ENERGY PLC ORD 0.20P",
        "long_name": "Scirocco Energy Plc",
        "summary": "Scirocco Energy Plc acquires a portfolio of direct and indirect interests in exploration, development, and production oil and gas assets primarily in Europe, Africa, and the Americas. The company holds 25% interest in the Ruvuma Petroleum Sharing Agreement covering an area of approximately 3,447 square kilometers; 8.39% interest in the Kiliwani North Development License; and 12.03% interest in Helium One license located in Tanzania. It also owns 28.56% interest in petroleum leases covering an area of 23,500 acres in southern Ontario; and interest in various fields in Nigeria and West Africa. The company was formerly known as Solo Oil Plc and changed its name to Scirocco Energy Plc in October 2020. Scirocco Energy Plc was incorporated in 2005 and is based in Leeds, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Leeds"
    },
    "SDLPQ": {
        "short_name": "SEADRILL PARTNERS LLC COM UNIT ",
        "long_name": "Seadrill Partners LLC",
        "summary": "Seadrill Partners LLC owns and operates drillships, semi-submersible rigs, and tender rigs in the United States, Canada, Thailand, Malaysia, Gabon, Myanmar, Nigeria, Indonesia, and internationally. The company provides offshore drilling services to the oil and gas industry. It operates a fleet of 11 drilling units, including 4 drillships, 4 semi-submersible rigs, and 3 tender rigs. The company was founded in 2012 and is headquartered in London, the United Kingdom. On December 1, 2020, Seadrill Partners LLC, along with its affiliates, filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the Southern District of Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "SDX.L": {
        "short_name": "SDX ENERGY PLC ORD 1P",
        "long_name": "SDX Energy plc",
        "summary": "SDX Energy plc engages in the exploration, production, and development of oil and gas with a principal focus on North Africa. The company has interest in two producing assets, including 50% in North West Gemsa and 50% in Meseda located onshore in the Eastern Desert, adjacent to the Gulf of Suez, Egypt. It also holds a 55% interest in the South Disouq concession located in the Nile Delta region, Egypt; and a 75% interest in the Sebou concession situated in the Rharb Basin, Morocco. The company was incorporated in 2019 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "SEY.L": {
        "short_name": "STERLING ENERGY PLC ORD 10P",
        "long_name": "Sterling Energy plc",
        "summary": "Sterling Energy plc, together with its subsidiaries, operates as an upstream oil and gas company primarily in Africa and the Middle East. It is involved in the appraisal, exploration, development, and production of oil and gas. The company holds 34% interest in an exploration project covering approximately 22,840 square kilometers located in Somaliland. The company was incorporated in 1983 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "SOCLF": {
        "short_name": "PHAROS ENERGY PLC",
        "long_name": "Pharos Energy plc",
        "summary": "Pharos Energy plc engages in the exploration, development, and production of oil and gas properties. The company holds a 30.5% working interest in the Te Giac Trang Field of Block 16-1 located in the shallow water Cuu Long Basin, as well as a 25% working interest in the Ca Ngu Vang field of Block 9-2 situated in the shallow water Cuu Long Basin, offshore southern Vietnam; a 70% interest in the Blocks 125 & 126 located in the Phu Khanh Basin, offshore central Vietnam; and a 100% working interest in the onshore El Fayum concession in the Western Desert, Egypt. It also holds a 33.33 % working interest in eight licenses situated in Israel. The company was formerly known as SOCO International plc and changed its name to Pharos Energy plc in October 2019. Pharos Energy plc was founded in 1997 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "SQZ.L": {
        "short_name": "SERICA ENERGY PLC ORD USD0.10",
        "long_name": "Serica Energy plc",
        "summary": "Serica Energy plc, an upstream oil and gas company, engages in the identification, acquisition, exploration, and exploitation of oil and gas reserves. Its primary focus is on the production and development in the United Kingdom North Sea, complemented by a portfolio of oil and gas exploration opportunities, including interests in offshore license blocks in the United Kingdom North Sea, and Namibia. The company holds 100% interest in the Keith oil fields; 98% interest Bruce gas fields; and 50% interest in the Rhum gas fields located in the northern North Sea. Serica Energy plc was founded in 2004 and is headquartered in Aberdeen, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Aberdeen"
    },
    "SQZZF": {
        "short_name": "SERICA ENERGY PLC",
        "long_name": "Serica Energy plc",
        "summary": "Serica Energy plc, an upstream oil and gas company, engages in the identification, acquisition, exploration, and exploitation of oil and gas reserves. Its primary focus is on the production and development in the United Kingdom North Sea, complemented by a portfolio of oil and gas exploration opportunities, including interests in offshore license blocks in the United Kingdom North Sea, and Namibia. The company holds 100% interest in the Keith oil fields; 98% interest Bruce gas fields; and 50% interest in the Rhum gas fields located in the northern North Sea. Serica Energy plc was founded in 2004 and is headquartered in Aberdeen, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Aberdeen"
    },
    "TLW.L": {
        "short_name": "TULLOW OIL PLC ORD 10P",
        "long_name": "Tullow Oil plc",
        "summary": "Tullow Oil plc engages in the oil and gas exploration, development, and production activities primarily in Africa and South America. Its portfolio comprises 80 licenses covering 195,751 square kilometers in 15 countries. The company was founded in 1985 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "TQW.F": {
        "short_name": "TULLOW OIL PLC  LS-,10",
        "long_name": "Tullow Oil plc",
        "summary": "Tullow Oil plc engages in the oil and gas exploration, development, and production activities primarily in Africa and South America. Its portfolio comprises 80 licenses covering 195,751 square kilometers in 15 countries. The company was founded in 1985 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "TQW.IR": {
        "short_name": "TULLOW OIL PLC",
        "long_name": "Tullow Oil plc",
        "summary": "Tullow Oil plc engages in the oil and gas exploration, development, and production activities primarily in Africa and South America. Its portfolio comprises 80 licenses covering 195,751 square kilometers in 15 countries. The company was founded in 1985 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "ISE",
        "market": "ie_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "TRIN.L": {
        "short_name": "TRINITY EXPLORATION & PRODUCTIO",
        "long_name": "Trinity Exploration & Production plc",
        "summary": "Trinity Exploration & Production plc, an independent oil company, engages in the exploration, development, production, and sale of crude oil. The company operates a portfolio of producing, development, and exploration assets onshore and offshore in the shallow waters off the west and east coasts of Trinidad. As of December 31, 2019, its proved and probable, as well as contingent resources included 41.07 million stock tank barrels. Trinity Exploration & Production plc was founded in 1996 and is based in Leeds, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Leeds"
    },
    "TRMD": {
        "short_name": "TORM plc",
        "long_name": "TORM plc",
        "summary": "TORM plc, a product tanker company, engages in the transportation of refined oil products worldwide. The company transports gasoline, jet fuel, naphtha, and diesel oil. As of March 13, 2020, it operated a fleet of approximately 80 vessels. The company was founded in 1889 and is based in London, the United Kingdom. TORM PLC is a subsidiary of Njord Luxco.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "TRMD-A.CO": {
        "short_name": "TORM plc A",
        "long_name": "TORM plc",
        "summary": "TORM plc, a product tanker company, engages in the transportation of refined oil products worldwide. The company transports gasoline, jet fuel, naphtha, and diesel oil. As of March 13, 2020, it operated a fleet of approximately 80 vessels. The company was founded in 1889 and is based in London, the United Kingdom. TORM PLC is a subsidiary of Njord Luxco.",
        "currency": "DKK",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "CPH",
        "market": "dk_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "TUWLF": {
        "short_name": "TULLOW OIL PLC",
        "long_name": "Tullow Oil plc",
        "summary": "Tullow Oil plc engages in the oil and gas exploration, development, and production activities primarily in Africa and South America. Its portfolio comprises 80 licenses covering 195,751 square kilometers in 15 countries. The company was founded in 1985 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "TUWOY": {
        "short_name": "TULLOW OIL PLC",
        "long_name": "Tullow Oil plc",
        "summary": "Tullow Oil plc engages in the oil and gas exploration, development, and production activities primarily in Africa and South America. Its portfolio comprises 80 licenses covering 195,751 square kilometers in 15 countries. The company was founded in 1985 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "UJO.L": {
        "short_name": "UNION JACK OIL PLC ORD 0.025P",
        "long_name": "Union Jack Oil plc",
        "summary": "Union Jack Oil plc operates as an onshore oil and gas exploration and production company in the United Kingdom. The company focuses on production, drilling, development, and investment in hydrocarbon projects. It holds interests in the Biscathorpe, Burton on the Wolds, North Kelsey, Wressle, and Keddington projects. Union Jack Oil plc was incorporated in 2011 and is based in Bath, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Bath"
    },
    "UKOG.L": {
        "short_name": "UK OIL & GAS PLC ORD 0.01P",
        "long_name": "UK Oil & Gas PLC",
        "summary": "UK Oil & Gas PLC operates as an oil and gas exploration and production company in the United Kingdom. The company holds direct and indirect interests in a portfolio of eight UK onshore exploration, appraisal, development, and production assets in the Weald and Purbeck-Wight basins of Southern England. Its assets cover approximately 792 gross square kilometers. The company was incorporated in 2004 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "ULF1.F": {
        "short_name": "TOWER RESOURCES LS-,00001",
        "long_name": "Tower Resources plc",
        "summary": "Tower Resources Plc operates as an independent oil and gas exploration company in Africa. The company holds a 100% interest in the Thali production sharing contract that covers an area of 119.2 square kilometers located in the Rio del Rey basin, offshore Cameroon; and a 50% interest in the Algoa-Gamtoos license that covers an area of 9,369 square kilometers situated in the offshore South Africa. It also operates 80% interest in Blocks 1910A, 1911, and 1912B of the northern Walvis Basin and Dolphin Graben, which cover a gross area of 23,297 square kilometers located in Namibia. The company was incorporated in 2004 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "UOG.L": {
        "short_name": "UNITED OIL & GAS PLC ORD GBP0.0",
        "long_name": "United Oil & Gas Plc",
        "summary": "United Oil & Gas Plc engages in the exploration, development, and production of oil and gas in the United Kingdom, other countries in Europe, and Latin America. The company holds interests in the Podere Gallina license located in the Po Valley region of Italy; PL090 license located in the Wessex Basin, onshore United Kingdom; and P1918 license located in the offshore southern United Kingdom. It also holds interests in the Walton Morant license located in offshore Jamaica. The company was founded in 2015 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "UPL.L": {
        "short_name": "UPLAND RESOURCES LIMITED ORD NP",
        "long_name": "Upland Resources Limited",
        "summary": "Upland Resources Limited is a principal investment firm specializing in farm-ins and applications for open acreage. The firm seeks to invest in the oil and gas exploration and production sectors. Upland Resources Limited was founded in 2012 and is based in Saint Helier, Jersey with an additional office in Ashbourne, United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Jersey"
    },
    "VALPQ": {
        "short_name": "Valaris plc",
        "long_name": "Valaris plc",
        "summary": "Valaris plc provides offshore drilling services in various water depths worldwide. The company operates in three segments: Floaters, Jackups, and Other. As of September 30, 2020, it owned and operated 13 drillships, 4 dynamically positioned semisubmersible rigs, 1 moored semisubmersible rig, and 45 jackup rigs, including rigs under construction. The company was formerly known as Ensco Rowan plc and changed its name to Valaris plc in July 2019. The company was incorporated in 2009 and is based in London, the United Kingdom. On August 19, 2020, Valaris plc, along with its affiliates, filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the Southern District of Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "VGAS.L": {
        "short_name": "VOLGA GAS PLC ORD 1P",
        "long_name": "Volga Gas plc",
        "summary": "Volga Gas plc, through its subsidiaries, explores, develops, and produces oil, gas, condensate, and liquid petroleum gas in the Volgograd and Saratov regions of Russia. It holds 100% interests in the Karpenskiy license covering an area of 4,166 square kilometers located in the Saratov region; Vostochny Makarovskoye and Dobrinskoye license located in the Volgograd region; and Urozhainoye-2 license located in the Saratov region, as well as Muradymosky. The company has proved plus probable reserves of 10.472 million barrels of oil and condensate; and 70.7 billion cubic feet of natural gas, as well as 198 tons of LPG. Volga Gas plc was incorporated in 2006 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "VLS.L": {
        "short_name": "VELOCYS PLC ORD 1P",
        "long_name": "Velocys plc",
        "summary": "Velocys plc operates as a sustainable fuels technology company. It designs, develops, and licenses its Fischer-Tropsch technology for the generation of clean, low carbon, synthetic drop-in aviation and road transport fuel from municipal solid waste and residual woody biomass plants. The company has a collaboration with British Airways and Shell for the development of a waste-to-jet-fuel project in the United Kingdom. It has operations in the United States, the United Kingdom, and the Asia Pacific. The company was formerly known as Oxford Catalysts Group PLC and changed its name to Velocys plc in September 2013. Velocys plc was incorporated in 2006 and is headquartered in Oxford, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Oxford"
    },
    "VNHLF": {
        "short_name": "ZEPHYR ENERGY PLC",
        "long_name": "Zephyr Energy plc",
        "summary": "Zephyr Energy plc, together with its subsidiaries, primarily explores for and develops oil and gas resources in the United States. Its flagship property is the Paradox Basin, which covers an area of approximately 12,920 acres located in Utah, the United States. The company was formerly known as Rose Petroleum plc and changed its name to Zephyr Energy plc in August 2020. Zephyr Energy plc was incorporated in 2002 and is headquartered in Newbury, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Newbury"
    },
    "VOG.L": {
        "short_name": "VICTORIA OIL & GAS PLC ORD 0.5P",
        "long_name": "Victoria Oil & Gas Plc",
        "summary": "Victoria Oil & Gas Plc engages in the exploration, development, and production of oil and gas in the United Kingdom. The company holds 57% interest in the Logbaba gas and condensate project, which covers an area of 20 square kilometers located in Cameroon; and 75% interest in the Matanda Block covering an area of 1,235 square kilometers located in Cameroon. It also supplies gas and gas condensate to industrial customers through a 50 kilometers pipeline in Douala. In addition, the company is involved in the sale of hydrocarbons and related activities. Victoria Oil & Gas Plc was incorporated in 2004 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "VVO.JO": {
        "short_name": "Vivo Energy plc",
        "long_name": "Vivo Energy plc",
        "summary": "Vivo Energy plc operates as a retailer and distributor of fuels and lubricants in Africa. It operates through three segments: Retail, Commercial, and Lubricants. The Retail segment sells petrol and diesel fuels at Shell and Engen-branded service stations; operates convenience retail shops, and quick service and fast casual restaurants; and provides other services, including lubricant bays, car washes, and ATMs. As of December 31, 2019, it operated 2,226 service stations in 23 countries under the Shell and Engen brands. The Commercial segment offers fuels, lubricants, and related product services to commercial customers in the transport, construction, power and industrial, infrastructure, mining, aviation, and marine sectors; and supplies liquefied petroleum gas primarily to consumers and fuels to the wholesale market. The Lubricants segment sells lubricants to commercial customers and retail consumers through service station forecourts and lubricant bays, as well as oil and repair shops, service centres, and resellers through a network of distributors; supplies lubricants to mining companies and B2B customers; and export of products to approximately 10 other African markets. The company was formerly known as VE Holding plc and changed its name to Vivo Energy plc in April 2018. Vivo Energy plc was founded in 2011 and is based in London, the United Kingdom.",
        "currency": "ZAc",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JNB",
        "market": "za_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "VVO.L": {
        "short_name": "VIVO ENERGY PLC ORD USD0.50",
        "long_name": "Vivo Energy plc",
        "summary": "Vivo Energy plc operates as a retailer and distributor of fuels and lubricants in Africa. It operates through three segments: Retail, Commercial, and Lubricants. The Retail segment sells petrol and diesel fuels at Shell and Engen-branded service stations; operates convenience retail shops, and quick service and fast casual restaurants; and provides other services, including lubricant bays, car washes, and ATMs. As of December 31, 2019, it operated 2,226 service stations in 23 countries under the Shell and Engen brands. The Commercial segment offers fuels, lubricants, and related product services to commercial customers in the transport, construction, power and industrial, infrastructure, mining, aviation, and marine sectors; and supplies liquefied petroleum gas primarily to consumers and fuels to the wholesale market. The Lubricants segment sells lubricants to commercial customers and retail consumers through service station forecourts and lubricant bays, as well as oil and repair shops, service centres, and resellers through a network of distributors; supplies lubricants to mining companies and B2B customers; and export of products to approximately 10 other African markets. The company was formerly known as VE Holding plc and changed its name to Vivo Energy plc in April 2018. Vivo Energy plc was founded in 2011 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "WCAT.L": {
        "short_name": "WILDCAT PETROLEUM PLC ORD GBP0.",
        "long_name": "Wildcat Petroleum Plc",
        "summary": "Wildcat Petroleum Plc intends to invest in businesses in the upstream sector of the petroleum industry. It focuses on the exploration, appraisal, development, and production of oil and gas. The company was incorporated in 2020 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "WDGJF": {
        "short_name": "WOOD GROUP (JOHN)",
        "long_name": "John Wood Group PLC",
        "summary": "John Wood Group PLC, together with its subsidiaries, provides project management, engineering, consulting, and technical services to energy and built environment worldwide. It operates through four segments: Asset Solutions Europe, Africa, Asia, Australia; Assets Solutions Americas; Technical Consulting Solutions; and Investment Services. The company offers engineering, fabrication and construction, and bundled services; commissioning and decommissioning services; and operations and maintenance services. It also provides scaffolding, rope access, thermal insulation and industrial painting, specialist construction and civils, asbestos remediation, mechanical, and piping support services, as well as electrical, control, and instrumentation. In addition, the company offers project management, EPC/EPCM project, and construction and field services; environment and infrastructure solutions, including environmental studies, permitting and compliance, environmental remediation, public infrastructure, geotechnical and materials, and engineering and construction services. Further, it provides clean energy solutions, such as engineering, design, and project management; analytics, technology, and laboratories; safety, licensing, and regulatory; and plant operations and life extension services. Additionally, the company offers mineral resources and project assessments, mine planning and design, mineral processing and metallurgy, and material handling; and information management, IoT and connected devices, software and applications and analytics, visualization, and digital project delivery, as well as automation and control, and consulting solutions. The company also provides subsea and export systems comprising operational support and integrity; engineer, procure, and fabricate; flow assurance; subsea, umbilical, riser, and flowline; and pipelines and marine terminals. John Wood Group PLC is based in Aberdeen, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Aberdeen"
    },
    "WEN.L": {
        "short_name": "WENTWORTH RESOURCES PLC ORD NPV",
        "long_name": "Wentworth Resources plc",
        "summary": "Wentworth Resources plc, an exploration and production company, explores for, develops, and produces natural gas and other hydrocarbons. It owns interest in the Mnazi Bay concession totaling an area of approximately 756 square kilometers located in southern Tanzania. The company was founded in 2000 and is headquartered in Reading, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Reading"
    },
    "WGO.AX": {
        "short_name": "WARREGO FPO",
        "long_name": "Warrego Energy Limited",
        "summary": "Warrego Energy Limited engages in the exploration and development of oil and gas properties. The company holds interest in the EP469 basin covering an area of 224 square kilometers; and interests in the STP-EPA-0127 basin, which comprises an area of 8,700 square kilometers located in Perth Basin, Western Australia. It also holds interests in the Tesorillo project, which include two petroleum exploration licenses, such as the Tesorillo and Ruedalabola permits covering an area of 38,000 hectares in Spain; and the El Romeral property. The company was incorporated in 2007 and is headquartered in Perth, Australia.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "ASX",
        "market": "au_market",
        "country": "United Kingdom",
        "city": "Aberdeen"
    }
}