{
    "7N6.F": {
        "short_name": "WISHBONE GOLD PLC LS-,001",
        "long_name": "Wishbone Gold Plc",
        "summary": "Wishbone Gold Plc engages in the resource evaluation, and gold production and trading activities. It holds interest in the four gold exploration licenses covering an area of approximately 34,000 acres in north east Queensland, Australia. The company also operates as a precious metals and gem trader in Dubai, Columbia, Honduras, Chile, and Peru. In addition, it holds an option to acquire a 100% ownership in the Patersons Range Project covering an area of 67 square kilometers located in the Patersons Range region of Western Australia. The company was founded in 2009 and is based in Gibraltar.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Gold",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Gibraltar",
        "state": null,
        "city": "Gibraltar",
        "zipcode": "GX11 1AA",
        "website": "http://www.wishbonegold.com",
        "market_cap": "Small Cap"
    },
    "BOREF": {
        "short_name": "BOREALIS EXPLORATION",
        "long_name": "Borealis Exploration Limited",
        "summary": "Borealis Exploration Limited, a technology development company, engages in inventing, patenting, developing, and acquiring new technologies. Its principal technologies include Chorus Meshcon, an electric motor/drive providing high torque at low speeds without compromising high-speed operation and performance; WheelTug, an aircraft electric drive system, which enables ircraft to drive forward and backward without using its engines or external tugs; Avto Metals, a custom-designed material for applications in microelectronic devices, including computers, cell phones, and multifunction digital tools. The company's principal technologies also include Cool Chips, which are devices that use quantum electron thermotunnelling to produce cooling, refrigeration, or air-conditioning, which has applications in cooling electronics, refrigerators and freezers, medical and industrial equipment, buildings, cargo, aircraft, and cars; and Power Chips, a new technology that uses the physical mechanism of thermionics and quantum thermotunnelling to generate electrical power directly from heat, with no moving parts, produce power for laptop computers, buildings, and cars and trucks. It also holds interests in various iron ore deposits. The company was founded in 1965 and is headquartered in Gibraltar, Gibraltar.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Gibraltar",
        "state": null,
        "city": "Gibraltar",
        "zipcode": "GX11 1AA",
        "website": "http://www.borealis.gi",
        "market_cap": "Small Cap"
    },
    "C8V.F": {
        "short_name": "888 HOLDINGS PLC  LS-,005",
        "long_name": "888 Holdings plc",
        "summary": "888 Holdings plc, together with its subsidiaries, provides online betting and gaming products and solutions. It operates through Business to Customer and Business to Business segments. The company owns proprietary software solutions that provide a range of virtual online gaming services over the internet, including casino and games, poker, sport, and bingo games. It also provides payment services, customer support, and online advertising services, as well as licenses online games. The company operates in Europe, the Middle East, Africa, the United Kingdom, Italy, Spain, the United States, and internationally. 888 Holdings plc was founded in 1997 and is headquartered in Gibraltar.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Gambling",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Gibraltar",
        "state": null,
        "city": "Gibraltar",
        "zipcode": null,
        "website": "http://corporate.888.com",
        "market_cap": "Small Cap"
    },
    "COLCF": {
        "short_name": "COOL CHIPS PLC",
        "long_name": "Cool Chips plc",
        "summary": "Cool Chips plc researches, develops, and commercializes Cool Chips. The company is developing Cool Chips, which are small electronic devices that use electrons to carry heat from one side of vacuum diode to the other, thus producing cooling, refrigeration, or air conditioning. It serves aerospace, automotive, cargo cooling, electronics, industrial processing, domestic refrigeration, semiconductor fabrication, HVAC, and telecom markets. The company was incorporated in 1996 and is headquartered in Gibraltar. Cool Chips plc is a subsidiary of Borealis Technical Limited.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Gibraltar",
        "state": null,
        "city": "Gibraltar",
        "zipcode": "GX11 1AA",
        "website": "http://www.coolchips.gi",
        "market_cap": "Small Cap"
    },
    "EIHDF": {
        "short_name": "888 HOLDINGS",
        "long_name": "888 Holdings plc",
        "summary": "888 Holdings plc, together with its subsidiaries, provides online gaming entertainment products and solutions. It operates through Business to Customer and Business to Business segments. The company owns proprietary software solutions that provide a range of virtual online gaming services over the internet, including casino and games, poker, sport, bingo, and social games. It also provides payment services, customer support, and online advertising services, as well as licenses its brand on third party platforms. The company serves clients in the United Kingdom; Europe, the Middle East, and Africa; Spain; the Americas; and internationally. 888 Holdings plc was founded in 1997 and is headquartered in Gibraltar.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Gambling",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Gibraltar",
        "state": null,
        "city": "Gibraltar",
        "zipcode": null,
        "website": "http://corporate.888.com",
        "market_cap": "Mid Cap"
    },
    "FLAF": {
        "short_name": "FARM LANDS OF AFRICA INC",
        "long_name": "Farm Lands of Africa, Inc.",
        "summary": "Buddhavarapu Farms S.A. owns and operates agriculture farms. It engages in the production of agricultural products including vegetables, rice, palm oil, and eucalyptus. The company is based in Gibraltar.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Gibraltar",
        "state": null,
        "city": "Gibraltar",
        "zipcode": null,
        "website": "http://www.farmlandsofafrica.com",
        "market_cap": "Small Cap"
    },
    "WSBN.L": {
        "short_name": "WISHBONE GOLD PLC ORD 0.1P (DI)",
        "long_name": "Wishbone Gold Plc",
        "summary": "Wishbone Gold Plc engages in the resource evaluation, and gold production and trading activities. It holds interest in the four gold exploration licenses covering an area of approximately 34,000 acres in north east Queensland, Australia. The company also operates as a precious metals and gem trader in Dubai, Columbia, Honduras, Chile, and Peru. In addition, it holds an option to acquire a 100% ownership in the Patersons Range Project covering an area of 67 square kilometers located in the Patersons Range region of Western Australia. The company was founded in 2009 and is based in Gibraltar.",
        "currency": "GBp",
        "sector": "Basic Materials",
        "industry": "Gold",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Gibraltar",
        "state": null,
        "city": "Gibraltar",
        "zipcode": "GX11 1AA",
        "website": "http://www.wishbonegold.com",
        "market_cap": null
    }
}