{
  "9IFA.F": {
    "city": "Lima",
    "country": "Peru",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Banks - Regional",
    "long_name": "Intercorp Financial Services Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "INTERCORP FIN.SERV. O.N.",
    "state": null,
    "summary": "Intercorp Financial Services Inc. provides banking, insurance, and wealth management services for retail and commercial clients in Peru. The company operates through three segments: Banking, Insurance, and Wealth Management. It provides transactional accounts, such as cuenta sueldo and cuenta simple; savings accounts; investment accounts; and time deposits, certificates of deposit, and compensation for service time accounts. The company also offers retail banking products, including consumer, payroll deduction, cash, vehicle, student, express, collateralized cash, mortgage, and other consumer loans, as well as credit cards. In addition, it provides corporate, medium-size business, and small business banking services; and commercial banking products, which include commercial real estate, vehicles, machinery and other goods, cash management, trade finance, and electronic factoring products. Further, it offers treasury and institutional banking, as well as securitization services. Additionally, the company provides annuities and conventional life insurance, and other retail insurance products; financial planning and mutual fund services; brokerage and investment management services; and financial advisory services for equities, fixed income, structured products, alternative investments, and managed accounts. As of December 31, 2020, it operated 215 financial stores and 1,640 ATMs. Intercorp Financial Services Inc. was incorporated in 1897 and is based in Lima, Peru. Intercorp Financial Services Inc. is a subsidiary of Intercorp Perú Ltd.",
    "website": "http://www.ifs.com.pe",
    "zipcode": "13"
  },
  "BAP": {
    "city": "Lima",
    "country": "Peru",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Banks - Regional",
    "long_name": "Credicorp Ltd.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "Credicorp Ltd.",
    "state": null,
    "summary": "Credicorp Ltd., a financial services holding company, provides various financial, insurance, and health services and products primarily in Peru and internationally. The company's Universal Banking segment offers deposits and current accounts, and various credits and financial instruments to individuals and legal entities. Its Insurance and Pensions segment issues insurance policies to cover losses in commercial property, transportation, marine vessels, automobile, life, health, and pensions, as well as provides private pension fund management services. The company's Microfinance segment manages loans, credits, deposits, and current accounts of the small and microenterprises. Its Investment Banking and Wealth Management segment offers its services to corporations, institutional investors, governments, and foundations; engages in structuring and placement of issues in the primary market, as well as the execution and negotiation of operations in the secondary market; and structures securitization processes for corporate customers and manages mutual funds. The company was founded in 1889 and is headquartered in Lima, Peru.",
    "website": "http://www.grupocredicorp.com",
    "zipcode": "12"
  },
  "BAPN.MX": {
    "city": "Lima",
    "country": "Peru",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Banks - Regional",
    "long_name": "Credicorp Ltd.",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "CREDICORP",
    "state": null,
    "summary": "Credicorp Ltd., a financial services holding company, provides various financial, insurance, and health services and products primarily in Peru and internationally. The company's Universal Banking segment offers deposits and current accounts, and various credits and financial instruments to individuals and legal entities. Its Insurance and Pensions segment issues insurance policies to cover losses in commercial property, transportation, marine vessels, automobile, life, health, and pensions, as well as provides private pension fund management services. The company's Microfinance segment manages loans, credits, deposits, and current accounts of the small and microenterprises. Its Investment Banking and Wealth Management segment offers its services to corporations, institutional investors, governments, and foundations; engages in structuring and placement of issues in the primary market, as well as the execution and negotiation of operations in the secondary market; and structures securitization processes for corporate customers and manages mutual funds. The company was founded in 1889 and is headquartered in Lima, Peru.",
    "website": "http://www.grupocredicorp.com",
    "zipcode": "12"
  },
  "D8V.F": {
    "city": "Lima",
    "country": "Peru",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Banks - Regional",
    "long_name": "Credicorp Ltd.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "CREDICORP LTD DL 5",
    "state": null,
    "summary": "Credicorp Ltd., a financial services holding company, provides various financial, insurance, and health services and products primarily in Peru and internationally. The company's Universal Banking segment offers deposits and current accounts, and various credits and financial instruments to individuals and legal entities. Its Insurance and Pensions segment issues insurance policies to cover losses in commercial property, transportation, marine vessels, automobile, life, health, and pensions, as well as provides private pension fund management services. The company's Microfinance segment manages loans, credits, deposits, and current accounts of the small and microenterprises. Its Investment Banking and Wealth Management segment offers its services to corporations, institutional investors, governments, and foundations; engages in structuring and placement of issues in the primary market, as well as the execution and negotiation of operations in the secondary market; and structures securitization processes for corporate customers and manages mutual funds. The company was founded in 1889 and is headquartered in Lima, Peru.",
    "website": "http://www.grupocredicorp.com",
    "zipcode": "12"
  },
  "IFS": {
    "city": "Lima",
    "country": "Peru",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Banks - Regional",
    "long_name": "Intercorp Financial Services Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "Intercorp Financial Services In",
    "state": null,
    "summary": "Intercorp Financial Services Inc. provides banking, insurance, and wealth management services for retail and commercial clients in Peru. The company operates through three operating segments: Banking, Insurance, and Wealth Management. It provides transactional accounts, such as cuenta sueldo and cuenta simple; savings accounts; investment accounts; and time deposits, certificates of deposit, and compensation for service time accounts. The company also offers retail banking products, including consumer, payroll deduction, cash, vehicle, student, express, collateralized cash, mortgage, and other consumer loans, as well as credit cards. In addition, it provides corporate, medium-size business, and small business banking services; and commercial banking products, which include commercial real estate, vehicles, machinery and other goods, cash management, trade finance, and electronic factoring products. Further, it offers treasury and institutional banking, as well as securitization services. Additionally, the company provides annuities and conventional life insurance, and other retail insurance products; financial planning and mutual fund services; brokerage and investment management services; and financial advisory services for equities, fixed income, structured products, alternative investments, and managed accounts. As of December 31, 2020, it operated 215 financial stores and 1,640 ATMs. Intercorp Financial Services Inc. was founded in 1897 and is based in Lima, Peru. Intercorp Financial Services Inc. is a subsidiary of Intercorp Perú Ltd.",
    "website": "http://www.ifs.com.pe",
    "zipcode": "13"
  }
}
