{"BHCN.MX": {"short_name": "BAUSCH HEALTH COMPANIES INC", "long_name": "Bausch Health Companies Inc.", "summary": "Bausch Health Companies Inc. develops, manufactures, and markets a range of pharmaceutical, medical device, and over-the-counter (OTC) products primarily in the therapeutic areas of eye health, gastroenterology, and dermatology. The company operates through four segments: Bausch + Lomb/International, Salix, Ortho Dermatologics, and Diversified Products. The Bausch + Lomb/International segment offers products with a focus on the vision care, surgical, and consumer and ophthalmology Rx products in the United States; and Solta products, branded and generic pharmaceutical products, OTC products, and medical device products, and Bausch + Lomb products in Canada, Europe, Asia, Australia, Latin America, Africa, and the Middle East. The Salix segment provides gastroenterology products in the United States. The Ortho Dermatologics segment offers dermatological products in the United States; and Solta medical aesthetic devices internationally. The Diversified Products segment provides pharmaceutical products in the areas of neurology and other therapeutic classes, as well as generic and dentistry products in the United States. The company was formerly known as Valeant Pharmaceuticals International, Inc. and changed its name to Bausch Health Companies Inc. in July 2018. Bausch Health Companies Inc. is headquartered in Laval, Canada.", "currency": "MXN", "sector": "Healthcare", "industry": "Drugs - Generic", "exchange": "MEX", "market": "mx_market", "country": "Canada", "city": "Laval"}, "ENDPN.MX": {"short_name": "ENDO INTERNATIONAL PLC", "long_name": "Endo International plc", "summary": "Endo International plc manufactures and sells generic and branded pharmaceuticals in the United States and internationally. Its Branded Pharmaceuticals segment provides branded prescription products, including XIAFLEX to treat adult patients with Dupuytren's contracture; SUPPRELIN LA to treat central precocious puberty in children; NASCOBAL nasal spray to treat vitamin B12 deficiency; TESTOPEL for TRT in conditions associated with a deficiency or absence of endogenous testosterone; AVEED to treat hypogonadism; PERCOCET to treat moderate-to-moderately-severe pain; VOLTAREN gel for the relief of joint pain of osteoarthritis; LIDODERM for the relief of pain; TESTOPEL, an implantable pellet indicated for TRT in conditions; EDEX to treat erectile dysfunction; and LIDODERM a topical patch product containing lidocaine. The company's Sterile Injectables segment manufactures VASOSTRICT, a vasopressin injection; ADRENALIN, a non-selective adrenergic agonist; and APLISOL, which is a sterile aqueous solution, as well as generic sterile injectable products. Its Generic Pharmaceuticals segment offers solid oral extended-release, solid oral immediate-release, liquids, semi-solids, patches, powders, ophthalmic products, and sprays; and products for the pain management, urology, central nervous system disorders, immunosuppression, oncology, women's health, and cardiovascular disease markets. The company's International Pharmaceuticals segment offers specialty pharmaceutical products in various therapeutic areas comprising attention deficit hyperactivity disorder, pain, women's health, and oncology. The company sells its branded pharmaceuticals and generics to specialty physicians, retailers, clinics, government agencies, doctors, retail and specialty pharmacies, and specialty distributors. Endo International plc was founded in 1920 and is headquartered in Dublin, Ireland.", "currency": "MXN", "sector": "Healthcare", "industry": "Drugs - Generic", "exchange": "MEX", "market": "mx_market", "country": "Ireland", "city": "Dublin"}, "TAKN.MX": {"short_name": "TAKEDA PHARMACEUTICAL CO LTD", "long_name": "Takeda Pharmaceutical Company Limited", "summary": "Takeda Pharmaceutical Company Limited engages in the research, development, manufacturing, and marketing of pharmaceutical products, over-the-counter medicines and quasi-drug consumer products, and other healthcare products. It offers pharmaceutical products in the areas of gastroenterology; oncology; neuroscience; and rare diseases, such as rare metabolic and hematology, and heredity angioedema, as well as plasma-derived therapies and vaccines. The company provides its products under the ENTYVIO, GATTEX/REVESTIVE, ALOFISEL, NATPARA, ADYNOVATE/ADYNOVI, TAKHZYRO, ELAPRASE, VPRIV, GAMMAGARD LIQUID/KIOVIG, HYQVIA, CUVITRU, ALBUMIN/FLEXBUMIN, NINLARO, and ALUNBRIG brands. It operates in Japan, the United States, Europe and Canada, Russia/CIS, Latin America, rest of Asia, the Middle East, Oceania, and Africa. The company has licensing agreements with TESARO, Inc., Denali Therapeutics, and Wave Life Sciences Ltd; collaboration agreements with Rani Therapeutics LLC, Novimmune S.A., AB Biosciences Inc., Sosei Group Corporation, and LogicBio Therapeutics, Inc.; strategic collaboration with Prometheus Biosciences, Inc; a license and research agreement with The University of Texas MD Anderson Cancer Center; a research collaboration agreements with Enzyre BV and Cerevance; a collaboration agreement with Artisan Bio, Inc.; and a multi-target rare disease collaboration with Evox Therapeutics Ltd., as well as licensing agreement with ProThera Biologics Inc. It also has a corporate strategic research alliance with Egle Therapeutics SAS; a strategic partnership with Neurocrine Biosciences, Inc.; Carmine Therapeutics and HemoShear Therapeutics, LLC; and strategic collaboration with KSQ Therapeutics to research, develop, and commercialize immune-based therapies for cancer. Takeda Pharmaceutical Company Limited was founded in 1781 and is headquartered in Tokyo, Japan.", "currency": "MXN", "sector": "Healthcare", "industry": "Drugs - Generic", "exchange": "MEX", "market": "mx_market", "country": "Japan", "city": "Tokyo"}, "TBET": {"short_name": "TIBET PHARMACEUTICALS INC", "long_name": "Tibet Pharmaceuticals, Inc.", "summary": "Tibet Pharmaceuticals, Inc., a specialty pharmaceutical company, engages in the research, development, manufacture, marketing, and sale of traditional Tibetan medicines. The company, through its operational entity, Yunnan Shangri-La Tibetan Pharmaceutical Group Limited (YSTP), develops products in China for promoting health in human respiratory, digestive, urinary, and reproductive systems. Its commercialized products include 25 Ingredients Mandrake Pill, which is used to regulate menses to treat endometritis, pelvic inflammations, and women's anemia; 15 Ingredients Gentiana Pill to treat bronchitis, emphysema, asthma, and hoarseness; 28 Ingredients Pinang Pill for treating cold waist hip pain, pus hematuria, and testis swelling; 18 Ingredients Chebulic (Myrobalan) Frusemide Pill for the treatment of kidney problems, lumbar and kidney pain, frequent urination, turbid urine, diabetes, and spermatorrhea; and Pomegranate Nichirin Pill to treat indigestion, back and leg pain, frequent urination, foot edema, impotence, and nocturnal emission. The company also develops Xuezang Guben pill indicated for the treatment of neurasthenia, insomnia, frequent urination, nocturnal emission, and women's menopausal symptoms; Shengke I that is in Phase III clinical testing for treating type II diabetes; Shengke II, which is in Phase II clinical testing for treating impotence and premature ejaculation, prostrate disease, and memory loss; Jiuzan pill that is in Phase II clinical testing for the treatment of chronic gastroenteritis and peptic ulcers; and Antai pill, a pre-clinical stage product for treating hepatitis B. In addition, it focuses to commercialize Wupeng Pill for treating echimococosis, pandora tingling disease, diphtheria, anthrax, yellow water disease, and leprosy. The company was formerly known as Shangri-La Tibetan Pharmaceuticals, Inc. and changed its name to Tibet Pharmaceuticals Inc. in July 2010. Tibet Pharmaceuticals, Inc. is headquartered in Wanchai, Hong Kong.", "currency": "USD", "sector": "Healthcare", "industry": "Drugs - Generic", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Wanchai"}, "TEVAN.MX": {"short_name": "TEVA PHARMACEUTICAL INDUSTRIES", "long_name": "Teva Pharmaceutical Industries Limited", "summary": "Teva Pharmaceutical Industries Limited, a pharmaceutical company, develops, manufactures, markets, and distributes generic medicines, specialty medicines, and biopharmaceutical products in North America, Europe, and internationally. The company offers sterile products, hormones, high-potency drugs, and cytotoxic substances in various dosage forms, including tablets, capsules, injectables, inhalants, liquids, ointments, and creams. It also develops, manufactures, and sells active pharmaceutical ingredients. In addition, the company provides specialty medicines for use in central nervous system and respiratory indications. Further, its products in the central nervous system and pain area comprise Copaxone for the treatment of relapsing forms of MS; AJOVY for the preventive treatment of migraine; and AUSTEDO for the treatment of tardive dyskinesia and chorea associated with Huntington disease. Additionally, the company's products in the respiratory market include ProAir, ProAir Respiclick, QVAR, Duoresp Spiromax, Braltus, Cinqair/Cinqaero, and AirDuo RespiClick/ArmonAir RespiClick/AirDuo Digihaler for the treatment of asthma and chronic obstructive pulmonary disease, as well as Bendeka, Treanda, Granix, Trisenox, Lonquex, and Tevagrastim/Ratiograstim products in the oncology market. It has collaboration arrangements with Otsuka Pharmaceutical Co. Ltd. and Regeneron Pharmaceuticals, Inc. Teva Pharmaceutical Industries Limited was founded in 1901 and is headquartered in Petach Tikva, Israel.", "currency": "MXN", "sector": "Healthcare", "industry": "Drugs - Generic", "exchange": "MEX", "market": "mx_market", "country": "Israel", "city": "Petah Tikva"}}