{"BAYNN.MX": {"short_name": "BAYER AG", "long_name": "Bayer Aktiengesellschaft", "summary": "Bayer Aktiengesellschaft operates as a life science company worldwide. It operates through Pharmaceuticals, Consumer Health, and Crop Science segments. The Pharmaceuticals segment offers prescription products primarily for cardiology and women's health care; specialty therapeutics in the areas of oncology, hematology, and ophthalmology; and diagnostic imaging equipment and contrast agents. The Consumer Health segment markets nonprescription over-the-counter medicines, medical products, medicated skincare products, and self-care solutions in the dermatology, nutritional supplements, pain and cardiovascular risk prevention, digestive health, allergy, and cold and cough. The Crop Science segment offers chemical and biological crop protection products, improved plant traits, seeds, digital solution, and pest and weed control products, as well as customer service for agriculture. This segment also provides breeding, propagation, and production/processing of seeds, including seed dressing. Bayer Aktiengesellschaft has a collaboration agreement with MD Anderson Cancer Center at the University of Texas to develop cancer treatments; and research collaboration agreements with Haplogen GmbH and Kyoto University to identify new drugs candidates for the treatment of pulmonary diseases. The company distributes its products through wholesalers, pharmacies, supermarket and drugstore chains, online and other retailers, and hospitals, as well as directly to farmers. It has strategic research alliance with Kyoto University, Sensyne Health plc, and Atomwise Inc. Bayer Aktiengesellschaft was founded in 1863 and is based in Leverkusen, Germany.", "currency": "MXN", "sector": "Healthcare", "industry": "Drug Manufacturers - Major", "exchange": "MEX", "market": "mx_market", "country": "Germany", "city": "Leverkusen"}, "DPHN.MX": {"short_name": "DECHRA PHARMACEUTICALS", "long_name": "Dechra Pharmaceuticals PLC", "summary": "Dechra Pharmaceuticals PLC develops, manufactures, regulates, markets, and sells veterinary pharmaceuticals and related products for veterinarians worldwide. It operates through three segments: European Pharmaceuticals, North American Pharmaceuticals, and Pharmaceuticals Research and Development. The company offers various endocrinology, dermatology, analgesia and anesthesia, cardiovascular, and critical care products for dogs and cats; water soluble antibiotics, poultry vaccines, and pain management for poultry, pigs, and cattle; and lameness and pain management products for horses and ponies. It also provides pet nutrition products for supporting cats and dogs with various therapeutic conditions, such as allergies, obesity, heart, and kidney diseases. In addition, the company distributes veterinary pharmaceuticals and equipment; offers financial services; markets pet diets; and develops, regulates, manufactures, and markets crop protection. It markets its products through wholesaler and distributor networks. Dechra Pharmaceuticals PLC was incorporated in 1997 and is headquartered in Northwich, the United Kingdom.", "currency": "MXN", "sector": "Healthcare", "industry": "Drug Manufacturers - Major", "exchange": "MEX", "market": "mx_market", "country": "United Kingdom", "city": "Northwich"}, "LAVI.AT": {"short_name": "LAVIPHARM S.A. (CR)", "long_name": "Lavipharm S.A.", "summary": "Lavipharm S.A. engages in the research, development, manufacturing, import, marketing, sales, wholesaling, and retailing of pharmaceutical, dermocosmetic, and healthcare products in Greece and internationally. The company offers pharmaceutical products for cardiology, chronic pain and oncology, central nervous system, respiratory system, gastrointestinal system, and urology; over the counter (OTC) drugs, such as antiseptics, and analgesics; gynecological products; and anti-lice treatment drugs. It also provides transdermal drug delivery systems (TDDS) related to pain management, hypertension, angina pectoris, Parkinson disease, asthma, female or male hormone replacement therapy, contraception, nausea, incontinence, etc. In addition, the company's product pipeline includes nicotine TDDS for smoking cessation; TDDS for hypertension; range of OTC products for common cold, oral hygiene, excessive excretion of shawl; food supplements; and anti-ageing products. Lavipharm S.A. was founded in 1911 and is based in Paiania, Greece.", "currency": "EUR", "sector": "Healthcare", "industry": "Drug Manufacturers - Major", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Paiania"}, "SNYN.MX": {"short_name": "SANOFI", "long_name": "Sanofi", "summary": "Sanofi provides therapeutic solutions worldwide. It offers Cerezyme and Cerdelga for Gaucher, Myozyme and Lumizyme for Pompe, Fabrazyme for Fabry, and Aldurazyme for mucopolysaccharidosis Type 1; and Aubagio and Lemtrada for multiple sclerosis. It also provides Dupixent for atopic dermatitis; Kevzara for rheumatoid arthritis; Eloctate and Alprolix to treat hemophilia; and Cablivi to treat acquired thrombotic thrombocytopenic purpura. In addition, it offers Libtayo for metastatic cutaneous squamous cell carcinoma; Jevtana and Taxotere taxane for cancers; Eloxatin for colon cancer; Thymoglobulin, an immunosuppressive and immunomodulating agent; Mozobil for hematologic malignancies; and Zaltrap for metastatic colorectal cancer. Further, it provides Lantus, Toujeo, Apidra, and Insuman insulins; Amaryl sulfonylurea; Adlyxin/Lyxumia, a GLP-1 receptor agonist; Soliqua 100/33/Suliqua, an insulin glargine and lixisenatide combination to treat diabetes; Admelog/Insulin lispro insulin; Praluent, a cholesterol-lowering drug; and Multaq, an anti-arrhythmic drug. Additionally, it offers Plavix for atherothrombotic conditions; Lovenox for the prophylaxis, venous thromboembolism, and acute coronary syndrome; Aprovel and CoAprovel anti-hypertensives; Renagel and Renvela for patients undergoing dialysis; Synvisc and Synvisc-One viscosupplements for osteoarthritis; Stilnox for insomnia; Allegra for seasonal allergic rhinitis and uncomplicated hives; and Depakine for epilepsy. It also provides generic products; and products for allergy, cough, cold, pain, nutrition, digestion, pediatrics, influenza, meningitis, travel, and endemic vaccines; and adult and adolescent boosters. Sanofi has collaborations with Verily Life Sciences LLC; Happify Health; GlaxoSmithKline Plc; Kymera Therapeutics; Parkinson's Foundation, Inc.; and Nurix Therapeutics, Inc. The company was formerly known as Sanofi-Aventis. Sanofi was incorporated in 1994 and is headquartered in Paris, France.", "currency": "MXN", "sector": "Healthcare", "industry": "Drug Manufacturers - Major", "exchange": "MEX", "market": "mx_market", "country": "France", "city": "Paris"}}