{
    "FMEN.MX": {
        "short_name": "FRESENIUS MEDICAL CARE AG & CO ",
        "long_name": "Fresenius Medical Care AG & Co. KGaA",
        "summary": "Fresenius Medical Care AG & Co. KGaA provides dialysis care and related dialysis care services in Germany, North America, and internationally. It offers dialysis treatment and related laboratory and diagnostic services through a network of outpatient dialysis clinics; materials, training, and patient support services comprising clinical monitoring, follow-up assistance, and arranging for delivery of the supplies to the patient's residence; and dialysis services under contract to hospitals in the United States for the hospitalized end-stage renal disease (ESRD) patients and for patients suffering from acute kidney failure. The company also develops, manufactures, and distributes dialysis products, including polysulfone dialyzers, hemodialysis machines, peritoneal dialysis cyclers, peritoneal dialysis solutions, hemodialysis concentrates, solutions and granulates, bloodlines, renal pharmaceuticals, and systems for water treatment; and non-dialysis products, such as acute cardiopulmonary and apheresis products. In addition, it develops, acquires, and in-licenses renal pharmaceuticals; offers renal medications and supplies to patients at homes or to dialysis clinics; and provides vascular, cardiovascular, endovascular specialty, vascular care ambulatory surgery center, and physician nephrology and cardiology services. The company sells its products to dialysis clinics, hospitals, and specialized treatment clinics directly, as well as through local sales forces, independent distributors, dealers, and sales agents. As of December 31, 2020, it operated 4,092 outpatient dialysis clinics in approximately 150 countries. Fresenius Medical Care AG & Co. KGaA was incorporated in 1996 and is headquartered in Bad Homburg, Germany.",
        "currency": "MXN",
        "sector": "Healthcare",
        "industry": "Hospitals",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Germany",
        "state": null,
        "city": "Bad Homburg",
        "zipcode": "61352",
        "website": "http://www.freseniusmedicalcare.com",
        "market_cap": 486808518656
    },
    "IASO.AT": {
        "short_name": "IASO S.A. (CR)",
        "long_name": "IASO S.A.",
        "summary": "IASO S.A. operates hospitals, and a recovery and rehabilitation center in Europe. The company offers obstetrics and gynecology services, including gynecological oncology, endoscopic surgery, and pediatric and juvenile gynecology services, as well as delivery and operating rooms. It also provides diagnostics and therapeutics services comprising neonatal audiology; endocrinology, diabetes, and osteoporosis; and medical imaging, fetal medicine-gynecological ultrasounds, recurrent spontaneous abortions, neonatal cardiology, central laboratories, radiation oncology, breast center, cytology, urodynamics, medical oncology, surgical pathology, neonatal pediatrics, thyroid surgery department, and nuclear medicines, as well as plastic, reconstructive, and cosmetic surgery/laser services. In addition, the company offers outpatient department services, such as angiology, autoimmune rheumatic diseases and pregnancy, cardiology, check-up, colposcopy unit, dermatology, E.N.T, headache, hematology, nutritional support and dietetics, pediatric and adolescent gynecology, and male genito-urethral plastic surgery unit services, as well as endocrinology, diabetes, and osteoporosis services. Further, it operates intensive care, neonatal intensive care, and assisted reproduction units. IASO S.A. was founded in 1996 and is based in Athens, Greece. IASO S.A. is a subsidiary of Ocm Luxembourg Healthcare Greece S.Ã\u0080 R.L.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Hospitals",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "151 23",
        "website": "http://www.iaso.gr",
        "market_cap": 183235504
    }
}