{
    "0QNO.L": {
        "short_name": "LONZA GROUP AG LONZA GROUP ORD ",
        "long_name": "Lonza Group Ltd",
        "summary": "Lonza Group Ltd supplies products and services to the pharmaceutical, biotech, and specialty ingredients markets worldwide. The company operates through two segments, Pharma Biotech & Nutrition, and Specialty Ingredients. The Pharma Biotech & Nutrition segment provides technology platforms, including drug substance and drug product; and develops and manufactures customized active pharmaceutical ingredients and biopharmaceuticals, as well as formulation services and delivery systems for pharmaceutical and nutritional applications. It serves pharmaceutical companies, biotechnology firms, and medical research and testing organizations, as well as consumer health and nutrition companies. The Specialty Ingredients segment engages in the microbial control solutions and specialty chemical services businesses. Its Microbial control solutions business has offerings in professional hygiene, and home and personal care markets; and offerings in paints and coating, wood protection, material protection, and crop protection. This segments also offers specialty chemicals in electronics, aerospace, food and feed ingredients, agro chemicals, and diversified specialty chemicals markets. The company has collaboration with Moderna, Inc. to manufacture a potential COVID-19 vaccine, mRNA-1273. Lonza Group Ltd was founded in 1897 and is headquartered in Basel, Switzerland.",
        "currency": "CHF",
        "sector": "Healthcare",
        "industry": "Medical Laboratories & Research",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Switzerland",
        "state": null,
        "city": "Basel",
        "zipcode": "4002",
        "website": "http://www.lonza.com",
        "market_cap": 48202760192
    },
    "A.MX": {
        "short_name": "AGILENT TECHNOLOGIES INC",
        "long_name": "Agilent Technologies, Inc.",
        "summary": "Agilent Technologies, Inc. provides application focused solutions to the life sciences, diagnostics, and applied chemical markets worldwide. The Life Sciences and Applied Markets segment offers liquid and gas chromatography systems and components; liquid and gas chromatography mass spectrometry systems; inductively coupled plasma mass and optical emission spectrometry instruments; atomic absorption instruments; microwave plasma-atomic emission spectrometry instruments; raman spectroscopy; cell analysis plate based assays; flow cytometer; real-time cell analyzer; cell imaging systems; microplate readers; laboratory software, information management, and analytics; laboratory automation and robotic systems; dissolution testing; vacuum pumps; and measurement technologies. The Diagnostics and Genomics segment provides arrays for DNA mutation detection, genotyping, gene copy number determination, identification of gene rearrangements, DNA methylation profiling, and gene expression profiling, as well as sequencing target enrichment, genetic data management, and interpretation support software; and equipment to produce synthesized oligonucleotide. It also offers immunohistochemistry, in situ hybridization, and hematoxylin and eosin staining and special staining; instruments, consumables, and software for quality control analysis of nucleic acid samples; and reagents for use in turbidimetry and flow cytometry, as well as develops pharmacodiagnostics. The Agilent CrossLab segment provides GC and LC columns, sample preparation products, custom chemistries, and laboratory instrument supplies; and startup, operational, training, compliance support, software as a service, asset management, and consultation services. The company markets its products through direct sales, distributors, resellers, manufacturer's representatives, and electronic commerce. It has collaboration agreement with SGS AXYS. The company was incorporated in 1999 and is headquartered in Santa Clara, California.",
        "currency": "MXN",
        "sector": "Healthcare",
        "industry": "Medical Laboratories & Research",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Clara",
        "zipcode": "95051",
        "website": "http://www.agilent.com",
        "market_cap": 1000631828480
    },
    "ERFNV.PA": {
        "short_name": "EUROFINS SCIE NV21",
        "long_name": "Eurofins Scientific SE",
        "summary": "Eurofins Scientific SE, together with its subsidiaries, provides various analytical testing and laboratory services worldwide. The company offers a portfolio of approximately 200,000 analytical methods for evaluating the safety, identity, composition, authenticity, origin, traceability, and purity of biological substances and products, as well as for clinical diagnostic. It provides agroscience, agro testing, assurance, biopharma, clinical diagnostics, consumer product testing, cosmetics and personal care, environment testing, food and feed testing, forensic, genomic, maritime, materials and engineering, technologies, and REACH services. The company serves clients from a range of industries, including the pharmaceutical, food, environmental, and clinical diagnostics sectors. It operates approximately 800 laboratories in 50 countries. The company was founded in 1987 and is headquartered in Luxembourg City, Luxembourg.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Laboratories & Research",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "Luxembourg",
        "state": null,
        "city": "Luxembourg City",
        "zipcode": "1526",
        "website": "http://www.eurofins.com",
        "market_cap": null
    },
    "PHIAN.MX": {
        "short_name": "KONINKLIJKE PHILIPS NV",
        "long_name": "Koninklijke Philips N.V.",
        "summary": "Koninklijke Philips N.V. operates as a health technology company in North America, Greater China, and internationally. It operates through Diagnosis & Treatment, Connected Care, and Personal Health segments. It provides magnetic resonance imaging, computed tomography, advanced molecular imaging, diagnostic X-ray, and imaging components as well as integrated clinical solutions; integrated interventional systems, including interventional diagnostic and therapeutic devices; imaging products focused on diagnosis, treatment planning and guidance for cardiology, general imaging, obstetrics/gynecology, and point-of-care applications; proprietary software to enable diagnostics and intervention; and enterprise diagnostic informatics products and services. The company also offers monitoring and analytics solutions; sleep and respiratory care solutions; emergency care and resuscitation, and patient management solutions; data, analytics, and actionable workflow solutions; and connected care informatics solutions. In addition, it provides power toothbrushes, brush heads, and interdental cleaning and teeth whitening products; infant feeding and digital parental solutions; male grooming and beauty products and solutions; and kitchen appliances, home care, and garment care products, as well as coffee machines. Koninklijke Philips N.V. has a partnership with openDoctor to deliver an integrated radiology patient engagement platform that leverages openDoctor's real-time online appointment scheduling services as part of its patient management solution; and a strategic collaboration with Ibex Medical Analytics Ltd. to jointly promote the digital pathology and AI solutions to hospitals, health networks, and pathology laboratories worldwide. The company was formerly known as Koninklijke Philips Electronics N.V. and changed its name to Koninklijke Philips N.V. in May 2013. Koninklijke Philips N.V. was founded in 1891 and is headquartered in Amsterdam, the Netherlands.",
        "currency": "MXN",
        "sector": "Healthcare",
        "industry": "Medical Laboratories & Research",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Netherlands",
        "state": null,
        "city": "Amsterdam",
        "zipcode": "1096 BC",
        "website": "http://www.philips.com",
        "market_cap": 1074481135616
    }
}