{
    "0QNO.L": {
        "short_name": "LONZA GROUP AG LONZA GROUP ORD ",
        "long_name": "Lonza Group Ltd",
        "summary": "Lonza Group Ltd supplies products and services to the pharmaceutical, biotech, and specialty ingredients markets worldwide. The company operates through two segments, Pharma Biotech & Nutrition, and Specialty Ingredients. The Pharma Biotech & Nutrition segment provides technology platforms, including drug substance and drug product; and develops and manufactures customized active pharmaceutical ingredients and biopharmaceuticals, as well as formulation services and delivery systems for pharmaceutical and nutritional applications. It serves pharmaceutical companies, biotechnology firms, and medical research and testing organizations, as well as consumer health and nutrition companies. The Specialty Ingredients segment operates microbial control solutions and specialty chemical services businesses. Its Microbial control solutions business has offerings in professional hygiene, and home and personal care markets; and offerings in paints and coating, wood protection, material protection, and crop protection. This segments also offers specialty chemicals in electronics, aerospace, food and feed ingredients, agro chemicals, and diversified specialty chemicals markets. The company has collaboration with Moderna, Inc. to manufacture a potential COVID-19 vaccine, mRNA-1273; and an agreement with Capricor Therapeutics, Inc. for the development of CAP-1002, a clinical asset for the treatment of Duchenne Muscular Dystrophy and complications arising from COVID-19. Lonza Group Ltd was founded in 1897 and is headquartered in Basel, Switzerland.",
        "currency": "CHF",
        "sector": "Healthcare",
        "industry": "Medical Laboratories & Research",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Switzerland",
        "city": "Basel"
    },
    "DGX.MX": {
        "short_name": "QUEST DIAGNOSTICS INC",
        "long_name": "Quest Diagnostics Incorporated",
        "summary": "Quest Diagnostics Incorporated provides diagnostic testing, information, and services in the United States and internationally. The company develops and delivers diagnostic information services, such as routine testing, non-routine and advanced clinical testing, anatomic pathology testing, and other diagnostic information services. It offers diagnostic information services primarily under the Quest Diagnostics brand, as well as under the AmeriPath, Dermpath Diagnostics, Athena Diagnostics, ExamOne, and Quanum brands to patients, clinicians, hospitals, integrated delivery networks, health plans, employers, and accountable care organizations through a network of laboratories, patient service centers, phlebotomists in physician offices, call centers and mobile paramedics, nurses, and other health and wellness professionals. The company also offers risk assessment services for the life insurance industry; and healthcare organizations and clinicians robust information technology solutions. Quest Diagnostics Incorporated has a strategic collaboration with hc1; and strategic relationships with Clinical Genomics Pty Ltd and Anthem Inc. The company was founded in 1967 and is headquartered in Secaucus, New Jersey.",
        "currency": "MXN",
        "sector": "Healthcare",
        "industry": "Medical Laboratories & Research",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Secaucus"
    },
    "ERFNV.PA": {
        "short_name": "EUROFINS SCIE NV21",
        "long_name": "Eurofins Scientific SE",
        "summary": "Eurofins Scientific SE, through its subsidiaries, provides various analytical testing and laboratory services worldwide. The company offers a portfolio of approximately 200,000 analytical methods for evaluating the safety, identity, composition, authenticity, origin, traceability, and purity of biological substances and products, as well as for clinical diagnostic. It provides agro science, agro testing, biopharma, contract development and manufacturing organization, clinical diagnostics, consumer product testing, digital testing, electrical and electronics, environment testing, food and feed testing, forensic, genomic, industrial, materials and engineering, medical device, and REACH services. The company serves clients from a range of industries, including the pharmaceutical, food, environmental, and clinical diagnostics sectors. It operates approximately 800 laboratories in 50 countries. The company was founded in 1987 and is headquartered in Luxembourg City, Luxembourg.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Laboratories & Research",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "Luxembourg",
        "city": "Luxembourg City"
    },
    "PHIAN.MX": {
        "short_name": "KONINKLIJKE PHILIPS NV",
        "long_name": "Koninklijke Philips N.V.",
        "summary": "Koninklijke Philips N.V. operates as a health technology company worldwide. It operates through Diagnosis & Treatment, Connected Care, and Personal Health segments. It provides magnetic resonance imaging, computed tomography, advanced molecular imaging, and diagnostic X-ray, as well as integrated clinical solutions; interventional X-ray systems, including cardiovascular, radiology and surgery, and interventional imaging and therapy devices; imaging products focused on diagnosis, treatment planning and guidance for cardiology, general imaging, obstetrics/gynecology, and point-of-care applications; proprietary software to enable diagnostics and intervention; and enterprise diagnostic informatics products and services. The company also offers monitoring and analytics solutions; sleep and respiratory care solutions; emergency care and resuscitation solutions; data, analytics, and actionable workflow products; and connected care informatics solutions. In addition, it provides power toothbrushes; infant feeding and digital parental solutions; male grooming and beauty products; and kitchen appliances, home care, garment care, and coffee products. Further, the company offers digital frameworks that connect consumers, patients, healthcare providers, payers, and partners in a cloud-based connected health ecosystem of solutions, products, systems, services, and devices. It has a strategic collaboration with BioIntelliSense to integrate BioSticker medical device into the company's remote patient monitoring offering to help monitor at-risk patients from the hospital into the home; a collaboration with Singapore General Hospital to establish the digital and computational pathology center of excellence; and partnership with InSightec. The company was formerly known as Koninklijke Philips Electronics N.V. and changed its name to Koninklijke Philips N.V. in May 2013. Koninklijke Philips N.V. was founded in 1891 and is headquartered in Amsterdam, the Netherlands.",
        "currency": "MXN",
        "sector": "Healthcare",
        "industry": "Medical Laboratories & Research",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Netherlands",
        "city": "Amsterdam"
    }
}