{
  "9SF.F": {
    "city": "Kety",
    "country": "Poland",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Aluminum",
    "long_name": "Alumetal S.A.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "ALUMETAL SA A,B,C ZY -,10",
    "state": null,
    "summary": "Alumetal S.A., together with its subsidiaries, manufactures and sells secondary aluminum casting alloys for the automotive market sector in Poland, Germany, and other European countries. It offers aluminum casting alloys in the form of one-notch ingots, two-notch ingots, and waffle plates, as well as liquid metal; fluxes and salts; and by-products, including metal wastes. The company was founded in 1953 and is headquartered in Kety, Poland.",
    "website": "http://www.alumetal.pl",
    "zipcode": "32-650"
  },
  "GQ2.F": {
    "city": "Kety",
    "country": "Poland",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Aluminum",
    "long_name": "Grupa Kety S.A.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "GRUPA KETY  A  ZY 2,50",
    "state": null,
    "summary": "Grupa Kety S.A., through its subsidiaries, manufactures and sells aluminum products in Poland and internationally. It operates through three segments: Extruded Products, Aluminum Systems, and Flexible Packaging. The company produces aluminum profiles and components. It also designs and produces architectural systems and external aluminum roller shutters; engages in the production, trade, and servicing of window and door systems, façade systems, roller shutter profiles and boxes, roller-shutters, and gates and accessories for PVC, wood, and aluminum joinery. In addition, the company provides construction and assembly services, as well as flexible packaging solutions. Grupa Kety S.A. sells its products under the Grupa Kety, Aluprof, and Alupol Packaging brands. The company was formerly known as Zaklady Metali Lekkich KETY and changed its name to Grupa Kety S.A. in 2000. Grupa Kety S.A. was founded in 1953 and is headquartered in Kety, Poland.",
    "website": "http://www.grupakety.com",
    "zipcode": "32-650"
  }
}
