{
  "1NL.F": {
    "city": "Kraków",
    "country": "Poland",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Apparel Manufacturing",
    "long_name": "VRG S.A.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "VRG S.A.  ZY -,2",
    "state": null,
    "summary": "VRG S.A. designs, manufactures, and distributes jewelry and fashion collections for women and men in Poland and internationally. The company offers various men's fashion collections, such as classical and avant-garde jackets, well-cut trousers, suits, modern knitwear, coats and jackets, and other accessories under the Vistula, Vistula RED, Lantier, Vesari, Wólczanka, Intermoda, and BYTOM brands; gold and silver jewelry, diamonds, natural stones, gift items, and watches under the W.KRUK brand name; men's shirts under the Wólczanka brand; and clothing for women under the Deni Cler Milano brand name. It operates 567 stores, including 145 Vistula brand stores, 140 W.KRUK brand stores, 132 Wólczanka brand stores, 120 BYTOM brand stores, and 30 Deni Cler Milano brand stores. The company was founded in 1948 and is based in Krakow, Poland.",
    "website": "http://www.vrg.pl",
    "zipcode": "31-462"
  },
  "1RY.F": {
    "city": "Gdansk",
    "country": "Poland",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Apparel Manufacturing",
    "long_name": "LPP SA",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "LPP S.A.  ZY 2",
    "state": null,
    "summary": "LPP SA designs, manufactures, distributes, and retails clothing for women, men, and children. The company also offers footwear and accessories. It offers its products under the Reserved, Cropp, House, Mohito, and Sinsay brand names. The company has operations in Poland and internationally. It sells its products through 1,746 stores, as well as through online stores. The company was founded in 1989 and is headquartered in Gdansk, Poland.",
    "website": "http://www.lppsa.com",
    "zipcode": "80-769"
  }
}
