{
    "7PZ.F": {
        "short_name": "POWSZECHNY ZAKLAD UBEZP.",
        "long_name": "Powszechny Zaklad Ubezpieczen SA",
        "summary": "Powszechny Zaklad Ubezpieczen SA provides life and non-life insurance products and services to individuals, institutional, and small and medium enterprises in Poland, the Baltic States, and Ukraine. It operates through Corporate Insurance, Mass Insurance, Group and Individually Continued Insurance, Individual Insurance, Investments, Banking Activity, Pension Insurance, Baltic States, Ukraine, Investment Contracts, and Other segments. The company offers a range of non-life insurance products, including motor insurance, property insurance, casualty insurance, agricultural insurance, fire and property, and third party liability insurance; accident, life, outpatient, hospital, medicine, and travel insurance, as well as a loyalty program; and asset management and banking products, as well as manages pension and investment funds. It also provides medical services; offers services in the areas of printing, IT, data center, contact center, auxiliary services related to insurance and pension funds, constant intermediation in conclusion of insurance agreements, financial and investment agreements, assistance agreements, and HR and payroll-related services; raises debt financing through the issue of bonds or other debt instruments; and leases office space. In addition, the company manufactures bathroom and kitchen taps, aluminum central heating radiators, valves, and sanitary ware products. It distributes its products through a network of agents, multi agencies, insurance brokers, and electronic distribution channels, as well as bancassurance and strategic partnership programs. Powszechny Zaklad Ubezpieczen SA was founded in 1803 and is based in Warsaw, Poland.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Insurance - Property & Casualty",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Poland",
        "city": "Warsaw"
    }
}