{
    "01R.F": {
        "short_name": "DATAWALK B-H  ZY -,10",
        "long_name": "DataWalk S.A.",
        "summary": "DataWalk S.A. operates as a software company in Poland. The company offers DataWalk, a software platform for data blending, analysis, and investigations. Its solutions include anti-money laundering, bank fraud, insurance fraud, intelligence analysis software, law enforcement, procurement fraud, analytics sandbox, and rapid deployment data analysis platform. The company is based in Wroclaw, Poland.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Poland",
        "state": null,
        "city": "Wroclaw",
        "zipcode": "50-130",
        "website": "http://www.datawalk.pl",
        "market_cap": 170842752
    },
    "9DE.F": {
        "short_name": "WIRTUALNA POL.B,C ZY -,05",
        "long_name": "Wirtualna Polska Holding S.A.",
        "summary": "Wirtualna Polska Holding S.A., through its subsidiaries, engages in the media, advertising, and e-commerce businesses in Poland. It operates in two segments, Online and TV. The company operates praca.money.pl that provides job offers, guides, a salary calculator, and sample documents for job candidates, as well as content marketing, and targeted video and display campaigns; Vibez, which features thematic cycles related to ecology, sex education, the fight against discrimination, and mental health, as well as a various lifestyle topics; Polygamia.pl, a gaming website; WP Poczta and o2 poczta that offers e-mail services; Telewizja WP, a TV station; WP Pilot, an online television; and OpenFM, an Internet radio. It also offers a range of advertising products, such as modern display advertising, including online video advertising, email advertising, mobile device advertising, and efficiency model based advertising; and operates tourism portals, comprising of Wakacje.pl, nocowanie.pl, Mytravel.pl, and PARKLOT.PL. In addition, the company operates fashion search engines, consisting of domodi.pl and allani.pl; Homebook.pl, a platform for interior design professionals and enthusiasts; Extradom.pl that sells house design plans online; direct.money.pl, totalmoney.pl, and Finansowy supermarket, which offer financial services; and superauto.pl for purchasing and financing of cars. Further, the company operates WP.pl, o2.pl, pudelek.pl, money.pl, abcZdrowie.pl, and eholiday.pl portals. Wirtualna Polska Holding S.A. was incorporated in 2012 and is headquartered in Warsaw, Poland.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Poland",
        "state": null,
        "city": "Warsaw",
        "zipcode": "02-092",
        "website": "http://holding.wp.pl",
        "market_cap": 678447232
    }
}