{
  "0WB.F": {
    "city": "Bochnia",
    "country": "Poland",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Steel",
    "long_name": "Stalprodukt S.A.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "STALPRODUKT ZY 2",
    "state": null,
    "summary": "Stalprodukt S.A., together with its subsidiaries, manufactures and sells processed steel products in Poland. The company operates through three segments: Electrical Steels, Formed Profiles, and Zinc. It offers cold rolled electrical steel; cold rolled sections, such as closed and open structural profiles, precision structural tubing, reinforcing sections for PVC profiles, and special purpose sections; cold and hot rolled sheets, coils, and strips; transformer cores; and steel safety barriers. The company is also involved in the wholesale trading of steel products; production of steel structures and spare parts; provision of repair services; and production of metal elements for construction carpentry. In addition, it engages in the provision of galvanizing and security services; production of galvanized strips and wires; non-ferrous metals mining; production of zinc and lead; and design of renewable energy sources. The company also exports its products. The company was formerly known as ZPH Stalprodukt S.A. and changed its name to Stalprodukt S.A. in 2005. Stalprodukt S.A. was founded in 1971 and is based in Bochnia, Poland.",
    "website": "http://www.stalprodukt.com.pl",
    "zipcode": "32-700"
  },
  "WO9.F": {
    "city": "Poraj",
    "country": "Poland",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Steel",
    "long_name": "Cognor Holding S.A.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "COGNOR HOLDING  ZY 1,5",
    "state": null,
    "summary": "Cognor Holding S.A. produces and distributes steel products. The company offers flat plates and bars, slabs, round and square bars, reinforcing bars, T-profiles, equal and unequal side angles, billets with rounded edger for forgings, metal sheets, carbon and medium-alloy steels, and high-alloy and special steels, as well as products from non-ferrous metals and non-ferrous metal scrap. It also engages in the purchasing, processing, treatment, and sale of steel scrap; and processing of steel scrap into billets, as well as billets into steel products. The company operates in Poland, Germany, Switzerland, Czech Republic, Hungary, Slovakia, Italy, the Great Britain, Austria, Lithuania, France, and internationally. It also exports its products primarily to Germany and other European countries. The company was formerly known as Cognor S A and changed its name to Cognor Holding S.A. in November 2016. Cognor Holding S.A. was founded in 1946 and is headquartered in Poraj, Poland. Cognor Holding S.A. is a subsidiary of PS HoldCo Sp. z o.o.",
    "website": "http://www.cognor.eu",
    "zipcode": "42-360"
  }
}
