{
    "1T5.F": {
        "short_name": "TAURON POLSKA ENERGIA ZY5",
        "long_name": "TAURON Polska Energia S.A.",
        "summary": "TAURON Polska Energia S.A., through its subsidiaries, engages in the generation, transmission, distribution, and sale of electricity and heat in Poland. The company operates through five segments: Mining, Generation, Renewable Energy Sources, Distribution, and Supply. The Mining segment offers hard coal mining, and cleaning and sales services. The Generation segment is involved in electricity generation through conventional sources, including co-generation, as well as through biomass burning; and the overhaul of generation equipment. The Renewable Energy Sources segment engages in the electricity generation through renewable energy sources, including hydroelectric power plants and wind farms. The Distribution segment provides electricity distribution service using the distribution grids; and technical support services related to electricity metering systems and metering data acquisition. The Supply segment engages in the wholesale trade of electricity, natural gas, and derivative products, as well as trading and management of CO2 emission allowances, property rights arising from certificates of origin that confirm electricity generation from renewable sources, and cogeneration and property rights arising from energy efficiency certificates and fuels; electricity and natural gas supply; and lighting service sales. TAURON Polska Energia S.A. is also involved in the extraction of stone, including limestone for the needs of power generation, steel making, construction, and road building industries, as well as the production of sorbents agents for wet desulphurization installations and fluidized bed boilers; and real estate administration and property security activities. The company was formerly known as Energetyka Poludnie S.A. and changed its name to TAURON Polska Energia S.A. in November 2007. TAURON Polska Energia S.A. was incorporated in 2006 and is based in Katowice, Poland.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Poland",
        "state": null,
        "city": "Katowice",
        "zipcode": "40-114",
        "website": "http://www.tauron.pl",
        "market_cap": "Small Cap"
    }
}