{
    "AX1.AX": {
        "short_name": "ACCENT GL FPO",
        "long_name": "Accent Group Limited",
        "summary": "Accent Group Limited engages in the retail, distribution, and franchise of lifestyle footwear, apparel, and accessories in Australia and New Zealand. Its brands include The Athlete's Foot, Platypus Shoes, Hype DC, Skechers, Merrell, CAT, Vans, Dr. Martens, Saucony, Timberland, Sperry, Palladium, Stance, Supra, Subtype, The Trybe, PIVOT, Stylerunner and Podium Sports. The company operates through 565 stores and online sites. The company was formerly known as RCG Corporation Limited and changed its name to Accent Group Limited in November 2017. Accent Group Limited was founded in 1981 and is based in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "CCX.AX": {
        "short_name": "CITYCHIC FPO",
        "long_name": "City Chic Collective Limited",
        "summary": "City Chic Collective Limited operates as a retailer of women's apparel, footwear, and accessories in Australia, New Zealand, the United States, the United Kingdom, and rest of Europe. It offers its products under the City Chic brand name. As of June 28, 2020, the company operated 93 retail stores. It also sells its products through online and wholesale stores. The company was formerly known as Specialty Fashion Group Limited and changed its name to City Chic Collective Limited in November 2018. City Chic Collective Limited was founded in 1993 and is headquartered in Alexandria, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Alexandria"
    },
    "MOZ.AX": {
        "short_name": "MOSAIC FPO",
        "long_name": "Mosaic Brands Limited",
        "summary": "Mosaic Brands Limited engages in the retail of women's apparel and accessories in Australia and New Zealand. It operates through Fashion Retail, and Multi-Channel Retail segments. It sells its products under the Millers, Rockmans, Noni B, Rivers, Katies, Autograph, W. Lane, Crossroads, and Beme brand names. As of June 30, 2020, the company operated 1,333 stores. The company was formerly known as Noni B Limited and changed its name to Mosaic Brands Limited in November 2019. Mosaic Brands Limited was founded in 1977 and is based in Rosebery, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Rosebery"
    },
    "PMV.AX": {
        "short_name": "PREM INV. FPO",
        "long_name": "Premier Investments Limited",
        "summary": "Premier Investments Limited operates various specialty retail fashion chains in Australia, New Zealand, Asia, and Europe. It operates through two segments, Retail and Investment. The company offers casual wear, women's wear, and non-apparel products. It has a portfolio of retail brands consisting of Just Jeans, Jay Jays, Jacqui E, Portmans, Dotti, Peter Alexander, and Smiggle. The company provides its products through retail stores, as well as through wholesale and online. In addition, it invests in securities. The company was incorporated in 1987 and is based in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "UNI.AX": {
        "short_name": "UNISTORE FPO",
        "long_name": "Universal Store Holdings Limited",
        "summary": "Universal Store Holdings Limited operates as a specialty retailer of youth casual apparel in Australia. Its products comprise third party and company owned brands of casual apparel, footwear, and accessories in various categories, including womenswear, menswear, and unisex items. The company serves 16-35 year old fashion focused customers. It offers products through its 65 physical stores and online store. The company was formerly known as US Holdings Pty Ltd. and changed its name to Universal Store Holdings Limited in October 2020. Universal Store Holdings Limited was founded in 1999 and is headquartered in Nundah, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Nundah"
    }
}