{"AHX.AX": {"short_name": "APIAM FPO", "long_name": "Apiam Animal Health Limited", "summary": "Apiam Animal Health Limited, a vertically integrated animal health company, provides veterinary products and services to production and companion animals in Australia. It operates through three segments: Dairy and Mixed, Feedlots, and Pigs. The company engages in the veterinary wholesale, warehousing, logistics, and other ancillary activities. Its products and services include systems to assist in herd health programs; production advisory services; consulting services and products to assist in the prevention of animal diseases; technologies to manage compliance with legislative requirements on pharmaceutical use; and advice and services in respect of animal welfare compliance, as well as on-farm delivery of products. The company also provides third party auditing services for industry quality assurance programs; ancillary services, such as the sale and/or delivery of genetics and associated products; on-farm and online training programs for clients; and payroll and transport services. In addition, it retails animal health products; and develops technology for animal health management. The company offers its services through production animal and mixed animal veterinary clinics. Apiam Animal Health Limited was founded in 1998 and is based in Bendigo, Australia.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Bendigo"}, "IVC.AX": {"short_name": "INVOCARE FPO", "long_name": "InvoCare Limited", "summary": "InvoCare Limited provides funeral, cemetery, crematoria, and related services in Australia, New Zealand, and Singapore. The company operates 290 funeral locations, and 16 cemeteries and crematoria under various brands. It also offers HeavenAddress, an online memorial community service; LifeArt coffins; and Guardian Plan, a prepaid funeral plan. In addition, the company operates MyGriefAssist, an online grief resource Website; and MyMemorial, a Website that provides range of cremation and burial memorial options, as well as provides digital funeral planning services under the Funeral Planner brand name. InvoCare Limited was incorporated in 2001 and is headquartered in North Sydney, Australia.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "North Sydney"}, "MFD.AX": {"short_name": "MAYFIELD FPO", "long_name": "Mayfield Childcare Limited", "summary": "Mayfield Childcare Limited owns and operates childcare centers in Victoria, Australia. The company owns 20 long day childcare centers. Mayfield Childcare Limited was incorporated in 2015 and is based in Malvern, Australia.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Malvern"}, "OQH.F": {"short_name": "SLATER AND GORDON LTD", "long_name": "Slater and Gordon Limited", "summary": "Slater and Gordon Limited, a law firm, operates legal practices in Australia. The company provides legal services in various areas, such as workers compensation, motor vehicle accidents, public liability, asbestos, silicosis, military compensation, comcare, superannuation and disability insurance, medical law, commercial litigation, will, and employment law. It also offers union services and class actions. The company was founded in 1935 and is based in Melbourne, Australia. Slater and Gordon Limited is a subsidiary of AIO V Finance (Ireland) DAC.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Melbourne"}, "PFP.AX": {"short_name": "PROPEL FP FPO", "long_name": "Propel Funeral Partners Limited", "summary": "Propel Funeral Partners Limited provides death care services in Australia and New Zealand. It is involved in the collection and transfer of the deceased; provision of mortuary services; arrangement and conducting a funeral; and cremation, burial, and memorialization activities. As of June 30, 2020, the company owned and operated 130 properties comprising 72 owned and 58 leased, which included 31 cremation facilities and 9 cemeteries. It serves individuals and families dealing with, or preparing for, death and bereavement. The company was founded in 2012 and is based in Sydney, Australia.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "SGH.AX": {"short_name": "SLATER & G FPO", "long_name": "Slater and Gordon Limited", "summary": "Slater and Gordon Limited, a law firm, operates legal practices in Australia. The company provides legal services in various areas, such as workers compensation, motor vehicle accidents, public liability, asbestos, silicosis, military compensation, comcare, superannuation and disability insurance, medical law, commercial litigation, will, and employment law. It also offers union services and class actions. The company was founded in 1935 and is based in Melbourne, Australia. Slater and Gordon Limited is a subsidiary of AIO V Finance (Ireland) DAC.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "SHJ.AX": {"short_name": "SHINE CORP FPO", "long_name": "Shine Justice Ltd", "summary": "Shine Justice Ltd, through its subsidiaries, provides damages based plaintiff litigation legal services in Australia; and insurance recovery consulting services in New Zealand. It operates through two segments, Personal Injury and New Practice Areas. The Personal Injury segment provides services related to public liability, catastrophic injuries, workers' compensation, and motor vehicle accidents. The New Practice Areas segment offers abuse law, disability insurance and superannuation claims, asbestos and dust disease, federal compensation law, medical law, class actions, commercial disputes, employment, and private client services. It operates 54 branches. The company was formerly known as Shine Corporate Ltd and changed its name to Shine Justice Ltd in April 2020. The company was founded in 1976 and is based in Brisbane, Australia.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Brisbane"}, "TNK.AX": {"short_name": "THINK CHIL STAPLED", "long_name": "Think Childcare Group", "summary": "Think Childcare Group engages in the provision of child care services in Australia. The company operates through Child Care Operations and Child Care Development segments. It offers full or part-time care services for babies, toddlers, and young children. The company also offers management and consultancy services to third parties and incubator partners. It owns and manages approximately 78 centers. Think Childcare Group was incorporated in 2019 and is based in Drummoyne, Australia.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Drummoyne"}}