{
    "SIO.AX": {
        "short_name": "SIMONDS FPO",
        "long_name": "Simonds Group Limited",
        "summary": "Simonds Group Limited, together with its subsidiaries, provides homebuilder and registered training services in Australia. It operates through Residential Construction, Registered Training, and Development segments. The company designs and constructs residential dwellings; develops and sells residential land; contracts for residential home construction, speculative home building, and the building of display home inventory; and provides registered training courses, payroll and asset services, and intellectual property services. It operates display homes across the Australian eastern seaboard and South Australia. The company was formerly known as Simonds Homes Holdings Pty Ltd and changed its name to Simonds Group Limited in September 2014. Simonds Group Limited was founded in 1949 and is based in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3004",
        "website": "http://www.simondsgroup.com.au",
        "market_cap": "Small Cap"
    },
    "TWD.AX": {
        "short_name": "TAMAWOOD FPO",
        "long_name": "Tamawood Limited",
        "summary": "Tamawood Limited, together with its subsidiaries, provides contract home construction, home design, project management, and other associated services in Australia. It is also involved in franchising and licensing operations, as well as generates and trades in renewable energy certificates associated with solar products. Tamawood Limited was founded in 1989 and is based in Rocklea, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Rocklea",
        "zipcode": "4106",
        "website": "http://www.tamawood.com.au",
        "market_cap": "Small Cap"
    }
}