{"0BS.F": {"short_name": "BAPCOR LTD.", "long_name": "Bapcor Limited", "summary": "Bapcor Limited sells and distributes automotive aftermarket parts, accessories, equipment, and services in Australia, New Zealand, and Thailand. The company operates in four segments: Trade, Bapcor NZ, Specialist Wholesale, and Retail. The Trade segment offers automotive aftermarket parts and consumables to trade workshops; automotive workshop equipment, such as vehicle hoists and scanning equipment; and automotive accessories and maintenance products to do-it-yourself vehicle owners. As of June 30, 2020, it operated 186 stores. The Bapcor NZ segment is involved in the wholesale of batteries, steering and suspension, auto electrical and precision equipment, and vehicle workshop equipment; and diesel distribution activities. This segment also supplies automotive parts and accessories to workshops, trucks, and trailer parts through the Truck and Trailer Parts brand. It operates through a network of 73 stores across 81 locations. The Specialist Wholesale segment engages in the automotive aftermarket wholesale of brake, bearing, electrical, suspension, 4WD, cooling, diesel, and engine control systems and parts for light and heavy commercial vehicles. The Retail segment operates 350 company owned and franchise stores under the Autobarn, Autopro, Sprint Auto Parts, Midas, and ABS workshop service brands. The company was formerly known as Burson Group Limited and changed its name to Bapcor Limited in July 2016. Bapcor Limited was founded in 1971 and is based in Preston, Australia.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Preston"}, "1FQ.F": {"short_name": "ADAIRS LTD", "long_name": "Adairs Limited", "summary": "Adairs Limited operates as a specialty retailer of home decoration and home furnishings in Australia and New Zealand. Its stores offer towels, bath mats, bathroom accessories, bathrobes and slippers, laundry, and home care products; beds and bedheads, bedside and coffee tables, dining chairs, counter stools, sofas and armchairs, console and desks, ottomans and bench seats, storage and shelves, floor rugs, and mats; and covers and coverlets, sheets, pillows, mattress and pillow protectors, mattress toppers, flannelette, and electric blankets. The company also provides cushions, throws and blankets, plants, pots, vases, wall art and mirrors, floor rugs and mats, baskets, lighting, and home decor products; home fragrance, candles, diffusers, soaps, laundry, home care, and gifting products; kitchen tableware and tea towels; and wooden and plush toys for kids. It sells products under the Home Public, Metro, Adairs, Fresh, Downtime, MiniJumbuk, Mark Tuckey, Mercer + Reid, Clear Sleep, Aroma Wash, Fetch, and Adairs Kids brand names, as well as through online stores. The company was formerly known as Home & Decor Holdings Pty Ltd and changed its name to Adairs Limited in May 2015. Adairs Limited was incorporated in 2010 and is based in Scoresby, Australia.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Scoresby"}, "ADH.AX": {"short_name": "ADAIRS FPO", "long_name": "Adairs Limited", "summary": "Adairs Limited operates as a specialty retailer of home decoration and home furnishings in Australia and New Zealand. Its stores offer towels, bath mats, bathroom accessories, bathrobes and slippers, laundry, and home care products; beds and bedheads, bedside and coffee tables, dining chairs, counter stools, sofas and armchairs, console and desks, ottomans and bench seats, storage and shelves, floor rugs, and mats; and covers and coverlets, sheets, pillows, mattress and pillow protectors, mattress toppers, flannelette, and electric blankets. The company also provides cushions, throws and blankets, plants, pots, vases, wall art and mirrors, floor rugs and mats, baskets, lighting, and home decor products; home fragrance, candles, diffusers, soaps, laundry, home care, and gifting products; kitchen tableware and tea towels; and wooden and plush toys for kids. It sells products under the Home Public, Metro, Adairs, Fresh, Downtime, MiniJumbuk, Mark Tuckey, Mercer + Reid, Clear Sleep, Aroma Wash, Fetch, and Adairs Kids brand names, as well as through online stores. The company was formerly known as Home & Decor Holdings Pty Ltd and changed its name to Adairs Limited in May 2015. Adairs Limited was incorporated in 2010 and is based in Scoresby, Australia.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Scoresby"}, "B14.F": {"short_name": "BABY BUNTING GROUP LTD", "long_name": "Baby Bunting Group Limited", "summary": "Baby Bunting Group Limited operates as specialty retailer of baby goods in Australia. The company's principal product categories include prams, cots and nursery furniture, car safety, toys, babywear, feeding, nappies, and Manchester and associated accessories. Its products primarily cater to parents with children from newborn to three years of age, and parents-to-be. The company operates a network of 53 stores, as well as sells products through babybunting.com.au, an online store. Baby Bunting Group Limited was founded in 1979 and is based in Dandenong South, Australia.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Dandenong South"}, "BAP.AX": {"short_name": "BAPCOR LTD FPO", "long_name": "Bapcor Limited", "summary": "Bapcor Limited sells and distributes automotive aftermarket parts, accessories, equipment, and services in Australia, New Zealand, and Thailand. The company operates in four segments: Trade, Bapcor NZ, Specialist Wholesale, and Retail. The Trade segment offers automotive aftermarket parts and consumables to trade workshops; automotive workshop equipment, such as vehicle hoists and scanning equipment; and automotive accessories and maintenance products to do-it-yourself vehicle owners. As of June 30, 2020, it operated 186 stores. The Bapcor NZ segment is involved in the wholesale of batteries, steering and suspension, auto electrical and precision equipment, and vehicle workshop equipment; and diesel distribution activities. This segment also supplies automotive parts and accessories to workshops, trucks, and trailer parts through the Truck and Trailer Parts brand. It operates through a network of 73 stores across 81 locations. The Specialist Wholesale segment engages in the automotive aftermarket wholesale of brake, bearing, electrical, suspension, 4WD, cooling, diesel, and engine control systems and parts for light and heavy commercial vehicles. The Retail segment operates 350 company owned and franchise stores under the Autobarn, Autopro, Sprint Auto Parts, Midas, and ABS workshop service brands. The company was formerly known as Burson Group Limited and changed its name to Bapcor Limited in July 2016. Bapcor Limited was founded in 1971 and is based in Preston, Australia.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Preston"}, "BBN.AX": {"short_name": "BABY B FPO", "long_name": "Baby Bunting Group Limited", "summary": "Baby Bunting Group Limited operates as specialty retailer of baby goods in Australia. The company's principal product categories include prams, cots and nursery furniture, car safety, toys, babywear, feeding, nappies, and Manchester and associated accessories. Its products primarily cater to parents with children from newborn to three years of age, and parents-to-be. The company operates a network of 53 stores, as well as sells products through babybunting.com.au, an online store. Baby Bunting Group Limited was founded in 1979 and is based in Dandenong South, Australia.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Dandenong South"}, "BLX.AX": {"short_name": "BEACON LTG FPO", "long_name": "Beacon Lighting Group Limited", "summary": "Beacon Lighting Group Limited operates as a specialist retailer of lighting products in Australia and internationally. It designs, develops, sources, imports, distributes, merchandises, promotes, and sells light fittings, ceiling fans, and light globes, as well as energy products. The company's products include pendants, table lamps, floor lamps, ceiling fans, chandeliers, exteriors, globes, down lights, wall lights, spotlights, bathroom lighting products, batten fixes, flush mounts, accessories, and solar panels. It serves middle to upper residential lighting market. The company operates through a network of 106 company stores, 4 franchised stores, and 4 commercial sales offices. It also offers its products online. Beacon Lighting Group Limited was founded in 1967 and is based in Mulgrave, Australia.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Mulgrave"}, "CCV.AX": {"short_name": "CASH CONV FPO", "long_name": "Cash Converters International Limited", "summary": "Cash Converters International Limited operates as a franchisor of second hand goods and financial services stores under the Cash Converters brand name. It operates through Franchise Operations, Store Operations, Personal Finance, and Vehicle Financing segments. The Franchise Operations segment engages in the sale of franchises for the retail sale of new and second hand goods, as well as sale of master licenses for the development of franchises worldwide. The Store Operations segment is involved in the retail sale of new and second hand goods, as well as in cash advance and pawnbroking operations through corporate owned stores in Australia. The Personal Finance segment provides personal loans; and Mon-E, which provides administration services for the Cash Converters network in Australia to offer small cash advance loans to customers. The Vehicle Financing segment provides motor vehicle financing services. As of August 28, 2020, it operated 705 stores, including 83 corporate and 622 franchise stores in 16 countries. Cash Converters International Limited was founded in 1984 and is headquartered in Perth, Australia.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Perth"}, "DLC.AX": {"short_name": "DELECTA FPO", "long_name": "Delecta Limited", "summary": "Delecta Limited, through its subsidiaries, engages in the wholesale distribution of adult products in Australia and New Zealand. It also owns interests in the Highline Cobalt / Copper Project. The company was formerly known as AdultShop.com Limited and changed its name to Delecta Limited in November 2010. Delecta Limited was incorporated in 1985 and is based in Braybrook, Australia.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Braybrook"}, "DSK.AX": {"short_name": "DUSK FPO", "long_name": "Dusk Group Limited", "summary": "Dusk Group Limited operates as an omni-channel specialty retailer that focuses on home fragrance products in Australia. It offers novelty, scented, scented pillar, unscented, taper, tealight, and votive candles; jars, containers, glassware, and wax melts; and home fragrance products, including diffusers, air purifiers, essential oils, reed diffusers, mood reed refills, incense products, fragrant oils, toppers and bottles, room sprays, and storage boxes. The company also provides plant therapy essential oils and sets; candle holders, such as tealight holders, votive holders, hurricanes, lanterns, pillar holders, taper holders, tray sets, and containers; oil burners, decorative plates and trays, LED homewares, candle care products, and related storage products; decorative sand, stones, and pebbles; and gift cards and packs. It operates a network of 115 company owned and operated stores, as well as its online store under the dusk brand. The company was incorporated in 2014 and is based in Alexandria, Australia.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Alexandria"}, "JB3.F": {"short_name": "JB HI-FI LTD", "long_name": "JB Hi-Fi Limited", "summary": "JB Hi-Fi Limited, together with its subsidiaries, retails home consumer products. It operates through three segments: JB Hi-Fi Australia, JB Hi-Fi New Zealand, and The Good Guys. The company offers consumer electronics products and services, including televisions, audio equipment, computers, and cameras; telecommunications products and services; software products, such as music, movies, and games; musical instruments; and home appliances comprising whitegoods, cooking products, heating and cooling products, small appliances, and kitchen accessories. It also provides information technology and consulting services. As of June 30, 2020, the company sold its products through branded retail store network comprising 195 JB Hi-Fi/JB Hi-Fi Home stores in Australia; 14 JB Hi-Fi stores in New Zealand; and 105 The Good Guys stores in Australia, as well as online. JB Hi-Fi Limited was founded in 1974 and is based in Southbank, Australia.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Southbank"}, "JBH.AX": {"short_name": "JB HI-FI FPO", "long_name": "JB Hi-Fi Limited", "summary": "JB Hi-Fi Limited, together with its subsidiaries, retails home consumer products. It operates through three segments: JB Hi-Fi Australia, JB Hi-Fi New Zealand, and The Good Guys. The company offers consumer electronics products and services, including televisions, audio equipment, computers, and cameras; telecommunications products and services; software products, such as music, movies, and games; musical instruments; and home appliances comprising whitegoods, cooking products, heating and cooling products, small appliances, and kitchen accessories. It also provides information technology and consulting services. As of June 30, 2020, the company sold its products through branded retail store network comprising 195 JB Hi-Fi/JB Hi-Fi Home stores in Australia; 14 JB Hi-Fi stores in New Zealand; and 105 The Good Guys stores in Australia, as well as online. JB Hi-Fi Limited was founded in 1974 and is based in Southbank, Australia.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Southbank"}, "JYC.AX": {"short_name": "JOYCE FPO", "long_name": "Joyce Corporation Ltd", "summary": "Joyce Corporation Ltd retails kitchen and wardrobe products in Australia. It owns five Bedshed retail stores, as well as franchise Bedshed retail bedding stores. The company also operates kitchen and wardrobe stores under the Kitchen Connection and Wallspan brand names. Joyce Corporation Ltd was founded in 1886 and is headquartered in Perth, Australia.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Perth"}, "NCK.AX": {"short_name": "NICK SCALI FPO", "long_name": "Nick Scali Limited", "summary": "Nick Scali Limited, together with its subsidiaries, engages in sourcing and retailing of household furniture and related accessories in Australia and New Zealand. The company offers lounges, dining tables and chairs, armchairs, buffets/cabinets, TV units, coffee tables, consoles, bedroom furniture, mattresses and bases, rugs, mirrors, and pendants and lamps. It provides its products through a network of 58 stores, as well as online. Nick Scali Limited was incorporated in 1962 and is based in North Ryde, Australia.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "North Ryde"}, "RSU.F": {"short_name": "SUPER RETAIL GROUP LTD.", "long_name": "Super Retail Group Limited", "summary": "Super Retail Group Limited operates as a retailer of auto, sports, and outdoor leisure in Australia and New Zealand. The company offers automotive parts and accessories, handyman items, and tools and equipment to marine and motorbike products, including batteries, car care products, exterior accessories, hand and power tools, in-car navigation systems, in-car stereo equipment, lighting and electrical products, oils, filters and additives, outdoor equipment and accessories, seat covers and interior accessories, spare parts, paints and panels, and performance products. It also provides footwear, fitness and sports equipment, apparel, and related accessories for casual enthusiast and serious competitors; and boating, camping, and fishing products, such as lures, rods and reels, tackle boxes, fishing nets, tents, ropes, pegs, cooking equipment, and clothing and hiking gears, as well as boating accessories comprising fishing rod holders, bilge pumps, fishfinders, and others. In addition, the company offers apparel and equipment for mountain climbers, campers, hikers, and others; and products for travel, touring, outdoors, garages, and sheds. It sells its products under the BCF, Macpac, Rebel, and Supercheap Auto brands. The company also offers its products online. As of June 27, 2020, it operated 281 Supercheap Auto stores in Australia and 45 Supercheap Auto stores in New Zealand; 160 rebel stores; 139 BCF stores; and 72 Macpac stores. The company was formerly known as Super Cheap Auto Group Limited and changed its name to Super Retail Group Limited in 2010. Super Retail Group Limited was founded in 1972 and is based in Strathpine, Australia.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Strathpine"}, "SHM.AX": {"short_name": "SHRIRO FPO", "long_name": "Shriro Holdings Limited", "summary": "Shriro Holdings Limited, together with its subsidiaries, manufactures and distributes kitchen appliances and consumer products in Australia and New Zealand. It operates through Kitchen Appliances and Consumer Products segments. The Kitchen Appliances segment offers ovens, cooktops, rangehoods, dishwashers, sinks, taps, ironing systems, and laundry tubs, as well as waste disposal and ducting solutions. The Consumer Products segment provides watches, calculators, electronic musical instruments, projectors, point of sale terminals, cameras, gas and charcoal barbeques, heaters, fans, air purifiers/dehumidifiers, and speakers, as well as fashion, car audio, professional DJ, amplifier, and Hi Fi products. The company also offers cash registers, and lighting and cooling products. In addition, it exports barbeques and accessories. The company markets and distributes its products under its own brands, including Omega, Robinhood, Everdure, and Omega Altise; and third party owned brands, such as Casio, Blanco, and Pioneer. Shriro Holdings Limited was incorporated in 2015 and is headquartered in Kingsgrove, Australia.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Kingsgrove"}, "SRY.AX": {"short_name": "STORYILTD FPO", "long_name": "Story-I Limited", "summary": "Story-I Limited, through its subsidiary, PT Inetindo Infocom, operates as a reseller and retailer of Apple and IT lifestyle products and services. It operates through 25 stores in 10 cities of Indonesia. The company was incorporated in 2013 and is based in West Leederville, Australia.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "West Leederville"}, "SSG.AX": {"short_name": "SHAVERSHOP FPO", "long_name": "Shaver Shop Group Limited", "summary": "Shaver Shop Group Limited engages in the retail of specialist personal grooming products in Australia and New Zealand. The company offers electric shavers, beard trimmers, hair clippers, body groomers, manual shavers, oral care, massage, and fragrance products for men; and hair removal, hair styling, beauty, oral care, massage, and fragrance products for women. As of June 30, 2020, it operated 117 corporate stores and 6 franchised stores. It also offers its products online through its Websites. The company was formerly known as Lavomer Riah Holdings Pty Ltd and changed its name to Shaver Shop Group Limited in May 2016. Shaver Shop Group Limited was founded in 1986 and is based in Chadstone, Australia.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Chadstone"}, "SUL.AX": {"short_name": "SUPARETAIL FPO", "long_name": "Super Retail Group Limited", "summary": "Super Retail Group Limited operates as a retailer of auto, sports, and outdoor leisure in Australia and New Zealand. The company offers automotive parts and accessories, handyman items, and tools and equipment to marine and motorbike products, including batteries, car care products, exterior accessories, hand and power tools, in-car navigation systems, in-car stereo equipment, lighting and electrical products, oils, filters and additives, outdoor equipment and accessories, seat covers and interior accessories, spare parts, paints and panels, and performance products. It also provides footwear, fitness and sports equipment, apparel, and related accessories for casual enthusiast and serious competitors; and boating, camping, and fishing products, such as lures, rods and reels, tackle boxes, fishing nets, tents, ropes, pegs, cooking equipment, and clothing and hiking gears, as well as boating accessories comprising fishing rod holders, bilge pumps, fishfinders, and others. In addition, the company offers apparel and equipment for mountain climbers, campers, hikers, and others; and products for travel, touring, outdoors, garages, and sheds. It sells its products under the BCF, Macpac, Rebel, and Supercheap Auto brands. The company also offers its products online. As of June 27, 2020, it operated 281 Supercheap Auto stores in Australia and 45 Supercheap Auto stores in New Zealand; 160 rebel stores; 139 BCF stores; and 72 Macpac stores. The company was formerly known as Super Cheap Auto Group Limited and changed its name to Super Retail Group Limited in 2010. Super Retail Group Limited was founded in 1972 and is based in Strathpine, Australia.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Strathpine"}, "UKC.F": {"short_name": "CASH CONVERTERS INTL", "long_name": "Cash Converters International Limited", "summary": "Cash Converters International Limited operates as a franchisor of second hand goods and financial services stores under the Cash Converters brand name. It operates through Franchise Operations, Store Operations, Personal Finance, and Vehicle Financing segments. The Franchise Operations segment engages in the sale of franchises for the retail sale of new and second hand goods, as well as sale of master licenses for the development of franchises worldwide. The Store Operations segment is involved in the retail sale of new and second hand goods, as well as in cash advance and pawnbroking operations through corporate owned stores in Australia. The Personal Finance segment provides personal loans; and Mon-E, which provides administration services for the Cash Converters network in Australia to offer small cash advance loans to customers. The Vehicle Financing segment provides motor vehicle financing services. As of August 28, 2020, it operated 705 stores, including 83 corporate and 622 franchise stores in 16 countries. Cash Converters International Limited was founded in 1984 and is headquartered in Perth, Australia.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Perth"}, "VTG.AX": {"short_name": "VITA GROUP FPO", "long_name": "Vita Group Limited", "summary": "Vita Group Limited markets and sells information and communications technology (ICT) products in Australia. The company operates in two segments, ICT, and Skin-Health and Wellness. It sells mobile phones and connections, accessories, and other technology products; and medical grade skincare treatments and products. The company provides its products and services under the Telstra ICT retail store network, Telstra Business ICT channel, Artisan Aesthetics Clinics, and Sprout accessories brands. Vita Group Limited was founded in 1995 and is based in Albion, Australia.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Albion"}}