{
    "256.F": {
        "short_name": "AZURE POWER GLOBAL DL-,01",
        "long_name": "Azure Power Global Limited",
        "summary": "Azure Power Global Limited, together with its subsidiaries, engages in the development, construction, ownership, operation, maintenance, and management of solar power plants in India. It generates solar energy based on long-term contracts with Indian government energy distribution companies, as well as other non-governmental energy distribution companies and commercial customers. As of March 31, 2020, the company operated 43 utility scale projects and various commercial rooftop projects with a combined rated capacity of 1,808 MW. Azure Power Global Limited was founded in 2008 and is based in New Delhi, India.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110017",
        "website": "http://www.azurepower.com",
        "full_time_employees": 605
    },
    "ADANIGREEN.NS": {
        "short_name": "ADANI GREEN ENERGY",
        "long_name": "Adani Green Energy Limited",
        "summary": "Adani Green Energy Limited generates and supplies renewable energy to central and state government entities, and government backed corporations in India. The company builds, owns, and operates power plants through renewable sources, such as solar, wind, and hybrid; and provides other ancillary services. It operates solar power plants with an operational capacity of 2,148 megawatts (MW); and wind power plants with an operational capacity of 397 MW. The company was incorporated in 2015 and is headquartered in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "382421",
        "website": "http://www.adanigreenenergy.com",
        "full_time_employees": 723
    },
    "ADANIPOWER.NS": {
        "short_name": "ADANI POWER LTD",
        "long_name": "Adani Power Limited",
        "summary": "Adani Power Limited engages in the generation and transmission of electricity under long term power purchase agreements and on merchant basis in India. It generates electricity through thermal and solar energy sources. The company has various power projects with a combined installed and commissioned capacity of 12,450 MW, including 4,620 MW at Mundra, Gujarat; 3,300 MW at Tiroda, Maharashtra; 1,320 MW at Kawai, Rajasthan; 1200 MW at Udupi, Karnataka; 40 MW at bitta, Gujarat; and 1,600 MW at Godda, Jharkhand. It also trades in coal. The company was founded in 1988 and is headquartered in Ahmedabad, India",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "382421",
        "website": "http://www.adanipower.com",
        "full_time_employees": null
    },
    "ADANITRANS.NS": {
        "short_name": "ADANI TRANSMISS.IN",
        "long_name": "Adani Transmission Limited",
        "summary": "Adani Transmission Limited, together with its subsidiaries, engages in the generation, transmission, and distribution of power in India. The company operates through Transmission, Trading, and Mumbai GTD Business segments. It builds, commissions, operates, and maintains electric power transmission systems; and distributes electricity in the suburbs of Mumbai. The company operates and maintains approximately 11,576 circuit kilometers of transmission lines with a total transformation capacity of 18,330 mega volt ampere in the states of Gujarat, Maharashtra, Rajasthan, Madhya Pradesh, Uttar Pradesh, Bihar, Jharkhand, Haryana, and Chhattisgarh. In addition, it engages in the trading of agri commodities. The company was incorporated in 2013 and is headquartered in Ahmedabad, India. Adani Transmission Limited is a subsidiary of S.B. Adani Family Trust.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "382421",
        "website": "http://www.adanitransmission.com",
        "full_time_employees": null
    },
    "ATGL.NS": {
        "short_name": "ADANI TOTAL GAS LIMITED",
        "long_name": "Adani Total Gas Limited",
        "summary": "Adani Total Gas Limited distributes piped natural gas to industrial, commercial, and residential customers. The company also distributes compressed natural gas to the transportation sector; and supplies PNG to approximately 0.44 million customers through a connected pipeline network of approximately 7,600 km, including 470 km of steel and 7,130 km of polyethylene pipeline. It has gas distribution networks in Ahmedabad, Vadodara, Navsari, Porbandar, Barwala, Kheda, and Surendranagar in Gujarat; Udaipur in Rajasthan; Palwal, Mahendragarh, and Faridabad in Haryana; Khurja in Uttar Pradesh; and Bhind in Madhya Pradesh, India. As of March 31, 2020, the company had 115 CNG filling stations. The company was formerly known as Adani Gas Limited and changed its name to Adani Total Gas Limited in January 2021. Adani Total Gas Limited was founded in 2004 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "382421",
        "website": "http://www.adanigas.com",
        "full_time_employees": 425
    },
    "AZRE": {
        "short_name": "Azure Power Global Limited",
        "long_name": "Azure Power Global Limited",
        "summary": "Azure Power Global Limited, together with its subsidiaries, engages in the development, construction, ownership, operation, maintenance, and management of solar power plants in India. It generates solar energy based on long-term contracts with Indian government energy distribution companies, as well as other non-governmental energy distribution companies and commercial customers. As of March 31, 2020, the company operated 43 utility scale projects and various commercial rooftop projects with a combined rated capacity of 1,808 MW. Azure Power Global Limited was founded in 2008 and is based in New Delhi, India.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110017",
        "website": "http://www.azurepower.com",
        "full_time_employees": 605
    },
    "BAJAJELEC.NS": {
        "short_name": "BAJAJ ELECTRICALS",
        "long_name": "Bajaj Electricals Limited",
        "summary": "Bajaj Electricals Limited engages in the consumer durables; and engineering, procurement, and construction businesses in India. It operates through Consumer Products; and Engineering & Projects and Others segments. The company offers various appliances, including toasters, mixer-grinders, food processors, juicer mixer grinders, choppers and hand blenders, wet grinders, OTGs, microwave ovens, electric kettles, induction cookers, rice cookers, pressure cookers, gas stoves, non-electric kitchen aids, irons, storage water heaters, gas water heaters, instant water heaters, room heaters, air coolers, coffee makers, sandwich/pop-up toasters, hand mixers, electric cookers, and hair dryers. It also provides various fans comprising ceiling, pedestal, table, wall, personal, domestic, and heavy duty exhaust fans, as well as air circulators. In addition, the company offers lighting products, such as lamps, fluorescent lamps, compact fluorescent lamps, LED torches, LED lanterns, LED table lamps, consumer luminaires, and electrical accessories; and integrated building management systems. Further, it is involved in the design, engineering, supply, execution, and commissioning of power distribution and transmission projects. Additionally, the company generates wind energy. It also exports its products. The company was formerly known as Radio Lamp Works Limited and changed its name to Bajaj Electricals Limited in October 1960. The company was founded in 1938 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400022",
        "website": "http://www.bajajelectricals.com",
        "full_time_employees": 3164
    },
    "BVT.F": {
        "short_name": "RELIA.INF.GDR REGS/3 IR10",
        "long_name": "Reliance Infrastructure Limited",
        "summary": "Reliance Infrastructure Limited, an infrastructure company, engages in the generation, transmission, and distribution of electrical power to residential, industrial, commercial, and other customers in India. It operates through three segments: Power; Engineering and Construction; and Infrastructure. The company operates a 220 MW combined cycle power plant at Samalkot, a 48 MW combined cycle power plant at Mormugao, a 9.39 MW wind-farm at Chitradurga, and a 165 MW combined cycle power station at Kochi; distributes power in Delhi; and transmits power through its transmission networks in Himachal Pradesh, as well as trades in power. The company also provides integrated design, engineering, procurement, and project management services for coal-based thermal and gas-power projects, nuclear power projects, and metro rail and road projects; and development, operation, and maintenance of toll roads, metro rail transit systems, and airports. In addition, it is involved in the exploration and production of four coal bed methane blocks covering an area of 3,266 square kilometers in Madhya Pradesh, Andhra Pradesh, and Rajasthan; and an oil and gas block covering an area of 3,619 square kilometers in Mizoram. Further, the company engages in the manufacture of cement and defense systems; construction of smart city projects; provision of value added services in construction, erection, commissioning, and contracting areas; and real estate development and urban transport systems businesses. Reliance Infrastructure Limited was incorporated in 1929 and is based in Mumbai, India.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400001",
        "website": "http://www.rinfra.com",
        "full_time_employees": 5718
    },
    "CESC.NS": {
        "short_name": "CESC",
        "long_name": "CESC Limited",
        "summary": "CESC Limited, an integrated electrical utility company, engages in the generation, transmission, and distribution of electricity to approximately 3.3 million domestic, industrial, and commercial users in the area of 567 square kilometers of Kolkata, Howrah, Hooghly, and North and South 24 Parganas in West Bengal in India. It owns and operates three thermal power plants, including Budge Budge, Southern, and Titagarh generating stations generating 1125 megawatts (MW) of power; two thermal power projects with a capacity of 640 MW in Chandrapur, Maharashtra and Haldia, West Bengal; and transmission and distribution systems that comprise 474 km circuit of transmission lines linking the company's generating and receiving stations with 105 distribution stations, as well as 8,211 km circuit of HT lines, and 12,269 km circuit of LT lines. The company also owns and operates solar plant in Gujarat's Kutch generating 9 MW of solar energy, and a 18 MW DC project in Ramnathapuram, Tamil Nadu; hydro power venture in Arunachal Pradesh generating 146 MW energy; and wind power plants, including a 24 MW project at Dangri in Rajasthan, a 26 MW project in Surendranagar in Gujarat, a 36 MW project in Nipaniya in Madhya Pradesh, and a 70 MW project in Rojmal, Gujarat. The company was formerly known as The Calcutta Electric Supply Corporation (India) Limited and changed its name to CESC Limited in January 1987. CESC Limited was founded in 1899 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://www.cesc.co.in",
        "full_time_employees": 7886
    },
    "DPSCLTD.NS": {
        "short_name": "DPSC LIMITED",
        "long_name": "India Power Corporation Limited",
        "summary": "India Power Corporation Limited, together with its subsidiaries, generates and distributes electricity in India. The company operates 35.2 MW of wind assets in Gujarat and Karnataka; 2 MW of solar asset in West Bengal; and coal fired thermal power plants of 12 MW in Asansol, West Bengal, as well as 1000 MW in Nellore, Andhra Pradesh. It also has a distribution license of approximately 618 square kilometers in AsansolÂ\u0096Raniganj area of West Bengal. In addition, the company offers consultancy, operation, and maintenance services. It serves government utilities and hospitals, as well as industrial, commercial, and residential consumers. The company was formerly known as DPSC Limited and changed its name to India Power Corporation Limited in August 2013. India Power Corporation Limited was founded in 1919 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700091",
        "website": "http://www.indiapower.com",
        "full_time_employees": 483
    },
    "ENERGYDEV.NS": {
        "short_name": "ENERGY DEV CO LTD",
        "long_name": "Energy Development Company Limited",
        "summary": "Energy Development Company Limited generates and sells electricity from water and wind in India. The company operates through three divisions: Generating, Contract, and Trading. The Generating division generates and sells bulk power to various electricity boards. It has 15 MW of renewable energy capacity and has 270 MW of hydroelectric projects at various stages of development. This division owns and operates 9 MW and 6 MW Harangi hydro-electric power plants in the district of Kodagu, as well as two wind projects of 1.5 MW each in the districts of Hassan and Chitradurga Karnataka; and a 7 MW Ullunkal hydroelectric power project and 15 MW Karikayam hydroelectric power project in the state of Kerala. This division also executes various hydroelectric projects in the state of Arunachal Pradesh. The Contract division develops energy and infrastructure projects for other developers. It offers engineering, consultancy, and project management services for hydroelectric power plants; engineering, procurement, and construction services; third party power plant operations and maintenance services; and rehabilitation, renovation, modernization, and uprating consultancy and services for ageing hydro power plants. This division is also involved in the cogeneration or the combined generation of heat and power from a single fuel source, such as bagasse. The Trading division trades in power equipment, metals, etc. Energy Development Company Limited was incorporated in 1995 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700020",
        "website": "http://www.edclgroup.com",
        "full_time_employees": 85
    },
    "GAIL.NS": {
        "short_name": "GAIL INDIA LTD",
        "long_name": "GAIL (India) Limited",
        "summary": "GAIL (India) Limited operates as a natural gas processing and distribution company in India and internationally. The company operates through Transmission Services, Natural Gas Marketing, Petrochemicals, LPG and Other Liquid Hydrocarbons, and Other segments. It is involved in the transmission, distribution, and marketing of natural gas to the power, city gas distribution, fertilizer, and other sectors. The company also sources, markets, and trades in liquefied natural gas (LNG); markets liquefied petroleum gas (LPG), propane, pentane, naphtha, mixed fuel oil, propylene, and hydrogenated C4 mix; and manufactures petrochemicals, such as high density polyethylene and linear low density polyethylene under the brand names of G-Lex and G-Lene. In addition, it operates a network of compressed natural gas stations; and provides piped natural gas to domestic, commercial, and industrial applications, as well as has interests in 11 exploration and production blocks located in Assam-Arakan, Cambay, Cauvery, Gujarat Kutch, and Myanmar basins covering an area of 2,170 square kilometers. Further, the company offers telecommunication services through GAILTEL; and generates, transmits, and distributes electric power through 118 MW wind power plant and 12.3 MW solar power plant. Additionally, it engages in the charter hiring of LNG vessels. The company owns and operates approximately 12,426 km of natural gas pipelines; 2,038 km LPG pipeline transmission network; and five gas processing plants for production of LPG, propane, pentane, naphtha, etc. GAIL (India) Limited was founded in 1984 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110066",
        "website": "http://www.gailonline.com",
        "full_time_employees": 4682
    },
    "GAILF": {
        "short_name": "GAIL (INDIA) LIMITED",
        "long_name": "GAIL (India) Limited",
        "summary": "GAIL (India) Limited operates as a natural gas processing and distribution company in India and internationally. The company operates through Transmission Services, Natural Gas Marketing, Petrochemicals, LPG and Other Liquid Hydrocarbons, and Other segments. It is involved in the transmission, distribution, and marketing of natural gas to the power, city gas distribution, fertilizer, and other sectors. The company also sources, markets, and trades in liquefied natural gas (LNG); markets liquefied petroleum gas (LPG), propane, pentane, naphtha, mixed fuel oil, propylene, and hydrogenated C4 mix; and manufactures petrochemicals, such as high density polyethylene and linear low density polyethylene under the brand names of G-Lex and G-Lene. In addition, it operates a network of compressed natural gas stations; and provides piped natural gas to domestic, commercial, and industrial applications, as well as has interests in 11 exploration and production blocks located in Assam-Arakan, Cambay, Cauvery, Gujarat Kutch, and Myanmar basins covering an area of 2,170 square kilometers. Further, the company offers telecommunication services through GAILTEL; and generates, transmits, and distributes electric power through 118 MW wind power plant and 12.3 MW solar power plant. Additionally, it engages in the charter hiring of LNG vessels. The company owns and operates approximately 12,426 km of natural gas pipelines; 2,038 km LPG pipeline transmission network; and five gas processing plants for production of LPG, propane, pentane, naphtha, etc. GAIL (India) Limited was founded in 1984 and is based in New Delhi, India.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110066",
        "website": "http://www.gailonline.com",
        "full_time_employees": 4682
    },
    "GIPCL.NS": {
        "short_name": "GUJARAT IND POWER",
        "long_name": "Gujarat Industries Power Company Limited",
        "summary": "Gujarat Industries Power Company Limited generates and sells electricity primarily to power purchasing companies in India. The company generates power through gas, lignite, wind, and solar power plants with combined installed capacity of 1084.4 MW at Vadodara plant and Surat Lignite Power Plant. Gujarat Industries Power Company Limited was founded in 1985 and is based in Vadodara, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Vadodara",
        "zipcode": "391346",
        "website": "http://www.gipcl.com",
        "full_time_employees": 517
    },
    "GQI.F": {
        "short_name": "GAIL (INDIA) GDR/6 IR 10",
        "long_name": "GAIL (India) Limited",
        "summary": "GAIL (India) Limited operates as a natural gas processing and distribution company in India and internationally. The company operates through Transmission Services, Natural Gas Marketing, Petrochemicals, LPG and Other Liquid Hydrocarbons, and Other segments. It is involved in the transmission, distribution, and marketing of natural gas to the power, city gas distribution, fertilizer, and other sectors. The company also sources, markets, and trades in liquefied natural gas (LNG); markets liquefied petroleum gas (LPG), propane, pentane, naphtha, mixed fuel oil, propylene, and hydrogenated C4 mix; and manufactures petrochemicals, such as high density polyethylene and linear low density polyethylene under the brand names of G-Lex and G-Lene. In addition, it operates a network of compressed natural gas stations; and provides piped natural gas to domestic, commercial, and industrial applications, as well as has interests in 11 exploration and production blocks located in Assam-Arakan, Cambay, Cauvery, Gujarat Kutch, and Myanmar basins covering an area of 2,170 square kilometers. Further, the company offers telecommunication services through GAILTEL; and generates, transmits, and distributes electric power through 118 MW wind power plant and 12.3 MW solar power plant. Additionally, it engages in the charter hiring of LNG vessels. The company owns and operates approximately 12,426 km of natural gas pipelines; 2,038 km LPG pipeline transmission network; and five gas processing plants for production of LPG, propane, pentane, naphtha, etc. GAIL (India) Limited was founded in 1984 and is based in New Delhi, India.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110066",
        "website": "http://www.gailonline.com",
        "full_time_employees": 4682
    },
    "GREENPOWER.NS": {
        "short_name": "ORIENT GREEN POWER",
        "long_name": "Orient Green Power Company Limited",
        "summary": "Orient Green Power Company Limited, an independent renewable energy power producing company, develops, owns, and operates a portfolio of wind energy power plants in India. It has a portfolio of 421 MW of wind energy across Tamil Nadu, Andhra Pradesh, Gujarat, and Karnataka, as well as 10.5 MW wind power plant in Croatia. The company was incorporated in 2006 and is headquartered in Chennai, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600017",
        "website": "http://www.orientgreenpower.com",
        "full_time_employees": 8
    },
    "GSPL.NS": {
        "short_name": "GUJARAT STATE PETR",
        "long_name": "Gujarat State Petronet Limited",
        "summary": "Gujarat State Petronet Limited transmits natural gas through pipeline on an open access basis from supply points to demand centers in India. The company develops energy transportation infrastructure and connects natural gas supply sources, including LNG terminals to various markets in Gujarat. As of March 31, 2019, it operated approximately 2692 kilometers of pipeline network. The company transports approximately 35 MMSCMD of natural gas to refineries, steel plants, fertilizer plants, petrochemical plants, power plants, glass industries, and other miscellaneous industries, as well as to textile, chemical, and city gas distribution companies. It also generates and sells electricity through windmills. The company was founded in 1998 and is based in Gandhinagar, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gandhinagar",
        "zipcode": "382028",
        "website": "http://www.gspcgroup.com/GSPL/",
        "full_time_employees": 252
    },
    "GUJGASLTD.NS": {
        "short_name": "GUJARAT GAS LTD",
        "long_name": "Gujarat Gas Limited",
        "summary": "Gujarat Gas Limited engages in the distribution of city natural gas in India. The company operates a network of approximately 24,400 kilometers of gas pipeline and 403 CNG stations. It supplies natural gas to approximately 14.4 lakh residential consumers; and 12,600 commercial customers. It operates in 21 districts of the state of Gujarat, 7 districts of the state of Punjab, 5 districts of the state of Madhya Pradesh, 4 districts of the state of Rajasthan, 2 districts of the state of Maharashtra, 2 districts of the state of Haryana, and the Union Territory of Dadra and Nagar Haveli. The company was formerly known as GSPC Distribution Networks Limited and changed its name to Gujarat Gas Limited in May 2015. Gujarat Gas Limited was incorporated in 2012 and is based in Ahmedabad, India. Gujarat Gas Limited is a subsidiary of Gujarat State Petronet Limited.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380006",
        "website": "http://www.gujaratgas.com",
        "full_time_employees": 1089
    },
    "IGL.NS": {
        "short_name": "INDRAPRASTHA GAS",
        "long_name": "Indraprastha Gas Limited",
        "summary": "Indraprastha Gas Limited distributes natural gas in India. The company supplies compressed natural gas (CNG) to the transport sector; and piped natural gas to domestic, industrial, and commercial sectors in Delhi and the National Capital Region. It operates 555 CNG stations; and serves 13.74 Lakh households, and 5,578 commercial and industrial consumers. The company's operates 1,150 kilometers of steel pipeline network; and 13,455 kilometers MDPE network. Indraprastha Gas Limited was incorporated in 1998 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110022",
        "website": "http://www.iglonline.net",
        "full_time_employees": 703
    },
    "INDOWIND.NS": {
        "short_name": "INDOWIND ENERGY",
        "long_name": "Indowind Energy Limited",
        "summary": "Indowind Energy Limited operates as an IPP in the renewable energy sector in India. It engages in developing, setting up, operating, and maintaining wind farms primarily in Tamil Nadu and Karnataka. The company sells its wind power to corporate clients. It also provides project management and asset management services, as well as trades in and sells carbon credits (CERs) in Indian and international CER markets. The company was founded in 1995 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600034",
        "website": "http://www.indowind.com",
        "full_time_employees": 65
    },
    "JPPOWER.NS": {
        "short_name": "JAIPRAKASH POWER",
        "long_name": "Jaiprakash Power Ventures Limited",
        "summary": "Jaiprakash Power Ventures Limited engages in the power generation and cement grinding businesses in India. It generates electricity through hydro and thermal energy sources. The company owns and operates a 400 MW Jaypee Vishnuprayag hydro power plant at District Chamoli, Uttarakhand; 1320 MW Jaypee Nigrie super thermal power plant at Nigrie, District Singrauli, Madhya Pradesh; and 500 MW Jaypee Bina Thermal power plant at Village Sirchopi, District Sagar, Madhya Pradesh. It also operates a 219.80 Km power transmission line to evacuate power from 1091 MW Karcham Wangtoo hydroelectric plant up to Abdullapur, Haryana, as well as distribution and consumption in the states of Himachal Pradesh, Haryana, Punjab, Uttar Pradesh, and Rajasthan. In addition, the company operates coal mine located in Amelia, Madhya Pradesh. The company was formerly known as Jaiprakash Hydro-Power Limited and changed its name to Jaiprakash Power Ventures Limited in December 2009. Jaiprakash Power Ventures Limited was incorporated in 1994 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110057",
        "website": "http://www.jppowerventures.com",
        "full_time_employees": 1766
    },
    "JSWENERGY.NS": {
        "short_name": "JSW ENERGY LTD",
        "long_name": "JSW Energy Limited",
        "summary": "JSW Energy Limited, an integrated power company, generates and sells power in India. The company has a power generation capacity of 4,559 MW, which includes 3,158 MW of thermal, 1,391 MW of hydel, and 10 MW of solar. It has operations in the States of Karnataka, Maharashtra, Rajasthan, and Himachal Pradesh. The company also engages in power transmission and trading activities; and coal mining in South Africa. JSW Energy Limited was founded in 1994 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.jsw.in/energy",
        "full_time_employees": 1677
    },
    "KARMAENG.NS": {
        "short_name": "KARMA ENERGY LTD",
        "long_name": "Karma Energy Limited",
        "summary": "Karma Energy Limited engages in the generation of power from renewable energy sources in India. It develops and operates wind farms in the states of Andhra Pradesh, Maharashtra, and Tamil Nadu. The company also operates a 3.5 MW small hydropower ProjectKarma Energy Limited was incorporated in 2007 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400 001",
        "website": "http://www.karmaenergy.co",
        "full_time_employees": null
    },
    "MGL.NS": {
        "short_name": "MAHANAGAR GAS LTD",
        "long_name": "Mahanagar Gas Limited",
        "summary": "Mahanagar Gas Limited operates as a natural gas distribution company primarily in India. The company offers domestic piped natural gas (PNG), commercial PNG, industrial PNG, and compressed natural gas (CNG), as well as manufactures gas geysers. As of March 31, 2020, it operated 256 CNG filing stations providing the gas to approximately 0.75 million vehicles; and supplied PNG to approximately 1.26 million domestic, 3,949 commercial, and 72 industrial consumers through a pipeline network of approximately 5,630 kilometers. Mahanagar Gas Limited was founded in 1995 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.mahanagargas.com",
        "full_time_employees": null
    },
    "NBVENTURES.NS": {
        "short_name": "NAVA BHARAT VENTUR",
        "long_name": "Nava Bharat Ventures Limited",
        "summary": "Nava Bharat Ventures Limited engages in the ferro alloys, power, mining, and healthcare businesses in India, Zambia, China, Japan, and internationally. It generates and sells power using coal, biomass, and bagasse. The company operates 150 MW and 114 MW power plants in Paloncha, Telangana; 150 MW power plant in Kharagprasad, Odisha; 20 MW biomass power plant in Dharmavaram, Andhra Pradesh; 9 MW co-gen power plant in Samalkot, Andhra Pradesh; and 300 MW thermal power plant in Zambia. It also mines coal at Maamba in Southern province in Zambia, as well as provides operation and maintenance services for power plants. In addition, the company manufactures, markets, and exports alloys of iron, including manganese, silicon, chromium, etc. that are used in automotive, railways, and construction industries, as well as in the manufacture of stainless steel consumer goods. Further, it operates a medical clinic for the management of iron deficiency and the administration of intravenous iron in Singapore. Additionally, the company offers management services, including operational management of The Iron Suites Medical Centers, organization of medical events and congresses, disease awareness programs, and health-related corporate programs for the healthcare industry; and in-licensing services for pharmaceutical products. The company was founded in 1972 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500 034",
        "website": "http://www.nbventures.com",
        "full_time_employees": 924
    },
    "NHPC.NS": {
        "short_name": "NHPC LTD",
        "long_name": "NHPC Limited",
        "summary": "NHPC Limited, together with its subsidiaries, generates and sells electricity in India. The company generates electricity through hydro, wind, and solar power stations. It owns and operates 24 power stations with an installed capacity of 7,072 megawatts. The company also offers consultancy services, such as survey and investigation, planning, design and engineering, construction, operation and maintenance, renovation, and modernization and uprating of hydro power projects, as well as other associated works to clients in public and private sectors. In addition, it provides project management and construction contract services, as well as trades in power. The company sells electricity to bulk customers that include electricity utilities owned by state governments/private distribution companies. The company was formerly known as National Hydroelectric Power Corporation Ltd. NHPC Limited was founded in 1975 and is based in Faridabad, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Faridabad",
        "zipcode": "121003",
        "website": "http://www.nhpcindia.com",
        "full_time_employees": 6131
    },
    "NLCINDIA.NS": {
        "short_name": "NLC INDIA LTD",
        "long_name": "NLC India Limited",
        "summary": "NLC India Limited operates an energy company in India. It operates in two segments, Lignite Mining and Power Generation. The company is involved in the generation of power through thermal, wind, and solar photo voltaic power plants. It operates five thermal power stations with an aggregate installed capacity of 3240 MW; and 34 wind turbine generators with capacity of 1.50 MW each, as well as commissioned 440 MW solar photo voltaic power plant in Neyveli. The company also mines for lignite. It operates three open cast lignite mines in Neyveli, State of Tamil Nadu; and one open cast lignite mine in Barsingsar, State of Rajasthan with a total capacity of 30.60 MTPA, as well as coal excavation from Talabira II and III coal opencast mines at Odisha with a mining capacity of 20.0 MTPA. The company sells its raw lignite to small scale industries for use it as fuel in their production activities. NLC India Limited was formerly known as Neyveli Lignite Corporation Limited and changed its name to NLC India Limited in April 2016. The company was founded in 1956 and is based in Neyveli, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Neyveli",
        "zipcode": "607801",
        "website": "http://www.nlcindia.com",
        "full_time_employees": 12486
    },
    "NTPC.NS": {
        "short_name": "NTPC LTD",
        "long_name": "NTPC Limited",
        "summary": "NTPC Limited generates and sells bulk power to state power utilities in India. It operates in two segments, Generation of Energy and Others. The company generates power from coal, gas, liquid fuel, hydro, solar, nuclear, wind, thermal, and renewable energy sources. It also offers consultancy, project management, and supervision services. In addition, the company is involved in the energy trading, oil and gas exploration, and coal mining activities. As of February 20, 2021, it had an installed power generation capacity of 64,880 megawatt. NTPC Limited was founded in 1975 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110003",
        "website": "http://www.ntpc.co.in",
        "full_time_employees": 19165
    },
    "OPG.L": {
        "short_name": "OPG POWER VENTURES PLC ORD 0.01",
        "long_name": "OPG Power Ventures Plc",
        "summary": "OPG Power Ventures Plc, together with its subsidiaries, develops, owns, operates, and maintains private sector power projects in India. It operates thermal and solar power plants. The company primarily sells electric power to public sector undertakings and heavy industrial companies. OPG Power Ventures Plc was incorporated in 2008 and is based in Chennai, India.",
        "currency": "GBp",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600032",
        "website": "http://www.opgpower.com",
        "full_time_employees": 336
    },
    "POWERGRID.NS": {
        "short_name": "POWER GRID CORP",
        "long_name": "Power Grid Corporation of India Limited",
        "summary": "Power Grid Corporation of India Limited, a central transmission utility, engages in the transmission of power in India. The company is involved in planning, executing, owing, operating, and maintaining high voltage transmission systems. As of March 31, 2010, it owned and operated 1,56,884 ckt kms of transmission lines, as well as 244 substations with transformation capacity of 4,00,269 MVA. The company also provides consultancy services, including system engineering and feasibility studies, environmental and social impact assessment, design and engineering, contract, project management and construction supervision, owner's and lender's engineer, and other services, as well as engineering, procurement, and asset management. Power Grid Corporation of India Limited offers its consultancy services to state owned utilities, private utilities, central public sector undertakings, and government departments in Afghanistan, Bangladesh, Bhutan, Congo, Ethiopia, Fiji, Nigeria, Nepal, Kazakhstan, Kenya, the Kyrgyz Republic, Myanmar, Pakistan, Senegal, Sri Lanka, Tajikistan, Tanzania, the United Arab Emirates, and Uzbekistan. In addition, it provides overhead optic fiber network services using optical ground wire on power transmission lines under the POWERTEL brand name. The company was formerly known as National Power Transmission Corporation Limited and changed its name to Power Grid Corporation of India Limited in October 1992. Power Grid Corporation of India Limited was founded in 1989 and is headquartered in Gurugram, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122001",
        "website": "http://www.powergridindia.com",
        "full_time_employees": 8990
    },
    "PTC.NS": {
        "short_name": "PTC INDIA LTD",
        "long_name": "PTC India Limited",
        "summary": "PTC India Limited, together with its subsidiaries, engages in the trading of power in India, Nepal, Bhutan, and Bangladesh. The company engages in long term, medium term, and short term power trading activities, as well as cross border power trading business. It serves utilities, generators, and industrial and commercial customers. The company also provides fund based/non-fund based financial assistance for companies in power sector and related areas; and engages in consultancy and advisory activities. In addition, it operates 50 MW wind power projects in Madhya Pradesh; 50 MW wind power project in Karnataka; and 188.8 MW wind power projects in Andhra Pradesh. The company was formerly known as Power Trading Corporation of India Ltd. PTC India Limited was founded in 1999 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110066",
        "website": "http://www.ptcindia.com",
        "full_time_employees": 97
    },
    "RELINFRA.NS": {
        "short_name": "RELIANCE INFRASTRU",
        "long_name": "Reliance Infrastructure Limited",
        "summary": "Reliance Infrastructure Limited, an infrastructure company, engages in the generation, transmission, and distribution of electrical power to residential, industrial, commercial, and other customers in India. It operates through three segments: Power; Engineering and Construction; and Infrastructure. The company operates a 220 MW combined cycle power plant at Samalkot, a 48 MW combined cycle power plant at Mormugao, a 9.39 MW wind-farm at Chitradurga, and a 165 MW combined cycle power station at Kochi; distributes power in Delhi; and transmits power through its transmission networks in Himachal Pradesh, as well as trades in power. The company also provides integrated design, engineering, procurement, and project management services for coal-based thermal and gas-power projects, nuclear power projects, and metro rail and road projects; and development, operation, and maintenance of toll roads, metro rail transit systems, and airports. In addition, it is involved in the exploration and production of four coal bed methane blocks covering an area of 3,266 square kilometers in Madhya Pradesh, Andhra Pradesh, and Rajasthan; and an oil and gas block covering an area of 3,619 square kilometers in Mizoram. Further, the company engages in the manufacture of cement and defense systems; construction of smart city projects; provision of value added services in construction, erection, commissioning, and contracting areas; and real estate development and urban transport systems businesses. Reliance Infrastructure Limited was incorporated in 1929 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400001",
        "website": "http://www.rinfra.com",
        "full_time_employees": 5718
    },
    "RPOWER.NS": {
        "short_name": "RELIANCE POWER",
        "long_name": "Reliance Power Limited",
        "summary": "Reliance Power Limited, together with its subsidiaries, engages in the generation of power in India. Its portfolio of power projects is based on coal, gas, hydro, wind, and solar energy. The company has an operational power generation capacity of 5,945 megawatts (MW). It owns and operates 1,200 MW Rosa power plant in Uttar Pradesh; Sasan ultra mega power plant with capacity of 3,960 MW in Madhya Pradesh; Vashpet power plant with capacity of 45 MW in Maharashtra; Dhursar solar power plant with capacity of 40 MW in Rajasthan; Solar CSP power plant 100 MW in Rajasthan; and Butibori power plant with capacity of 600 MW in Maharashtra. It also develops and constructs coal mines in India and Indonesia. In addition, the company has an interest in four coal bed methane blocks. Reliance Power Limited was incorporated in 1995 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400055",
        "website": "http://www.reliancepower.co.in",
        "full_time_employees": null
    },
    "RTNINDIA.NS": {
        "short_name": "RATTANINDIA ENT LIMITED",
        "long_name": "RattanIndia Enterprises Limited",
        "summary": "RattanIndia Enterprises Limited generates, develops, transmits, distributes, trades in, and supplies electric power primarily in India. It generates electricity through thermal power. The company was formerly known as RattanIndia Infrastructure Limited and changed its name to RattanIndia Enterprises Limited in March 2021. RattanIndia Enterprises Limited was incorporated in 2010 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110016",
        "website": "http://www.rattanindia.com/ril/",
        "full_time_employees": 15
    },
    "RTNPOWER.NS": {
        "short_name": "RATTANINDIA POWER",
        "long_name": "RattanIndia Power Limited",
        "summary": "RattanIndia Power Limited engages in power generation, distribution, trading and transmission, and other ancillary and related activities in India. It is involved in the development of 2 coal based thermal power projects with an aggregate capacity of 5,400 MW, including 2,700 MW project at Nandgaonpeth in Amravati district and 2,700 MW project at Sinnar in Nasik district, in the State of Maharashtra. The company was formerly known as Indiabulls Power Limited and changed its name to RattanIndia Power Limited in October 2014. RattanIndia Power Limited was founded in 2007 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110037",
        "website": "http://www.rattanindia.com",
        "full_time_employees": 553
    },
    "SJVN.NS": {
        "short_name": "SJVN LTD",
        "long_name": "SJVN Limited",
        "summary": "SJVN Limited, together with its subsidiaries, engages in the generation and sale of power in India, Nepal, and Bhutan. It operates the Nathpa Jhakri Hydro Power Station with a capacity of 1500 MW located in Shimla district, Himachal Pradesh, India; and the Rampur Hydro Power Station with a capacity of 412 MW in Kullu District, Himachal Pradesh. The company also operates the Khirvire Wind Power Plant with a capacity of 47.6 MW in Ahmednagar district, Maharashtra; the Charanka Solar Power Plant with a capacity of 5.6 MW in Patan district, Gujarat; the Sadla Wind Power Project with a capacity of 50 MW in Surendranagar district, Gujrat; and an 86 km cross border transmission line with a capacity of 400 kV from Muzaffarpur to Sursand. In addition, it provides consultancy services in the field of hydro electric projects, highway tunnels/railway tunnels, etc. The company was formerly known as Satluj Jal Vidyut Nigam Limited and changed its name to SJVN Limited in September 2009. SJVN Limited was incorporated in 1988 and is based in Shimla, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Shimla",
        "zipcode": "171006",
        "website": "http://www.sjvn.nic.in",
        "full_time_employees": 1564
    },
    "SURANAT&P.BO": {
        "short_name": "SURANA TELECOM AND POWER LIMIT",
        "long_name": "Surana Telecom and Power Limited",
        "summary": "Surana Telecom and Power Limited engages in the generation and sale of solar and wind energy, and trade of solar modules in India. The company operates a solar power generation plant with an installed capacity of 23 MW; and wind power generation plant with an installed capacity of 1.25 MW. It also manufactures jelly filled cables, solar photovoltaic modules, aluminum and alloy aluminum rods, optical fiber cables, joining kits, and CDMA mobile handsets. The company was formerly known as Surana Telecom Ltd and changed its name to Surana Telecom and Power Limited in October 2007. Surana Telecom and Power Limited was incorporated in 1989 and is based in Secunderabad, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "BSE",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Secunderabad",
        "zipcode": "500003",
        "website": "http://www.suranatele.com",
        "full_time_employees": null
    },
    "SURANAT&P.NS": {
        "short_name": "SURANA TEL & POWER",
        "long_name": "Surana Telecom and Power Limited",
        "summary": "Surana Telecom and Power Limited engages in the generation and sale of solar and wind energy, and trade of solar modules in India. The company operates a solar power generation plant with an installed capacity of 23 MW; and wind power generation plant with an installed capacity of 1.25 MW. It also manufactures jelly filled cables, solar photovoltaic modules, aluminum and alloy aluminum rods, optical fiber cables, joining kits, and CDMA mobile handsets. The company was formerly known as Surana Telecom Ltd and changed its name to Surana Telecom and Power Limited in October 2007. Surana Telecom and Power Limited was incorporated in 1989 and is based in Secunderabad, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Secunderabad",
        "zipcode": "500003",
        "website": "http://www.suranatele.com",
        "full_time_employees": 25
    },
    "TATAPOWER.NS": {
        "short_name": "TATA POWER CO LTD",
        "long_name": "The Tata Power Company Limited",
        "summary": "The Tata Power Company Limited engages in the generation, transmission, distribution, and trading of electricity in India and internationally. It operates through Generation, Renewables, Transmission and Distribution, and Others segments. The Generation segment generates electricity from hydroelectric and thermal sources, such as coal, gas, and oil. The Renewables segment generates power from renewable energy sources, which include wind and solar. The Transmission and Distribution segment transmits and distributes electricity; sells power to retail customers through distribution network and related ancillary services. The Others segment offers project management contracts/infrastructure management, and property development services, as well as rents oil tanks. In addition, it manufactures and sells solar photovoltaic cells and modules; operates electric vehicle charging stations and coal mines; generates electricity through waste heat sources; trades in power; and provides engineering, procurement, and construction, as well as logistics services. As of March 31, 2020, the company had an installed capacity of 12,742 MW. The Tata Power Company Limited was founded in 1915 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400 001",
        "website": "http://www.tatapower.com",
        "full_time_employees": 8613
    },
    "TORNTPOWER.NS": {
        "short_name": "TORRENT POWER",
        "long_name": "Torrent Power Limited",
        "summary": "Torrent Power Limited, an integrated power utility, engages in the generation, transmission, and distribution of electricity in the states of Gujarat, Maharashtra, Uttar Pradesh, and Karnataka in India. It owns thermal and renewable power plants with a generating capacity of approximately 3,879 MW. The company also distributes electricity to approximately 3 million customers in the cities of Ahmedabad, Gandhinagar, Surat, and Dahej SEZ covering an area of approximately 425 square kilometers, as well as operates as a franchisee for electricity distribution in the cities of Bhiwandi, Agra and Shil-Mumbra-Kalwa covering an area of approximately 1,007 square kilometers. In addition, it is also involved in the manufacture and supply of power cables. Torrent Power Limited was incorporated in 2004 and is based in Ahmedabad, India. Torrent Power Limited is a subsidiary of Torrent Investments Private Limited.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380015",
        "website": "http://www.torrentpower.com",
        "full_time_employees": null
    }
}