{
    "ADANIPOWER.NS": {
        "short_name": "ADANI POWER LTD",
        "long_name": "Adani Power Limited",
        "summary": "Adani Power Limited engages in the generation and transmission of electricity under long term power purchase agreements and on merchant basis in India. It generates electricity through thermal and solar energy sources. The company has various power projects with a combined installed and commissioned capacity of 12,450 MW, including 4,620 MW at Mundra, Gujarat; 3,300 MW at Tiroda, Maharashtra; 1,320 MW at Kawai, Rajasthan; 1200 MW at Udupi, Karnataka; 40 MW at bitta, Gujarat; and 1,600 MW at Godda, Jharkhand. It also trades in coal. The company was founded in 1988 and is headquartered in Ahmedabad, India",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "382421",
        "website": "http://www.adanipower.com",
        "market_cap": 572070100992
    },
    "BAJAJELEC.NS": {
        "short_name": "BAJAJ ELECTRICALS",
        "long_name": "Bajaj Electricals Limited",
        "summary": "Bajaj Electricals Limited engages in the consumer durables; and engineering, procurement, and construction businesses in India. It operates through Consumer Products; and Engineering & Projects and Others segments. The company offers various appliances, including toasters, mixer-grinders, food processors, juicer mixer grinders, choppers and hand blenders, wet grinders, OTGs, microwave ovens, electric kettles, induction cookers, rice cookers, pressure cookers, gas stoves, non-electric kitchen aids, irons, storage water heaters, gas water heaters, instant water heaters, room heaters, air coolers, coffee makers, sandwich/pop-up toasters, hand mixers, electric cookers, and hair dryers. It also provides various fans comprising ceiling, pedestal, table, wall, personal, domestic, and heavy duty exhaust fans, as well as air circulators. In addition, the company offers lighting products, such as lamps, fluorescent lamps, compact fluorescent lamps, LED torches, LED lanterns, LED table lamps, consumer luminaires, and electrical accessories; and integrated building management systems. Further, it is involved in the design, engineering, supply, execution, and commissioning of power distribution and transmission projects. Additionally, the company generates wind energy. It also exports its products. The company was formerly known as Radio Lamp Works Limited and changed its name to Bajaj Electricals Limited in October 1960. The company was founded in 1938 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400022",
        "website": "http://www.bajajelectricals.com",
        "market_cap": 134466633728
    },
    "CESC.NS": {
        "short_name": "CESC",
        "long_name": "CESC Limited",
        "summary": "CESC Limited, an integrated electrical utility company, engages in the generation, transmission, and distribution of electricity to approximately 3.3 million domestic, industrial, and commercial users in the area of 567 square kilometers of Kolkata, Howrah, Hooghly, and North and South 24 Parganas in West Bengal in India. It owns and operates three thermal power plants, including Budge Budge, Southern, and Titagarh generating stations generating 1125 megawatts (MW) of power; two thermal power projects with a capacity of 640 MW in Chandrapur, Maharashtra and Haldia, West Bengal; and transmission and distribution systems that comprise 474 km circuit of transmission lines linking the company's generating and receiving stations with 105 distribution stations, as well as 8,211 km circuit of HT lines, and 12,269 km circuit of LT lines. The company also owns and operates solar plant in Gujarat's Kutch generating 9 MW of solar energy, and a 18 MW DC project in Ramnathapuram, Tamil Nadu; hydro power venture in Arunachal Pradesh generating 146 MW energy; and wind power plants, including a 24 MW project at Dangri in Rajasthan, a 26 MW project in Surendranagar in Gujarat, a 36 MW project in Nipaniya in Madhya Pradesh, and a 70 MW project in Rojmal, Gujarat. The company was formerly known as The Calcutta Electric Supply Corporation (India) Limited and changed its name to CESC Limited in January 1987. CESC Limited was founded in 1899 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://www.cesc.co.in",
        "market_cap": 88023392256
    },
    "GREENPOWER.NS": {
        "short_name": "ORIENT GREEN POWER",
        "long_name": "Orient Green Power Company Limited",
        "summary": "Orient Green Power Company Limited, an independent renewable energy power producing company, develops, owns, and operates a portfolio of wind energy power plants in India. It has a portfolio of 421 MW of wind energy across Tamil Nadu, Andhra Pradesh, Gujarat, and Karnataka, as well as 10.5 MW wind power plant in Croatia. The company was incorporated in 2006 and is headquartered in Chennai, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600017",
        "website": "http://www.orientgreenpower.com",
        "market_cap": 2303374336
    },
    "JPPOWER.NS": {
        "short_name": "JAIPRAKASH POWER",
        "long_name": "Jaiprakash Power Ventures Limited",
        "summary": "Jaiprakash Power Ventures Limited engages in the power generation and cement grinding businesses in India. It generates electricity through hydro and thermal energy sources. The company owns and operates a 400 MW Jaypee Vishnuprayag hydro power plant at District Chamoli, Uttarakhand; 1320 MW Jaypee Nigrie super thermal power plant at Nigrie, District Singrauli, Madhya Pradesh; and 500 MW Jaypee Bina Thermal power plant at Village Sirchopi, District Sagar, Madhya Pradesh. It also operates a 219.80 Km power transmission line to evacuate power from 1091 MW Karcham Wangtoo hydroelectric plant up to Abdullapur, Haryana, as well as distribution and consumption in the states of Himachal Pradesh, Haryana, Punjab, Uttar Pradesh, and Rajasthan. In addition, the company operates coal mine located in Amelia, Madhya Pradesh. The company was formerly known as Jaiprakash Hydro-Power Limited and changed its name to Jaiprakash Power Ventures Limited in December 2009. Jaiprakash Power Ventures Limited was incorporated in 1994 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110057",
        "website": "http://www.jppowerventures.com",
        "market_cap": 34379649024
    },
    "JSWENERGY.NS": {
        "short_name": "JSW ENERGY LTD",
        "long_name": "JSW Energy Limited",
        "summary": "JSW Energy Limited, an integrated power company, generates and sells power in India. The company has a power generation capacity of 4,559 MW, which includes 3,158 MW of thermal, 1,391 MW of hydel, and 10 MW of solar. It has operations in the States of Karnataka, Maharashtra, Rajasthan, and Himachal Pradesh. The company also engages in power transmission and trading activities; and coal mining in South Africa. JSW Energy Limited was founded in 1994 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.jsw.in/energy",
        "market_cap": 252989669376
    },
    "NTPC.NS": {
        "short_name": "NTPC LTD",
        "long_name": "NTPC Limited",
        "summary": "NTPC Limited generates and sells bulk power to state power utilities in India. It operates in two segments, Generation of Energy and Others. The company generates power from coal, gas, liquid fuel, hydro, solar, nuclear, wind, thermal, and renewable energy sources. It also offers consultancy, project management, and supervision services. In addition, the company is involved in the energy trading, oil and gas exploration, and coal mining activities. As of February 20, 2021, it had an installed power generation capacity of 64,880 megawatt. NTPC Limited was founded in 1975 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110003",
        "website": "http://www.ntpc.co.in",
        "market_cap": 1093341020160
    },
    "PTC.NS": {
        "short_name": "PTC INDIA LTD",
        "long_name": "PTC India Limited",
        "summary": "PTC India Limited, together with its subsidiaries, engages in the trading of power in India, Nepal, Bhutan, and Bangladesh. The company engages in long term, medium term, and short term power trading activities, as well as cross border power trading business. It serves utilities, generators, and industrial and commercial customers. The company also provides fund based/non-fund based financial assistance for companies in power sector and related areas; and engages in consultancy and advisory activities. In addition, it operates 50 MW wind power projects in Madhya Pradesh; 50 MW wind power project in Karnataka; and 188.8 MW wind power projects in Andhra Pradesh. The company was formerly known as Power Trading Corporation of India Ltd. PTC India Limited was founded in 1999 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110066",
        "website": "http://www.ptcindia.com",
        "market_cap": 24672460800
    },
    "RPOWER.NS": {
        "short_name": "RELIANCE POWER",
        "long_name": "Reliance Power Limited",
        "summary": "Reliance Power Limited, together with its subsidiaries, engages in the generation of power in India. Its portfolio of power projects is based on coal, gas, hydro, wind, and solar energy. The company has an operational power generation capacity of 5,945 megawatts (MW). It owns and operates 1,200 MW Rosa power plant in Uttar Pradesh; Sasan ultra mega power plant with capacity of 3,960 MW in Madhya Pradesh; Vashpet power plant with capacity of 45 MW in Maharashtra; Dhursar solar power plant with capacity of 40 MW in Rajasthan; Solar CSP power plant 100 MW in Rajasthan; and Butibori power plant with capacity of 600 MW in Maharashtra. It also develops and constructs coal mines in India and Indonesia. In addition, the company has an interest in four coal bed methane blocks. Reliance Power Limited was incorporated in 1995 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400055",
        "website": "http://www.reliancepower.co.in",
        "market_cap": 35064123392
    },
    "RTNINDIA.NS": {
        "short_name": "RATTANINDIA ENT LIMITED",
        "long_name": "RattanIndia Enterprises Limited",
        "summary": "RattanIndia Enterprises Limited generates, develops, transmits, distributes, trades in, and supplies electric power primarily in India. It generates electricity through thermal power. The company was formerly known as RattanIndia Infrastructure Limited and changed its name to RattanIndia Enterprises Limited in March 2021. RattanIndia Enterprises Limited was incorporated in 2010 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110016",
        "website": "http://www.rattanindia.com/ril/",
        "market_cap": 18675070976
    },
    "SURANAT&P.BO": {
        "short_name": "SURANA TELECOM AND POWER LIMIT",
        "long_name": "Surana Telecom and Power Limited",
        "summary": "Surana Telecom and Power Limited engages in the generation and sale of solar and wind energy, and trade of solar modules in India. The company operates a solar power generation plant with an installed capacity of 23 MW; and wind power generation plant with an installed capacity of 1.25 MW. It also manufactures jelly filled cables, solar photovoltaic modules, aluminum and alloy aluminum rods, optical fiber cables, joining kits, and CDMA mobile handsets. The company was formerly known as Surana Telecom Ltd and changed its name to Surana Telecom and Power Limited in October 2007. Surana Telecom and Power Limited was incorporated in 1989 and is based in Secunderabad, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "BSE",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Secunderabad",
        "zipcode": "500003",
        "website": "http://www.suranatele.com",
        "market_cap": 826778432
    },
    "SURANAT&P.NS": {
        "short_name": "SURANA TEL & POWER",
        "long_name": "Surana Telecom and Power Limited",
        "summary": "Surana Telecom and Power Limited engages in the generation and sale of solar and wind energy, and trade of solar modules in India. The company operates a solar power generation plant with an installed capacity of 23 MW; and wind power generation plant with an installed capacity of 1.25 MW. It also manufactures jelly filled cables, solar photovoltaic modules, aluminum and alloy aluminum rods, optical fiber cables, joining kits, and CDMA mobile handsets. The company was formerly known as Surana Telecom Ltd and changed its name to Surana Telecom and Power Limited in October 2007. Surana Telecom and Power Limited was incorporated in 1989 and is based in Secunderabad, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Secunderabad",
        "zipcode": "500003",
        "website": "http://www.suranatele.com",
        "market_cap": 864127104
    },
    "TATAPOWER.NS": {
        "short_name": "TATA POWER CO LTD",
        "long_name": "The Tata Power Company Limited",
        "summary": "The Tata Power Company Limited engages in the generation, transmission, distribution, and trading of electricity in India and internationally. It operates through Generation, Renewables, Transmission and Distribution, and Others segments. The Generation segment generates electricity from hydroelectric and thermal sources, such as coal, gas, and oil. The Renewables segment generates power from renewable energy sources, which include wind and solar. The Transmission and Distribution segment transmits and distributes electricity; sells power to retail customers through distribution network and related ancillary services. The Others segment offers project management contracts/infrastructure management, and property development services, as well as rents oil tanks. In addition, it manufactures and sells solar photovoltaic cells and modules; operates electric vehicle charging stations and coal mines; generates electricity through waste heat sources; trades in power; and provides engineering, procurement, and construction, as well as logistics services. As of March 31, 2020, the company had an installed capacity of 12,742 MW. The Tata Power Company Limited was founded in 1915 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400 001",
        "website": "http://www.tatapower.com",
        "market_cap": 293510217728
    }
}