{"DLNDY": {"short_name": "D&L INDUSTRIES INC", "long_name": "D&L Industries, Inc.", "summary": "D&L Industries, Inc. provides products for food ingredients, chemicals for personal and home care use, raw materials for plastic, and aerosol products in the Philippines and internationally. The company operates through four segments: Food Ingredients; Colorants and Plastic Additives; Oleochemicals, Resins and Powder Coatings; and Aerosols. The Food Ingredients segment manufactures industrial fats and oils, food ingredients, specialty fats and oils, and culinary and other specialty food ingredients to various food manufacturers and quick-service restaurant chains; and food safety solutions, such as cleaning and sanitation agents. The Colorants and Plastic Additives segment manufactures pigment blends, color and additive masterbatches, and engineered polymers for use in the plastic industry, as well as offers toll compounding services. The Oleochemicals, Resins and Powder Coatings segment provides coconut methyl ester; glycerin and other coconut methyl ester derivatives, which are used as surfactants or foaming agents for soaps and detergents; medium-chain triglyceride oil; polystyrene resins for the plastics industry; polymer emulsions for the paint industry; and polyester resins for the construction, shipping, and furniture industries. It also offers powder coatings for use in home appliances, metal furniture, fixtures and fittings, mechanical parts, and tools and equipment, as well as construction industry; and other specialty resin-based chemicals. The Aerosols segment manufactures aerosol cans and components; products for use in insect control, industrial maintenance chemicals, and home and personal care product applications; and non-aerosol products that include insecticides, liquid and gel disinfectants, cleaners, polishers, and liquid soaps, as well as provides contract aerosol filling and compounding services. The company was founded in 1963 and is headquartered in Quezon City, the Philippines. D&L Industries, Inc. is a subsidiary of Jadel Holdings Co., Inc.", "currency": "USD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "PNK", "market": "us_market", "country": "Philippines", "city": "Quezon City"}, "HCPHF": {"short_name": "HOLCIM PHILIPPINES INC", "long_name": "Holcim Philippines, Inc.", "summary": "Holcim Philippines, Inc. primarily manufactures, sells, distributes, and exports cement and cementitious products in the Philippines and internationally. It produces cement in various product brands, including Holcim 4X, an American Society for Testing and Materials (ASTM) C150 Portland cement for ready mix concrete applications; Holcim Premium cement, an ASTM type I Portland cement for general concrete construction; Holcim Excel, an ASTM type IP cement for general concrete construction; and Holcim WallRight cement, an ASTM C91 type S Masonry cement for block laying, plastering, and finishing use. The company also offers clinkers; read mix concrete products, such as structural, industrial housing, road and pavement, and high strength concrete, as well as concrete for special applications; aggregates; Holcim tile adhesive, a cement-based adhesive for tiles primarily formulated for thin-bed vertical and horizontal applications; Holcim skim coat, a cementitious plaster for indoor and outdoor applications; and Holcim concrete waterproofing, a cement-based waterproofing. In addition, it engages in the purchase, lease, and sale of real estate properties; mining, processing, and sale of quarry resources; manufacture, use, and sale of admixtures; business process outsourcing and other information technology enabled services; and operation, maintenance, and franchise stores for the sale and distribution of construction and building materials, as well as provision of construction-related services. Holcim Philippines, Inc. offers its products to traders, wholesalers, retailers, contractors serving private and public projects, real estate developers, and concrete producers. The company was formerly known as Union Cement Corporation and changed its name to Holcim Philippines, Inc. in November 2004. The company was incorporated in 1964 and is based in Taguig City, the Philippines. Holcim Philippines, Inc. is a subsidiary of Union Cement Holdings Corporation.", "currency": "USD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "PNK", "market": "us_market", "country": "Philippines", "city": "Taguig City"}, "LECBF": {"short_name": "LEPANTO CONSOLIDATED MINING", "long_name": "Lepanto Consolidated Mining Company", "summary": "Lepanto Consolidated Mining Company engages in the exploration and mining of mineral properties primarily in the Philippines. The company operates through three segments: Mining Activities, Service, and Others. It explores for gold, silver, copper, lead, and zinc, as well as various kinds of ores, metals, minerals, oil, gas, coal, and related by-products. The company holds interests in the Victoria project located in Mankayan, Benguet. It is also involved in drilling, hauling, and sawmilling activities; apartments/guesthouses and warehouses leasing activities; and insurance and real estate brokerage businesses. In addition, the company manufactures, distributes, buys, and sells industrial machinery and equipment, diamond core and non-core bits, reamer shells, casing bits, diamond circular segmental and diamond gang saws, and tubular and other products for diamond core drilling industry. Lepanto Consolidated Mining Company was founded in 1936 and is based in Makati, the Philippines.", "currency": "USD", "sector": "Basic Materials", "industry": "Gold", "exchange": "PNK", "market": "us_market", "country": "Philippines", "city": "Makati"}, "PXMFF": {"short_name": "PHILEX MINING CORP", "long_name": "Philex Mining Corporation", "summary": "Philex Mining Corporation, together with its subsidiaries, engages in the exploration, development, and utilization of mineral resources in the Philippines. The company holds interests in the Padcal mine that produces copper concentrates containing copper, gold, and silver located in Benguet province; and the Silangan project covering the Boyongan and Bayugo deposits located in Surigao del Norte. Philex Mining Corporation was incorporated in 1955 and is headquartered in Mandaluyong, the Philippines.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Philippines", "city": "Mandaluyong"}}