{
    "HCPHF": {
        "short_name": "HOLCIM PHILIPPINES INC",
        "long_name": "Holcim Philippines, Inc.",
        "summary": "Holcim Philippines, Inc. primarily manufactures, sells, distributes, and exports cement and cementitious products in the Philippines and internationally. It produces cement in various product brands, including Holcim 4X, an American Society for Testing and Materials (ASTM) C150 Portland cement for ready mix concrete applications; Holcim Premium cement, an ASTM type I Portland cement for general concrete construction; Holcim Excel, an ASTM type IP cement for general concrete construction; and Holcim WallRight cement, an ASTM C91 type S Masonry cement for block laying, plastering, and finishing use. The company also offers clinkers; read mix concrete products, such as structural, industrial housing, road and pavement, and high strength concrete, as well as concrete for special applications; aggregates; Holcim tile adhesive, a cement-based adhesive for tiles primarily formulated for thin-bed vertical and horizontal applications; Holcim skim coat, a cementitious plaster for indoor and outdoor applications; and Holcim concrete waterproofing, a cement-based waterproofing. In addition, it engages in the purchase, lease, and sale of real estate properties; mining, processing, and sale of quarry resources; manufacture, use, and sale of admixtures; business process outsourcing and other information technology enabled services; and operation, maintenance, and franchise stores for the sale and distribution of construction and building materials, as well as provision of construction-related services. Holcim Philippines, Inc. offers its products to traders, wholesalers, retailers, contractors serving private and public projects, real estate developers, and concrete producers. The company was formerly known as Union Cement Corporation and changed its name to Holcim Philippines, Inc. in November 2004. The company was incorporated in 1964 and is based in Taguig City, the Philippines. Holcim Philippines, Inc. is a subsidiary of Union Cement Holdings Corporation.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Philippines",
        "city": "Taguig City"
    }
}