{"DLNDY": {"short_name": "D&L INDUSTRIES INC", "long_name": "D&L Industries, Inc.", "summary": "D&L Industries, Inc. provides products for food ingredients, chemicals for personal and home care use, raw materials for plastic, and aerosol products in the Philippines and internationally. The company operates through four segments: Food Ingredients; Colorants and Plastic Additives; Oleochemicals, Resins and Powder Coatings; and Aerosols. The Food Ingredients segment manufactures industrial fats and oils, food ingredients, specialty fats and oils, and culinary and other specialty food ingredients to various food manufacturers and quick-service restaurant chains; and food safety solutions, such as cleaning and sanitation agents. The Colorants and Plastic Additives segment manufactures pigment blends, color and additive masterbatches, and engineered polymers for use in the plastic industry, as well as offers toll compounding services. The Oleochemicals, Resins and Powder Coatings segment provides coconut methyl ester; glycerin and other coconut methyl ester derivatives, which are used as surfactants or foaming agents for soaps and detergents; medium-chain triglyceride oil; polystyrene resins for the plastics industry; polymer emulsions for the paint industry; and polyester resins for the construction, shipping, and furniture industries. It also offers powder coatings for use in home appliances, metal furniture, fixtures and fittings, mechanical parts, and tools and equipment, as well as construction industry; and other specialty resin-based chemicals. The Aerosols segment manufactures aerosol cans and components; products for use in insect control, industrial maintenance chemicals, and home and personal care product applications; and non-aerosol products that include insecticides, liquid and gel disinfectants, cleaners, polishers, and liquid soaps, as well as provides contract aerosol filling and compounding services. The company was founded in 1963 and is headquartered in Quezon City, the Philippines. D&L Industries, Inc. is a subsidiary of Jadel Holdings Co., Inc.", "currency": "USD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "PNK", "market": "us_market", "country": "Philippines", "city": "Quezon City"}}