{
    "CENCOSUD.SN": {
        "short_name": "CENCOSUD SA",
        "long_name": "Cencosud S.A.",
        "summary": "Cencosud S.A., together with its subsidiaries, operates as a multi-brand retailer in Chile, Argentina, Brazil, Colombia, and Peru. The company operates supermarkets, home improvement stores, department stores, shopping centers, and insurance brokerage and family entertainment centers; and provides private label credit cards, consumer loans, and limited financial services to its retail customers, as well as offers commercial real estate development services. As of December 31, 2019, it operated 1,108 stores and 67 shopping centers covering 3.5 million square meters of sales area; and 830 thousand square meters of rentable areas to third parties. The company was founded in 1963 and is headquartered in Las Condes, Chile.",
        "currency": "CLP",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "Chile",
        "state": null,
        "city": "Las Condes",
        "zipcode": null,
        "website": "http://www.cencosud.com",
        "market_cap": "Large Cap"
    },
    "FALABELLA.SN": {
        "short_name": "FALABELLA SA",
        "long_name": "Falabella S.A.",
        "summary": "Falabella S.A. engages in the physical and online retail trade business in Chile, Peru, Colombia, Argentina, Brazil, Uruguay, and Mexico. The company operates department stores that offer fashion, decoration, and electronics through 111 stores; home improvement stores that provide a range of solutions for home construction, decoration, and maintenance through 254 stores; and hypermarkets, supermarkets, and other convenience price formats with 146 stores. It also provides financial services, including credit cards, banking, insurance, and insurance brokerage services; and develops, operates, and manages shopping centers in Chile, Peru, and Colombia. The company was founded in 1889 and is based in Santiago, Chile.",
        "currency": "CLP",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "Chile",
        "state": null,
        "city": "Santiago de Chile",
        "zipcode": null,
        "website": "http://www.falabella.com",
        "market_cap": "Large Cap"
    },
    "HITES.SN": {
        "short_name": "EMPRESAS HITES S A",
        "long_name": "Empresas Hites S.A.",
        "summary": "Empresas Hites S.A. engages in the retail business in Chile. It is involved in the retail sale of wardrobe products, accessories, and household items through its 23 multi-stores. The company was founded in 1940 and is based in Santiago, Chile.",
        "currency": "CLP",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "Chile",
        "state": null,
        "city": "Santiago de Chile",
        "zipcode": null,
        "website": "http://www.hites.com",
        "market_cap": "Large Cap"
    },
    "NUEVAPOLAR.SN": {
        "short_name": "EMPRESAS LA POLAR",
        "long_name": "Empresas La Polar S.A.",
        "summary": "Empresas La Polar S.A. operates a chain of department stores. It operates through Retail and Financial Services segments. The company's department stores provide clothing products, household appliances, home furnishings, household items, electronics, personal computers, and others. It also engages in the provision of financial services through the issuance and administration of credit cards for in-store financing of polar and partner merchants; intermediation of insurance policies; and insurance brokerage business. The company sells its products through a network of 38 stores, as well as online. Empresas La Polar S.A. was founded in 1920 and is based in Santiago, Chile.",
        "currency": "CLP",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "Chile",
        "state": null,
        "city": "Santiago de Chile",
        "zipcode": null,
        "website": "http://www.lapolar.cl",
        "market_cap": "Large Cap"
    },
    "RIPLEY.SN": {
        "short_name": "RIPLEY CORP SA",
        "long_name": "Ripley Corp S.A.",
        "summary": "Ripley Corp S.A. engages in the retail sale of apparel, accessories, and home products through department stores and e-commerce. It is also involved in banking business through the management of Ripley Bank that primarily focuses on the consumer sector; and the real estate business, including the ownership of shopping malls. The company operates 76 stores in Chile and Peru; 13 malls; and approximately 1.5 million credit cards with debt. Ripley Corp S.A. was founded in 1956 and is based in Santiago, Chile.",
        "currency": "CLP",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "Chile",
        "state": null,
        "city": "Santiago de Chile",
        "zipcode": null,
        "website": "http://ripleyinversionistas.cl",
        "market_cap": "Large Cap"
    },
    "SMU.SN": {
        "short_name": "SMU SA",
        "long_name": "SMU S.A.",
        "summary": "SMU S.A. operates a chain of supermarkets in Chile. The company offers fresh items, such as fruits and vegetables, white and red meats, and dairy products, as well as dry goods, wine and spirits, frozen and cleaning products, and various non-food items; and ready meals, chocolates, beverages, pastries, bread, and tobacco products. It operates food retail business through various formats comprising supermarkets under the Unimarc and Mayorista 10 name; cash and carry stores under the Alvi names; convenience stores under the Ok Market name; and online through Telemercados name. As of March 15, 2021, it operated 284 Unimarc stores, 63 Mayorista 10 stores, 32 Alvi stores, 125 Ok Market, and 25 Mayorsa stores. SMU S.A. was founded in 2007 and is based in Las Condes, Chile.",
        "currency": "CLP",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "Chile",
        "state": null,
        "city": "Las Condes",
        "zipcode": null,
        "website": "http://www.smu.cl",
        "market_cap": "Large Cap"
    }
}