{
    "AKVA.OL": {
        "short_name": "AKVA GROUP ASA",
        "long_name": "AKVA Group ASA",
        "summary": "AKVA Group ASA develops, designs, manufactures, assembles, sells, and installs technology products; and provides rental and consulting services for the aquaculture industry. The company operates through three segments: Cage Based Technology, Software, and Land Based Technology. The Cage Based Technology segment offers plastic cages, steel cages, feed barges, feed systems, sensor and camera systems, biomass estimation systems, underwater lights, net cleaning systems, and nets and mooring systems under the Polarcirkel, Wavemaster, and Akvasmart hardware brands. This segment also supplies polyethylene work boats, pipes, ROV's, and subsea solutions to aquaculture, oil service, and maritime industries. The Software segment provides production control, planning, traceability, and ERP software for the aquaculture and fishing industries under the Fishtalk brand. This segment also operates AKVAconnect, a process control platform that enables real-time control of various mission critical equipment, such as feeding systems, environmental sensors, barges, and cameras installed on-site at the farmer's locations. The Land Based Technology segment designs and delivers recirculation systems for land based fish farming, as well as provides water quality conditions for fresh and seawater operations. The company also offers PRISMA, a cloud-based data platform for the aquaculture eco-system. AKVA group ASA operates in Norway, Chile, Canada, Scotland, Denmark, and internationally. The company is based in Klepp Stasjon, Norway. AKVA Group ASA is a subsidiary of Egersund Group AS.",
        "currency": "NOK",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Norway",
        "state": null,
        "city": "Klepp Stasjon",
        "zipcode": "4353",
        "website": "http://www.akvagroup.com",
        "market_cap": "Small Cap"
    }
}