{
    "000554.SZ": {
        "short_name": "SINOPEC SD TAI PET",
        "long_name": "SINOPEC Shandong Taishan Pectroleum Co.,Ltd.",
        "summary": "SINOPEC Shandong Taishan Pectroleum Co.,Ltd. purchases and sells petroleum oil products in China. The company's principal products include gasoline, diesel oil, lubricating oil, and other petrochemicals. It is also involved in the supply of natural gas. The company is based in Taian, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Taian"
    },
    "000723.SZ": {
        "short_name": "SHANXI MEIJIN ENER",
        "long_name": "Shanxi Meijin Energy Co., Ltd.",
        "summary": "Shanxi Meijin Energy Co., Ltd. manufactures and sells coking coal. It provides coal products, coal slurry, coal gangue, chemical products, ammonium sulfate, and coke oven gas. The company was founded in 1992 and is based in Taiyuan, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Taiyuan"
    },
    "002778.SZ": {
        "short_name": "JIANGSU GAOKE PETR",
        "long_name": "Jiangsu Gaoke Petrochemical Co., Ltd",
        "summary": "Jiangsu Gaoke Petrochemical Co., Ltd researches, develops, produces, and sells lubricants and greases in China and internationally. The company offers gasoline engine, diesel engine, construction machinery, industrial, transformer, vehicle gear, motorcycle, antifreeze, and auxiliary oils, as well as other lubricant products. Jiangsu Gaoke Petrochemical Co., Ltd is based in Yixing, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Yixing"
    },
    "002960.KS": {
        "short_name": "HankookShellOil",
        "long_name": "Hankook Shell Oil Co.,Ltd.",
        "summary": "Hankook Shell Oil Co., Ltd. engages in the manufacture, blending, distribution, and marketing of lubricating oils and greases, and other petroleum products and associated products in South Korea. It also provides technical services and other services to its products. The company was formerly known as Keuk Dong Shell Oil Refinery Co., Ltd. The company was founded in 1960 and is based in Busan, South Korea. Hankook Shell Oil Co., Ltd. operates as a subsidiary of Royal Dutch Shell plc.",
        "currency": "KRW",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Busan"
    },
    "003240.KS": {
        "short_name": "TaekwangInd",
        "long_name": "Taekwang Industrial Co., Ltd.",
        "summary": "Taekwang Industrial Co., Ltd. engages in the synthetic fiber, textile, petrochemical, and advanced material businesses in South Korea and internationally. It offers synthetic fibers comprising acrylic fibers, nylon filaments, spandex, and low-melting-point fibers, as well as ring, open-end, acrylic, and acrylic blended spun yarns. The company also provides petrochemical products, including purified terephthalic acids, propylene, acrylonitrile, sodium cyanide, acetonitrile, ammonium sulphate, and hydrogen peroxide. In addition, it offers tricot and polyester fabrics; and advanced materials, such as carbon and aramid fibers. The company was founded in 1950 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "003650.KS": {
        "short_name": "MichangOil",
        "long_name": "Michang Oil Ind .Co.,Ltd.",
        "summary": "Michang Oil Ind. Co., Ltd. engages in the petrochemical business in South Korea. It offers automotive lubricants, including motor, gasoline engine, diesel engine, gear, and automatic transmission oils, as well as other application oils; and transformer oils. The company also provides industrial lubricants, such as hydraulic, gear, turbine, and heat transfer oils; and rubber process oils, such as paraffin, naphthene, and aroma. In addition, it offers technical grade white oils; and white mineral oil consisting of food, cosmetic, and pharma grades. The company was founded in 1962 and is headquartered in Busan, South Korea.",
        "currency": "KRW",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Busan"
    },
    "010950.KS": {
        "short_name": "S-Oil",
        "long_name": "S-Oil Corporation",
        "summary": "S-OIL Corporation operates as an oil refining company in South Korea. The company offers gasoline, diesel, kerosene, jet fuel, LPG, fuel oil, and asphalt; benzene, toluene, xylene, para-xylene, propylene, methyl tert butly ether, propylene oxide, and polypropylene; and lubricant products. It also operates facilities that produce lube base oil and petro-chemical products; crude oil refining facilities of 669,000 barrels a day; and a bunker-C cracking center that produces petroleum products. The company has a strategic partnership with Gulf Oil Lubricants India Limited to manufacture and market a range of lubricants under the S-Oil Seven brand for the Indian market. S-OIL Corporation also exports its oil products to Southeast Asia, the United States, China, Japan, Australia, Europe, and internationally. The company was founded in 1976 and is headquartered in Seoul, South Korea. S-OIL Corporation is a subsidiary of Aramco Overseas Co., B.V.",
        "currency": "KRW",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "010955.KS": {
        "short_name": "S-Oil(1P)",
        "long_name": "S-Oil Corporation",
        "summary": "S-OIL Corporation operates as an oil refining company in South Korea. The company offers gasoline, diesel, kerosene, jet fuel, LPG, fuel oil, and asphalt; benzene, toluene, xylene, para-xylene, propylene, methyl tert butly ether, propylene oxide, and polypropylene; and lubricant products. It also operates facilities that produce lube base oil and petro-chemical products; crude oil refining facilities of 669,000 barrels a day; and a bunker-C cracking center that produces petroleum products. The company has a strategic partnership with Gulf Oil Lubricants India Limited to manufacture and market a range of lubricants under the S-Oil Seven brand for the Indian market. S-OIL Corporation also exports its oil products to Southeast Asia, the United States, China, Japan, Australia, Europe, and internationally. The company was founded in 1976 and is headquartered in Seoul, South Korea. S-OIL Corporation is a subsidiary of Aramco Overseas Co., B.V.",
        "currency": "KRW",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "0338.HK": {
        "short_name": "SHANGHAI PECHEM",
        "long_name": "Sinopec Shanghai Petrochemical Company Limited",
        "summary": "Sinopec Shanghai Petrochemical Company Limited, together with its subsidiaries, manufactures and sells petrochemical products in the People's Republic of China. It operates through five segments: Synthetic Fibres, Resins and Plastics, Intermediate Petrochemical Products, Petroleum Products, and Trading of Petrochemical Products. The Synthetic Fibres segment produces polyesters, acrylic fibers, and carbon fibers that are primarily used in the textile and apparel industries. The Resins and Plastics segment produces polyester chips that are used to produce polyester fibers, coating, and containers; polyethylene resins and plastics, which are used to produce insulated cables and mulching films, as well as molded products, such as housewares and toys; and polypropylene resins that are used for films and sheets, as well as molded products, such as housewares, toys, consumer electronics, and automobile parts; and PVA granules. The Intermediate Petrochemical Products segment produces p-xylene, benzene, and ethylene oxide, which are used as raw materials in the production of other petrochemicals, resins, plastics, and synthetic fibers. The Petroleum Products segment operates crude oil distillation facilities that produce vacuum and atmospheric gas oils used as feedstock; and residual oil and low octane gasoline fuels, as well as produces various fuels, such as diesel oil, jet fuel, heavy oil, and liquefied petroleum gas for transportation, industry, and household heating applications. The Trading of Petrochemical Products segment is involved in the import and export of petrochemical products. The company was founded in 1972 and is based in Shanghai, the People's Republic of China. Sinopec Shanghai Petrochemical Company Limited is a subsidiary of China Petroleum & Chemical Corporation.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "0342.HK": {
        "short_name": "NEWOCEAN ENERGY",
        "long_name": "NewOcean Energy Holdings Limited",
        "summary": "NewOcean Energy Holdings Limited, an investment holding company, distributes and sells liquefied petroleum gas (LPG) and natural gas, and oil/chemical products in the People's Republic of China. The company sells LPG to industrial customers, auto-gas operators, wholesalers, bottled LPG end-users, auto-gas end-users, etc. It also trades in electronic products, such as integrated circuits and mobile phones. Further, it is involved in the property investment and development activities. The company is headquartered in Wanchai, Hong Kong. NewOcean Energy Holdings Limited is a subsidiary of Uniocean Investments Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "0567.HK": {
        "short_name": "DAISHOMICROLINE",
        "long_name": "Daisho Microline Holdings Limited",
        "summary": "Daisho Microline Holdings Limited, an investment holding company, manufactures and trades in printed circuit boards. The company is also involved in the trading of petroleum and energy products, and related business; and vessel chartering and property holding activities. It has operations in the People's Republic of China, Hong Kong, Singapore, North America, Japan, Europe, and internationally. The company is headquartered in Chai Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Chai Wan"
    },
    "0852.HK": {
        "short_name": "STRONG PETRO",
        "long_name": "Strong Petrochemical Holdings Limited",
        "summary": "Strong Petrochemical Holdings Limited, an investment holding company, engages in trading crude oil, iron ore, petroleum, petrochemical, and coal products. The company is also involved in the provision of storage services for petroleum products and petrochemicals. It offers its products in the People's Republic of China, France, Japan, and Vietnam. The company was founded in 1999 and is headquartered in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Admiralty"
    },
    "0V4.F": {
        "short_name": "VALVOLINE INC.  DL-,01",
        "long_name": "Valvoline Inc.",
        "summary": "Valvoline Inc. manufactures, markets, and supplies, engine and automotive maintenance products and services. It operates through three segments: Quick Lubes, Core North America, and International. The company offers lubricants for passenger car, light duty, and heavy duty; antifreeze/coolants for original equipment manufacturers; functional and maintenance chemicals, such as brake fluids and power steering fluids, as well as specialty coatings for automotive and industrial applications comprising rust prevention and sound absorption; and oil and air filters for light-duty vehicles. It also provides windshield wiper blades, light bulbs, serpentine belts, and drain plugs. In addition, the company operates Valvoline instant oil change service centers. As of October 28, 2020, it operated and franchised approximately 1,500 quick-lube locations under the Valvoline Instant Oil Change brand in the United States and the Great Canadian Oil Change brand in Canada. The company also serves car dealers, general repair shops, and third-party quick lube locations, as well as through distributors. It has operations in North America, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. Valvoline Inc. was founded in 1866 and is headquartered in Lexington, Kentucky.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Lexington"
    },
    "1142.HK": {
        "short_name": "SIBERIAN MINING",
        "long_name": "Siberian Mining Group Company Limited",
        "summary": "Siberian Mining Group Company Limited, an investment holding company, trades in gasoline in the Republic of Korea. It operates through Mining; and Mineral Resources, Commodities and Other Trading segments. The company is also involved in the trading of commodities and mineral resources. In addition, it holds coal mining and exploration rights in Russia. The company was incorporated in 2002 and is headquartered in Causeway Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Causeway Bay"
    },
    "128820.KS": {
        "short_name": "DAESUNGIND",
        "long_name": "Daesung Industrial Co., Ltd.",
        "summary": "Daesung Industrial Co., Ltd. engages in the retail sale and distribution of energy in South Korea. The company is involved in operating 40 petroleum stations and 15 LP gas filling stations; supplying various vehicle and industrial fuels, energy to heat houses, etc.; and heat absorption generating and oil field development activities. It also offers hydraulic and pneumatic pressure tools and appliances, geared motors, industrial robots, and industrial bearings; and computer systems, and network construction and consulting. In addition, the company constructs apartment houses; and distributes food products, such as olive oil, honey, organic green tea and rice, coffee, baby food, sweet potato, etc. under the Nature's Food brand name. Daesung Industrial Co., Ltd. was founded in 1968 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "2170.SR": {
        "short_name": "Alujain Holding  Corp.",
        "long_name": "Alujain Holding Corporation",
        "summary": "Alujain Holding Corporation manufactures and sells home care products in Saudi Arabia. It operates in two segments, Investments and Manufacturing Home-Care Products. The company offers home care products, such as spray starches and air fresheners; insecticides; and agricultural pesticides. It also manufactures petrochemical products. The company was formerly known as Alujain Corporation and changed its name to Alujain Holding Corporation in February 2020. Alujain Holding Corporation was founded in 1991 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "2728.HK": {
        "short_name": "JINTAI ENERGY H",
        "long_name": "Jintai Energy Holdings Limited",
        "summary": "Jintai Energy Holdings Limited, an investment holding company, engages in energy trading business primarily in the People's Republic of China. Its energy trading activities primarily comprise trading of fuel oil, kerosene, and chemical products. The company is also involved in the manufacture and trading of speakers; asset management businesses; and operation of an oil trade center. In addition, it provides oil and gas development engineering construction, and technical services, including geochemical exploration, drilled wells, test logging, downhole special operation, engineering building design, and construction services, as well as related oil and gas development technology research and development, and services. The company was formerly known as Yuhua Energy Holdings Limited and changed its name to Jintai Energy Holdings Limited in February 2020. Jintai Energy Holdings Limited was founded in 1990 and is headquartered in Dongying, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Dongying"
    },
    "300839.SZ": {
        "short_name": "NINGBO BOHUI CHEMI",
        "long_name": "Ningbo Bohui Chemical Technology Co.,Ltd",
        "summary": "Ningbo Bohui Chemical Technology Co.,Ltd produces and sells aromatics, fuel oil, hydrocarbons, and other products in China. It offers rubber chemicals, plastic additives, asphalt additives, lubricant additives, and light fuel oil products. The company provides its products for use in rubber, plastic, asphalt, and lubrication oil processing, and other fields. It was formerly known as Ningbo Bohui Petrochemical Co., Ltd. and changed its name to Ningbo Bohui Chemical Technology Co.,Ltd in March 2014. The company was founded in 2005 and is based in Ningbo, China. Ningbo Bohui Chemical Technology Co.,Ltd operates as a subsidiary of Ningbo Wenkui Holding Group Co.,Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Ningbo"
    },
    "4QVA.F": {
        "short_name": "SIAMGAS+PETRO.NVDRS BA0,5",
        "long_name": "Siamgas and Petrochemicals Public Company Limited",
        "summary": "Siamgas and Petrochemicals Public Company Limited, together with its subsidiaries, trades in liquefied petroleum gas (LPG) and petrochemical products in Thailand and internationally. The company operates through Petroleum and Petrochemical Products, Transportation Services, and Other segments. It is also involved in the trading of petroleum for household cooking, industry, and transportation sectors. In addition, the company provides transportation services by land and ship; manufactures and distributes LPG cylinders; and offers warehousing and storage, and oil depots and port services. The company was formerly known as VSPP Development Company Limited. Siamgas and Petrochemicals Public Company Limited was founded in 2001 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "4QVB.SG": {
        "short_name": "Siamgas & Petrochemicals PCL Re",
        "long_name": "Siamgas and Petrochemicals Public Company Limited",
        "summary": "Siamgas and Petrochemicals Public Company Limited, together with its subsidiaries, trades in liquefied petroleum gas (LPG) and petrochemical products in Thailand and internationally. The company operates through Petroleum and Petrochemical Products, Transportation Services, and Other segments. It is also involved in the trading of petroleum for household cooking, industry, and transportation sectors. In addition, the company provides transportation services by land and ship; manufactures and distributes LPG cylinders; and offers warehousing and storage, and oil depots and port services. The company was formerly known as VSPP Development Company Limited. Siamgas and Petrochemicals Public Company Limited was founded in 2001 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "5008.T": {
        "short_name": "TOA OIL COMPANY LIMITED",
        "long_name": "TOA Oil Co., Ltd.",
        "summary": "TOA Oil Co., Ltd., together with its subsidiaries, engages in petroleum refining and power generation business in Japan. The company offers various oil products, such as gasoline, kerosene, diesel oil and heavy oil. The company was formerly known as Nippon Jyuyu Co., Ltd. and changed its name to TOA Oil Co., Ltd. in April 1942. The company was founded in 1924 and is headquartered in Kawasaki, Japan. TOA Oil Co., Ltd. is a subsidiary of Showa Shell Sekiyu K.K.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kawasaki"
    },
    "5009.T": {
        "short_name": "FUJI KOSAN COMPANY",
        "long_name": "Fuji Kosan Company, Ltd.",
        "summary": "Fuji Kosan Company, Ltd. supplies petroleum products in Japan. The company offers fuel oils, such as kerosene, light oil, and heavy oil; asphalt products, including straight asphalt, additives for asphalt regeneration, and asphalt adhesion inhibitors, as well as provides materials for manufacturing asphalt road paving and other road materials. It also provides automobiles, agricultural machinery, marine, and industrial lubricants, as well as lubricating oil for raw materials and rubber. In addition, the company offers AdBlue, a commodity for purifying the diesel exhaust gas; and solar power generation systems. Fuji Kosan Company, Ltd. was founded in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "5010.T": {
        "short_name": "NIPPON SEIRO CO",
        "long_name": "Nippon Seiro Co., Ltd.",
        "summary": "Nippon Seiro Co., Ltd. manufactures and sells petroleum waxes, physically and chemically converted wax products, and fuel oil in Japan and internationally. It offers paraffin wax, microcrystalline wax, oxidized and chemical wax, special wax, anti-ozonant wax, and wax emulsion. The company provides its products in slab, pellet, powder, and granule forms for use in various applications, such as hotmelt adhesives, paper cups, plastic lubricants, paper converting, rubber anti-ozonants, polishes, cosmetics and pharmaceuticals, candles, water proof corrugated paperboards, chlorinated paraffins, matches, rust prevention, plywood, textiles, electric insulation, modification of paraffin wax, laminations, chewing gums, water repellents, inks, binders, slip agents, ink additives, toners, release agents, rubbers and tires, polymer additive agents, and paraffin wax reformers. Nippon Seiro Co., Ltd. was founded in 1929 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "5015.T": {
        "short_name": "BP CASTROL KK",
        "long_name": "BP Castrol K.K.",
        "summary": "BP Castrol K.K. manufactures and sells automotive lubricants in Japan. It sells its products under the BP and Castrol brand names to car dealers. The company was incorporated in 1978 and is headquartered in Tokyo, Japan. BP Castrol K.K. is a subsidiary of Castrol Limited.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "5019.T": {
        "short_name": "IDEMITSU KOSAN CO.LTD",
        "long_name": "Idemitsu Kosan Co.,Ltd.",
        "summary": "Idemitsu Kosan Co.,Ltd. manufactures and sells fuel oils and lubricant oils in Japan and internationally. It operates through Petroleum, Basic Chemicals, Functional Materials, Power and Renewable Energy, and Resources segments. The company's Petroleum segment engages in the procurement and sale of crude oil and refining of petroleum products; gasoline, diesel oil, kerosene, and automotive lubricants to service stations; and industrial kerosene, diesel oil, and heavy oil, and aviation and marine fuel. Its Basic Chemicals segment manufactures and sells olefins, such as ethylene, propylene, and butadiene; aromatics, including benzene, styrene monomer, mixed xylene, and paraxylene; and other chemicals. The company's Functional Materials segment researches, develops, manufactures, and sells automotive, marine, and industrial lubricants, as well as grease; engineering plastic, adhesive materials, derivative products, and solvents; electronic materials, such as OLED; asphalt; microbial pesticides, soil amendments, and livestock related materials; and solid state lithium ion battery materials. Its Power and Renewable Energy segment operates thermal power plants; develops and operates renewable energy sources, including solar, wind, and biomass power plants; engages in the supply, wholesale, and retail of electric power; researches, develops, and manufactures CIS thin-film solar modules; and sale of solar power systems. The company Resources segments explores, develops, and produces oil and gas; produces and sells coal and uranium; operates geothermal power plants; and sale of electric power and steam. Idemitsu Kosan Co.,Ltd. was founded in 1911 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "5020.T": {
        "short_name": "ENEOS HOLDINGS INC",
        "long_name": "ENEOS Holdings, Inc.",
        "summary": "ENEOS Holdings, Inc., through its subsidiaries, engages in the energy, oil and natural gas exploration and production (E&P), and metals businesses Japan, China, and internationally. The company operates through Energy, Oil and Natural Gas E&P, Metals, and Other segments. It manufactures and sells petroleum products, including gasoline, kerosene, lubricants, etc., as well as petrochemicals; imports and sells gas, such as LNG and liquefied petroleum gas; and offers copper concentrate, electrolytic coppers, electronic materials, etc. The company also explores, develops, produces, and sells crude oil, natural gas, other mineral resources, etc.; develops and mines nonferrous metals resources; refines and markets copper, gold, silver, sulfuric acid, copper foils, materials for rolling and processing, and thin film materials; recycles nonferrous metals; treats industrial waste; and generates and supplies electricity. In addition, it engages in the asphalt paving, civil engineering, construction, land transportation, and fund procurement businesses, as well as transportation by ships of non-ferrous metal products, titanium, and electric wires. Further, the company stores and transports crude oil and petroleum products; leases automobile-related supplies and goods; and purchases, leases, manages, and sells real estate properties. Additionally, it provides financial, accounting, salary and welfare, researching, studying, evaluating, designing and planning, and consulting services. The company was formerly known as JXTG Holdings, Inc. and changed its name to ENEOS Holdings, Inc. in June 2020. ENEOS Holdings, Inc. was founded in 1888 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "600688.SS": {
        "short_name": "SINOPEC SHANGHAI PETROCHEMICAL ",
        "long_name": "Sinopec Shanghai Petrochemical Company Limited",
        "summary": "Sinopec Shanghai Petrochemical Company Limited, together with its subsidiaries, manufactures and sells petrochemical products in the People's Republic of China. It operates through five segments: Synthetic Fibres, Resins and Plastics, Intermediate Petrochemical Products, Petroleum Products, and Trading of Petrochemical Products. The Synthetic Fibres segment produces polyesters, acrylic fibers, and carbon fibers that are primarily used in the textile and apparel industries. The Resins and Plastics segment produces polyester chips that are used to produce polyester fibers, coating, and containers; polyethylene resins and plastics, which are used to produce insulated cables and mulching films, as well as molded products, such as housewares and toys; and polypropylene resins that are used for films and sheets, as well as molded products, such as housewares, toys, consumer electronics, and automobile parts; and PVA granules. The Intermediate Petrochemical Products segment produces p-xylene, benzene, and ethylene oxide, which are used as raw materials in the production of other petrochemicals, resins, plastics, and synthetic fibers. The Petroleum Products segment operates crude oil distillation facilities that produce vacuum and atmospheric gas oils used as feedstock; and residual oil and low octane gasoline fuels, as well as produces various fuels, such as diesel oil, jet fuel, heavy oil, and liquefied petroleum gas for transportation, industry, and household heating applications. The Trading of Petrochemical Products segment is involved in the import and export of petrochemical products. The company was founded in 1972 and is based in Shanghai, the People's Republic of China. Sinopec Shanghai Petrochemical Company Limited is a subsidiary of China Petroleum & Chemical Corporation.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "603003.SS": {
        "short_name": "SHANGHAI LONYER FUELS CO LTD",
        "long_name": "Shanghai Lonyer Fuels Co., Ltd.",
        "summary": "Shanghai Lonyer Fuels Co., Ltd. trades in oil products in China. The company has an oil storage base with a total capacity of approximately 70,000 cubic meters, as well as five refined oil transportation vessels and refueling vessels for oil trading, maritime transportation, and water refueling. The company also engages in the non-ferrous metals trading business; and provision of cloud data infrastructure services. The company was founded in 1997 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "603906.SS": {
        "short_name": "JIANGSU LOPAL TECH CO LTD",
        "long_name": "JIANGSU LOPAL TECH.CO.,Ltd.",
        "summary": "Jiangsu Lopal Tech.Co.,Ltd., an independent oil company, provides automotive and industrial lubricants, and automotive chemicals in China. The company's primary products include motor gasoline engine oil, diesel oil, car care products, vehicles, gear oil, hydraulic oil, antifreeze, brake fluid, grease, motorcycle oil, engineering machinery lubricants, etc. It operates under the Lung Poon, Kan Lan Su, and 3ECARE brands. The company was formerly known as Jiangsu Lung Poon Petrochemical Co., Ltd. Jiangsu Lopal Tech.Co.,Ltd. was founded in 2003 and is headquartered in Nanjing, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Nanjing"
    },
    "6239.T": {
        "short_name": "NAGAOKA INTERNATIONAL CORPORATI",
        "long_name": "Nagaoka International Corporation",
        "summary": "Nagaoka International Corporation develops and sells water intake and treatment systems, and screen internals to oil refining and petrochemical industries worldwide. It offers screen internals for oil refining, and petrochemical and chemical fertilizer complexes. The company also provides screens used for groundwater intake purposes; and CHEMILES, a groundwater treatment system that is used in food processing, linen industry, hospitals, and other applications. In addition, it provides HiSIS, which is high-speed seabed infiltration system for seawater desalination; and ENERLES, a water treatment system for dam water. The company was founded in 1934 and is headquartered in Osaka, Japan. Nagaoka International Corporation is a subsidiary of HAMADA Co., Ltd.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "6505.TW": {
        "short_name": "FORMOSA PETROCHEMICAL CORPORATI",
        "long_name": "Formosa Petrochemical Corporation",
        "summary": "Formosa Petrochemical Corporation engages in the petrochemical and public utility businesses in Taiwan, the Philippines, Singapore, Malaysia, the People's Republic of China, Korea, and internationally. The company produces and sells petroleum and petrochemical products. Its products include gasoline; diesel; liquefied petroleum gas; jet fuel/kerosene; naphtha; petrochemical raw materials, such as ethylene, propylene, butadiene, and riffinate-1; fuel oil/asphalt/sulfur fuel oil; base oil; and lubricants. The company also explores and produces oil and gas; produces and sells water, electricity, and steam; and leases ships, as well as offers transportation services. Formosa Petrochemical Corporation was founded in 1992 and is headquartered in Mailiao, Taiwan.",
        "currency": "TWD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Mailiao"
    },
    "71S.SG": {
        "short_name": "Surya Esa Perkasa Tbk PT Regist",
        "long_name": "PT Surya Esa Perkasa Tbk",
        "summary": "PT Surya Esa Perkasa Tbk engages in purification and processing of natural gas in Indonesia. The company operates through LPG Refinery, Ammonia, and Others segments. It offers LPG primarily for use as a kitchen appliance fuel for homes, shopping centers, and hotels; and motor vehicle fuel, as well as for construction industries such as steel workshop as welding fuel. The company also provides propane; condensate for use as a raw material for thinner, glue, and vehicle tires applications, as well as light naphtha, which is a cracker material for the manufacture of polyethylene; and ammonia that is used as a raw material for fertilizer production, pharmaceutical, food and beverage, textile, industrial and household cleaning, water and wastewater treatment, metallurgical processes, pulp and paper, leather, rubber, and other applications.In addition, it offers management and business consulting services; operates an ammonia plant; and sells raw feed gas through pipelines. PT Surya Esa Perkasa Tbk was founded in 2006 and is headquartered in Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "7462.T": {
        "short_name": "DAIYA TSUSHO",
        "long_name": "Daiya Tsusho Co.,Ltd.",
        "summary": "Daiya Tsusho Co.,Ltd. engages in the wholesale and direct sale of petroleum products in Japan. The company operates seven service stations in the Tokyo metropolitan area. It also operates community-based and specialized bicycle stores; and manages and rents office and store buildings. The company was founded in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7486.T": {
        "short_name": "SANRIN CO LTD",
        "long_name": "Sanrin Co., Ltd.",
        "summary": "Sanrin Co., Ltd. manufactures and sells briquette, bean coal, petroleum, LP gas, and other fuel products in Japan. It offers petroleum products, including gasoline, white kerosene, light oil, heavy oil, lubricates, and other products; LP gas for household, commercial, automobile, and industrial uses; and oxygen, nitrogen, and laughing gases, as well as other general high-pressure gases. The company also supplies hot pot, oil FF heaters, bathtub boilers, water heaters, LP gas/table water heaters, rice cookers, stoves, and machine bath kettles; and household equipment comprising bathtubs, washbasin units, sinks, clean flush toilets, septic tanks, solar hot water systems, central cleaner exhaust fans, ventilators, commercial kitchen equipment, and system kitchen and bath units. In addition, it provides solar power generation system and fuel cells; refrigerators, air-conditioners, fans, radiators, pump and cooling towers, warm-up machines, and other cold equipment; LP gas supply equipment, including propane containers, fuse cocks, regulators, steel pipes, and microcomputer gas meters; and household goods, such as gas leak alarms, fire alarms, anti-freeze products, and other consumer home appliances. Further, the company offers tires, car air-conditioners, batteries, and other car accessories; and high pressure gas equipment for industrial and medical purposes, as well as operates golf practice fields. Additionally, it designs and constructs air-conditioning and hot water supply facility construction; housing renovations; and high-pressure gas facilities for oxygen. Sanrin Co., Ltd. was founded in 1934 and is headquartered in Higashichikuma, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Higashichikuma-gun"
    },
    "7BP.F": {
        "short_name": "BANGCHAK CORP. -FGN- BA 1",
        "long_name": "Bangchak Corporation Public Company Limited",
        "summary": "Bangchak Corporation Public Company Limited, an energy company, engages in the refining and marketing of petroleum products. It operates through Refinery and Oil Trading, Marketing, Electricity, Bio-Based Product, Natural Resource, and Other segments. The company explores and produces petroleum, biodiesel, and ethanol; produces electricity through solar, wind, and geothermal; mines lithium; and operates service stations. The company markets its oil products to various sectors, including transportation, aviation, shipping, construction, industrial, and agriculture sectors through oil traders. It operates in Thailand, Malaysia, Japan, Korea, the Philippines, Singapore, Indonesia, Norway, and internationally. The company was formerly known as The Bangchak Petroleum Public Company Limited and changed its name to Bangchak Corporation Public Company Limited in April 2017. Bangchak Corporation Public Company Limited was founded in 1984 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "7BP1.SG": {
        "short_name": "Bangchak Corporation PCL Reg. S",
        "long_name": "Bangchak Corporation Public Company Limited",
        "summary": "Bangchak Corporation Public Company Limited, an energy company, engages in the refining and marketing of petroleum products. It operates through Refinery and Oil Trading, Marketing, Electricity, Bio-Based Product, Natural Resource, and Other segments. The company explores and produces petroleum, biodiesel, and ethanol; produces electricity through solar, wind, and geothermal; mines lithium; and operates service stations. The company markets its oil products to various sectors, including transportation, aviation, shipping, construction, industrial, and agriculture sectors through oil traders. It operates in Thailand, Malaysia, Japan, Korea, the Philippines, Singapore, Indonesia, Norway, and internationally. The company was formerly known as The Bangchak Petroleum Public Company Limited and changed its name to Bangchak Corporation Public Company Limited in April 2017. Bangchak Corporation Public Company Limited was founded in 1984 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "8037.T": {
        "short_name": "KAMEI CORP",
        "long_name": "Kamei Corporation",
        "summary": "Kamei Corporation operates as a general trading company in Japan and internationally. The company operates through Corporate Sales, Residential, Carlife, Food, Construction Materials, and Pharmacy divisions. It provides eco-friendly products, including LED lighting, eco pumps, and warm glasses; energy management-related products, such as solar power generation systems, lithium-ion storage batteries, etc.; chemical products comprising industrial chemicals, water treatment agents, alcohol, etc.; industrial materials and equipment consisting of logistics materials, compressors, generators, Karcher products, etc.; office supplies; ICT solutions and services; insurance products; and emergency earthquake warning systems, fire extinguishers, and fire-extinguishing equipment. The company also supplies automobile and industrial lubricants, oil products, LNG and LPG products, and home-use propane gas and kerosene; kitchen and hot water supply systems, as well as equipment; household fuel cells; built-in kitchens and baths; and alcoholic beverages, soft drinks, food products, restaurant ingredients, processing ingredients, etc. In addition, it operates a network of service stations that offer refueling services, as well as car wash, tire change, oil change, safety and vehicle inspection, coating, and other maintenance services; provides auto leasing services; and undertakes steel frame, exterior cladding, and metal siding construction works. Further, the company operates pharmacies; and offers renovation services. As of October 1, 2020, it operated 291 gas stations, 34 oil depots, 16 gas terminals, 6 automobile LPG stations, 2 food distribution centers, 104 pharmacies, and 1 supermarket. The company was formerly known as Kamei Shoten Co. and changed its name to Kamei Corporation in 1985. Kamei Corporation was founded in 1903 and is headquartered in Sendai, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Sendai"
    },
    "8097.T": {
        "short_name": "SAN-AI OIL CO",
        "long_name": "San-Ai Oil Co.,Ltd.",
        "summary": "San-Ai Oil Co.,Ltd. engages in the wholesale and retail of petroleum products and liquefied petroleum gas. The company is also involved in the storage and related operation of petroleum products; gas pipeline service business; and general and community gas utility business. In addition, it engages in the aviation fuel storage facility and into-plane fuel service operations; sale and operation of energy-saving devices; design, construction, and consulting of airport fuel storage and hydrant systems; and generation and sale of electric power. Further, the company offers chemical products, including solvent and industrial chemicals, biocide products, microbial commissioned test products, commercial car wash products, fire extinguishing agents, and other chemical products. San-Ai Oil Co.,Ltd. was incorporated in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8132.T": {
        "short_name": "SINANEN HOLDINGS CO LTD",
        "long_name": "Sinanen Holdings Co., Ltd.",
        "summary": "Sinanen Holdings Co., Ltd. engages in the energy and non-energy related businesses in Japan and internationally. It provides products and services related to energy, such as LP gas and kerosene; and solutions comprising renovation and housing equipment, as well as housework and house cleaning services. The company also offers petroleum products to corporate customers that include gasoline, kerosene, diesel oil and fuel oil sales, and LP gas. In addition, it provides support for reducing energy costs and CO2 emissions, consultation for energy savings facilities, and electricity sales. Further, the company is involved in the retail of electricity to companies, local municipalities, public offices, and schools; and supply of fuel to ships. Additionally, it provides inorganic antimicrobial agents for various purposes, such as resin, fiber, and paint; ERP systems for the LP gas business; waste recycled fuels and materials comprising wood chips and recycled fuels, such as waste plastic and paper, and intermediate processing system of various mixed waste; coal consumer use; a range of services, including maintenance, management, and operation of buildings, cleaning, security, various construction works, material supply, and energy-related services. It also engages in the import and sale of bicycles; maintenance of apartments/condominiums; and installation, maintenance, and follow-up of air-conditioning, floor heating, and heat source equipment for detached/apartment houses. The company was formerly known as Sinanen Co., Ltd. and changed its name to Sinanen Holdings Co., Ltd. in October 2015. Sinanen Holdings Co., Ltd. was founded in 1927 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8133.T": {
        "short_name": "ITOCHU ENEX CO LTD",
        "long_name": "Itochu Enex Co.,Ltd.",
        "summary": "Itochu Enex Co.,Ltd. engages in the sale of petroleum and gas businesses in Japan and internationally. It operates through four divisions: Home-Life, Car-Life, Industrial Business, and Power & Utility. The Home-Life division is involved in the sale of liquefied petroleum gas (LPG), town gas, industrial gas, and specialty gas, electricity, and kerosene; gas for medical and automotive usage; household and smart energy equipment; solar power systems; ENEFARM residential fuel cells; ENE-POWABOL residential lithium-ion electricity storage systems; and welding materials, as well as supply of LPG and city gas to 1.5 million customers. This segment also engages in the remodeling and gas container pressure resistance inspection businesses. The Car-Life division sells gasoline, kerosene, diesel oil, electricity, automobiles, and lifestyle and automotive products; offers credit card services; and rents cars and terminal tanks, as well as engages in the import/export and trading of petroleum products. This segment also operates approximately 1,700 car-life stations and 420 rent-a-car service stores. The Industrial Business division sells gasoline, kerosene, diesel and fuel oil, GTL fuel, marine fuel, LPG, corporate fleet refueling card, and asphalt, as well as high-grade urea solution under the AdBlue name; and engages in the recycling of fly ash, and recovery and recycling of slop businesses. The Power & Utility division engages in the sale of electricity from coal-fired, natural gas-fired, wind, hydro, and photovoltaic power; and sells steam. This segment also offers district heating, energy, electricity/heat supply, and electricity power supply/demand management, as well as asset management services. The company was formerly known as Itochu Fuel Corporation and changed its name to Itochu Enex Co.,Ltd. in July 2001. The company was founded in 1961 and is headquartered in Tokyo, Japan. Itochu Enex Co.,Ltd. is a subsidiary of ITOCHU Corporation.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8479.HK": {
        "short_name": "JTF INTL",
        "long_name": "JTF International Holdings Limited",
        "summary": "JTF International Holdings Limited, an investment holding company, engages in blending and selling fuel oil; and selling refined oil and other petrochemical products in the People's Republic of China. The company was incorporated in 2014 and is headquartered in Guangzhou, China. JTF International Holdings Limited is a subsidiary of Thrive Shine Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "AKRA.JK": {
        "short_name": "AKR Corporindo Tbk.",
        "long_name": "PT AKR Corporindo Tbk",
        "summary": "PT AKR Corporindo Tbk, a logistics and supply chain company, distributes and trades in petroleum and basic chemical products primarily in Indonesia. The company operates in four segments: Trading and Distribution, Logistics Services, Manufacturing, and Industrial Estate. The Trading and Distribution segment distributes petroleum products and various basic chemicals, such as caustic soda, sodium sulphate, PVC resins, and soda ash. The Logistics Services segment provides various logistics services, including rental of storage tanks and warehouses, bagging, port handling, and transportation services primarily for liquid and solid chemical, and petroleum products in Indonesia. The Manufacturing segment produces and sells adhesive materials. The Industrial Estate segment develops industrial and port estates. The company was formerly known as PT Aneka Kimia Raya Tbk and changed its name to PT AKR Corporindo Tbk in September 2004. PT AKR Corporindo Tbk was founded in 1977 and is headquartered in Jakarta, Indonesia. PT AKR Corporindo Tbk is a subsidiary of PT Arthakencana Rayatama.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "ALD.AX": {
        "short_name": "AMPOL FPO",
        "long_name": "Ampol Limited",
        "summary": "Ampol Limited engages in purchasing, refining, and distributing petroleum products in Australia, New Zealand, and Singapore. The company operates through Convenience Retail, and Fuels & Infrastructure segments. The Convenience Retail segment sells fuels through a Caltex network of stores. The Fuels and Infrastructure segment wholesales fuels and lubricants. It distributes its products through a network of depots, diesel stops, marine facilities, and service station sites. The company was formerly known as Caltex Australia Limited and changed its name to Ampol Limited in May 2020. Ampol Limited was founded in 1900 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "AMTX": {
        "short_name": "Aemetis, Inc",
        "long_name": "Aemetis, Inc.",
        "summary": "Aemetis, Inc. operates as a renewable fuels and bio-chemicals company in North America and India. The company focuses on the acquisition, development, and commercialization of various technologies that replace traditional petroleum-based products primarily through the conversion of ethanol and biodiesel plants into advanced bio refineries. It owns and operates an ethanol facility in the California Central Valley near Modesto; and a renewable chemical and advanced fuel production facility on the East Coast of India. The company sells biodiesel and refined glycerin to transport companies, resellers, distributors, and refiners through its sales force and independent sales agents, as well as to brokers who resell the product to end-users. It also produces ethanol; and wet distiller's grains, distiller's corn oil, and condensed distillers solubles to dairies and feedlots as animal feed. In addition, it produces dairy biogas; and high-grade sanitizer alcohol and various feed products. The company was formerly known as AE Biofuels, Inc. and changed its name to Aemetis, Inc. in November 2011. Aemetis, Inc. was founded in 2005 and is headquartered in Cupertino, California.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Cupertino"
    },
    "BCP-R.BK": {
        "short_name": "BANGCHAK CORPORATION PUBLIC COM",
        "long_name": "Bangchak Corporation Public Company Limited",
        "summary": "Bangchak Corporation Public Company Limited, an energy company, engages in the refining and marketing of petroleum products. It operates through Refinery and Oil Trading, Marketing, Electricity, Bio-Based Product, Natural Resource, and Other segments. The company explores and produces petroleum, biodiesel, and ethanol; produces electricity through solar, wind, and geothermal; mines lithium; and operates service stations. The company markets its oil products to various sectors, including transportation, aviation, shipping, construction, industrial, and agriculture sectors through oil traders. It operates in Thailand, Malaysia, Japan, Korea, the Philippines, Singapore, Indonesia, Norway, and internationally. The company was formerly known as The Bangchak Petroleum Public Company Limited and changed its name to Bangchak Corporation Public Company Limited in April 2017. Bangchak Corporation Public Company Limited was founded in 1984 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "BCP.BK": {
        "short_name": "BANGCHAK CORPORATION PUBLIC COM",
        "long_name": "Bangchak Corporation Public Company Limited",
        "summary": "Bangchak Corporation Public Company Limited, an energy company, engages in the refining and marketing of petroleum products. It operates through Refinery and Oil Trading, Marketing, Electricity, Bio-Based Product, Natural Resource, and Other segments. The company explores and produces petroleum, biodiesel, and ethanol; produces electricity through solar, wind, and geothermal; mines lithium; and operates service stations. The company markets its oil products to various sectors, including transportation, aviation, shipping, construction, industrial, and agriculture sectors through oil traders. It operates in Thailand, Malaysia, Japan, Korea, the Philippines, Singapore, Indonesia, Norway, and internationally. The company was formerly known as The Bangchak Petroleum Public Company Limited and changed its name to Bangchak Corporation Public Company Limited in April 2017. Bangchak Corporation Public Company Limited was founded in 1984 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "BDCO": {
        "short_name": "BLUE DOLPHIN ENERGY CO",
        "long_name": "Blue Dolphin Energy Company",
        "summary": "Blue Dolphin Energy Company engages in the refining and marketing of petroleum products in the United States. The company operates in two segments, Refinery Operations and Tolling and Terminaling. It produces finished products, including jet fuel, as well as intermediate products, such as naphtha, atmospheric gas oil, and heavy oil-based mud blendstock; and conducts tolling and storage terminaling services under third party lease agreements at the Nixon facility. The company was founded in 1986 and is headquartered in Houston, Texas. Blue Dolphin Energy Company is a subsidiary of Lazarus Energy Holdings, LLC.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "BMI.F": {
        "short_name": "BP PRUDHOE BAY ROLTY UBI",
        "long_name": "BP Prudhoe Bay Royalty Trust",
        "summary": "BP Prudhoe Bay Royalty Trust operates as a grantor trust in the United States. The company holds overriding royalty interest comprising a non-operational interest in minerals in the Prudhoe Bay oil field located on the North Slope of Alaska. The Prudhoe Bay field extends approximately 12 miles by 27 miles and contains approximately 150,000 gross productive acres. As of December 31, 2019, its estimated proved reserves were 4.465 million barrels of oil and condensate of which 4.394 million barrels are proved developed reserves; and 0.070 million barrels are proved undeveloped reserves. BP Prudhoe Bay Royalty Trust was founded in 1989 and is based in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Houston"
    },
    "BMT.SI": {
        "short_name": "New Silkroutes",
        "long_name": "New Silkroutes Group Limited",
        "summary": "New Silkroutes Group Limited, an investment holding company, primarily operates in the healthcare and energy sectors. It operates in Trading of Oil and Gas, and Healthcare segments. The Trading of Oil and Gas segment trades in petrochemical products; generates power; and invests in strategic petrochemical assets. The Healthcare segment owns and operates primary care medical and dental clinics; and provides hospital development and management services. It owns 16 clinics comprising one dental specialist clinic, eight dental clinics, five family medicine clinics, one aesthetic clinic, and one traditional Chinese medicine clinic. This segment also runs employee healthcare benefits programs; offers systems integration services to hospitals and healthcare facilities; distributes dental and medical supplies; and manufactures disposable medical consumables, such as hospital gowns, linen, personal protective equipment, and masks. It also distributes health supplements and Chinese proprietary medicines; provides clinical management and healthscience consultancy services; and offers business, management, and investment consultancy, as well as management services. In addition, the company is involved in the wholesale and retail trading of crude oil, intermediate fuel oil, and other distillates; and chartering of ships. It has operations in Australia, Cambodia, China, India, Singapore, South Korea, Switzerland, the United Arab Emirates, and Vietnam. The company was formerly known as Digiland International Limited and changed its name to New Silkroutes Group Limited in July 2015. New Silkroutes Group Limited was incorporated in 1994 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "BPCL.NS": {
        "short_name": "BHARAT PETROL CORP",
        "long_name": "Bharat Petroleum Corporation Limited",
        "summary": "Bharat Petroleum Corporation Limited refines crude oil and markets petroleum products in India. The company operates through two segments, Downstream Petroleum; and Exploration and Production of Hydrocarbons. It operates fuel stations that sell petrol, diesel, automotive liquefied petroleum gas (LPG), and compressed natural gas. The company has a network of 15,402 fuel stations with 13,648 fully automated fuel stations. The company also provides Bharatgasfuels to approximately 40 million homes; MAK Lubricants, such as automotive engine oils, gear oils, greases, and specialties; and jet fuel and services to airlines, as well as operates oil refineries in Mumbai, Bina, Numaligarh, and Kochi. In addition, it offers industrial fuels products, such as gases, naphtha, diesel, kerosene, white oil, black oil, furnace oil, bitumen, sulphur, and solvents and special products, as well as industrial lubricants. Further, the company has participating interests in 27 blocks, including 15 blocks in India and 12 blocks in other countries; imports and exports of other petroleum products; and owns a network of 2,241 km of multi-product pipelines, as well as engages in the natural gas business. The company was formerly known as Bharat Refineries Limited and changed its name to Bharat Petroleum Corporation Limited in August 1977. Bharat Petroleum Corporation Limited was incorporated in 1952 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "BPT": {
        "short_name": "BP Prudhoe Bay Royalty Trust",
        "long_name": "BP Prudhoe Bay Royalty Trust",
        "summary": "BP Prudhoe Bay Royalty Trust operates as a grantor trust in the United States. The company holds overriding royalty interest comprising a non-operational interest in minerals in the Prudhoe Bay oil field located on the North Slope of Alaska. The Prudhoe Bay field extends approximately 12 miles by 27 miles and contains approximately 150,000 gross productive acres. As of December 31, 2019, its estimated proved reserves were 4.465 million barrels of oil and condensate of which 4.394 million barrels are proved developed reserves; and 0.070 million barrels are proved undeveloped reserves. BP Prudhoe Bay Royalty Trust was founded in 1989 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "C3Q1.F": {
        "short_name": "COSAN LTD A",
        "long_name": "Cosan Limited",
        "summary": "Cosan Limited, together with its subsidiaries, engages in fuel and natural gas distribution, logistics, lubricant, sugar, and ethanol businesses in Brazil, Europe, Latin America, North America, Asia, and internationally. It operates through RaÃ­zen Energia, RaÃ­zen CombustÃ­veis, ComgÃ¡s, Cosan LogÃ­stica, and Moove segments. The company's RaÃ­zen Energia segment produces and markets products derived from sugar cane, including raw sugar, anhydrous, and hydrated ethanol, as well as activities related to energy cogeneration from sugarcane bagasse. Its RaÃ­zen CombustÃ­veis segment engages in the distribution and marketing of fuels, primarily through a franchised network of service stations under the Shell brand in Brazil; petroleum refining; operation of fuel resellers, and convenience store businesses; and production and sale of liquefied petroleum gas, and automotive and industrial lubricants. The company's ComgÃ¡s segment distributes piped natural gas to customers in the industrial, residential, commercial, automotive, and cogeneration sectors in SÃ£o Paulo. Its Cosan LogÃ­stica segment provides logistics services for transport, storage, and port loading of commodities, primarily for sugar products; and leases locomotives, wagons, and other railway equipment. The company's Moove segment produces and distributes lubricants under the Mobil brand. It operates a network of approximately 7,270 service stations and 1,726 convenience stores, as well as 68 distribution terminals and 68 airports supplying jet fuel. The company was founded in 1936 and is based in SÃ£o Paulo, Brazil.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Brazil",
        "city": "SÃ£o Paulo"
    },
    "CAPL": {
        "short_name": "CrossAmerica Partners LP",
        "long_name": "CrossAmerica Partners LP",
        "summary": "CrossAmerica Partners LP engages in the wholesale distribution of motor fuels, and ownership and leasing of real estate used in the retail distribution of motor fuels in the United States. The company operates in two segments, Wholesale and Retail. The Wholesale segment engages in the wholesale distribution of motor fuels to lessee dealers, independent dealers, commission agents, and company operated retail sites. The Retail segment is involved in the sale of convenience merchandise items; and retail sale of motor fuels at company operated retail sites and retail sites operated by commission agents. As of April 14, 2020, the company distributed fuel to approximately 1,700 locations; and owned or leased approximately 1,100 sites. CrossAmerica GP LLC operates as the general partner of the company. The company was formerly known as Lehigh Gas Partners LP and changed its name to CrossAmerica Partners LP in October 2014. CrossAmerica Partners LP was founded in 1992 and is based in Allentown, Pennsylvania.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Allentown"
    },
    "CHENNPETRO.NS": {
        "short_name": "CHENNAI PETRO CP",
        "long_name": "Chennai Petroleum Corporation Limited",
        "summary": "Chennai Petroleum Corporation Limited produces and sells petroleum products in India. Its principal products include liquefied petroleum gas, motor spirit, superior kerosene oil, aviation turbine fuel, high speed diesel, naphtha, bitumen, lube base stocks, paraffin wax, fuel oil, hexane, and petrochemical feed stocks. The company also provides furnace oil, LSHS, and light diesel oil; and non-fertilizer naptha, light and heavy extracts, LVI spindle, propylene, polybutyne feed-stock, butane, and linear alkyl benzene feedstock. It serves roadways, railways, and airways requirement of transportation fuel, as well as the fertilizer, power, and petrochemical industries. The company was formerly known as Madras Refineries Limited and changed its name to Chennai Petroleum Corporation Limited in June 2000. The company was founded in 1965 and is based in Chennai, India. Chennai Petroleum Corporation Limited is a subsidiary of Indian Oil Corporation Limited.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "CLNE": {
        "short_name": "Clean Energy Fuels Corp.",
        "long_name": "Clean Energy Fuels Corp.",
        "summary": "Clean Energy Fuels Corp. provides natural gas as an alternative fuel for vehicle fleets, primarily in the United States and Canada. The company supplies renewable natural gas (RNG), compressed natural gas (CNG), and liquefied natural gas (LNG) for light, medium, and heavy-duty vehicles; and offers operation and maintenance services for public and private vehicle fleet customer stations. It also designs, builds, operates, and maintains fueling stations; sells and services natural gas fueling compressors and other equipment that are used in CNG and LNG stations; and provides assessment, design, and modification solutions to offer operators with code-compliant service and maintenance facilities for natural gas vehicle fleets. In addition, the company transports and sells CNG and LNG through virtual natural gas pipelines and interconnects; procures and sells RNG; sells tradable credits, such as RNG and conventional natural gas as a vehicle fuel comprising Renewable Identification Numbers and Low Carbon Fuel Standards credits; enables its customers to acquire and finance natural gas vehicles; and obtains federal, state and local credits, grants, and incentives. It serves heavy-duty trucking, airports, refuse, public transit, industrial, and institutional energy users, as well as government fleets. As of December 31, 2019, the company served approximately 1,000 fleet customers operating approximately 48,000 natural gas vehicles; and owned, operated, or supplied approximately 550 natural gas fueling stations in 41 states in the United States and four provinces in Canada. Clean Energy Fuels Corp. was incorporated in 2001 and is headquartered in Newport Beach, California.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Newport Beach"
    },
    "CONFIPET.NS": {
        "short_name": "CONFIDENCE PETROL",
        "long_name": "Confidence Petroleum India Limited",
        "summary": "Confidence Petroleum India Limited manufactures and sells liquefied petroleum gas (LPG) cylinders in India. It operates through LPG/CNG Cylinder Manufacturing and LPG Bottling & Marketing segments. The company also offers CNG and packed cylinders. It also provides LPG bottling services; and supplies LPG for commercial usage. The company serves commercial and industrial customers under the GoGas, and retail customer under the GoGas Elite brand names. It operates approximately 209 auto LPG dispensing stations. Confidence Petroleum India Limited was founded in 1993 and is based in Nagpur, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Nagpur"
    },
    "CSAN3.SA": {
        "short_name": "COSAN       ON      NM",
        "long_name": "Cosan S.A.",
        "summary": "Cosan S.A., through its subsidiaries, primarily engages in the fuel distribution business in Brazil, Europe, Latin America, North America, Asia, and internationally. It operates through RaÃ­zen Energia, RaÃ­zen CombustÃ­veis, ComgÃ¡s, and Moove segments. The RaÃ­zen Energia segment produces and markets various products derived from sugar cane, including raw sugar, and anhydrous and hydrated ethanol. This segment also engages in activities related to energy cogeneration from sugarcane bagasse with an installed capacity of 981 MW; and holds interests in companies involved in research and development on new technology. The RaÃ­zen CombustÃ­veis segment distributes and markets fuels through a franchised network of service stations under the Shell brand. This segment also engages in the petroleum refining; operation of convenience stores; manufacture and sale of automotive and industrial lubricants; and production and sale of liquefied petroleum gas. In addition, this segment operates through approximately 6,400 fuel distribution service stations, 67 distribution terminals, and 68 airports terminals for supplying aviation fuel, as well as operates 950 convenience stores under the Shell Select brand. The ComgÃ¡s segment distributes piped natural gas to customers in the industrial, residential, commercial, automotive, and cogeneration sectors. The Moove segment produces and distributes lubricants under the Mobil and Comma brands. The company was founded in 1936 and is headquartered in SÃ£o Paulo, Brazil. Cosan S.A. is a subsidiary of Cosan Limited.",
        "currency": "BRL",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "city": "SÃ£o Paulo"
    },
    "CTXAF": {
        "short_name": "AMPOL LTD",
        "long_name": "Ampol Limited",
        "summary": "Ampol Limited engages in purchasing, refining, and distributing petroleum products in Australia, New Zealand, and Singapore. The company operates through Convenience Retail, and Fuels & Infrastructure segments. The Convenience Retail segment sells fuels through a Caltex network of stores. The Fuels and Infrastructure segment wholesales fuels and lubricants. It distributes its products through a network of depots, diesel stops, marine facilities, and service station sites. The company was formerly known as Caltex Australia Limited and changed its name to Ampol Limited in May 2020. Ampol Limited was founded in 1900 and is headquartered in Sydney, Australia.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "CVI": {
        "short_name": "CVR Energy Inc.",
        "long_name": "CVR Energy, Inc.",
        "summary": "CVR Energy, Inc., through its subsidiaries, engages in petroleum refining and nitrogen fertilizer manufacturing activities in the United States. The company operates through two segments, Petroleum and Nitrogen Fertilizer. The Petroleum segment refines and markets gasoline, diesel fuel, and other refined products. It owns and operates a coking medium-sour crude oil refinery in southeast Kansas; and a crude oil refinery in Wynnewood, Oklahoma, as well as supporting logistics assets. This segment primarily serves retailers, railroads, farm co-operatives, and other refiners/marketers. The Nitrogen Fertilizer segment owns and operates a nitrogen fertilizer plant in North America that utilizes a pet coke gasification process to produce nitrogen fertilizer products; and a nitrogen fertilizer facility in East Dubuque, Illinois that produces nitrogen fertilizers in the form of ammonia and UAN. It primarily markets UAN products to agricultural customers; and ammonia products to agricultural and industrial customers. CVR Energy, Inc. was founded in 1906 and is based in Sugar Land, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Sugar Land"
    },
    "CZZ": {
        "short_name": "Cosan Limited",
        "long_name": "Cosan Limited",
        "summary": "Cosan Limited, together with its subsidiaries, engages in fuel and natural gas distribution, logistics, lubricant, sugar, and ethanol businesses in Brazil, Europe, Latin America, North America, Asia, and internationally. It operates through RaÃ­zen Energia, RaÃ­zen CombustÃ­veis, ComgÃ¡s, Cosan LogÃ­stica, and Moove segments. The company's RaÃ­zen Energia segment produces and markets products derived from sugar cane, including raw sugar, anhydrous, and hydrated ethanol, as well as activities related to energy cogeneration from sugarcane bagasse. Its RaÃ­zen CombustÃ­veis segment engages in the distribution and marketing of fuels, primarily through a franchised network of service stations under the Shell brand in Brazil; petroleum refining; operation of fuel resellers, and convenience store businesses; and production and sale of liquefied petroleum gas, and automotive and industrial lubricants. The company's ComgÃ¡s segment distributes piped natural gas to customers in the industrial, residential, commercial, automotive, and cogeneration sectors in SÃ£o Paulo. Its Cosan LogÃ­stica segment provides logistics services for transport, storage, and port loading of commodities, primarily for sugar products; and leases locomotives, wagons, and other railway equipment. The company's Moove segment produces and distributes lubricants under the Mobil brand. It operates a network of approximately 7,270 service stations and 1,726 convenience stores, as well as 68 distribution terminals and 68 airports supplying jet fuel. The company was founded in 1936 and is based in SÃ£o Paulo, Brazil.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Brazil",
        "city": "SÃ£o Paulo"
    },
    "DCC.L": {
        "short_name": "DCC PLC ORD EUR0.25",
        "long_name": "DCC plc",
        "summary": "DCC plc provides sales, marketing, and support services worldwide. The company's DCC LPG segment sells and markets liquefied petroleum gas (LPG). This segment serves approximately 0.7 million customers. Its DCC Retail & Oil segment markets, sells, and retails transport and commercial fuels, heating oils, and related products and services; operates retail petrol stations; resells fuel cards; distributes oil; and provides inbound logistics, storage and filling, and outbound logistics services. This segment serves domestic, agricultural, commercial/industrial, forecourt, aviation, and marine customers. The company's DCC Healthcare segment offers products and services to healthcare providers, and health and beauty brand owners; outsourced contract manufacturing services to the health and beauty sector; nutrition products, such as vitamins and health supplements; beauty products; and product development, formulation, manufacturing, and packaging services. In addition, this segment procures and sells exempt medicinal products. Its DCC Technology segment distributes consumer technology products, including smart home products, gaming consoles, peripherals and software, wearable technology, and accessories; business and enterprise technology products, such as tablets, notebooks, and PCs; networking and security products; communication products comprising smartphones, feature phones, accessories, and unified communication products; and servers and storage products, audio visual products, printers, peripherals, cables and connectors, and consumables to retailers, resellers, and integrators. It also provides supply chain services. DCC plc was founded in 1976 and is headquartered in Dublin, Ireland.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Ireland",
        "city": "Dublin"
    },
    "DEH.F": {
        "short_name": "DELEK US HLDGS INC.DL-,01",
        "long_name": "Delek US Holdings, Inc.",
        "summary": "Delek US Holdings, Inc. engages in the integrated downstream energy business in the United States. The company operates in three segments: Refining, Logistics, and Retail. The Refining segment processes crude oil and other purchased feedstock for the manufacture of various grades of gasoline, diesel fuel, aviation fuel, asphalt, and other petroleum-based products that are distributed through owned and third-party product terminals. This segment owns and operates four independent refineries located in Tyler, Texas; El Dorado, Arkansas; Big Spring, Texas; and Krotz Springs, Louisiana, as well as two biodiesel facilities in Crossett, Arkansas, and Cleburne, Texas. The Logistics segment gathers, transports, and stores crude oil, intermediate, and refined products; and markets, distributes, transports, and stores refined products for third parties. This segment owns or leases capacity on approximately 400 miles of crude oil transportation pipelines, approximately 450 miles of refined product pipelines, an approximately 700-mile crude oil gathering system, and associated crude oil storage tanks with an aggregate of approximately 9.9 million barrels of active shell capacity; and owns and operates ten light product distribution terminals, as well as markets light products using third-party terminals. The Retail segment owns and leases 252 convenience store sites located primarily in Texas and New Mexico. Its convenience stores offer various grades of gasoline and diesel under the DK or Alon brand name; and food products and service, tobacco products, non-alcoholic and alcoholic beverages, and general merchandise, as well as money orders. The company serves oil companies, independent refiners and marketers, jobbers, distributors, utility and transportation companies, the U.S. government, and independent retail fuel operators. Delek US Holdings, Inc. was founded in 2001 and is headquartered in Brentwood, Tennessee.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Brentwood"
    },
    "DK": {
        "short_name": "Delek US Holdings, Inc.",
        "long_name": "Delek US Holdings, Inc.",
        "summary": "Delek US Holdings, Inc. engages in the integrated downstream energy business in the United States. The company operates in three segments: Refining, Logistics, and Retail. The Refining segment processes crude oil and other purchased feedstock for the manufacture of various grades of gasoline, diesel fuel, aviation fuel, asphalt, and other petroleum-based products that are distributed through owned and third-party product terminals. This segment owns and operates four independent refineries located in Tyler, Texas; El Dorado, Arkansas; Big Spring, Texas; and Krotz Springs, Louisiana, as well as two biodiesel facilities in Crossett, Arkansas, and Cleburne, Texas. The Logistics segment gathers, transports, and stores crude oil, intermediate, and refined products; and markets, distributes, transports, and stores refined products for third parties. This segment owns or leases capacity on approximately 400 miles of crude oil transportation pipelines, approximately 450 miles of refined product pipelines, an approximately 700-mile crude oil gathering system, and associated crude oil storage tanks with an aggregate of approximately 9.9 million barrels of active shell capacity; and owns and operates ten light product distribution terminals, as well as markets light products using third-party terminals. The Retail segment owns and leases 252 convenience store sites located primarily in Texas and New Mexico. Its convenience stores offer various grades of gasoline and diesel under the DK or Alon brand name; and food products and service, tobacco products, non-alcoholic and alcoholic beverages, and general merchandise, as well as money orders. The company serves oil companies, independent refiners and marketers, jobbers, distributors, utility and transportation companies, the U.S. government, and independent retail fuel operators. Delek US Holdings, Inc. was founded in 2001 and is headquartered in Brentwood, Tennessee.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Brentwood"
    },
    "DPAM.PA": {
        "short_name": "DOCK.PETR.AMBES AM",
        "long_name": "Les Docks des Pétroles d'Ambès -SA",
        "summary": "Les Docks des PÃ©troles d'AmbÃ¨s SA engages in the reception, storage, and shipping of petroleum products in France. It offers products through two pipelines. The company was founded in 1930 and is based in Carbon-Blanc, France. Les Docks des PÃ©troles d'AmbÃ¨s SA is a subsidiary of Entrepots Petroliers Regionnaux.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "city": "Carbon-Blanc"
    },
    "DRAL.TA": {
        "short_name": "DOR ALON ENERGY IN",
        "long_name": "Dor Alon Energy In Israel (1988) Ltd",
        "summary": "Dor Alon Energy In Israel (1988) Ltd develops, constructs, and operates gas stations and commercial centers in Israel. The company also develops, constructs, and operates convenience stores in kibbutzim and moshavim; and markets fuel and other consumer products through gas stations and convenience stores, as well as markets distillates and natural gas to private customers, institutional investors, and airlines. It operates a chain of approximately 210 public gas stations under the Dor Alon brand, including convenience stores under the Alonit brand. In addition, the company operates approximately 70 independent convenience stores in the Gush Dan area, and kibbutzim and moshavim under the AM: PM, Alonit in the Moshav, Alonit in the kibbutz, and Super Alonit brands, as well as leases commercial centers adjacent to its refueling and commercial complexes. Further, it markets fuels and oils under the ARAL and Texaco brands directly to institutional customers. Additionally, it markets LPG cooking gas under the Lclmalh brand to approximately 110 thousand households; and LPG and natural gas to institutional customers. The company also markets jet fuel to foreign and domestic airlines. In addition, it is involved in the provision of Speedomet, a computerized refueling system that enables to refuel at various Dor Alon stations through a device or card. The company was founded in 1988 and is based in Yakum, Israel.",
        "currency": "ILA",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Yakum"
    },
    "DVFI": {
        "short_name": "DIVERSIFIED OIL & GAS HLDGS LTD",
        "long_name": "Diversified Oil & Gas Holdings, Ltd.",
        "summary": "Diversified Oil & Gas Holdings, Ltd., an investment venture capital company, engages in the exploitation and distribution of oil and gas reserves in the United States. The company also has joint ventures with Tyche Energy, Inc. and Hydroslotter Coporation. It was formerly known as Biogenerics Limited and changed its name to Diversified Oil & Gas Holdings, Ltd. in July 2007. The company is based in Tyler, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Tyler"
    },
    "DW51.F": {
        "short_name": "AEMETIS INC.  DL-,01",
        "long_name": "Aemetis, Inc.",
        "summary": "Aemetis, Inc. operates as a renewable fuels and bio-chemicals company in North America and India. The company focuses on the acquisition, development, and commercialization of various technologies that replace traditional petroleum-based products primarily through the conversion of ethanol and biodiesel plants into advanced bio refineries. It owns and operates an ethanol facility in the California Central Valley near Modesto; and a renewable chemical and advanced fuel production facility on the East Coast of India. The company sells biodiesel and refined glycerin to transport companies, resellers, distributors, and refiners through its sales force and independent sales agents, as well as to brokers who resell the product to end-users. It also produces ethanol; and wet distiller's grains, distiller's corn oil, and condensed distillers solubles to dairies and feedlots as animal feed. In addition, it produces dairy biogas; and high-grade sanitizer alcohol and various feed products. The company was formerly known as AE Biofuels, Inc. and changed its name to Aemetis, Inc. in November 2011. Aemetis, Inc. was founded in 2005 and is headquartered in Cupertino, California.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Cupertino"
    },
    "EH8.F": {
        "short_name": "ESSO INH.  EO 7,65",
        "long_name": "Esso S.A.F.",
        "summary": "Esso S.A.F. refines, distributes, and markets refined petroleum products in France and internationally. The company offers gas and diesel, aviation, and marine fuels and lubricants. It provides its products under the Esso brand and lubricants under the Mobil brand. The company also operates a network of service stations under the Esso and Esso Express brands, as well as provides greases. It markets its products through a network of authorized distributors, resellers, and directly to industrial accounts. The company was founded in 1902 and is headquartered in Courbevoie, France.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "France",
        "city": "Courbevoie"
    },
    "ES.PA": {
        "short_name": "ESSO",
        "long_name": "Esso S.A.F.",
        "summary": "Esso S.A.F. refines, distributes, and markets refined petroleum products in France and internationally. The company offers gas and diesel, aviation, and marine fuels and lubricants. It provides its products under the Esso brand and lubricants under the Mobil brand. The company also operates a network of service stations under the Esso and Esso Express brands, as well as provides greases. It markets its products through a network of authorized distributors, resellers, and directly to industrial accounts. The company was founded in 1902 and is headquartered in Courbevoie, France.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "city": "Courbevoie"
    },
    "ESSA.JK": {
        "short_name": "Surya Esa Perkasa Tbk.",
        "long_name": "PT Surya Esa Perkasa Tbk",
        "summary": "PT Surya Esa Perkasa Tbk engages in purification and processing of natural gas in Indonesia. The company operates through LPG Refinery, Ammonia, and Others segments. It offers LPG primarily for use as a kitchen appliance fuel for homes, shopping centers, and hotels; and motor vehicle fuel, as well as for construction industries such as steel workshop as welding fuel. The company also provides propane; condensate for use as a raw material for thinner, glue, and vehicle tires applications, as well as light naphtha, which is a cracker material for the manufacture of polyethylene; and ammonia that is used as a raw material for fertilizer production, pharmaceutical, food and beverage, textile, industrial and household cleaning, water and wastewater treatment, metallurgical processes, pulp and paper, leather, rubber, and other applications.In addition, it offers management and business consulting services; operates an ammonia plant; and sells raw feed gas through pipelines. PT Surya Esa Perkasa Tbk was founded in 2006 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "ESSO-R.BK": {
        "short_name": "ESSO (THAILAND) PUBLIC COMPANY ",
        "long_name": "Esso (Thailand) Public Company Limited",
        "summary": "Esso (Thailand) Public Company Limited refines and markets petroleum products in Thailand and internationally. It operates in two segments, Downstream and Petrochemicals. The company provides refined petroleum products, including motor gasoline, gasohol, diesel, aviation fuels, fuel oil, marine fuels, and LPG products; and other petroleum products comprising mineral and synthetic lubricants under the Mobil brand name, as well as asphalt. It offers its refined petroleum products through a retail network of 654 retail service stations under the Esso brand name; and commercial channel consists of sales to industrial end users and wholesalers, as well as to customers in the aviation and marine industries. The company also produces aromatics in the form of Paraxylene, a feedstock for purified terephthalic acid, as well as used as raw material for producing polyester films, packaging resins, and fabrics. In addition, it provides hydrocarbon solvents, such as hexane, which is used primarily in edible oil seed extractions and as a carrier in petrochemical production; rubber solvents that are used as adhesives and rubber cement for use in the manufacture of tires; white spirits for coating and paint industries; and Exxsol D80 for household, industrial, and metal working applications. Further, the company imports and markets aromatic solvents that are used in the automotive paint coating industry; and sells plasticizer for various applications. Additionally, it leases real estate properties. The company was formerly known as Esso Standard Thailand Co., Ltd. and changed its name to Esso (Thailand) Public Company Limited in 1996. The company was founded in 1894 and is headquartered in Bangkok, Thailand. Esso (Thailand) Public Company Limited is a subsidiary of ExxonMobil Asia Holding Private Limited.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "ESSO.BK": {
        "short_name": "ESSO (THAILAND) PUBLIC COMPANY ",
        "long_name": "Esso (Thailand) Public Company Limited",
        "summary": "Esso (Thailand) Public Company Limited refines and markets petroleum products in Thailand and internationally. It operates in two segments, Downstream and Petrochemicals. The company provides refined petroleum products, including motor gasoline, gasohol, diesel, aviation fuels, fuel oil, marine fuels, and LPG products; and other petroleum products comprising mineral and synthetic lubricants under the Mobil brand name, as well as asphalt. It offers its refined petroleum products through a retail network of 654 retail service stations under the Esso brand name; and commercial channel consists of sales to industrial end users and wholesalers, as well as to customers in the aviation and marine industries. The company also produces aromatics in the form of Paraxylene, a feedstock for purified terephthalic acid, as well as used as raw material for producing polyester films, packaging resins, and fabrics. In addition, it provides hydrocarbon solvents, such as hexane, which is used primarily in edible oil seed extractions and as a carrier in petrochemical production; rubber solvents that are used as adhesives and rubber cement for use in the manufacture of tires; white spirits for coating and paint industries; and Exxsol D80 for household, industrial, and metal working applications. Further, the company imports and markets aromatic solvents that are used in the automotive paint coating industry; and sells plasticizer for various applications. Additionally, it leases real estate properties. The company was formerly known as Esso Standard Thailand Co., Ltd. and changed its name to Esso (Thailand) Public Company Limited in 1996. The company was founded in 1894 and is headquartered in Bangkok, Thailand. Esso (Thailand) Public Company Limited is a subsidiary of ExxonMobil Asia Holding Private Limited.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "FGPR": {
        "short_name": "FERRELLGAS PARTNERS",
        "long_name": "Ferrellgas Partners, L.P.",
        "summary": "Ferrellgas Partners, L.P. distributes and sells propane and related equipment and supplies. The company transports propane to propane distribution locations, tanks on customers' premises, or to portable propane tanks delivered to retailers. It conducts its portable tank exchange operations under the Blue Rhino brand name through a network of independent and partnership-owned distribution outlets. The company's propane is primarily used for space heating, water heating, cooking, outdoor cooking using gas grills, crop drying, irrigation, weed control, and other propane fueled appliances; as an engine fuel for combustion engine vehicles and forklifts; and as a heating or energy source in manufacturing and drying processes. It serves residential, industrial/commercial, portable tank exchange, agricultural, wholesale, and other customers in the United States, the District of Columbia, and Puerto Rico. As of July 31, 2020, it operated 79 service centers and 906 propane distribution locations. The company is also involved in the sale of refined fuels; provision of common carrier services; and retail sale of propane appliances and related parts and fittings, as well as other retail propane related services and consumer products. Ferrellgas Partners, L.P. was founded in 1939 and is headquartered in Overland Park, Kansas. On January 11, 2021, Ferrellgas Partners, L.P., along with its affiliate, filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the District of Delaware.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Overland Park"
    },
    "FGPRQ": {
        "short_name": "FERRELLGAS PARTNERS",
        "long_name": "Ferrellgas Partners, L.P.",
        "summary": "Ferrellgas Partners, L.P. distributes and sells propane and related equipment and supplies. The company transports propane to propane distribution locations, tanks on customers' premises, or to portable propane tanks delivered to retailers. It conducts its portable tank exchange operations under the Blue Rhino brand name through a network of independent and partnership-owned distribution outlets. The company's propane is primarily used for space heating, water heating, cooking, outdoor cooking using gas grills, crop drying, irrigation, weed control, and other propane fueled appliances; as an engine fuel for combustion engine vehicles and forklifts; and as a heating or energy source in manufacturing and drying processes. It serves residential, industrial/commercial, portable tank exchange, agricultural, wholesale, and other customers in the United States, the District of Columbia, and Puerto Rico. As of July 31, 2020, it operated 79 service centers and 906 propane distribution locations. The company is also involved in the sale of refined fuels; provision of common carrier services; and retail sale of propane appliances and related parts and fittings, as well as other retail propane related services and consumer products. Ferrellgas Partners, L.P. was founded in 1939 and is headquartered in Overland Park, Kansas. On January 11, 2021, Ferrellgas Partners, L.P., along with its affiliate, filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the District of Delaware.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Overland Park"
    },
    "GIII.V": {
        "short_name": "GEN III OIL CORPORATION",
        "long_name": "Gen III Oil Corporation",
        "summary": "Gen III Oil Corporation operates as a cleantech company in Canada. It owns a portfolio of patented technologies that enable used motor oil re-refineries to produce a higher value product mix of base oils. The company was formerly known as PNG Gold Corporation and changed its name to Gen III Oil Corporation in May 2017. Gen III Oil Corporation is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "GULFPETRO.NS": {
        "short_name": "GP PETROLEUMS LTD",
        "long_name": "GP Petroleums Limited",
        "summary": "GP Petroleums Limited engages in formulating, manufacturing, and marketing industrial and automotive lubricants, process oils, transformer oils, greases, and other specialties in India and internationally. It offers automotive lubricants, including automotive engine oils, gear and transmission oils, greases, engine coolant and brake fluids, and diesel exhaust fluids. The company also provides industrial lubricants and specialties comprising industrial lubricating and specialty oils; metal working fluids, corrosion preventive oils, cleaners and quenching oils; industrial greases; and horticultural orchard spray oils, as well as process oils and specialties consisting of rubber process oils, white oils and specialties, and transformer oils. GP Petroleums Limited markets its lubricants under the IPOL and REPSOL brand names through distributors and dealers. The company was formerly known as Sah Petroleums Limited and changed its name to GP Petroleums Limited in April 2015. The company was incorporated in 1983 and is headquartered in Mumbai, India. GP Petroleums Limited is a subsidiary of GP Global APAC Pte. Ltd.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "HFC": {
        "short_name": "HollyFrontier Corporation",
        "long_name": "HollyFrontier Corporation",
        "summary": "HollyFrontier Corporation operates as an independent petroleum refiner in the United States. The company operates through three segments: Refining, Lubricants and Specialty Products, and HEP. It primarily produces high-value light products, such as gasoline, diesel and jet fuel, and specialty lubricant products, as well as specialty and modified asphalt. The company offers its products to other refiners, convenience store chains, independent marketers, retailers, truck stop chains, wholesalers, railroads, governmental entities, and paving contractors or manufacturers, as well as for commercial airline use. It owns and operates 5 refineries with a combined crude oil processing capacity of approximately 457,000 barrels per day in El Dorado, Kansas; Tulsa, Oklahoma; Artesia, New Mexico; Cheyenne, Wyoming; and Woods Cross, Utah. The company also owns and operates vacuum distillation and other facilities in Lovington, New Mexico, as well as asphalt terminals in Arizona, New Mexico, and Oklahoma. Its refineries serve markets in the Mid-Continent, Southwest, and Rocky Mountain regions of the United States. In addition, HollyFrontier Corporation produces base oils and other specialized lubricant products; and owns and operates logistic assets consisting of petroleum product and crude oil pipelines, terminals, tankage, loading rack facilities, and refinery processing units. The company was formerly known as Holly Corporation and changed its name to HollyFrontier Corporation as a result of its merger with Frontier Oil Corporation in July 2011. HollyFrontier Corporation was founded in 1947 and is headquartered in Dallas, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Dallas"
    },
    "HINDPETRO.NS": {
        "short_name": "HINDUSTAN PETROL",
        "long_name": "Hindustan Petroleum Corporation Limited",
        "summary": "Hindustan Petroleum Corporation Limited refines and markets petroleum products in India and internationally. The company operates through Downstream Petroleum and Others segments. It offers petrol, diesel, kerosene, liquefied petroleum gas, naphtha lubricants, specialties, and greases, as well as aviation turbine fuel; and markets and exports bulk fuels, bitumen, solvents, jet and marine fuel, marine lubes, household insecticides, hexane, propylene, jute batch oil, turpentine oil, carbon black feed stock, molten sulphur, and superior kerosene oil (SKO). The company is also involved in international trade activities, including crude oil imports, petroleum product imports/exports, import/export registration, shipping, supplies for domestic markets, and product exchange with other Indian oil marketing companies and oil price risk management. In addition, it offers LPG products under the HP Gas brand, as well as markets LPG cylinders for commercial and industrial purposes, and bulk LPG products for industries; and operates retail petrol pumps and pipelines for the transportation of petroleum products. Further, the company explores for and produces hydrocarbons, as well as provides management services for exploration and production blocks; and operates sugar ethanol-cogen plants in Bihar, wind power plants in Maharashtra and Rajasthan, and solar power plant in Karnataka. As of March 31, 2020, it operated through a marketing network of 133 regional offices; 68 depots; 50 LPG bottling plants; 44 aviation service facilities; 16,476 retail outlets; 1,638 SKO and light diesel oil dealers; and 6,110 LPG distributors, as well as 43 terminal, installation, and tap off points. The company was incorporated in 1952 and is headquartered in Mumbai, India. Hindustan Petroleum Corporation Limited is a subsidiary of Oil and Natural Gas Corporation Limited.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "HL8.F": {
        "short_name": "HOLLYFRONTIER CORP.DL-,01",
        "long_name": "HollyFrontier Corporation",
        "summary": "HollyFrontier Corporation operates as an independent petroleum refiner in the United States. The company operates through three segments: Refining, Lubricants and Specialty Products, and HEP. It primarily produces high-value light products, such as gasoline, diesel and jet fuel, and specialty lubricant products, as well as specialty and modified asphalt. The company offers its products to other refiners, convenience store chains, independent marketers, retailers, truck stop chains, wholesalers, railroads, governmental entities, and paving contractors or manufacturers, as well as for commercial airline use. It owns and operates 5 refineries with a combined crude oil processing capacity of approximately 457,000 barrels per day in El Dorado, Kansas; Tulsa, Oklahoma; Artesia, New Mexico; Cheyenne, Wyoming; and Woods Cross, Utah. The company also owns and operates vacuum distillation and other facilities in Lovington, New Mexico, as well as asphalt terminals in Arizona, New Mexico, and Oklahoma. Its refineries serve markets in the Mid-Continent, Southwest, and Rocky Mountain regions of the United States. In addition, HollyFrontier Corporation produces base oils and other specialized lubricant products; and owns and operates logistic assets consisting of petroleum product and crude oil pipelines, terminals, tankage, loading rack facilities, and refinery processing units. The company was formerly known as Holly Corporation and changed its name to HollyFrontier Corporation as a result of its merger with Frontier Oil Corporation in July 2011. HollyFrontier Corporation was founded in 1947 and is headquartered in Dallas, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Dallas"
    },
    "I7B.F": {
        "short_name": "IDEMITSU KOSAN CO. LTD",
        "long_name": "Idemitsu Kosan Co.,Ltd.",
        "summary": "Idemitsu Kosan Co.,Ltd. manufactures and sells fuel oils and lubricant oils in Japan and internationally. It operates through Petroleum, Basic Chemicals, Functional Materials, Power and Renewable Energy, and Resources segments. The company's Petroleum segment engages in the procurement and sale of crude oil and refining of petroleum products; gasoline, diesel oil, kerosene, and automotive lubricants to service stations; and industrial kerosene, diesel oil, and heavy oil, and aviation and marine fuel. Its Basic Chemicals segment manufactures and sells olefins, such as ethylene, propylene, and butadiene; aromatics, including benzene, styrene monomer, mixed xylene, and paraxylene; and other chemicals. The company's Functional Materials segment researches, develops, manufactures, and sells automotive, marine, and industrial lubricants, as well as grease; engineering plastic, adhesive materials, derivative products, and solvents; electronic materials, such as OLED; asphalt; microbial pesticides, soil amendments, and livestock related materials; and solid state lithium ion battery materials. Its Power and Renewable Energy segment operates thermal power plants; develops and operates renewable energy sources, including solar, wind, and biomass power plants; engages in the supply, wholesale, and retail of electric power; researches, develops, and manufactures CIS thin-film solar modules; and sale of solar power systems. The company Resources segments explores, develops, and produces oil and gas; produces and sells coal and uranium; operates geothermal power plants; and sale of electric power and steam. Idemitsu Kosan Co.,Ltd. was founded in 1911 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "IAHL": {
        "short_name": "IAHL CORPORATION",
        "long_name": "IAHL Corp.",
        "summary": "IAHL Corp., through its subsidiaries, provides alternative energy services. The company provides associated gases capturing, cleaning, compressing, and transporting services. It also provides LNG production, transportation, and re-gasification; alternative energy engineering consulting; LNG, liquid compressed natural gas (LCNG), and natural gas vehicle (NGV) sales; and NGV stations and vehicles conversion services. The company also focuses on developing a LNG project in Colombia. The company was formerly known as Integrity Aircraft Holdings Corporation and changed its name to IAHL Corp. in October 2007. The company is based in Orlando, Florida.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Orlando"
    },
    "ICNN": {
        "short_name": "INCOMING INC",
        "long_name": "Incoming, Inc.",
        "summary": "Incoming, Inc., through its subsidiary, North American Bio-Energies LLC, refines, produces, and distributes commercial-grade biodiesel from agri-based feedstock in the Southeast region of the United States. It also offers kerosene, de-methylated glycerin, and recovered methanol. The company sells its products directly or through wholesale distributors primarily to petroleum distributors, refiners, and manufacturers in North Carolina, South Carolina, and Virginia. Incoming, Inc. was founded in 2006 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "IDKOY": {
        "short_name": "IDEMITSU KOSAN CO.LTD",
        "long_name": "Idemitsu Kosan Co.,Ltd.",
        "summary": "Idemitsu Kosan Co.,Ltd. manufactures and sells fuel oils and lubricant oils in Japan and internationally. It operates through Petroleum Products, Petrochemical Products, Resources, and Others segments. The company offers lubricants, including marine and maintenance oils, metal working and industrial oils, grease products, traction drive fluids, polyvinyl ethers, and polyalkylene glycol oils; and petrochemicals, such as basic and performance chemicals, and engineering plastics. It also investigates, explores, develops, and sells oil and gas, coal, uranium, and geothermal resources; and provides agricultural biotechnology products, as well as animal feeds. In addition, the company generates renewable energy from wind, solar, biofuels, and hydrogen; and produces and sells electronic materials consisting of OLED materials. Further, it transports petroleum products; sells service station products; and offers credit card services. Additionally, the company is involved in the research and development, production, and distribution of synthetic plastic processed products. Idemitsu Kosan Co.,Ltd. was founded in 1911 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "INT": {
        "short_name": "World Fuel Services Corporation",
        "long_name": "World Fuel Services Corporation",
        "summary": "World Fuel Services Corporation engages in the distribution of fuel, and related products and services in the aviation, marine, and land transportation industries worldwide. Its Aviation segment supplies fuel, and related products and services to commercial airlines, second and third tier airlines, cargo carriers, regional and low-cost carriers, airports, fixed based operators, corporate fleets, fractional operators, private aircraft, the U.S. and foreign governments, intergovernmental organizations, and military customers. This segment also offers fuel management, price risk management, ground handling, and dispatch services, as well as international trip planning services, such as flight plans, weather reports, and overflight permits. The company's Land segment offers fuel, heating oil, propane, natural gas, lubricants, and related products and services to petroleum distributors and retail petroleum operators, as well as industrial, commercial, residential, and government customers. This segment also offers management services for procuring fuel and price risk management; advisory and fulfillment solutions related to power, natural gas, and other energy products; and card payment solutions, government payment systems for fuel procurement, merchant processing services, toll payment solutions, and commercial payment programs. Its Marine segment markets fuel, lubricants, and related products and services to international container and tanker fleets, commercial cruise lines, yachts and time charter operators, offshore rig owners and operators, the U.S. and foreign governments, and other fuel suppliers. Its marine fuel-related services include management services to procure fuel, cost control, quality control, claims management, and card payment and related processing services. This segment also engages in the fueling of vessels, and transportation and delivery of fuel and fuel-related products. The company was founded in 1984 and is headquartered in Miami, Florida.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Miami"
    },
    "IOC.NS": {
        "short_name": "INDIAN OIL CORP",
        "long_name": "Indian Oil Corporation Limited",
        "summary": "Indian Oil Corporation Limited, together with its subsidiaries, engages in the refining, pipeline transportation, and marketing of petroleum products in India. It is also involved in the exploration and production of crude oil and gas; and marketing of natural gas and petrochemicals. The company's products include petrol/gasoline, diesel/gas oil, lubricants and greases, auto gas, cooking gas, kerosene, LPG, bulk/industrial fuels, aviation fuel, marine oils, and bitumen. In addition, it offers special products, such as carbon black feedstock, raw petroleum coke, Sulphur, paraffin wax, raw petroleum coke, jute batching oil, micro crystalline wax, mineral turpentine oil, toluene, propylene, benzene, and petcoke. The company operates through a network of approximately 9 refineries; 14,231 kilometers of crude/product and gas pipelines; approximately 27,702 fuel stations, including 7,857 Kisan Seva Kendra outlets; 125 terminals and depots; 91 LPG bottling plants; 116 aviation fuel stations; 6,960 consumer pumps; and approximately 11,964 LPG distributors. Indian Oil Corporation Limited's exploration and production portfolio comprises 10 oil and gas blocks in India; and 12 blocks in Canada, Gabon, Israel, Libya, Nigeria, Oman, Russia, the United Arab Emirates, the United States, and Venezuela. Further, it engages in the explosives and cryogenic; wind and solar power generation; lube blending; and lubricants and base oil marketing activities. The company also exports its products. It has strategic alliance with ENOC Group. The company was founded in 1959 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "IRPC-R.BK": {
        "short_name": "IRPC PUBLIC COMPANY LIMITED",
        "long_name": "IRPC Public Company Limited",
        "summary": "IRPC Public Company Limited, together with its subsidiaries, provides petroleum and petrochemical products in Thailand, Singapore, and internationally. The company operates through Petroleum Products, Petrochemical Products, and Other Business segments. Its petroleum products include refined oil comprising liquefied petroleum gas, naphtha, gasoline, diesel, and fuel oil; and lube base oil and asphalt. The company's petrochemical products comprise olefins, such as ethylene, propylene, and butadiene; aromatics comprising benzene, toluene, and xylene; polymers consisting of high-density polyethylene, polypropylene, acrylonitrile-butadiene-styrene, acrylonitrile styrene, polystyrene, and expandable polystyrene; and polyols. It also provides electricity, steam, and infrastructure, including wastewater treatment and other related services; wastewater treatment for industrial customers; port and tank services; and other business services. In addition, the company also offers tugboats, pilots, service boats, mooring, freshwater, bunkers, nautical charts, cranes, hopper cars, weighing, cargo yards, and warehouse services; and tank storage services, as well as operates liquid and chemical, and bulk and container terminals. Further, it offers asset management services in Rayong and other provinces; and various support services, as well as engages in the power plant, jetty, and other utilities operations. Additionally, the company manufactures and distributes plastic resins, as well as chemical products for polyurethanes; operates vocational schools; distributes petrochemical products; and provision of oil vessel renting services. The company was formerly known as Thai Petrochemical Industry Public Company Limited and changed its name to IRPC Public Company Limited in October 2006. IRPC Public Company Limited was incorporated in 1978 and is headquartered in Rayong, Thailand.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Rayong"
    },
    "IRPC.BK": {
        "short_name": "IRPC PUBLIC COMPANY LIMITED",
        "long_name": "IRPC Public Company Limited",
        "summary": "IRPC Public Company Limited, together with its subsidiaries, provides petroleum and petrochemical products in Thailand, Singapore, and internationally. The company operates through Petroleum Products, Petrochemical Products, and Other Business segments. Its petroleum products include refined oil comprising liquefied petroleum gas, naphtha, gasoline, diesel, and fuel oil; and lube base oil and asphalt. The company's petrochemical products comprise olefins, such as ethylene, propylene, and butadiene; aromatics comprising benzene, toluene, and xylene; polymers consisting of high-density polyethylene, polypropylene, acrylonitrile-butadiene-styrene, acrylonitrile styrene, polystyrene, and expandable polystyrene; and polyols. It also provides electricity, steam, and infrastructure, including wastewater treatment and other related services; wastewater treatment for industrial customers; port and tank services; and other business services. In addition, the company also offers tugboats, pilots, service boats, mooring, freshwater, bunkers, nautical charts, cranes, hopper cars, weighing, cargo yards, and warehouse services; and tank storage services, as well as operates liquid and chemical, and bulk and container terminals. Further, it offers asset management services in Rayong and other provinces; and various support services, as well as engages in the power plant, jetty, and other utilities operations. Additionally, the company manufactures and distributes plastic resins, as well as chemical products for polyurethanes; operates vocational schools; distributes petrochemical products; and provision of oil vessel renting services. The company was formerly known as Thai Petrochemical Industry Public Company Limited and changed its name to IRPC Public Company Limited in October 2006. IRPC Public Company Limited was incorporated in 1978 and is headquartered in Rayong, Thailand.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Rayong"
    },
    "IRPSY": {
        "short_name": "IRPC PUBLIC CO LTD",
        "long_name": "IRPC Public Company Limited",
        "summary": "IRPC Public Company Limited, together with its subsidiaries, provides petroleum and petrochemical products in Thailand, Singapore, and internationally. The company operates through Petroleum Products, Petrochemical Products, and Other Business segments. Its petroleum products include refined oil comprising liquefied petroleum gas, naphtha, gasoline, diesel, and fuel oil; and lube base oil and asphalt. The company's petrochemical products comprise olefins, such as ethylene, propylene, and butadiene; aromatics comprising benzene, toluene, and xylene; polymers consisting of high-density polyethylene, polypropylene, acrylonitrile-butadiene-styrene, acrylonitrile styrene, polystyrene, and expandable polystyrene; and polyols. It also provides electricity, steam, and infrastructure, including wastewater treatment and other related services; wastewater treatment for industrial customers; port and tank services; and other business services. In addition, the company also offers tugboats, pilots, service boats, mooring, freshwater, bunkers, nautical charts, cranes, hopper cars, weighing, cargo yards, and warehouse services; and tank storage services, as well as operates liquid and chemical, and bulk and container terminals. Further, it offers asset management services in Rayong and other provinces; and various support services, as well as engages in the power plant, jetty, and other utilities operations. Additionally, the company manufactures and distributes plastic resins, as well as chemical products for polyurethanes; operates vocational schools; distributes petrochemical products; and provision of oil vessel renting services. The company was formerly known as Thai Petrochemical Industry Public Company Limited and changed its name to IRPC Public Company Limited in October 2006. IRPC Public Company Limited was incorporated in 1978 and is headquartered in Rayong, Thailand.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Thailand",
        "city": "Rayong"
    },
    "ISRJF": {
        "short_name": "GEN III OIL CORPORATION",
        "long_name": "Gen III Oil Corporation",
        "summary": "Gen III Oil Corporation operates as a cleantech company in Canada. It owns a portfolio of patented technologies that enable used motor oil re-refineries to produce a higher value product mix of base oils. The company was formerly known as PNG Gold Corporation and changed its name to Gen III Oil Corporation in May 2017. Gen III Oil Corporation is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "JAV.F": {
        "short_name": "ESSO THAIL.-FGN- BA4,9338",
        "long_name": "Esso (Thailand) Public Company Limited",
        "summary": "Esso (Thailand) Public Company Limited refines and markets petroleum products in Thailand and internationally. It operates in two segments, Downstream and Petrochemicals. The company provides refined petroleum products, including motor gasoline, gasohol, diesel, aviation fuels, fuel oil, marine fuels, and LPG products; and other petroleum products comprising mineral and synthetic lubricants under the Mobil brand name, as well as asphalt. It offers its refined petroleum products through a retail network of 654 retail service stations under the Esso brand name; and commercial channel consists of sales to industrial end users and wholesalers, as well as to customers in the aviation and marine industries. The company also produces aromatics in the form of Paraxylene, a feedstock for purified terephthalic acid, as well as used as raw material for producing polyester films, packaging resins, and fabrics. In addition, it provides hydrocarbon solvents, such as hexane, which is used primarily in edible oil seed extractions and as a carrier in petrochemical production; rubber solvents that are used as adhesives and rubber cement for use in the manufacture of tires; white spirits for coating and paint industries; and Exxsol D80 for household, industrial, and metal working applications. Further, the company imports and markets aromatic solvents that are used in the automotive paint coating industry; and sells plasticizer for various applications. Additionally, it leases real estate properties. The company was formerly known as Esso Standard Thailand Co., Ltd. and changed its name to Esso (Thailand) Public Company Limited in 1996. The company was founded in 1894 and is headquartered in Bangkok, Thailand. Esso (Thailand) Public Company Limited is a subsidiary of ExxonMobil Asia Holding Private Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "JAV2.F": {
        "short_name": "ESSO (TH.)-NVDR- BA4,9338",
        "long_name": "Esso (Thailand) Public Company Limited",
        "summary": "Esso (Thailand) Public Company Limited refines and markets petroleum products in Thailand and internationally. It operates in two segments, Downstream and Petrochemicals. The company provides refined petroleum products, including motor gasoline, gasohol, diesel, aviation fuels, fuel oil, marine fuels, and LPG products; and other petroleum products comprising mineral and synthetic lubricants under the Mobil brand name, as well as asphalt. It offers its refined petroleum products through a retail network of 654 retail service stations under the Esso brand name; and commercial channel consists of sales to industrial end users and wholesalers, as well as to customers in the aviation and marine industries. The company also produces aromatics in the form of Paraxylene, a feedstock for purified terephthalic acid, as well as used as raw material for producing polyester films, packaging resins, and fabrics. In addition, it provides hydrocarbon solvents, such as hexane, which is used primarily in edible oil seed extractions and as a carrier in petrochemical production; rubber solvents that are used as adhesives and rubber cement for use in the manufacture of tires; white spirits for coating and paint industries; and Exxsol D80 for household, industrial, and metal working applications. Further, the company imports and markets aromatic solvents that are used in the automotive paint coating industry; and sells plasticizer for various applications. Additionally, it leases real estate properties. The company was formerly known as Esso Standard Thailand Co., Ltd. and changed its name to Esso (Thailand) Public Company Limited in 1996. The company was founded in 1894 and is headquartered in Bangkok, Thailand. Esso (Thailand) Public Company Limited is a subsidiary of ExxonMobil Asia Holding Private Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "JHJ.F": {
        "short_name": "ENEOS HOLDINGS INC.",
        "long_name": "ENEOS Holdings, Inc.",
        "summary": "ENEOS Holdings, Inc., through its subsidiaries, engages in the energy, oil and natural gas exploration and production (E&P), and metals businesses Japan, China, and internationally. The company operates through Energy, Oil and Natural Gas E&P, Metals, and Other segments. It manufactures and sells petroleum products, including gasoline, kerosene, lubricants, etc., as well as petrochemicals; imports and sells gas, such as LNG and liquefied petroleum gas; and offers copper concentrate, electrolytic coppers, electronic materials, etc. The company also explores, develops, produces, and sells crude oil, natural gas, other mineral resources, etc.; develops and mines nonferrous metals resources; refines and markets copper, gold, silver, sulfuric acid, copper foils, materials for rolling and processing, and thin film materials; recycles nonferrous metals; treats industrial waste; and generates and supplies electricity. In addition, it engages in the asphalt paving, civil engineering, construction, land transportation, and fund procurement businesses, as well as transportation by ships of non-ferrous metal products, titanium, and electric wires. Further, the company stores and transports crude oil and petroleum products; leases automobile-related supplies and goods; and purchases, leases, manages, and sells real estate properties. Additionally, it provides financial, accounting, salary and welfare, researching, studying, evaluating, designing and planning, and consulting services. The company was formerly known as JXTG Holdings, Inc. and changed its name to ENEOS Holdings, Inc. in June 2020. ENEOS Holdings, Inc. was founded in 1888 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "JNOS.ME": {
        "short_name": "SLAVNEFT YAROSLAVN",
        "long_name": "Public Joint Stock Company Slavneft-Yaroslavnefteorgsintez",
        "summary": "Public Joint Stock Company Slavneft-Yaroslavnefteorgsintez produces and sells oil products in Russia. It offers motor gasoline, diesel fuel, and jet fuel products; compression and hydraulic, industrial, and base oils; road, roof, and construction bitumen products; paraffin and wax products; and aromatic hydrocarbons, as well as liquefied gases and fuel oils. The company was founded in 1961 and is based in Yaroslavl, Russia.",
        "currency": "RUB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Yaroslavl"
    },
    "JNOSP.ME": {
        "short_name": "SLAVNEFT YAROSLAVN",
        "long_name": "Public Joint Stock Company Slavneft-Yaroslavnefteorgsintez",
        "summary": "Public Joint Stock Company Slavneft-Yaroslavnefteorgsintez produces and sells oil products in Russia. It offers motor gasoline, diesel fuel, and jet fuel products; compression and hydraulic, industrial, and base oils; road, roof, and construction bitumen products; paraffin and wax products; and aromatic hydrocarbons, as well as liquefied gases and fuel oils. The company was founded in 1961 and is based in Yaroslavl, Russia.",
        "currency": "RUB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Yaroslavl"
    },
    "JXHGF": {
        "short_name": "ENEOS HOLDINGS INC",
        "long_name": "ENEOS Holdings, Inc.",
        "summary": "ENEOS Holdings, Inc., through its subsidiaries, engages in the energy, oil and natural gas exploration and production (E&P), and metals businesses Japan, China, and internationally. The company operates through Energy, Oil and Natural Gas E&P, Metals, and Other segments. It manufactures and sells petroleum products, including gasoline, kerosene, lubricants, etc., as well as petrochemicals; imports and sells gas, such as LNG and liquefied petroleum gas; and offers copper concentrate, electrolytic coppers, electronic materials, etc. The company also explores, develops, produces, and sells crude oil, natural gas, other mineral resources, etc.; develops and mines nonferrous metals resources; refines and markets copper, gold, silver, sulfuric acid, copper foils, materials for rolling and processing, and thin film materials; recycles nonferrous metals; treats industrial waste; and generates and supplies electricity. In addition, it engages in the asphalt paving, civil engineering, construction, land transportation, and fund procurement businesses, as well as transportation by ships of non-ferrous metal products, titanium, and electric wires. Further, the company stores and transports crude oil and petroleum products; leases automobile-related supplies and goods; and purchases, leases, manages, and sells real estate properties. Additionally, it provides financial, accounting, salary and welfare, researching, studying, evaluating, designing and planning, and consulting services. The company was formerly known as JXTG Holdings, Inc. and changed its name to ENEOS Holdings, Inc. in June 2020. ENEOS Holdings, Inc. was founded in 1888 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "JXHLY": {
        "short_name": "ENEOS HOLDINGS INC",
        "long_name": "ENEOS Holdings, Inc.",
        "summary": "ENEOS Holdings, Inc., through its subsidiaries, engages in the energy, oil and natural gas exploration and production (E&P), and metals businesses Japan, China, and internationally. The company operates through Energy, Oil and Natural Gas E&P, Metals, and Other segments. It manufactures and sells petroleum products, including gasoline, kerosene, lubricants, etc., as well as petrochemicals; imports and sells gas, such as LNG and liquefied petroleum gas; and offers copper concentrate, electrolytic coppers, electronic materials, etc. The company also explores, develops, produces, and sells crude oil, natural gas, other mineral resources, etc.; develops and mines nonferrous metals resources; refines and markets copper, gold, silver, sulfuric acid, copper foils, materials for rolling and processing, and thin film materials; recycles nonferrous metals; treats industrial waste; and generates and supplies electricity. In addition, it engages in the asphalt paving, civil engineering, construction, land transportation, and fund procurement businesses, as well as transportation by ships of non-ferrous metal products, titanium, and electric wires. Further, the company stores and transports crude oil and petroleum products; leases automobile-related supplies and goods; and purchases, leases, manages, and sells real estate properties. Additionally, it provides financial, accounting, salary and welfare, researching, studying, evaluating, designing and planning, and consulting services. The company was formerly known as JXTG Holdings, Inc. and changed its name to ENEOS Holdings, Inc. in June 2020. ENEOS Holdings, Inc. was founded in 1888 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "KNF1L.VS": {
        "short_name": "Klaipedos Nafta",
        "long_name": "AB Klaipedos nafta",
        "summary": "AB Klaipedos nafta engages in the operation of oil terminal, oil products transshipment, and other related activities primarily in Lithuania. It operates through KNF, SGD, SNT, and GDP segments. The company also operates liquefied natural gas terminals. It transships oil products, including diesel fuel of various types, gasoline of various types, jet fuel, fuel oil of various types, biofuel, vacuum gas oil, and crude oil products; reloads crude oil and oil products into trucks; and accumulates and stores crude oil and oil products. The company also engages in the collection of waste water from sea vessels; mooring; inspection of quality parameters of oil products; blending of heavy and light oil products; and supply of fuel and water to vessels. In addition, it stores and handles oil products; and adds bio-additives and marks substances to oil products. The company was founded in 1994 and is based in Klaipeda, Lithuania.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "city": "Klaipeda"
    },
    "KOPI.JK": {
        "short_name": "Mitra Energi Persada Tbk.",
        "long_name": "PT Mitra Energi Persada Tbk",
        "summary": "PT Mitra Energi Persada Tbk engages in the gas trading and distribution business in Indonesia. The company trades in and distributes gas through a network of downstream pipelines in South Sumatra region. It is also involved in the power plant, coal mining, and other related businesses. The company was formerly known as PT Korpora Persada Investama, Tbk and changed its name to PT Mitra Energi Persada Tbk in January 2008. The company was founded in 1981 and is based in Jakarta Selatan, Indonesia. PT Mitra Energi Persada Tbk is a subsidiary of PT Mulya Tara Mandiri.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "KRKN.ME": {
        "short_name": "SARATOV OIL REFINE",
        "long_name": "Public Joint Stock Company Saratov Oil Refinery",
        "summary": "Public Joint Stock Company Saratov Oil Refinery engages in oil refining activities. It also sells materials, fixed assets, and processing services. The company was founded in 1994 and is based in Saratov, Russia. Public Joint Stock Company Saratov Oil Refinery is a subsidiary of Public Joint Stock Company Rosneft Oil Company.",
        "currency": "RUB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Saratov"
    },
    "KRKNP.ME": {
        "short_name": "SARATOV OIL REFINE",
        "long_name": "Public Joint Stock Company Saratov Oil Refinery",
        "summary": "Public Joint Stock Company Saratov Oil Refinery engages in oil refining activities. It also sells materials, fixed assets, and processing services. The company was founded in 1994 and is based in Saratov, Russia. Public Joint Stock Company Saratov Oil Refinery is a subsidiary of Public Joint Stock Company Rosneft Oil Company.",
        "currency": "RUB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Saratov"
    },
    "LIPIGAS.SN": {
        "short_name": "EMPRESAS LIPIGAS",
        "long_name": "Empresas Lipigas S.A.",
        "summary": "Empresas Lipigas S.A. engages in the marketing, distribution, and sale of liquefied petroleum gas (LPG) and natural gas (NG) in Chile, Peru, and Colombia. The company commercializes and distributes LPG primarily through cylinders, as well as through trucks for clients in the residential, commercial, institutional, industrial, and transport sectors; and distributes NG to households, businesses, and industries. It also provides liquefied natural gas, compressed natural gas, and metered gas; and generates and commercializes natural gas based electric energy for industrial and commercial clients. The company offers its products under the Gas PaÃ­s, Lidergas, Lima Gas, Caserito, and Zafiro brands. It serves approximately 2.6 million customers. The company was founded in 1950 and is headquartered in Las Condes, Chile.",
        "currency": "CLP",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "Chile",
        "city": "Las Condes"
    },
    "LQZ.F": {
        "short_name": "THAI OIL PCL -FGN-  BA 10",
        "long_name": "Thai Oil Public Company Limited",
        "summary": "Thai Oil Public Company Limited, together with its subsidiaries, engages in oil refining and distribution business in Thailand and internationally. It operates through Oil Refinery, Lube Base Oil Refinery, Petrochemical, Power Generation, Marine Transportation Services, Solvent, Ethanol, and Other segments. The company produces gasoline, diesel/gas oil, jet fuel, kerosene, fuel oil, and liquefied petroleum gas; and petrochemical products, such as paraxylene, benzene, toluene, and mixed xylenes. It also produces and distributes lube base oil, bitumen/asphalt, and other by-products, as well as special products, such as treated distillate aromatics extract and slack wax; and hydrocarbon and chemical solvents, and other chemicals. In addition, the company operates natural gas-fired combined-cycle co-generation power plants that generate and sell electricity, steam, and utilities to industrial users, as well as invests in other power generating companies and related business. Further, it is involved in the marine transportation of petroleum and petrochemical products; production of ethanol; and provision of crew boat services. Additionally, the company offers human resource management services; and manufactures and sells linear alkyl benzene and related products. Thai Oil Public Company Limited was founded in 1961 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "LQZ1.F": {
        "short_name": "THAI OIL -NVDR-  BA 10",
        "long_name": "Thai Oil Public Company Limited",
        "summary": "Thai Oil Public Company Limited, together with its subsidiaries, engages in oil refining and distribution business in Thailand and internationally. It operates through Oil Refinery, Lube Base Oil Refinery, Petrochemical, Power Generation, Marine Transportation Services, Solvent, Ethanol, and Other segments. The company produces gasoline, diesel/gas oil, jet fuel, kerosene, fuel oil, and liquefied petroleum gas; and petrochemical products, such as paraxylene, benzene, toluene, and mixed xylenes. It also produces and distributes lube base oil, bitumen/asphalt, and other by-products, as well as special products, such as treated distillate aromatics extract and slack wax; and hydrocarbon and chemical solvents, and other chemicals. In addition, the company operates natural gas-fired combined-cycle co-generation power plants that generate and sell electricity, steam, and utilities to industrial users, as well as invests in other power generating companies and related business. Further, it is involved in the marine transportation of petroleum and petrochemical products; production of ethanol; and provision of crew boat services. Additionally, the company offers human resource management services; and manufactures and sells linear alkyl benzene and related products. Thai Oil Public Company Limited was founded in 1961 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "MEIL": {
        "short_name": "METHES ENERGIES INTERNATIONAL L",
        "long_name": "Methes Energies International Ltd.",
        "summary": "Methes Energies International Ltd., a renewable energy company, produces and sells biodiesel fuel and biodiesel processing equipment in the United States and Canada. It offers Denami biodiesel processors. The company also produces glycerin and offer services related to the production of biodiesel, as well as purchases and sells feedstock. It sells its products and services to a network of biodiesel fuel producers. The company was founded in 2004 and is headquartered in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Las Vegas"
    },
    "MEPET.IS": {
        "short_name": "METRO PETROL VE TESISLERI",
        "long_name": "Mepet Metro Petrol ve Tesisleri Sanayi Ticaret A.S.",
        "summary": "Mepet Metro Petrol ve Tesisleri Sanayi Ticaret A.S. owns and operates gas stations and recreational facilities in Turkey. The company operates 24 fuel stations that sells fuel and petroleum products. It also offers road recreational services to bus passengers, private vehicle passengers, and long road drivers; and other services in the tourism sector. The company is based in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "city": "Istanbul"
    },
    "MHZ.F": {
        "short_name": "MOTOR OIL (HELL.) EO 0,75",
        "long_name": "Motor Oil (Hellas) Corinth Refineries S.A.",
        "summary": "Motor Oil (Hellas) Corinth Refineries S.A. engages in oil refining and oil products trading in Greece and internationally. It operates through three segments: Refinery's Activities, Sales to/from Gas Stations, and Services. The company produces and sells liquid fuels, lubricants, and asphalt for transportation, industrial, and household use. It also markets and distributes a range of oil products, including gasoline, fuel oil, diesel, and lubricants through a retail network of approximately 763 stations under the SHELL name; retail service comprising 29 SHELL branded fuel sites; and operates 486 gas stations under AVIN brand name and 116 gas stations under CYCLON brand. In addition, the company engages in the trading, transportation, storage, and agency of petroleum products; collection and trading of used lubricants; research, exploration, and trading of crude oil; and marketing and distribution of natural gas, as well as operates aircraft fuel supply system and the storage facilities at the Athens International Airport at Spata of Attica. Further, it is involved in the purchase, sale, exploitation, and development of real estate properties; and provision of liquefied petroleum gas, facilities management services, and financial services, as well as systems of alternative management of lubricant wastes. The company was founded in 1970 and is headquartered in Maroussi, Greece.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Greece",
        "city": "Marousi"
    },
    "MMBF": {
        "short_name": "MOMENTUM BIOFUELS INC",
        "long_name": "Momentum Biofuels, Inc.",
        "summary": "Momentum Biofuels, Inc., a development stage company, engages in licensing its intellectual property, processes, techniques, and formulas for creating biofuels and related products. The company is based in Arvada, Colorado.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Arvada"
    },
    "MOHCY": {
        "short_name": "MOTOR OIL SA",
        "long_name": "Motor Oil (Hellas) Corinth Refineries S.A.",
        "summary": "Motor Oil (Hellas) Corinth Refineries S.A. engages in oil refining and oil products trading in Greece and internationally. It operates through three segments: Refinery's Activities, Sales to/from Gas Stations, and Services. The company produces and sells liquid fuels, lubricants, and asphalt for transportation, industrial, and household use. It also markets and distributes a range of oil products, including gasoline, fuel oil, diesel, and lubricants through a retail network of approximately 763 stations under the SHELL name; retail service comprising 29 SHELL branded fuel sites; and operates 486 gas stations under AVIN brand name and 116 gas stations under CYCLON brand. In addition, the company engages in the trading, transportation, storage, and agency of petroleum products; collection and trading of used lubricants; research, exploration, and trading of crude oil; and marketing and distribution of natural gas, as well as operates aircraft fuel supply system and the storage facilities at the Athens International Airport at Spata of Attica. Further, it is involved in the purchase, sale, exploitation, and development of real estate properties; and provision of liquefied petroleum gas, facilities management services, and financial services, as well as systems of alternative management of lubricant wastes. The company was founded in 1970 and is headquartered in Maroussi, Greece.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Greece",
        "city": "Marousi"
    },
    "MPC": {
        "short_name": "Marathon Petroleum Corporation",
        "long_name": "Marathon Petroleum Corporation",
        "summary": "Marathon Petroleum Corporation, together with its subsidiaries, engages in refining, marketing, retailing, and transporting petroleum products primarily in the United States. It operates through three segments: Refining & Marketing, Retail, and Midstream. The Refining & Marketing segment refines crude oil and other feed stocks at its 16 refineries in the West Coast, Gulf Coast, and Mid-Continent regions of the United States; and purchases refined products and ethanol for resale. Its refined products include transportation fuels, such as reformulated gasolines and blend-grade gasolines; heavy fuel oil; and asphalt. This segment also manufactures aromatics, propane, propylene, and sulfur. It sells refined products wholesale marketing customers domestically and internationally, buyers on the spot market, and independent entrepreneurs who operate primarily Marathon branded outlets. The Retail segment sells transportation fuels and convenience products in the retail market through company-owned and operated convenience stores, primarily under the Speedway brand; and long-term fuel supply contracts with direct dealers who operate locations mainly under the ARCO brand. The Midstream segment transports, stores, distributes, and markets crude oil and refined products through refining logistics assets, pipelines, terminals, towboats and barges; gathers, processes, and transports natural gas; and gathers, transports, fractionates, stores, and markets natural gas liquids. The company also exports its refined products. As of September 30, 2020, it owned, leased, and had ownership interests in approximately 17,200 miles of crude oil and refined product pipelines, as well as owned and operated 3,854 convenience stores; and had approximately 7,000 branded outlets operated by independent entrepreneurs in 35 states of the United States, the District of Columbia, and Mexico. The company was founded in 1887 and is headquartered in Findlay, Ohio.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Findlay"
    },
    "MPN.F": {
        "short_name": "MARATHON PETROLEUM DL-,01",
        "long_name": "Marathon Petroleum Corporation",
        "summary": "Marathon Petroleum Corporation, together with its subsidiaries, engages in refining, marketing, retailing, and transporting petroleum products primarily in the United States. It operates through three segments: Refining & Marketing, Retail, and Midstream. The Refining & Marketing segment refines crude oil and other feed stocks at its 16 refineries in the West Coast, Gulf Coast, and Mid-Continent regions of the United States; and purchases refined products and ethanol for resale. Its refined products include transportation fuels, such as reformulated gasolines and blend-grade gasolines; heavy fuel oil; and asphalt. This segment also manufactures aromatics, propane, propylene, and sulfur. It sells refined products wholesale marketing customers domestically and internationally, buyers on the spot market, and independent entrepreneurs who operate primarily Marathon branded outlets. The Retail segment sells transportation fuels and convenience products in the retail market through company-owned and operated convenience stores, primarily under the Speedway brand; and long-term fuel supply contracts with direct dealers who operate locations mainly under the ARCO brand. The Midstream segment transports, stores, distributes, and markets crude oil and refined products through refining logistics assets, pipelines, terminals, towboats and barges; gathers, processes, and transports natural gas; and gathers, transports, fractionates, stores, and markets natural gas liquids. The company also exports its refined products. As of September 30, 2020, it owned, leased, and had ownership interests in approximately 17,200 miles of crude oil and refined product pipelines, as well as owned and operated 3,854 convenience stores; and had approximately 7,000 branded outlets operated by independent entrepreneurs in 35 states of the United States, the District of Columbia, and Mexico. The company was founded in 1887 and is headquartered in Findlay, Ohio.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Findlay"
    },
    "MPN.SG": {
        "short_name": "Marathon Petroleum Corp. Regist",
        "long_name": "Marathon Petroleum Corporation",
        "summary": "Marathon Petroleum Corporation, together with its subsidiaries, engages in refining, marketing, retailing, and transporting petroleum products primarily in the United States. It operates through three segments: Refining & Marketing, Retail, and Midstream. The Refining & Marketing segment refines crude oil and other feed stocks at its 16 refineries in the West Coast, Gulf Coast, and Mid-Continent regions of the United States; and purchases refined products and ethanol for resale. Its refined products include transportation fuels, such as reformulated gasolines and blend-grade gasolines; heavy fuel oil; and asphalt. This segment also manufactures aromatics, propane, propylene, and sulfur. It sells refined products wholesale marketing customers domestically and internationally, buyers on the spot market, and independent entrepreneurs who operate primarily Marathon branded outlets. The Retail segment sells transportation fuels and convenience products in the retail market through company-owned and operated convenience stores, primarily under the Speedway brand; and long-term fuel supply contracts with direct dealers who operate locations mainly under the ARCO brand. The Midstream segment transports, stores, distributes, and markets crude oil and refined products through refining logistics assets, pipelines, terminals, towboats and barges; gathers, processes, and transports natural gas; and gathers, transports, fractionates, stores, and markets natural gas liquids. The company also exports its refined products. As of September 30, 2020, it owned, leased, and had ownership interests in approximately 17,200 miles of crude oil and refined product pipelines, as well as owned and operated 3,854 convenience stores; and had approximately 7,000 branded outlets operated by independent entrepreneurs in 35 states of the United States, the District of Columbia, and Mexico. The company was founded in 1887 and is headquartered in Findlay, Ohio.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United States",
        "city": "Findlay"
    },
    "MRPL.NS": {
        "short_name": "MANGALORE REF &PET",
        "long_name": "Mangalore Refinery and Petrochemicals Limited",
        "summary": "Mangalore Refinery and Petrochemicals Limited manufactures and sells refined petroleum products in India. The company produces and sells hydrogen, liquefied petroleum gas, fuel gas, motor spirit, xylol, naphtha, SKO, high speed diesel, aviation turbine fuel, furnace oil, asphalt, CRMB, LSWR, sulphur, and pet coke, as well as bitumen, polypropylene, and other products. It operates 7 retail outlets. The company serves mining, construction, power, agriculture, fertilizer, and paint industries. It also exports its products. The company was founded in 1988 and is based in Mangalore, India. Mangalore Refinery and Petrochemicals Limited is a subsidiary of Oil and Natural Gas Corporation Limited.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mangalore"
    },
    "NE6.F": {
        "short_name": "NEWOCEAN ENERGY HLD.HD-10",
        "long_name": "NewOcean Energy Holdings Limited",
        "summary": "NewOcean Energy Holdings Limited, an investment holding company, distributes and sells liquefied petroleum gas (LPG) and natural gas, and oil/chemical products in the People's Republic of China. The company sells LPG to industrial customers, auto-gas operators, wholesalers, bottled LPG end-users, auto-gas end-users, etc. It also trades in electronic products, such as integrated circuits and mobile phones. Further, it is involved in the property investment and development activities. The company is headquartered in Wanchai, Hong Kong. NewOcean Energy Holdings Limited is a subsidiary of Uniocean Investments Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "NEF.F": {
        "short_name": "NESTE OYJ",
        "long_name": "Neste Oyj",
        "summary": "Neste Oyj provides renewable and oil products in Finland and other Nordic countries, Baltic Rim, other European countries, North and South America, and internationally. The company operates in four segments: Renewable Products, Oil Products, Marketing & Services, and Others. The Renewable Products segment produces, markets, and sells renewable diesel, renewable jet fuels and solutions, and renewable solvents, as well as raw material for bioplastics to retailers; wholesale customers, such as professional transportation companies and municipalities, fleets, and chemical industry producers; and brand owners and oil companies. The Oil Products segment produces, markets, and sells diesel fuel, gasoline, aviation and marine fuels, light and heavy fuel oils, base oils, gasoline components, small engine gasoline, solvents, liquid gases, and bitumen. It serves oil and petrochemicals companies; and companies marketing oil, fuels, lubricants, and other special products. The Marketing & Services segment markets and sells petroleum products and associated services to private motorists, industry, transport companies, farmers, and heating oil customers through a network of 800 service station, as well as direct sales. The Others segment offers engineering and technology solutions. The company also manufactures raw materials for polymers and chemicals materials. The company was formerly known as Neste Oil Oyj and changed its name to Neste Oyj in June 2015. Neste Oyj was founded in 1948 and is headquartered in Espoo, Finland.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Finland",
        "city": "Espoo"
    },
    "NESTE.HE": {
        "short_name": "Neste Corporation",
        "long_name": "Neste Oyj",
        "summary": "Neste Oyj provides renewable and oil products in Finland and other Nordic countries, Baltic Rim, other European countries, North and South America, and internationally. The company operates in four segments: Renewable Products, Oil Products, Marketing & Services, and Others. The Renewable Products segment produces, markets, and sells renewable diesel, renewable jet fuels and solutions, and renewable solvents, as well as raw material for bioplastics to retailers; wholesale customers, such as professional transportation companies and municipalities, fleets, and chemical industry producers; and brand owners and oil companies. The Oil Products segment produces, markets, and sells diesel fuel, gasoline, aviation and marine fuels, light and heavy fuel oils, base oils, gasoline components, small engine gasoline, solvents, liquid gases, and bitumen. It serves oil and petrochemicals companies; and companies marketing oil, fuels, lubricants, and other special products. The Marketing & Services segment markets and sells petroleum products and associated services to private motorists, industry, transport companies, farmers, and heating oil customers through a network of 800 service station, as well as direct sales. The Others segment offers engineering and technology solutions. The company also manufactures raw materials for polymers and chemicals materials. The company was formerly known as Neste Oil Oyj and changed its name to Neste Oyj in June 2015. Neste Oyj was founded in 1948 and is headquartered in Espoo, Finland.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "city": "Espoo"
    },
    "NGL": {
        "short_name": "NGL ENERGY PARTNERS LP",
        "long_name": "NGL Energy Partners LP",
        "summary": "NGL Energy Partners LP engages in the crude oil logistics, water solutions, and liquids and refined products businesses. The company's Crude Oil Logistics segment purchases crude oil from producers and marketers, and transports it to refineries for resale at pipeline injection stations, storage terminals, barge loading facilities, rail facilities, refineries, and other trade hubs; and provides storage, terminaling, and pipeline transportation services. Its Water Solutions segment is involved in the treatment and disposal of flowback water generated from crude oil and natural gas production; disposal of solids, such as tank bottoms, drilling fluids, and drilling muds, as well as performs truck and frac tank washouts; and sale of brackish non-potable water. The company's Liquids and Refined Products segment markets natural gas liquids, gasoline, diesel, propane, butane, refined petroleum, and biodiesel to retailers, wholesalers, refiners, and petrochemical plants in the United States and Canada through its 28 terminals; and purchase and delivers refined petroleum and renewable products, as well as offers terminaling and storage services. NGL Energy Holdings LLC serves as the general partner of the company. The company was founded in 1940 and is headquartered in Tulsa, Oklahoma.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Tulsa"
    },
    "NGL-PB": {
        "short_name": "NGL ENERGY PARTNERS LP 9.00%",
        "long_name": "NGL Energy Partners LP",
        "summary": "NGL Energy Partners LP engages in the crude oil logistics, water solutions, and liquids and refined products businesses. The company's Crude Oil Logistics segment purchases crude oil from producers and marketers, and transports it to refineries for resale at pipeline injection stations, storage terminals, barge loading facilities, rail facilities, refineries, and other trade hubs; and provides storage, terminaling, and pipeline transportation services. Its Water Solutions segment is involved in the treatment and disposal of flowback water generated from crude oil and natural gas production; disposal of solids, such as tank bottoms, drilling fluids, and drilling muds, as well as performs truck and frac tank washouts; and sale of brackish non-potable water. The company's Liquids and Refined Products segment markets natural gas liquids, gasoline, diesel, propane, butane, refined petroleum, and biodiesel to retailers, wholesalers, refiners, and petrochemical plants in the United States and Canada through its 28 terminals; and purchase and delivers refined petroleum and renewable products, as well as offers terminaling and storage services. NGL Energy Holdings LLC serves as the general partner of the company. The company was founded in 1940 and is headquartered in Tulsa, Oklahoma.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Tulsa"
    },
    "NGL-PC": {
        "short_name": "NGL ENERGY PARTNERS LP 9.625%",
        "long_name": "NGL Energy Partners LP",
        "summary": "NGL Energy Partners LP engages in the crude oil logistics, water solutions, and liquids and refined products businesses. The company's Crude Oil Logistics segment purchases crude oil from producers and marketers, and transports it to refineries for resale at pipeline injection stations, storage terminals, barge loading facilities, rail facilities, refineries, and other trade hubs; and provides storage, terminaling, and pipeline transportation services. Its Water Solutions segment is involved in the treatment and disposal of flowback water generated from crude oil and natural gas production; disposal of solids, such as tank bottoms, drilling fluids, and drilling muds, as well as performs truck and frac tank washouts; and sale of brackish non-potable water. The company's Liquids and Refined Products segment markets natural gas liquids, gasoline, diesel, propane, butane, refined petroleum, and biodiesel to retailers, wholesalers, refiners, and petrochemical plants in the United States and Canada through its 28 terminals; and purchase and delivers refined petroleum and renewable products, as well as offers terminaling and storage services. NGL Energy Holdings LLC serves as the general partner of the company. The company was founded in 1940 and is headquartered in Tulsa, Oklahoma.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Tulsa"
    },
    "NTOIF": {
        "short_name": "NESTE OYJ",
        "long_name": "Neste Oyj",
        "summary": "Neste Oyj provides renewable and oil products in Finland and other Nordic countries, Baltic Rim, other European countries, North and South America, and internationally. The company operates in four segments: Renewable Products, Oil Products, Marketing & Services, and Others. The Renewable Products segment produces, markets, and sells renewable diesel, renewable jet fuels and solutions, and renewable solvents, as well as raw material for bioplastics to retailers; wholesale customers, such as professional transportation companies and municipalities, fleets, and chemical industry producers; and brand owners and oil companies. The Oil Products segment produces, markets, and sells diesel fuel, gasoline, aviation and marine fuels, light and heavy fuel oils, base oils, gasoline components, small engine gasoline, solvents, liquid gases, and bitumen. It serves oil and petrochemicals companies; and companies marketing oil, fuels, lubricants, and other special products. The Marketing & Services segment markets and sells petroleum products and associated services to private motorists, industry, transport companies, farmers, and heating oil customers through a network of 800 service station, as well as direct sales. The Others segment offers engineering and technology solutions. The company also manufactures raw materials for polymers and chemicals materials. The company was formerly known as Neste Oil Oyj and changed its name to Neste Oyj in June 2015. Neste Oyj was founded in 1948 and is headquartered in Espoo, Finland.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Finland",
        "city": "Espoo"
    },
    "NTOIY": {
        "short_name": "NESTE OYJ",
        "long_name": "Neste Oyj",
        "summary": "Neste Oyj provides renewable and oil products in Finland and other Nordic countries, Baltic Rim, other European countries, North and South America, and internationally. The company operates in four segments: Renewable Products, Oil Products, Marketing & Services, and Others. The Renewable Products segment produces, markets, and sells renewable diesel, renewable jet fuels and solutions, and renewable solvents, as well as raw material for bioplastics to retailers; wholesale customers, such as professional transportation companies and municipalities, fleets, and chemical industry producers; and brand owners and oil companies. The Oil Products segment produces, markets, and sells diesel fuel, gasoline, aviation and marine fuels, light and heavy fuel oils, base oils, gasoline components, small engine gasoline, solvents, liquid gases, and bitumen. It serves oil and petrochemicals companies; and companies marketing oil, fuels, lubricants, and other special products. The Marketing & Services segment markets and sells petroleum products and associated services to private motorists, industry, transport companies, farmers, and heating oil customers through a network of 800 service station, as well as direct sales. The Others segment offers engineering and technology solutions. The company also manufactures raw materials for polymers and chemicals materials. The company was formerly known as Neste Oil Oyj and changed its name to Neste Oyj in June 2015. Neste Oyj was founded in 1948 and is headquartered in Espoo, Finland.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Finland",
        "city": "Espoo"
    },
    "NVPF.F": {
        "short_name": "IRPC PCL -NVDR-  BA 1",
        "long_name": "IRPC Public Company Limited",
        "summary": "IRPC Public Company Limited, together with its subsidiaries, provides petroleum and petrochemical products in Thailand, Singapore, and internationally. The company operates through Petroleum Products, Petrochemical Products, and Other Business segments. Its petroleum products include refined oil comprising liquefied petroleum gas, naphtha, gasoline, diesel, and fuel oil; and lube base oil and asphalt. The company's petrochemical products comprise olefins, such as ethylene, propylene, and butadiene; aromatics comprising benzene, toluene, and xylene; polymers consisting of high-density polyethylene, polypropylene, acrylonitrile-butadiene-styrene, acrylonitrile styrene, polystyrene, and expandable polystyrene; and polyols. It also provides electricity, steam, and infrastructure, including wastewater treatment and other related services; wastewater treatment for industrial customers; port and tank services; and other business services. In addition, the company also offers tugboats, pilots, service boats, mooring, freshwater, bunkers, nautical charts, cranes, hopper cars, weighing, cargo yards, and warehouse services; and tank storage services, as well as operates liquid and chemical, and bulk and container terminals. Further, it offers asset management services in Rayong and other provinces; and various support services, as well as engages in the power plant, jetty, and other utilities operations. Additionally, the company manufactures and distributes plastic resins, as well as chemical products for polyurethanes; operates vocational schools; distributes petrochemical products; and provision of oil vessel renting services. The company was formerly known as Thai Petrochemical Industry Public Company Limited and changed its name to IRPC Public Company Limited in October 2006. IRPC Public Company Limited was incorporated in 1978 and is headquartered in Rayong, Thailand.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Rayong"
    },
    "NWF.L": {
        "short_name": "NWF GROUP PLC ORD 25P",
        "long_name": "NWF Group plc",
        "summary": "NWF Group plc, together with its subsidiaries, primarily engages in the sale and distribution of fuel oils in the United Kingdom. It operates through Fuels, Food, and Feeds segments. The Fuels segment sells and distributes domestic heating, industrial, and road fuels. This segment operates through a network of 19 depots. The Food segment is involved in the warehousing and distribution of grocery and other products to supermarket and other retail distribution centers. The Feeds segment manufactures and sells animal feeds and other agricultural products. NWF Group plc was founded in 1871 and is headquartered in Nantwich, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Nantwich"
    },
    "NYY.F": {
        "short_name": "NWF GROUP PLC  LS-,25",
        "long_name": "NWF Group plc",
        "summary": "NWF Group plc, together with its subsidiaries, primarily engages in the sale and distribution of fuel oils in the United Kingdom. It operates through Fuels, Food, and Feeds segments. The Fuels segment sells and distributes domestic heating, industrial, and road fuels. This segment operates through a network of 19 depots. The Food segment is involved in the warehousing and distribution of grocery and other products to supermarket and other retail distribution centers. The Feeds segment manufactures and sells animal feeds and other agricultural products. NWF Group plc was founded in 1871 and is headquartered in Nantwich, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Nantwich"
    },
    "NZR.NZ": {
        "short_name": "The New Zealand Refining Compan",
        "long_name": "The New Zealand Refining Company Limited",
        "summary": "The New Zealand Refining Company Limited, together with its subsidiaries, engages in the refining of crude oil and supply of refined petroleum products in New Zealand. The company operates through Oil Refining, Distribution, and Other segments. It produces petrol, diesel, aviation fuel, kerosene, fuel oils, and bitumen, as well as offers specialized fuels, biofuels, and industrial and environmental laboratory testing services. The company also owns and operates a 170-kilometre pipeline that transports refined fuels running from the refinery at Marsden Point to Wiri located in South Auckland. The New Zealand Refining Company Limited was founded in 1961 and is based in Whangarei, New Zealand.",
        "currency": "NZD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "city": "Whangarei"
    },
    "OAO.JO": {
        "short_name": "Oando plc",
        "long_name": "Oando PLC",
        "summary": "Oando PLC, through its subsidiaries, provides integrated energy solutions in Nigeria and internationally. The company operates through Exploration and Production, and Supply and Trading segments. It explores for and produces oil and gas; and trades in crude refined and unrefined petroleum products. The company is also involved in the storage and haulage of petroleum products; storage, trading, and distribution of petroleum and gas products; provision of logistics and other services; and aviation activities. The company was formerly known as Unipetrol Nigeria Plc and changed its name to Oando PLC in December 2003. Oando PLC was founded in 1956 and is headquartered in Lagos, Nigeria. Oando PLC is a subsidiary of Ocean and Oil Development Partners Limited.",
        "currency": "ZAc",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JNB",
        "market": "za_market",
        "country": "Nigeria",
        "city": "Lagos"
    },
    "OILRF": {
        "short_name": "OIL REFINERIES LTD",
        "long_name": "Oil Refineries Ltd.",
        "summary": "Oil Refineries Ltd., together with its subsidiaries, produces and sells crude oil products in Israel and internationally. The company operates through Fuels, Polymers-Carmel Olefins, PolymersÂ\u0096Ducor, and Aromatics segments. It offers gasoline, naphtha, diesel fuel, kerosene, fuel oil, liquefied petroleum gas, and bitumen. The company also offers polymers comprising polypropylene and polyethylene, which are used as raw materials in the plastics industry; and aromatic materials, such as benzene, paraxylene, orthoxylene, and toluene that are used as raw materials in the chemical and petrochemical industries. In addition, it provides water treatment and steam to industries in Haifa refinery; and infrastructure services, including the storage, pumping, and distribution of fuel products. Further, the company is involved in trading and shipping. The company was formerly known as Haifa Refineries Ltd. and changed its name to Oil Refineries Ltd. in June 1972. Oil Refineries Ltd. was incorporated in 1959 and is based in Haifa, Israel.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Haifa"
    },
    "PANAMAPET.NS": {
        "short_name": "PANAMA PETROCHEM L",
        "long_name": "Panama Petrochem Limited",
        "summary": "Panama Petrochem Limited manufactures and sells specialty petroleum products in India. The company offers white/liquid paraffin oil; petroleum jellies; transformer oil; ink and coating oils; rubber process oil; industrial oils and lubricants; lithium and lithium complex, calcium based, sodium based, and aluminum greases; automotive engine, and gear and transmission oils, as well as other automotive lubricants; drilling fluids; and fully- and semi-refined paraffin, slack, and micro waxes. It serves printing, textile, rubber, pharmaceutical, cosmetic, power, and other industrial oil industries. The company also exports its products to various countries, including the United States, the United Kingdom, Europe, the Middle East, Australia, Africa, Southeast Asia, etc. Panama Petrochem Limited was founded in 1975 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "PARR": {
        "short_name": "Par Pacific Holdings, Inc. Comm",
        "long_name": "Par Pacific Holdings, Inc.",
        "summary": "Par Pacific Holdings, Inc. owns, manages, and maintains interests in energy and infrastructure businesses. The company operates in three segments: Refining, Retail, and Logistics. The Refining segment operates four refineries that produces ultra-low sulfur diesel, gasoline, jet fuel, marine fuel, distillate, asphalt, low sulfur fuel oil, and other associated refined products primarily for consumption in Hawaii, Pacific Northwest, Wyoming, and South Dakota. The Retail segment operates retail outlets, which sell gasoline, diesel, and retail merchandise in the island of Oahu, Maui, Hawaii, and Kauai. It operates 124 outlets under the Hele, 76, nomnom, Cenex, and Zip Trip brand names in Hawaii, Washington, and Idaho. The Logistics segment owns and operates terminals, pipelines, a single-point mooring, and trucking operations to distribute refined products throughout the island of Oahu, Maui, Hawaii, Molokai, and Kauai. It also owns and operates a crude oil pipeline gathering system, a refined products pipeline, and storage facilities and loading racks in Wyoming; and a jet fuel storage facility and pipeline that serves Ellsworth Air Force Base in South Dakota. In addition, this segment owns and operates a marine terminal, a unit train-capable rail loading terminal, storage facilities, a truck rack, and a proprietary pipeline that serves McChord Air Force Base in Washington. The company was formerly known as Par Petroleum Corporation and changed its name to Par Pacific Holdings, Inc. in October 2015. Par Pacific Holdings, Inc. was founded in 1984 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "PBF": {
        "short_name": "PBF Energy Inc.",
        "long_name": "PBF Energy Inc.",
        "summary": "PBF Energy Inc., together with its subsidiaries, engages in refining and supplying petroleum products. The company operates in two segments, Refining and Logistics. It produces gasoline, ultra-low-sulfur diesel, heating oil, diesel fuel, jet fuel, lubricants, petrochemicals, and asphalt, as well as unbranded transportation fuels, petrochemical feedstocks, blending components, and other petroleum products. The company sells its products in Northeast, Midwest, Gulf Coast, and West Coast of the United States, as well as in other regions of the United States, Canada, and Mexico. It also offers various rail, truck, and marine terminaling services, as well as pipeline transportation and storage services. The company owns and operates five oil refineries and related assets. PBF Energy Inc. was founded in 2008 and is based in Parsippany, New Jersey.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Parsippany"
    },
    "PEIX": {
        "short_name": "Alto Ingredients, Inc.",
        "long_name": "Alto Ingredients, Inc.",
        "summary": "Alto Ingredients, Inc. produces and markets low-carbon renewable fuels and alcohol products in the United States. The company operates in two segments, Production and Marketing. It produces and markets ethanol; and co-products, such as wet and dry distillers grains, wet and dry corn gluten feed, condensed distillers solubles, corn gluten meal, corn germ, corn oil, dried yeast, and CO2, as well as markets ethanol produced by third parties. The company also offers ethanol transportation, storage, and delivery services through third-party service providers. It sells ethanol to integrated oil companies and gasoline marketers; distillers grains and other feed co-products to dairies and feedlots; and corn oil to poultry and biodiesel customers. The company owns and operates nine ethanol production facilities, including four plants located in the Western states of California, Oregon, and Idaho; and five plants in the Midwestern states of Illinois and Nebraska. The company was formerly known as Pacific Ethanol, Inc. and changed its name to Alto Ingredients, Inc. in January 2021. Alto Ingredients, Inc. was founded in 2003 and is headquartered in Sacramento, California.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Sacramento"
    },
    "PKI.TO": {
        "short_name": "PARKLAND CORPORATION",
        "long_name": "Parkland Corporation",
        "summary": "Parkland Corporation operates as a marketer, distributor, and refiner of fuel and petroleum products in Canada, the United States, and internationally. The company operates in five segments: Canada Retail, Canada Commercial, USA, Supply, and International. The Canada Retail segment supplies and supports a coast-to-coast network of 1,863 retail gas stations under the Ultramar, Esso, Fas Gas Plus, Chevron, and Pioneer, as well as operates convenience stores under the On the Run/MarchÃ© Express brand. The Canada Commercial segment offers bulk fuel, bulk and cylinder exchange propane, heating oil, lubricants, and other related products and services to commercial, industrial, and residential customers in various industries, such as oil and gas, construction, mining, forestry, fishing, and transportation under the Ultramar, Bluewave Energy, Pipeline Commercial, Chevron, Columbia Fuels, and Sparlings Propane brands. The USA segment operates a network of gas stations; and delivers bulk fuel, lubricants, and other related products and services under the Farstad Oil, Rhinehart Oil, Tropic Oil, Superpumper, and Harts brands. The Supply segment manufactures transportation fuels; procures feedstocks and fuels from third parties; transports, stores, and markets fuels, crude oil, and liquid petroleum gases; and manufactures and sells aviation fuel to airlines. The International segment operates retail service stations under the Esso, Shell, and Sol brands; and delivers and supplies gasoline, diesel, fuel oil, propane, and lubricants to customers in various sectors, including power, oil and gas, and mining. This segment also engages in the wholesale, supply, and distribution business. The company was formerly known as Parkland Fuel Corporation and changed its name to Parkland Corporation in May 2020. The company was founded in 1977 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "PKIUF": {
        "short_name": "PARKLAND CORPORATION",
        "long_name": "Parkland Corporation",
        "summary": "Parkland Corporation operates as a marketer, distributor, and refiner of fuel and petroleum products in Canada, the United States, and internationally. The company operates in five segments: Canada Retail, Canada Commercial, USA, Supply, and International. The Canada Retail segment supplies and supports a coast-to-coast network of 1,863 retail gas stations under the Ultramar, Esso, Fas Gas Plus, Chevron, and Pioneer, as well as operates convenience stores under the On the Run/MarchÃ© Express brand. The Canada Commercial segment offers bulk fuel, bulk and cylinder exchange propane, heating oil, lubricants, and other related products and services to commercial, industrial, and residential customers in various industries, such as oil and gas, construction, mining, forestry, fishing, and transportation under the Ultramar, Bluewave Energy, Pipeline Commercial, Chevron, Columbia Fuels, and Sparlings Propane brands. The USA segment operates a network of gas stations; and delivers bulk fuel, lubricants, and other related products and services under the Farstad Oil, Rhinehart Oil, Tropic Oil, Superpumper, and Harts brands. The Supply segment manufactures transportation fuels; procures feedstocks and fuels from third parties; transports, stores, and markets fuels, crude oil, and liquid petroleum gases; and manufactures and sells aviation fuel to airlines. The International segment operates retail service stations under the Esso, Shell, and Sol brands; and delivers and supplies gasoline, diesel, fuel oil, propane, and lubricants to customers in various sectors, including power, oil and gas, and mining. This segment also engages in the wholesale, supply, and distribution business. The company was formerly known as Parkland Fuel Corporation and changed its name to Parkland Corporation in May 2020. The company was founded in 1977 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "PKN.PR": {
        "short_name": "PKN Orlen",
        "long_name": "Polski Koncern Naftowy ORLEN Spólka Akcyjna",
        "summary": "Polski Koncern Naftowy ORLEN SpÃ³lka Akcyjna processes, refines, and markets crude oil. The company operates in through three segments: Downstream, Retail, and Upstream. It offers motor gasolines, diesel oils, fuel oils, light heating oils, liquefied gas, biofuels, bunker fuels, and aviation fuels; read, industrial, modifies, and mutligrade bitumen; base, motor, gea, hydraulic, and industrial oils; oils agriculture, car lubricants, and lubricants; and refining products, such as solvents, slack waxes, waxes, sulfur, kerosene, industrial grade glycerin, paraffins, alkylate, reformate, and isomerate. The company also provides ethylene and propylene; polyethylene and polypropylene; artificial fertilizers comprising nitrogen fertilizers, liquid ammonia, CANWIL, ammonium nitrate, ammonium sulfate, soda lye, caustic soda, and sodium hypochlorite; petrochemicals consisting of acetone, process butadiene, ethyl tertiary-butyl ether, polymerization ethylene, process phenol, glycol, terephthalic acid PTA, petrollent, ethylene polyglycols, polymerization propylene, and liquid ethylene oxide; aromatic hydrocarbons, which includes raffinate, paraxylene, benzene, and benzene-toulene fraction; and polyvinyl chloride (PVC), PVC granulates, PVC based mixes, PVC sheets, brake and other fluids, and toluene. In addition, it offers iodised and pickling salts, salt pellets and briquettes, sodium chloride, animal feed salt, waste salt, industrial-grade brine, table salt, salt dust, and salt separated; and fuel cards, LPF and ad-blue flow meters, service station and control systems, and car care cosmetics and chemicals, as well as generates electricity and heat. Further, the company engages in the production, distribution, and sale of grease oils and maintenance liquids; liquid fuels trade; exploration of hydrocarbon deposits; and extraction of natural gas. It operates 2,836 fuel stations. Polski Koncern Naftowy ORLEN SpÃ³lka Akcyjna was founded in 1999 and is based in Plock, Poland.",
        "currency": "CZK",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PRA",
        "market": "cz_market",
        "country": "Poland",
        "city": "Plock"
    },
    "PKY1.F": {
        "short_name": "PKN ORLEN S.A.  ZY 1,25",
        "long_name": "Polski Koncern Naftowy ORLEN Spólka Akcyjna",
        "summary": "Polski Koncern Naftowy ORLEN SpÃ³lka Akcyjna processes, refines, and markets crude oil. The company operates in through three segments: Downstream, Retail, and Upstream. It offers motor gasolines, diesel oils, fuel oils, light heating oils, liquefied gas, biofuels, bunker fuels, and aviation fuels; read, industrial, modifies, and mutligrade bitumen; base, motor, gea, hydraulic, and industrial oils; oils agriculture, car lubricants, and lubricants; and refining products, such as solvents, slack waxes, waxes, sulfur, kerosene, industrial grade glycerin, paraffins, alkylate, reformate, and isomerate. The company also provides ethylene and propylene; polyethylene and polypropylene; artificial fertilizers comprising nitrogen fertilizers, liquid ammonia, CANWIL, ammonium nitrate, ammonium sulfate, soda lye, caustic soda, and sodium hypochlorite; petrochemicals consisting of acetone, process butadiene, ethyl tertiary-butyl ether, polymerization ethylene, process phenol, glycol, terephthalic acid PTA, petrollent, ethylene polyglycols, polymerization propylene, and liquid ethylene oxide; aromatic hydrocarbons, which includes raffinate, paraxylene, benzene, and benzene-toulene fraction; and polyvinyl chloride (PVC), PVC granulates, PVC based mixes, PVC sheets, brake and other fluids, and toluene. In addition, it offers iodised and pickling salts, salt pellets and briquettes, sodium chloride, animal feed salt, waste salt, industrial-grade brine, table salt, salt dust, and salt separated; and fuel cards, LPF and ad-blue flow meters, service station and control systems, and car care cosmetics and chemicals, as well as generates electricity and heat. Further, the company engages in the production, distribution, and sale of grease oils and maintenance liquids; liquid fuels trade; exploration of hydrocarbon deposits; and extraction of natural gas. It operates 2,836 fuel stations. Polski Koncern Naftowy ORLEN SpÃ³lka Akcyjna was founded in 1999 and is based in Plock, Poland.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Poland",
        "city": "Plock"
    },
    "PSX": {
        "short_name": "Phillips 66",
        "long_name": "Phillips 66",
        "summary": "Phillips 66 operates as an energy manufacturing and logistics company. It operates through four segments: Midstream, Chemicals, Refining, and Marketing and Specialties (M&S). The Midstream segment transports crude oil and other feedstocks; delivers refined products to market; provides terminaling and storage services for crude oil and petroleum products; transports, stores, fractionates, exports, and markets natural gas liquids; provides other fee-based processing services; and gathers, processes, transports, and markets natural gas. The Chemicals segment manufactures and markets ethylene and other olefin products; aromatics and styrenics products, such as benzene, cyclohexane, styrene, and polystyrene; and various specialty chemical products, including organosulfur chemicals, solvents, catalysts, and chemicals used in drilling and mining. The Refining segment refines crude oil and other feedstocks into petroleum products comprising gasolines, distillates, and aviation fuels at 13 refineries in the United States and Europe. The M&S segment purchases for resale and markets refined petroleum products consisting of gasolines, distillates, and aviation fuels primarily in the United States and Europe. It also manufactures and markets specialty products, such as petroleum coke products, waxes, solvents, and polypropylene. Phillips 66 was founded in 1875 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "PSXC.VI": {
        "short_name": "PHILLIPS 66 CORP",
        "long_name": "Phillips 66",
        "summary": "Phillips 66 operates as an energy manufacturing and logistics company. It operates through four segments: Midstream, Chemicals, Refining, and Marketing and Specialties (M&S). The Midstream segment transports crude oil and other feedstocks; delivers refined products to market; provides terminaling and storage services for crude oil and petroleum products; transports, stores, fractionates, exports, and markets natural gas liquids; provides other fee-based processing services; and gathers, processes, transports, and markets natural gas. The Chemicals segment manufactures and markets ethylene and other olefin products; aromatics and styrenics products, such as benzene, cyclohexane, styrene, and polystyrene; and various specialty chemical products, including organosulfur chemicals, solvents, catalysts, and chemicals used in drilling and mining. The Refining segment refines crude oil and other feedstocks into petroleum products comprising gasolines, distillates, and aviation fuels at 13 refineries in the United States and Europe. The M&S segment purchases for resale and markets refined petroleum products consisting of gasolines, distillates, and aviation fuels primarily in the United States and Europe. It also manufactures and markets specialty products, such as petroleum coke products, waxes, solvents, and polypropylene. Phillips 66 was founded in 1875 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "Houston"
    },
    "PTTN": {
        "short_name": "PATTEN ENERGY SOLUTIONS GROUP I",
        "long_name": "Patten Energy Solutions Group, Inc.",
        "summary": "Patten Energy Solutions Group, Inc., an exploration stage company, engages in the acquisition, exploration, development, mining, and production of energy and mineral properties. The company primarily explores for lithium carbonate and other minerals. It holds interests in a portfolio of properties covering approximately 31,020 acres located in the United States and Australia. Patten Energy Solutions Group, Inc. was founded in 2004 and is based in Dolton, Illinois.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Dolton"
    },
    "PZOL.TA": {
        "short_name": "PAZ OIL CO LTD",
        "long_name": "Paz Oil Company Ltd.",
        "summary": "Paz Oil Company Ltd., together with its subsidiaries, refines, produces, stores, imports, sells, and markets fuel products in Israel and internationally. The company markets oil and fuel products at its 268 fueling stations, and food and convenience products at the 241 Yellow market stores; leases its filling station spaces to various lessees, including businesses, restaurants, coffee shops, stores, etc.; and provides engineering, maintenance, and logistic services for the retail infrastructure customers. It is also involved in the direct marketing of fuels and oil products to industries, companies, enterprises, and aviation companies, as well as to car fleets and the Palestinian Authority. In addition, it is involved in the marketing, distribution, and sale of LPG for cooking, heating, and fueling LPG-operated cars to institutional, business, and private customers; marketing, distribution, and sale of devices that consume LPG; production, recycling, import, marketing, and export of lubricants, chemicals, and solvents; production, marketing, and export of sealing and insulation solutions, bitumen, coatings, and adhesives for the transportation, infrastructure, and construction industry; and marketing, supply, and storage of jet fuel and aviation gasoline, as well as provides refueling services to aviation companies. Further, Paz Oil Company Ltd. manufactures petroleum products and electricity. The company was formerly known as The Shell Company of Palestine and changed its name to Paz Oil Company Ltd. in 1960. Paz Oil Company Ltd. was founded in 1922 and is based in Yakum, Israel.",
        "currency": "ILA",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Yakum"
    },
    "QEGY": {
        "short_name": "QUANTUM ENERGY INC",
        "long_name": "Quantum Energy, Inc.",
        "summary": "Quantum Energy, Inc. focuses on the development, construction, and operation of crude oil refineries. It intends to develop, construct, and operate the Stoughton refinery in the Bakken region of Stoughton, Saskatchewan Canada. The company was formerly known as Boomers Cultural Development Inc. and changed its name to Quantum Energy, Inc. in May 2006. Quantum Energy, Inc. was incorporated in 2004 and is headquartered in Chicago, Illinois.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Chicago"
    },
    "QFLS.QA": {
        "short_name": "Qatar Fuel QPSC",
        "long_name": "Qatar Fuel Company Q.P.S.C.(\"WOQOD\")",
        "summary": "Qatar Fuel Company Q.P.S.C.(Â\u0091WOQOD'), together with its subsidiaries, sells, markets, and distributes oil, gas, and refined petroleum products in Qatar. It distributes gasoline and aviation fuels; operates 105 fuel stations, as well as convenience store under the SIDRA name; supplies bulk fuels; and offers ship -to- ship fuels bunkering services. The company also provides auto care services, such as oil change, brakes and mechanical works, tire rotation and wheel alignment, car accessories and spare parts, batteries and electrical works, manual wash, auto car wash, minor repairs, etc. In addition, it offers commercial LPG to restaurants, bakeries, catering businesses, and hotel owners; compressed natural gas; and industrial LPG. Further, the company produces bituminous products, including polymer modified bitumen, cutbacks, and emulsions. Additionally, it offers vehicle inspection, marine bunkering, oil and gas transportation, and real estate services. The company was founded in 2002 and is headquartered in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "city": "Doha"
    },
    "R4Q.F": {
        "short_name": "RPCG PCL -FOREIGN-  BA 1",
        "long_name": "RPCG Public Company Limited",
        "summary": "RPCG Public Company Limited, through its subsidiaries, engages in the energy and real estate businesses in Thailand. It engages in the sale of equipment, including repair and maintenance services, and construction to petroleum service stations; sale of liquefied petroleum gas through a network of gas station. The company is also involved in the manufacture and distribution of biodiesel and glycerin; and provision of systems management services. In addition, it develops, rents, and sells real estate properties. The company was formerly known as Rayong Purifier Public Company Limited and changed its name to RPCG Public Company Limited in January 2014. RPCG Public Company Limited was founded in 1995 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "REGI": {
        "short_name": "Renewable Energy Group, Inc.",
        "long_name": "Renewable Energy Group, Inc.",
        "summary": "Renewable Energy Group, Inc. provides lower carbon transportation fuels in the United States and internationally. The company utilizes an integrated production, distribution, and logistics system to convert natural fats, oils, and greases into advanced biofuels. It operates through Biomass-Based Diesel, Services, and Corporate and Other segments. The company produces biomass-based diesel from various carbon feedstocks, including distillers corn and used cooking oils, and inedible animal fats, as well as from soybean or canola oils. It is also involved in the purchase and resale of biomass-based diesel, petroleum-based diesel, renewable identification numbers, California Low Carbon Fuel Standard credits, and raw material feedstocks acquired from third parties; and sale of biomass-based diesel produced under toll manufacturing arrangements with third party facilities using its feedstocks. In addition, the company provides day-to-day management and operational services to biomass-based diesel production facilities; and construction management and general contracting services for the construction or upgrade of biomass-based diesel production facilities. Further, it sells petroleum-based heating oils and diesel fuels, as well as operates fermentation facilities. The company owns and operates a network of 13 biorefineries, including eleven biorefineries located in the United States and two biorefineries located in Germany. Renewable Energy Group, Inc. was founded in 1996 and is headquartered in Ames, Iowa.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Ames"
    },
    "REX": {
        "short_name": "REX American Resources Corporat",
        "long_name": "REX American Resources Corporation",
        "summary": "REX American Resources Corporation, together with its subsidiaries, produces and sells ethanol. It operates in two segments, Ethanol and By-Products, and Refined Coal. The company also offers distillers grains and non-food grade corn oil; and dry distillers grains with solubles, which is used as a protein in animal feed. In addition, it produces, processes, and sells refined coal. The company was formerly known as REX Stores Corporation and changed its name to REX American Resources Corporation in June 2010. REX American Resources Corporation was founded in 1980 and is headquartered in Dayton, Ohio.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Dayton"
    },
    "RLI.F": {
        "short_name": "RELIANCE INDS GDR 144A/2",
        "long_name": "Reliance Industries Limited",
        "summary": "Reliance Industries Limited engages in the hydrocarbon exploration and production, petroleum refining and marketing, petrochemicals, retail, digital, and financial services worldwide. The company produces and markets petroleum products, such as liquefied petroleum gas, propylene, naphtha, gasoline, jet/aviation turbine fuel, kerosene oil, diesel, sulphur, petroleum coke, and alkylate. It also provides petrochemicals, such as high-density and low-density polyethylene, linear low density polyethylene, polypropylene, polyvinyl chloride, polyester yarn, polyester fibres, purified terephthalic acid, paraxylene, ethylene glycol, olefins, aromatics, linear alkyl benzene, butadiene, acrylonitrile, poly butadiene rubber, styrene butadiene rubber, caustic soda, and polyethylene terephthalate. In addition, the company explores, develops, and produces crude oil and natural gas; and operates various stores comprising neighbourhood, supermarket, hypermarket, wholesale cash and carry, specialty, and online stores, as well as stores that offer apparel, beauty and cosmetics, accessories, footwear, in-store salon, and a cafÃ©. As of March 31, 2020, it operated 11,784 retail stores. Further, it provides range of digital services under Jio brand name, as well as involved in the investment in telecom infrastructure business; provides non-banking financial services, insurance broking, and other services; offers fabrics, apparel, and auto furnishing products; and operates various television channels. Further, it operates news and entertainment portals, finance portals, fashion and lifestyle portals, and online ticket booking platforms; publishes magazines; and provides fleet management and highway hospitality services, as well as is involved in content asset monetization, filmed entertainment, and investment arm of Network18 businesses. The company was incorporated in 1973 and is based in Mumbai, India.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "city": "Mumbai"
    },
    "RLI.VI": {
        "short_name": "RELIANCE INDS-SPONS GDR 144A",
        "long_name": "Reliance Industries Limited",
        "summary": "Reliance Industries Limited engages in the hydrocarbon exploration and production, petroleum refining and marketing, petrochemicals, retail, digital, and financial services worldwide. The company produces and markets petroleum products, such as liquefied petroleum gas, propylene, naphtha, gasoline, jet/aviation turbine fuel, kerosene oil, diesel, sulphur, petroleum coke, and alkylate. It also provides petrochemicals, such as high-density and low-density polyethylene, linear low density polyethylene, polypropylene, polyvinyl chloride, polyester yarn, polyester fibres, purified terephthalic acid, paraxylene, ethylene glycol, olefins, aromatics, linear alkyl benzene, butadiene, acrylonitrile, poly butadiene rubber, styrene butadiene rubber, caustic soda, and polyethylene terephthalate. In addition, the company explores, develops, and produces crude oil and natural gas; and operates various stores comprising neighbourhood, supermarket, hypermarket, wholesale cash and carry, specialty, and online stores, as well as stores that offer apparel, beauty and cosmetics, accessories, footwear, in-store salon, and a cafÃ©. As of March 31, 2020, it operated 11,784 retail stores. Further, it provides range of digital services under Jio brand name, as well as involved in the investment in telecom infrastructure business; provides non-banking financial services, insurance broking, and other services; offers fabrics, apparel, and auto furnishing products; and operates various television channels. Further, it operates news and entertainment portals, finance portals, fashion and lifestyle portals, and online ticket booking platforms; publishes magazines; and provides fleet management and highway hospitality services, as well as is involved in content asset monetization, filmed entertainment, and investment arm of Network18 businesses. The company was incorporated in 1973 and is based in Mumbai, India.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "VIE",
        "market": "at_market",
        "country": "India",
        "city": "Mumbai"
    },
    "RPC-R.BK": {
        "short_name": "RPCG PUBLIC COMPANY LIMITED",
        "long_name": "RPCG Public Company Limited",
        "summary": "RPCG Public Company Limited, through its subsidiaries, engages in the energy and real estate businesses in Thailand. It engages in the sale of equipment, including repair and maintenance services, and construction to petroleum service stations; sale of liquefied petroleum gas through a network of gas station. The company is also involved in the manufacture and distribution of biodiesel and glycerin; and provision of systems management services. In addition, it develops, rents, and sells real estate properties. The company was formerly known as Rayong Purifier Public Company Limited and changed its name to RPCG Public Company Limited in January 2014. RPCG Public Company Limited was founded in 1995 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "RPC.BK": {
        "short_name": "RPCG PUBLIC COMPANY LIMITED",
        "long_name": "RPCG Public Company Limited",
        "summary": "RPCG Public Company Limited, through its subsidiaries, engages in the energy and real estate businesses in Thailand. It engages in the sale of equipment, including repair and maintenance services, and construction to petroleum service stations; sale of liquefied petroleum gas through a network of gas station. The company is also involved in the manufacture and distribution of biodiesel and glycerin; and provision of systems management services. In addition, it develops, rents, and sells real estate properties. The company was formerly known as Rayong Purifier Public Company Limited and changed its name to RPCG Public Company Limited in January 2014. RPCG Public Company Limited was founded in 1995 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "RPMG3.SA": {
        "short_name": "PET MANGUINHON",
        "long_name": "Refinaria de Petróleos de Manguinhos S.A.",
        "summary": "Refinaria de PetrÃ³leos de Manguinhos S.A. refines petroleum products in Brazil. It offers gasoline, fuel oil, mineral turpentine, SPB, SBP S60, hexane food and chemical grade products, and heptane S7 and S8. The company also exports its products. The company was founded in 1945 and is based in Rio de Janeiro, Brazil.",
        "currency": "BRL",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "city": "Rio De Janeiro"
    },
    "RYZR.F": {
        "short_name": "CHINA LNG GROUP  HD-,02",
        "long_name": "China LNG Group Limited",
        "summary": "China LNG Group Limited, an investment holding company, sells and distributes liquefied natural gas (LNG) in the People's Republic of China. The company engages in the wholesale and point-to-point supply of LNG; and provision of LNG in the midstream and downstream market through fueling/refueling of LNG in road refueling stations for commercial vehicles, as well as water refueling stations for vessels and specific designed refueling facilities for equipment. It also provides LNG logistic services; finance leasing services for LNG vehicles and equipment; and securities brokerage, margin financing, and securities investments and financial services, as well as sells LNG vehicles. In addition, the company develops and operates oil-to-gas conversion and LNG refueling facilities on floating barges; develops LNG related technologies; operates LNG refueling stations; trades in gas ignition equipment; utilizes new energy sources and new energy related businesses; and supplies and manages LNG. Further, it is involved in the construction and operation of natural gas filling stations; wholesale of ethanol and liquefied petroleum gas; and trading of natural gas and transportation. Additionally, the company offers commercial vehicle user's long distance IT control, insurance handling, and new/used LNG/diesel vehicles purchase/sale services; and LNG consultancy services. The company was formerly known as Artel Solutions Group Holdings Limited and changed its name to China LNG Group Limited in June 2014. China LNG Group Limited was founded in 1995 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "S8SA.F": {
        "short_name": "JINTAI EN.HLDGS HD,-00125",
        "long_name": "Jintai Energy Holdings Limited",
        "summary": "Jintai Energy Holdings Limited, an investment holding company, engages in energy trading business primarily in the People's Republic of China. Its energy trading activities primarily comprise trading of fuel oil, kerosene, and chemical products. The company is also involved in the manufacture and trading of speakers; asset management businesses; and operation of an oil trade center. In addition, it provides oil and gas development engineering construction, and technical services, including geochemical exploration, drilled wells, test logging, downhole special operation, engineering building design, and construction services, as well as related oil and gas development technology research and development, and services. The company was formerly known as Yuhua Energy Holdings Limited and changed its name to Jintai Energy Holdings Limited in February 2020. Jintai Energy Holdings Limited was founded in 1990 and is headquartered in Dongying, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Dongying"
    },
    "SEAOIL-R.BK": {
        "short_name": "SEA OIL PUBLIC COMPANY LIMITED",
        "long_name": "Sea Oil Public Company Limited",
        "summary": "Sea Oil Public Company Limited engages in the retail sale of fuel and lubricant oils, and related products primarily for tankers, fishery boats, and reefer vessels in Thailand, Singapore, Laos, Cambodia, Myanmar, and internationally. It offers marine fuel oil, high speed diesel oil, lubricants, and benzene. The company also provides catering and housekeeping services for oil and gas drilling crew; management services for solar power plant; generates electricity from solar power plant, and sells solar roof tops; and produces and distributes solvents and liquefied petroleum products, including white spirit, rubber solvent, diesel, and fuel oil. It serves land customers, factories, and transportation industries. The company was founded in 1997 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "SEAOIL.BK": {
        "short_name": "SEA OIL PUBLIC COMPANY LIMITED",
        "long_name": "Sea Oil Public Company Limited",
        "summary": "Sea Oil Public Company Limited engages in the retail sale of fuel and lubricant oils, and related products primarily for tankers, fishery boats, and reefer vessels in Thailand, Singapore, Laos, Cambodia, Myanmar, and internationally. It offers marine fuel oil, high speed diesel oil, lubricants, and benzene. The company also provides catering and housekeeping services for oil and gas drilling crew; management services for solar power plant; generates electricity from solar power plant, and sells solar roof tops; and produces and distributes solvents and liquefied petroleum products, including white spirit, rubber solvent, diesel, and fuel oil. It serves land customers, factories, and transportation industries. The company was founded in 1997 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "SGJH.F": {
        "short_name": "SINOPEC SHANGHAI H  YC 1",
        "long_name": "Sinopec Shanghai Petrochemical Company Limited",
        "summary": "Sinopec Shanghai Petrochemical Company Limited, together with its subsidiaries, manufactures and sells petrochemical products in the People's Republic of China. It operates through five segments: Synthetic Fibres, Resins and Plastics, Intermediate Petrochemical Products, Petroleum Products, and Trading of Petrochemical Products. The Synthetic Fibres segment produces polyesters, acrylic fibers, and carbon fibers that are primarily used in the textile and apparel industries. The Resins and Plastics segment produces polyester chips that are used to produce polyester fibers, coating, and containers; polyethylene resins and plastics, which are used to produce insulated cables and mulching films, as well as molded products, such as housewares and toys; and polypropylene resins that are used for films and sheets, as well as molded products, such as housewares, toys, consumer electronics, and automobile parts; and PVA granules. The Intermediate Petrochemical Products segment produces p-xylene, benzene, and ethylene oxide, which are used as raw materials in the production of other petrochemicals, resins, plastics, and synthetic fibers. The Petroleum Products segment operates crude oil distillation facilities that produce vacuum and atmospheric gas oils used as feedstock; and residual oil and low octane gasoline fuels, as well as produces various fuels, such as diesel oil, jet fuel, heavy oil, and liquefied petroleum gas for transportation, industry, and household heating applications. The Trading of Petrochemical Products segment is involved in the import and export of petrochemical products. The company was founded in 1972 and is based in Shanghai, the People's Republic of China. Sinopec Shanghai Petrochemical Company Limited is a subsidiary of China Petroleum & Chemical Corporation.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    },
    "SGP-R.BK": {
        "short_name": "SIAMGAS AND PETROCHEMICALS",
        "long_name": "Siamgas and Petrochemicals Public Company Limited",
        "summary": "Siamgas and Petrochemicals Public Company Limited, together with its subsidiaries, trades in liquefied petroleum gas (LPG) and petrochemical products in Thailand and internationally. The company operates through Petroleum and Petrochemical Products, Transportation Services, and Other segments. It is also involved in the trading of petroleum for household cooking, industry, and transportation sectors. In addition, the company provides transportation services by land and ship; manufactures and distributes LPG cylinders; and offers warehousing and storage, and oil depots and port services. The company was formerly known as VSPP Development Company Limited. Siamgas and Petrochemicals Public Company Limited was founded in 2001 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "SGP.BK": {
        "short_name": "SIAMGAS AND PETROCHEMICALS",
        "long_name": "Siamgas and Petrochemicals Public Company Limited",
        "summary": "Siamgas and Petrochemicals Public Company Limited, together with its subsidiaries, trades in liquefied petroleum gas (LPG) and petrochemical products in Thailand and internationally. The company operates through Petroleum and Petrochemical Products, Transportation Services, and Other segments. It is also involved in the trading of petroleum for household cooking, industry, and transportation sectors. In addition, the company provides transportation services by land and ship; manufactures and distributes LPG cylinders; and offers warehousing and storage, and oil depots and port services. The company was formerly known as VSPP Development Company Limited. Siamgas and Petrochemicals Public Company Limited was founded in 2001 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "SHI": {
        "short_name": "SINOPEC Shangai Petrochemical C",
        "long_name": "Sinopec Shanghai Petrochemical Company Limited",
        "summary": "Sinopec Shanghai Petrochemical Company Limited, together with its subsidiaries, manufactures and sells petrochemical products in the People's Republic of China. It operates through five segments: Synthetic Fibres, Resins and Plastics, Intermediate Petrochemical Products, Petroleum Products, and Trading of Petrochemical Products. The Synthetic Fibres segment produces polyesters, acrylic fibers, and carbon fibers that are primarily used in the textile and apparel industries. The Resins and Plastics segment produces polyester chips that are used to produce polyester fibers, coating, and containers; polyethylene resins and plastics, which are used to produce insulated cables and mulching films, as well as molded products, such as housewares and toys; and polypropylene resins that are used for films and sheets, as well as molded products, such as housewares, toys, consumer electronics, and automobile parts; and PVA granules. The Intermediate Petrochemical Products segment produces p-xylene, benzene, and ethylene oxide, which are used as raw materials in the production of other petrochemicals, resins, plastics, and synthetic fibers. The Petroleum Products segment operates crude oil distillation facilities that produce vacuum and atmospheric gas oils used as feedstock; and residual oil and low octane gasoline fuels, as well as produces various fuels, such as diesel oil, jet fuel, heavy oil, and liquefied petroleum gas for transportation, industry, and household heating applications. The Trading of Petrochemical Products segment is involved in the import and export of petrochemical products. The company was founded in 1972 and is based in Shanghai, the People's Republic of China. Sinopec Shanghai Petrochemical Company Limited is a subsidiary of China Petroleum & Chemical Corporation.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Shanghai"
    },
    "SKE-R.BK": {
        "short_name": "SAKOL ENERGY PUBLIC COMPANY LIM",
        "long_name": "Sakol Energy Public Company Limited",
        "summary": "Sakol Energy Public Company Limited operates in the energy industry in Thailand. The company provides natural gas compression services to PTT Public Company Limited. It also produces and distributes electricity through a biomass plant, as well as compressed bio-methane gas; and engages in the rental of properties. The company was founded in 2009 and is headquartered in Pathum Thani, Thailand.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Pathum Thani"
    },
    "SKE.BK": {
        "short_name": "SAKOL ENERGY PUBLIC COMPANY LIM",
        "long_name": "Sakol Energy Public Company Limited",
        "summary": "Sakol Energy Public Company Limited operates in the energy industry in Thailand. The company provides natural gas compression services to PTT Public Company Limited. It also produces and distributes electricity through a biomass plant, as well as compressed bio-methane gas; and engages in the rental of properties. The company was founded in 2009 and is headquartered in Pathum Thani, Thailand.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Pathum Thani"
    },
    "SPRC-R.BK": {
        "short_name": "STAR PETROLEUM REFINING PUBLIC ",
        "long_name": "Star Petroleum Refining Public Company Limited",
        "summary": "Star Petroleum Refining Public Company Limited owns and operates a petroleum refinery in the Rayong Province of Thailand. It provides transportation fuels and petrochemical feedstock. The company also produces liquefied petroleum gas, polymer grade propylene, naphtha, gasoline, jet fuel, diesel, fuel oil, crude, reformate, sulfur, mixed C4, and asphalt. It exports its petroleum products to Laos, Cambodia, and Myanmar. The company was founded in 1992 and is based in Mueang Rayong, Thailand. Star Petroleum Refining Public Company Limited is a subsidiary of Chevron South Asia Holdings Pte. Ltd.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Mueang Rayong"
    },
    "SPRC.BK": {
        "short_name": "STAR PETROLEUM REFINING PUBLIC ",
        "long_name": "Star Petroleum Refining Public Company Limited",
        "summary": "Star Petroleum Refining Public Company Limited owns and operates a petroleum refinery in the Rayong Province of Thailand. It provides transportation fuels and petrochemical feedstock. The company also produces liquefied petroleum gas, polymer grade propylene, naphtha, gasoline, jet fuel, diesel, fuel oil, crude, reformate, sulfur, mixed C4, and asphalt. It exports its petroleum products to Laos, Cambodia, and Myanmar. The company was founded in 1992 and is based in Mueang Rayong, Thailand. Star Petroleum Refining Public Company Limited is a subsidiary of Chevron South Asia Holdings Pte. Ltd.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Mueang Rayong"
    },
    "SRLP": {
        "short_name": "Sprague Resources LP",
        "long_name": "Sprague Resources LP",
        "summary": "Sprague Resources LP engages in the purchase, storage, distribution, and sale of refined petroleum products and natural gas in the United States and Canada. The company operates through four segments: Refined Products, Natural Gas, Materials Handling, and Other Operations. The Refined Products segment purchases and sells various refined products, such as heating oil, diesel fuel, residual fuel oil, kerosene, jet fuel, gasoline, and asphalt to wholesale, retail, and commercial customers. This segment's wholesale customers consist of approximately 1,100 home heating oil retailers, and diesel fuel and gasoline resellers; and commercial customers include federal and state agencies, municipalities, regional transit authorities, drill sites, large industrial companies, real estate management companies, hospitals, educational institutions, and asphalt paving companies. The natural gas segment purchases natural gas from natural gas producers and trading companies and sells and distributes natural gas to approximately 14,000 commercial and industrial customer locations across 13 states in the Northeast and Mid-Atlantic United States. The Materials Handling segment offloads, stores, and prepares for the delivery of various customer-owned products, including asphalt, crude oil, clay slurry, salt, gypsum, residual fuel oil, coal, petroleum coke, caustic soda, tallow, pulp, and heavy equipment. The Other Operations segment engages in coal marketing and distribution; and commercial trucking activities. As of December 31, 2019, the company had combined storage capacity of 14.3 million barrels for refined products and other liquid materials, as well as 2.0 million square feet of materials handling capacity. Sprague Resources LP was founded in 1870 and is headquartered in Portsmouth, New Hampshire.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Portsmouth"
    },
    "SRNW": {
        "short_name": "STRATOS RENERABLES CORPORATION",
        "long_name": "Stratos Renewables Corporation",
        "summary": "Stratos Renewables Corporation, a development stage company, focuses on the production, processing, and distribution of sugarcane ethanol in Peru. The company is based in Beverly Hills, California.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Beverly Hills"
    },
    "SRS.MI": {
        "short_name": "SARAS",
        "long_name": "Saras S.p.A.",
        "summary": "Saras S.p.A. engages in the oil refinery business in Italy and internationally. It operates through Refining, Marketing, Generation of Power By The Combined Cycle Plant, Generation of Power By Wind Farms, and Other Activities segments. The company sells and distributes oil products, such as diesel, gasoline, diesel fuel for heating, liquefied petroleum gas, virgin naphtha, and aviation fuel in the retail and wholesale markets. It also generates and sells electricity through an integrated gasification combined cycle plant with a total installed capacity of 575 megawatts; and a wind farm with a total installed capacity of 126 megawatts. In addition, the company provides consultancy, engineering, and technological development services in the oil refining, petrochemical, chemical, and energy industry sectors, as well as offers reinsurance products. Further, it owns and operates depots located in Arcola and Cartagena. The company was founded in 1962 and is headquartered in Milan, Italy.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "city": "Milan"
    },
    "SUN": {
        "short_name": "Sunoco LP",
        "long_name": "Sunoco LP",
        "summary": "Sunoco LP, together with its subsidiaries, engages in the distribution and retailing of motor fuels in the United States. It operates through two segments, Fuel Distribution and Marketing, and All Other. The Fuel Distribution and Marketing segment purchases motor fuel from independent refiners and major oil companies and supplies it to independently operated dealer stations, distributors and other consumer of motor fuel, and partnership operated stations, as well as to commission agent locations. The All Other segment operates retail stores that offer motor fuel, merchandise, foodservice, and other services that include car washes, lottery, automated teller machines, money orders, prepaid phone cards, and wireless services. It also leases and rents real estate properties. Sunoco GP LLC serves as the general partner of the company. The company was formerly known as Susser Petroleum Partners LP and changed its name to Sunoco LP in October 2014. Sunoco LP was incorporated in 2012 and is headquartered in Dallas, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Dallas"
    },
    "SUSCO-R.BK": {
        "short_name": "SUSCO PUBLIC COMPANY LIMITED",
        "long_name": "Susco Public Company Limited",
        "summary": "Susco Public Company Limited engages in the wholesale and retail of fuel products in Thailand, Cambodia, Myanmar, Laos, and China. The company sells benzene, diesel oil, gasohol, natural gas, liquefied petroleum gas, and lubricants, as well as marts. It also provides management services; leases land and service stations; and offers the right to use the trademark license. The company was formerly known as Siam United Services Public Company Limited and changed its name to Susco Public Company Limited in December 2010. Susco Public Company Limited was founded in 1977 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "SUSCO.BK": {
        "short_name": "SUSCO PUBLIC COMPANY LIMITED",
        "long_name": "Susco Public Company Limited",
        "summary": "Susco Public Company Limited engages in the wholesale and retail of fuel products in Thailand, Cambodia, Myanmar, Laos, and China. The company sells benzene, diesel oil, gasohol, natural gas, liquefied petroleum gas, and lubricants, as well as marts. It also provides management services; leases land and service stations; and offers the right to use the trademark license. The company was formerly known as Siam United Services Public Company Limited and changed its name to Susco Public Company Limited in December 2010. Susco Public Company Limited was founded in 1977 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "TOAOF": {
        "short_name": "TOA OIL COMPANY LIMITED",
        "long_name": "TOA Oil Co., Ltd.",
        "summary": "TOA Oil Co., Ltd., together with its subsidiaries, engages in petroleum refining and power generation business in Japan. The company offers various oil products, such as gasoline, kerosene, diesel oil and heavy oil. The company was formerly known as Nippon Jyuyu Co., Ltd. and changed its name to TOA Oil Co., Ltd. in April 1942. The company was founded in 1924 and is headquartered in Kawasaki, Japan. TOA Oil Co., Ltd. is a subsidiary of Showa Shell Sekiyu K.K.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Kawasaki"
    },
    "TOIPF": {
        "short_name": "THAI OIL PUBLIC CO LIMITED",
        "long_name": "Thai Oil Public Company Limited",
        "summary": "Thai Oil Public Company Limited, together with its subsidiaries, engages in oil refining and distribution business in Thailand and internationally. It operates through Oil Refinery, Lube Base Oil Refinery, Petrochemical, Power Generation, Marine Transportation Services, Solvent, Ethanol, and Other segments. The company produces gasoline, diesel/gas oil, jet fuel, kerosene, fuel oil, and liquefied petroleum gas; and petrochemical products, such as paraxylene, benzene, toluene, and mixed xylenes. It also produces and distributes lube base oil, bitumen/asphalt, and other by-products, as well as special products, such as treated distillate aromatics extract and slack wax; and hydrocarbon and chemical solvents, and other chemicals. In addition, the company operates natural gas-fired combined-cycle co-generation power plants that generate and sell electricity, steam, and utilities to industrial users, as well as invests in other power generating companies and related business. Further, it is involved in the marine transportation of petroleum and petrochemical products; production of ethanol; and provision of crew boat services. Additionally, the company offers human resource management services; and manufactures and sells linear alkyl benzene and related products. Thai Oil Public Company Limited was founded in 1961 and is headquartered in Bangkok, Thailand.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "TOP-R.BK": {
        "short_name": "THAI OIL PUBLIC COMPANY LIMITED",
        "long_name": "Thai Oil Public Company Limited",
        "summary": "Thai Oil Public Company Limited, together with its subsidiaries, engages in oil refining and distribution business in Thailand and internationally. It operates through Oil Refinery, Lube Base Oil Refinery, Petrochemical, Power Generation, Marine Transportation Services, Solvent, Ethanol, and Other segments. The company produces gasoline, diesel/gas oil, jet fuel, kerosene, fuel oil, and liquefied petroleum gas; and petrochemical products, such as paraxylene, benzene, toluene, and mixed xylenes. It also produces and distributes lube base oil, bitumen/asphalt, and other by-products, as well as special products, such as treated distillate aromatics extract and slack wax; and hydrocarbon and chemical solvents, and other chemicals. In addition, the company operates natural gas-fired combined-cycle co-generation power plants that generate and sell electricity, steam, and utilities to industrial users, as well as invests in other power generating companies and related business. Further, it is involved in the marine transportation of petroleum and petrochemical products; production of ethanol; and provision of crew boat services. Additionally, the company offers human resource management services; and manufactures and sells linear alkyl benzene and related products. Thai Oil Public Company Limited was founded in 1961 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "TPIG.F": {
        "short_name": "IRPC PCL -FOREIGN-  BA 1",
        "long_name": "IRPC Public Company Limited",
        "summary": "IRPC Public Company Limited, together with its subsidiaries, provides petroleum and petrochemical products in Thailand, Singapore, and internationally. The company operates through Petroleum Products, Petrochemical Products, and Other Business segments. Its petroleum products include refined oil comprising liquefied petroleum gas, naphtha, gasoline, diesel, and fuel oil; and lube base oil and asphalt. The company's petrochemical products comprise olefins, such as ethylene, propylene, and butadiene; aromatics comprising benzene, toluene, and xylene; polymers consisting of high-density polyethylene, polypropylene, acrylonitrile-butadiene-styrene, acrylonitrile styrene, polystyrene, and expandable polystyrene; and polyols. It also provides electricity, steam, and infrastructure, including wastewater treatment and other related services; wastewater treatment for industrial customers; port and tank services; and other business services. In addition, the company also offers tugboats, pilots, service boats, mooring, freshwater, bunkers, nautical charts, cranes, hopper cars, weighing, cargo yards, and warehouse services; and tank storage services, as well as operates liquid and chemical, and bulk and container terminals. Further, it offers asset management services in Rayong and other provinces; and various support services, as well as engages in the power plant, jetty, and other utilities operations. Additionally, the company manufactures and distributes plastic resins, as well as chemical products for polyurethanes; operates vocational schools; distributes petrochemical products; and provision of oil vessel renting services. The company was formerly known as Thai Petrochemical Industry Public Company Limited and changed its name to IRPC Public Company Limited in October 2006. IRPC Public Company Limited was incorporated in 1978 and is headquartered in Rayong, Thailand.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Rayong"
    },
    "TUPRS.IS": {
        "short_name": "TUPRAS",
        "long_name": "Türkiye Petrol Rafinerileri A.S.",
        "summary": "TÃ¼rkiye Petrol Rafinerileri A.S., together with its subsidiaries, engages in the refining crude oil, petroleum, and chemical products in Turkey and internationally. It is also involved in the purchase, sale, import, export, storage, and marketing of petroleum products, LPG, and natural gas. The company's products include liquid petroleum gases, fuel oils, base oils, waxes, extracts, and bitumen and bitumen binders, as well as white spirits, cutting oils, clarified oils, petroleum coke, and sulphur products. In addition, it engages in the transportation of crude oil and petroleum products; operation of factories and facilities in petrochemical and energy related industries; and air, maritime, road, and rail transportation activities, as well as provision of mooring and tug services. The company was founded in 1983 and is headquartered in KÃ¶rfez, Turkey. TÃ¼rkiye Petrol Rafinerileri A.S. is a subsidiary of Enerji Yatirimlari A.S.",
        "currency": "TRY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "city": "KÃ¶rfez"
    },
    "UGP": {
        "short_name": "Ultrapar Participacoes S.A. (Ne",
        "long_name": "Ultrapar Participações S.A.",
        "summary": "Ultrapar ParticipaÃ§Ãµes S.A. engages in the gas distribution, fuel distribution, chemicals, storage, and drugstores businesses primarily in Brazil, Mexico, Uruguay, Venezuela, other Latin American countries, the United States, Canada, the Far East, Europe, and internationally. Its Gas Distribution segment distributes liquefied petroleum gas to residential, commercial, and industrial consumers, as well as independent dealers primarily in the South, Southeast, and Northeast regions of Brazil. The company's Fuel Distribution segment distributes and markets gasoline, ethanol, diesel, fuel oil, kerosene, natural gas for vehicles, and lubricants and related activities through a network of 7,090 Ipiranga service stations. Its Chemicals segment produces ethylene oxide and its derivatives, as well as fatty alcohols, which are raw materials used in the home and personal care, agrochemical, paints, varnishes, and other industries. The company's Storage segment operates liquid bulk terminals primarily in the Southeast and Northeast regions of Brazil. Its Drugstores segment trades in pharmaceutical, hygiene, and beauty products through its own drugstore chain in the North, Northeast, and Southeast regions of Brazil. The company also operates Abastece AÃ­, a digital payments app for the purchase of fuels, and other products and services. Ultrapar ParticipaÃ§Ãµes S.A. was founded in 1937 and is headquartered in SÃ£o Paulo, Brazil.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Brazil",
        "city": "SÃ£o Paulo"
    },
    "UGPA3.SA": {
        "short_name": "ULTRAPAR    ON      NM",
        "long_name": "Ultrapar Participações S.A.",
        "summary": "Ultrapar ParticipaÃ§Ãµes S.A. engages in the gas distribution, fuel distribution, chemicals, storage, and drugstores businesses primarily in Brazil, Mexico, Uruguay, Venezuela, other Latin American countries, the United States, Canada, the Far East, Europe, and internationally. Its Gas Distribution segment distributes liquefied petroleum gas to residential, commercial, and industrial consumers, as well as independent dealers primarily in the South, Southeast, and Northeast regions of Brazil. The company's Fuel Distribution segment distributes and markets gasoline, ethanol, diesel, fuel oil, kerosene, natural gas for vehicles, and lubricants and related activities through a network of 7,090 Ipiranga service stations. Its Chemicals segment produces ethylene oxide and its derivatives, as well as fatty alcohols, which are raw materials used in the home and personal care, agrochemical, paints, varnishes, and other industries. The company's Storage segment operates liquid bulk terminals primarily in the Southeast and Northeast regions of Brazil. Its Drugstores segment trades in pharmaceutical, hygiene, and beauty products through its own drugstore chain in the North, Northeast, and Southeast regions of Brazil. The company also operates Abastece AÃ­, a digital payments app for the purchase of fuels, and other products and services. Ultrapar ParticipaÃ§Ãµes S.A. was founded in 1937 and is headquartered in SÃ£o Paulo, Brazil.",
        "currency": "BRL",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "city": "SÃ£o Paulo"
    },
    "UGR.F": {
        "short_name": "ULTRAPAR PART. PFD ADR 1",
        "long_name": "Ultrapar Participações S.A.",
        "summary": "Ultrapar ParticipaÃ§Ãµes S.A. engages in the gas distribution, fuel distribution, chemicals, storage, and drugstores businesses primarily in Brazil, Mexico, Uruguay, Venezuela, other Latin American countries, the United States, Canada, the Far East, Europe, and internationally. Its Gas Distribution segment distributes liquefied petroleum gas to residential, commercial, and industrial consumers, as well as independent dealers primarily in the South, Southeast, and Northeast regions of Brazil. The company's Fuel Distribution segment distributes and markets gasoline, ethanol, diesel, fuel oil, kerosene, natural gas for vehicles, and lubricants and related activities through a network of 7,090 Ipiranga service stations. Its Chemicals segment produces ethylene oxide and its derivatives, as well as fatty alcohols, which are raw materials used in the home and personal care, agrochemical, paints, varnishes, and other industries. The company's Storage segment operates liquid bulk terminals primarily in the Southeast and Northeast regions of Brazil. Its Drugstores segment trades in pharmaceutical, hygiene, and beauty products through its own drugstore chain in the North, Northeast, and Southeast regions of Brazil. The company also operates Abastece AÃ­, a digital payments app for the purchase of fuels, and other products and services. Ultrapar ParticipaÃ§Ãµes S.A. was founded in 1937 and is headquartered in SÃ£o Paulo, Brazil.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Brazil",
        "city": "SÃ£o Paulo"
    },
    "V1L.F": {
        "short_name": "VALERO ENERGY CORP.DL-,01",
        "long_name": "Valero Energy Corporation",
        "summary": "Valero Energy Corporation manufactures and sells transportation fuels and petrochemical products in the United States, Canada, the United Kingdom, Ireland, and internationally. It operates through three segments: Refining, Ethanol, and Renewable Diesel. The company is involved in oil and gas refining, marketing, and bulk selling activities. It produces conventional and premium gasolines, gasoline meeting the specifications of the California Air Resources Board (CARB), diesel fuels, low-sulfur and ultra-low-sulfur diesel fuels, CARB diesel, other distillates, jet fuels, asphalts, petrochemicals, lubricants, and other refined petroleum products. As of December 31, 2019, the company owned 15 petroleum refineries with a combined throughput capacity of approximately 3.15 million barrels per day. It markets its refined products through wholesale rack and bulk markets; and through approximately 7,000 outlets under the Valero, Beacon, Diamond Shamrock, Shamrock, Ultramar, and Texaco brand names. The company also produces and sells ethanol, distiller grains, and corn oil primarily to refiners and gasoline blenders, as well as to animal feed customers. It owns and operates 14 ethanol plants with a combined ethanol production capacity of approximately 1.73 billion gallons per year. In addition, the company owns, operates, develops, and acquires crude oil and refined petroleum products pipelines, terminals, and other transportation and logistics assets. Further, it owns and operates a plant that processes animal fats, used cooking oils, and other vegetable oils into renewable diesel. The company was formerly known as Valero Refining and Marketing Company and changed its name to Valero Energy Corporation in August 1997. Valero Energy Corporation was founded in 1980 and is headquartered in San Antonio, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "San Antonio"
    },
    "VEA.AX": {
        "short_name": "VIVA E GRP FPO",
        "long_name": "Viva Energy Group Limited",
        "summary": "Viva Energy Group Limited operates as an energy company in Australia, Singapore, and Papua New Guinea. The company operates in three segments: Retail, Fuels and Marketing; Refining; and Supply, Corporate and Overheads. The Retail, Fuels and Marketing segment supplies and markets fuel products to a network of approximately 1,300 retail service stations, as well as to other retail operators and wholesalers. It is also involved in supplying fuel, lubricants, and specialty hydrocarbon products to commercial customers in the aviation, marine, transport, resources, and construction and manufacturing industries. This segment sells its products primarily under Shell and Viva Energy brands. The Refining segment owns and operates a refinery in Geelong, Victoria. It offers petroleum products, such as gasoline, diesel, jet fuel, aviation gasoline, gas, solvents, bitumen, and other specialty products. The Supply, Corporate and Overheads segment owns and manages an integrated supply chain of terminals, storage tanks, depots, pipelines, and distribution assets in Australia. Viva Energy Group Limited was incorporated in 2018 and is based in Docklands, Australia.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Docklands"
    },
    "VLO": {
        "short_name": "Valero Energy Corporation",
        "long_name": "Valero Energy Corporation",
        "summary": "Valero Energy Corporation manufactures and sells transportation fuels and petrochemical products in the United States, Canada, the United Kingdom, Ireland, and internationally. It operates through three segments: Refining, Ethanol, and Renewable Diesel. The company is involved in oil and gas refining, marketing, and bulk selling activities. It produces conventional and premium gasolines, gasoline meeting the specifications of the California Air Resources Board (CARB), diesel fuels, low-sulfur and ultra-low-sulfur diesel fuels, CARB diesel, other distillates, jet fuels, asphalts, petrochemicals, lubricants, and other refined petroleum products. As of December 31, 2019, the company owned 15 petroleum refineries with a combined throughput capacity of approximately 3.15 million barrels per day. It markets its refined products through wholesale rack and bulk markets; and through approximately 7,000 outlets under the Valero, Beacon, Diamond Shamrock, Shamrock, Ultramar, and Texaco brand names. The company also produces and sells ethanol, distiller grains, and corn oil primarily to refiners and gasoline blenders, as well as to animal feed customers. It owns and operates 14 ethanol plants with a combined ethanol production capacity of approximately 1.73 billion gallons per year. In addition, the company owns, operates, develops, and acquires crude oil and refined petroleum products pipelines, terminals, and other transportation and logistics assets. Further, it owns and operates a plant that processes animal fats, used cooking oils, and other vegetable oils into renewable diesel. The company was formerly known as Valero Refining and Marketing Company and changed its name to Valero Energy Corporation in August 1997. Valero Energy Corporation was founded in 1980 and is headquartered in San Antonio, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "San Antonio"
    },
    "VLO.MX": {
        "short_name": "VALERO ENERGY CORP",
        "long_name": "Valero Energy Corporation",
        "summary": "Valero Energy Corporation manufactures and sells transportation fuels and petrochemical products in the United States, Canada, the United Kingdom, Ireland, and internationally. It operates through three segments: Refining, Ethanol, and Renewable Diesel. The company is involved in oil and gas refining, marketing, and bulk selling activities. It produces conventional and premium gasolines, gasoline meeting the specifications of the California Air Resources Board (CARB), diesel fuels, low-sulfur and ultra-low-sulfur diesel fuels, CARB diesel, other distillates, jet fuels, asphalts, petrochemicals, lubricants, and other refined petroleum products. As of December 31, 2019, the company owned 15 petroleum refineries with a combined throughput capacity of approximately 3.15 million barrels per day. It markets its refined products through wholesale rack and bulk markets; and through approximately 7,000 outlets under the Valero, Beacon, Diamond Shamrock, Shamrock, Ultramar, and Texaco brand names. The company also produces and sells ethanol, distiller grains, and corn oil primarily to refiners and gasoline blenders, as well as to animal feed customers. It owns and operates 14 ethanol plants with a combined ethanol production capacity of approximately 1.73 billion gallons per year. In addition, the company owns, operates, develops, and acquires crude oil and refined petroleum products pipelines, terminals, and other transportation and logistics assets. Further, it owns and operates a plant that processes animal fats, used cooking oils, and other vegetable oils into renewable diesel. The company was formerly known as Valero Refining and Marketing Company and changed its name to Valero Energy Corporation in August 1997. Valero Energy Corporation was founded in 1980 and is headquartered in San Antonio, Texas.",
        "currency": "MXN",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "San Antonio"
    },
    "VLOE34.SA": {
        "short_name": "VALERO ENER DRN",
        "long_name": "Valero Energy Corporation",
        "summary": "Valero Energy Corporation manufactures and sells transportation fuels and petrochemical products in the United States, Canada, the United Kingdom, Ireland, and internationally. It operates through three segments: Refining, Ethanol, and Renewable Diesel. The company is involved in oil and gas refining, marketing, and bulk selling activities. It produces conventional and premium gasolines, gasoline meeting the specifications of the California Air Resources Board (CARB), diesel fuels, low-sulfur and ultra-low-sulfur diesel fuels, CARB diesel, other distillates, jet fuels, asphalts, petrochemicals, lubricants, and other refined petroleum products. As of December 31, 2019, the company owned 15 petroleum refineries with a combined throughput capacity of approximately 3.15 million barrels per day. It markets its refined products through wholesale rack and bulk markets; and through approximately 7,000 outlets under the Valero, Beacon, Diamond Shamrock, Shamrock, Ultramar, and Texaco brand names. The company also produces and sells ethanol, distiller grains, and corn oil primarily to refiners and gasoline blenders, as well as to animal feed customers. It owns and operates 14 ethanol plants with a combined ethanol production capacity of approximately 1.73 billion gallons per year. In addition, the company owns, operates, develops, and acquires crude oil and refined petroleum products pipelines, terminals, and other transportation and logistics assets. Further, it owns and operates a plant that processes animal fats, used cooking oils, and other vegetable oils into renewable diesel. The company was formerly known as Valero Refining and Marketing Company and changed its name to Valero Energy Corporation in August 1997. Valero Energy Corporation was founded in 1980 and is headquartered in San Antonio, Texas.",
        "currency": "BRL",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "San Antonio"
    },
    "VTNR": {
        "short_name": "Vertex Energy, Inc",
        "long_name": "Vertex Energy, Inc.",
        "summary": "Vertex Energy, Inc., an environmental services company, provides a range of services designed to aggregate, process, and recycle industrial and commercial waste systems in the Gulf Coast and Central Midwest regions of the United States. The company operates in three segments: Black Oil, Refining and Marketing, and Recovery. The Black Oil segment collects and purchases used motor oil directly from third-party generators; aggregates used motor oil from a network of local and regional collectors; and sells used motor oil to customers for use as a feedstock or replacement fuel for industrial burners. It also produces and sells a vacuum gas oil product to refineries and marine fuels market; and base oil product to lubricant packagers and distributors. The Refining and Marketing segment gathers hydrocarbon streams in the form of petroleum distillates, transmix, and other chemical products that are purchased from pipeline operators, refineries, chemical processing facilities, and third-party providers; and sells end products, such as gasoline blendstock, pygas, and fuel oil cutter stock to oil companies or to petroleum trading and blending companies. The Recovery segment generates solutions for the recovery and management of hydrocarbon streams; and owns and operates a fleet of trucks and other vehicles used for shipping and handling equipment and scrap materials. Vertex Energy, Inc. is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "VVO.JO": {
        "short_name": "Vivo Energy plc",
        "long_name": "Vivo Energy plc",
        "summary": "Vivo Energy plc operates as a retailer and distributor of fuels and lubricants in Africa. It operates through three segments: Retail, Commercial, and Lubricants. The Retail segment sells petrol and diesel fuels at Shell and Engen-branded service stations; operates convenience retail shops, and quick service and fast casual restaurants; and provides other services, including lubricant bays, car washes, and ATMs. As of December 31, 2019, it operated 2,226 service stations in 23 countries under the Shell and Engen brands. The Commercial segment offers fuels, lubricants, and related product services to commercial customers in the transport, construction, power and industrial, infrastructure, mining, aviation, and marine sectors; and supplies liquefied petroleum gas primarily to consumers and fuels to the wholesale market. The Lubricants segment sells lubricants to commercial customers and retail consumers through service station forecourts and lubricant bays, as well as oil and repair shops, service centres, and resellers through a network of distributors; supplies lubricants to mining companies and B2B customers; and export of products to approximately 10 other African markets. The company was formerly known as VE Holding plc and changed its name to Vivo Energy plc in April 2018. Vivo Energy plc was founded in 2011 and is based in London, the United Kingdom.",
        "currency": "ZAc",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JNB",
        "market": "za_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "VVO.L": {
        "short_name": "VIVO ENERGY PLC ORD USD0.50",
        "long_name": "Vivo Energy plc",
        "summary": "Vivo Energy plc operates as a retailer and distributor of fuels and lubricants in Africa. It operates through three segments: Retail, Commercial, and Lubricants. The Retail segment sells petrol and diesel fuels at Shell and Engen-branded service stations; operates convenience retail shops, and quick service and fast casual restaurants; and provides other services, including lubricant bays, car washes, and ATMs. As of December 31, 2019, it operated 2,226 service stations in 23 countries under the Shell and Engen brands. The Commercial segment offers fuels, lubricants, and related product services to commercial customers in the transport, construction, power and industrial, infrastructure, mining, aviation, and marine sectors; and supplies liquefied petroleum gas primarily to consumers and fuels to the wholesale market. The Lubricants segment sells lubricants to commercial customers and retail consumers through service station forecourts and lubricant bays, as well as oil and repair shops, service centres, and resellers through a network of distributors; supplies lubricants to mining companies and B2B customers; and export of products to approximately 10 other African markets. The company was formerly known as VE Holding plc and changed its name to Vivo Energy plc in April 2018. Vivo Energy plc was founded in 2011 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "VVV": {
        "short_name": "Valvoline Inc.",
        "long_name": "Valvoline Inc.",
        "summary": "Valvoline Inc. manufactures, markets, and supplies, engine and automotive maintenance products and services. It operates through three segments: Quick Lubes, Core North America, and International. The company offers lubricants for passenger car, light duty, and heavy duty; antifreeze/coolants for original equipment manufacturers; functional and maintenance chemicals, such as brake fluids and power steering fluids, as well as specialty coatings for automotive and industrial applications comprising rust prevention and sound absorption; and oil and air filters for light-duty vehicles. It also provides windshield wiper blades, light bulbs, serpentine belts, and drain plugs. In addition, the company operates Valvoline instant oil change service centers. As of October 28, 2020, it operated and franchised approximately 1,500 quick-lube locations under the Valvoline Instant Oil Change brand in the United States and the Great Canadian Oil Change brand in Canada. The company also serves car dealers, general repair shops, and third-party quick lube locations, as well as through distributors. It has operations in North America, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. Valvoline Inc. was founded in 1866 and is headquartered in Lexington, Kentucky.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Lexington"
    },
    "W8M1.F": {
        "short_name": "RPCG PCL -NVDR-  BA 1",
        "long_name": "RPCG Public Company Limited",
        "summary": "RPCG Public Company Limited, through its subsidiaries, engages in the energy and real estate businesses in Thailand. It engages in the sale of equipment, including repair and maintenance services, and construction to petroleum service stations; sale of liquefied petroleum gas through a network of gas station. The company is also involved in the manufacture and distribution of biodiesel and glycerin; and provision of systems management services. In addition, it develops, rents, and sells real estate properties. The company was formerly known as Rayong Purifier Public Company Limited and changed its name to RPCG Public Company Limited in January 2014. RPCG Public Company Limited was founded in 1995 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "WFK.F": {
        "short_name": "WORLD FUEL SVCS  DL-,01",
        "long_name": "World Fuel Services Corporation",
        "summary": "World Fuel Services Corporation engages in the distribution of fuel, and related products and services in the aviation, marine, and land transportation industries worldwide. Its Aviation segment supplies fuel, and related products and services to commercial airlines, second and third tier airlines, cargo carriers, regional and low-cost carriers, airports, fixed based operators, corporate fleets, fractional operators, private aircraft, the U.S. and foreign governments, intergovernmental organizations, and military customers. This segment also offers fuel management, price risk management, ground handling, and dispatch services, as well as international trip planning services, such as flight plans, weather reports, and overflight permits. The company's Land segment offers fuel, heating oil, propane, natural gas, lubricants, and related products and services to petroleum distributors and retail petroleum operators, as well as industrial, commercial, residential, and government customers. This segment also offers management services for procuring fuel and price risk management; advisory and fulfillment solutions related to power, natural gas, and other energy products; and card payment solutions, government payment systems for fuel procurement, merchant processing services, toll payment solutions, and commercial payment programs. Its Marine segment markets fuel, lubricants, and related products and services to international container and tanker fleets, commercial cruise lines, yachts and time charter operators, offshore rig owners and operators, the U.S. and foreign governments, and other fuel suppliers. Its marine fuel-related services include management services to procure fuel, cost control, quality control, claims management, and card payment and related processing services. This segment also engages in the fueling of vessels, and transportation and delivery of fuel and fuel-related products. The company was founded in 1984 and is headquartered in Miami, Florida.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Miami"
    },
    "WIQ.F": {
        "short_name": "CLEAN ENERGY FUELS CORP.",
        "long_name": "Clean Energy Fuels Corp.",
        "summary": "Clean Energy Fuels Corp. provides natural gas as an alternative fuel for vehicle fleets, primarily in the United States and Canada. The company supplies renewable natural gas (RNG), compressed natural gas (CNG), and liquefied natural gas (LNG) for light, medium, and heavy-duty vehicles; and offers operation and maintenance services for public and private vehicle fleet customer stations. It also designs, builds, operates, and maintains fueling stations; sells and services natural gas fueling compressors and other equipment that are used in CNG and LNG stations; and provides assessment, design, and modification solutions to offer operators with code-compliant service and maintenance facilities for natural gas vehicle fleets. In addition, the company transports and sells CNG and LNG through virtual natural gas pipelines and interconnects; procures and sells RNG; sells tradable credits, such as RNG and conventional natural gas as a vehicle fuel comprising Renewable Identification Numbers and Low Carbon Fuel Standards credits; enables its customers to acquire and finance natural gas vehicles; and obtains federal, state and local credits, grants, and incentives. It serves heavy-duty trucking, airports, refuse, public transit, industrial, and institutional energy users, as well as government fleets. As of December 31, 2019, the company served approximately 1,000 fleet customers operating approximately 48,000 natural gas vehicles; and owned, operated, or supplied approximately 550 natural gas fueling stations in 41 states in the United States and four provinces in Canada. Clean Energy Fuels Corp. was incorporated in 2001 and is headquartered in Newport Beach, California.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Newport Beach"
    },
    "WTLC": {
        "short_name": "WESTERN METALS CORPORATION",
        "long_name": "Western Metals Corporation",
        "summary": "Western Metals Corporation owns and operates natural gas wells in the Lindsey Slough Field in Solano County, California. It produces natural gas from land leased and administered by the California State Lands Commission. The company was formerly known as Coastcast Corporation and changed its name to Western Metals Corporation in November 2004. Western Metals Corporation was founded in 1980 and is based in St. Louis, Missouri.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "St. Louis"
    },
    "XIC.F": {
        "short_name": "KLAIPEDOS NAFTA AB EO0,29",
        "long_name": "AB Klaipedos nafta",
        "summary": "AB Klaipedos nafta engages in the operation of oil terminal, oil products transshipment, and other related activities primarily in Lithuania. It operates through KNF, SGD, SNT, and GDP segments. The company also operates liquefied natural gas terminals. It transships oil products, including diesel fuel of various types, gasoline of various types, jet fuel, fuel oil of various types, biofuel, vacuum gas oil, and crude oil products; reloads crude oil and oil products into trucks; and accumulates and stores crude oil and oil products. The company also engages in the collection of waste water from sea vessels; mooring; inspection of quality parameters of oil products; blending of heavy and light oil products; and supply of fuel and water to vessels. In addition, it stores and handles oil products; and adds bio-additives and marks substances to oil products. The company was founded in 1994 and is based in Klaipeda, Lithuania.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Lithuania",
        "city": "Klaipeda"
    },
    "Y35.SI": {
        "short_name": "AnAn Intl",
        "long_name": "AnAn International Limited",
        "summary": "AnAn International Limited, an investment holding company, engages in the trading of petrochemical, fuel oil, and petroleum products. It offers crude oil; light ends products, such as LPG, NGLs, naphtha, gasoline and blending components, etc.; middle distillates products, including kerosene and diesel; heavy ends products, which include vacuum gasoil, straight-run fuel oil, cracked fuel oil, asphalt, etc.; and chemical products comprising paraxylene, mixed xylenes, glycol, styrene, natural runner, etc. The company also engages in the derivatives trading of energy commodities, as well as invests in energy sector. It has operations in Europe, Singapore, Hong Kong, the People's Republic of China, and internationally. The company was formerly known as CEFC International Limited and changed its name to AnAn International Limited in September 2017. AnAn International Limited was incorporated in 2004 and is based in Singapore. AnAn International Limited is a subsidiary of AnAn Group (Singapore) Pte. Ltd.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}