{
    "002267.SZ": {
        "short_name": "SHAANXI PROVINCIAL",
        "long_name": "Shaanxi Provincial Natural Gas Co.Ltd",
        "summary": "Shaanxi Provincial Natural Gas Co.Ltd, a natural gas company, engages in the planning, construction, operation, management, and distribution of natural gas in Shaanxi Province, China. It operates Jingbian to Xi'an, Xianyang to Baoji, Xi'an to Weinan, Baoji to Hanzhong, Hanzhong to Ankang, etc. pipelines with a total mileage of approximately 3,300 kilometers. The company was founded in 1995 and is based in Xi'an, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": "710016",
        "website": "http://www.shaanxigas.com",
        "market_cap": 7973613568
    },
    "002492.SZ": {
        "short_name": "ZHUHAI WINBASE INT",
        "long_name": "Zhuhai Winbase International Chemical Tank Terminal Co., Ltd.",
        "summary": "Zhuhai Winbase International Chemical Tank Terminal Co., Ltd. engages in bulk liquid petrochemicals and finished oil products business in China. It is involved in the loading and discharging, storage, and transferring activities. The company was founded in 2000 and is based in Zhuhai, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": null,
        "website": "http://www.winbase-tank.com",
        "market_cap": 2247750144
    },
    "03G.F": {
        "short_name": "GASLOG PARTNERS UTS",
        "long_name": "GasLog Partners LP",
        "summary": "GasLog Partners LP owns, operates, and acquires liquefied natural gas (LNG) carriers under multi-year charters. As of March 2, 2021, it operated a fleet of 15 LNG carriers with an average carrying capacity of approximately 158,000 cubic meters. The company was founded in 2014 and is based in Piraeus, Greece.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Greece",
        "state": null,
        "city": "Piraeus",
        "zipcode": "18537",
        "website": "http://www.gaslogmlp.com",
        "market_cap": 133098512
    },
    "0934.HK": {
        "short_name": "SINOPEC KANTONS",
        "long_name": "Sinopec Kantons Holdings Limited",
        "summary": "Sinopec Kantons Holdings Limited, an investment holding company, provides crude oil jetty services. It operates through, Crude Oil Jetty and Storage Services; and Vessel Chartering and Logistics Services segments. The company offers crude oil transportation, unloading, storage, and other jetty services for oil tankers in the People's Republic of China (PRC), Europe, and the Middle East; and vessel chartering services for liquefied natural gas transportation in the PRC, Australia, and the Papua New Guinea. It also engages in the trading of crude oil; and provision of oil supporting and ancillary services. The company was founded in 1998 and is headquartered in Causeway Bay, Hong Kong. Sinopec Kantons Holdings Limited is a subsidiary of Sinopec Kantons International Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.sinopec.com.hk",
        "market_cap": 8055157760
    },
    "0DA.F": {
        "short_name": "DORIAN LPG LTD  DL-,01",
        "long_name": "Dorian LPG Ltd.",
        "summary": "Dorian LPG Ltd., together with its subsidiaries, engages in the transportation of liquefied petroleum gas (LPG) through its LPG tankers worldwide. The company owns and operates very large gas carriers (VLGCs). As of March 31, 2020, its fleet consisted of twenty-four VLGCs. The company was founded in 2013 and is headquartered in Stamford, Connecticut.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CT",
        "city": "Stamford",
        "zipcode": "06902",
        "website": "http://www.dorianlpg.com",
        "market_cap": 488152192
    },
    "0E41.F": {
        "short_name": "ENLINK MIDSTREAM UTS",
        "long_name": "EnLink Midstream, LLC",
        "summary": "EnLink Midstream, LLC provides midstream energy services in the United States. It operates through Permian, North Texas, Oklahoma, Louisiana, and Corporate segments. The company is involved in gathering, compressing, treating, processing, transporting, storing, and selling natural gas; fractionating, transporting, storing, and selling natural gas liquids; and gathering, transporting, stabilizing, storing, trans-loading, and selling crude oil and condensate, as well as providing brine disposal services. Its midstream energy asset network includes approximately 11,900 miles of pipelines; 22 natural gas processing plants; 7 fractionators; barge and rail terminals; product storage facilities; brine disposal wells; and a crude oil trucking fleet. The company was incorporated in 2013 and is based in Dallas, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75201",
        "website": "http://www.enlink.com",
        "market_cap": 2366931712
    },
    "1EX.SG": {
        "short_name": "Exmar S.A. Actions au Port. o.N",
        "long_name": "Exmar NV",
        "summary": "Exmar NV provides shipping and energy supply chain solutions worldwide. It operates through three segments: Shipping, Infrastructure, and Supporting Services. The company transports liquefied gas products, such as liquid petroleum gas, butane, propane, anhydrous ammonia, and petrochemical gases. It also provides ownership, leasing, operation, and maintenance infrastructure solutions to the oil and gas industry, as well as engages in engineering and construction supervision activities. In addition, the company builds, owns, and operates LNG Infrastructure comprising floating liquefaction of natural gas units, and floating storage and regasification units, as well as provides ship-to-ship transfer services. Further, it provides ship management services, consultancy and engineering, and travel agency services; and manufactures ropes for marine and offshore applications. Additionally, the company designs, builds, installs, and operates floating production, storage, and offloading units; and operates, crews, refurbishes, and maintains accommodation barges. Exmar NV was founded in 1829 and is headquartered in Antwerp, Belgium.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Belgium",
        "state": null,
        "city": "Antwerp",
        "zipcode": "2000",
        "website": "http://www.exmar.be",
        "market_cap": 236980992
    },
    "1T4.F": {
        "short_name": "TORM PLC A  DK-,01",
        "long_name": "TORM plc",
        "summary": "TORM plc, a product tanker company, engages in the transportation of refined oil products and crude oil worldwide. The company transports gasoline, jet fuel, naphtha, and diesel. As of March 1, 2021, it operated a fleet of approximately 80 vessels. The company was founded in 1889 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC3V 9DU",
        "website": "http://www.torm.com",
        "market_cap": 565592128
    },
    "2KD.DE": {
        "short_name": "KINDER MORGAN P DL-,01",
        "long_name": "Kinder Morgan, Inc.",
        "summary": "Kinder Morgan, Inc. operates as an energy infrastructure company in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and underground storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas liquefaction and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; and owns interests in/or operates oil fields and gasoline processing plants, as well as operates a crude oil pipeline system in West Texas. It owns and operates approximately 83,000 miles of pipelines and 144 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1936 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://www.kindermorgan.com",
        "market_cap": 35689783296
    },
    "2KD.F": {
        "short_name": "KINDER MORGAN P DL-,01",
        "long_name": "Kinder Morgan, Inc.",
        "summary": "Kinder Morgan, Inc. operates as an energy infrastructure company in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and underground storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas liquefaction and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; and owns interests in/or operates oil fields and gasoline processing plants, as well as operates a crude oil pipeline system in West Texas. It owns and operates approximately 83,000 miles of pipelines and 144 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1936 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://www.kindermorgan.com",
        "market_cap": 35304804352
    },
    "37W.F": {
        "short_name": "EQUITRANS MIDSTREAM",
        "long_name": "Equitrans Midstream Corporation",
        "summary": "Equitrans Midstream Corporation owns, operates, acquires, and develops natural gas gathering, transmission and storage, and water services assets in the Appalachian Basin. It operates through three segments: Gathering System, Transmission and Storage System, and Water Service System. The Gathering System segment include 1,130 miles of high-pressure gathering lines with compression of approximately 485,000 horsepower and multiple interconnect points; and approximately 910 miles of Federal Energy Regulatory Commission (FERC) low-pressure gathering lines. The Transmission and Storage System segment comprises 950 miles of FERC regulated interstate pipeline that connects to seven interstate pipelines and local distribution companies. The Water Service System segment include two independent systems comprised approximately 200 miles of pipeline that deliver fresh water from the Monongahela River, the Ohio River, local reservoirs, and various regional waterways. Equitrans Midstream Corporation was incorporated in 2018 and is headquartered in Canonsburg, Pennsylvania.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "Canonsburg",
        "zipcode": "15317-0269",
        "website": "http://www.equitransmidstream.com",
        "market_cap": 3291450880
    },
    "3R4.F": {
        "short_name": "RATTLER MIDSTREAM LP",
        "long_name": "Rattler Midstream LP",
        "summary": "Rattler Midstream LP owns, operates, develops, and acquires midstream and energy-related infrastructure assets in the Midland and Delaware Basins of the Permian Basin in West Texas. The company operates in two segments, Midstream Services and Real Estate Operations. It provides crude oil, natural gas, and water-related midstream services. As of December 31, 2020, the company owned and operated 927 miles of crude oil, natural gas, sourced water and produced water gathering pipelines on acreage that overlays Diamondback's seven core Midland and Delaware Basin development areas. It also rents real estate properties. Rattler Midstream GP LLC serves as the general partner of the company. The company was formerly known as Rattler Midstream Partners LP. The company was incorporated in 2018 and is based in Midland, Texas. Rattler Midstream LP is a subsidiary of Diamondback Energy, Inc.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Midland",
        "zipcode": "79701",
        "website": "http://www.rattlermidstream.com",
        "market_cap": 1426801792
    },
    "3R4.MU": {
        "short_name": "RATTLER MIDSTREAM LP",
        "long_name": "Rattler Midstream LP",
        "summary": "Rattler Midstream LP owns, operates, develops, and acquires midstream and energy-related infrastructure assets in the Midland and Delaware Basins of the Permian Basin in West Texas. The company operates in two segments, Midstream Services and Real Estate Operations. It provides crude oil, natural gas, and water-related midstream services. As of December 31, 2020, the company owned and operated 927 miles of crude oil, natural gas, sourced water and produced water gathering pipelines on acreage that overlays Diamondback's seven core Midland and Delaware Basin development areas. It also rents real estate properties. Rattler Midstream GP LLC serves as the general partner of the company. The company was formerly known as Rattler Midstream Partners LP. The company was incorporated in 2018 and is based in Midland, Texas. Rattler Midstream LP is a subsidiary of Diamondback Energy, Inc.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Midland",
        "zipcode": "79701",
        "website": "http://www.rattlermidstream.com",
        "market_cap": 1404301184
    },
    "3TKA.F": {
        "short_name": "TEEKAY TANKERS P.R.S.-,01",
        "long_name": "Teekay Tankers Ltd.",
        "summary": "Teekay Tankers Ltd. provides marine transportation services to oil industries in Bermuda and internationally. The company offers voyage and time charter services; and offshore Ship-to-ship transfer services of commodities primarily crude oil and refined oil products, as well as liquid gases and various other products. It also provides tanker commercial and technical management, liquefied natural gas terminal management, consultancy, procurement, equipment rental, and other related services; and lightering support services, including, full-service lightering and other lightering support services. As of December 31, 2020, the company owned and leased 52 double-hull oil tankers, and 9 time chartered-in tankers. Its vessels are employed through long-term, fixed-rate time-charter contracts and spot tanker market. The company was founded in 2007 and is based in Hamilton, Canada.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Hamilton",
        "zipcode": "HM 08",
        "website": "http://www.teekay.com/business/tankers",
        "market_cap": 419144704
    },
    "41S.F": {
        "short_name": "SINOSTAR PEC HLDGS LTD",
        "long_name": "Sinostar PEC Holdings Limited",
        "summary": "Sinostar PEC Holdings Limited, an investment holding company, produces and supplies petrochemical products in the People's Republic of China. It operates in two segments, Gas Separation, and Transport and Logistic Services. The company offers liquefied petroleum gas (LPG), which is used as a source of fuel by households and industrial manufacturers; propylene, an organic compound to produce chemical intermediates, such as polypropylene and vinyl; purified isobutylene, methyl tert-butyl ether, and hydrogen; and polypropylene, a thermoplastic polymer under the Hengchang brand that is used to produce plastic products for various industrial applications. It also provides logistics and transportation services for LPG and petroleum related products. Sinostar PEC Holdings Limited sells its products to manufacturers of petrochemical and plastic products, as well as LPG distributors. The company was incorporated in 2006 and is based in Singapore. Sinostar PEC Holdings Limited is a subsidiary of Intelligent People Holdings Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Dongming",
        "zipcode": "274500",
        "website": "http://www.sinostar-pec.com",
        "market_cap": 141727712
    },
    "5711.F": {
        "short_name": "ANTERO MIDSTREAM  DL -,01",
        "long_name": "Antero Midstream Corporation",
        "summary": "Antero Midstream Corporation owns, operates, and develops midstream energy infrastructure. It operates through two segments, Gathering and Processing, and Water Handling. The Gathering and Processing segment includes a network of gathering pipelines and compressor stations that collects and processes production from Antero Resources' wells in West Virginia and Ohio. The Water Handling segment delivers fresh water; and offers other fluid handling services, such as wastewater transportation, disposal, and treatment, as well as high rate transfer services. The company was incorporated in 2013 and is headquartered in Denver, Colorado.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CO",
        "city": "Denver",
        "zipcode": "80202",
        "website": "http://www.anteromidstream.com",
        "market_cap": 4192235776
    },
    "5NVA.F": {
        "short_name": "NAVIOS MARIT.AC.DL -,0001",
        "long_name": "Navios Maritime Acquisition Corporation",
        "summary": "Navios Maritime Acquisition Corporation provides marine transportation services worldwide. The company owns a fleet of crude oil, refined petroleum product, and chemical tankers. The company charters its vessels to oil companies, refiners, and large vessel operators. As of April 20, 2021, its fleet consisted of a total of 46 double-hulled tanker vessels, aggregating approximately 6.0 million deadweight tons, which includes 13 very large crude carrier tankers (VLCCs), including two bareboat chartered-in VLCCs. Navios Maritime Acquisition Corporation was founded in 2008 and is based in Grand Cayman, Cayman Islands.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "1104",
        "website": "http://www.navios-acquisition.com",
        "market_cap": 48366676
    },
    "5PD.SI": {
        "short_name": "$ Hengyang Petro",
        "long_name": "Hengyang Petrochemical Logistics Limited",
        "summary": "Hengyang Petrochemical Logistics Limited, an investment holding company, provides logistics service for the petrochemical industry in the People's Republic of China. It offers storage and land transportation services for bulk liquid petrochemicals, gases, and oils, such as methanol, acetic acid, phenol, acetone, styrene, ethylene glycol, polyether polyol, propane, butane, gasoline, diesel, and fuel oil and base oil. The company also provides whole-tank leasing, and spot leasing services, as well as manages port terminal. Hengyang Petrochemical Logistics Limited was founded in 2002 and is based in Jiangyin, the People's Republic of China.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "state": null,
        "city": "Jiangyin",
        "zipcode": "214446",
        "website": "http://www.hyplc.com",
        "market_cap": 31740072
    },
    "5XU.F": {
        "short_name": "TOPAZ ENERGY CORP",
        "long_name": "Topaz Energy Corp.",
        "summary": "Topaz Energy Corp. operates as a royalty and energy infrastructure company. It operates through the segments, Royalty Assets and Infrastructure Assets. The company holds gross overriding royalty interests on approximately 3.0 million gross acres of developed and undeveloped lands. It is also involved in natural gas processing activities. The company was formerly known as Exshaw Oil Corp. and changed its name to Topaz Energy Corp. in November 2019. Topaz Energy Corp. was incorporated in 2006 and is headquartered in Calgary, Canada.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 3H7",
        "website": "http://topazenergy.ca",
        "market_cap": 1247043584
    },
    "600617.SS": {
        "short_name": "SHANXI GUOXIN ENERGY CORPORATIO",
        "long_name": "Shanxi Guoxin Energy Corporation Limited",
        "summary": "Shanxi Guoxin Energy Corporation Limited engages in the energy management business. The company's products primarily include natural gas, coal bed methane, and coal gas. It also provides energy sector related consulting services. The company was formerly known as Shanghai Lianhua Synthetic Fiber Co., Ltd. and changed its name to Shanxi Guoxin Energy Corporation Limited in July 2014. The company was incorporated in 1992 and is based in Taiyuan, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taiyuan",
        "zipcode": null,
        "website": "http://www.600617.com.cn",
        "market_cap": 5453432320
    },
    "8117.HK": {
        "short_name": "CHI P ENERGY",
        "long_name": "China Primary Energy Holdings Limited",
        "summary": "China Primary Energy Holdings Limited, an investment holding company, primarily engages in the transmission and distribution of natural gas in the People's Republic of China and Hong Kong. The company operates through three segments: Transmission and Distribution of Natural Gas; Trading of Electronic Components; and Property Investment. It also engages in the development and use of energy technology; operation of heat and power cogeneration plant; and heat generation activities. The company was formerly known as China Primary Resources Holdings Limited. China Primary Energy Holdings Limited was incorporated in 2001 and is headquartered in Tsim Sha Tsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://china-p-energy.etnet.com.hk",
        "market_cap": 204798000
    },
    "8GB.F": {
        "short_name": "GIBSON ENERGY INC.",
        "long_name": "Gibson Energy Inc.",
        "summary": "Gibson Energy Inc., an oil infrastructure company, engages in the gathering, storage, optimization, processing, and marketing of crude oil and refined products in North America. It operates through two segments, Infrastructure and Marketing. The Infrastructure segment operates a network of infrastructure assets that include oil terminals, rail loading and unloading facilities, gathering pipelines, and a crude oil processing facility. The Marketing segment purchases, sells, stores, and optimizes hydrocarbon products, including crude oil, natural gas liquids, road asphalt, roofing flux, frac oils, light and heavy straight run distillates, combined vacuum gas oil, and an oil-based mud product. The company was formerly known as Gibson Energy Holdings ULC and changed its name to Gibson Energy Inc. in April 2011. Gibson Energy Inc. was founded in 1950 and is headquartered in Calgary, Canada.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 5E9",
        "website": "http://www.gibsonenergy.com",
        "market_cap": 2596158208
    },
    "900913.SS": {
        "short_name": "SHANXI GUOXIN ENERGY CORPORATIO",
        "long_name": "Shanxi Guoxin Energy Corporation Limited",
        "summary": "Shanxi Guoxin Energy Corporation Limited engages in the energy management business. The company's products primarily include natural gas, coal bed methane, and coal gas. It also provides energy sector related consulting services. The company was formerly known as Shanghai Lianhua Synthetic Fiber Co., Ltd. and changed its name to Shanxi Guoxin Energy Corporation Limited in July 2014. The company was incorporated in 1992 and is based in Taiyuan, China.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taiyuan",
        "zipcode": null,
        "website": "http://www.600617.com.cn",
        "market_cap": 5628387328
    },
    "AEGISCHEM.NS": {
        "short_name": "AEGIS LOGISTICS",
        "long_name": "Aegis Logistics Limited",
        "summary": "Aegis Logistics Limited, together with its subsidiaries, operates as an oil, gas, and chemical logistics company in the downstream oil and gas sector primarily in India. It operates through Liquid Terminal Division and Gas Terminal Division segments. The company operates a network of bulk liquid handling terminals, liquefied petroleum gas (LPG) terminals, filling plants, pipelines, and gas stations to deliver products and services. It also owns and operates a network of shore based tank farm installations for the receipt and handling of bulk liquids, including hazardous chemicals, petroleum products, and petrochemicals. In addition, the company engages in sourcing, shipping, and distribution of LPG and propane; offers supply chain management services from product planning, sourcing, and shipping to receipt, storage, and dispatch by pipeline and tankers to the point of consumption; delivers pressurized and refrigerated cargoes to various ports on the coastline of India; markets LPG and propane in bulk to industrial clients; provides clean energy solutions to companies for their various processes and applications; and offers conversion services to switch from other energy sources to LPG. Further, it provides engineering, procurement, and construction services in the oil and gas sector; and refueling services to ship owners and charterers. The company serves industrial companies, as well as individual retail customers at its Aegis Autogas stations. Aegis Logistics Limited was incorporated in 1956 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.aegisindia.com",
        "market_cap": 132200472576
    },
    "ALTM": {
        "short_name": "Altus Midstream Company",
        "long_name": "Altus Midstream Company",
        "summary": "Altus Midstream Company owns gas gathering, processing, and transmission assets in the Permian Basin of West Texas. As of December 31, 2019, its assets included approximately 178 miles of in-service natural gas gathering, 55 miles of residue gas, and 38 miles of natural gas liquids (NGL) pipelines; three cryogenic processing trains; and an NGL truck loading terminal with six lease automatic custody transfer units and eight NGL bullet tanks. The company is based in Houston, Texas. Altus Midstream Company is a subsidiary of Apache Midstream LLC.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77056-4400",
        "website": "http://www.altusmidstream.com",
        "market_cap": 1070481856
    },
    "AM": {
        "short_name": "Antero Midstream Corporation",
        "long_name": "Antero Midstream Corporation",
        "summary": "Antero Midstream Corporation owns, operates, and develops midstream energy infrastructure. It operates through two segments, Gathering and Processing, and Water Handling. The Gathering and Processing segment includes a network of gathering pipelines and compressor stations that collects and processes production from Antero Resources' wells in West Virginia and Ohio. The Water Handling segment delivers fresh water; and offers other fluid handling services, such as wastewater transportation, disposal, and treatment, as well as high rate transfer services. The company was incorporated in 2013 and is headquartered in Denver, Colorado.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Denver",
        "zipcode": "80202",
        "website": "http://www.anteromidstream.com",
        "market_cap": 4315316224
    },
    "AMG1L.VS": {
        "short_name": "Amber Grid",
        "long_name": "AB Amber Grid",
        "summary": "AB Amber Grid operates as a natural gas transmission system company in the Republic of Lithuania. The company is involved in the transmission of natural gas through high pressure pipelines to system users. It also operates, maintains, and develops natural gas transmission system that includes gas transmission pipelines, gas compressor stations, gas metering and distribution stations, and cathodic protection installations, as well as data transmission and telecommunications systems. The company's natural gas transmission system consists of 2,115 km of gas transmission pipelines, 65 gas distribution stations, 3 gas metering stations, and 2 gas compressor stations. It serves companies operating in the sectors of electricity, district heating, and industry; and medium-sized local businesses, as well as natural gas suppliers receiving natural gas transmission services. The company was founded in 2013 and is based in Vilnius, the Republic of Lithuania. AB Amber Grid is a subsidiary of UAB EPSO-G.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "03116",
        "website": "http://www.ambergrid.lt",
        "market_cap": 205140448
    },
    "BKEP": {
        "short_name": "Blueknight Energy Partners L.P.",
        "long_name": "Blueknight Energy Partners, L.P.",
        "summary": "Blueknight Energy Partners, L.P. provides integrated terminalling services for companies engaged in the production, distribution, and handling of liquid asphalt in the United States. As of March 4, 2021, it had 53 terminals located in 26 states. Blueknight Energy Partners G.P., L.L.C. operates as a general partner of the company. The company was formerly known as SemGroup Energy Partners, L.P. and changed its name to Blueknight Energy Partners, L.P. in December 2009. Blueknight Energy Partners, L.P. was founded in 2007 and is headquartered in Tulsa, Oklahoma.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "state": "OK",
        "city": "Tulsa",
        "zipcode": "74135",
        "website": "http://www.bkep.com",
        "market_cap": 164213680
    },
    "BKEPP": {
        "short_name": "Blueknight Energy Partners L.P.",
        "long_name": "Blueknight Energy Partners, L.P.",
        "summary": "Blueknight Energy Partners, L.P. provides integrated terminalling services for companies engaged in the production, distribution, and handling of liquid asphalt in the United States. As of March 4, 2021, it had 53 terminals located in 26 states. Blueknight Energy Partners G.P., L.L.C. operates as a general partner of the company. The company was formerly known as SemGroup Energy Partners, L.P. and changed its name to Blueknight Energy Partners, L.P. in December 2009. Blueknight Energy Partners, L.P. was founded in 2007 and is headquartered in Tulsa, Oklahoma.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "OK",
        "city": "Tulsa",
        "zipcode": "74135",
        "website": "http://www.bkep.com",
        "market_cap": 343281376
    },
    "BPMP": {
        "short_name": "BP Midstream Partners LP",
        "long_name": "BP Midstream Partners LP",
        "summary": "BP Midstream Partners LP owns, acquires, develops, and operates pipelines and other midstream assets in the United States. Its assets consist of interests in entities that own crude oil, natural gas, refined products, and diluent pipelines as well as refined product terminals. BP Midstream Partners GP LLC serves as a general partner of BP Midstream Partners LP. The company was incorporated in 2017 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77079",
        "website": "http://www.bp.com/en/global/bp-midstream-partners.html",
        "market_cap": 1434424448
    },
    "BROG": {
        "short_name": "Brooge Energy Limited",
        "long_name": "Brooge Energy Limited",
        "summary": "Brooge Energy Limited, through its subsidiaries, provides oil storage and related services at the Port of Fujairah in the emirate of Fujairah in the United Arab Emirates. The company operates phase I facility that comprises 14 storage tanks with an aggregate geometric capacity of 399,324 cbm for the storage, heating, and blending of fuel oil and clean petroleum products, including aviation fuel, gas oil, gasoline, marine gas oil, and naphtha. It also provides ancillary services, which comprise blending and circulation, heating, throughput, and intertank transfer. The company was formerly known as Brooge Holdings Limited and changed its name to Brooge Energy Limited in April 2020. Brooge Energy Limited was incorporated in 2019 and is headquartered in Fujairah, the United Arab Emirates.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United Arab Emirates",
        "state": null,
        "city": "Fujairah",
        "zipcode": null,
        "website": "http://broogeenergy.com",
        "market_cap": 1001634368
    },
    "BWEK.OL": {
        "short_name": "BW EPIC KOSAN LTD",
        "long_name": "BW Epic Kosan Ltd.",
        "summary": "BW Epic Kosan Ltd., together with its subsidiaries, owns and operates a fleet of pressurized gas carriers in Southeast Asia, Europe, West Africa, and the United States. The company operates a fleet of 76 vessels that provide seaborne services for the transportation of liquefied petroleum gas and petrochemicals, which serve as a link in the international gas and petrochemical supply chains of various oil and commodity trading houses. It also offers commercial and technical management services for various ship owners, as well as engages in vessel owning and chartering activities. The company was formerly known as Epic Gas Ltd and changed its name to BW Epic Kosan Ltd in March 2021. The company was incorporated in 2012 and is headquartered in Singapore. BW Epic Kosan Ltd. is a subsidiary of BW Group Limited.",
        "currency": "NOK",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "059818",
        "website": "http://www.bwek.com",
        "market_cap": 2121658368
    },
    "C9Q.SI": {
        "short_name": "Sinostar Pec",
        "long_name": "Sinostar PEC Holdings Limited",
        "summary": "Sinostar PEC Holdings Limited, an investment holding company, produces and supplies petrochemical products in the People's Republic of China. It operates in two segments, Gas Separation, and Transport and Logistic Services. The company offers liquefied petroleum gas (LPG), which is used as a source of fuel by households and industrial manufacturers; propylene, an organic compound to produce chemical intermediates, such as polypropylene and vinyl; purified isobutylene, methyl tert-butyl ether, and hydrogen; and polypropylene, a thermoplastic polymer under the Hengchang brand that is used to produce plastic products for various industrial applications. It also provides logistics and transportation services for LPG and petroleum related products. Sinostar PEC Holdings Limited sells its products to manufacturers of petrochemical and plastic products, as well as LPG distributors. The company was incorporated in 2006 and is based in Singapore. Sinostar PEC Holdings Limited is a subsidiary of Intelligent People Holdings Limited.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "state": null,
        "city": "Dongming",
        "zipcode": "274500",
        "website": "http://www.sinostar-pec.com",
        "market_cap": 262400000
    },
    "CEQP-P": {
        "short_name": "Crestwood Equity Partners LP Pr",
        "long_name": "Crestwood Equity Partners LP",
        "summary": "Crestwood Equity Partners LP provides a range of infrastructure solutions to liquids-rich natural gas and crude oil shale plays in the United States. It operates through three segments: Gathering and Processing (G&P); Storage and Transportation (S&T); and Marketing, Supply and Logistics (MS&L). The G&P segment offers gathering and transportation services for natural gas, crude oil, and produced water; and processing, treating, compression, and disposal services for natural gas. The S&T segment provides crude oil and natural gas storage and transportation services to producers, utilities, and other customers; and operates crude oil terminals in the Bakken and Powder River Basin, as well as natural gas storage and transportation assets in the Northeast and Texas Gulf Coast. The MS&L segment offers natural gas liquid (NGL), crude oil, and natural gas marketing and logistics services to producers, refiners, marketers, and other customers. The company owns and operates natural gas facilities with approximately 2.9 billion cubic feet of natural gas/day (Bcf/d) of gathering capacity and 1.2 Bcf/d of processing capacity; crude oil facilities with approximately 150,000 Bbls/d of gathering capacity and 266,000 Bbls of storage capacity; and produced water facilities with approximately 180,000 Bbls/d of gathering and disposal capacity. Crestwood Equity GP LLC serves as the general partner of Crestwood Equity Partners LP. The company was formerly known as Inergy L.P. and changed its name to Crestwood Equity Partners LP in October 2013. Crestwood Equity Partners LP was founded in 2001 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://www.crestwoodlp.com",
        "market_cap": null
    },
    "CEQP": {
        "short_name": "Crestwood Equity Partners LP",
        "long_name": "Crestwood Equity Partners LP",
        "summary": "Crestwood Equity Partners LP provides a range of infrastructure solutions to liquids-rich natural gas and crude oil shale plays in the United States. It operates through three segments: Gathering and Processing (G&P); Storage and Transportation (S&T); and Marketing, Supply and Logistics (MS&L). The G&P segment offers gathering and transportation services for natural gas, crude oil, and produced water; and processing, treating, compression, and disposal services for natural gas. The S&T segment provides crude oil and natural gas storage and transportation services to producers, utilities, and other customers; and operates crude oil terminals in the Bakken and Powder River Basin, as well as natural gas storage and transportation assets in the Northeast and Texas Gulf Coast. The MS&L segment offers natural gas liquid (NGL), crude oil, and natural gas marketing and logistics services to producers, refiners, marketers, and other customers. The company owns and operates natural gas facilities with approximately 2.9 billion cubic feet of natural gas/day (Bcf/d) of gathering capacity and 1.2 Bcf/d of processing capacity; crude oil facilities with approximately 150,000 Bbls/d of gathering capacity and 266,000 Bbls of storage capacity; and produced water facilities with approximately 180,000 Bbls/d of gathering and disposal capacity. Crestwood Equity GP LLC serves as the general partner of Crestwood Equity Partners LP. The company was formerly known as Inergy L.P. and changed its name to Crestwood Equity Partners LP in October 2013. Crestwood Equity Partners LP was founded in 2001 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://www.crestwoodlp.com",
        "market_cap": 1868632576
    },
    "CHQ1.F": {
        "short_name": "CHENIERE ENERGY  DL-,003",
        "long_name": "Cheniere Energy, Inc.",
        "summary": "Cheniere Energy, Inc., an energy infrastructure company, engages in the liquefied natural gas (LNG) related businesses in the United States. It owns and operates the Sabine Pass LNG terminal in Cameron Parish, Louisiana; and the Corpus Christi LNG terminal near Corpus Christi, Texas. The company also owns Creole Trail pipeline, a 94-mile pipeline interconnecting the Sabine Pass LNG terminal with various interstate pipelines; and operates Corpus Christi pipeline, a 23-mile natural gas supply pipeline that interconnects the Corpus Christi LNG terminal with various interstate and intrastate natural gas pipelines. It is also involved in the LNG and natural gas marketing business. The company was incorporated in 1983 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://www.cheniere.com",
        "market_cap": 18494896128
    },
    "CQP": {
        "short_name": "Cheniere Energy Partners, LP Ch",
        "long_name": "Cheniere Energy Partners, L.P.",
        "summary": "Cheniere Energy Partners, L.P., through its subsidiaries, owns and operates regasification facilities at the Sabine Pass liquefied natural gas (LNG) terminal located in Cameron Parish, Louisiana on the Sabine-Neches Waterway. The company's regasification facilities include infrastructure of five LNG storage tanks with an aggregate capacity of approximately 17 billion cubic feet equivalent; two marine berths that accommodate vessels with capacity of up to 266,000 cubic meters; and vaporizers with regasification capacity of approximately 4 billion cubic feet per day. It also owns a 94-mile pipeline that interconnects the Sabine Pass LNG terminal with various interstate pipelines. Cheniere Energy Partners GP, LLC serves as the general partner of the company. Cheniere Energy Partners, L.P. was founded in 2003 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://cqpir.cheniere.com",
        "market_cap": 20919388160
    },
    "CWPE": {
        "short_name": "CW PETROLEUM CORPORATION",
        "long_name": "CW Petroleum Corp",
        "summary": "CW Petroleum Corp. supplies and distributes biodiesel, biodiesel blends, ultra-low sulfur diesel, and gasoline blends to distributors and end users in the United States. It also offers freight services for fuel and chemical hauling; metered offloads/split drops; tote/drumming services; and railcar transloading services. The company was incorporated in 2005 and is based in Katy, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Katy",
        "zipcode": "77494",
        "website": "http://www.cwpetroleumcorp.com",
        "market_cap": null
    },
    "D8EN.F": {
        "short_name": "DHT HLDGS INC.NEW DL -,01",
        "long_name": "DHT Holdings, Inc.",
        "summary": "DHT Holdings, Inc., through its subsidiaries, owns and operates crude oil tankers primarily in Monaco, Singapore, Oslo, and Norway. As of March 17, 2021, it had a fleet of 28 very large crude carriers with a capacity of 8,660,835 deadweight tons. The company was founded in 2005 and is headquartered in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "state": null,
        "city": "Hamilton",
        "zipcode": "HM 11",
        "website": "http://www.dhtankers.com",
        "market_cap": 937826880
    },
    "DCP": {
        "short_name": "DCP Midstream,  LP",
        "long_name": "DCP Midstream, LP",
        "summary": "DCP Midstream, LP, together with its subsidiaries, owns, operates, acquires, and develops a portfolio of midstream energy assets in the United States. The company operates in two segments, Logistics and Marketing, and Gathering and Processing. The Logistics and Marketing segment engages in transporting, trading, marketing, and storing natural gas and natural gas liquids (NGLs); and fractionating NGLs. The Gathering and Processing segment is involved in gathering, compressing, treating, and processing natural gas; producing and fractionating NGLs; and recovering condensate. The company owns and operates approximately 39 natural gas processing plants. It serves petrochemical and refining companies, and retail propane distributors. The company was formerly known as DCP Midstream Partners, LP and changed its name to DCP Midstream, LP in January 2017. DCP Midstream, LP was incorporated in 2005 and is headquartered in Denver, Colorado.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Denver",
        "zipcode": "80202",
        "website": "http://www.dcpmidstream.com",
        "market_cap": 5273591296
    },
    "DGL.F": {
        "short_name": "DYNAGAS LNG PTN.UTS DL-01",
        "long_name": "Dynagas LNG Partners LP",
        "summary": "Dynagas LNG Partners LP, through its subsidiaries, operates in the seaborne transportation industry worldwide. The company owns and operates liquefied natural gas (LNG) carriers. As of April 28, 2021, its fleet consisted of six LNG carriers with an aggregate carrying capacity of approximately 914,000 cubic meters. Dynagas GP LLC serves as the general partner of Dynagas LNG Partners LP. The company was incorporated in 2013 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "166 74",
        "website": "http://www.dynagaspartners.com",
        "market_cap": 83698888
    },
    "DHT": {
        "short_name": "DHT Holdings, Inc.",
        "long_name": "DHT Holdings, Inc.",
        "summary": "DHT Holdings, Inc., through its subsidiaries, owns and operates crude oil tankers primarily in Monaco, Singapore, Oslo, and Norway. As of March 17, 2021, it had a fleet of 28 very large crude carriers with a capacity of 8,660,835 deadweight tons. The company was founded in 2005 and is headquartered in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "state": null,
        "city": "Hamilton",
        "zipcode": "HM 11",
        "website": "http://www.dhtankers.com",
        "market_cap": 998124224
    },
    "DKL": {
        "short_name": "Delek Logistics Partners, L.P.",
        "long_name": "Delek Logistics Partners, LP",
        "summary": "Delek Logistics Partners, LP owns and operates logistics and marketing assets for crude oil, and intermediate and refined products in the United States. It operates in two segments, Pipelines and Transportation, and Wholesale Marketing and Terminalling. The Pipelines and Transportation segment includes pipelines, trucks, and ancillary assets that provide crude oil gathering, crude oil intermediate and finished products transportation, and storage services primarily in support of the Tyler, El Dorado, and Big Spring refineries, as well as offers crude oil and other products transportation services to third parties. This segment operates approximately 900 miles of crude oil gathering system. The Wholesale Marketing and Terminalling segment provides wholesale marketing, transporting, storage, and terminalling services related to refined products to independent third parties. Delek Logistics GP, LLC serves as the general partner of the company. Delek Logistics Partners, LP was founded in 2012 and is headquartered in Brentwood, Tennessee. Delek Logistics Partners, LP is a subsidiary of Delek US Holdings, Inc.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TN",
        "city": "Brentwood",
        "zipcode": "37027",
        "website": "http://www.deleklogistics.com",
        "market_cap": 1702977408
    },
    "DLNG-PB": {
        "short_name": "Dynagas LNG Partners LP 8.75% S",
        "long_name": "Dynagas LNG Partners LP",
        "summary": "Dynagas LNG Partners LP, through its subsidiaries, operates in the seaborne transportation industry worldwide. The company owns and operates liquefied natural gas (LNG) carriers. As of April 28, 2021, its fleet consisted of six LNG carriers with an aggregate carrying capacity of approximately 914,000 cubic meters. Dynagas GP LLC serves as the general partner of Dynagas LNG Partners LP. The company was incorporated in 2013 and is headquartered in Athens, Greece.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "166 74",
        "website": "http://www.dynagaspartners.com",
        "market_cap": 78747640
    },
    "DLNG": {
        "short_name": "Dynagas LNG Partners LP",
        "long_name": "Dynagas LNG Partners LP",
        "summary": "Dynagas LNG Partners LP, through its subsidiaries, operates in the seaborne transportation industry worldwide. The company owns and operates liquefied natural gas (LNG) carriers. As of April 28, 2021, its fleet consisted of six LNG carriers with an aggregate carrying capacity of approximately 914,000 cubic meters. Dynagas GP LLC serves as the general partner of Dynagas LNG Partners LP. The company was incorporated in 2013 and is headquartered in Athens, Greece.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "166 74",
        "website": "http://www.dynagaspartners.com",
        "market_cap": 101924368
    },
    "DSSI": {
        "short_name": "Diamond S Shipping Inc.",
        "long_name": "Diamond S Shipping Inc.",
        "summary": "Diamond S Shipping Inc. provides seaborne transportation of crude oil, refined petroleum, and other products in the international shipping markets. The company operates in two segments, Crude Tankers and Product Carriers. As of March 12, 2021, it owned and operated a fleet of 64 vessels, including 13 Suezmax crude carriers, one Aframax crude carrier, and 50 medium-range product tankers. Diamond S Shipping Inc. was founded in 2018 and is based in Greenwich, Connecticut.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Greenwich",
        "zipcode": "06830",
        "website": "http://www.diamondsshipping.com",
        "market_cap": 447776064
    },
    "EBBNF": {
        "short_name": "ENBRIDGE INC",
        "long_name": "Enbridge Inc.",
        "summary": "Enbridge Inc. operates as an energy infrastructure company. The company operates through five segments: Liquids Pipelines, Gas Transmission and Midstream, Gas Distribution and Storage, Renewable Power Generation, and Energy Services. The Liquids Pipelines segment operates pipelines and related terminals to transport various grades of crude oil and other liquid hydrocarbons in Canada and the United States. The Gas Transmission and Midstream segment invests in natural gas pipelines, and gathering and processing facilities in Canada and the United States. The Gas Distribution and Storage segment is involved in natural gas utility operations serving residential, commercial, and industrial customers in Ontario, as well as natural gas distribution and energy transportation activities in Quebec. The Renewable Power Generation segment operates power generating assets, such as wind, solar, geothermal, and waste heat recovery facilities; and transmission assets in North America and Europe. The Energy Services segment provides energy marketing services to refiners, producers, and other customers; and physical commodity marketing and logistical services in Canada and the United States. The company was formerly known as IPL Energy Inc. and changed its name to Enbridge Inc. in October 1998. Enbridge Inc. was founded in 1949 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 3L8",
        "website": "http://www.enbridge.com",
        "market_cap": 81157390336
    },
    "EBGEF": {
        "short_name": "ENBRIDGE INC 4.40% CUM RED PRF ",
        "long_name": "Enbridge Inc.",
        "summary": "Enbridge Inc. operates as an energy infrastructure company. The company operates through five segments: Liquids Pipelines, Gas Transmission and Midstream, Gas Distribution and Storage, Renewable Power Generation, and Energy Services. The Liquids Pipelines segment operates pipelines and related terminals to transport various grades of crude oil and other liquid hydrocarbons in Canada and the United States. The Gas Transmission and Midstream segment invests in natural gas pipelines, and gathering and processing facilities in Canada and the United States. The Gas Distribution and Storage segment is involved in natural gas utility operations serving residential, commercial, and industrial customers in Ontario, as well as natural gas distribution and energy transportation activities in Quebec. The Renewable Power Generation segment operates power generating assets, such as wind, solar, geothermal, and waste heat recovery facilities; and transmission assets in North America and Europe. The Energy Services segment provides energy marketing services to refiners, producers, and other customers; and physical commodity marketing and logistical services in Canada and the United States. The company was formerly known as IPL Energy Inc. and changed its name to Enbridge Inc. in October 1998. Enbridge Inc. was founded in 1949 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 3L8",
        "website": "http://www.enbridge.com",
        "market_cap": null
    },
    "EN3.F": {
        "short_name": "ENBRIDGE INC.",
        "long_name": "Enbridge Inc.",
        "summary": "Enbridge Inc. operates as an energy infrastructure company. The company operates through five segments: Liquids Pipelines, Gas Transmission and Midstream, Gas Distribution and Storage, Renewable Power Generation, and Energy Services. The Liquids Pipelines segment operates pipelines and related terminals to transport various grades of crude oil and other liquid hydrocarbons in Canada and the United States. The Gas Transmission and Midstream segment invests in natural gas pipelines, and gathering and processing facilities in Canada and the United States. The Gas Distribution and Storage segment is involved in natural gas utility operations serving residential, commercial, and industrial customers in Ontario, as well as natural gas distribution and energy transportation activities in Quebec. The Renewable Power Generation segment operates power generating assets, such as wind, solar, geothermal, and waste heat recovery facilities; and transmission assets in North America and Europe. The Energy Services segment provides energy marketing services to refiners, producers, and other customers; and physical commodity marketing and logistical services in Canada and the United States. The company was formerly known as IPL Energy Inc. and changed its name to Enbridge Inc. in October 1998. Enbridge Inc. was founded in 1949 and is headquartered in Calgary, Canada.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 3L8",
        "website": "http://www.enbridge.com",
        "market_cap": 65739554816
    },
    "ENB": {
        "short_name": "Enbridge Inc",
        "long_name": "Enbridge Inc.",
        "summary": "Enbridge Inc. operates as an energy infrastructure company. The company operates through five segments: Liquids Pipelines, Gas Transmission and Midstream, Gas Distribution and Storage, Renewable Power Generation, and Energy Services. The Liquids Pipelines segment operates pipelines and related terminals to transport various grades of crude oil and other liquid hydrocarbons in Canada and the United States. The Gas Transmission and Midstream segment invests in natural gas pipelines, and gathering and processing facilities in Canada and the United States. The Gas Distribution and Storage segment is involved in natural gas utility operations serving residential, commercial, and industrial customers in Ontario, as well as natural gas distribution and energy transportation activities in Quebec. The Renewable Power Generation segment operates power generating assets, such as wind, solar, geothermal, and waste heat recovery facilities; and transmission assets in North America and Europe. The Energy Services segment provides energy marketing services to refiners, producers, and other customers; and physical commodity marketing and logistical services in Canada and the United States. The company was formerly known as IPL Energy Inc. and changed its name to Enbridge Inc. in October 1998. Enbridge Inc. was founded in 1949 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 3L8",
        "website": "http://www.enbridge.com",
        "market_cap": 80568770560
    },
    "ENB.TO": {
        "short_name": "ENBRIDGE INC",
        "long_name": "Enbridge Inc.",
        "summary": "Enbridge Inc. operates as an energy infrastructure company. The company operates through five segments: Liquids Pipelines, Gas Transmission and Midstream, Gas Distribution and Storage, Renewable Power Generation, and Energy Services. The Liquids Pipelines segment operates pipelines and related terminals to transport various grades of crude oil and other liquid hydrocarbons in Canada and the United States. The Gas Transmission and Midstream segment invests in natural gas pipelines, and gathering and processing facilities in Canada and the United States. The Gas Distribution and Storage segment is involved in natural gas utility operations serving residential, commercial, and industrial customers in Ontario, as well as natural gas distribution and energy transportation activities in Quebec. The Renewable Power Generation segment operates power generating assets, such as wind, solar, geothermal, and waste heat recovery facilities; and transmission assets in North America and Europe. The Energy Services segment provides energy marketing services to refiners, producers, and other customers; and physical commodity marketing and logistical services in Canada and the United States. The company was formerly known as IPL Energy Inc. and changed its name to Enbridge Inc. in October 1998. Enbridge Inc. was founded in 1949 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 3L8",
        "website": "http://www.enbridge.com",
        "market_cap": 96922558464
    },
    "ENBBF": {
        "short_name": "ENBRIDGE INC",
        "long_name": "Enbridge Inc.",
        "summary": "Enbridge Inc. operates as an energy infrastructure company. The company operates through five segments: Liquids Pipelines, Gas Transmission and Midstream, Gas Distribution and Storage, Renewable Power Generation, and Energy Services. The Liquids Pipelines segment operates pipelines and related terminals to transport various grades of crude oil and other liquid hydrocarbons in Canada and the United States. The Gas Transmission and Midstream segment invests in natural gas pipelines, and gathering and processing facilities in Canada and the United States. The Gas Distribution and Storage segment is involved in natural gas utility operations serving residential, commercial, and industrial customers in Ontario, as well as natural gas distribution and energy transportation activities in Quebec. The Renewable Power Generation segment operates power generating assets, such as wind, solar, geothermal, and waste heat recovery facilities; and transmission assets in North America and Europe. The Energy Services segment provides energy marketing services to refiners, producers, and other customers; and physical commodity marketing and logistical services in Canada and the United States. The company was formerly known as IPL Energy Inc. and changed its name to Enbridge Inc. in October 1998. Enbridge Inc. was founded in 1949 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 3L8",
        "website": "http://www.enbridge.com",
        "market_cap": 81562345472
    },
    "ENBFF": {
        "short_name": "ENBRIDGE INC 4.40% CUM RED PFD ",
        "long_name": "Enbridge Inc.",
        "summary": "Enbridge Inc. operates as an energy infrastructure company. The company operates through five segments: Liquids Pipelines, Gas Transmission and Midstream, Gas Distribution and Storage, Renewable Power Generation, and Energy Services. The Liquids Pipelines segment operates pipelines and related terminals to transport various grades of crude oil and other liquid hydrocarbons in Canada and the United States. The Gas Transmission and Midstream segment invests in natural gas pipelines, and gathering and processing facilities in Canada and the United States. The Gas Distribution and Storage segment is involved in natural gas utility operations serving residential, commercial, and industrial customers in Ontario, as well as natural gas distribution and energy transportation activities in Quebec. The Renewable Power Generation segment operates power generating assets, such as wind, solar, geothermal, and waste heat recovery facilities; and transmission assets in North America and Europe. The Energy Services segment provides energy marketing services to refiners, producers, and other customers; and physical commodity marketing and logistical services in Canada and the United States. The company was formerly known as IPL Energy Inc. and changed its name to Enbridge Inc. in October 1998. Enbridge Inc. was founded in 1949 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 3L8",
        "website": "http://www.enbridge.com",
        "market_cap": null
    },
    "ENBL": {
        "short_name": "Enable Midstream Partners, LP",
        "long_name": "Enable Midstream Partners, LP",
        "summary": "Enable Midstream Partners, LP owns, operates, and develops midstream energy infrastructure assets in the United States. The company operates in two segments, Gathering and Processing; and Transportation and Storage. The Gathering and Processing segment provides natural gas gathering and processing services in the Anadarko, Arkoma, and Ark-La-Tex basins, as well as crude oil gathering services in the Anadarko and Williston basins for its producer customers. The Transportation and Storage segment offers interstate and intrastate natural gas pipeline transportation and storage services to producer, power plant, local distribution company, and industrial end-user customers. The company's natural gas gathering and processing assets are located in Oklahoma, Texas, Arkansas, and Louisiana; crude oil gathering assets are located in Oklahoma and North Dakota; and natural gas transportation and storage assets extend from western Oklahoma and the Texas Panhandle to Louisiana, from Louisiana to Illinois, in Oklahoma, and from Louisiana to Alabama. As of December 31, 2020, it had a portfolio of midstream energy infrastructure assets included approximately 14,000 miles of gathering pipelines; 15 processing plants with 2.6 billion cubic feet per day of processing capacity; approximately 7,800 miles of interstate pipelines; approximately 2,200 miles of intrastate pipelines; and 7 natural gas storage facilities with 84.5 billion cubic feet of storage capacity. The company was founded in 2013 and is based in Oklahoma City, Oklahoma. Enable Midstream Partners, LP is a subsidiary of CenterPoint Energy, Inc.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OK",
        "city": "Oklahoma City",
        "zipcode": "73102",
        "website": "http://www.enablemidstream.com",
        "market_cap": 3578459648
    },
    "ENLC": {
        "short_name": "EnLink Midstream, LLC",
        "long_name": "EnLink Midstream, LLC",
        "summary": "EnLink Midstream, LLC provides midstream energy services in the United States. It operates through Permian, North Texas, Oklahoma, Louisiana, and Corporate segments. The company is involved in gathering, compressing, treating, processing, transporting, storing, and selling natural gas; fractionating, transporting, storing, and selling natural gas liquids; and gathering, transporting, stabilizing, storing, trans-loading, and selling crude oil and condensate, as well as providing brine disposal services. Its midstream energy asset network includes approximately 11,900 miles of pipelines; 22 natural gas processing plants; 7 fractionators; barge and rail terminals; product storage facilities; brine disposal wells; and a crude oil trucking fleet. The company was incorporated in 2013 and is based in Dallas, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75201",
        "website": "http://www.enlink.com",
        "market_cap": 2286024704
    },
    "EPD.MX": {
        "short_name": "ENTERPRISE PRODS PARTNERS L P",
        "long_name": "Enterprise Products Partners L.P.",
        "summary": "Enterprise Products Partners L.P. provides midstream energy services to producers and consumers of natural gas, natural gas liquids (NGLs), crude oil, petrochemicals, and refined products. The company operates through four segments: NGL Pipelines & Services, Crude Oil Pipelines & Services, Natural Gas Pipelines & Services, and Petrochemical & Refined Products Services. The NGL Pipelines & Services segment offers natural gas processing and related NGL marketing services. It operates 21 natural gas processing facilities located in Colorado, Louisiana, Mississippi, New Mexico, Texas, and Wyoming; NGL pipelines; NGL fractionation facilities; NGL and related product storage facilities; and NGL marine terminals. The Crude Oil Pipelines & Services segment operates crude oil pipelines; and crude oil storage and marine terminals, which include a fleet of 310 tractor-trailer tank trucks that are used to transport liquefied petroleum gas. It also engages in crude oil marketing activities. The Natural Gas Pipelines & Services segment operates natural gas pipeline systems to gather, treat, and transport natural gas. It leases underground salt dome natural gas storage facilities in Napoleonville, Louisiana; owns an underground salt dome storage cavern in Wharton County, Texas; and markets natural gas. The Petrochemical & Refined Products Services segment operates propylene fractionation and related marketing activities; butane isomerization complex and related deisobutanizer units; and octane enhancement and high purity isobutylene production facilities. It also operates refined products pipelines and terminals; and ethylene export terminals, as well as provides refined products marketing and marine transportation services. The company was founded in 1968 and is headquartered in Houston, Texas.",
        "currency": "MXN",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://www.enterpriseproducts.com",
        "market_cap": 1058075967488
    },
    "EPD": {
        "short_name": "Enterprise Products Partners L.",
        "long_name": "Enterprise Products Partners L.P.",
        "summary": "Enterprise Products Partners L.P. provides midstream energy services to producers and consumers of natural gas, natural gas liquids (NGLs), crude oil, petrochemicals, and refined products. The company operates through four segments: NGL Pipelines & Services, Crude Oil Pipelines & Services, Natural Gas Pipelines & Services, and Petrochemical & Refined Products Services. The NGL Pipelines & Services segment offers natural gas processing and related NGL marketing services. It operates 21 natural gas processing facilities located in Colorado, Louisiana, Mississippi, New Mexico, Texas, and Wyoming; NGL pipelines; NGL fractionation facilities; NGL and related product storage facilities; and NGL marine terminals. The Crude Oil Pipelines & Services segment operates crude oil pipelines; and crude oil storage and marine terminals, which include a fleet of 310 tractor-trailer tank trucks that are used to transport liquefied petroleum gas. It also engages in crude oil marketing activities. The Natural Gas Pipelines & Services segment operates natural gas pipeline systems to gather, treat, and transport natural gas. It leases underground salt dome natural gas storage facilities in Napoleonville, Louisiana; owns an underground salt dome storage cavern in Wharton County, Texas; and markets natural gas. The Petrochemical & Refined Products Services segment operates propylene fractionation and related marketing activities; butane isomerization complex and related deisobutanizer units; and octane enhancement and high purity isobutylene production facilities. It also operates refined products pipelines and terminals; and ethylene export terminals, as well as provides refined products marketing and marine transportation services. The company was founded in 1968 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://www.enterpriseproducts.com",
        "market_cap": 50722201600
    },
    "ET": {
        "short_name": "Energy Transfer LP",
        "long_name": "Energy Transfer LP",
        "summary": "Energy Transfer LP provides energy-related services. The company owns and operates approximately 9,400 miles of natural gas transportation pipelines and three natural gas storage facilities in Texas; and 12,340 miles of interstate natural gas pipelines. It also sells natural gas to electric utilities, independent power plants, local distribution companies, industrial end-users, and other marketing companies. In addition, the company owns and operates natural gas gathering and natural gas liquid (NGL) pipelines, processing plants, and treating and conditioning facilities in Texas, New Mexico, West Virginia, Pennsylvania, Ohio, Oklahoma, Kansas, and Louisiana; natural gas gathering, oil pipeline, and oil stabilization facilities in South Texas; and a natural gas gathering system in Ohio, as well as transports and supplies water to natural gas producers in Pennsylvania. Further, it owns approximately 4,823 miles of NGL pipelines; NGL and propane fractionation facilities; NGL storage facilities with working storage capacity of approximately 50 million barrels (MMBbls); and other NGL storage assets and terminals with an aggregate storage capacity of approximately 17 MMBbls. Additionally, the company sells gasoline, middle distillates, and motor fuel at retail, as well as crude oil, NGLs, and refined products; operates convenience stores; and distributes motor fuels and other petroleum products. It provides natural gas compression services; carbon dioxide and hydrogen sulfide removal, natural gas cooling, dehydration, and British thermal unit management services; and manages coal and natural resources properties, as well as sells standing timber, leases coal-related infrastructure facilities, collects oil and gas royalties, and generates electrical power. The company was formerly known as Energy Transfer Equity, L.P. and changed its name to Energy Transfer LP in October 2018. Energy Transfer LP was founded in 1996 and is headquartered in Dallas, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75225",
        "website": "http://energytransfer.com",
        "market_cap": 26602342400
    },
    "ETRN": {
        "short_name": "Equitrans Midstream Corporation",
        "long_name": "Equitrans Midstream Corporation",
        "summary": "Equitrans Midstream Corporation owns, operates, acquires, and develops natural gas gathering, transmission and storage, and water services assets in the Appalachian Basin. It operates through three segments: Gathering System, Transmission and Storage System, and Water Service System. The Gathering System segment include 1,130 miles of high-pressure gathering lines with compression of approximately 485,000 horsepower and multiple interconnect points; and approximately 910 miles of Federal Energy Regulatory Commission (FERC) low-pressure gathering lines. The Transmission and Storage System segment comprises 950 miles of FERC regulated interstate pipeline that connects to seven interstate pipelines and local distribution companies. The Water Service System segment include two independent systems comprised approximately 200 miles of pipeline that deliver fresh water from the Monongahela River, the Ohio River, local reservoirs, and various regional waterways. Equitrans Midstream Corporation was incorporated in 2018 and is headquartered in Canonsburg, Pennsylvania.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Canonsburg",
        "zipcode": "15317-0269",
        "website": "http://www.equitransmidstream.com",
        "market_cap": 3559458304
    },
    "EURN.BR": {
        "short_name": "EURONAV",
        "long_name": "Euronav NV",
        "summary": "Euronav NV, together with its subsidiaries, engages in the shipping and storage of crude oil worldwide. The company also offers floating, storage, and offloading (FSO) services. As of April 15, 2020, it owned and operated a fleet of 2 V-Plus vessels, 42 VLCCs, 26 Suezmaxes, and 2 FSO vessels. The company was incorporated in 2003 and is headquartered in Antwerp, Belgium.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "BRU",
        "market": "be_market",
        "country": "Belgium",
        "state": null,
        "city": "Antwerp",
        "zipcode": "2000",
        "website": "http://www.euronav.com",
        "market_cap": 1374637184
    },
    "EURN": {
        "short_name": "Euronav NV",
        "long_name": "Euronav NV",
        "summary": "Euronav NV, together with its subsidiaries, engages in the ocean transportation and storage of crude oil worldwide. The company also offers floating, storage, and offloading (FSO) services. As of April 1, 2021, it owned and operated a fleet of 77 vessels, including 10 chartered-in vessels with an aggregate carrying capacity of approximately 19.5 million deadweight tons consisting of 45 very large crude carriers, two V-plus, 28 Suezmax vessels, and two floating, storage, and offloading vessels. The company was incorporated in 2003 and is headquartered in Antwerp, Belgium.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Belgium",
        "state": null,
        "city": "Antwerp",
        "zipcode": "2000",
        "website": "http://www.euronav.com",
        "market_cap": 1823029120
    },
    "EXM.BR": {
        "short_name": "EXMAR",
        "long_name": "Exmar NV",
        "summary": "Exmar NV provides shipping and energy supply chain solutions worldwide. It operates through three segments: Shipping, Infrastructure, and Supporting Services. The company transports liquefied gas products, such as liquid petroleum gas, butane, propane, anhydrous ammonia, and petrochemical gases. It also provides ownership, leasing, operation, and maintenance infrastructure solutions to the oil and gas industry, as well as engages in engineering and construction supervision activities. In addition, the company builds, owns, and operates LNG Infrastructure comprising floating liquefaction of natural gas units, and floating storage and regasification units, as well as provides ship-to-ship transfer services. Further, it provides ship management services, consultancy and engineering, and travel agency services; and manufactures ropes for marine and offshore applications. Additionally, the company designs, builds, installs, and operates floating production, storage, and offloading units; and operates, crews, refurbishes, and maintains accommodation barges. Exmar NV was founded in 1829 and is headquartered in Antwerp, Belgium.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "BRU",
        "market": "be_market",
        "country": "Belgium",
        "state": null,
        "city": "Antwerp",
        "zipcode": "2000",
        "website": "http://www.exmar.be",
        "market_cap": 237776944
    },
    "FLNG.OL": {
        "short_name": "FLEX LNG LTD (BM)",
        "long_name": "FLEX LNG Ltd.",
        "summary": "Flex LNG Ltd., through its subsidiaries, engages in the seaborne transportation of liquefied natural gas (LNG) worldwide. As of March 15, 2021, it owned and operated nine M-type electronically controlled gas injection LNG carriers; and three generation X dual fuel LNG carriers. It also provides chartering and management services. Flex LNG Ltd. was incorporated in 2006 and is based in Hamilton, Bermuda.",
        "currency": "NOK",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Bermuda",
        "state": null,
        "city": "Hamilton",
        "zipcode": "HM08",
        "website": "http://www.flexlng.com",
        "market_cap": 6274657280
    },
    "FLNG": {
        "short_name": "FLEX LNG Ltd.",
        "long_name": "FLEX LNG Ltd.",
        "summary": "Flex LNG Ltd., through its subsidiaries, engages in the seaborne transportation of liquefied natural gas (LNG) worldwide. As of March 15, 2021, it owned and operated nine M-type electronically controlled gas injection LNG carriers; and three generation X dual fuel LNG carriers. It also provides chartering and management services. Flex LNG Ltd. was incorporated in 2006 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "state": null,
        "city": "Hamilton",
        "zipcode": "HM08",
        "website": "http://www.flexlng.com",
        "market_cap": 635986432
    },
    "FLST": {
        "short_name": "FUELSTREAM INC",
        "long_name": "Fuelstream, Inc.",
        "summary": "Fuelstream, Inc. supplies and distributes aviation fuel to corporate, commercial, military, and privately owned aircraft worldwide. It also provide various ground services, including concierge services, passenger and baggage handling, landing rights, coordination with local aviation authorities, aircraft maintenance services, catering, cabin cleaning, customs approvals, and third-party invoice reconciliation services directly to its customers or through its affiliates. Fuelstream, Inc. also assists its customers in flight planning and aircraft routing, obtaining permits, arranging overflies, and flight follow services. The company was formerly known as Sportsnuts Inc. and changed its name to Fuelstream, Inc. in April 2010. Fuelstream, Inc. was founded in 1996 and is headquartered in Draper, Utah.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "UT",
        "city": "Draper",
        "zipcode": "84020",
        "website": "http://www.fuel-stream.com",
        "market_cap": 4772
    },
    "FLUX.BR": {
        "short_name": "FLUXYS BELGIUM D",
        "long_name": "Fluxys Belgium SA",
        "summary": "Fluxys Belgium SA engages in the transmission and storage of natural gas in Belgium. The company sells capacity to its customers to transport natural gas for distribution system operators, power plants, and industrial end-users in Belgium, as well as to send natural gas to border points for transmission to other end-user markets in Europe. It also provides a package of gas trading services that allow its customers to buy and sell gas on Belgian gas trading places; and storage services enabling customers to use buffer capacity. The company, through Zeebrugge terminal, sells capacity for loading and unloading liquefied natural gas (LNG) carriers, storing LNG, and regasifying it for transmission on the network; loading of LNG trailers or containers to supply local networks or industrial sites in Europe; and supplies filling stations for LNG-fueled trucks and LNG-powered vessels. In addition, it is involved in the reinsurance business. The company was formerly known as Fluxys SA. The company is based in Brussels, Belgium. Fluxys Belgium SA is a subsidiary of Fluxys SA.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "BRU",
        "market": "be_market",
        "country": "Belgium",
        "state": null,
        "city": "Brussels",
        "zipcode": "1040",
        "website": "http://www.fluxys.com/en/company/fluxys-belgium",
        "market_cap": 2325721856
    },
    "FQ7.SI": {
        "short_name": "Jasper Inv",
        "long_name": "Jasper Investments Limited",
        "summary": "Jasper Investments Limited, an investment holding company, manages vessels and provides barge transportation services in the North Asian region. The company's transportation services include chartering and operating various vessels and transportation equipment for the infrastructure players in the reclamation, construction, and earthwork sectors. It also acts as a contractor for project management of infrastructural works. The company was incorporated in 1987 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "589472",
        "website": "http://www.jasperinvests.com",
        "market_cap": 21770800
    },
    "FRLN.F": {
        "short_name": "FRONTLINE LTD  DL 1",
        "long_name": "Frontline Ltd.",
        "summary": "Frontline Ltd., a shipping company, engages in the seaborne transportation of crude oil and oil products worldwide. It owns and operates oil and product tankers. As of December 31, 2020, the company operated a fleet of 68 vessels. It is also involved in the charter, purchase, and sale of vessels. Frontline Ltd. is based in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "state": null,
        "city": "Hamilton",
        "zipcode": "HM 08",
        "website": "http://www.frontline.bm",
        "market_cap": 1366557312
    },
    "FRO.OL": {
        "short_name": "FRONTLINE LTD",
        "long_name": "Frontline Ltd.",
        "summary": "Frontline Ltd., a shipping company, engages in the seaborne transportation of crude oil and oil products worldwide. It owns and operates oil and product tankers. As of December 31, 2020, the company operated a fleet of 68 vessels. It is also involved in the charter, purchase, and sale of vessels. Frontline Ltd. is based in Hamilton, Bermuda.",
        "currency": "NOK",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Bermuda",
        "state": null,
        "city": "Hamilton",
        "zipcode": "HM 08",
        "website": "http://www.frontline.bm",
        "market_cap": 14346123264
    },
    "FRO": {
        "short_name": "Frontline Ltd.",
        "long_name": "Frontline Ltd.",
        "summary": "Frontline Ltd., a shipping company, engages in the seaborne transportation of crude oil and oil products worldwide. It owns and operates oil and product tankers. As of December 31, 2020, the company operated a fleet of 68 vessels. It is also involved in the charter, purchase, and sale of vessels. Frontline Ltd. is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "state": null,
        "city": "Hamilton",
        "zipcode": "HM 08",
        "website": "http://www.frontline.bm",
        "market_cap": 1589443712
    },
    "G2O.F": {
        "short_name": "GOLAR LNG LTD.  DL 1",
        "long_name": "Golar LNG Limited",
        "summary": "Golar LNG Limited provides infrastructure for the liquefaction, transportation, and regasification of LNG. It operates through Shipping, FLNG, and Power segments. The company engages in the acquisition, ownership, operation, and chartering of LNG carriers, Floating Liquefaction Natural Gas Vessel (FLNG), and floating storage regasification units (FSRUs), as well as operates external vessels. As of April 16, 2021, it operated ten LNG carriers, one FSRU, and two FLNGs. The company was founded in 1946 and is headquartered in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "state": null,
        "city": "Hamilton",
        "zipcode": "HM 11",
        "website": "http://www.golarlng.com",
        "market_cap": 1232298880
    },
    "GBNXF": {
        "short_name": "GIBSON ENERGY INC",
        "long_name": "Gibson Energy Inc.",
        "summary": "Gibson Energy Inc., an oil infrastructure company, engages in the gathering, storage, optimization, processing, and marketing of crude oil and refined products in North America. It operates through two segments, Infrastructure and Marketing. The Infrastructure segment operates a network of infrastructure assets that include oil terminals, rail loading and unloading facilities, gathering pipelines, and a crude oil processing facility. The Marketing segment purchases, sells, stores, and optimizes hydrocarbon products, including crude oil, natural gas liquids, road asphalt, roofing flux, frac oils, light and heavy straight run distillates, combined vacuum gas oil, and an oil-based mud product. The company was formerly known as Gibson Energy Holdings ULC and changed its name to Gibson Energy Inc. in April 2011. Gibson Energy Inc. was founded in 1950 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 5E9",
        "website": "http://www.gibsonenergy.com",
        "market_cap": 3179958272
    },
    "GEI.TO": {
        "short_name": "GIBSON ENERGY INC",
        "long_name": "Gibson Energy Inc.",
        "summary": "Gibson Energy Inc., an oil infrastructure company, engages in the gathering, storage, optimization, processing, and marketing of crude oil and refined products in North America. It operates through two segments, Infrastructure and Marketing. The Infrastructure segment operates a network of infrastructure assets that include oil terminals, rail loading and unloading facilities, gathering pipelines, and a crude oil processing facility. The Marketing segment purchases, sells, stores, and optimizes hydrocarbon products, including crude oil, natural gas liquids, road asphalt, roofing flux, frac oils, light and heavy straight run distillates, combined vacuum gas oil, and an oil-based mud product. The company was formerly known as Gibson Energy Holdings ULC and changed its name to Gibson Energy Inc. in April 2011. Gibson Energy Inc. was founded in 1950 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 5E9",
        "website": "http://www.gibsonenergy.com",
        "market_cap": 3918206464
    },
    "GEL": {
        "short_name": "Genesis Energy, L.P.",
        "long_name": "Genesis Energy, L.P.",
        "summary": "Genesis Energy, L.P. operates in the midstream segment of the crude oil and natural gas industry. The company's Offshore Pipeline Transportation segment engages in offshore crude oil and natural gas pipeline transportation and handling operations; and in the deepwater pipeline servicing in the southern Keathley Canyon area of the Gulf of Mexico. This segment owns interests in approximately 1,422 miles of crude oil pipelines located offshore in the Gulf of Mexico. Its Sodium Minerals and Sulfur Services segment offers sulfur-extraction services to refining operations; and operates storage and transportation assets. This segment provides services to ten refining operations; and sells sodium hydrosulfide and caustic soda to industrial and commercial companies involved in the mining of base metals. Its Onshore Facilities and Transportation segment offers onshore facilities and transportation services to Gulf Coast crude oil refineries and producers by purchasing, transporting, storing, blending, and marketing crude oil and refined products. It operates trucks, trailers, railcars, and terminals and tankage with 4.2 million barrels of storage capacity in various locations along the Gulf Coast. This segment also transports crude oil and carbon dioxide (CO2). It owns four onshore crude oil pipeline systems with approximately 450 miles of pipe in Alabama, Florida, Louisiana, Mississippi, and Texas; and four operational crude oil rail unloading facilities in Baton Rouge and Raceland, Louisiana, as well as Walnut Hill, Florida and Natchez, Mississippi. Its Marine Transportation segment offers waterborne transportation of petroleum and crude oil in North America. This segment owns a fleet of 91 barges with a combined transportation capacity of 3.2 million barrels; and 42 push/tow boats. In addition, the company produces natural soda ash. Genesis Energy, LLC serves as a general partner of the company. The company was incorporated in 1996 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://www.genesisenergy.com",
        "market_cap": 1179209984
    },
    "GLNG": {
        "short_name": "Golar LNG Limited",
        "long_name": "Golar LNG Limited",
        "summary": "Golar LNG Limited provides infrastructure for the liquefaction, transportation, and regasification of LNG. It operates through Shipping, FLNG, and Power segments. The company engages in the acquisition, ownership, operation, and chartering of LNG carriers, Floating Liquefaction Natural Gas Vessel (FLNG), and floating storage regasification units (FSRUs), as well as operates external vessels. As of April 16, 2021, it operated ten LNG carriers, one FSRU, and two FLNGs. The company was founded in 1946 and is headquartered in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Bermuda",
        "state": null,
        "city": "Hamilton",
        "zipcode": "HM 11",
        "website": "http://www.golarlng.com",
        "market_cap": 1195091328
    },
    "GLOG-PA": {
        "short_name": "GasLog LP. 8.75% Series A Cumul",
        "long_name": "GasLog Ltd.",
        "summary": "GasLog Ltd. operates as an owner, operator, and manager of liquefied natural gas (LNG) carriers providing support to international energy companies. The company provides maritime services for the transportation of LNG on a worldwide basis and vessel management services. As of March 1, 2020, it operated a fleet of 25 LNG carriers. GasLog Ltd. was incorporated in 2003 and is based in Piraeus, Greece.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Greece",
        "state": null,
        "city": "Piraeus",
        "zipcode": "18537",
        "website": "http://www.gaslogltd.com",
        "market_cap": 1394771968
    },
    "GLOG": {
        "short_name": "GasLog Ltd.",
        "long_name": "GasLog Ltd.",
        "summary": "GasLog Ltd. operates as an owner, operator, and manager of liquefied natural gas (LNG) carriers providing support to international energy companies. The company provides maritime services for the transportation of LNG on a worldwide basis and vessel management services. As of March 1, 2020, it operated a fleet of 25 LNG carriers. GasLog Ltd. was incorporated in 2003 and is based in Piraeus, Greece.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Greece",
        "state": null,
        "city": "Piraeus",
        "zipcode": "18537",
        "website": "http://www.gaslogltd.com",
        "market_cap": 552302912
    },
    "GLOP-PA": {
        "short_name": "GasLog Partners LP 8.625% Serie",
        "long_name": "GasLog Partners LP",
        "summary": "GasLog Partners LP owns, operates, and acquires liquefied natural gas (LNG) carriers under multi-year charters. As of March 2, 2021, it operated a fleet of 15 LNG carriers with an average carrying capacity of approximately 158,000 cubic meters. The company was founded in 2014 and is based in Piraeus, Greece.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Greece",
        "state": null,
        "city": "Piraeus",
        "zipcode": "18537",
        "website": "http://www.gaslogmlp.com",
        "market_cap": 1121082880
    },
    "GLOP-PB": {
        "short_name": "GasLog Partners LP 8.200% Serie",
        "long_name": "GasLog Partners LP",
        "summary": "GasLog Partners LP owns, operates, and acquires liquefied natural gas (LNG) carriers under multi-year charters. As of March 2, 2021, it operated a fleet of 15 LNG carriers with an average carrying capacity of approximately 158,000 cubic meters. The company was founded in 2014 and is based in Piraeus, Greece.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Greece",
        "state": null,
        "city": "Piraeus",
        "zipcode": "18537",
        "website": "http://www.gaslogmlp.com",
        "market_cap": 978508352
    },
    "GLOP-PC": {
        "short_name": "GasLog Partners LP 8.500% Serie",
        "long_name": "GasLog Partners LP",
        "summary": "GasLog Partners LP owns, operates, and acquires liquefied natural gas (LNG) carriers under multi-year charters. As of March 2, 2021, it operated a fleet of 15 LNG carriers with an average carrying capacity of approximately 158,000 cubic meters. The company was founded in 2014 and is based in Piraeus, Greece.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Greece",
        "state": null,
        "city": "Piraeus",
        "zipcode": "18537",
        "website": "http://www.gaslogmlp.com",
        "market_cap": 999650944
    },
    "GLOP": {
        "short_name": "GasLog Partners LP",
        "long_name": "GasLog Partners LP",
        "summary": "GasLog Partners LP owns, operates, and acquires liquefied natural gas (LNG) carriers under multi-year charters. As of March 2, 2021, it operated a fleet of 15 LNG carriers with an average carrying capacity of approximately 158,000 cubic meters. The company was founded in 2014 and is based in Piraeus, Greece.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Greece",
        "state": null,
        "city": "Piraeus",
        "zipcode": "18537",
        "website": "http://www.gaslogmlp.com",
        "market_cap": 159434736
    },
    "GLP": {
        "short_name": "Global Partners LP Global Partn",
        "long_name": "Global Partners LP",
        "summary": "Global Partners LP engages in the purchasing, selling, gathering, blending, storing, and logistics of transporting gasoline and gasoline blendstocks, distillates, residual oil, renewable fuels, crude oil, and propane to wholesalers, retailers, and commercial customers in the New England states and New York. The company is also involved in the transportation of petroleum products and renewable fuels through rail from the mid-continent region of the United States and Canada. Its Wholesale segment sells home heating oil, branded and unbranded gasoline and gasoline blendstocks, diesel, kerosene, residual oil, and propane to home heating oil and propane retailers, and wholesale distributors. It also aggregates crude oil through truck or pipeline in the mid-continent region of the United States and Canada, as well as transports it through rail and ships it through barge to refiners. The company's Gasoline Distribution and Station Operations segment sells branded and unbranded gasoline to gasoline station operators and sub-jobbers; operates gasoline stations and convenience stores; and provides car wash, lottery, and ATM services, as well as leases gasoline stations. Its Commercial segment sells and delivers unbranded gasoline, home heating oil, diesel, kerosene, residual oil, and bunker fuel to end user customers in the public sector, as well as to commercial and industrial end users; and sells custom blended fuels. As of December 31, 2020, the company had a portfolio of 1,548 owned, leased, and/or supplied gasoline stations, which included 277 directly operated convenience stores; and owned, leased, or maintained storage facilities at 25 bulk terminals with a collective storage capacity of 11.8 million barrels. Global GP LLC serves as the general partner of the company. The company was incorporated in 2005 and is based in Waltham, Massachusetts.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MA",
        "city": "Waltham",
        "zipcode": "02454-9161",
        "website": "http://www.globalp.com",
        "market_cap": 843720384
    },
    "GPP": {
        "short_name": "Green Plains Partners LP",
        "long_name": "Green Plains Partners LP",
        "summary": "Green Plains Partners LP provides fuel storage and transportation services in the United States. It acquires, owns, develops, and operates ethanol and fuel storage facilities, terminals, transportation assets, and other related assets and businesses. The company owns or leases 31 ethanol storage facilities and approximately 44 acres of land; and six fuel terminals in Alabama, Arkansas, Louisiana, Mississippi, Kentucky, and Oklahoma. It also owns and operates a fleet of 19 trucks and tankers for transportation of ethanol and other products. The company was founded in 2015 and is headquartered in Omaha, Nebraska. Green Plains Partners LP is a subsidiary of Green Plains Inc.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "state": "NE",
        "city": "Omaha",
        "zipcode": "68106",
        "website": "http://www.greenplainspartners.com",
        "market_cap": 294047904
    },
    "HEP": {
        "short_name": "Holly Energy Partners, L.P.",
        "long_name": "Holly Energy Partners, L.P.",
        "summary": "Holly Energy Partners, L.P. owns and operates petroleum product and crude pipelines, storage tanks, distribution terminals, loading rack facilities, and refinery processing units that support the refining and marketing operations in Texas, New Mexico, Utah, Nevada, Oklahoma, Wyoming, Kansas, Idaho, and Washington. It operates through two segments, Pipelines and Terminals, and Refinery Processing Units. The company operates refined product pipelines that transport conventional gasolines, reformulated gasolines, and low-octane gasolines for oxygenate blending, as well as distillates, such as high- and low-sulfur diesel and jet fuels, and liquefied petroleum gases; intermediate product pipelines that transport intermediate feedstocks and crude oils; and oil trunk, gathering, and connection pipelines that delivers crude oil. It operates 26 main pipelines; crude gathering networks; 10 refined product terminals; 1 crude terminal; 31,800 track feet of rail storage; 7 locations with truck and/or rail racks; and tankages at 6 refining facility locations, as well as 5 refinery processing units. Holly Energy Partners, L.P. was incorporated in 2004 and is based in Dallas, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75201-1507",
        "website": "http://www.hollyenergy.com",
        "market_cap": 2140649216
    },
    "HESM": {
        "short_name": "Hess Midstream LP",
        "long_name": "Hess Midstream LP",
        "summary": "Hess Midstream LP owns, develops, operates, and acquires midstream assets. The company operates through three segments: Gathering; Processing and Storage; and Terminaling and Export. The Gathering segment owns natural gas gathering and crude oil gathering systems; and produced water gathering and disposal facilities. Its gathering systems consists of approximately 1,350 miles of high and low pressure natural gas and natural gas liquids gathering pipelines with capacity of approximately 450 million cubic feet per day; and crude oil gathering system comprises approximately 550 miles of crude oil gathering pipelines. The Processing and Storage segment comprises Tioga Gas Plant, a natural gas processing and fractionation plant located in Tioga, North Dakota; a 50% interest in the Little Missouri 4 gas processing plant located in south of the Missouri River in McKenzie County, North Dakota; and Mentor Storage Terminal, a propane storage cavern and rail, and truck loading and unloading facility located in Mentor, Minnesota. The Terminaling and Export segment owns Ramberg terminal facility; Tioga rail terminal; and crude oil rail cars, as well as Johnson's Corner Header System, a crude oil pipeline header system. Hess Midstream LP was founded in 2014 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77010",
        "website": "http://www.hessmidstream.com",
        "market_cap": 649495744
    },
    "HLNG.OL": {
        "short_name": "HOEGH LNG HOLDINGS",
        "long_name": "Höegh LNG Holdings Ltd.",
        "summary": "HÃ¶egh LNG Holdings Ltd., together with its subsidiaries, provides floating energy solutions worldwide. The company operates through four segments: HMLP, Operations, Business Development, and Project Execution. It owns and operates floating LNG import terminals, floating storage and regasification units (FSRUs), and LNG carriers (LNGCs). The company also acquires FSRUs, LNGCs, and other LNG infrastructure assets under long-term charters. As of December 31, 2020, it operated a fleet of two LNG transportation vessels, and ten floating storage and regasification units. The company is also involved in the commercial and technical management and bareboat hiring; and business development and project execution activities, as well as corporate functions. In addition, it owns ships. The company was incorporated in 2006 and is headquartered in Oslo, Norway.",
        "currency": "NOK",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Norway",
        "state": null,
        "city": "Oslo",
        "zipcode": "0277",
        "website": "http://www.hoeghlng.com",
        "market_cap": 1784280320
    },
    "HMLP": {
        "short_name": "Hoegh LNG Partners LP",
        "long_name": "Höegh LNG Partners LP",
        "summary": "HÃ¶egh LNG Partners LP focuses on owning, operating, and acquiring floating storage and regasification units (FSRUs), liquefied natural gas (LNG) carriers, and other LNG infrastructure assets under long-term charters. The company also offers ship management services. As of March 31, 2021, it had a fleet of five FSRUs. HÃ¶egh LNG GP LLC is the general partner of the company. The company was incorporated in 2014 and is headquartered in Hamilton, Bermuda. HÃ¶egh LNG Partners LP is a subsidiary of HÃ¶egh LNG Holdings Ltd.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "state": null,
        "city": "Hamilton",
        "zipcode": "HM 12",
        "website": "http://www.hoeghlngpartners.com",
        "market_cap": 553459008
    },
    "IPL.TO": {
        "short_name": "INTER PIPELINE LTD",
        "long_name": "Inter Pipeline Ltd.",
        "summary": "Inter Pipeline Ltd. engages in the petroleum transportation and storage, and natural gas liquids (NGL) processing businesses in Canada and Europe. The company operates through four segments: Oil Sands Transportation; Conventional Oil Pipelines; NGL Processing; and Bulk Liquid Storage. The Oil Sands Transportation segment transports petroleum products through Cold Lake, Corridor, and Polaris pipeline systems covering approximately 3,300 kilometers of pipeline and 3.8 million barrels of storage capacity; and related blending and handling services. The Conventional Oil Pipelines segment is involved in the transportation of crude oil through Bow River, Central Alberta, and Mid-Saskatchewan pipeline systems covering approximately 3,900 kilometers of pipeline and 1,635,000 barrels of storage capacity; and related blending, handling, and marketing activities. The NGL Processing segment processes pipeline natural gas to extract NGL, including ethane, propane, butane, and pentanes-plus; and fractionates NGL stream to produce ethane products and propane plus. These NGLs are used as energy products; and as a feedstock for the petrochemical and crude oil refining industries. The Bulk Liquid Storage segment engages in the storage and handling of bulk liquid products. This segment operates 8 bulk liquid storage terminals and approximately 19 million barrels of storage capacity. Inter Pipeline Ltd. was founded in 1997 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 1M4",
        "website": "http://www.interpipeline.com",
        "market_cap": 8622627840
    },
    "IPPLF": {
        "short_name": "INTER PIPELINE LTD",
        "long_name": "Inter Pipeline Ltd.",
        "summary": "Inter Pipeline Ltd. engages in the petroleum transportation and storage, and natural gas liquids (NGL) processing businesses in Canada and Europe. The company operates through four segments: Oil Sands Transportation; Conventional Oil Pipelines; NGL Processing; and Bulk Liquid Storage. The Oil Sands Transportation segment transports petroleum products through Cold Lake, Corridor, and Polaris pipeline systems covering approximately 3,300 kilometers of pipeline and 3.8 million barrels of storage capacity; and related blending and handling services. The Conventional Oil Pipelines segment is involved in the transportation of crude oil through Bow River, Central Alberta, and Mid-Saskatchewan pipeline systems covering approximately 3,900 kilometers of pipeline and 1,635,000 barrels of storage capacity; and related blending, handling, and marketing activities. The NGL Processing segment processes pipeline natural gas to extract NGL, including ethane, propane, butane, and pentanes-plus; and fractionates NGL stream to produce ethane products and propane plus. These NGLs are used as energy products; and as a feedstock for the petrochemical and crude oil refining industries. The Bulk Liquid Storage segment engages in the storage and handling of bulk liquid products. This segment operates 8 bulk liquid storage terminals and approximately 19 million barrels of storage capacity. Inter Pipeline Ltd. was founded in 1997 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 1M4",
        "website": "http://www.interpipeline.com",
        "market_cap": 6317824000
    },
    "K2Y.F": {
        "short_name": "KEYERA CORP.",
        "long_name": "Keyera Corp.",
        "summary": "Keyera Corp. engages in the energy infrastructure business in Canada. It operates through Gathering and Processing, Liquids Infrastructure, and Marketing segments. The company's Gathering and Processing segment owns and operates raw gas gathering pipelines and processing plants, which collect and process raw natural gas, remove waste products, and separate the economic components primarily natural gas liquids; and provides condensate handling services. It has approximately 4,400 kilometers of gathering pipelines; and holds interests in 14 active gas plants in Alberta. The company's Liquids Infrastructure segment provides processing, fractionation, storage, transportation, liquids blending, and terminalling services for natural gas liquids (NGLs) and crude oil through a network of facilities that include underground NGL storage caverns, above ground storage tanks, NGL fractionation and de-ethanization facilities, pipelines, rail and truck terminals, liquids blending facilities, and the Alberta EnviroFuels facility. It also produces iso-octane. The company's Marketing segment engages in the marketing of propane, butane, condensate and iso-octane, as well as liquid blending activities. The company was formerly known as Keyera Facilities Income Fund and changed its name to Keyera Corp. in January 2011. Keyera Corp. was founded in 2003 and is headquartered in Calgary, Canada.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 3N4",
        "website": "http://www.keyera.com",
        "market_cap": 4928470528
    },
    "KEH.F": {
        "short_name": "CHINESE.PEOP.HLDGS HD-,07",
        "long_name": "Chinese People Holdings Company Limited",
        "summary": "Chinese People Holdings Company Limited, an investment holding company, sells and distributes gas fuel in the People's Republic of China. The company operates through Provision of Piped Gas; Sale and Distribution of Cylinder Gas; and FMCG and Food Ingredients segments. It is involved in the sale of piped gas and construction of gas pipeline networks under gas connection contracts; sale and distribution of gas using tank containers to end-user households, and industrial and commercial customers; and retail and wholesale of merchandise, including rice, meat, and fresh food, as well as FMCG and barreled drinking water through supermarkets and convenience stores. The company was formerly known as Chinese People Gas Holdings Company Limited and changed its name to Chinese People Holdings Company Limited in 2007. Chinese People Holdings Company Limited is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100176",
        "website": "http://www.681hk.com",
        "market_cap": 51526648
    },
    "KEY.TO": {
        "short_name": "KEYERA CORP",
        "long_name": "Keyera Corp.",
        "summary": "Keyera Corp. engages in the energy infrastructure business in Canada. It operates through Gathering and Processing, Liquids Infrastructure, and Marketing segments. The company's Gathering and Processing segment owns and operates raw gas gathering pipelines and processing plants, which collect and process raw natural gas, remove waste products, and separate the economic components primarily natural gas liquids; and provides condensate handling services. It has approximately 4,400 kilometers of gathering pipelines; and holds interests in 14 active gas plants in Alberta. The company's Liquids Infrastructure segment provides processing, fractionation, storage, transportation, liquids blending, and terminalling services for natural gas liquids (NGLs) and crude oil through a network of facilities that include underground NGL storage caverns, above ground storage tanks, NGL fractionation and de-ethanization facilities, pipelines, rail and truck terminals, liquids blending facilities, and the Alberta EnviroFuels facility. It also produces iso-octane. The company's Marketing segment engages in the marketing of propane, butane, condensate and iso-octane, as well as liquid blending activities. The company was formerly known as Keyera Facilities Income Fund and changed its name to Keyera Corp. in January 2011. Keyera Corp. was founded in 2003 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 3N4",
        "website": "http://www.keyera.com",
        "market_cap": 7771168768
    },
    "KEYUF": {
        "short_name": "KEYERA CORPORATION",
        "long_name": "Keyera Corp.",
        "summary": "Keyera Corp. engages in the energy infrastructure business in Canada. It operates through Gathering and Processing, Liquids Infrastructure, and Marketing segments. The company's Gathering and Processing segment owns and operates raw gas gathering pipelines and processing plants, which collect and process raw natural gas, remove waste products, and separate the economic components primarily natural gas liquids; and provides condensate handling services. It has approximately 4,400 kilometers of gathering pipelines; and holds interests in 14 active gas plants in Alberta. The company's Liquids Infrastructure segment provides processing, fractionation, storage, transportation, liquids blending, and terminalling services for natural gas liquids (NGLs) and crude oil through a network of facilities that include underground NGL storage caverns, above ground storage tanks, NGL fractionation and de-ethanization facilities, pipelines, rail and truck terminals, liquids blending facilities, and the Alberta EnviroFuels facility. It also produces iso-octane. The company's Marketing segment engages in the marketing of propane, butane, condensate and iso-octane, as well as liquid blending activities. The company was formerly known as Keyera Facilities Income Fund and changed its name to Keyera Corp. in January 2011. Keyera Corp. was founded in 2003 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 3N4",
        "website": "http://www.keyera.com",
        "market_cap": 5017472000
    },
    "KMI.MX": {
        "short_name": "KINDER MORGAN INC",
        "long_name": "Kinder Morgan, Inc.",
        "summary": "Kinder Morgan, Inc. operates as an energy infrastructure company in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and underground storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas liquefaction and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; and owns interests in/or operates oil fields and gasoline processing plants, as well as operates a crude oil pipeline system in West Texas. It owns and operates approximately 83,000 miles of pipelines and 144 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1936 and is headquartered in Houston, Texas.",
        "currency": "MXN",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://www.kindermorgan.com",
        "market_cap": 842423795712
    },
    "KMI": {
        "short_name": "Kinder Morgan, Inc.",
        "long_name": "Kinder Morgan, Inc.",
        "summary": "Kinder Morgan, Inc. operates as an energy infrastructure company in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and underground storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas liquefaction and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; and owns interests in/or operates oil fields and gasoline processing plants, as well as operates a crude oil pipeline system in West Texas. It owns and operates approximately 83,000 miles of pipelines and 144 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1936 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://www.kindermorgan.com",
        "market_cap": 41328586752
    },
    "KMI.VI": {
        "short_name": "KINDER MORGAN INC",
        "long_name": "Kinder Morgan, Inc.",
        "summary": "Kinder Morgan, Inc. operates as an energy infrastructure company in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and underground storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas liquefaction and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; and owns interests in/or operates oil fields and gasoline processing plants, as well as operates a crude oil pipeline system in West Texas. It owns and operates approximately 83,000 miles of pipelines and 144 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1936 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://www.kindermorgan.com",
        "market_cap": 35327451136
    },
    "KMIC34.SA": {
        "short_name": "KINDER MORGADRN ED",
        "long_name": "Kinder Morgan Kansas, Inc.",
        "summary": "As of February 29, 2012, Kinder Morgan Kansas, Inc. was acquired by Kinder Morgan, Inc. Kinder Morgan Kansas, Inc. operates as a private pipeline transportation and storage company in North America. The company operates in six segments: Products Pipelines, Natural Gas Pipelines, CO2, Terminals, Kinder Morgan Canada, and NGPL PipeCo LLC. The Products Pipelines segment engages in the transportation and terminaling of refined petroleum products, including gasoline, diesel fuel, jet fuel, and natural gas liquids. The Natural Gas Pipelines segment involved in selling, transporting, processing, treating, storing, and gathering natural gas. The CO2 segment produces and sells crude oil from fields in the Permian Basin of West Texas and the transportation and marketing of carbon dioxide used as a flooding medium for recovering crude oil from mature oil fields. The Terminals segment engages in transloading and storing refined petroleum products, as well as dry and liquid bulk products, including coal, petroleum coke, cement, alumina, salt, and other bulk chemicals. The Kinder Morgan Canada segment transports crude oil and refined products from Alberta to marketing terminals and refineries in British Columbia, the state of Washington, and the Rocky Mountains and Central regions of the United States. The NGPL PipeCo LLC segment operates interstate natural gas pipeline and storage system. It owns and operates approximately 37,000 miles of pipelines and approximately 180 terminals. The company was formerly known as Kinder Morgan, Inc. and changed its name to Kinder Morgan Kansas, Inc. in February 2011. Kinder Morgan Kansas, Inc. was founded in 1927 and is headquartered in Houston, Texas.",
        "currency": "BRL",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": null,
        "market_cap": 218192281600
    },
    "LNG.MX": {
        "short_name": "CHENIERE ENERGY INC",
        "long_name": "Cheniere Energy, Inc.",
        "summary": "Cheniere Energy, Inc., an energy infrastructure company, engages in the liquefied natural gas (LNG) related businesses in the United States. It owns and operates the Sabine Pass LNG terminal in Cameron Parish, Louisiana; and the Corpus Christi LNG terminal near Corpus Christi, Texas. The company also owns Creole Trail pipeline, a 94-mile pipeline interconnecting the Sabine Pass LNG terminal with various interstate pipelines; and operates Corpus Christi pipeline, a 23-mile natural gas supply pipeline that interconnects the Corpus Christi LNG terminal with various interstate and intrastate natural gas pipelines. It is also involved in the LNG and natural gas marketing business. The company was incorporated in 1983 and is headquartered in Houston, Texas.",
        "currency": "MXN",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://www.cheniere.com",
        "market_cap": 468382318592
    },
    "LNG": {
        "short_name": "Cheniere Energy, Inc.",
        "long_name": "Cheniere Energy, Inc.",
        "summary": "Cheniere Energy, Inc., an energy infrastructure company, engages in the liquefied natural gas (LNG) related businesses in the United States. It owns and operates the Sabine Pass LNG terminal in Cameron Parish, Louisiana; and the Corpus Christi LNG terminal near Corpus Christi, Texas. The company also owns Creole Trail pipeline, a 94-mile pipeline interconnecting the Sabine Pass LNG terminal with various interstate pipelines; and operates Corpus Christi pipeline, a 23-mile natural gas supply pipeline that interconnects the Corpus Christi LNG terminal with various interstate and intrastate natural gas pipelines. It is also involved in the LNG and natural gas marketing business. The company was incorporated in 1983 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://www.cheniere.com",
        "market_cap": 20356485120
    },
    "LNGLY": {
        "short_name": "LIQUEFIED NATURAL GAS LIMITED",
        "long_name": "Liquefied Natural Gas Limited",
        "summary": "Liquefied Natural Gas Limited, together with its subsidiaries, engages in the identification and progression of liquefied natural gas (LNG) development projects to facilitate the production and sale of LNG. It operates through LNG Infrastructure, and Technology and Licensing segments. The company's projects include the Magnolia LNG project located in Lake Charles, Louisiana, the United States; and the Bear Head LNG project situated in Point Tupper, Richmond County, Nova Scotia, Canada. It also designs, develops, owns, and patents OSMR LNG liquefaction process. The company is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://www.lnglimited.com.au",
        "market_cap": 7922835
    },
    "LOGL": {
        "short_name": "LEGEND OIL & GAS LTD",
        "long_name": "Legend Oil and Gas, Ltd.",
        "summary": "Legend Oil and Gas, Ltd. operates as a crude oil hauling and trucking company. It performs hauling services for institutional drilling and exploration companies, as well as crude oil marketers primarily in the Bakken, North Dakota, and the Permian Basin in Texas and New Mexico. The company was formerly known as SIN Holdings, Inc. and changed its name to Legend Oil and Gas, Ltd. in November 2010. Legend Oil and Gas, Ltd. was incorporated in 2000 and is based in Alpharetta, Georgia.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Alpharetta",
        "zipcode": "30022",
        "website": null,
        "market_cap": 590685
    },
    "LPG": {
        "short_name": "Dorian LPG Ltd.",
        "long_name": "Dorian LPG Ltd.",
        "summary": "Dorian LPG Ltd., together with its subsidiaries, engages in the transportation of liquefied petroleum gas (LPG) through its LPG tankers worldwide. The company owns and operates very large gas carriers (VLGCs). As of March 31, 2020, its fleet consisted of twenty-four VLGCs. The company was founded in 2013 and is headquartered in Stamford, Connecticut.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Stamford",
        "zipcode": "06902",
        "website": "http://www.dorianlpg.com",
        "market_cap": 580745216
    },
    "LVT.F": {
        "short_name": "LEIGH CREEK ENERGY LTD",
        "long_name": "Leigh Creek Energy Limited",
        "summary": "Leigh Creek Energy Limited operates as an energy company in Australia. The company explores for coal and synthesis gas comprising methane, hydrogen, and carbon monoxide. It focuses on developing the Leigh Creek Energy project located to the north of Adelaide, South Australia. The company was formerly known as Marathon Resources Limited and changed its name to Leigh Creek Energy Limited in August 2015. Leigh Creek Energy Limited is headquartered in Adelaide, Australia.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "SA",
        "city": "Adelaide",
        "zipcode": "5000",
        "website": "http://www.lcke.com.au",
        "market_cap": 82974384
    },
    "MMLP": {
        "short_name": "Martin Midstream Partners L.P.",
        "long_name": "Martin Midstream Partners L.P.",
        "summary": "Martin Midstream Partners L.P., together with its subsidiaries, engages in terminalling, processing, storage, and packaging of petroleum products and by-products primarily in the United States Gulf Coast region. The company's Terminalling and Storage segment owns or operates 17 marine shore-based terminal facilities and 13 specialty terminal facilities that provide storage, refining, blending, packaging, and handling services for producers and suppliers of petroleum products and by-products. This segment also offers land rental services to oil and gas companies, as well as storage and handling services for lubricants and fuels. Its Transportation segment operates a fleet of 560 tank trucks and 1,150 trailers; and 31 inland marine tank barges, 14 inland push boats, and 1 articulated offshore tug and barge unit to transport petroleum products and by-products, petrochemicals, and chemicals. The company's Sulfur Services segment processes molten sulfur into prilled or pelletized sulfur, which is used in the production of fertilizers and industrial chemicals. This segment also owns 21 railcars and leases 27 railcars to transport molten sulfur; and leases 131 railcars to transport fertilizer products. Its Natural Gas Liquids segment stores, distributes, and transports natural gas liquids for wholesale deliveries to refineries, industrial NGL users, and propane retailers, as well as owns approximately 2.1 million barrels of underground storage capacity for NGLs. Martin Midstream GP LLC serves as a general partner of the company. Martin Midstream Partners L.P. was founded in 2002 and is based in Kilgore, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Kilgore",
        "zipcode": "75662",
        "website": "http://mmlp.com",
        "market_cap": 84202080
    },
    "MMP": {
        "short_name": "Magellan Midstream Partners L.P",
        "long_name": "Magellan Midstream Partners, L.P.",
        "summary": "Magellan Midstream Partners, L.P. engages in the transportation, storage, and distribution of refined petroleum products and crude oil in the United States. The company operates through Refined Products and Crude Oil segments. It operates refined products pipeline that transports gasoline, diesel fuel, aviation fuel, kerosene, and heating oil to refiners, wholesalers, retailers, traders, railroads, airlines, and regional farm cooperatives; and to end markets, including retail gasoline stations, truck stops, farm cooperatives, railroad fueling depots, military bases, and commercial airports. The company also provides pipeline capacity and tank storage services, as well as terminalling, ethanol and biodiesel unloading and loading, additive injection, custom blending, laboratory testing, and data services to shippers. In addition, Magellan Midstream Partners, L.P. owns and operates crude oil pipelines and storage facilities; and marine terminals located along coastal waterways that provide distribution, storage, blending, inventory management, and additive injection services for refiners, marketers, traders, and other end users of petroleum products. As of December 31, 2019, it had 9,800-mile refined products pipeline system with 54 terminals, as well as 25 independent terminals; approximately 2,200 miles of crude oil pipelines and storage facilities with an aggregate storage capacity of approximately 37 million barrels; and 2 marine terminals. Magellan Midstream Partners, L.P. was founded in 2000 and is headquartered in Tulsa, Oklahoma.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OK",
        "city": "Tulsa",
        "zipcode": "74121-2186",
        "website": "http://www.magellanlp.com",
        "market_cap": 10634970112
    },
    "MPLX": {
        "short_name": "MPLX LP",
        "long_name": "MPLX LP",
        "summary": "MPLX LP owns and operates midstream energy infrastructure and logistics assets primarily in the United States. It operates in two segments, Logistics and Storage, and Gathering and Processing. The company is involved in the gathering, processing, and transportation of natural gas; gathering, transportation, fractionation, exchange, storage, and marketing of natural gas liquids; transportation, storage, distribution, and marketing of crude oil and refined petroleum products, as well as other hydrocarbon-based products; and sale of residue gas and condensate. Its pipeline network located throughout the United States and Alaska; storage caverns consist of butane, propane, and liquefied petroleum gas storage with locations in Neal in West Virginia, Woodhaven in Michigan, Robinson in Illinois, and Jal in New Mexico; and marine business owns and operates boats and barges, including third-party chartered equipment, as well as a marine repair facility located on the Ohio River. The company also transports light products, heavy oils, crude oil, renewable fuels, chemicals, and feedstocks in the Mid-Continent and Gulf Coast regions. In addition, its refining logistics assets operates 619 tanks with a storage capacity of approximately 56 million barrels; and 32 rail and truck racks, 18 docks, and gasoline blenders. Further, the company operates terminal facilities for the receipt, storage, blending, adultization, handling, and redelivery of refined petroleum products located throughout the continental United States and Alaska. MPLX GP LLC acts as the general partner of MPLX LP. The company was incorporated in 2012 and is based in Findlay, Ohio. MPLX LP is a subsidiary of Marathon Petroleum Corporation.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Findlay",
        "zipcode": "45840-3229",
        "website": "http://www.mplx.com",
        "market_cap": 29432639488
    },
    "MRGE": {
        "short_name": "MIRAGE ENERGY CORPORATION",
        "long_name": "Mirage Energy Corporation",
        "summary": "Mirage Energy Corporation, through its subsidiaries, focuses on developing an integrated pipeline and natural gas storage facility in Mexico and the United States. The company was formerly known as Bridgewater Platforms Inc. and changed its name to Mirage Energy Corporation in November 2016. Mirage Energy Corporation was founded in 2014 and is headquartered in San Antonio, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "San Antonio",
        "zipcode": "78216",
        "website": "http://www.mirageenergycorp.com",
        "market_cap": 89564256
    },
    "NBLX": {
        "short_name": "Noble Midstream Partners LP",
        "long_name": "Noble Midstream Partners LP",
        "summary": "Noble Midstream Partners LP owns, operates, develops, and acquires midstream infrastructure assets in the United States. It operates through three segments: Gathering Systems, Fresh Water Delivery, and Investments in Midstream Entities. The company provides crude oil, natural gas, and water-related midstream services. It operates in the Denver-Julesburg Basin in Colorado and the Delaware Basin in Texas. The company was founded in 2014 and is based in Houston, Texas. Noble Midstream Partners LP is a subsidiary of Noble Energy, Inc.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77070",
        "website": "http://www.nblmidstream.com",
        "market_cap": 1374412160
    },
    "NNA": {
        "short_name": "Navios Maritime Acquisition Cor",
        "long_name": "Navios Maritime Acquisition Corporation",
        "summary": "Navios Maritime Acquisition Corporation provides marine transportation services worldwide. The company owns a fleet of crude oil, refined petroleum product, and chemical tankers. The company charters its vessels to oil companies, refiners, and large vessel operators. As of March 5, 2020, its fleet consisted of a total of 46 double-hulled tanker vessels aggregating approximately 5.7 million deadweight tons, which included 13 very large crude carrier tankers, ten Long Range 1 product tankers, 18 Medium Range 2 product tankers, three Medium Range one product tankers, and two chemical tankers. Navios Maritime Acquisition Corporation was founded in 2008 and is based in Monaco.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Monaco",
        "state": null,
        "city": "Monaco",
        "zipcode": "98000",
        "website": "http://www.navios-acquisition.com",
        "market_cap": 55143132
    },
    "NS-PB": {
        "short_name": "Nustar Energy L.P. 7.625% Serie",
        "long_name": "NuStar Energy L.P.",
        "summary": "NuStar Energy L.P. engages in the terminalling, storage, and marketing of petroleum products in the United States and internationally. The company also engages in the transportation of petroleum products and anhydrous ammonia. It operates through three segments: Pipeline, Storage, and Fuels Marketing. The Pipeline segment transports refined products, crude oil, and anhydrous ammonia. The Storage segment owns terminal and storage facilities, which offer storage, handling, and other services for petroleum products, crude oil, specialty chemicals, renewable fuels, and other liquids. This segment also provides pilotage, tug assistance, line handling, launch, emergency response, and other ship services. The Fuels Marketing segment is involved in bunkering operations in the Gulf Coast; blending operations; and purchase of petroleum products for resale. As of December 31, 2020, the company had 3,205 miles of refined product pipelines and 2,205 miles of crude oil pipelines in Texas, Oklahoma, Kansas, Colorado, and New Mexico; a 2,050-mile refined product pipeline originating in southern Kansas and terminating at Jamestown, North Dakota; a 450-mile refined product pipeline originating at Marathon Petroleum Corporation's Mandan, North Dakota refinery and terminating in Minneapolis, Minnesota; a 2,000 mile anhydrous ammonia pipeline; and 38 terminal and storage facilities, which offer approximately 59.0 million barrels of storage capacity. NuStar Energy L.P. was incorporated 1999 and is headquartered in San Antonio, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "San Antonio",
        "zipcode": "78257",
        "website": "http://www.nustarenergy.com",
        "market_cap": 2875571456
    },
    "NS": {
        "short_name": "Nustar Energy L.P.",
        "long_name": "NuStar Energy L.P.",
        "summary": "NuStar Energy L.P. engages in the terminalling, storage, and marketing of petroleum products in the United States and internationally. The company also engages in the transportation of petroleum products and anhydrous ammonia. It operates through three segments: Pipeline, Storage, and Fuels Marketing. The Pipeline segment transports refined products, crude oil, and anhydrous ammonia. The Storage segment owns terminal and storage facilities, which offer storage, handling, and other services for petroleum products, crude oil, specialty chemicals, renewable fuels, and other liquids. This segment also provides pilotage, tug assistance, line handling, launch, emergency response, and other ship services. The Fuels Marketing segment is involved in bunkering operations in the Gulf Coast; blending operations; and purchase of petroleum products for resale. As of December 31, 2020, the company had 3,205 miles of refined product pipelines and 2,205 miles of crude oil pipelines in Texas, Oklahoma, Kansas, Colorado, and New Mexico; a 2,050-mile refined product pipeline originating in southern Kansas and terminating at Jamestown, North Dakota; a 450-mile refined product pipeline originating at Marathon Petroleum Corporation's Mandan, North Dakota refinery and terminating in Minneapolis, Minnesota; a 2,000 mile anhydrous ammonia pipeline; and 38 terminal and storage facilities, which offer approximately 59.0 million barrels of storage capacity. NuStar Energy L.P. was incorporated 1999 and is headquartered in San Antonio, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "San Antonio",
        "zipcode": "78257",
        "website": "http://www.nustarenergy.com",
        "market_cap": 1969277440
    },
    "NTGAZ.IS": {
        "short_name": "NATURELGAZ",
        "long_name": "Naturelgaz Sanayi ve Ticaret A.S.",
        "summary": "Naturelgaz Sanayi ve Ticaret A.S. engages in the supply of natural gas through CNG and LNG pipelines. It also provides LNG system installation and LNG supply services. The company was founded in 2004 and is based in Beyoglu, Turkey. Naturelgaz Sanayi ve Ticaret A.S. is a subsidiary of Global Yatirim Holding A.S.",
        "currency": "TRY",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Beyoglu",
        "zipcode": "34425",
        "website": "http://www.naturelgaz.com",
        "market_cap": null
    },
    "NVGS": {
        "short_name": "Navigator Holdings Ltd.",
        "long_name": "Navigator Holdings Ltd.",
        "summary": "Navigator Holdings Ltd. owns and operates a fleet of liquefied gas carriers worldwide. The company provides international and regional seaborne transportation services of liquefied petroleum gas, petrochemical gases, and ammonia for energy companies, industrial users, and commodity traders. As of December 31, 2019, it operated a fleet of 38 semi- or fully-refrigerated liquefied gas carriers. The company was founded in 1997 and is based in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "SW1E 5DH",
        "website": "http://www.navigatorgas.com",
        "market_cap": 633833408
    },
    "O1KE34.SA": {
        "short_name": "ONEOK INC   DRN",
        "long_name": "ONEOK, Inc.",
        "summary": "ONEOK, Inc., together with its subsidiaries, engages in gathering, processing, storage, and transportation of natural gas in the United States. It operates through Natural Gas Gathering and Processing, Natural Gas Liquids, and Natural Gas Pipelines segments. The company owns natural gas gathering pipelines and processing plants in the Mid-Continent and Rocky Mountain regions. It also gathers, treats, fractionates, and transports natural gas liquids (NGL), as well as stores, markets, and distributes NGL products. The company owns NGL gathering and distribution pipelines in Oklahoma, Kansas, Texas, New Mexico, Montana, North Dakota, Wyoming, and Colorado; terminal and storage facilities in Kansas, Missouri, Nebraska, Iowa, and Illinois; and NGL distribution and refined petroleum products pipelines in Kansas, Missouri, Nebraska, Iowa, Illinois, and Indiana, as well as owns and operates truck- and rail-loading, and -unloading facilities connected to NGL fractionation, storage, and pipeline assets. In addition, it operates regulated interstate and intrastate natural gas transmission pipelines and natural gas storage facilities. Further, the company owns and operates a parking garage in downtown Tulsa, Oklahoma; and leases excess office space. It operates 18,900 miles of natural gas gathering pipelines; 1,500 miles of FERC-regulated interstate natural gas pipelines; 5,100 miles of state-regulated intrastate transmission pipeline; and 6 NGL storage facilities. It serves integrated and independent exploration and production companies; NGL and natural gas gathering and processing companies; crude oil and natural gas production companies; propane distributors; municipalities; ethanol producers; and petrochemical, refining, and NGL marketing companies, as well as natural gas distribution companies, electric generation facilities, industrial companies, producers, processors, and marketing companies. The company was founded in 1906 and is headquartered in Tulsa, Oklahoma.",
        "currency": "BRL",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "OK",
        "city": "Tulsa",
        "zipcode": "74103",
        "website": "http://www.oneok.com",
        "market_cap": 124238479360
    },
    "OCW.F": {
        "short_name": "EURONAV NV NAM.",
        "long_name": "Euronav NV",
        "summary": "Euronav NV, together with its subsidiaries, engages in the ocean transportation and storage of crude oil worldwide. The company also offers floating, storage, and offloading (FSO) services. As of April 1, 2021, it owned and operated a fleet of 77 vessels, including 10 chartered-in vessels with an aggregate carrying capacity of approximately 19.5 million deadweight tons consisting of 45 very large crude carriers, two V-plus, 28 Suezmax vessels, and two floating, storage, and offloading vessels. The company was incorporated in 2003 and is headquartered in Antwerp, Belgium.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Belgium",
        "state": null,
        "city": "Antwerp",
        "zipcode": "2000",
        "website": "http://www.euronav.com",
        "market_cap": 1580520704
    },
    "OKE": {
        "short_name": "ONEOK, Inc.",
        "long_name": "ONEOK, Inc.",
        "summary": "ONEOK, Inc., together with its subsidiaries, engages in gathering, processing, storage, and transportation of natural gas in the United States. It operates through Natural Gas Gathering and Processing, Natural Gas Liquids, and Natural Gas Pipelines segments. The company owns natural gas gathering pipelines and processing plants in the Mid-Continent and Rocky Mountain regions. It also gathers, treats, fractionates, and transports natural gas liquids (NGL), as well as stores, markets, and distributes NGL products. The company owns NGL gathering and distribution pipelines in Oklahoma, Kansas, Texas, New Mexico, Montana, North Dakota, Wyoming, and Colorado; terminal and storage facilities in Kansas, Missouri, Nebraska, Iowa, and Illinois; and NGL distribution and refined petroleum products pipelines in Kansas, Missouri, Nebraska, Iowa, Illinois, and Indiana, as well as owns and operates truck- and rail-loading, and -unloading facilities connected to NGL fractionation, storage, and pipeline assets. In addition, it operates regulated interstate and intrastate natural gas transmission pipelines and natural gas storage facilities. Further, the company owns and operates a parking garage in downtown Tulsa, Oklahoma; and leases excess office space. It operates 18,900 miles of natural gas gathering pipelines; 1,500 miles of FERC-regulated interstate natural gas pipelines; 5,100 miles of state-regulated intrastate transmission pipeline; and 6 NGL storage facilities. It serves integrated and independent exploration and production companies; NGL and natural gas gathering and processing companies; crude oil and natural gas production companies; propane distributors; municipalities; ethanol producers; and petrochemical, refining, and NGL marketing companies, as well as natural gas distribution companies, electric generation facilities, industrial companies, producers, processors, and marketing companies. The company was founded in 1906 and is headquartered in Tulsa, Oklahoma.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OK",
        "city": "Tulsa",
        "zipcode": "74103",
        "website": "http://www.oneok.com",
        "market_cap": 23764942848
    },
    "OMP": {
        "short_name": "Oasis Midstream Partners LP",
        "long_name": "Oasis Midstream Partners LP",
        "summary": "Oasis Midstream Partners LP, together with its subsidiaries, provides crude oil, natural gas, and water-related midstream services in North America. It offers natural gas gathering, compression, processing, and gas lift supply services; crude oil gathering, stabilization, blending, and storage services; produced and flowback water gathering and disposal services; freshwater distribution services; and crude oil transportation services from the Wild Basin operating area to Johnson's Corner. OMP GP LLC serves as the general partner of the company. The company was founded in 2013 and is based in Houston, Texas. Oasis Midstream Partners LP is a subsidiary of OMS Holdings LLC.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://www.oasismidstream.com",
        "market_cap": 1160256896
    },
    "ONK.DE": {
        "short_name": "ONEOK INC. (NEW)  DL-,01",
        "long_name": "ONEOK, Inc.",
        "summary": "ONEOK, Inc., together with its subsidiaries, engages in gathering, processing, storage, and transportation of natural gas in the United States. It operates through Natural Gas Gathering and Processing, Natural Gas Liquids, and Natural Gas Pipelines segments. The company owns natural gas gathering pipelines and processing plants in the Mid-Continent and Rocky Mountain regions. It also gathers, treats, fractionates, and transports natural gas liquids (NGL), as well as stores, markets, and distributes NGL products. The company owns NGL gathering and distribution pipelines in Oklahoma, Kansas, Texas, New Mexico, Montana, North Dakota, Wyoming, and Colorado; terminal and storage facilities in Kansas, Missouri, Nebraska, Iowa, and Illinois; and NGL distribution and refined petroleum products pipelines in Kansas, Missouri, Nebraska, Iowa, Illinois, and Indiana, as well as owns and operates truck- and rail-loading, and -unloading facilities connected to NGL fractionation, storage, and pipeline assets. In addition, it operates regulated interstate and intrastate natural gas transmission pipelines and natural gas storage facilities. Further, the company owns and operates a parking garage in downtown Tulsa, Oklahoma; and leases excess office space. It operates 18,900 miles of natural gas gathering pipelines; 1,500 miles of FERC-regulated interstate natural gas pipelines; 5,100 miles of state-regulated intrastate transmission pipeline; and 6 NGL storage facilities. It serves integrated and independent exploration and production companies; NGL and natural gas gathering and processing companies; crude oil and natural gas production companies; propane distributors; municipalities; ethanol producers; and petrochemical, refining, and NGL marketing companies, as well as natural gas distribution companies, electric generation facilities, industrial companies, producers, processors, and marketing companies. The company was founded in 1906 and is headquartered in Tulsa, Oklahoma.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "OK",
        "city": "Tulsa",
        "zipcode": "74103",
        "website": "http://www.oneok.com",
        "market_cap": 20154419200
    },
    "ONK.F": {
        "short_name": "ONEOK INC. (NEW)  DL-,01",
        "long_name": "ONEOK, Inc.",
        "summary": "ONEOK, Inc., together with its subsidiaries, engages in gathering, processing, storage, and transportation of natural gas in the United States. It operates through Natural Gas Gathering and Processing, Natural Gas Liquids, and Natural Gas Pipelines segments. The company owns natural gas gathering pipelines and processing plants in the Mid-Continent and Rocky Mountain regions. It also gathers, treats, fractionates, and transports natural gas liquids (NGL), as well as stores, markets, and distributes NGL products. The company owns NGL gathering and distribution pipelines in Oklahoma, Kansas, Texas, New Mexico, Montana, North Dakota, Wyoming, and Colorado; terminal and storage facilities in Kansas, Missouri, Nebraska, Iowa, and Illinois; and NGL distribution and refined petroleum products pipelines in Kansas, Missouri, Nebraska, Iowa, Illinois, and Indiana, as well as owns and operates truck- and rail-loading, and -unloading facilities connected to NGL fractionation, storage, and pipeline assets. In addition, it operates regulated interstate and intrastate natural gas transmission pipelines and natural gas storage facilities. Further, the company owns and operates a parking garage in downtown Tulsa, Oklahoma; and leases excess office space. It operates 18,900 miles of natural gas gathering pipelines; 1,500 miles of FERC-regulated interstate natural gas pipelines; 5,100 miles of state-regulated intrastate transmission pipeline; and 6 NGL storage facilities. It serves integrated and independent exploration and production companies; NGL and natural gas gathering and processing companies; crude oil and natural gas production companies; propane distributors; municipalities; ethanol producers; and petrochemical, refining, and NGL marketing companies, as well as natural gas distribution companies, electric generation facilities, industrial companies, producers, processors, and marketing companies. The company was founded in 1906 and is headquartered in Tulsa, Oklahoma.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OK",
        "city": "Tulsa",
        "zipcode": "74103",
        "website": "http://www.oneok.com",
        "market_cap": 19950311424
    },
    "OSG": {
        "short_name": "Overseas Shipholding Group, Inc",
        "long_name": "Overseas Shipholding Group, Inc.",
        "summary": "Overseas Shipholding Group, Inc., together with its subsidiaries, owns and operates a fleet of oceangoing vessels. Its vessels are engaged in the transportation of crude oil and petroleum products in the United States flag trades. As of December 31, 2019, the company owned or operated a fleet of 21 vessels totaling an aggregate of approximately 1 million deadweight tons. It serves independent oil traders, refinery operators, and the United States and international government entities. The company was founded in 1948 and is headquartered in Tampa, Florida.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Tampa",
        "zipcode": "33602",
        "website": "http://www.osg.com",
        "market_cap": 202392176
    },
    "P5P.F": {
        "short_name": "PEMBINA PIPELINE CORP.",
        "long_name": "Pembina Pipeline Corporation",
        "summary": "Pembina Pipeline Corporation provides transportation and midstream services for the energy industry. It operates through three segments: Pipelines, Facilities, and Marketing & New Ventures. The Pipelines segment operates conventional, oil sands and heavy oil, and transmission assets with a transportation capacity of 3.1 millions of barrels of oil equivalent per day, ground storage of 11 millions of barrels, and rail terminalling capacity of approximately 145 thousands of barrels of oil equivalent per day serving markets and basins across North America. The Facilities segment offers infrastructure that provides customers with natural gas, condensate, and natural gas liquids (NGLs), including ethane, propane, butane, and condensate; and includes 354 thousands of barrels per day of NGL fractionation capacity, 21 millions of barrels of cavern storage capacity, and associated pipeline and rail terminalling facilities. The Marketing & New Ventures segment buys and sells hydrocarbon liquids and natural gas originating in the Western Canadian sedimentary basin and other basins. Pembina Pipeline Corporation was incorporated in 1954 and is headquartered in Calgary, Canada.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 1G1",
        "website": "http://www.pembina.com",
        "market_cap": 14741916672
    },
    "PAA": {
        "short_name": "Plains All American Pipeline, L",
        "long_name": "Plains All American Pipeline, L.P.",
        "summary": "Plains All American Pipeline, L.P., through its subsidiaries, engages in the pipeline transportation, terminalling, storage, and gathering of crude oil and natural gas liquids (NGL) in the United States and Canada. The company operates through three segments: Transportation, Facilities, and Supply and Logistics. The Transportation segment transports crude oil and NGL through pipelines, gathering systems, and trucks. As of December 31, 2020, this segment owned and leased 18,370 miles of active crude oil and NGL pipelines and gathering systems; 35 million barrels of active and above-ground tank capacity; and 815 trailers. The Facilities segment provides storage, terminalling, and throughput services for crude oil, NGL, and natural gas; and NGL fractionation and isomerization, and natural gas and condensate processing services. As of December 31, 2020, this segment owned and operated approximately 75 million barrels of crude oil storage capacity; 28 million barrels of NGL storage capacity; 68 billion cubic feet (Bcf) of natural gas storage working capacity; 25 Bcf of base gas; five natural gas processing plants; a condensate processing facility; eight fractionation plants; 22 crude oil and NGL rail terminals; five marine facilities; and approximately 330 miles of active pipelines. The Supply and Logistics segment engages in the purchase, logistics, and resale of crude oil and NGL. As of December 31, 2020, this segment owned 16 million barrels of crude oil and NGL linefill; 4 million barrels of crude oil and NGL linefill; 680 trucks and 840 trailers; and 6,000 crude oil and NGL railcars. The company was incorporated in 1998 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://www.plainsallamerican.com",
        "market_cap": 7097810432
    },
    "PAGP": {
        "short_name": "Plains GP Holdings, L.P.",
        "long_name": "Plains GP Holdings, L.P.",
        "summary": "Plains GP Holdings, L.P. owns and operates midstream energy infrastructure in the United States and Canada. It operates through three segments: Transportation, Facilities, and Supply and Logistics. The Transportation segment engages in the transportation of crude oil and natural gas liquids (NGLs) on pipelines, gathering systems, and trucks. As of December 31, 2020, this segment owned and leased assets comprising 18,370 miles of crude oil and NGL pipelines and gathering systems; 35 million barrels of above-ground tank capacity; and 815 trailers. The Facilities segment engages in the provision of storage, terminalling, and throughput services primarily for crude oil, NGLs, and natural gas; NGL fractionation and isomerization services; and natural gas and condensate processing services. As of December 31, 2020, this segment owned and operated approximately 75 million barrels of crude oil storage capacity; 28 million barrels of NGL storage capacity; 68 billion cubic feet (Bcf) of natural gas storage capacity; 26 Bcf of base gas; 5 natural gas processing plants; a condensate processing facility; 8 fractionation plants; 22 crude oil and NGL rail terminals; 5 marine facilities; and 330 miles of pipelines. The Supply and Logistics segment engages in the purchase, logistics, and resale of crude oil and NGL. As of December 31, 2020, this segment owned 16 million barrels of crude oil and NGL linefill; 4 million barrels of crude oil and NGL linefill in pipelines owned by third parties and other inventory; 680 trucks and 840 trailers; and 6,000 crude oil and NGL railcars. The company offers logistics services to producers, refiners, and other customers. PAA GP Holdings LLC operates as a general partner of the company. Plains GP Holdings, L.P. was founded in 2013 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://www.plainsallamerican.com",
        "market_cap": 1981546368
    },
    "PBA": {
        "short_name": "Pembina Pipeline Corp.",
        "long_name": "Pembina Pipeline Corporation",
        "summary": "Pembina Pipeline Corporation provides transportation and midstream services for the energy industry. It operates through three segments: Pipelines, Facilities, and Marketing & New Ventures. The Pipelines segment operates conventional, oil sands and heavy oil, and transmission assets with a transportation capacity of 3.1 millions of barrels of oil equivalent per day, ground storage of 11 millions of barrels, and rail terminalling capacity of approximately 145 thousands of barrels of oil equivalent per day serving markets and basins across North America. The Facilities segment offers infrastructure that provides customers with natural gas, condensate, and natural gas liquids (NGLs), including ethane, propane, butane, and condensate; and includes 354 thousands of barrels per day of NGL fractionation capacity, 21 millions of barrels of cavern storage capacity, and associated pipeline and rail terminalling facilities. The Marketing & New Ventures segment buys and sells hydrocarbon liquids and natural gas originating in the Western Canadian sedimentary basin and other basins. Pembina Pipeline Corporation was incorporated in 1954 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 1G1",
        "website": "http://www.pembina.com",
        "market_cap": 17316182016
    },
    "PBFX": {
        "short_name": "PBF Logistics LP",
        "long_name": "PBF Logistics LP",
        "summary": "PBF Logistics LP owns, leases, acquires, develops, and operates crude oil and refined petroleum products terminals, pipelines, storage facilities, and other logistics assets in the United States. It operates in two segments, Transportation and Terminaling; and Storage. The company's assets include the DCR rail terminal, a double loop track with ancillary pumping and unloading equipment; the Toledo Truck Terminal, a crude truck unloading terminal; the DCR West Rack, a heavy crude oil rail unloading facility at the Delaware city refinery; the Toledo storage facility, which includes a propane storage and loading facility; the DCR products pipeline, an interstate petroleum products pipeline; the DCR truck rack, a truck loading rack; the San Joaquin Valley pipeline system and Paulsboro natural gas pipeline; and Knoxville terminals, which consists of two refined product terminals located in Knoxville, Tennessee. It engages in receiving, handling, storing, and transferring crude oil, refined products, natural gas, and intermediates. The company was founded in 2012 and is headquartered in Parsippany, New Jersey.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Parsippany",
        "zipcode": "07054",
        "website": "http://www.pbflogistics.com",
        "market_cap": 1010946304
    },
    "PBNAF": {
        "short_name": "PEMBINA PIPELINE CORPORATION",
        "long_name": "Pembina Pipeline Corporation",
        "summary": "Pembina Pipeline Corporation provides transportation and midstream services for the energy industry. It operates through three segments: Pipelines, Facilities, and Marketing & New Ventures. The Pipelines segment operates conventional, oil sands and heavy oil, and transmission assets with a transportation capacity of 3.1 millions of barrels of oil equivalent per day, ground storage of 11 millions of barrels, and rail terminalling capacity of approximately 145 thousands of barrels of oil equivalent per day serving markets and basins across North America. The Facilities segment offers infrastructure that provides customers with natural gas, condensate, and natural gas liquids (NGLs), including ethane, propane, butane, and condensate; and includes 354 thousands of barrels per day of NGL fractionation capacity, 21 millions of barrels of cavern storage capacity, and associated pipeline and rail terminalling facilities. The Marketing & New Ventures segment buys and sells hydrocarbon liquids and natural gas originating in the Western Canadian sedimentary basin and other basins. Pembina Pipeline Corporation was incorporated in 1954 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 1G1",
        "website": "http://www.pembina.com",
        "market_cap": null
    },
    "PG81.F": {
        "short_name": "PLAINS GP HLDGF LP UTS A",
        "long_name": "Plains GP Holdings, L.P.",
        "summary": "Plains GP Holdings, L.P. owns and operates midstream energy infrastructure in the United States and Canada. It operates through three segments: Transportation, Facilities, and Supply and Logistics. The Transportation segment engages in the transportation of crude oil and natural gas liquids (NGLs) on pipelines, gathering systems, and trucks. As of December 31, 2020, this segment owned and leased assets comprising 18,370 miles of crude oil and NGL pipelines and gathering systems; 35 million barrels of above-ground tank capacity; and 815 trailers. The Facilities segment engages in the provision of storage, terminalling, and throughput services primarily for crude oil, NGLs, and natural gas; NGL fractionation and isomerization services; and natural gas and condensate processing services. As of December 31, 2020, this segment owned and operated approximately 75 million barrels of crude oil storage capacity; 28 million barrels of NGL storage capacity; 68 billion cubic feet (Bcf) of natural gas storage capacity; 26 Bcf of base gas; 5 natural gas processing plants; a condensate processing facility; 8 fractionation plants; 22 crude oil and NGL rail terminals; 5 marine facilities; and 330 miles of pipelines. The Supply and Logistics segment engages in the purchase, logistics, and resale of crude oil and NGL. As of December 31, 2020, this segment owned 16 million barrels of crude oil and NGL linefill; 4 million barrels of crude oil and NGL linefill in pipelines owned by third parties and other inventory; 680 trucks and 840 trailers; and 6,000 crude oil and NGL railcars. The company offers logistics services to producers, refiners, and other customers. PAA GP Holdings LLC operates as a general partner of the company. Plains GP Holdings, L.P. was founded in 2013 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://www.plainsallamerican.com",
        "market_cap": 2073280768
    },
    "PMBPF": {
        "short_name": "PEMBINA PIPELINE CORPORATION 4.",
        "long_name": "Pembina Pipeline Corporation",
        "summary": "Pembina Pipeline Corporation provides transportation and midstream services for the energy industry. It operates through three segments: Pipelines, Facilities, and Marketing & New Ventures. The Pipelines segment operates conventional, oil sands and heavy oil, and transmission assets with a transportation capacity of 3.1 millions of barrels of oil equivalent per day, ground storage of 11 millions of barrels, and rail terminalling capacity of approximately 145 thousands of barrels of oil equivalent per day serving markets and basins across North America. The Facilities segment offers infrastructure that provides customers with natural gas, condensate, and natural gas liquids (NGLs), including ethane, propane, butane, and condensate; and includes 354 thousands of barrels per day of NGL fractionation capacity, 21 millions of barrels of cavern storage capacity, and associated pipeline and rail terminalling facilities. The Marketing & New Ventures segment buys and sells hydrocarbon liquids and natural gas originating in the Western Canadian sedimentary basin and other basins. Pembina Pipeline Corporation was incorporated in 1954 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 1G1",
        "website": "http://www.pembina.com",
        "market_cap": null
    },
    "PPL-PA.TO": {
        "short_name": "PEMBINA PIPELINE CORP PREF CLAS",
        "long_name": "Pembina Pipeline Corporation",
        "summary": "Pembina Pipeline Corporation provides transportation and midstream services for the energy industry. It operates through three segments: Pipelines, Facilities, and Marketing & New Ventures. The Pipelines segment operates conventional, oil sands and heavy oil, and transmission assets with a transportation capacity of 3.1 millions of barrels of oil equivalent per day, ground storage of 11 millions of barrels, and rail terminalling capacity of approximately 145 thousands of barrels of oil equivalent per day serving markets and basins across North America. The Facilities segment offers infrastructure that provides customers with natural gas, condensate, and natural gas liquids (NGLs), including ethane, propane, butane, and condensate; and includes 354 thousands of barrels per day of NGL fractionation capacity, 21 millions of barrels of cavern storage capacity, and associated pipeline and rail terminalling facilities. The Marketing & New Ventures segment buys and sells hydrocarbon liquids and natural gas originating in the Western Canadian sedimentary basin and other basins. Pembina Pipeline Corporation was incorporated in 1954 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 1G1",
        "website": "http://www.pembina.com",
        "market_cap": 33447538688
    },
    "PPL-PC.TO": {
        "short_name": "PEMBINA PIPELINE CORP PREF SER ",
        "long_name": "Pembina Pipeline Corporation",
        "summary": "Pembina Pipeline Corporation provides transportation and midstream services for the energy industry. It operates through three segments: Pipelines, Facilities, and Marketing & New Ventures. The Pipelines segment operates conventional, oil sands and heavy oil, and transmission assets with a transportation capacity of 3.1 millions of barrels of oil equivalent per day, ground storage of 11 millions of barrels, and rail terminalling capacity of approximately 145 thousands of barrels of oil equivalent per day serving markets and basins across North America. The Facilities segment offers infrastructure that provides customers with natural gas, condensate, and natural gas liquids (NGLs), including ethane, propane, butane, and condensate; and includes 354 thousands of barrels per day of NGL fractionation capacity, 21 millions of barrels of cavern storage capacity, and associated pipeline and rail terminalling facilities. The Marketing & New Ventures segment buys and sells hydrocarbon liquids and natural gas originating in the Western Canadian sedimentary basin and other basins. Pembina Pipeline Corporation was incorporated in 1954 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 1G1",
        "website": "http://www.pembina.com",
        "market_cap": 32879071232
    },
    "PPL-PE.TO": {
        "short_name": "PEMBINA PIPELINE CORP PREF SERI",
        "long_name": "Pembina Pipeline Corporation",
        "summary": "Pembina Pipeline Corporation provides transportation and midstream services for the energy industry. It operates through three segments: Pipelines, Facilities, and Marketing & New Ventures. The Pipelines segment operates conventional, oil sands and heavy oil, and transmission assets with a transportation capacity of 3.1 millions of barrels of oil equivalent per day, ground storage of 11 millions of barrels, and rail terminalling capacity of approximately 145 thousands of barrels of oil equivalent per day serving markets and basins across North America. The Facilities segment offers infrastructure that provides customers with natural gas, condensate, and natural gas liquids (NGLs), including ethane, propane, butane, and condensate; and includes 354 thousands of barrels per day of NGL fractionation capacity, 21 millions of barrels of cavern storage capacity, and associated pipeline and rail terminalling facilities. The Marketing & New Ventures segment buys and sells hydrocarbon liquids and natural gas originating in the Western Canadian sedimentary basin and other basins. Pembina Pipeline Corporation was incorporated in 1954 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 1G1",
        "website": "http://www.pembina.com",
        "market_cap": 32662528000
    },
    "PPL-PG.TO": {
        "short_name": "PEMBINA PIPELINE CORP PREF SERI",
        "long_name": "Pembina Pipeline Corporation",
        "summary": "Pembina Pipeline Corporation provides transportation and midstream services for the energy industry. It operates through three segments: Pipelines, Facilities, and Marketing & New Ventures. The Pipelines segment operates conventional, oil sands and heavy oil, and transmission assets with a transportation capacity of 3.1 millions of barrels of oil equivalent per day, ground storage of 11 millions of barrels, and rail terminalling capacity of approximately 145 thousands of barrels of oil equivalent per day serving markets and basins across North America. The Facilities segment offers infrastructure that provides customers with natural gas, condensate, and natural gas liquids (NGLs), including ethane, propane, butane, and condensate; and includes 354 thousands of barrels per day of NGL fractionation capacity, 21 millions of barrels of cavern storage capacity, and associated pipeline and rail terminalling facilities. The Marketing & New Ventures segment buys and sells hydrocarbon liquids and natural gas originating in the Western Canadian sedimentary basin and other basins. Pembina Pipeline Corporation was incorporated in 1954 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 1G1",
        "website": "http://www.pembina.com",
        "market_cap": 34619092992
    },
    "PPL-PM.TO": {
        "short_name": "PEMBINA PIPELINE CORP PREF SER ",
        "long_name": "Pembina Pipeline Corporation",
        "summary": "Pembina Pipeline Corporation provides transportation and midstream services for the energy industry. It operates through three segments: Pipelines, Facilities, and Marketing & New Ventures. The Pipelines segment operates conventional, oil sands and heavy oil, and transmission assets with a transportation capacity of 3.1 millions of barrels of oil equivalent per day, ground storage of 11 millions of barrels, and rail terminalling capacity of approximately 145 thousands of barrels of oil equivalent per day serving markets and basins across North America. The Facilities segment offers infrastructure that provides customers with natural gas, condensate, and natural gas liquids (NGLs), including ethane, propane, butane, and condensate; and includes 354 thousands of barrels per day of NGL fractionation capacity, 21 millions of barrels of cavern storage capacity, and associated pipeline and rail terminalling facilities. The Marketing & New Ventures segment buys and sells hydrocarbon liquids and natural gas originating in the Western Canadian sedimentary basin and other basins. Pembina Pipeline Corporation was incorporated in 1954 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 1G1",
        "website": "http://www.pembina.com",
        "market_cap": 24434317312
    },
    "PPL-PS.TO": {
        "short_name": "PEMBINA PIPELINE CORP PREF SERI",
        "long_name": "Pembina Pipeline Corporation",
        "summary": "Pembina Pipeline Corporation provides transportation and midstream services for the energy industry. It operates through three segments: Pipelines, Facilities, and Marketing & New Ventures. The Pipelines segment operates conventional, oil sands and heavy oil, and transmission assets with a transportation capacity of 3.1 millions of barrels of oil equivalent per day, ground storage of 11 millions of barrels, and rail terminalling capacity of approximately 145 thousands of barrels of oil equivalent per day serving markets and basins across North America. The Facilities segment offers infrastructure that provides customers with natural gas, condensate, and natural gas liquids (NGLs), including ethane, propane, butane, and condensate; and includes 354 thousands of barrels per day of NGL fractionation capacity, 21 millions of barrels of cavern storage capacity, and associated pipeline and rail terminalling facilities. The Marketing & New Ventures segment buys and sells hydrocarbon liquids and natural gas originating in the Western Canadian sedimentary basin and other basins. Pembina Pipeline Corporation was incorporated in 1954 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 1G1",
        "website": "http://www.pembina.com",
        "market_cap": 29437454336
    },
    "PPL.TO": {
        "short_name": "PEMBINA PIPELINE CORPORATION",
        "long_name": "Pembina Pipeline Corporation",
        "summary": "Pembina Pipeline Corporation provides transportation and midstream services for the energy industry. It operates through three segments: Pipelines, Facilities, and Marketing & New Ventures. The Pipelines segment operates conventional, oil sands and heavy oil, and transmission assets with a transportation capacity of 3.1 millions of barrels of oil equivalent per day, ground storage of 11 millions of barrels, and rail terminalling capacity of approximately 145 thousands of barrels of oil equivalent per day serving markets and basins across North America. The Facilities segment offers infrastructure that provides customers with natural gas, condensate, and natural gas liquids (NGLs), including ethane, propane, butane, and condensate; and includes 354 thousands of barrels per day of NGL fractionation capacity, 21 millions of barrels of cavern storage capacity, and associated pipeline and rail terminalling facilities. The Marketing & New Ventures segment buys and sells hydrocarbon liquids and natural gas originating in the Western Canadian sedimentary basin and other basins. Pembina Pipeline Corporation was incorporated in 1954 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 1G1",
        "website": "http://www.pembina.com",
        "market_cap": 20790319104
    },
    "PRM.BK": {
        "short_name": "PRIMA MARINE PUBLIC COMPANY LIM",
        "long_name": "Prima Marine Public Company Limited",
        "summary": "Prima Marine Public Company Limited engages in the marine transportation of petroleum products and accommodation work barges in Thailand and Singapore. The company engages in the transportation and storage of crude oil, petroleum products, semi-petroleum products, and liquefied petroleum products; transportation of chemical products; and provision of oil tankers, floating storage and offloading units, and anchor handling tugs to support offshore petroleum exploration and production. It also offers recruitment and ship management services. The company was incorporated in 2007 and is headquartered in Bangkok, Thailand. Prima Marine Public Company Limited is a subsidiary of Nathalin Co., Ltd.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10260",
        "website": "http://www.primamarine.co.th",
        "market_cap": 19000000512
    },
    "PSTC-R.BK": {
        "short_name": "POWER SOLUTION TECHNOLOGIES",
        "long_name": "Power Solution Technologies Public Company Limited",
        "summary": "Power Solution Technologies Public Company Limited primarily distributes and installs various types of power control and power backup systems in Thailand. It operates through Power Control System and Power Backup System; Electricity Generating from Renewable Energy; Petroleum Distribution; and Construction segments. The company is also involved in the production and distribution of electricity using solar, wind, biological, biomass, biogas, and waste; design, construction, engineering, and procurement of renewable energy plants, gas stations, and fuel storage.; and invests in other companies. In addition, it engages in the distribution of liquefied petroleum and liquefied natural gas; transportation of oil through a pipeline transport system; operation of gas stations; power and environment monitoring solution; and provides energy management services, including design, consultation, project management, energy consumption analysis, device installation and operation, financing, and measurements through energy management system for buildings. The company was incorporated in 2001 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10220",
        "website": "http://www.pst.co.th",
        "market_cap": 5402323456
    },
    "PSTC.BK": {
        "short_name": "POWER SOLUTION TECHNOLOGIES",
        "long_name": "Power Solution Technologies Public Company Limited",
        "summary": "Power Solution Technologies Public Company Limited primarily distributes and installs various types of power control and power backup systems in Thailand. It operates through Power Control System and Power Backup System; Electricity Generating from Renewable Energy; Petroleum Distribution; and Construction segments. The company is also involved in the production and distribution of electricity using solar, wind, biological, biomass, biogas, and waste; design, construction, engineering, and procurement of renewable energy plants, gas stations, and fuel storage.; and invests in other companies. In addition, it engages in the distribution of liquefied petroleum and liquefied natural gas; transportation of oil through a pipeline transport system; operation of gas stations; power and environment monitoring solution; and provides energy management services, including design, consultation, project management, energy consumption analysis, device installation and operation, financing, and measurements through energy management system for buildings. The company was incorporated in 2001 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10220",
        "website": "http://www.pst.co.th",
        "market_cap": 5170851328
    },
    "PSXP": {
        "short_name": "Phillips 66 Partners LP",
        "long_name": "Phillips 66 Partners LP",
        "summary": "Phillips 66 Partners LP owns, operates, develops, and acquires midstream assets. It offers transportation, terminaling, processing, stevedoring, storage, and fractionation of crude oil, refined petroleum products, and natural gas liquids. The company was founded in 2013 and is headquartered in Houston, Texas. Phillips 66 Partners LP is a subsidiary of Phillips 66 Project Development Inc.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77042",
        "website": "http://www.phillips66partners.com",
        "market_cap": 8183705600
    },
    "RTLR": {
        "short_name": "Rattler Midstream LP",
        "long_name": "Rattler Midstream LP",
        "summary": "Rattler Midstream LP owns, operates, develops, and acquires midstream and energy-related infrastructure assets in the Midland and Delaware Basins of the Permian Basin in West Texas. The company operates in two segments, Midstream Services and Real Estate Operations. It provides crude oil, natural gas, and water-related midstream services. As of December 31, 2020, the company owned and operated 927 miles of crude oil, natural gas, sourced water and produced water gathering pipelines on acreage that overlays Diamondback's seven core Midland and Delaware Basin development areas. It also rents real estate properties. Rattler Midstream GP LLC serves as the general partner of the company. The company was formerly known as Rattler Midstream Partners LP. The company was incorporated in 2018 and is based in Midland, Texas. Rattler Midstream LP is a subsidiary of Diamondback Energy, Inc.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Midland",
        "zipcode": "79701",
        "website": "http://www.rattlermidstream.com",
        "market_cap": 1678065280
    },
    "S0QA.F": {
        "short_name": "SCORPIO TANKERS  DL -,10",
        "long_name": "Scorpio Tankers Inc.",
        "summary": "Scorpio Tankers Inc., together with its subsidiaries, engages in the seaborne transportation of refined petroleum products in the shipping markets worldwide. As of March 30, 2021, it owned, finance leased, or bareboat chartered 131 product tankers, which included 42 LR2, 12 LR1, 63 MR, and 14 Handymax tankers with a weighted average age of approximately 5.2 years. The company was incorporated in 2009 and is based in Monaco.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Monaco",
        "state": null,
        "city": "Monaco",
        "zipcode": "98000",
        "website": "http://www.scorpiotankers.com",
        "market_cap": 1114339328
    },
    "S0QA.SG": {
        "short_name": "Scorpio Tankers Inc. Registered",
        "long_name": "Scorpio Tankers Inc.",
        "summary": "Scorpio Tankers Inc., together with its subsidiaries, engages in the seaborne transportation of refined petroleum products in the shipping markets worldwide. As of March 30, 2021, it owned, finance leased, or bareboat chartered 131 product tankers, which included 42 LR2, 12 LR1, 63 MR, and 14 Handymax tankers with a weighted average age of approximately 5.2 years. The company was incorporated in 2009 and is based in Monaco.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Monaco",
        "state": null,
        "city": "Monaco",
        "zipcode": "98000",
        "website": "http://www.scorpiotankers.com",
        "market_cap": 1127280768
    },
    "S5H.F": {
        "short_name": "SIEM OFFSHORE NEW  DL-,01",
        "long_name": "Siem Offshore Inc.",
        "summary": "Siem Offshore Inc., together with its subsidiaries, owns and operates offshore support vessels for the offshore energy service industry and offshore wind market. It operates platform supply vessels (PSVs); offshore subsea construction vessels (OSCVs); anchor-handling tug supply vessels (AHTS vessels); other vessels, including fast crew, fast supply, and oil spill recovery vessels; and scientific core-drilling and others. As of March 31, 2021, it had a fleet of 30 vessels, which included six PSVs, four OSCVs, ten AHTS vessels, two well-intervention vessels, one scientific core-drilling vessel, five Brazilian flagged vessels, and one Canadian flagged vessels comprising AHTS vessels and PSVs. It operates in Norway, North Sea, the Arctic Ocean, Northern Pacific Ocean, West Africa, Australia, South East Asia, Canada, and Brazil. The company was founded in 2005 and is headquartered in Kristiansand, Norway. Siem Offshore Inc. is a subsidiary of Siem Sustainable Energy S.Ã  r.l.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Norway",
        "state": null,
        "city": "Kristiansand",
        "zipcode": "4610",
        "website": "http://www.siemoffshore.com",
        "market_cap": 5415100
    },
    "SAK.F": {
        "short_name": "SINOPEC KANTONS H.  HD-10",
        "long_name": "Sinopec Kantons Holdings Limited",
        "summary": "Sinopec Kantons Holdings Limited, an investment holding company, provides crude oil jetty services. It operates through, Crude Oil Jetty and Storage Services; and Vessel Chartering and Logistics Services segments. The company offers crude oil transportation, unloading, storage, and other jetty services for oil tankers in the People's Republic of China (PRC), Europe, and the Middle East; and vessel chartering services for liquefied natural gas transportation in the PRC, Australia, and the Papua New Guinea. It also engages in the trading of crude oil; and provision of oil supporting and ancillary services. The company was founded in 1998 and is headquartered in Causeway Bay, Hong Kong. Sinopec Kantons Holdings Limited is a subsidiary of Sinopec Kantons International Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.sinopec.com.hk",
        "market_cap": 840601792
    },
    "SGU": {
        "short_name": "Star Group L.P.",
        "long_name": "Star Group, L.P.",
        "summary": "Star Group, L.P. sells home heating and air conditioning products and services to residential and commercial home heating oil and propane customers in the United States. It also sells diesel, gasoline, and home heating oil on a delivery only basis, as well as provide plumbing services; and installs, maintains, and repairs heating and air conditioning equipment. As of September 30, 2020, the company served approximately 440,100 full service residential and commercial home heating oil and propane customers and 64,400 customers on a delivery only basis. It also sells gasoline and diesel fuel to approximately 26,400 customers. Kestrel Heat, LLC operates as the general partner of the company. The company was formerly known as Star Gas Partners, L.P. and changed its name to Star Group, L.P. in October 2017. Star Group, L.P. was founded in 1995 and is based in Stamford, Connecticut.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Stamford",
        "zipcode": "06902",
        "website": "http://www.stargrouplp.com",
        "market_cap": 468374304
    },
    "SHLX": {
        "short_name": "Shell Midstream Partners, L.P.",
        "long_name": "Shell Midstream Partners, L.P.",
        "summary": "Shell Midstream Partners, L.P. owns, operates, develops, and acquires pipelines and other midstream, and logistics assets in the United States. It owns interests in crude oil and refined products pipelines and terminals to transport onshore and offshore crude oil production to Gulf Coast and Midwest refining markets. The company stores and transports crude oil, refined, natural gas, and refinery gas products for various customers, including producers, refiners, marketers, and traders, as well as to other crude oil and refined products pipelines through its pipelines and storage tanks. Shell Midstream Partners GP LLC serves as the general partner of Shell Midstream Partners, L.P. The company was founded in 2014 and is headquartered in Houston, Texas. Shell Midstream Partners, L.P. operates as a subsidiary of Shell Pipeline Company LP.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77079",
        "website": "http://www.shellmidstreampartners.com",
        "market_cap": 5820691968
    },
    "SIOFF.OL": {
        "short_name": "SIEM OFFSHORE INC",
        "long_name": "Siem Offshore Inc.",
        "summary": "Siem Offshore Inc., together with its subsidiaries, owns and operates offshore support vessels for the offshore energy service industry and offshore wind market. It operates platform supply vessels (PSVs); offshore subsea construction vessels (OSCVs); anchor-handling tug supply vessels (AHTS vessels); other vessels, including fast crew, fast supply, and oil spill recovery vessels; and scientific core-drilling and others. As of March 31, 2021, it had a fleet of 30 vessels, which included six PSVs, four OSCVs, ten AHTS vessels, two well-intervention vessels, one scientific core-drilling vessel, five Brazilian flagged vessels, and one Canadian flagged vessels comprising AHTS vessels and PSVs. It operates in Norway, North Sea, the Arctic Ocean, Northern Pacific Ocean, West Africa, Australia, South East Asia, Canada, and Brazil. The company was founded in 2005 and is headquartered in Kristiansand, Norway. Siem Offshore Inc. is a subsidiary of Siem Sustainable Energy S.Ã  r.l.",
        "currency": "NOK",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Norway",
        "state": null,
        "city": "Kristiansand",
        "zipcode": "4610",
        "website": "http://www.siemoffshore.com",
        "market_cap": 4766234112
    },
    "SMLP": {
        "short_name": "Summit Midstream Partners, LP",
        "long_name": "Summit Midstream Partners, LP",
        "summary": "Summit Midstream Partners, LP focuses on owning, developing, and operating midstream energy infrastructure assets primarily shale formations in the continental United States. The company provides natural gas gathering, compression, treating, and processing services, as well as crude oil and produced water gathering services. Its unconventional resource basins include the Utica and Point Pleasant shale formations in southeastern Ohio; the Williston Basin that consists of the Bakken and Three Forks shale formations in northwestern North Dakota; the Denver-Julesburg Basin, which include the Niobrara and Codell shale formations in Colorado; the Permian Basin that comprise the Bone Spring and Wolfcamp shale formations in New Mexico; the Piceance Basin, which include the Mesaverde formation, and the Mancos and Niobrara shale formations in western Colorado; the Barnett Shale formation in north-central Texas; and the Marcellus Shale formation in northern West Virginia. The company also owns an ownership interest in Ohio Gathering, which owns and operates natural gas gathering and condensate stabilization facility in the Utica Shale in southeastern Ohio. It serves natural gas and crude oil producers. Summit Midstream GP, LLC operates as a general partner of the company. The company was founded in 2009 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://www.summitmidstream.com",
        "market_cap": 179814768
    },
    "SNMP": {
        "short_name": "Evolve Transition Infrastructur",
        "long_name": "Evolve Transition Infrastructure LP",
        "summary": "Evolve Transition Infrastructure LP engages in the acquisition, development, ownership, and operation of infrastructure for the transition of energy supply to lower carbon sources in the United States. It operates through two segments, Midstream and Production. The Midstream segment engages in gathering, processing, and transporting natural gas, NGLs, and crude oil. This segment also operates approximately 160 miles of gathering pipelines, as well as four gathering and processing facilities, including stabilizers, storage tanks, compressors and dehydration units, and other related assets in Western Catarina, which are located in Dimmit and Webb Counties, Texas; and provides upstream production services from the Eagle Ford Shale in South Texas. The Production segment is involved in the production of crude oil and natural gas. As of December 31, 2020, this segment had total estimated proved reserves of approximately 2.3 million barrels of oil equivalent. The company also owns production assets in Texas and Louisiana. Evolve Transition Infrastructure GP LLC serves as the general partner of the company. The company was formerly known as Sanchez Midstream Partners LP and changed its name to Evolve Transition Infrastructure LP in February 2021. Evolve Transition Infrastructure LP was incorporated in 2005 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77056",
        "website": "http://www.evolvetransition.com",
        "market_cap": 42700904
    },
    "SPKOY": {
        "short_name": "SINOPEC KANTONS HLDGS",
        "long_name": "Sinopec Kantons Holdings Limited",
        "summary": "Sinopec Kantons Holdings Limited, an investment holding company, provides crude oil jetty services. It operates through, Crude Oil Jetty and Storage Services; and Vessel Chartering and Logistics Services segments. The company offers crude oil transportation, unloading, storage, and other jetty services for oil tankers in the People's Republic of China (PRC), Europe, and the Middle East; and vessel chartering services for liquefied natural gas transportation in the PRC, Australia, and the Papua New Guinea. It also engages in the trading of crude oil; and provision of oil supporting and ancillary services. The company was founded in 1998 and is headquartered in Causeway Bay, Hong Kong. Sinopec Kantons Holdings Limited is a subsidiary of Sinopec Kantons International Limited.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.sinopec.com.hk",
        "market_cap": 938697728
    },
    "STNG": {
        "short_name": "Scorpio Tankers Inc.",
        "long_name": "Scorpio Tankers Inc.",
        "summary": "Scorpio Tankers Inc., together with its subsidiaries, engages in the seaborne transportation of refined petroleum products in the shipping markets worldwide. As of March 30, 2021, it owned, finance leased, or bareboat chartered 131 product tankers, which included 42 LR2, 12 LR1, 63 MR, and 14 Handymax tankers with a weighted average age of approximately 5.2 years. The company was incorporated in 2009 and is based in Monaco.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Monaco",
        "state": null,
        "city": "Monaco",
        "zipcode": "98000",
        "website": "http://www.scorpiotankers.com",
        "market_cap": 1165055104
    },
    "TAR.F": {
        "short_name": "TARGA RESOURCES DL -,001",
        "long_name": "Targa Resources Corp.",
        "summary": "Targa Resources Corp., together with its subsidiary, Targa Resources Partners LP, owns, operates, acquires, and develops a portfolio of midstream energy assets in North America. It operates in two segments, Gathering and Processing, and Logistics and Transportation. The company engages in gathering, compressing, treating, processing, transporting, and selling natural gas; storing, fractionating, treating, transporting, and selling natural gas liquids (NGL) and NGL products, including services to liquefied petroleum gas exporters; and gathering, purchasing, storing, terminaling, and selling crude oil. It is also involved in the purchase and resale of NGL products; and wholesale of propane, as well as provision of related logistics services to multi-state retailers, independent retailers, and other end-users. In addition, the company offers NGL balancing services; and transportation services to refineries and petrochemical companies in the Gulf Coast area, as well as purchases, markets, and resells natural gas. It operates approximately 28,700 miles of natural gas pipelines, including 42 owned and operated processing plants; and owns or operates a total of 34 storage wells with a gross storage capacity of approximately 75 million barrels. As of December 31, 2020, the company leased and managed approximately 694 railcars; 124 transport tractors; and 2 company-owned pressurized NGL barges. Targa Resources Corp. was incorporated in 2005 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://www.targaresources.com",
        "market_cap": 8482794496
    },
    "TCANF": {
        "short_name": "TC ENERGY CORPORATION",
        "long_name": "TC Energy Corporation",
        "summary": "TC Energy Corporation operates as an energy infrastructure company in North America. It operates through Canadian Natural Gas Pipelines, U.S. Natural Gas Pipelines, Mexico Natural Gas Pipelines, Liquids Pipelines, and Power and Storage segments. The company builds and operates 93,400 km network of natural gas pipelines, which transports natural gas from supply basins to local distribution companies, power generation plants, industrial facilities, interconnecting pipelines, LNG export terminals, and other businesses. It also has regulated natural gas storage facilities with a total working gas capacity of 535 billion cubic feet. In addition, it has approximately 4,900 km liquids pipeline system that connects Alberta crude oil supplies to refining markets in Illinois, Oklahoma, Texas, and the U.S. Gulf Coast. Further, the company owns or has interests in seven power generation facilities with a combined capacity of approximately 4,200 megawatts that are powered by natural gas and nuclear fuel sources located in Alberta, Ontario, QuÃ©bec, and New Brunswick; and owns and operates approximately 118 billion cubic feet of non-regulated natural gas storage capacity in Alberta. The company was formerly known as TransCanada Corporation and changed its name to TC Energy Corporation in May 2019. TC Energy Corporation was incorporated in 1951 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 5H1",
        "website": "http://www.tcenergy.com",
        "market_cap": 63073619968
    },
    "TCD.F": {
        "short_name": "TEEKAY CORP.",
        "long_name": "Teekay Corporation",
        "summary": "Teekay Corporation operates as a marine energy transportation company. The company offers pool management, fuel services, oil and clean product STS transfers, LNG STS and terminal management, and tanker services. As of March 18, 2021, it operated 47 liquefied natural gas (LNG) carriers, 23 mid-size liquefied petroleum gas carriers, and seven multi-gas carriers. The company serves energy and utility companies, oil traders, large oil and LNG consumers, petroleum product producers, government agencies, and various other entities worldwide. Teekay Corporation was founded in 1973 and is headquartered in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "state": null,
        "city": "Hamilton",
        "zipcode": "HM 08",
        "website": "http://www.teekay.com",
        "market_cap": 356201792
    },
    "TDGDF": {
        "short_name": "TRANSPORTADORA DE GAS DEL NORTE",
        "long_name": "Transportadora de Gas del Norte S.A.",
        "summary": "Transportadora de Gas del Norte S.A. transports natural gas in the north and central west regions of Argentina. It operates and maintains approximately 6,806 kilometers of gas pipelines. The company also provides operation, maintenance, pipeline works management, engineering, damage prevention, consulting, training, and special projects services. The company was founded in 1992 and is headquartered in Buenos Aires, Argentina. Transportadora de Gas del Norte S.A. is a subsidiary of Gasinvest S.A.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Argentina",
        "state": null,
        "city": "Buenos Aires",
        "zipcode": null,
        "website": "http://www.tgn.com.ar",
        "market_cap": 2196870144
    },
    "TGNO4.BA": {
        "short_name": "TRANSPORT GAS NORT",
        "long_name": "Transportadora de Gas del Norte S.A.",
        "summary": "Transportadora de Gas del Norte S.A. transports natural gas in the north and central west regions of Argentina. It operates and maintains approximately 6,806 kilometers of gas pipelines. The company also provides operation, maintenance, pipeline works management, engineering, damage prevention, consulting, training, and special projects services. The company was founded in 1992 and is headquartered in Buenos Aires, Argentina. Transportadora de Gas del Norte S.A. is a subsidiary of Gasinvest S.A.",
        "currency": "ARS",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "Argentina",
        "state": null,
        "city": "Buenos Aires",
        "zipcode": null,
        "website": "http://www.tgn.com.ar",
        "market_cap": 22188388352
    },
    "TGP": {
        "short_name": "Teekay LNG Partners L.P.",
        "long_name": "Teekay LNG Partners L.P.",
        "summary": "Teekay LNG Partners L.P. provides marine transportation services focusing on liquefied natural gas (LNG) and liquefied petroleum gas (LPG) worldwide. It operates in two segments, LNG and LPG. The company transports liquid petroleum gases, including propane, butane, and ethane; petrochemical gases, such as ethylene, propylene, and butadiene; and ammonia. As of December 31, 2020, it had a fleet of 47 LNG carriers and 30 LPG and multi-gas carriers. Teekay GP L.L.C. serves as the general partner of the company. Teekay LNG Partners L.P. was incorporated in 2004 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "state": null,
        "city": "Hamilton",
        "zipcode": "HM 08",
        "website": "http://www.teekay.com",
        "market_cap": 1382524032
    },
    "TGS": {
        "short_name": "Transportadora de Gas del Sur S",
        "long_name": "Transportadora de Gas del Sur S.A.",
        "summary": "Transportadora de Gas del Sur S.A. provides natural gas transportation and distribution services in Argentina. The company operates through four segments: Natural Gas Transportation Services; Liquids Production and Commercialization; Other Services; and Telecommunications. The Natural Gas Transportation segment transports natural gas through 5,769 miles of pipeline system to distribution companies, power plants, and industrial customers. As of December 31, 2018, it served 6.2 million residential, commercial, industrial, and electric power generation end-users. It also provides operation and maintenance services for the natural gas transportation facilities. The Liquids Production and Commercialization segment produces and commercializes natural gas liquids, such as ethane, liquid petroleum gas, natural gasoline, propane, and butane in Argentina and internationally. The Other Services segment offers midstream services, including natural gas treatment, separation, and removal of impurities from the natural gas stream, as well as natural gas compression. It also provides services related to pipeline and compression plant construction, operation, and maintenance; and generates steam for electricity production. The Telecommunications segment provides telecommunication services with a network that includes a microwave digital network with synchronous digital hierarchy technology and a dark fiber optic network. The company was founded in 1992 and is headquartered in Buenos Aires, Argentina. Transportadora de Gas del Sur S.A. is a subsidiary of CompaÃ±Ã­a de Inversiones de EnergÃ­a S.A.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Argentina",
        "state": null,
        "city": "Buenos Aires",
        "zipcode": "1206",
        "website": "http://www.tgs.com.ar",
        "market_cap": 680495040
    },
    "THH.F": {
        "short_name": "TEEKAY LNG PARTNERS UTS",
        "long_name": "Teekay LNG Partners L.P.",
        "summary": "Teekay LNG Partners L.P. provides marine transportation services focusing on liquefied natural gas (LNG) and liquefied petroleum gas (LPG) worldwide. It operates in two segments, LNG and LPG. The company transports liquid petroleum gases, including propane, butane, and ethane; petrochemical gases, such as ethylene, propylene, and butadiene; and ammonia. As of December 31, 2020, it had a fleet of 47 LNG carriers and 30 LPG and multi-gas carriers. Teekay GP L.L.C. serves as the general partner of the company. Teekay LNG Partners L.P. was incorporated in 2004 and is based in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "state": null,
        "city": "Hamilton",
        "zipcode": "HM 08",
        "website": "http://www.teekay.com",
        "market_cap": 1145601280
    },
    "TK": {
        "short_name": "Teekay Corporation",
        "long_name": "Teekay Corporation",
        "summary": "Teekay Corporation operates as a marine energy transportation company. The company offers pool management, fuel services, oil and clean product STS transfers, LNG STS and terminal management, and tanker services. As of March 18, 2021, it operated 47 liquefied natural gas (LNG) carriers, 23 mid-size liquefied petroleum gas carriers, and seven multi-gas carriers. The company serves energy and utility companies, oil traders, large oil and LNG consumers, petroleum product producers, government agencies, and various other entities worldwide. Teekay Corporation was founded in 1973 and is headquartered in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "state": null,
        "city": "Hamilton",
        "zipcode": "HM 08",
        "website": "http://www.teekay.com",
        "market_cap": 361970208
    },
    "TK41.F": {
        "short_name": "TSAKOS EN. NAV. LTD",
        "long_name": "Tsakos Energy Navigation Limited",
        "summary": "Tsakos Energy Navigation Limited provides seaborne crude oil and petroleum product transportation services worldwide. The company offers marine transportation services for national, major, and other independent oil companies and refiners under long, medium, and short-term charters. As of April 2, 2021, it operated a fleet of 66 double-hull vessels, comprising of 61 conventional tankers, two LNG carriers, and three suezmax DP2 shuttle tankers. The company was formerly known as MIF Limited and changed its name to Tsakos Energy Navigation Limited in July 2001. Tsakos Energy Navigation Limited was incorporated in 1993 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "175 64",
        "website": "http://www.tenn.gr",
        "market_cap": 142542976
    },
    "TL5.F": {
        "short_name": "TIDEW. MIDS.+INFRASTR.LTD",
        "long_name": "Tidewater Midstream and Infrastructure Ltd.",
        "summary": "Tidewater Midstream and Infrastructure Ltd., through its subsidiaries, operates as a diversified midstream and infrastructure company in North America. It primarily focuses on natural gas, natural gas liquids (NGLs), and crude oil midstream infrastructure, and light oil refining within the Western Canadian Sedimentary Basin, including the Montney, Edmonton, and Deep Basin core areas, as well as Prince George, British Columbia in Canada. The company engages in gathering, processing, and transportation; crude oil refining and refined products marketing; NGL extraction and marketing; and crude oil marketing and transportation. It also sells refined petroleum products, including gasoline, low sulfur diesel, and ancillary products; produces and sells natural gas and NGLs; retails propane; and rents railcar, as well as operates export terminals and storage facilities. The company was incorporated in 2015 and is headquartered in Calgary, Canada.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 0B4",
        "website": "http://www.tidewatermidstream.com",
        "market_cap": 295491712
    },
    "TNK": {
        "short_name": "Teekay Tankers Ltd.",
        "long_name": "Teekay Tankers Ltd.",
        "summary": "Teekay Tankers Ltd. provides marine transportation services to oil industries in Bermuda and internationally. The company offers voyage and time charter services; and offshore Ship-to-ship transfer services of commodities primarily crude oil and refined oil products, as well as liquid gases and various other products. It also provides tanker commercial and technical management, liquefied natural gas terminal management, consultancy, procurement, equipment rental, and other related services; and lightering support services, including, full-service lightering and other lightering support services. As of December 31, 2020, the company owned and leased 52 double-hull oil tankers, and 9 time chartered-in tankers. Its vessels are employed through long-term, fixed-rate time-charter contracts and spot tanker market. The company was founded in 2007 and is based in Hamilton, Canada.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Hamilton",
        "zipcode": "HM 08",
        "website": "http://www.teekay.com/business/tankers",
        "market_cap": 468622208
    },
    "TNP-PD": {
        "short_name": "Tsakos Energy Navigation Ltd 8.",
        "long_name": "Tsakos Energy Navigation Limited",
        "summary": "Tsakos Energy Navigation Limited provides seaborne crude oil and petroleum product transportation services worldwide. The company offers marine transportation services for national, major, and other independent oil companies and refiners under long, medium, and short-term charters. As of April 2, 2021, it operated a fleet of 66 double-hull vessels, comprising of 61 conventional tankers, two LNG carriers, and three suezmax DP2 shuttle tankers. The company was formerly known as MIF Limited and changed its name to Tsakos Energy Navigation Limited in July 2001. Tsakos Energy Navigation Limited was incorporated in 1993 and is based in Athens, Greece.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "175 64",
        "website": "http://www.tenn.gr",
        "market_cap": 318772512
    },
    "TNP-PE": {
        "short_name": "Tsakos Energy Navigation Ltd Se",
        "long_name": "Tsakos Energy Navigation Limited",
        "summary": "Tsakos Energy Navigation Limited provides seaborne crude oil and petroleum product transportation services worldwide. The company offers marine transportation services for national, major, and other independent oil companies and refiners under long, medium, and short-term charters. As of April 2, 2021, it operated a fleet of 66 double-hull vessels, comprising of 61 conventional tankers, two LNG carriers, and three suezmax DP2 shuttle tankers. The company was formerly known as MIF Limited and changed its name to Tsakos Energy Navigation Limited in July 2001. Tsakos Energy Navigation Limited was incorporated in 1993 and is based in Athens, Greece.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "175 64",
        "website": "http://www.tenn.gr",
        "market_cap": 315466528
    },
    "TNP-PF": {
        "short_name": "Tsakos Energy Navigation Ltd Se",
        "long_name": "Tsakos Energy Navigation Limited",
        "summary": "Tsakos Energy Navigation Limited provides seaborne crude oil and petroleum product transportation services worldwide. The company offers marine transportation services for national, major, and other independent oil companies and refiners under long, medium, and short-term charters. As of April 2, 2021, it operated a fleet of 66 double-hull vessels, comprising of 61 conventional tankers, two LNG carriers, and three suezmax DP2 shuttle tankers. The company was formerly known as MIF Limited and changed its name to Tsakos Energy Navigation Limited in July 2001. Tsakos Energy Navigation Limited was incorporated in 1993 and is based in Athens, Greece.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "175 64",
        "website": "http://www.tenn.gr",
        "market_cap": 309230656
    },
    "TNP": {
        "short_name": "Tsakos Energy Navigation Ltd",
        "long_name": "Tsakos Energy Navigation Limited",
        "summary": "Tsakos Energy Navigation Limited provides seaborne crude oil and petroleum product transportation services worldwide. The company offers marine transportation services for national, major, and other independent oil companies and refiners under long, medium, and short-term charters. As of April 2, 2021, it operated a fleet of 66 double-hull vessels, comprising of 61 conventional tankers, two LNG carriers, and three suezmax DP2 shuttle tankers. The company was formerly known as MIF Limited and changed its name to Tsakos Energy Navigation Limited in July 2001. Tsakos Energy Navigation Limited was incorporated in 1993 and is based in Athens, Greece.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "175 64",
        "website": "http://www.tenn.gr",
        "market_cap": 176317296
    },
    "TPZ.TO": {
        "short_name": "TOPAZ ENERGY CORP",
        "long_name": "Topaz Energy Corp.",
        "summary": "Topaz Energy Corp. operates as a royalty and energy infrastructure company. It operates through the segments, Royalty Assets and Infrastructure Assets. The company holds gross overriding royalty interests on approximately 3.0 million gross acres of developed and undeveloped lands. It is also involved in natural gas processing activities. The company was formerly known as Exshaw Oil Corp. and changed its name to Topaz Energy Corp. in November 2019. Topaz Energy Corp. was incorporated in 2006 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 3H7",
        "website": "http://topazenergy.ca",
        "market_cap": 1640582016
    },
    "TPZEF": {
        "short_name": "TOPAZ ENERGY CORP",
        "long_name": "Topaz Energy Corp.",
        "summary": "Topaz Energy Corp. operates as a royalty and energy infrastructure company. It operates through the segments, Royalty Assets and Infrastructure Assets. The company holds gross overriding royalty interests on approximately 3.0 million gross acres of developed and undeveloped lands. It is also involved in natural gas processing activities. The company was formerly known as Exshaw Oil Corp. and changed its name to Topaz Energy Corp. in November 2019. Topaz Energy Corp. was incorporated in 2006 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 3H7",
        "website": "http://topazenergy.ca",
        "market_cap": 1361813120
    },
    "TRGP": {
        "short_name": "Targa Resources, Inc.",
        "long_name": "Targa Resources Corp.",
        "summary": "Targa Resources Corp., together with its subsidiary, Targa Resources Partners LP, owns, operates, acquires, and develops a portfolio of midstream energy assets in North America. It operates in two segments, Gathering and Processing, and Logistics and Transportation. The company engages in gathering, compressing, treating, processing, transporting, and selling natural gas; storing, fractionating, treating, transporting, and selling natural gas liquids (NGL) and NGL products, including services to liquefied petroleum gas exporters; and gathering, purchasing, storing, terminaling, and selling crude oil. It is also involved in the purchase and resale of NGL products; and wholesale of propane, as well as provision of related logistics services to multi-state retailers, independent retailers, and other end-users. In addition, the company offers NGL balancing services; and transportation services to refineries and petrochemical companies in the Gulf Coast area, as well as purchases, markets, and resells natural gas. It operates approximately 28,700 miles of natural gas pipelines, including 42 owned and operated processing plants; and owns or operates a total of 34 storage wells with a gross storage capacity of approximately 75 million barrels. As of December 31, 2020, the company leased and managed approximately 694 railcars; 124 transport tractors; and 2 company-owned pressurized NGL barges. Targa Resources Corp. was incorporated in 2005 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://www.targaresources.com",
        "market_cap": 8741480448
    },
    "TRMD-A.CO": {
        "short_name": "TORM plc A",
        "long_name": "TORM plc",
        "summary": "TORM plc, a product tanker company, engages in the transportation of refined oil products and crude oil worldwide. The company transports gasoline, jet fuel, naphtha, and diesel. As of March 1, 2021, it operated a fleet of approximately 80 vessels. The company was founded in 1889 and is based in London, the United Kingdom.",
        "currency": "DKK",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "CPH",
        "market": "dk_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC3V 9DU",
        "website": "http://www.torm.com",
        "market_cap": 4186789120
    },
    "TRMD": {
        "short_name": "TORM plc",
        "long_name": "TORM plc",
        "summary": "TORM plc, a product tanker company, engages in the transportation of refined oil products and crude oil worldwide. The company transports gasoline, jet fuel, naphtha, and diesel. As of March 1, 2021, it operated a fleet of approximately 80 vessels. The company was founded in 1889 and is based in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC3V 9DU",
        "website": "http://www.torm.com",
        "market_cap": 667218368
    },
    "TRNFP.ME": {
        "short_name": "TRANSNEFT PJSC",
        "long_name": "Public Joint Stock Company Transneft",
        "summary": "Public Joint Stock Company Transneft, together with its subsidiaries, transports oil and oil products in Russia and internationally. The company operates approximately 67,000 kilometers of trunk oil pipelines; 500 pumping stations; and 24 million cubic meters of storage tanks. It also offers services for oil and oil products transportation; and preventive maintenance, diagnostics, emergency response, and repair services for trunk pipelines. The company was formerly known as Oil Transporting Joint Stock Company Transneft. Public Joint Stock Company Transneft was founded in 1993 and is based in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "123112",
        "website": "http://www.transneft.ru",
        "market_cap": 1209189924864
    },
    "TRP": {
        "short_name": "TC Energy Corporation",
        "long_name": "TC Energy Corporation",
        "summary": "TC Energy Corporation operates as an energy infrastructure company in North America. It operates through Canadian Natural Gas Pipelines, U.S. Natural Gas Pipelines, Mexico Natural Gas Pipelines, Liquids Pipelines, and Power and Storage segments. The company builds and operates 93,400 km network of natural gas pipelines, which transports natural gas from supply basins to local distribution companies, power generation plants, industrial facilities, interconnecting pipelines, LNG export terminals, and other businesses. It also has regulated natural gas storage facilities with a total working gas capacity of 535 billion cubic feet. In addition, it has approximately 4,900 km liquids pipeline system that connects Alberta crude oil supplies to refining markets in Illinois, Oklahoma, Texas, and the U.S. Gulf Coast. Further, the company owns or has interests in seven power generation facilities with a combined capacity of approximately 4,200 megawatts that are powered by natural gas and nuclear fuel sources located in Alberta, Ontario, QuÃ©bec, and New Brunswick; and owns and operates approximately 118 billion cubic feet of non-regulated natural gas storage capacity in Alberta. The company was formerly known as TransCanada Corporation and changed its name to TC Energy Corporation in May 2019. TC Energy Corporation was incorporated in 1951 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 5H1",
        "website": "http://www.tcenergy.com",
        "market_cap": 50074415104
    },
    "TRP.TO": {
        "short_name": "TC ENERGY CORP.",
        "long_name": "TC Energy Corporation",
        "summary": "TC Energy Corporation operates as an energy infrastructure company in North America. It operates through Canadian Natural Gas Pipelines, U.S. Natural Gas Pipelines, Mexico Natural Gas Pipelines, Liquids Pipelines, and Power and Storage segments. The company builds and operates 93,400 km network of natural gas pipelines, which transports natural gas from supply basins to local distribution companies, power generation plants, industrial facilities, interconnecting pipelines, LNG export terminals, and other businesses. It also has regulated natural gas storage facilities with a total working gas capacity of 535 billion cubic feet. In addition, it has approximately 4,900 km liquids pipeline system that connects Alberta crude oil supplies to refining markets in Illinois, Oklahoma, Texas, and the U.S. Gulf Coast. Further, the company owns or has interests in seven power generation facilities with a combined capacity of approximately 4,200 megawatts that are powered by natural gas and nuclear fuel sources located in Alberta, Ontario, QuÃ©bec, and New Brunswick; and owns and operates approximately 118 billion cubic feet of non-regulated natural gas storage capacity in Alberta. The company was formerly known as TransCanada Corporation and changed its name to TC Energy Corporation in May 2019. TC Energy Corporation was incorporated in 1951 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 5H1",
        "website": "http://www.tcenergy.com",
        "market_cap": 63065845760
    },
    "TRS.F": {
        "short_name": "TC ENERGY CORP.",
        "long_name": "TC Energy Corporation",
        "summary": "TC Energy Corporation operates as an energy infrastructure company in North America. It operates through Canadian Natural Gas Pipelines, U.S. Natural Gas Pipelines, Mexico Natural Gas Pipelines, Liquids Pipelines, and Power and Storage segments. The company builds and operates 93,400 km network of natural gas pipelines, which transports natural gas from supply basins to local distribution companies, power generation plants, industrial facilities, interconnecting pipelines, LNG export terminals, and other businesses. It also has regulated natural gas storage facilities with a total working gas capacity of 535 billion cubic feet. In addition, it has approximately 4,900 km liquids pipeline system that connects Alberta crude oil supplies to refining markets in Illinois, Oklahoma, Texas, and the U.S. Gulf Coast. Further, the company owns or has interests in seven power generation facilities with a combined capacity of approximately 4,200 megawatts that are powered by natural gas and nuclear fuel sources located in Alberta, Ontario, QuÃ©bec, and New Brunswick; and owns and operates approximately 118 billion cubic feet of non-regulated natural gas storage capacity in Alberta. The company was formerly known as TransCanada Corporation and changed its name to TC Energy Corporation in May 2019. TC Energy Corporation was incorporated in 1951 and is headquartered in Calgary, Canada.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 5H1",
        "website": "http://www.tcenergy.com",
        "market_cap": 42826727424
    },
    "TWM.TO": {
        "short_name": "TIDEWATER MIDSTREAM AND INFRAS ",
        "long_name": "Tidewater Midstream and Infrastructure Ltd.",
        "summary": "Tidewater Midstream and Infrastructure Ltd., through its subsidiaries, operates as a diversified midstream and infrastructure company in North America. It primarily focuses on natural gas, natural gas liquids (NGLs), and crude oil midstream infrastructure, and light oil refining within the Western Canadian Sedimentary Basin, including the Montney, Edmonton, and Deep Basin core areas, as well as Prince George, British Columbia in Canada. The company engages in gathering, processing, and transportation; crude oil refining and refined products marketing; NGL extraction and marketing; and crude oil marketing and transportation. It also sells refined petroleum products, including gasoline, low sulfur diesel, and ancillary products; produces and sells natural gas and NGLs; retails propane; and rents railcar, as well as operates export terminals and storage facilities. The company was incorporated in 2015 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 0B4",
        "website": "http://www.tidewatermidstream.com",
        "market_cap": 440827360
    },
    "TWMIF": {
        "short_name": "TIDEWATER MIDSTREAM & INFRASTR ",
        "long_name": "Tidewater Midstream and Infrastructure Ltd.",
        "summary": "Tidewater Midstream and Infrastructure Ltd., through its subsidiaries, operates as a diversified midstream and infrastructure company in North America. It primarily focuses on natural gas, natural gas liquids (NGLs), and crude oil midstream infrastructure, and light oil refining within the Western Canadian Sedimentary Basin, including the Montney, Edmonton, and Deep Basin core areas, as well as Prince George, British Columbia in Canada. The company engages in gathering, processing, and transportation; crude oil refining and refined products marketing; NGL extraction and marketing; and crude oil marketing and transportation. It also sells refined petroleum products, including gasoline, low sulfur diesel, and ancillary products; produces and sells natural gas and NGLs; retails propane; and rents railcar, as well as operates export terminals and storage facilities. The company was incorporated in 2015 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 0B4",
        "website": "http://www.tidewatermidstream.com",
        "market_cap": 377097120
    },
    "USWS": {
        "short_name": "U.S. Well Services, Inc.",
        "long_name": "U.S. Well Services, Inc.",
        "summary": "U.S. Well Services, Inc. operates as an oilfield service company in the United States. It provides hydraulic fracturing services to the oil and natural gas exploration, and production companies. The company was founded in 2012 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77056",
        "website": "http://www.uswellservices.com",
        "market_cap": 66327232
    },
    "VEG.F": {
        "short_name": "VIPER ENERGY PARTNERS UTS",
        "long_name": "Viper Energy Partners LP",
        "summary": "Viper Energy Partners LP owns, acquires, and exploits oil and natural gas properties in North America. As of December 31, 2020, it had mineral interests in 24,350 net royalty acres in the Permian Basin and Eagle Ford Shale; and estimated proved oil and natural gas reserves of 99,392 thousand barrels of crude oil equivalent. Viper Energy Partners GP LLC operates as the general partner of the company. The company was founded in 2013 and is based in Midland, Texas. Viper Energy Partners LP is a subsidiary of Diamondback Energy, Inc.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Midland",
        "zipcode": "79701",
        "website": "http://www.viperenergy.com",
        "market_cap": 2481946112
    },
    "VH2.F": {
        "short_name": "FR.VORWERK GRP SE INH ON",
        "long_name": "Friedrich Vorwerk Group SE",
        "summary": "Friedrich Vorwerk Group SE provides various solutions for critical mid-stream on-shore energy transformation and transportation infrastructure in Germany and Europe. The company operates through four segments: Natural Gas, Electricity, Clean Hydrogen, and Adjacent Opportunities. The Natural Gas segment plans, engineers, builds, operates, and maintains infrastructure solutions for the on-shore transportation of natural gas through high-pressure pipelines and storage facilities, as well as for the conditioning of the gas in filtering and separation systems in compressor stations, and pressure regulating and metering stations. The Electricity segment plans, engineers, builds, operates, and maintains infrastructure solutions for the on-shore underground transportation of high-voltage AC- and DC- electricity over long distance, as well as solutions for the transformation of electricity into the required form for onward transportation regarding voltage and type of current. The Clean Hydrogen segment plans, engineers, builds, operates, and maintains infrastructure solutions for the industrial production of hydrogen in the form of electrolyzer station. It also plans, engineers, builds, operates, and maintains infrastructure solutions for the on-shore transportation of hydrogen through high-pressure pipelines and storage facilities, as well as for the conditioning of the hydrogen in filtering and separation systems in compressor stations, and pressure regulating and metering stations. The Adjacent Opportunities segment provides solutions and services for district heating, fresh-water and waste-water transportation and treatment, chemical and petrochemical industry, and the purification and transportation of biogenic and synthetic gases. The company was founded in 1962 and is headquartered in Tostedt, Germany.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Germany",
        "state": null,
        "city": "Tostedt",
        "zipcode": "21255",
        "website": "http://www.friedrich-vorwerk.de",
        "market_cap": null
    },
    "VNOM": {
        "short_name": "Viper Energy Partners LP",
        "long_name": "Viper Energy Partners LP",
        "summary": "Viper Energy Partners LP owns, acquires, and exploits oil and natural gas properties in North America. As of December 31, 2020, it had mineral interests in 24,350 net royalty acres in the Permian Basin and Eagle Ford Shale; and estimated proved oil and natural gas reserves of 99,392 thousand barrels of crude oil equivalent. Viper Energy Partners GP LLC operates as the general partner of the company. The company was founded in 2013 and is based in Midland, Texas. Viper Energy Partners LP is a subsidiary of Diamondback Energy, Inc.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Midland",
        "zipcode": "79701",
        "website": "http://www.viperenergy.com",
        "market_cap": 2901674496
    },
    "W-PM.TO": {
        "short_name": "WESTCOAST ENERGY INC PREF SERIE",
        "long_name": "Westcoast Energy Inc.",
        "summary": "Westcoast Energy Inc., through its subsidiaries, owns and operates natural gas-related energy assets in Canada. The company provides transmission of natural gas services to customers in western Canada, the United States Pacific Northwest, and the Maritime Provinces in Canada. It has approximately 2,900 kilometers of transmission pipelines in British Columbia and Alberta, as well as associated mainline compressor stations. The company also owns natural gas transmission system of approximately 890 kilometers, which extends from Goldboro, Nova Scotia to the United States border near Baileyville, Maine. In addition, the company is involved in the storage, transmission, and distribution of natural gas in Ontario. It serves approximately 3.8 million residential, commercial, and industrial customers. The company was formerly known as Westcoast Transmission Company Limited and changed its name to Westcoast Energy Inc. in 1988. The company was founded in 1949 and is headquartered in Calgary, Canada. Westcoast Energy Inc. is a subsidiary of Enbridge Inc.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 3L8",
        "website": "http://noms.wei-pipeline.com",
        "market_cap": 3462560000
    },
    "W1MB34.SA": {
        "short_name": "WILLIAMS COSDRN",
        "long_name": "The Williams Companies, Inc.",
        "summary": "The Williams Companies, Inc., together with its subsidiaries, operates as an energy infrastructure company primarily in the United States. It operates through Transmission & Gulf of Mexico, Northeast G&P, and West segments. The Transmission & Gulf of Mexico segment comprises Transco and Northwest natural gas pipelines; and natural gas gathering and processing, and crude oil production handling and transportation assets in the Gulf Coast region. The Northeast G&P segment engages in the midstream gathering, processing, and fractionation activities in the Marcellus Shale region primarily in Pennsylvania and New York, and the Utica Shale region of eastern Ohio. The West segment comprises gas gathering, processing, and treating operations in the Rocky Mountain region of Colorado and Wyoming, the Barnett Shale region of north-central Texas, the Eagle Ford Shale region of South Texas, the Haynesville Shale region of northwest Louisiana, and the Mid-Continent region, which includes the Anadarko, Arkoma, and Permian basins; and natural gas liquid (NGL) and natural gas marketing operations, as well as storage facilities. The company owns and operates 30,000 miles of pipelines, 34 processing facilities, 9 fractionation facilities, and approximately 23 million barrels of NGL storage capacity. The Williams Companies, Inc. was founded in 1908 and is headquartered in Tulsa, Oklahoma.",
        "currency": "BRL",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "OK",
        "city": "Tulsa",
        "zipcode": "74102-2400",
        "website": "http://www.williams.com",
        "market_cap": 166170329088
    },
    "WES": {
        "short_name": "Western Midstream Partners, LP",
        "long_name": "Western Midstream Partners, LP",
        "summary": "Western Midstream Partners, LP, together with its subsidiaries, acquire, own, develop, and operate midstream assets primarily in the United States. It is involved in gathering, compressing, treating, processing, and transporting of natural gas; gathering, stabilizing, and transporting of condensate, natural gas liquids, and crude oil; and gathering and disposing of produced water. The company also buys and sells natural gas, NGLs, and condensate. Western Midstream Holdings, LLC operates as the general partner of the company. The company was formerly known as Western Gas Equity Partners, LP and changed its name to Western Midstream Partners, LP in February 2019. The company was founded in 2007 and is headquartered in The Woodlands, Texas. Western Midstream Partners, LP operates as a subsidiary of Occidental Petroleum Corporation.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "The Woodlands",
        "zipcode": "77380",
        "website": "http://www.westernmidstream.com",
        "market_cap": 9074972672
    },
    "WMB.DE": {
        "short_name": "WILLIAMS COS INC.  DL 1",
        "long_name": "The Williams Companies, Inc.",
        "summary": "The Williams Companies, Inc., together with its subsidiaries, operates as an energy infrastructure company primarily in the United States. It operates through Transmission & Gulf of Mexico, Northeast G&P, and West segments. The Transmission & Gulf of Mexico segment comprises Transco and Northwest natural gas pipelines; and natural gas gathering and processing, and crude oil production handling and transportation assets in the Gulf Coast region. The Northeast G&P segment engages in the midstream gathering, processing, and fractionation activities in the Marcellus Shale region primarily in Pennsylvania and New York, and the Utica Shale region of eastern Ohio. The West segment comprises gas gathering, processing, and treating operations in the Rocky Mountain region of Colorado and Wyoming, the Barnett Shale region of north-central Texas, the Eagle Ford Shale region of South Texas, the Haynesville Shale region of northwest Louisiana, and the Mid-Continent region, which includes the Anadarko, Arkoma, and Permian basins; and natural gas liquid (NGL) and natural gas marketing operations, as well as storage facilities. The company owns and operates 30,000 miles of pipelines, 34 processing facilities, 9 fractionation facilities, and approximately 23 million barrels of NGL storage capacity. The Williams Companies, Inc. was founded in 1908 and is headquartered in Tulsa, Oklahoma.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "OK",
        "city": "Tulsa",
        "zipcode": "74102-2400",
        "website": "http://www.williams.com",
        "market_cap": 27273304064
    },
    "WMB.F": {
        "short_name": "WILLIAMS COS INC.  DL 1",
        "long_name": "The Williams Companies, Inc.",
        "summary": "The Williams Companies, Inc., together with its subsidiaries, operates as an energy infrastructure company primarily in the United States. It operates through Transmission & Gulf of Mexico, Northeast G&P, and West segments. The Transmission & Gulf of Mexico segment comprises Transco and Northwest natural gas pipelines; and natural gas gathering and processing, and crude oil production handling and transportation assets in the Gulf Coast region. The Northeast G&P segment engages in the midstream gathering, processing, and fractionation activities in the Marcellus Shale region primarily in Pennsylvania and New York, and the Utica Shale region of eastern Ohio. The West segment comprises gas gathering, processing, and treating operations in the Rocky Mountain region of Colorado and Wyoming, the Barnett Shale region of north-central Texas, the Eagle Ford Shale region of South Texas, the Haynesville Shale region of northwest Louisiana, and the Mid-Continent region, which includes the Anadarko, Arkoma, and Permian basins; and natural gas liquid (NGL) and natural gas marketing operations, as well as storage facilities. The company owns and operates 30,000 miles of pipelines, 34 processing facilities, 9 fractionation facilities, and approximately 23 million barrels of NGL storage capacity. The Williams Companies, Inc. was founded in 1908 and is headquartered in Tulsa, Oklahoma.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OK",
        "city": "Tulsa",
        "zipcode": "74102-2400",
        "website": "http://www.williams.com",
        "market_cap": 27335108608
    },
    "WMB": {
        "short_name": "Williams Companies, Inc. (The)",
        "long_name": "The Williams Companies, Inc.",
        "summary": "The Williams Companies, Inc., together with its subsidiaries, operates as an energy infrastructure company primarily in the United States. It operates through Transmission & Gulf of Mexico, Northeast G&P, and West segments. The Transmission & Gulf of Mexico segment comprises Transco and Northwest natural gas pipelines; and natural gas gathering and processing, and crude oil production handling and transportation assets in the Gulf Coast region. The Northeast G&P segment engages in the midstream gathering, processing, and fractionation activities in the Marcellus Shale region primarily in Pennsylvania and New York, and the Utica Shale region of eastern Ohio. The West segment comprises gas gathering, processing, and treating operations in the Rocky Mountain region of Colorado and Wyoming, the Barnett Shale region of north-central Texas, the Eagle Ford Shale region of South Texas, the Haynesville Shale region of northwest Louisiana, and the Mid-Continent region, which includes the Anadarko, Arkoma, and Permian basins; and natural gas liquid (NGL) and natural gas marketing operations, as well as storage facilities. The company owns and operates 30,000 miles of pipelines, 34 processing facilities, 9 fractionation facilities, and approximately 23 million barrels of NGL storage capacity. The Williams Companies, Inc. was founded in 1908 and is headquartered in Tulsa, Oklahoma.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OK",
        "city": "Tulsa",
        "zipcode": "74102-2400",
        "website": "http://www.williams.com",
        "market_cap": 30271817728
    }
}