{
    "35G.F": {
        "short_name": "GENPACT LTD  DL 0,01",
        "long_name": "Genpact Limited",
        "summary": "Genpact Limited provides business process outsourcing and information technology (IT) services North and Latin America, India, rest of Asia, and Europe. It operates in three segments: Banking, Capital Markets and Insurance; Consumer Goods, Retail, Life Sciences and Healthcare; and High Tech, Manufacturing and Services. The company's finance and accounting services include accounts payable, such as document management, invoice processing, approval and resolution management, and travel and expense processing; invoice-to-cash services, including customer master data management, credit and contract management, fulfillment, billing, collections, and dispute management services; record to report services comprising accounting, treasury, tax, product cost accounting, and closing and reporting services; financial planning and analysis consisting of budgeting, forecasting, and business performance reporting; and enterprise risk and compliance services, including operational risks and controls. It also provides supply chain design, planning, inventory optimization, transportation and logistics management, and after-sales services; sourcing and procurement services comprising direct and indirect strategic sourcing, category management, spend analytics, procurement operation, master data management, and other procurement and supply chain advisory services; and sales and commercial services in the lead-to-quote, quote-to-order, and customer service areas. In addition, the company offers IT services, which include end-user computing support, infrastructure management, application production support, and database management services; and transformation services that include digital solutions, consulting services, and analytics services and solutions. It serves banking, capital market, insurance, consumer goods, retail, life science, healthcare, high tech, and manufacturing and service industries. Genpact Limited was founded in 1997 and is based in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "G": {
        "short_name": "Genpact Limited",
        "long_name": "Genpact Limited",
        "summary": "Genpact Limited provides business process outsourcing and information technology (IT) services North and Latin America, India, rest of Asia, and Europe. It operates in three segments: Banking, Capital Markets and Insurance; Consumer Goods, Retail, Life Sciences and Healthcare; and High Tech, Manufacturing and Services. The company's finance and accounting services include accounts payable, such as document management, invoice processing, approval and resolution management, and travel and expense processing; invoice-to-cash services, including customer master data management, credit and contract management, fulfillment, billing, collections, and dispute management services; record to report services comprising accounting, treasury, tax, product cost accounting, and closing and reporting services; financial planning and analysis consisting of budgeting, forecasting, and business performance reporting; and enterprise risk and compliance services, including operational risks and controls. It also provides supply chain design, planning, inventory optimization, transportation and logistics management, and after-sales services; sourcing and procurement services comprising direct and indirect strategic sourcing, category management, spend analytics, procurement operation, master data management, and other procurement and supply chain advisory services; and sales and commercial services in the lead-to-quote, quote-to-order, and customer service areas. In addition, the company offers IT services, which include end-user computing support, infrastructure management, application production support, and database management services; and transformation services that include digital solutions, consulting services, and analytics services and solutions. It serves banking, capital market, insurance, consumer goods, retail, life science, healthcare, high tech, and manufacturing and service industries. Genpact Limited was founded in 1997 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "SSTRF": {
        "short_name": "SILVERSTAR HLDGS",
        "long_name": "Silverstar Holdings Ltd.",
        "summary": "Silverstar Holdings Ltd., through its subsidiaries, publishes entertainment software worldwide. It publishes entertainment software for various game platforms, including Microsoft's Xbox 360 and Xbox platforms, Sony's PS2 and PSP platforms, Nintendo's Wii, and DS platforms, as well as personal computer, mobile, and other digital platforms. The company also develops wireless broadband solutions for the mobile telecommunications industry. Silverstar Holdings Ltd.'s games are sold directly in the United Kingdom; either directly or through third party software distributors in the rest of Europe; and through licensed third party distributors in North America. Its products are also sold on CD's and over the Internet. Silverstar Holdings Ltd. was formerly known as Leisureplanet Holdings, Ltd. and changed its name to Silverstar Holdings Ltd. in December 2000. The company was founded in 1995 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    }
}