{
  "STU.NZ": {
    "city": "Auckland",
    "country": "New Zealand",
    "currency": "NZD",
    "exchange": "NZE",
    "industry": "Steel",
    "long_name": "Steel & Tube Holdings Limited",
    "market": "nz_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "Steel & Tube Holdings Limited O",
    "state": null,
    "summary": "Steel & Tube Holdings Limited provides steel products, services, and solutions in New Zealand. The company offers structural steel, bar and plate products, and hollow steel sections; pipe and cable support products that include clip pipes, cables, and wire suspension systems; and stainless steel products, such as coils, sheets, plates, pipes, hygienic tube and associated fittings, and various structural bars, handrails, and architectural products to large scale projects and to the stainless steel fabricators, major corporations, and businesses in the construction, diary, water, food processing, energy, and manufacturing sectors. It also provides architectural stainless steel and other metals; chain and rigging services and solutions; pipes, valves, and fittings for petrochemical, power generation, mining, irrigation, fire protection, building services, and water and wastewater industries; profile metal roofing, cladding, and rainwater products; HST purlins and top hats; and fastening solutions for construction, manufacturing, general engineering, and fabrication sectors. In addition, the company offers fabricated reinforcing steel meshes, bars, ties, piles, beams, and columns for use in building and construction industry; engineered reinforcing solutions; composite floor decks; industrial consumable products, such as grinding discs and cut off wheels, adhesives and sealants, drills and drill sets, CRC and ROCOL, and industrial tools; galvanised, hot- and cold-rolled, aluminised, enameled, and colorsteel sheet and coil solutions; and reinforcing, fencing, fence panels, wire, gates, and nail products for use in agricultural, horticultural, and viticultural industries, as well as rural construction sector. Steel & Tube Holdings Limited was founded in 1953 and is based in Auckland, New Zealand.",
    "website": "http://www.steelandtube.co.nz",
    "zipcode": "2013"
  }
}
