{"30X.F": {"short_name": "CRAYON GROUP HOLDING NK 1", "long_name": "Crayon Group Holding ASA", "summary": "Crayon Group Holding ASA, together with its subsidiaries, operates as an IT advisory company in software and digital transformation services. It operates through Software & Cloud Direct, Software & Cloud Channel, Software & Cloud Economics, and Consulting segments. The company offers license management and consultancy services; SAM as a Service, a single hosted managed service that enables its clients to control software and technology assets across their IT environment; and SAM-iQ, which provides a centralized program interface that allows its customers to analyze, review, and manage their SAM environment. It also provides software and cloud economic services, including license management and solutions across large and mid-market enterprises, public sector, and cloud and service provider markets, as well as deployment planning services. In addition, the company offers consulting services in the areas of cloud architecture and deployment solutions, licensing environment optimization and management, security, datacenter systems, infrastructure and networking, backup and data recovery, servers environments, and storage and virtualization solutions; and managed services, such as outsourced license lifecycle management, project management, audit simulation and support, and infrastructure management and support services. Further, it provides training, events, and development programs for IT professionals. The company has operations in the Nordics, Europe, the Asia-Pacific, the Middle East and Africa, and the United States. The company has a strategic collaboration agreement with Amazon Web Services. Crayon Group Holding ASA is headquartered in Oslo, Norway.", "currency": "EUR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "FRA", "market": "dr_market", "country": "Norway", "city": "Oslo"}, "ATEA.OL": {"short_name": "ATEA ASA", "long_name": "Atea ASA", "summary": "Atea ASA supplies IT infrastructure and related solutions for businesses and public sector organizations in the Nordic countries and Baltic regions. The company provides hardware and software solutions for storing and managing information, as well as tools for virtualization, automation, and security for operating the data center environment; client hardware, software, and services to the requirements of users, applications, security, networks, and computing environments. It also offers hardware and software solutions for running networks, and services to help customers manage their communications; and a range of products to enable collaboration through conferencing, information sharing, and digital productivity solutions. In addition, it provides Device as a Service to various concepts, such as videoconferencing, digital signage, and networks. Atea ASA was founded in 1968 and is headquartered in Oslo, Norway.", "currency": "NOK", "sector": "Technology", "industry": "Information Technology Services", "exchange": "OSL", "market": "no_market", "country": "Norway", "city": "Oslo"}, "BOUV.OL": {"short_name": "BOUVET ASA", "long_name": "Bouvet ASA", "summary": "Bouvet ASA provides information technology, digital communication, and enterprise management services in Norway, Sweden, and internationally. The company designs, develops, and provides advisory services on IT solutions and digital communication. Bouvet ASA was founded in 2002 and is based in Oslo, Norway.", "currency": "NOK", "sector": "Technology", "industry": "Information Technology Services", "exchange": "OSL", "market": "no_market", "country": "Norway", "city": "Oslo"}, "CRAYN.OL": {"short_name": "CRAYON GROUP HLD", "long_name": "Crayon Group Holding ASA", "summary": "Crayon Group Holding ASA, together with its subsidiaries, operates as an IT advisory company in software and digital transformation services. It operates through Software & Cloud Direct, Software & Cloud Channel, Software & Cloud Economics, and Consulting segments. The company offers license management and consultancy services; SAM as a Service, a single hosted managed service that enables its clients to control software and technology assets across their IT environment; and SAM-iQ, which provides a centralized program interface that allows its customers to analyze, review, and manage their SAM environment. It also provides software and cloud economic services, including license management and solutions across large and mid-market enterprises, public sector, and cloud and service provider markets, as well as deployment planning services. In addition, the company offers consulting services in the areas of cloud architecture and deployment solutions, licensing environment optimization and management, security, datacenter systems, infrastructure and networking, backup and data recovery, servers environments, and storage and virtualization solutions; and managed services, such as outsourced license lifecycle management, project management, audit simulation and support, and infrastructure management and support services. Further, it provides training, events, and development programs for IT professionals. The company has operations in the Nordics, Europe, the Asia-Pacific, the Middle East and Africa, and the United States. The company has a strategic collaboration agreement with Amazon Web Services. Crayon Group Holding ASA is headquartered in Oslo, Norway.", "currency": "NOK", "sector": "Technology", "industry": "Information Technology Services", "exchange": "OSL", "market": "no_market", "country": "Norway", "city": "Oslo"}, "ITERA.OL": {"short_name": "ITERA ASA", "long_name": "Itera ASA", "summary": "Itera ASA, together with its subsidiaries, designs, develops, and operates digital solutions for companies and organizations in Norway, Sweden, Denmark, Slovakia, and Ukraine. It delivers projects and services in the consulting and strategy, design and development, and operations and management areas. The company also provides strategic advisory, design and development, and managed cloud services, as well as hosting and operations, and infrastructure services. It primarily serves clients in insurance, banking and finance, high tech, energy, media, and public sectors. Itera ASA was founded in 1989 and is headquartered in Oslo, Norway.", "currency": "NOK", "sector": "Technology", "industry": "Information Technology Services", "exchange": "OSL", "market": "no_market", "country": "Norway", "city": "Oslo"}, "MKL.F": {"short_name": "ATEA ASA  NK 1", "long_name": "Atea ASA", "summary": "Atea ASA supplies IT infrastructure and related solutions for businesses and public sector organizations in the Nordic countries and Baltic regions. The company provides hardware and software solutions for storing and managing information, as well as tools for virtualization, automation, and security for operating the data center environment; client hardware, software, and services to the requirements of users, applications, security, networks, and computing environments. It also offers hardware and software solutions for running networks, and services to help customers manage their communications; and a range of products to enable collaboration through conferencing, information sharing, and digital productivity solutions. In addition, it provides Device as a Service to various concepts, such as videoconferencing, digital signage, and networks. Atea ASA was founded in 1968 and is headquartered in Oslo, Norway.", "currency": "EUR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "FRA", "market": "dr_market", "country": "Norway", "city": "Oslo"}, "SIKRI.OL": {"short_name": "SIKRI HOLDING AS", "long_name": "Sikri Holding AS", "summary": "Sikri Holding AS provides case processing, and document management and archiving solutions to the public sector in Norway. Its products include Elements Sak-Arkiv, a case archive system for the management of public services; Elements eByggesak, a case management tool specially adapted for construction case processing; and Elements RiskManager, an electronic quality system that supports the business with quality and management processes, non-conformance management, notifications, and risk assessments for both the public and private sectors. The company's products also comprise Elements Cloud that supports external login, as well as integrates login solutions in the market, such as ADFS and SAML-based identity solutions; and Elements Lekdommer, a web-based solution for municipalities in connection with the election, updating, and exemption treatment of co-judges in the district court and co-judges and storage members in the storage court. In addition, it offers courses and training, consulting, and support, as well as provides personal counseling of key resources. The company was founded in 2000 and is based in Lysaker, Norway.", "currency": "NOK", "sector": "Technology", "industry": "Information Technology Services", "exchange": "OSL", "market": "no_market", "country": "Norway", "city": "Lysaker"}, "WSTEP.OL": {"short_name": "WEBSTEP ASA", "long_name": "Webstep ASA", "summary": "Webstep ASA, together with its subsidiaries, provides information technology (IT) consultancy services to public and private businesses in Norway and Sweden. The company offers digitalization, cloud migration and integration, Internet of Things, machine learning, robotics, and analytics. It also provides cloud computing and infrastructure, security and mobility, sensor technology, product and service development, enterprise user experience, Web analysis, designing, Amazon Web, Azure, big data, prediction, AI, predictive modelling, hackathon, business analysis, and search engine optimization services, as well as tech advisory and management solutions. It serves customers in agriculture and food, banking and financial, oil and offshore, power and energy, telecom, and software industries. The company was founded in 2000 and is headquartered in Oslo, Norway.", "currency": "NOK", "sector": "Technology", "industry": "Information Technology Services", "exchange": "OSL", "market": "no_market", "country": "Norway", "city": "Oslo"}}