{
    "BIMAS.IS": {
        "short_name": "BIM MAGAZALAR",
        "long_name": "BIM Birlesik Magazalar A.S.",
        "summary": "BIM Birlesik Magazalar A.S., together with its subsidiaries, operates retail stores in Turkey, Morocco, and Egypt. Its stores sell approximately 750 items, including meat, breakfast and dairy, legumes and bakery, and personal care products, as well as beverages, snacks and sweets, fruits and vegetables, frozen foods, and cleaning supplies. As of March 05, 2020, the company operated 8,348 stores. BIM Birlesik Magazalar A.S. was founded in 1995 and is headquartered in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34887",
        "website": "http://www.bim.com.tr",
        "full_time_employees": 60663
    },
    "CRFSA.IS": {
        "short_name": "CARREFOURSA",
        "long_name": "CarrefourSA Carrefour Sabanci Ticaret Merkezi A.S.",
        "summary": "CarrefourSA Carrefour Sabanci Ticaret Merkezi A.S. engages in the retail business in Turkey. It also engages in the construction of non-residential buildings. As of December 31, 2019, it operated 30 hypermarkets and 604 supermarkets. The company was incorporated in 1991 and is headquartered in Istanbul, Turkey. CarrefourSA Carrefour Sabanci Ticaret Merkezi A.S. is a subsidiary of Haci Ã\u0096mer Sabanci Holding A.S.",
        "currency": "TRY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34846",
        "website": "http://www.carrefoursa.com",
        "full_time_employees": 11269
    },
    "MGROS.IS": {
        "short_name": "MIGROS TICARET",
        "long_name": "Migros Ticaret A.S.",
        "summary": "Migros Ticaret A.S., together with its subsidiaries, engages in the retail sale of food and beverages, and consumer and durable goods. Its stores offer various products, including cosmetics, stationery, glass and kitchenware, electronic appliances, books, textiles, and other items, as well as groceries and other necessities. As of April 22, 2020, it had a total of 2233 stores with 2131 Migros and 59 Macrocenter in 81 provinces in Turkey and 43 Ramstore stores internationally covering an area 2.514.425 square meters. The company also operates Migros Sanal Market, an online food retailing site, as well as an online shopping website. In addition, it rents floor space in the shopping malls to other trading companies. Migros Ticaret A.S. was founded in 1954 and is headquartered in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34758",
        "website": "http://www.migroskurumsal.com",
        "full_time_employees": 38458
    }
}