{
    "APOLLO.NS": {
        "short_name": "APOLLO MICRO SYSTE",
        "long_name": "Apollo Micro Systems Limited",
        "summary": "Apollo Micro Systems Limited designs, develops, assembles, and tests electronic and electro-mechanical solutions in India. The company offers DSP products, missile hardware simulators, integrated avionics modules, generic PCM encoders and decoders, DSSS de-modulators, seeker electronics, RPF and signal processing systems, turret control and power units, missile interface units, launcher controllers, launcher interface units, tiger sharc DSP-signal processors, quad actuator controllers, fault tolerant and system relay boxes, and DSP controllers. It also provides ground defense products, including ESM-eagle kit, embedded arss, PSU, and auxiliary controllers; and integrated payload checkout systems, satellite data simulators, high speed frame synchronizers, time code readers/generators, bit synchronizers, monopulse tracking receivers, PCIE-HSDR systems, PCM-two channel decommutators, PCIe based two channel data acquisition cards, and PCI-X based two channel serial data acquisition cards. In addition, the company offers transportation products, such as GPA based integrated mine management systems, weight-in-motion systems, tire care products, passenger information systems, and station announcement systems; embedded solutions, including Ethernet, base band modules, converters, USB/Ethernet protocol converters, dual data bus couplers, and data bus solutions; and home land security products comprising solar street lighting, CCTV surveillance, vehicle tracking, boom barrier, RFID fleet management, UAV detecting and jamming, GSM interception, Wi-Fi interception, lawful interception, and portable x-ray inspection systems, as well as passenger information displays, wall radar, and reactive convoy and stationary, and portable and stationary bomb jammers. Further, it provides electronic manufacturing, hardware design, IT and software, and electronic design and mechanical engineering CAD services. Apollo Micro systems Limited was founded in 1985 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500076",
        "website": "http://www.apollo-micro.com",
        "market_cap": "Nano Cap"
    },
    "BDL.NS": {
        "short_name": "BHARAT DYNAMICS LT",
        "long_name": "Bharat Dynamics Limited",
        "summary": "Bharat Dynamics Limited engages in the manufacture and sale of guided missiles and allied defense products in India. Its product portfolio includes surface to air missiles, anti-tank guided missiles, underwater weapons, launchers, countermeasures, test equipment, mechanized infantry weapons, torpedoes, and submarine fired decoys. The company also exports its products. Bharat Dynamics Limited was founded in 1970 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500032",
        "website": "http://www.bdl-india.in",
        "market_cap": "Small Cap"
    },
    "BEL.NS": {
        "short_name": "BHARAT ELECTRONICS",
        "long_name": "Bharat Electronics Limited",
        "summary": "Bharat Electronics Limited, together with its subsidiaries, designs, manufactures, supplies, and exports electronic equipment and systems for the defense and civilian markets in India and internationally. Its defense products include defense communication products, land-based radars, naval systems, electronic warfare systems, avionics, electro optics, tank and armored fighting vehicle electronic systems, weapon systems, C4I systems, shelters and masts, simulators, and batteries; microwave tubes and power modules, microwave super components, digital multichannel data recorders, and hybrid micro circuits; and micro electro mechanical systems. The company's non defense products comprise e-governance systems, homeland security products, civil radars, integrated traffic management systems, solar power solutions, and telecom and broadcast systems; and PD and strategic products, silicon radiation detectors, passive vacuum devices, EMI filters, multichannel voice logging recorder systems, and digital multichannel data recorders. In addition, it offers electronic manufacturing services, such as PCB assembly and testing, precision machining and fabrication, optoelectronic components and assemblies, microwave integrated circuit assemblies, super components modules, cable assemblies and wiring harnesses, and antennae manufacturing services, as well as designs and manufactures transformers, coils, chokes, and sub-assemblies. Bharat Electronics Limited was founded in 1954 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560045",
        "website": "http://www.bel-india.in",
        "market_cap": "Mid Cap"
    },
    "COCHINSHIP.NS": {
        "short_name": "COCHIN SHIPYARD LT",
        "long_name": "Cochin Shipyard Limited",
        "summary": "Cochin Shipyard Limited engages in the shipbuilding and repair of ships/offshore structures in India. Its shipbuilding operations include offering tankers, product carriers, bulk carriers, passenger vessels, high bollard pull tugs, and air defence ships. It also undertakes upgradation of mobile offshore drilling units of Oil & Natural Gas Corporation; maintenance and repair of aircraft carriers of the Indian Navy; and repair and maintenance of tankers and bulk carriers of Shipping Corporation of India. In addition, the company provides marine engineering training services. Cochin Shipyard Limited was founded in 1969 and is based in Kochi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kochi",
        "zipcode": "682015",
        "website": "http://www.cochinshipyard.com",
        "market_cap": "Small Cap"
    },
    "GRSE.NS": {
        "short_name": "GARDEN REACH SHIPB",
        "long_name": "Garden Reach Shipbuilders & Engineers Limited",
        "summary": "Garden Reach Shipbuilders & Engineers Limited operates as a shipbuilding company in India. The company offers frigates, anti-submarine warfare corvettes, missile corvettes, landing ship tanks, landing craft utilities, survey vessels, fleet replenishment tankers, fast patrol vessels, offshore patrol vessels, inshore patrol vessels, WJ-FAC, hover crafts, and fast interceptor boats to the Indian Navy, Indian Coast Guard, MHA, and other governments. It also provides portable bridges, deck machinery items, marine pumps, anchor and mooring capstans, anchor windlass, boat davits, and rail less helo traversing systems. In addition, the company engages in the testing and overhauling of marine propulsion engines, as well as assembly of semi-knocked down units of diesel engines. Garden Reach Shipbuilders & Engineers Limited was incorporated in 1934 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700024",
        "website": "http://www.grse.in",
        "market_cap": "Small Cap"
    },
    "HAL.NS": {
        "short_name": "HINDUSTAN AERONAUT",
        "long_name": "Hindustan Aeronautics Limited",
        "summary": "Hindustan Aeronautics Limited engages in the design, development, manufacture, repair, overhaul, upgrade, and servicing of aircraft, helicopters, aero-engines, avionics, accessories, and aerospace structures in India and internationally. It offers power plants; and materials, including castings, general and precision forgings, powder metallurgy products, rubber products, rolled rings, and composites. The company also provides avionics, such as inertial navigation systems, auto stabilizers, head up displays, laser range systems, flight data recorders, communication equipment, radio navigation equipment, air borne secondary radars, missile inertial navigation systems, radar computers, and ground radars; and system and accessories comprising hydraulic, wheels and brake, flight control, oxygen, and fuel management systems, ejector release units, panel instruments, gyroscopic/barometric instruments, and hydraulic pumps. In addition, it offers various services in the areas of aircraft and helicopters MRO, and power plants, as well as systems, accessories, and avionics. It serves space, defense, and civil industries. Hindustan Aeronautics Limited has a strategic collaboration agreement with Dynamatic Technologies Limited for manufacturing, marketing, and sale of IAI unmanned aerial vehicles. The company was incorporated in 1940 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560 001",
        "website": "http://www.hal-india.co.in",
        "market_cap": "Mid Cap"
    },
    "MAZDOCK.NS": {
        "short_name": "Mazagon Dock Shipbuil Ltd",
        "long_name": "Mazagon Dock Shipbuilders Limited",
        "summary": "Mazagon Dock Shipbuilders Limited engages in building and repairing of ships, submarines, vessels and related engineering products in India and internationally. The company operates through two segments, Shipbuilding and Submarine. It offers naval ships, such as corvettes, nilgiris, missile boats, Godavari class frigates, patrol vessels, destroyers, and lender class frigates; merchant ships, including trailing suction hopper dredgers, general cargo vessels, multipurpose support vessels, offshore supply vessels, special trade passenger cum cargo vessels, 45 T bollard pull voith tugs, and BOP vessels; and submarines. The company was formerly known as Mazagon Dock Limited. Mazagon Dock Shipbuilders Limited was founded in 1774 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400010",
        "website": "http://www.mazdock.com",
        "market_cap": "Small Cap"
    },
    "RNAVAL.NS": {
        "short_name": "RELIANCE N AND E",
        "long_name": "Reliance Naval and Engineering Limited",
        "summary": "Reliance Naval and Engineering Limited operates as an integrated shipbuilding facility in India and internationally. The company designs and constructs offshore patrol vessels, landing platform docks, frigates, corvettes, destroyers, research vessels, submarines, and aircraft carriers; and offers design engineering consultancy services focused on oil and gas and EPC services. It is also is involved in design and process engineering for ships and offshore structures, including stability calculation, hull structural drawings, machineries selection, piping and electrical drawings, structural analysis of marine structures, and engineering and generation of production drawings for ships and offshore structures. In addition, the company integrates third party equipment, such as IBS, IPMS, etc., onto various platforms, as well as undertakes repair and maintenance of various ships and rigs. Further, it fabricates, assembles, and erects heavy engineering products. The company was formerly known as Reliance Defence and Engineering Limited and changed its name to Reliance Naval and Engineering Limited in September 2017. Reliance Naval and Engineering Limited was founded in 1997 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400055",
        "website": "http://www.rnaval.co.in",
        "market_cap": "Nano Cap"
    },
    "ZENTEC.NS": {
        "short_name": "ZEN TECHNOLOGIES",
        "long_name": "Zen Technologies Limited",
        "summary": "Zen Technologies Limited, together with its subsidiary, designs, develops, and manufactures training simulators in India and internationally. It offers firearms training, advanced weapon, hand grenade, driving training, artillery forward observer, driving and automated driving, tactical engagement, anti-tank guided missile, tank gunnery and crew gunnery, and tank driving simulators. The company also provides combat training simulation, smart target, tank target and zeroing, multi-functional target, air-to-ground firing range, driver aptitude testing, and armour combat training systems; bus driving, mortar integrated and carrier motor tracked, hand grenades, infantry weapon training, medium machine gun, automatic grenade launcher, integrated air defense combat, anti-aircraft air defense, UAV mission, and rotary wing simulators; and war gaming solutions. In addition, it offers master control station for live-firing ranges, indoor tracking systems, infantry combat vehicle driving simulators, and BMP II integrated missile simulators; and digital beamforming solutions. Further, the company operates containerized tubular and indoor shooting range; and shoot house for live and simulated indoor tactical training. It serves police, para-military, armed, and security forces; government departments comprising transport, mining, and infrastructure; and the civilian market. Zen Technologies Limited was incorporated in 1993 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500018",
        "website": "http://www.zentechnologies.com",
        "market_cap": "Micro Cap"
    }
}