{
    "ALCHEM.NS": {
        "short_name": "ALCHEMIST LTD",
        "long_name": "Alchemist Limited",
        "summary": "Alchemist Limited manufactures and trades in chemicals and pharmaceutical formulations in India. The company operates in Agri Business; and Pharma, Chemical, and Minerals segments. It offers pharmaceutical products, such as Anemi-XT for iron deficiency, Valcal-M for calcium deficiency, and IGTG FORTE for weak immunity, as well as in the therapy areas of immune enhancer, nutraceutical, antibacterial, gastrointestinal, pain reliever, anti-allergic, anti-cold, steroids, enzymes, supplements, CNS, etc. The company is also involved in the agriculture and allied activities comprising floriculture activities. In addition, it offers steel wires that are used to manufacture barbed and razor wires, wire mesh, and chain link fencing products for poultry; and other wire fencing for nonresidential and residential building applications. Alchemist Limited was incorporated in 1988 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "BALMLAWRIE.NS": {
        "short_name": "BALMER LAWRIE",
        "long_name": "Balmer Lawrie & Co. Ltd.",
        "summary": "Balmer Lawrie & Co. Ltd. engages in industrial packaging, greases and lubricants, leather chemicals, logistic services, refinery and oil field, and travel and vacation services businesses in India and internationally. The company offers industrial packaging products, including plain steel, lacquer lined, composite, galvanized, conical, internally painted, necked in, and tall drums for packaging lubricants, chemicals and agrochemicals, food and fruits, transformer oil, additives, bitumen and bitumen emulsion; industrial and automotive lubricants, such as gear, engine, turbine, transmission, transformer, spindle, rolling, quenching, mould, marine engine, hydraulic, compressor, and cylinder oil; and thread compounds, rust preventives, metal working fluids, greases, and other specialties. It also provides leather chemicals comprising fatliquors, and syntans and fillers; and refinery and oil field services, which include tank bottom oily sludge processing, lagoon oily sludge processing, and composite repair. In addition, the company offers end-to-end domestic and international travel services, such as ticketing, tourism, and MICE related services; and freight forwarding, project logistics, and third party logistics services. Further, the company offers logistics infrastructure services comprising transportation of containers to/from ports; full container load delivery; de-stuffing, storage, and delivery; handling and monitoring containers; consolidation and de-consolidation of less container load; handling and storing of break bulk cargo; covered warehousing facility for storage of EXIM cargo; general and bonded warehousing; and tracking of containers. The company was founded in 1867 and is based in Kolkata, India. Balmer Lawrie & Co. Ltd. is a subsidiary of Balmer Lawrie Investments Limited.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "BBTC.NS": {
        "short_name": "BOMBAY BURMAH",
        "long_name": "The Bombay Burmah Trading Corporation, Limited",
        "summary": "The Bombay Burmah Trading Corporation, Limited, together with its subsidiaries, engages in the tea and coffee plantations, auto electric components, healthcare, and real estate businesses in India and internationally. The company produces and trades in tea, coffee, timber, cardamom, and pepper; and manufactures and trades in healthcare/dental products. It also manufactures solenoids, switches, valves, slip rings, etc. for automobile and other industries; and invests in various listed and unlisted securities primarily on a long-term basis. In addition, the company manufactures and trades in analytical and precision balances, and weighing scales; and engages in the property development activities. Further, it deals with decorative plants and landscaping services; and offers bakery and dairy products. The Bombay Burmah Trading Corporation, Limited was founded in 1863 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "CARBORUNIV.NS": {
        "short_name": "CARBORUNDUM UNVRSL",
        "long_name": "Carborundum Universal Limited",
        "summary": "Carborundum Universal Limited, together with its subsidiaries, manufactures and sells abrasives, ceramics, and electro minerals in India and internationally. It operates through three segments: Surface Engineering, Technical Ceramics, and Electrominerals. It offers bonded and coated abrasives, processed cloth products, polymers, power tools, and coolants; and electro minerals, including silicon carbide, brown aluminum oxide, and white aluminum oxide, as well as mullite, bubble alumina, and others. The company also provides industrial ceramics, anti-corrosion products, and bio ceramics, which harness the heat resistance/containment, wear resistance, and insulation properties of ceramics, as well as corrosion resistance properties of various materials. In addition, it manufactures super refractories and refractory fiber; generates power from gas; and provides IT infrastructure facility management, software application development, remote infrastructure management, and IT security management services. The company was founded in 1954 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "CYIENT.NS": {
        "short_name": "CYIENT LIMITED",
        "long_name": "Cyient Limited",
        "summary": "Cyient Limited provides geospatial, engineering design, information technology (IT) solutions, and data analytic services in North America, Europe, and the Asia Pacific. The company operates in Services and Design Led Manufacturing segments. It offers engineering services, such as systems, mechanical, electrical, manufacturing, plant, network, and field engineering, as well as aftermarket, embedded software and electronics, engineering application software development, semiconductor design, and intellectual property and allied services. The company also provides electronic and mechanical manufacturing services; analytics, big data consulting, and Internet of Things and M2M services. In addition, it offers geospatial services, including data acquisition, remote sensing, photogrammetry, navigational data mapping, navigational database generation, and location-based services. Further, the company provides digitization of drawings and maps, computer aided design/engineering, design and modelling, repair development engineering, reverse engineering application software development, software products development, consulting, analytics, and implementation services. The company serves aerospace and defense, automotive, communications, energy, geospatial, industrial and heavy equipment, medical technology and healthcare, mining, oil and gas, power generation, rail transportation, semiconductor, and utilities industries. Cyient Limited has a strategic partnership with Space Research and Innovation Network for Technology to enhance the innovation in the UK space sector. The company was formerly known as Infotech Enterprises Limited and changed its name to Cyient Limited in May 2014. Cyient Limited was incorporated in 1991 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "EXCEL.NS": {
        "short_name": "EXCEL REALTY N INF",
        "long_name": "Excel Realty N Infra Limited",
        "summary": "Excel Realty N Infra Limited engages in the infra, information technology (IT), business process outsourcing (BPO), and general trading activities in India. It operates through three segments: Infrastructure, BPO/IT Enabled Services, and General Trading. The company provides general trading and business process outsourcing services; and develops infrastructure facilities. It also offers customer care services, and inbound and outbound services, as well as handles the business relations of clients on their behalf. The company was formerly known as Excel Infoways Limited and changed its name to Excel Realty N Infra Limited in May 2015. Excel Realty N Infra Limited was founded in 2003 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "GILLANDERS.NS": {
        "short_name": "GILLANDERS ARBUTHN",
        "long_name": "Gillanders Arbuthnot and Company Limited",
        "summary": "Gillanders Arbuthnot and Company Limited engages in the textile, engineering, tea, and property businesses in India and internationally. The company's Textile division manufactures and sells grey, melange and dyed yarns in cotton, polyester, acrylic, viscose, modal, and blends. Its Engineering division engages in the design, detail engineering, manufacture, and supply of equipment, electrical, instrumentation, erection, commissioning, and performance tests in the field of building and technological structures, tankages, piping, blast furnaces, re-heating furnaces, industrial furnaces, cold rolling mills, continuous casting machines, gas holders, coke oven battery projects, raw material handling, etc. The company's Tea division manufactures and sells tea. Its Property division is involved in letting out commercial properties on rent. Gillanders Arbuthnot and Company Limited was incorporated in 1935 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "GODREJIND.NS": {
        "short_name": "GODREJ INDUSTRIES",
        "long_name": "Godrej Industries Limited",
        "summary": "Godrej Industries Limited, together with its subsidiaries, manufactures and markets oleo-chemicals, precursors and derivatives, and bulk edible oils in India and internationally. It provides fatty alcohols, including lauryl, cetostearyl, cetyl, stearyl, and behenyl for home and personal care industries, as well as value added derivatives and specialty chemicals, such as emulsifying waxes, esters, secondary ingredients, specialty/actives, and blends; and fatty acids comprising stearic acids, oleic acids, fractionated fatty acids, and coconut fatty acids for textiles, rubber, polymers, foods and feeds, and personal care product applications. The company also offers surfactants consisting of alpha olefin sulphonates, sodium lauryl sulphates, and sodium lauryl ether sulphates for home and personal care, polymer, oil field, and construction chemical industries; and glycerine, a chemical used in food and personal care products. In addition, it engages in producing and selling of compound feeds for cattle, poultry, shrimp, and fish; processing and trading of refined vegetable oils and vanaspati; oil palm plantation activities; and development, sale, leasing, and licensing of real estate properties. Further, the company is involved in the finance and investment activities; processing milk and milk products; and integrated poultry, agri inputs and tissue culture, seeds, and gourmet foods and fine beverages businesses, as well as in the energy generation through windmills. The company was formerly known as Godrej Soaps Limited and changed its name to Godrej Industries Limited in April 2001. Godrej Industries Limited was founded in 1963 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "JPASSOCIAT.NS": {
        "short_name": "JAIPRAKASH ASSOCIA",
        "long_name": "Jaiprakash Associates Limited",
        "summary": "Jaiprakash Associates Limited operates as a diversified infrastructure conglomerate in India and internationally. The company operates through Construction, Cement & Cement Products, Hotel/Hospitality, Sports Events, Real Estate, Power, Infrastructure Projects, Investments, Fertilizers, Health Care, and Others segments. It constructs river valley, hydropower projects, expressways, and irrigation projects; manufactures and sells lime, plaster, and Portland Pozzolana cement under the Jaypee Cement brand; and generates and transmits hydro, thermal, and wind power. The company also operates hotels, golf courses, resorts, and spas; conducts sports related events; and builds golf-centric residences and townships. In addition, it manufactures and sells urea, micro nutrients, zinc sulphate mono hydrate, and organic manure under the Jaypee Chaand Chaap brand; and owns and operates the Jaypee hospital that consists of 504 beds with range of facilities, including OPD, radiology, lab, and executive health checkup. Further, the company is involved in the coal and mineral extraction activity; and provision of heavy engineering, aviation, waste treatment, and man power services, as well as hitech castings and edible oils. Additionally, it provides IT infrastructure management, networking and communication, and multimedia and content development services, as well as e-learning and software solutions. Jaiprakash Associates Limited was founded in 1979 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "JSWHL.NS": {
        "short_name": "JSW HOLDINGS LIMIT",
        "long_name": "JSW Holdings Limited",
        "summary": "JSW Holdings Limited, a non-banking financial company, engages in investing and financing activities. The company was formerly known as Jindal South West Holdings Limited and changed its name to JSW Holdings Limited in 2013. JSW Holdings Limited was incorporated in 2001 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "KOTHARIPRO.NS": {
        "short_name": "KOTHARI PRODUCTS",
        "long_name": "Kothari Products Limited",
        "summary": "Kothari Products Limited, together with its subsidiaries, engages in international trade and real estate activities in India. It operates through two segments, Trading and Real Estate. The company is involved in the import, export, and trade of various products/commodities, including agro based commodities, minerals, metals, petroleum products and coal, tiles, notebooks, computer storage devices, computer hardware products, electronic components, transformers, copier papers, steel products, scrap and PVC products, etc. It also develops land, commercial, retail, mall, hotel, and service apartment projects, as well as leases commercial buildings; operates a hotel, as well as senior secondary schools; and invests in stocks and mutual funds. Kothari Products Limited was incorporated in 1983 and is based in Kanpur, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kanpur"
    },
    "MMTC.NS": {
        "short_name": "MMTC",
        "long_name": "MMTC Limited",
        "summary": "MMTC Limited operates as a trading company in Asia, Europe, Africa, the Middle East, Latin America, and North America. It exports mineral products, such as iron ore fines and lumps, chrome ore, chrome concentrate, manganese ore, bentonite, bentonite power, bauxite, feldspar, quartz, sandstone, granite, mica flakes, and other products. The company also imports and exports gold, silver, platinum, palladium, rough diamonds, emeralds, rubies, and other semi-precious stones; operates jewelry and sterling silverware showrooms; and manufactures gold and silver medallions. In addition, it imports and exports non-ferrous metals, such as copper, aluminum, zinc and lead ingots, tin ingots, nickel, briquettes, ferro nickel, etc.; minor metals comprising antimony, silicon, cobalt metal, silicon, magnesium, and mercury; brown and white fused alumina, calcined alumina and bauxite, noble metals, and ferro alloys; and aluminum, zinc, and other alloys. Further, the company trades in agro products, including wheat, rice, onion, maize, soya bean meal, sugar, edible oil, and pulses; and imports and sells fertilizers and raw materials, such as urea, di-ammonium phosphate, mono-ammonium phosphate, powdered mono-ammonium phosphate, muriate of potash, complex fertilizers, sulphur and rock phosphate, and phosphoric acid. Additionally, it trades in non-coking and coking coal, naphtha, LAM coke, furnace oil, and bitumen; and engineering products, as well as operates a windmill project located at Gajendergarh in Karnataka. MMTC Limited was founded in 1963 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "MSTCLTD.NS": {
        "short_name": "MSTC LIMITED",
        "long_name": "MSTC Limited",
        "summary": "MSTC Limited engages in marketing, e-commerce, other, and scrap recovery and allied job businesses in India. It is involved in the sourcing, purchase, and sale of industrial raw materials, such as heavy melting scrap, low-ash metallurgical coke, HR coil, naphtha, crude oil, coking coal, steam coal, line pipes, etc. for users, as well as traders in the steel, oil and gas, and private and public power sectors. The company also provides e-auction services for sale of ferrous and non-ferrous scraps, surplus stores, minerals, old plant and machineries, e-waste, coal and non-coal mine blocks, iron ore, pulses, grins, oil seeds, land parcels, agricultural produce, tea, gorgon nut, tendu leaves, timbers and other forest produce, etc; and buildings, apartment, banks' NPAs and DRT, organic agri produce assets etc. In addition, it operates various other portals for petroleum products, organic farming, agricultural product trading, and other activities. Further, the company offers tender and auction, recycling, and e-procurement services. It serves central/PSUs/state government departments and private institutions. The company was formerly known as Metal Scrap Trade Corporation Limited and changed its name to MSTC Limited in September 1994. MSTC Limited was founded in 1964 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "NESCO.NS": {
        "short_name": "NESCO LTD",
        "long_name": "Nesco Limited",
        "summary": "Nesco Limited operates exhibition center and IT park in India. It operates through IT Park, Bombay Exhibition Center, Industrial Capital Goods Division, and Nesco Foods segments. The company is also involved in the operation of convention and exhibition center that provides space for trade fairs, exhibitions, conventions, and conferences. In addition, it manufactures and sells shot blasting, shot peering, and other surface preparation equipment and systems; spares and abrasives for shot blasting, peening, etc.; and offers facility development and management services. Further, it invests in mutual funds and securities; and operates kitchens, and food courts and kiosks, as well as provides mass catering services. The company was formerly known as New Standard Engineering Co. Ltd. Nesco Limited was founded in 1939 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "ROLLT.NS": {
        "short_name": "ROLLATAINERS LTD",
        "long_name": "Rollatainers Limited",
        "summary": "Rollatainers Limited, an integrated packaging company, researches, manufactures, and markets lined and mono cartons and packaging machines in India. It operates a cafÃ© chain under the Barista brand; and restaurants, which offers Japanese, Thai, Burmese, and Chinese cuisines under the Kylin brand name. The company operates 16 restaurants. It also exports its products. Rollatainers Limited was founded in 1968 and is headquartered in Rewari, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Rewari"
    },
    "SORILINFRA.NS": {
        "short_name": "SORIL INFRA RESOUR",
        "long_name": "SORIL Infra Resources Limited",
        "summary": "SORIL Infra Resources Limited provides equipment hiring services in India. The company operates through four segments: Equipment Renting Services, Management and Maintenance Services, Financing and Related Activities, and Led Lighting. It rents equipment, which include tower cranes, passenger hoists, piling rigs, excavators, dozers, motor graders, wheel loaders, mobile boom placers, transit mixers, dumpers, steel stir-up machines, and concrete batching plants under the brand name of Indiabulls Store One. The company also sells LED lighting products under the Ib LED brand. In addition, it provides home loans; and term loans for MSME, small business, and traders. Further, the company manages and maintains residential properties. The company serves real estate, precast, infrastructure, metro, cement, mining, petroleum refinery, piling, industrial, and road customers. The company was formerly known as Store One Retail India Limited and changed its name to SORIL Infra Resources Limited in December 2016. SORIL Infra Resources Limited was incorporated in 2005 and is based in Mumbai, India. SORIL Infra Resources Limited is a subsidiary of Indiabulls Integrated Services Limited.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "STCINDIA.NS": {
        "short_name": "STATE TRD CORP IND",
        "long_name": "The State Trading Corporation of India Ltd.",
        "summary": "The State Trading Corporation of India Ltd., together with its subsidiary STCL Limited, engages in the trading business worldwide. The company exports various products, including wheat, rice, tea, coffee, cashew, extractions, castor oil/seed, sugar, spices, jute goods, iron ore, chemicals, pharmaceuticals, light engineering goods, construction materials, consumer goods, processed foods, textiles, garments, jewelry, leather ware, etc. It also imports gold, silver, and other precious metals; hydro-carbons; mineral and metal ores, such as manganese ore and iron ore; petro-chemicals; and steam and hard coking coal, and lam and met coke. In addition, the company imports fertilizers; medical, police and security, intelligence/surveillance, firefighting, avionics, laboratory, tourism, sports, snow clearance, agricultural, and multimedia equipment; and ballistic and engineering items. Further, it acts as a nodal agency to monitor counter trade commitments; and provides a Web-based e-portal for online monitoring of the offsets program. The company was founded in 1956 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "ZUARIGLOB.NS": {
        "short_name": "ZUARI GLOBAL LTD",
        "long_name": "Zuari Global Limited",
        "summary": "Zuari Global Limited engages in agriculture, heavy engineering, infrastructure, lifestyle, and services businesses in India. The company operates through seven segments: Engineering, Furniture, Real estate, Sugar, Power, Investment Service and Management Services segments. It offers technology, basic engineering, detailed engineering, project management, technical consultancy, contract management, procurement, and construction services to chemical, fertilizer, oil and gas, petrochemical, power, engineering, contracting, and other infrastructure projects; manufactures, sells, and trades in furniture products; develops real estate projects; and offers capital market related services. The company also manufactures and sells sugar and its by products; and generates power. In addition, it offers management services; commodity trading services; distributes financial products; and acts as an insurance broker to individuals and corporates. The company was formerly known as Zuari Industries Limited and changed its name to Zuari Global Limited in June 2012. Zuari Global Limited was incorporated in 1967 and is based in Sancoale, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Sancoale"
    }
}