{"APARINDS.NS": {"short_name": "APAR INDUSTRY LTD", "long_name": "Apar Industries Limited", "summary": "Apar Industries Limited engages in the electrical and metallurgical engineering business in India. The company offers hydraulic, gear, compressor, turbine, cylinder, refrigeration, marine, automotive engine, gear, glass mould, mould release, and quenching oils; metal working, transmission, and thermic fluids; wire drawing compounds; and industrial and automotive greases, as well as other specialty industrial oils. It also provides liquid paraffins that are used in medical formulations, ointments, laxatives, repository vaccines, hair oils, hair creams, cosmetics, facial creams and lotions, gelatin capsules, food preservatives, protective coatings for fruits and vegetables, veterinary preparations, egg preservatives, and as secondary plasticizer in plastic and petrochemical industry applications; white oils, which are used in textile industry; and process and transformer oils, as well as petroleum jellies. In addition, the company offers aluminum wire rods, aluminum alloy wire rods, mechanical grade alloy wire bundles, aluminum conductor steel reinforced, aluminum conductor aluminum clad steel reinforced products, aluminum alloy conductor steel reinforced conductors, aluminum alloy conductor clad steel reinforced conductors, all aluminum alloy conductors, aluminum conductor alloy reinforced conductors, high conductivity alloy conductors, high temperature thermal resistant alloy conductors, and high temperature low sag conductors. Further, it provides automotive, industrial, marine, and aviation lubricants; overhead aerial bundled cables; flexible and rubber cables; screened instrumentation and control cables; solar and wind mill, fiber optic, and special cables; and ebeam irradiated products, as well as thermoplastic elastomers. The company also exports its products to various countries. Apar Industries Limited was founded in 1958 and is headquartered in Mumbai, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "BBL.NS": {"short_name": "BHARAT BIJLEE", "long_name": "Bharat Bijlee Limited", "summary": "Bharat Bijlee Limited operates as an electrical engineering company in India. It operates through two segments, Power Systems and Industrial Systems. The company offers transformers, such as sub-station, generator, unit auxiliary, and single phase traction transformers; three phase squirrel cage induction motors; gearless belt machines for passenger lifts and elevators; gearless machines for home elevators, heavy duty goods, and heavy goods lifts; and AC drives, servo drives, and motion controllers. It also undertakes design, engineering supply, installation, testing, and commissioning of turnkey electrical projects for customers in cement, power plant, steel, paper, textiles and fibers, public undertakings, and automobile sectors. The company also exports its transformers to Indonesia, the Philippines, the United Arab Emirates, Egypt, Jordan, Oman, Bangladesh, and Nepal. Bharat Bijlee Limited was founded in 1946 and is headquartered in Mumbai, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "CGPOWER.NS": {"short_name": "CG POWER AND INDUS", "long_name": "CG Power and Industrial Solutions Limited", "summary": "CG Power and Industrial Solutions Limited provides various solutions to utilities, industries, and consumers for the management and application of electrical energy in India and internationally. The company operates through Power Systems and Industrial Systems segments. The Power Systems segment offers power and distribution transformers, switchgears, circuit breakers instrument transformers, lightning arrestors, isolators, and vacuum interrupters. It also undertakes design, products, procurement, construction, erection, and servicing of turnkey transmission and distribution projects, as well as substation projects. The Industrial Systems segment provides motors, AC and DC drives, AC generators, variable frequency drives and solutions, soft starters and shaft power monitors, rotary heat exchangers with switch reluctance motors, traction electronics and traction machines for railway transportation, railway signalling equipment, and stampings. It serves utilities and industries in the generation, transmission, distribution, renewable, oil and gas, cement, metals and mining, and railway and transportation sectors. The company was formerly known as Crompton Greaves Limited and changed its name to CG Power and Industrial Solutions Limited in February 2017. CG Power and Industrial Solutions Limited was founded in 1937 and is based in Mumbai, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "CMICABLES.NS": {"short_name": "CMI", "long_name": "CMI Limited", "summary": "CMI Limited engages in the business of manufacture of wires and cables worldwide. The company offers various type of cables, such as quad, railway signalling, fire survival, fire retardant low smoke zero halogen, flexible multi-core copper shielded abrasion resistant thermoplastic polyurethanes sheathed, polythene insulated jelly filled telecom, fire alarm, communication, ethylene propylene rubber, composite, trailing, welding, submersible, chloro-sulfonated polyethylene, polychloroprene, silicon, instrumentation and control, solar, aerial bunch, low voltage, high voltage, extra high voltage, and low, high, and extra high voltage power cables. It also provides flexible and building wires; and bare conductors. CMI Limited serves various industries, including railways, oil and gas, space research, nuclear and solar power, defense, cement, mining, infrastructure, steel, telecommunications, mobility, energy, industrial, power, petrochemicals, etc. The company was formerly known as Choudhari Metal Industries Pvt Ltd. CMI Limited was founded in 1967 and is based in New Delhi, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "New Delhi"}, "CORDSCABLE.NS": {"short_name": "CORDS CABLE INDUST", "long_name": "Cords Cable Industries Limited", "summary": "Cords Cable Industries Limited designs, develops, manufactures, and sells power, control, instrumentation, thermocouple extension/compensating, and communication cables in India. It offers cables, such as fieldbus, fire survival, EPR, low temperature, fire retardant low smoke, low smoke zero halogen, oil and gas, water desalination and special custom designed hybrid, and PV solar cables. The company's control cables are used in interconnection of process control, communication, and panel control systems; electrical cables are applied in electric power, lighting, and internal wiring; and LV power cables are used in connecting power supply to residential, commercial, and industrial units. Its instrumentation, signal, and data cables are applied in data acquisition systems, computer networking, PA systems, digital control/measuring, and communication systems; and thermocouple cables are used to extend thermocouple circuits from the sensor to reference units. The company also exports its products. It serves in power generation, electricity transmission and distribution, oil refining and distribution, petrochemicals, iron and steel, chemicals and fertilizers, cement, and engineering industries. Cords Cable Industries Ltd. was founded in 1987 and is headquartered in New Delhi, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "New Delhi"}, "DENORA.NS": {"short_name": "DE NORA INDIA", "long_name": "De Nora India Limited", "summary": "De Nora India Limited manufactures, sells, and services electrolytic products in India and internationally. The company is involved in the manufacture and coating of anodes and cathodes for electrolytic process for various industrial applications, such as chlor-alkali, water, pulp and paper manufacturing, surface finishing, and plating industries, as well as cathodic protection systems of steel structures, electrochlorination systems, and platinized anodes for surface finishing applications. It also offers Seaclor, a seawater system; Seaclor Mac, a brine base system; LIDA MMO coated titanium anodes for ICCP; Solar Mac systems, which cleans water from clean energy. The company markets its products to agriculture and livestock, bleaching and chemicals, corrosion prevention, electronics, energy, marine, mining, pool, professional cleaning, renewable energy storage, surface finishing, municipal, and veterinary and animal care sector, as well as chlorine and caustic, and food industries. The company was formerly known as Titanor Components Limited and changed its name to De Nora India Limited in June 2007. The company was founded in 1989 and is based in Ponda, India. De Nora India Limited is a subsidiary of Oronzio De Nora International B.V.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Ponda"}, "FINCABLES.NS": {"short_name": "FINOLEX CABLES", "long_name": "Finolex Cables Limited", "summary": "Finolex Cables Limited manufactures and sells electrical and communication cables, and other electrical appliances in India. The company operates through Electrical Cables, Communication Cables, Copper Rods, and Others segments. It offers electrical cables, such as 1100V and motor winding PVC insulated, automotive/battery, UPS, elevator, and solar cables, as well as heavy duty, underground, low voltage, power, and control cables; and communication cables, including optic fiber, coaxial, local area network, CCTV, speaker, jelly filled telephone, PE insulated telephone, and V-SAT cables. The company also provides copper rods; electrical switches, sockets, regulators, etc.; and retrofit and non-retrofit CFL lamps, T5 tube lights, and fittings, as well as LED based lighting solutions. In addition, it offers ceiling, table, wall, pedestal, and exhaust fans; switchgear products, such as miniature and residual current circuit breakers, molded case circuit breakers, and distribution boards; and instant and storage water heaters. Further, the company offers its products online. It also exports its products to the United States and the United Arab Emirates. Finolex Cables Limited was founded in 1958 and is headquartered in Pune, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Pune"}, "GEEKAYWIRE.NS": {"short_name": "GEEKAY WIRES LIMITED", "long_name": "Geekay Wires Limited", "summary": "Geekay Wires Limited manufactures and sells galvanized steel wires and nail products in India and internationally. The company offers barbad, chain link fence, welded wire mesh, ACSR core, earth, stay, hot dipped galvanized, binding, bright and black annealed, mild steel and high carbon drawn, welding electrode, hair clip, steel wool, umbrella rib, nail, spring, patented, stitching, poultry, spring steel, electrode, and fan wires. It also provides cable armour wire rounds and flats, steel tapes, and fasteners, as well as wire for wire ropes. In addition, the company offers wire-collated, common, D-head, full head plastic strip, and coil nails. It serves various clients covering a range of applications comprising power transmission, cable and conductor, general engineering, construction, etc. Geekay Wires Limited was incorporated in 1989 and is based in Hyderabad, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Hyderabad"}, "GENUSPOWER.NS": {"short_name": "GENUS POWER INFRA", "long_name": "Genus Power Infrastructures Limited", "summary": "Genus Power Infrastructures Limited engages in the power business in India and internationally. It offers various electricity meters, such as multi-functional single phase and three phase meters, CT operated meters, ABT and grid meters, DT meters, pre-payment meters, smart meters, net meters, AMIs, MDAS, etc. The company also provides hybrid microcircuits that are used in telecommunication, automotive, consumer, industrial, IT products/computers, R-networks, power electronics, and other applications. In addition, it undertakes engineering, construction, and contracts, including switchyard/sub-stations, transmission lines, rural electrification, distribution lines and HVDS, and process industry plant electrification. The company serves utilities and municipalities, renewable sector, smart city planners, housing communities, malls, telecom towers, communication solution providers, energy auditors, and test labs, as well residential, commercial, and industrial consumers. The company was formerly known as Genus Overseas Electronics Limited and changed its name to Genus Power Infrastructures Limited in March 2007. Genus Power Infrastructures Limited was incorporated in 1992 and is based in Jaipur, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Jaipur"}, "GODHA.NS": {"short_name": "Godha Cabcon Insulat Ltd", "long_name": "Godha Cabcon & Insulation Limited", "summary": "Godha Cabcon & Insulation Limited manufactures and sells electronic cables and conductors in India. The company offers aluminum alloy conductors for use in the primary and secondary distribution; aluminum and steel reinforced conductors; aluminum conductors that are used primarily for overhead transmission, and primary and secondary distribution; and armoured and unarmoured power cables for the supply of electricity in underground systems, power networks, and power ducting. It supplies its products to the State Electricity Board of Jabalpur, Bhopal, and Indore. The company was incorporated in 2016 and is based in Indore, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Indore"}, "HAVELLS.NS": {"short_name": "HAVELLS INDIA", "long_name": "Havells India Limited", "summary": "Havells India Limited, a fast moving electrical goods company, manufactures, sells, and exports industrial and consumer electrical products in India and internationally. It operates through five segments: Switchgears, Cables, Lighting and Fixtures, Electrical Consumer Durables, and Lloyd Consumer. The company offers switches; switchgears, such as circuit breakers, energy savers, human safety equipment, distribution boards, surge protection devices, and control and monitoring devices, as well as electrical wiring accessories, industrial motors, and capacitors; appliances, including cooking, food preparation, brewing, garment care, climate control appliances, and air purifiers; and cables consisting of domestic cables and industrial underground cables, as well flexible cables. It also provides fans comprising ceiling, table, pedestal, wall, ceiling mounting, personal, and domestic exhaust fans; lighting solutions; storage, instant, instantaneous gas, solar water heaters, and online electric hot water taps; pumps, such as centrifugal, mono block, and submersible pumps; water purifiers; air conditioners; televisions; refrigerator; washing machines; air circulators; heavy duty exhaust fans; and air coolers. In addition, the company offers motors, including crane duty, smoke, brake, inverter duty, and energy efficient motors; reactive power solutions; and personal grooming products. Further, it provides lighting products, such as LED, and industrial and commercial luminaries; down lighters; landscape and area lighting products; lamps; home decor items; and spotlights, as well as LED strips, battens, COB, panels, etc. The company offers its products under the Havells, Lloyd, Crabtree, Standard, an REO brands. Havells India Limited was founded in 1958 and is headquartered in Noida, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Noida"}, "HBLPOWER.NS": {"short_name": "HBL POWER SYSTEMS", "long_name": "HBL Power Systems Limited", "summary": "HBL Power Systems Limited manufactures and sells batteries, power electronics, and spun concrete products in India and internationally. The company offers lead acid batteries, including pure lead tin VRLA, tubular gel VRLA, tubular plate vented, and flat plate VRLA batteries; nickel-cadmium batteries, such as pocket plate, sintered plate, and fiber plate batteries; and silver zinc aircraft, missile, torpedo, and reserve batteries. It also provides power electronics comprising thyristor battery chargers, battery monitoring systems, and earth leakage monitors; and engineering solutions, such as training simulators, as well as integrated power supply products, data loggers, audio frequency track circuits, electronic interlocking systems, train collision avoidance systems, and digital axle counters for railways. In addition, the company offers renewable energy products, including off-grid solar systems, such as solar pumps and rooftop systems, as well as concrete products comprising spun concrete poles and piles, and concrete telecom towers. It serves defense, telecom, railways, oil and gas, power utilities, UPS and inverter batteries, and solar power industries. The company was founded in 1977 and is headquartered in Hyderabad, India. HBL Power Systems Limited is a subsidiary of Aluru Family Private Trust.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Hyderabad"}, "HEG.NS": {"short_name": "HEG LIMITED", "long_name": "HEG Limited", "summary": "HEG Limited manufactures and sells graphite electrodes primarily for steel manufacturers in India. It operates through two segments, Graphite Electrodes and Power Generation. The company offers ultra-high power, high-power, and regular power grade graphite electrodes and nipples; carbon blocks; graphite specialties; and activated carbon fabric products for use in air-conditioner and air purifying filters, clean rooms, pollution control filters, anti-pollution masks, refrigerator deodorizers, and cigarette filters. It also operates two thermal power plants and a hydroelectric power facility with total power generation capacity of 76.5 MW. The company also exports its products to approximately 30 countries. HEG Limited was incorporated in 1972 and is based in Noida, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Noida"}, "HIRECT.NS": {"short_name": "HIND RECTIFIERS LT", "long_name": "Hind Rectifiers Limited", "summary": "Hind Rectifiers Limited develops, designs, manufactures, and markets semi-conductor devices, power electronic equipment, and railway transportation equipment in India and internationally. It offers power supplies for electrostatic precipitators; DC power systems for electrochemical plants; chargers and regenerative dischargers for the battery industry; water cooled rectifier systems; and cathodic protection transformer rectifier units. The company also provides various rectifiers for rolling stock application; transformers for locomotives and electrical multiple units; and converters and inverters, as well as semiconductor, such as power diodes, thyristors, power modules, and special products comprising high voltage disk stacks, auto diode stacks, and water cooled assemblies. In addition, it offers pre-installation, supervision of erection/commissioning, post commissioning and maintenance services, and service support to railways. Hind Rectifiers Limited was founded in 1958 and is based in Mumbai, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "HPL.NS": {"short_name": "HPL ELECTRIC POWER", "long_name": "HPL Electric & Power Limited", "summary": "HPL Electric & Power Limited manufactures and sells electric equipment under the HPL brand in India. The company operates through four segments: Metering, Switchgear, Lighting & Electronics, and Cables. It offers digital panel and energy, multi-function, din rail, 1Ph and 3P direct connection counter/LCD, trivector, dual source projection, long range integrated, import export Â\u0096 net, and IR and IRDA meters; load managers and demand controllers; power factor control and regulators; meter cover boxes; LPR, prepaid, smart, and group metering solutions; and data acquisition and billing software. The company also provides switches, sockets, communication sockets, regulators and dimmers, support modules, specialty products, plates, and boxes; cordless chimes, extension cords, holders and celling roses, international adapters, plug and multi plugs, special products, spike guard and power strips, wire door bells, and video door phone accessories; and connectors and power socket combination products. In addition, it offers air circuit breakers, MCCB products, changeover switches, control and fuse gears, and isolators; and Osafe and RCCB products, MCB's and MCB changeover, distribution boards, ACCL 1 and 3 phase products, and oprotect products. Further, the company provides domestic and industrial wires; data networking and transmission, and specialty cables, as well as special, control, and instrumentation cables; downlights and panels; LED battens, lamp, panels, and spotlights; home dÃ©cor products; and architecture, retail, boilers and petrol pump, highbay, box type LED, weather proof, well glass, street, flood, and exotica lighting products, as well as solar products. It serves residential and commercial users, public and private enterprises, and power utilities through dealers and distributors. The company also exports its products in approximately 42 countries. HPL Electric & Power Limited was incorporated in 1992 and is based in Noida, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Noida"}, "INDLMETER.NS": {"short_name": "IMP POWERS LTD", "long_name": "IMP Powers Limited", "summary": "IMP Powers Limited manufactures and sells transformers and reactors in India and internationally. The company offers transformers ranging up to 315 MVA in 400 kV class. It provides distribution, power, EHV, auto, generator, unit auxiliary, station, furnace, convertor/thyristor rectifier, earthing, mobile, and traction distribution transformers; and technical and after sales support during the erection, testing, and commissioning of transformers at site. The company also undertakes EPC work of small hydro power business; and offers smart hydro kinetic turbines. IMP Powers Limited was founded in 1961 and is based in Mumbai, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "INDOTECH.NS": {"short_name": "INDO TECH TRANFORM", "long_name": "Indo Tech Transformers Limited", "summary": "Indo Tech Transformers Limited manufactures and sells transformers in India and internationally. It offers power, distribution, and special application transformers, as well as mobile sub-station transformers and sub-stations for use in the generation, transmission, and distribution of electric power. The company was founded in 1976 and is based in Kancheepuram, India. Indo Tech Transformers Limited operates as a subsidiary of Prolec GE, S. de R.L. de C.V.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Kancheepuram"}, "KEI.NS": {"short_name": "KEI INDUSTRIES", "long_name": "KEI Industries Limited", "summary": "KEI Industries Limited manufactures and supplies wires and cables in India and internationally. It operates through Cables; Engineering, Procurement and Construction; and Stainless Steel Wire segments. The company offers extra high voltage cables; high and low voltage cables; high tension and low tension cables; control and instrumentation cables; specialty cables; flexible and house wires; submersible cables; marine and offshore cables; solar and rubber cables; thermocouple extension/compensating cables; fire survival/resistant cables; PVC/poly wrapped winding wires; stainless steel wires comprising welding, hard and fine stainless steel, cold heading, and general purpose wires; and winding wires. In addition, the company offers engineering, procurement, and construction services; and project management services. It exports its products to approximately 45 countries. The company's products are used in power, oil refineries, railways, automobiles, cement, steel, fertilizers, textile, and real estate sectors. KEI Industries Limited was founded in 1968 and is headquartered in New Delhi, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "New Delhi"}, "PAEL.NS": {"short_name": "PREMIER AUTO ELECT", "long_name": "PAE Limited", "summary": "PAE Limited engages in the sale and service of lead storage batteries, power backup systems, and automotive parts in India. The company's batteries include automotive, inverter, tower tubular, flat plate, VRLA, and solar tubular batteries. It markets its batteries under the Zenide, Zenide Gold, Zenide Silver, Zenide Automotive, and Zenide Motorcycle brands. The company was formerly known as Premier Auto Electric and changed its name to PAE Limited in 2003. PAE Limited was founded in 1950 and is based in Mumbai, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "POLYCAB.NS": {"short_name": "POLYCAB INDIA LTD", "long_name": "Polycab India Limited", "summary": "Polycab India Limited manufactures and sells wires and cables, and fast moving electrical goods in India and internationally. The company offers power, control, instrumentation, solar, flexible, flexible/single multi core, and communication cables, as well as building wires; and other cables, including welding cables, submersible flat and round cables, overhead conductors, rubber cables, green wires, railway signaling cables, and specialty cables. It also provides ceiling fans for homes, offices, and restaurants; table wall pedestal for offices, factories, and bungalows; exhaust fans for kitchens, bathrooms, and factories; air circulators; and water heaters in bathrooms and kitchens. In addition, the company offers LED products, including lamps, batten, panels, and downlights; street lights; flood lights; LED luminaries; commercial luminaries; and bollards and landscape lighting products. Further, it provides miniature circuit breakers, isolators, residual current circuit breakers, residual current breaker with overcurrent products, distribution boards, and a range of sockets and modular switches; solar inverters, solar water pumping systems, and electron-beam irradiated solar cables manufactured by third-party manufacturers; and conduits and accessories. Additionally, the company engages in the design, engineering, supply, execution, and commissioning of power distribution and rural electrification projects. It offers wires and cables, and lighting and luminaire products under the Polycab, as well as sockets and switches under the LEVANA brands. The company serves government departments, retailers, distributors, dealers, and industrial/institutional customers. It operates a distribution network of 3,300 authorized dealers and distributors; and 100,000 retail outlets. Polycab India Limited was incorporated in 1996 and is based in Mumbai, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "PRECWIRE.NS": {"short_name": "PRECISION WIRES IN", "long_name": "Precision Wires India Ltd.", "summary": "Precision Wires India Ltd. manufactures and sells insulated enameled wires and other insulated electric conductors in India and internationally. It offers enameled round winding wires for use in electrical machines, such as motors, generators, transformers, household appliances, auto-electricals, electrical hand tools, refrigeration motors, fans, switchgears, coils and relays, ballasts, etc.; rectangular enameled copper wires; and continuously transposed conductors for use in power, furnace, and traction loco transformers, as well as in chokes and inductance coils. The company also provides paper, Nomex, and mica tape insulated rectangular copper conductors, as well as special conductors for various applications in oil filled power and distribution transformers, dry type transformers, high tension motors/generators, and traction equipment. It serves large and medium electrical and electronic equipment manufacturers. The company was founded in 1989 and is based in Mumbai, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "SALZERELEC.NS": {"short_name": "SALZER ELECTRONICS", "long_name": "Salzer Electronics Limited", "summary": "Salzer Electronics Limited manufactures and supplies CAM operated rotary switches, selector switches, wiring ducts, voltmeter switches, and allied products primarily in India. The company offers industrial components, including cable ducts, sensors, changeover switches and solar isolators, general purpose relays, load break and photo voltaic switches, limit and foot switches, terminal connectors, customized control panels, and industrial plugs and sockets; and motor control products, such as contactors and overload relays, motor protection circuit breakers, and miniature circuit breakers (MCBs). It also provides transformers, which include inductors, chokes and filters, single phase toroidal transformers, and three phase lamination transformers, as well as toroidal transformers, CT's, and Rogowski coils; wires and cables comprising industrial wires and cables, wire harnesses, and power cords; and automatic source changeovers with current limiters, distribution boards, modular switches and specialty products, movement sensors, remote switches, single phase motor starters, and house wires. In addition, the company offers bunched copper conductors, PVC insulated copper wires and cables, enameled copper wires, flexible bus bars, lan cables, and tinned copper wires; and energy savers and panels, and street light controllers. Salzer Electronics Limited also exports its products to approximately 40 countries. The company was founded in 1985 and is headquartered in Coimbatore, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Coimbatore"}, "SANCO.NS": {"short_name": "SANCO IND LIMITED", "long_name": "Sanco Industries Limited", "summary": "Sanco Industries Limited, together with its subsidiaries, manufactures and trades in PVC resins and compounds, PVC pipes and profiles, wire and cables, and LED lights and panels in India and internationally. It offers PVC conduit pipes, PVC casings and capings, calcium carbonate, PVC insulation tapes, and copper wire rods. The company is also involved in the trade of PVC raw materials and metal products. It markets its products under the SATYAM, MARSHALL, SUPERPLAST, and SANCO brand names for use in various electrical, cable, and construction industries. Sanco Industries Limited was founded in 1986 and is based in New Delhi, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Delhi"}, "TRIL.NS": {"short_name": "TRANSFORM & RECTIF", "long_name": "Transformers and Rectifiers (India) Limited", "summary": "Transformers and Rectifiers (India) Limited, together with its subsidiaries, manufactures, sells, and exports transformers in India and internationally. It provides power transformers, such as generator transformers, unit and station auxiliary transformers, interconnecting transformers, and trackside transformers for railways; and rectifier transformers, including six and twelve pulse transformers with IPT, as well as transformers for bridge connection and railway traction. The company also offers distribution transformers comprising stepdown and step-up transformers, energy efficient transformers, transformers for solar and wind applications, and transformers for mines applications, as well as hermitically sealed and conservator type of construction transformers. In addition, it provides furnace transformers consisting of arc furnace and submerged arc furnace transformers, ladle furnace transformers, induction furnace transformers, and DC arc furnace transformers; specialty transformers, including testing transformers and transformers having multiple secondaries; and shunt and series reactors. The company was formerly known as Triveni Electric Company Limited and changed its name to Transformers and Rectifiers (India) Limited in March 1995. Transformers and Rectifiers (India) Limited was founded in 1981 and is headquartered in Ahmedabad, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Ahmedabad"}, "UNIVCABLES.NS": {"short_name": "UNIVERSAL CABLES", "long_name": "Universal Cables Limited", "summary": "Universal Cables Limited manufactures and sells electrical and other cables, capacitors, wires and conductors, and other products under the UNISTAR brand name in India. It offers XLPE cables, such as extra high voltage, medium voltage, low voltage, and aeriel bunched cables for use in power transmission and distribution, railways, fertilizers, petro-chemical plants, submarine and under water power transmission, steel plants, power station wiring, chemical plants, under water wiring, mines for power distribution, and control and instrumentation circuits. The company also provides PVC power and control cables for use in power distribution, control system, utility network, railway signaling installations, switching stations, textile mills, chemical plants, machine shops, etc.; PVC insulated winding wires and flat motor leads; elastomeric cables for trailing, ship wiring, and defense applications; and mining cables for land line, LHD and SDL machines, drills, coal cutters, stacker-reclaimers, and earth moving equipment. In addition, it offers silicon rubber cables for high temperature locations; special power and control cables for oil rigs, traction motors, and brush gear connectors, as well as tap changers for EMU's, AC coaches, and wind energy generators; and fire survival type elastomeric cables for circuit integrity during fire hazards. Further, the company provides capacitors, including high and low voltage capacitors, harmonic filters, surge protection/special duty capacitors, and automatic power factor correction panels. Additionally, it offers engineering services for various needs, such as turnkey contracts, system study, energy audit, harmonic analysis, and testing and commissioning of HT/LT capacitor banks and their associated equipment. The company also exports its products. Universal Cables Limited was incorporated in 1945 and is based in New Delhi, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "New Delhi"}, "VETO.NS": {"short_name": "VETO SWITCHGEARS A", "long_name": "Veto Switchgears and Cables Limited", "summary": "Veto Switchgears and Cables Limited, together with its subsidiaries, manufactures and sells wires and cables, and electrical accessories in India and internationally. It operates through Wire and Cables, Lighting & Fittings, and Accessories & Others segments. It provides electrical accessories, including carino, vyoma, and power modular switches, as well as puf and zac switches; and MCBs/isolaters/distributtion boxes, and bells and extension cords. The company also offers wires and cables, such as multi strand cables, L.T. industrial cables, and copper flexible cables; and compact fluorescent lamps and T5 fittings. In addition, it provides ceiling, ventilation, table, wall, and pedestal fans; and pumps, immersion heaters, telephone and co-axial wires, LED bulbs and lights, and other electrical accessories. Further, the company also offers PVC wires, copper conductors, and aluminum and other conductors; electrical lamps, such as vacuum and gas filled lamps, general lighting lamps, luminaries and accessories, etc.; and other appliances. The company markets its products under the VETO and VIMAL POWER brand names through a network of dealers and distributors. Veto Switchgears and Cables Limited was founded in 1967 and is based in Jaipur, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Jaipur"}, "VGUARD.NS": {"short_name": "V-GUARD INDUSTRIES", "long_name": "V-Guard Industries Limited", "summary": "V-Guard Industries Limited, a consumer electrical company, manufactures, trades, and sells electric and electronic goods in India and internationally. It operates through Electronics, Electrical, and Consumer Durables segments. The company offers a range of products, including voltage stabilizers, UPS, inverters and inverter batteries, electric water heaters, solar water heaters, wiring cables, fans, mixer grinders, induction and gas cooktops, gas stoves, rice cookers, grill king, toasters, kettles, chimneys, domestic pumps, agricultural pumps, electric and industrial motors, domestic switch gears, distribution boards, modular switches, and industrial cables, as well as solar power systems, room heaters, and air coolers. It sells its products through distributors, dealers, retailers, and service centers. The company was founded in 1977 and is based in Kochi, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Kochi"}, "WSI.NS": {"short_name": "WS INDUSTRIES(IND)", "long_name": "W.S. Industries (India) Limited", "summary": "W.S. Industries (India) Limited manufactures and sells porcelain insulators for electrical high voltage transmission, substation, and distribution applications in India and internationally. The company operates in two segments, Electro-Porcelain Products and Turnkey Projects. Its product portfolio includes suspension insulators that include normal, anti-fog, aerodynamic, and super fog types for HV and UHVDC applications; and various profiles of longrod insulators for the light, medium, and heavy pollution categories. The company also offers solidcore insulators to the substation application of busbar support, isolator support, and pantograph and disconnector support; and hollow porcelain insulators for use with instrument transformers, circuit breakers, surge arresters, power transformers, condensor bushings, capacitive dividers, wall through bushings, and other applications, as well as RTV coated insulators. In addition, it provides re-distributed products, which comprise transmission line hardware; galvanized distribution materials, such as cross-arms, spindles, earth rods, etc.; dropout fuses; fiber-glass stay insulators; and grading rings for solidcore insulators. Further, the company offers turnkey projects services that include design, supply, installation, testing, and commissioning of sub-stations, transmission line, and network quality regulation projects. W.S. Industries (India) Limited was founded in 1961 and is based in Chennai, India.", "currency": "INR", "sector": "Industrials", "industry": "Electrical Equipment & Parts", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Chennai"}}