{
    "A2ZINFRA.NS": {
        "short_name": "A2Z INFRA ENGINEER",
        "long_name": "A2Z Infra Engineering Limited",
        "summary": "A2Z Infra Engineering Limited provides engineering, procurement, construction, and facility management services in India and internationally. It operates in Engineering Service, Facility Management Services, Power Generation Projects, and Others segments. The company offers integrated design, testing, installation, construction, and commissioning services, and telecom infrastructure projects. Its activities include rural and railway overhead electrification, reduction of AT&C losses, feeder renovation and segregation; underground cabling; and high voltage distribution system and low voltage distribution system distribution and transmission lines installation. The company also offers system integration of IT projects; and optical fiber cable NLD/access networking construction and maintenance, network integration, telecom infrastructure operation and maintenance, material planning and project management, radio frequency engineering, and engineering construction and infrastructure services. In addition, it is also involved in the collection, transportation, treatment, and disposal of solid waste generated in cities. Further, it provides facility management services for corporate offices, railways stations, railway coaches, airports, other commercial establishments, and public places, such as parks and beaches; operates sewage network and treatment plants, gas distribution networks, and metro projects; and provides eco-tech green toilets and environment-friendly battery-driven bicycles. The company was formerly known as A2Z Maintenance & Engineering Services Limited and changed its name to A2Z Infra Engineering Limited in October 2014. A2Z Infra Engineering Limited was founded in 2002 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gurugram"
    },
    "AHLUCONT.NS": {
        "short_name": "AHLUWALIA CONT LTD",
        "long_name": "Ahluwalia Contracts (India) Limited",
        "summary": "Ahluwalia Contracts (India) Limited, together with its subsidiaries, operates as a construction company in India. The company operates through Construction Contract, Lease Rental, and Others segments. Its project portfolio includes residential and commercial properties, institutional properties, corporate offices, power plants, hospitals, hotels, IT parks, metro stations and depots, automated car parking lots, and other properties caters to government and private clients. The company also leases a commercial complex in bus terminal and depot at Kota, Rajasthan; and trades in real estate properties. Ahluwalia Contracts (India) Limited was founded in 1965 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "AKASH.NS": {
        "short_name": "Akash Infra-Projects Ltd",
        "long_name": "Akash Infra-Projects Limited",
        "summary": "Akash Infra-Projects Limited engages in the civil construction business in India. It undertakes various government contracts for the construction, resurfacing, widening, and repair of roads and bridges. The company is also involved in the construction of buildings, culverts, dams, godowns, etc.; and mining business. In addition, it operates and manages hotel under the Pathikashram name; and provides finance and real estate services, as well as operates a retail petroleum outlet in Gujarat, India. The company was founded in 1997 and is based in Gandhinagar, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gandhinagar"
    },
    "ASHOKA.NS": {
        "short_name": "ASHOKA BUILDCON LT",
        "long_name": "Ashoka Buildcon Limited",
        "summary": "Ashoka Buildcon Limited operates as an infrastructure development company in India. The company operates through three segments: Construction & Contract Related Activity; Built, Operate and Transfer (BOT); and Sale of Goods. It engages in the construction of infrastructure facilities on engineering, procurement, and construction basis, as well as built, operate, and transfer basis. The company undertakes various projects, such as highways, bridges, power projects, buildings, city gas distribution projects, and railways. It also sells ready mix concrete and real estate properties. In addition, the company develops software; distributes gas; and provides consultancy services. Ashoka Buildcon Limited was founded in 1976 and is based in Nashik, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Nashik"
    },
    "AXISCADES.NS": {
        "short_name": "AXISCADES TECHNOLO",
        "long_name": "Axiscades Technologies Limited",
        "summary": "Axiscades Technologies Limited, together with its subsidiaries, provides product design, engineering, and research and development solutions in Europe, North America, and the Asia Pacific. It operates in two segments, Engineering Design Services and Strategic Technology Solutions. The company offers mechanical and electrical engineering solutions, such as product design and development, 3D CAD modeling, value engineering, simulation and analysis, etc.; electronics and embedded systems, including avionics, control systems, telematics, autonomous mobility, test solutions, system integration, simulators, etc.; and manufacturing solutions comprising production support, manufacturing execution systems, shop floor automation, industrial internet of things, etc. It also provides digital solutions, such as artificial intelligence, machine learning, product lifecycle management, augmented/ virtual reality, etc.; business consulting services, including product throughput and productivity, business process design, etc.; and aftermarket solutions comprising technical publications, platform migration, reverse engineering, etc. In addition, the company provides integration services for defense and offsets businesses. It serves aerospace, defense and homeland security, heavy engineering, automotive, industrial production, energy, semiconductor, and medical and healthcare sectors under the AXISCADES brand. The company was formerly known as AXISCADES Engineering Technologies Limited and changed its name to Axiscades Technologies Limited in November 2020. Axiscades Technologies Limited was incorporated in 1990 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "BFUTILITIE.NS": {
        "short_name": "BF UTILITIES LTD",
        "long_name": "BF Utilities Limited",
        "summary": "BF Utilities Limited, together with its subsidiaries, primarily engages in the infrastructure business in India. It operates through Wind Mills and Infrastructure segments. The company develops the Bangalore Mysore Infrastructure Corridor Project, a 164 kilometers tolled expressway connecting Bengaluru and Mysuru; and operates a 30 kilometers bypass road connecting the twin cities of Hubli and Dharwad in North Karnataka. It also generates electricity through wind mills with an installed capacity of 18.33 megawatts. BF Utilities Limited was incorporated in 2000 and is based in Pune, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Pune"
    },
    "BGRENERGY.NS": {
        "short_name": "BGR ENERGY SYSTEMS",
        "long_name": "BGR Energy Systems Limited",
        "summary": "BGR Energy Systems Limited manufactures and sells capital equipment for power plants, petrochemical and process industries, and refineries in India and internationally. Its Power Projects division engages in the provision of turnkey engineering, procurement, and construction services for power plants and plant balance; and supply of sub and super critical steam turbines and generators, and single and multiple pressure level natural circulation heat recovery steam generators. The company's Electrical Projects division offers solutions for EHV substations; optical fiber composite ground wire, all-dielectric self-supporting, and optical line termination equipment; gas insulated switchgear substations; EHV transmission lines; plant electrical projects; and rural electrification. This division also provides power and auxiliary transformers, power evacuation systems, HT/LT/control cables, HT/LT switchgears, DC systems, and battery and battery chargers, as well as IPBD, MCC, UPS, cabling, earthing, and illumination equipment. Its Oil and Gas Equipment division offers process equipment packages and systems, pipeline equipment, compressor packaging products, and storage tanks. The company's Environmental Engineering division provides deaerators, membrane based water treatment plants, demineralization plants, effluent treatment and recycling plants, and condensate polishing units. Its Air Fin Coolers division offers process, radiator, compressor, and other coolers; and tube bundles and finned tubes. The company also provides heat exchangers; pressure vessels, reactors, and columns; waste heat recovery modules and convection coils; surface condensers and HP/LP heaters; and process equipment and boiler components. BGR Energy Systems Limited was founded in 1985 and is headquartered in Chennai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "BLKASHYAP.NS": {
        "short_name": "B.L. KASHYAP & SON",
        "long_name": "B.L. Kashyap and Sons Limited",
        "summary": "B.L. Kashyap and Sons Limited, together with its subsidiaries, engages in the construction and infrastructure development activities in India. The company constructs IT campuses, commercial spaces, malls, hotels, residential complexes, institutions, factories and manufacturing facilities, and healthcare and transportation facilities. It also undertakes turnkey projects, such as power generation plants, power transmission and distribution systems, integrated rail and metro systems, residential buildings, townships, commercial buildings, airports, industrial units, chemical process plants, and water and waste water management solutions. B.L. Kashyap and Sons Limited was founded in 1978 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "CANDC.NS": {
        "short_name": "C & C CONSTRUCTION",
        "long_name": "C & C Constructions Limited",
        "summary": "C & C Constructions Limited engages in the construction activities in India and internationally. It constructs and maintains motorways, streets, roads, other vehicular and pedestrian ways, highways, bridges, tunnels, and subways, as well as undertakes commercial buildings, power/telecom transmission tower, water supply and sanitation, rail infrastructure, urban infrastructure, and concession projects. The company was incorporated in 1996 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gurugram"
    },
    "CAPACITE.NS": {
        "short_name": "CAPACIT'E INFRAPRO",
        "long_name": "Capacit'e Infraprojects Limited",
        "summary": "Capacit'e Infraprojects Limited engages in engineering, procurement, and construction business in India. It offers total contracting, general contracting, and design and build services for super high-rise buildings, commercial and office complexes, institutional buildings, research and development centers, multi and super specialty hospital, malls, hotels, data centers, industrial buildings, mass housing, and multilevel car parks. The company was founded in 2012 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "CCCL.NS": {
        "short_name": "CONS CONSTRUCT CON",
        "long_name": "Consolidated Construction Consortium Limited",
        "summary": "Consolidated Construction Consortium Limited, together with its subsidiaries, provides construction, design, engineering, procurement, and project management services in India and internationally. It undertakes biotech parks, factory/industries, infrastructures, special structures, commercial, green buildings, institutions, residential, airports, convention centres, hospitals, IT parks, resorts and hotels, and metro rails projects. The company also offers planning and scheduling services to various industries; consultancy and execution services for various contract works; electrical, mechanical, plumbing, heating, ventilation, and air-conditioning works for infrastructure projects in the power transmission and airport sectors; and design, estimation, and procurement services. In addition, it provides onsite fabrication and installation of interiors; glazing solutions; and integrated software based engineering design services to various engineering companies and architects. Further, the company manufactures and assembles wood and wood based products, including doors, windows, flooring, ceilings, and paneling and custom built furniture for commercial and residential use; and manufactures ready-mixed concrete and concrete blocks. Consolidated Construction Consortium Limited was founded in 1997 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "DBL.NS": {
        "short_name": "DILIP BUILDCON LTD",
        "long_name": "Dilip Buildcon Limited",
        "summary": "Dilip Buildcon Limited, together its subsidiaries, engages in the development of infrastructure facilities on engineering, procurement, and construction (EPC) basis in India. It operates in two segments, EPC Projects and Toll Operations. The company undertakes state and national highway, city road, culvert, and bridge operation and maintenance projects; and irrigation, urban development, dam, canal, tunnel, metro rail viaducts, water supply, coal mining, water sanitation and sewage, airport, industrial, commercial and residential building, and other projects. It is also involved in the maintenance of road infrastructure facilities; and toll operations. In addition, the company engages in the repair and installation of machinery and equipment, motor vehicles, and other related activities, as well as job work activities. Dilip Buildcon Limited was founded in 1987 and is headquartered in Bhopal, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bhopal"
    },
    "DREDGECORP.NS": {
        "short_name": "DREDGING CORP IND",
        "long_name": "Dredging Corporation of India Limited",
        "summary": "Dredging Corporation of India Limited provides dredging services to various ports, Indian navy, fishing harbors, and other maritime organizations in India and internationally. The company offers capital dredging, maintenance dredging, beach nourishment, land reclamation, shallow water dredging, project management consultancy, and marine construction services. The company operates through a fleet of 10 trailer suction hopper dredgers, 2 cutter suction dredgers, 1 back hoe dredger, and 1 inland cutter suction dredger, as well as other ancillary crafts. Dredging Corporation of India Limited was founded in 1976 and is headquartered in Visakhapatnam, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Visakhapatnam"
    },
    "ENGINERSIN.NS": {
        "short_name": "ENGINEERS INDIA",
        "long_name": "Engineers India Limited",
        "summary": "Engineers India Limited, an engineering consultancy company, provides design, engineering, procurement, construction, and integrated project management services primarily for oil and gas, and petrochemical industries in India and internationally. The company operates in two segments, Consultancy & Engineering Projects, and Turnkey Projects. It also provides supply chain management services, such as contracts and purchase, inspection, expediting, transportation, and supplier/contractor enlistment; and develops various process technologies for petroleum refining, oil and gas processing, and aromatics industries. In addition, the company offers construction services comprising pre-construction activities, including bid management process, plot plan review/heavy lift study, etc.; and construction services comprising site construction management, liaison with statutory authorities, construction quality and warehouse management, HSE management, contracts administration, pre commissioning and commissioning assistance, and contract and site closing services. Further, it provides heat and mass transfer equipment design, environment engineering, specialist materials and maintenance, and plant operations and safety services; and pre-feed and feed engineering services for a range of processes in the hydrocarbon processing industry. Additionally, the company offers project management, third party inspection, quality assurance, independent engineer and lender's engineer services, and project appraisal and project execution services. Engineers India Limited was founded in 1965 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "GAYAPROJ.NS": {
        "short_name": "GAYATRI PROJECTS",
        "long_name": "Gayatri Projects Limited",
        "summary": "Gayatri Projects Limited operates as an infrastructure company in India. The company undertakes roads, irrigation, rail, airports development, power, mining, and industrial projects. Gayatri Projects Limited was founded in 1963 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "GENCON.NS": {
        "short_name": "Generic Eng Cons Proj Ltd",
        "long_name": "Generic Engineering Construction and Projects Limited",
        "summary": "Generic Engineering Construction and Projects Limited engages in the construction of residential buildings, commercial complexes, and other related activities in India. It offers general contracting services for civil and structural works; and internal infrastructure, such as roads, landscaping, etc., as well as provides specialized services for elevators, BMS, etc. The company also provides designing and engineering services for architecture, structural, electrical, mechanical, HVAC, plumbing and sewerage, fire protection, building management, and infrastructure works; and procurement, project management, and construction services. In addition, it offers engineering, procurement, and construction solutions, as well as project management consultancy services. The company was founded in 1967 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "GEPIL.NS": {
        "short_name": "GE POWER INDIA LTD",
        "long_name": "GE Power India Limited",
        "summary": "GE Power India Limited engages in the engineering, procurement, manufacturing, construction, and servicing of power plants and power equipment in India and internationally. The company offers boilers, mills, air quality control systems, hydro and gas power systems, and automation and control systems. It also manufactures steam generators. In addition, the company engages in the construction of industrial and non- industrial plants, structures, and facilities, as well as equipment and other projects. Further, it provides architectural and engineering services; and installation, maintenance, and repair services. The company was formerly known as ALSTOM India Limited and changed its name to GE Power India Limited in August 2016. The company was incorporated in 1992 and is headquartered in Noida, India. GE Power India Limited is a subsidiary of GE Power India Tracking BV.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "GISOLUTION.NS": {
        "short_name": "GI ENGINEERING SOL",
        "long_name": "GI Engineering Solutions Limited",
        "summary": "GI Engineering Solutions Limited provides engineering-based services in Asia. The company offers civil engineering, land planning, land surveying, and landscape architecture services. It provides offshore engineering services, such as residential design for planned unit developments, single family subdivisions, traditional condominiums, apartment complexes, single family site condominiums, and manufactured housing communities; and commercial/industrial design services for industrial subdivisions and site condominiums, commercial and industrial site plans, and marinas. The company also offers soils/site evaluations, septic system monitoring, cluster systems, sanitary sewer systems, septic system designs, package treatment plants, water distribution systems, arsenic removal, and water treatment services. In addition, it provides master planning services for parks, playgrounds, golf courses, pedestrian and vehicular campuses, waterfronts, marinas, and water features, as well as construction supervision services, site evaluation studies, and tree surveys. The company was incorporated in 2006 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "GPTINFRA.NS": {
        "short_name": "GPT INFRAPROJECTS",
        "long_name": "GPT Infraprojects Limited",
        "summary": "GPT Infraprojects Limited, together with its subsidiaries, engages in the execution of civil infrastructure projects in India and internationally. It operates in two segments, Infrastructure and Concrete Sleepers. The company constructs roads, bridges, airports, and irrigation and railway systems, as well as power, urban transit, industrial, and civil aviation infrastructure. It also manufactures and sells monoblock and PSC sleepers for various track applications, including monoblock sleepers for broad, cape, and dual gauges, as well as line sleepers, bridge deck sleepers, and level crossing and switch expansion joints. GPT Infraprojects Limited was incorporated in 1980 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "HCC.NS": {
        "short_name": "HINDUSTAN CONSTRUC",
        "long_name": "Hindustan Construction Company Limited",
        "summary": "Hindustan Construction Company Limited, together with its subsidiaries, primarily provides engineering and construction services in India. It constructs roads, highways, expressways, bridges, elevated corridors, railways, metro rails, ports, and marine structures; dams, barrages, tunnels, powerhouses, shafts, and various underground works; and reactors, auxiliary buildings, spent fuel buildings, safety pump houses, and control buildings. The company also constructs integrated water supply systems, bulk water transmission projects, dams, barrages, irrigation, water treatment and sewage treatment plants, and aqueducts; and hydrocarbon, metals and process plants and factories, residential and commercial buildings, institutional buildings, and station buildings. In addition, it provides insurance auxiliary services, as well as information technology consulting, toll management, aircraft, hotel, power development, entertainment, educational, hostel, tourism, city management, and parking services; and operates watersport operations, and clubs. The company also engages in the manufacture and sale of bamboo articles; adventure sports, information and communication technology, housing, and retail and leasing businesses; and city management activities. Hindustan Construction Company Limited was founded in 1926 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "HGINFRA.NS": {
        "short_name": "H.G. INFRA ENGINEE",
        "long_name": "H.G. Infra Engineering Limited",
        "summary": "H.G. Infra Engineering Limited engages in the engineering, procurement, and construction business in India. It constructs and maintains roads, bridges, flyovers, and other infrastructure contract works. The company offers civil construction projects comprising extension and grading of runways, railways, and land development. It also undertakes water pipeline projects. The company was founded in 2003 and is headquartered in Jaipur, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Jaipur"
    },
    "INDIANHUME.NS": {
        "short_name": "INDIAN HUME PIPE",
        "long_name": "The Indian Hume Pipe Company Limited",
        "summary": "The Indian Hume Pipe Company Limited engages in the construction contract activities in India. It engages in manufacturing, laying, and jointing pipelines. The company undertakes water supply projects for the supply of drinking and irrigation water; and sewer and drainage pipelines for cities and towns, as well as designs, fabricates, and installs penstock pipes for hydroelectric projects, and cooling water pipelines for thermal power plants. It also offers prestressed concrete pipes, prestressed concrete cylinder pipes, bar wrapped steel cylinder pipes, steel pipes, reinforced cement concrete pipes, and penstock pipes; and prestressed concrete monoblock sleepers for Indian Railways. In addition, the company undertakes various other projects, such as tunnel lining; head works, including pumping machinery; treatment plants; overhead tanks; and other civil construction projects. Further, it is involved in the development of land. The company was founded in 1926 and is headquartered in Mumbai, India. The Indian Hume Pipe Company Limited is a subsidiary of IHP Finvest Ltd.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "IRCON.NS": {
        "short_name": "IRCON INTERNATIONA",
        "long_name": "Ircon International Limited",
        "summary": "Ircon International Limited, together with its subsidiaries, provides construction services in India and internationally. The company's services include construction of new railway lines; rehabilitation/conversion of existing lines, station buildings and facilities, and bridges; regirdering of railway bridges, tunnels, and signaling and telecommunication networks; and railway electrification works. It is also involved in the wet leasing of locomotives; and setting up of production units for manufacture rolling stock, maintenance depots/workshops, concrete sleepers, and track components on turn-key basis. In addition, the company engages in the construction of roads and highways; bridges and flyovers; and commercial, institutional, industrial, and residential complexes, as well as airport hangers, station buildings and facilities, hospitals, business centers, workshops/warehouses, etc. Further, it provides electrification services; turnkey solutions for signaling and communication projects; and supplies plant and machinery for workshops, high speed lightweight passenger cars, and diesel electric locomotives, as well as leases and maintains diesel locomotives. The company was formerly known as Indian Railway Construction Company Limited. Ircon International Limited was founded in 1976 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "ITDCEM.NS": {
        "short_name": "ITD CEMENTATION IN",
        "long_name": "ITD Cementation India Limited",
        "summary": "ITD Cementation India Limited provides construction and civil engineering services in India. The company constructs maritime structures, including jetties, dolphins, service platforms, quay, berths on concrete and steel piles, solid gravity type wharf structures, ship lifts, dry docks, wet basins, and inclined berths; and offers break water and piled approach trestles, vertical and raker steel piles, undersea ground improvement, dredging and land reclamation, and coastal erosion protection and rock bund services. It also constructs highways, bridges, and flyovers; tunnels and airports; hydroelectric and irrigation projects comprising pumping stations, power houses, tunnels, intake structures, headrace tunnels, pressure shafts, and penstock pipes; mass rapid transport systems; and dams, and building and industrial structures. In addition, the company offers foundation and specialist engineering services comprising geotechnical investigations, piling, diaphragm walling, sandwicks/band drains, vibrofloatation stone-columns/vibro compaction, drilling and grouting, rock/soil anchors, colcrete, gunite/shotcrete, grouted mattress, and repairs/rehabilitation/underpinning services; and box pushing, tube heading, and microtunelling services. Further, it engages in the civil works for refinery, petrochemical, power, steel, and fertilizer plants; and design, construction, supply, installation, and commissioning of pipelines that include mechanical and electrical equipment, as well as operation work for water and waste water treatment plants, and pumping stations. The company was formerly known as Skanska Cementation India Limited and changed its name to ITD Cementation India Limited in May 2005. The company was founded in 1931 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "JKIL.NS": {
        "short_name": "J KUMAR INFAPROJEC",
        "long_name": "J. Kumar Infraprojects Limited",
        "summary": "J. Kumar Infraprojects Limited engages in the construction activities in India. The company executes contracts of various infrastructure projects, including transportation engineering, irrigation projects, civil construction, piling work, etc. Its transportation engineering projects include roads, metro, bridges, flyovers, subways, over bridges, skywalks, railway terminus/stations, etc.; civil construction projects comprise office/commercial buildings, sports complexes, hospitals, medical colleges, swimming pools, etc., as well as residential buildings, such as housing societies, etc.; and irrigation projects, which include dams and canals. J. Kumar Infraprojects Limited was founded in 1980 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "JMCPROJECT.NS": {
        "short_name": "JMC PROJECTS IND",
        "long_name": "JMC Projects (India) Limited",
        "summary": "JMC Projects (India) Limited engages in the business of engineering, procurement, and construction relating to infrastructure sector in India, Ethiopia, and Sri Lanka. The company operates in two segments, Engineering, Procurement and Construction; and Developmental Projects. It undertakes projects, such as residential townships, institutional buildings, office spaces, IT parks, hospitals, medical colleges, hotels, malls or other multi-utility places, etc. The company also provides engineering, design, procurement, and construction services for automobile and ancillary, chemical, food processing, metals, pharmaceutical, and power industries, as well as constructs tourism, and sports complexes and facilities. In addition, it constructs infrastructure projects, such as highways/expressways/roads, flyovers/bridges/elevated corridors, metro rail systems, and other railway projects, as well as water related projects. Further, the company operates and maintains toll roads. JMC Projects (India) Limited was founded in 1982 and is headquartered in Mumbai, India. JMC Projects (India) Limited is a subsidiary of Kalpataru Power Transmission Limited.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "KALPATPOWR.NS": {
        "short_name": "KALPATARU POWER TR",
        "long_name": "Kalpataru Power Transmission Limited",
        "summary": "Kalpataru Power Transmission Limited provides engineering, procurement, and construction (EPC) services relating to power transmission and distribution, civil construction, railway track laying and electrification, and oil and gas pipelines laying in India. It designs, tests, manufactures, fabricates, erects, and constructs transmission lines, oil and gas infrastructure, and railways projects on a turnkey basis. The company also provides EPC contracting services for cross-country pipelines, terminals, and gas gathering stations across various territories; and EPC services for executing civil infrastructure, bridges, new track laying, track rehabilitation, gauge conversion, signaling and telecommunication, and over-head electrification projects for railways. In addition, it engages in the high voltage substation business in air insulated and gas insulated; and operation of two biomass power generation plants in Rajasthan, India. Further, the company undertakes an array of activities in the post-harvest value chain for agri-commodities, such as warehousing, primary processing, collateral management, funding facilitation, funding, testing and certification, and pest management. It operates in 55 countries. Kalpataru Power Transmission Limited was incorporated in 1981 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "KAUSHALYA.NS": {
        "short_name": "KAUSHALYA INFRASTR",
        "long_name": "Kaushalya Infrastructure Development Corporation Limited",
        "summary": "Kaushalya Infrastructure Development Corporation Limited primarily engages in executing construction contracts relating to infrastructure and real estate developments in India. The company operates in two segments, Construction and Hotel. It develops highways, bridges, and industrial infrastructure; electrification and irrigation projects; and residential and commercial complexes. The company is also involved in the operation of hotels; and acquisition, development, and sale of land. Kaushalya Infrastructure Development Corporation Limited was incorporated in 1992 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "KEC.NS": {
        "short_name": "KEC INTERNATIONAL",
        "long_name": "KEC International Limited",
        "summary": "KEC International Limited, together with its subsidiaries, engages in the engineering, procurement, and construction (EPC) business. It designs, manufactures, tests, supplies, and erects transmission lines on turnkey basis; and undertakes EPC projects of high voltage electrical switching and distribution substations, distribution network, optical fiber networks, telecom towers, and HV and EHV cabling project works. The company also manufactures power cables, jelly filled telecom cables, and optical fiber cables; provides railways infrastructure EPC turnkey solutions, such as construction of road over bridges, bridges, tunnels, stations, and platforms; carries out track works, such as track laying, and earthwork information; undertakes overhead electrification and traction substation works; and engages in interlocking works, and outdoor and indoor supply and installation works for signaling and telecommunication projects. In addition, it builds factories, warehouses, residential townships and buildings, commercial buildings, sewage and water treatment plants, and other civil infrastructure projects, as well as engages in the smart infrastructure activities. Further, the company provides solar EPC services that include design and engineering, project execution, project management, bid management, and project feasibility analysis for solar photovoltaic power plants. It operates in 100 countries in India, Brazil, Mexico, the United States, and internationally. The company was founded in 1945 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "KNRCON.NS": {
        "short_name": "KNR CONSTRUCTIONS",
        "long_name": "KNR Constructions Limited",
        "summary": "KNR Constructions Limited, together with its subsidiaries, operates as an infrastructure development company in India. The company provides engineering, procurement, and construction services for roads and highways, irrigation, and urban water infrastructure management sectors. It undertakes various infrastructure projects, such as expressways, national highways, flyovers, bridges and viaducts, irrigation projects, urban development-civic amenities, and commercial and residential projects. The company also undertakes BOT and HAM projects. KNR Constructions Limited was founded in 1995 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "LTO.F": {
        "short_name": "LARSEN+TOUBRO GDR/1 IR 2",
        "long_name": "Larsen & Toubro Limited",
        "summary": "Larsen & Toubro Limited engages in engineering, construction, and manufacturing operations worldwide. The Infrastructure segment engineers and constructs building and factories, transportation infrastructure, heavy civil infrastructure, power transmission and distribution, water and effluent treatment, smart world, and communication projects, as well as metallurgical and material handling systems. The Power segment offers turnkey solutions for coal-based and gas-based thermal power plants, including power generation equipment with related systems and balance-of-plant packages. The Heavy Engineering segment manufactures and supplies custom designed, engineered critical equipment and systems to the fertiliser, refinery, petrochemical, chemical, oil and gas, and thermal and nuclear power industries. The Defence Engineering segment designs, develops, prototypes, produces, delivers, commissions, and supports equipment, systems, and platforms for the defense and aerospace sectors. It also designs, constructs, commissions, repairs/refits, and upgrades of defense vessels. The Others segment offers realty; hydrocarbon; markets and services construction and mining machinery and parts; industrial valves; and manufactures and sells rubber processing machinery. The company was founded in 1938 and is headquartered in Mumbai, India.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "city": "Mumbai"
    },
    "LTOUF": {
        "short_name": "LARSEN & TOUBRO",
        "long_name": "Larsen & Toubro Limited",
        "summary": "Larsen & Toubro Limited engages in engineering, construction, and manufacturing operations worldwide. The Infrastructure segment engineers and constructs building and factories, transportation infrastructure, heavy civil infrastructure, power transmission and distribution, water and effluent treatment, smart world, and communication projects, as well as metallurgical and material handling systems. The Power segment offers turnkey solutions for coal-based and gas-based thermal power plants, including power generation equipment with related systems and balance-of-plant packages. The Heavy Engineering segment manufactures and supplies custom designed, engineered critical equipment and systems to the fertiliser, refinery, petrochemical, chemical, oil and gas, and thermal and nuclear power industries. The Defence Engineering segment designs, develops, prototypes, produces, delivers, commissions, and supports equipment, systems, and platforms for the defense and aerospace sectors. It also designs, constructs, commissions, repairs/refits, and upgrades of defense vessels. The Others segment offers realty; hydrocarbon; markets and services construction and mining machinery and parts; industrial valves; and manufactures and sells rubber processing machinery. The company was founded in 1938 and is headquartered in Mumbai, India.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "India",
        "city": "Mumbai"
    },
    "MADHUCON.NS": {
        "short_name": "MADHUCON PROJECTS",
        "long_name": "Madhucon Projects Limited",
        "summary": "Madhucon Projects Limited, together with its subsidiaries, operates as an integrated construction, infrastructure development, and management company in India. It operates through Construction, Power, and Toll Collection segments. The company develops and executes engineering, procurement, and construction, as well as turnkey projects. Its projects include expressway and highway, road, railway, port, irrigation and water resource infrastructure, building and property development, coal and other mineral mining, bridge and flyover, tunneling, industrial, and other infrastructure, as well as energy generation, transmission, and distribution projects. The company is also involved in the development of smart cities. Madhucon Projects Limited was founded in 1983 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "MANINFRA.NS": {
        "short_name": "MAN INFRACONSTRUCT",
        "long_name": "Man Infraconstruction Limited",
        "summary": "Man Infraconstruction Limited engages in the construction business in India. Its port infrastructure services include the construction of onshore container terminals and freight stations; reclamation of land; consolidation of soil; and operational services, such as firefighting, sewerage, drainage systems, etc. The company is also involved in the construction of commercial and institutional projects comprising IT parks, office complexes, hotels, shopping malls, schools, hospitals, etc.; and roads, including earthwork and paving, electrification, landscaping, widening, upgradation, drainage, and others. In addition, it engages in the construction of residential projects, such as high rise buildings, townships, luxury villas, and others; and industrial projects that include factories, cold storages, warehouse facilities, heavy engineering, manufacturing and processing units, etc. The company was formerly known as Man Construction Limited and changed its name to Man Infraconstruction Limited in November 2006. The company was incorporated in 2002 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "MBECL.NS": {
        "short_name": "MCNALLY BHARAT ENG",
        "long_name": "McNally Bharat Engineering Company Limited",
        "summary": "McNally Bharat Engineering Company Limited primarily engages in engineering, procurement, and construction businesses in India. It operates through two segments, Turnkey Engineering and Other Engineering Services. The company offers its turnkey solutions in the areas of power, steel, coal and mining, ports, aluminum, material handling, mineral processing, cement, water, pyro processing, pneumatic handling of powdered materials, coal washing, port cranes, cement, civic, industrial water supply, and oil and gas sectors, as well as for infrastructure sectors, such as buildings and townships, high rises, roads, metro, rail etc. It also manufactures a range of products, including crushers and screeners, mobile crushing and screening plants, skid mounted coal sizers, mills, pressure vessels, material handling equipment, and steel plant equipment, as well as process equipment, such as flotation cells, thickeners, slurry pumps, etc. The company was formerly known as McNally-Bird Engineering Company Limited and changed its name to McNally Bharat Engineering Company Limited in 1972. McNally Bharat Engineering Company Limited was founded in 1961 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "MBLINFRA.NS": {
        "short_name": "MBL INFRASTRUCTURE",
        "long_name": "MBL Infrastructures Limited",
        "summary": "MBL Infrastructures Limited provides integrated engineering, procurement, and construction services for civil construction and infrastructure sector projects in India. The company constructs, operates, and maintains highways; executes highway and BOT; railways/metro and other infrastructure; and housing, urban, and industrial infrastructure projects. The company was formerly known as Maheshwari Brothers Limited and changed its name to MBL Infrastructures Limited in July 2006. MBL Infrastructures Limited was incorporated in 1995 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "MOLDTECH.NS": {
        "short_name": "MOLD-TEK TECHNOLO",
        "long_name": "Mold-Tek Technologies Limited",
        "summary": "Mold-Tek Technologies Limited provides civil, structural, and mechanical engineering services in India, the United States, and internationally. It offers mechanical engineering services in the automotive, poles and towers, and oil and gas domains. The company also provides information technology services. Mold-Tek Technologies Limited was incorporated in 1985 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "MUKANDENGG.NS": {
        "short_name": "MUKAND ENGINEERS",
        "long_name": "Mukand Engineers Limited",
        "summary": "Mukand Engineers Limited engages in construction and erection businesses in India. It operates through Construction and Infotech segments. The company offers residual design and engineering services for fired heaters, furnaces, flare stacks, gas holders, water systems, and utility systems; and shutdown and maintenance services for hydrocarbon industry, and steel and power plants. It is also involved in engineering construction activities, including civil, structural, technological structure, piping, equipment erection, electrical and instrumentation, and composite works. In addition, the company undertakes turnkey packages, including design, supply, fabrication, civil, electrical, instrumentation, refractory/insulation, installation, and commissioning works for gas holders, water and utility systems, fired heaters, furnaces, reformers, and flare stacks. Further, it engages in the engineering, procurement, and construction of civil and structural works, plant equipment, and electricals and automation, as well as water, fire protection, air conditioning, air pollution control, and ventilation systems. Additionally, the company provides ERP implementation and infotech services. It serves steel, non-ferrous, hydrocarbon, power, nuclear, infrastructure, and defense industries. The company was formerly known as Mukand Construction and Project Engineering Company Ltd and changed its name to Mukand Engineers Limited in July 1992. Mukand Engineers Limited was incorporated in 1987 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "NBCC.NS": {
        "short_name": "NBCC (INDIA) LTD",
        "long_name": "NBCC (India) Limited",
        "summary": "NBCC (India) Limited engages in project management consultancy and real estate development businesses in India and internationally. The company also provides engineering, procurement, and construction (EPC) contracting services. Its Project Management Consultancy segment offers services for various civil construction projects, including residential and commercial complexes, re-development of colonies, hospitals, educational institutions, infrastructure works for security personnel, and border fencing projects, as well as infrastructure projects, such as roads, water supply systems, storm water drainage systems, water storage solutions, and solid waste management schemes. The company's EPC segment executes various projects, which include chimneys, cooling towers, coal handling plants, roads, bridges, flyovers, metro stations, metro elevated tracks, water and sewage treatment plants, solid waste management systems, TV towers, airports, runways, border fencing, etc. Its Real Estate Development segment develops residential, commercial, and institutional projects. The company is also involved in the provision of post-construction maintenance services; construction of harbors and electricity network; implementation of integrated steel plants; procurement, supply, installation, and commissioning of medical equipment; and environment and sustainability business. The company was formerly known as National Buildings Construction Corporation Limited and changed its name to NBCC (India) Limited in May 2016. NBCC (India) Limited was founded in 1960 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "NCC.NS": {
        "short_name": "NCC LTD",
        "long_name": "NCC Limited",
        "summary": "NCC Limited operates as a construction and civil engineering company in India, Kuwait, Oman, and the United Arab Emirates. The company constructs industrial and commercial buildings, housing projects, IT parks, shopping malls, sports complexes, and hospitals, as well as stadia; and roads, highways, bridges, flyovers, etc. It also undertakes design, engineering, erection, testing, and commissioning of transmission lines and sub-stations, as well as project electrification and various utility distribution projects; and railway projects, which include freight corridors, railway sidings, and port connectivity projects. In addition, the company constructs water supply projects, water treatment plants, distribution networks, pumping stations, river intake works, electromechanical works, underground drainage networks, lift irrigation schemes, sewage pumping stations and treatment plants, and summer storage tanks; and dams and reservoirs, canals, tunnels, and hydroelectric power projects, as well as barrages, spillways, and aqueducts. Further, it engages in the engineering, procurement, and construction of power and metal projects; and provision of mine developer-cum-operator services, as well as removal of overburden and extraction of coal/lignite/other minerals from open cast mines. The company was formerly known as Nagarjuna Construction Company Limited and changed its name to NCC Limited in March 2011. NCC Limited was founded in 1978 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "NIRAJ.NS": {
        "short_name": "Niraj Cement Struc Ltd",
        "long_name": "Niraj Cement Structurals Limited",
        "summary": "Niraj Cement Structurals Limited executes various infrastructure development projects in India. It constructs highways, expressways, turnkey project roads, bridges, tunnels, etc.; and water supply and drainage, irrigation, land storm water drainage, and other infrastructural works. The company also rents construction equipment, including ready mix concrete units, crushing units, and concrete slipform pavers, as well as motor graders, excavators, JCBs, rollers, hotmix plants, BT pavers, and allied construction equipment. Niraj Cement Structurals Limited was founded in 1972 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "OMINFRAL.NS": {
        "short_name": "OM INFRA LIMITED",
        "long_name": "Om Infra Limited",
        "summary": "Om Infra Limited engages in the design, engineering, manufacture, supply, installation, testing, and commissioning of hydro mechanical equipment for hydroelectric power and irrigation projects in India and internationally. It operates through Engineering, Real Estate, and Other segments. The company offers radial gates, vertical gates, stop log gates, draft tube gates, steel liners, penstocks and pressure shaft liners, trash racks, trash rack cleaning machines, various cranes, gantry cranes, mechanical and hydraulic hoists, lifting arrangements, steel bridges and walkways, electrical control and automation systems, and SCADA systems. It also provides engineering services, including transport and logistics for equipment; installation, testing, and commissioning; long term and short term operation and maintenance contracts; manpower training; on site mechanical maintenance contracts for various components; repair and refurbishment works for power plants; and redesign/overhaul and replacements works for equipment. In addition, the company builds residential and commercial units; and undertakes infrastructure projects, such as special economic zones and sea ports. Further, it provides steel fabrication services; and undertakes canal and dams projects. Additionally, the company constructs and operates food grain silos; constructs smart cities; and manufactures plastic closures for bottles used in the water, food, and beverages industries, as well as engages in the hostel and other related activities. The company was formerly known as Om Metals Infraprojects Limited and changed its name to Om Infra Limited in January 2021. Om Infra Limited was founded in 1971 and is based in Jaipur, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Jaipur"
    },
    "PATELENG.NS": {
        "short_name": "PATEL ENGINEERING",
        "long_name": "Patel Engineering Limited",
        "summary": "Patel Engineering Limited, through its subsidiaries, provides integrated infrastructure and construction services in India and internationally. The company undertakes hydro-power projects, including dams, tunnels, power-houses, and barrages; irrigation and water supply projects comprising dams, weirs, and pump houses; urban infrastructure projects and others, which include sewerage, micro tunneling and horizontal directional drilling, and pipelines; and transportation projects, such as roads, bridges, flyovers, and tunnels for railways. It also undertakes real estate projects, such as buildings, townships, malls, and structures. Patel Engineering Limited was founded in 1949 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "PNCINFRA.NS": {
        "short_name": "PNC INFRATECH LTD",
        "long_name": "PNC Infratech Limited",
        "summary": "PNC Infratech Limited, together with its subsidiaries, operates as an infrastructure construction, development, and management company in India. The company undertakes various infrastructure projects, including highways, bridges, flyovers, power transmission lines, airport runways and pavements, industrial area development, track construction for rail freight corridors, and other infrastructure projects. It also provides end-to-end infrastructure implementation solutions, such as engineering, procurement, and construction services on a fixed-sum turnkey basis, as well as on an item rate basis; and executes and implements projects on a design-build-finance-operate-transfer, operate-maintain-transfer, hybrid annuity model, and other PPP formats. The company was formerly known as PNC Construction Company Limited and changed its name to PNC Infratech Limited in August 2007. PNC Infratech Limited was founded in 1989 and is headquartered in Agra, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Agra"
    },
    "POWERMECH.NS": {
        "short_name": "POWER MECH PROJECT",
        "long_name": "Power Mech Projects Limited",
        "summary": "Power Mech Projects Limited provides services in power and infrastructure sectors in India and internationally. The company engages in the erection, testing, and commissioning of boilers, turbines, and generators; balance of plant works for the power sector, as well as for other industries, including petrochemicals, steel, and cement; and overhauling, maintenance, renovation, and modernization of power plants. It also undertakes various civil, architectural, and structural works, including topographical surveying, geotechnical investigation, mass excavation and area grading, bored cast insitu piling, TG rafts and decks, machine and GT foundations, mill and bunker fabrication and erection, CW pump houses and channel works, CW pipe line fabrication and laying, cooling towers, coal handling plants, plant roads and drains, pipe racks, refinery tanks and shells, enabling works, balance of plant civil works, commercial and residential buildings, and gas power projects and R&M civil works, as well as power house and control room buildings civil and architecture. In addition, the company engages in the provision of various services in the fields of petro chemical plants, irrigation, cement, oil and gas, and steel industries; and power transmission and distribution activities. The company was founded in 1999 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "PRAJIND.NS": {
        "short_name": "PRAJ INDUSTRIES",
        "long_name": "Praj Industries Limited",
        "summary": "Praj Industries Limited operates in the field of bio-based technologies and engineering worldwide. It offers solutions for the ethanol industry, including multi-feed multi-product plants, modernization of existing plants, and renewable fuels comprising BioCNG, iso-butanol etc.; produces bio ethanol, bio butanol, bio chemicals, power, bio CNG, CO2, etc.; and operates bio-mobility platform that promotes the use of renewable resources to produce carbon neutral transportation fuel. The company also provides high purity system solutions to the bio-pharmaceutical, biotech, cosmetics, healthcare, and F&B sector for sterile process water generation, water for injection, storage and distribution system, CIP/SIP, systems for core processes, wastewater treatment, etc. In addition, it offers customized plants, and equipment and technology solutions to customers in the brewing industry; pressure vessels, reactors, shell and tube heat exchangers, columns, and other proprietary equipment to various process industries, such as oil and gas, refining, petrochemicals, fertilizers, chemicals, food, pharma, and biotech, as well as undertakes end-to-end projects for process skids and packages. Further, the company provides waste water treatment solutions, including treatment and disposal; the 3Rs of reduce, recycle, and reuse; ZLD and resource recovery; operation and maintenance services; and value added services. Praj Industries Limited was founded in 1985 and is headquartered in Pune, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Pune"
    },
    "PSPPROJECT.NS": {
        "short_name": "PSP PROJECTS LIMIT",
        "long_name": "PSP Projects Limited",
        "summary": "PSP Projects Limited, a construction company, provides construction services for industrial, institutional, residential, social infrastructure, and commercial projects in India. The company constructs industrial buildings for pharmaceutical plants, food processing units, engineering units, and manufacturing and processing facilities; and buildings for hospitals and healthcare services, educational institutes, malls, hospitality services, and corporate offices. It also undertakes government projects and government residential projects; and constructs buildings for group housing and townships, as well as independent residences for select private customers. PSP Projects Limited was founded in 2008 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Ahmedabad"
    },
    "PUNJLLOYD.NS": {
        "short_name": "PUNJ LLOYD LTD",
        "long_name": "Punj Lloyd Limited",
        "summary": "Punj Lloyd Limited provides integrated design, engineering, procurement, construction, and project management services for energy and infrastructure sectors in India and internationally. The company offers engineering, procurement, fabrication, and installation services for offshore wellhead and process platforms, including topsides and jackets, risers, submarine pipelines, underwater cables, and single buoy mooring systems; gathering stations, flow and transfer lines, and gas and crude processing plants; onshore rigs; onshore and offshore oil and gas pipelines; cryogenic, LNG, LPG, ethylene, ammonia, and other storage tanks; refineries; and petrochemical plants for polymer treatment, handling, conveying, storage, packing, and shipping. It also provides EPC services for boilers, turbines, generators, civil construction, and balance of power plant packages, as well as support services; coal and ash handling, HVAC, water systems, fire-fighting systems, and electrical and C&I packages; design and construction support services for nuclear process facilities; and solutions for photovoltaics (PV), concentrated solar power, concentrating PV, and concentrating heat and power. In addition, the company offers water treatment and distribution solutions; solutions for the biofuels sector; and provides design and EPC services for infrastructure, buildings, airports and seaports, national highways, and medical institutes. Further, it provides manufacturing services and products, as well as maintenance, repair, and overhaul services for land systems, defense aerospace, and defense electronics. Punj Lloyd Limited was founded in 1988 and is headquartered in Gurugram, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gurugram"
    },
    "PURVA.NS": {
        "short_name": "PURAVANKARA LTD",
        "long_name": "Puravankara Limited",
        "summary": "Puravankara Limited, together with its subsidiaries, develops residential and commercial properties in India and internationally. The company's residential projects include apartment complexes, villas, townhouses, plotted developments, and affordable housing projects; and commercial projects comprise retail and office premises, and mixed-use developments. It markets its projects under the Purva, Puravankara, and Provident brand names. The company was formerly known as Puravankara Projects Limited and changed its name to Puravankara Limited in December 2016. Puravankara Limited was founded in 1975 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "RAMKY.NS": {
        "short_name": "RAMKY INFRASTRUCTU",
        "long_name": "Ramky Infrastructure Limited",
        "summary": "Ramky Infrastructure Limited, together with its subsidiaries, provides integrated construction, infrastructure development, and management services primarily in India. It operates through Construction Business, Developer Business, and Others segments. The company constructs water and waste water projects, such as water treatment plants, water transmission and distribution systems, elevated and ground level service reservoirs, sewage treatment plants, common effluent treatment plants, tertiary treatment plants, underground drainage systems, and lake restorations; and irrigation projects, including cross-drainage works, lift irrigation projects, canals, feeder channels, dams, and barrages. It also undertakes industrial construction projects comprising industrial parks, SEZs, and related works; roads and bridges projects, such as expressways, highways, bridges, flyovers, rural roads, terminals, and dedicated service corridors; commercial, residential, public, institutional, corporate buildings, mass housing projects, healthcare infrastructure, integrated townships projects, and related infrastructure facilities, including hospitals and shopping malls; and power transmission and distribution projects comprising electricity transmission networks, substation feeder lines, and low tension distribution lines. In addition, the company develops various development projects based on public private partnership. Further, it offers infrastructure and property development, waste management, and environment consultancy services. Ramky Infrastructure Limited was founded in 1994 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "RIIL.NS": {
        "short_name": "RELIANCE IND INFRA",
        "long_name": "Reliance Industrial Infrastructure Limited",
        "summary": "Reliance Industrial Infrastructure Limited engages in setting up/operating industrial infrastructure in India. The company is involved in the transportation of petroleum products and raw water through its pipelines; hire of construction machinery; and provision of other infrastructure support services, as well as leasing and providing services connected with computer software and data processing. It primarily operates in Mumbai and the Rasayani regions of Maharashtra, as well as Surat and Jamnagar belts of Gujarat. The company was formerly known as CPPL Limited and changed its name to Reliance Industrial Infrastructure Limited in March 1994. Reliance Industrial Infrastructure Limited was incorporated in 1988 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "RITES.NS": {
        "short_name": "RITES LTD",
        "long_name": "RITES Limited",
        "summary": "RITES Limited, together with its subsidiaries, provides consultancy, engineering, and project management services in the field of railways, highways, airports, ports, ropeways, urban transport, inland waterways, and renewable energy. It operates through four segments: Consultancy Services; Leasing of Railway Rolling Stock & Equipments; Export of Rolling Stock, Equipments and spares; and Turnkey Construction Projects. It is also involved in the survey and feasibility studies, detailed design and engineering, project management consultancy, third party inspection, quality assurance, construction supervision, leasing and export of locomotives and rolling stock, and energy management activities; and operation, maintenance, and rehabilitation of locomotives and rolling stock. In addition, the company constructs railway infrastructure; undertakes electrification works and modernization of railway workshops on a turnkey basis, and civil construction works; and generates power from wind mills and solar energy plants. Further, it offers services in the field of architecture and planning, bridges and tunnel engineering, environmental/urban engineering, electrical engineering, financial management, geo-technology, industrial engineering, information technology, materials system management, privatization and concession projects, railway electrification, rolling stock design, signal and telecommunication, surveys, and training programs. The company serves governments, public sector undertakings, corporations and industrial establishments, private enterprises, and other Apex organizations in India, Asia, Africa, and the United States. RITES Limited was founded in 1974 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gurugram"
    },
    "RKEC.NS": {
        "short_name": "RKEC Projects Limited",
        "long_name": "RKEC Projects Limited",
        "summary": "RKEC Projects Limited operates as an engineering construction company in India. The company constructs marine structures, such as wharves, berths, jetties, mooring dolphins, intake structures break waters, and coastal - shore protection works; and roads and bridges, as well as steel girders/PSU girders, and composite girders. It also undertakes building and infrastructure works, including civil works for power and refinery projects port development works, transmission lines, sports complex, buildings works, water intake systems, heavy RCC pre-stressed concrete and steel structures, and framed warehouses/industrial sheds; and rural electrification and LT/HT works. The company was incorporated in 2005 and is based in Visakhapatnam, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Visakhapatnam"
    },
    "RPPINFRA.NS": {
        "short_name": "R.P.P.INFRA PROJEC",
        "long_name": "R.P.P. Infra Projects Limited",
        "summary": "R.P.P. Infra Projects Limited, together with its subsidiaries, engages in the construction and infrastructure development activities in India, Sri Lanka, Mauritius, and Gabon. The company undertakes civil construction, building projects, and irrigation and water supply projects; and infrastructure construction works, including roads, buildings, industrial structures, and power and irrigation projects, as well as hotels, hospitals, educational institutions. It also provides infrastructure projects related consultancy services; and procures, sells, and supplies electricity from various sources, including coal and thermal energy, bio-mass, bio-gas, etc. In addition, the company acts as a distributor, agent, trader, merchant, contractor, broker, and dealer in various merchandise and articles, including clearing agents, freight contractors, forwarding agents, licensing agents, and general brokers, as well as carries commercial business. R.P.P. Infra Projects Limited was founded in 1988 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "RVNL.NS": {
        "short_name": "RAIL VIKAS NIGAM",
        "long_name": "Rail Vikas Nigam Limited",
        "summary": "Rail Vikas Nigam Limited engages in the construction of rail infrastructure projects in India. It undertakes rail project development and implementation, as well as provides financial resources mobilization services. The company executes various railway projects, including new lines, doubling, gauge conversion, railway electrification, metro projects, workshops, bridges, construction of cable stayed bridges, institution buildings, etc. In addition, it constructs traffic facilities, road safety works, building of sub-ways in lieu of crossings, etc. The company serves Indian Railways, various central and state government ministries, departments, and public sector undertakings. Rail Vikas Nigam Limited was founded in 2003 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "SADBHAV.NS": {
        "short_name": "SADBHAV ENGINEERIN",
        "long_name": "Sadbhav Engineering Limited",
        "summary": "Sadbhav Engineering Limited develops infrastructure projects primarily in India. It undertakes infrastructure projects in the areas of canals, irrigation projects, roads, bridges, and dams that include civil, electrical and mechanical contractor, designer and engineers, structural contractor, and earthwork contractor for repairing, reconstruction, renovation, demolition, and construction. The company also establishes, maintains, operates, leases, or transfers its infrastructure facilities on BOT, BOLT, and BOOT basis, as well as provides consulting and advisory services. In addition, it engages in mining activities on contract basis; and energy generation through wind power project. The company was founded in 1988 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Ahmedabad"
    },
    "SADBHIN.NS": {
        "short_name": "SADBHAV INFRA PROJ",
        "long_name": "Sadbhav Infrastructure Project Limited",
        "summary": "Sadbhav Infrastructure Project Limited engages in the development, construction, operation, and maintenance of infrastructure projects in India. The company develops highways and roads on a build, operate, and transfer basis. It also provides related consulting and advisory services. The company was incorporated in 2007 and is based in Ahmedabad, India. Sadbhav Infrastructure Project Limited is a subsidiary of Sadbhav Engineering Limited.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Ahmedabad"
    },
    "SETUINFRA.NS": {
        "short_name": "SETUBANDHAN INFRA LTD",
        "long_name": "Setubandhan Infrastructure Limited",
        "summary": "Setubandhan Infrastructure Limited, a construction company, engages in the infrastructure development and construction businesses in India. It provides integrated engineering, procurement, and construction services. The company is involved in the construction of buildings, quarters, roads, bridges, airports, godowns, hospitals, etc. for government and semi-government authorities. It also constructs industrial buildings, residential and commercial complex, townships, health care centers, and institutional campus. Further, the company is also involved in real estate development activities. The company was formerly known as Prakash Constrowell Limited and changed its name to Setubandhan Infrastructure Limited in June 2019. Setubandhan Infrastructure Limited was founded in 1978 and is headquartered in Nashik, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Nashik"
    },
    "SHRIRAMEPC.NS": {
        "short_name": "SHRIRAM EPC LTD",
        "long_name": "Shriram EPC Limited",
        "summary": "Shriram EPC Limited provides integrated design, engineering, procurement, construction, and project management services in India and internationally. The company offers turnkey contracting solutions, including design, engineering, and construction for ferrous and non-ferrous industries, cement plants, coke oven and by-product plants, process plants, and material handling plants; water and sewage treatment plants, intake wells and pump houses, underground drainage systems, water distribution, and pipe rehabilitation systems; biomass, thermal, and solar power plants, as well as wind farms; and mining and mineral processing. Shriram EPC Limited was incorporated in 2000 and is headquartered in Chennai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "SIMPLEXINF.NS": {
        "short_name": "SIMPLEX INFRASTRUC",
        "long_name": "Simplex Infrastructures Limited",
        "summary": "Simplex Infrastructures Limited provides construction and engineering services for the piling, energy and power, building and housing, marine, road and highway, railway, urban infrastructure, real estate, and other sectors in India and internationally. The company builds rail infrastructure, including rail tracks, station buildings, bridges, and culverts; and designs and constructs high-rise infrastructure, such as multistoried residential towers, institutional or information technology buildings, hotels, hospitals, and mass housing projects. It also builds industrial structures comprising steel and power plants; and undertakes projects for cement, aluminum, copper, engineering, automobiles, petrochemicals, fertilizers, paper textiles, pharmaceuticals, chemicals, and other industrial plants. In addition, the company engages in erecting various types of power infrastructures that include thermal, hydel, and nuclear, as well as ultra-mega power projects; underwater piling, which comprise steel piling; and building bridges across rivers. Further, it undertakes ground engineering projects, including pre-cast piling and jointed piling, cast-in-situ, driven, and bored piling, as well as soil investigation, soil compaction, diaphragm walls, grouting, stone columns, etc. Additionally, the company offers airport renovation and modernization; and oil drilling services, as well as engages in the equipment hire business activities. It also operates and develops mines. Simplex Infrastructures Limited was founded in 1924 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "SKIL.NS": {
        "short_name": "SKIL INFRASTRUCTUR",
        "long_name": "SKIL Infrastructure Limited",
        "summary": "SKIL Infrastructure Limited, together with its subsidiaries, engages in the infrastructure development business in India. It develops various projects, such as seaports, logistics, railways, defense shipyards, offshore asset construction yards, special economic zones, and smart cities in the private sector. The company was formerly known as Horizon Infrastructure Limited and changed its name to SKIL Infrastructure Limited in January 2014. SKIL Infrastructure Limited was incorporated in 1983 is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "SKIPPER.NS": {
        "short_name": "SKIPPER LTD",
        "long_name": "Skipper Limited",
        "summary": "Skipper Limited manufactures and sells engineering and polymer products in India. It operates through Engineering Products, Infrastructure Projects, and Polymer Products segments. The Engineering Products segment offers power transmission towers, transmission line monopoles, power distribution and lighting poles, mid steel and high tensile angles, fasteners, tower accessories, telecom towers, railway electrification structures, angles, channels, high mast poles, swaged poles, scaffoldings, and solar power systems. The Infrastructure Projects segment provides horizontal direct drilling services; and engineering, procurement, and construction services. Its solutions cover transmission line EPC, and underground utility laying by horizontal directional drilling. The Polymer Products segment offers PVC, UPVC, CPVC, SWR, agricultural, and bore well pipes and fitting, as well as other related products; and CPVC solvent cement, cistens, and bath accessories. The company also exports its products to Africa, Australia, the Middle East, South and Southeast Asia, South America, and Europe. Skipper Limited was founded in 1981 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "SPMLINFRA.NS": {
        "short_name": "SPML INFRA LTD",
        "long_name": "SPML Infra Limited",
        "summary": "SPML Infra Limited operates as an infrastructure development company in India. It operates in two segments, Construction and Trading. The company undertakes urban water supply and distribution, and water treatment projects; constructs pumping stations for water supply, irrigation, wastewater, and storm water drainage; and designs and supplies bulk and distribution pipeline networks, as well as provides services in various areas, including construction of dams, canals, lift irrigation, micro irrigation, and tunneling. It also undertakes power generation, transmission, and distribution projects, including the construction of hydro, solar, wind, gas turbine, and thermal power plants, as well as sub-transmission/distribution lines and substations; and provides rural electrification, and integrated and smart energy management solutions. In addition, the company develops bridges, flyovers, industrial infrastructure, tunnels, special economic zones, industrial/business/technology parks, airports, seaports, bus terminals, automated car parking facilities, and toll express roads/highways. Further, it provides integrated end-to-end waste management solutions, such as collection, segregation, transportation, treatment, reusability, processing, and scientific disposal of waste water and solid waste, as well as sewer rehabilitation solutions. Additionally, SPML Infra Limited develops an integrated management information system, a software solution for metering, billing, CRM, network analysis, demand forecasting and management, asset and inventory management, business intelligence, and operation and maintenance of the entire network. The company was formerly known as Subhash Projects and Marketing Limited and changed its name to SPML Infra Limited in April 2010. SPML Infra Limited was founded in 1981 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "SUPREMEINF.NS": {
        "short_name": "SUPREME INFRASTRUC",
        "long_name": "Supreme Infrastructure India Limited",
        "summary": "Supreme Infrastructure India Limited, together with its subsidiaries, engages in the engineering and construction of road, rail, highway, building, bridge, irrigation, power, and sewerage projects in India. The company owns and operates ready mix concrete, asphalt, and crushing plants. It also rents staging, scaffolding, shuttering steel pipes; and offers structural fabrications, steel fabrications, and job works. In addition, the company is involved in the tolling operations. Supreme Infrastructure India Limited was incorporated in 1983 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "TANTIACONS.NS": {
        "short_name": "TANTIA CONSTRUCTIO",
        "long_name": "Tantia Constructions Limited",
        "summary": "Tantia Constructions Limited engages in construction and other infrastructure activities in India. It is involved in the construction, widening, conversion, maintenance, strengthening, and beautification of roadways, road bridges, highways, and flyovers; and railway infrastructure works, including the survey, fixing of alignment, and designing of track embankment and cuttings, as well as steel girder fabrication and erection. The company also engages in constructing bridges and tunnels, buildings, railway stations, terminals, and light rail and mass rapid transport system infrastructure; laying ballast and concrete sleepers, rails and fittings, and flash butt welding for long rails; undertaking BOT/BOOT project works, and signaling and electrification works; and maintaining railroads and rail infrastructure. In addition, the company provides urban infrastructure services comprising soil re-engineering, mechanized earthwork, hauling for large-scale land development, allied works of roads and pipelines, electrification, and lighting systems for residential, commercial, and public utility buildings, as well as mass rapid transport systems solutions. Further, it constructs terminal buildings, addressal systems, control systems, and other aviation infrastructure projects; marine infrastructure projects; and power transmission projects, such as beam foundation, lattice structure erection, conductor stringing, and cable-laying systems. Additionally, the company produces and sells ready mix and dry-mix concrete and mortar products. The company was founded in 1964 and is based in Kolkata, India. Tantia Constructions Limited is a subsidiary of Nigolice Trading Private Limited.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "TARMAT.NS": {
        "short_name": "TARMAT LIMITED",
        "long_name": "Tarmat Limited",
        "summary": "Tarmat Limited operates as an infrastructure company in India. It undertakes various construction works, including airport runway, highways, and railways; and develops infrastructure projects, such as ports, industrial area developments, refineries, etc. The company also develops real estate properties. The company was formerly known as Roman Tarmat Limited and changed its name to Tarmat Limited in September 2012. Tarmat Limited was founded in 1986 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "TECHNOE.NS": {
        "short_name": "TECHNO ELECTRIC &",
        "long_name": "Techno Electric & Engineering Company Limited",
        "summary": "Techno Electric & Engineering Company Limited provides engineering, procurement, and construction (EPC) services to the power generation, transmission, and distribution sectors in India. The company operates through EPC and Energy segments. It provides solutions for captive power plants, balance of plant for thermal and hydro power projects, utilities for power projects, and flue gas desulphurisation plants; constructs air-insulated and gas-insulated substations; and installs overhead lines. The company also undertakes industrial projects comprising plant electrical and illuminations, water and allied systems, installation of fire protection systems, oil handling plants, air conditioning, and ventilation system, as well as naptha- and diesel-based systems for turbine-based power plant, offsite piping systems. In addition, it is involved in the generation of wind power in Tamil Nadu with a capacity of 129.9 MW. Further, the company engages in building transmission linkages. It serves power, steel, fertilizer, metals, petrochemicals, and other sectors. The company was founded in 1963 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "TECHNOFAB.NS": {
        "short_name": "TECHNOFAB ENGINEER",
        "long_name": "Technofab Engineering Limited",
        "summary": "Technofab Engineering Limited provides engineering, procurement, and construction services for power, industrial, and infrastructure sectors in India. The company undertakes contracts for electricity, water infrastructure, oil handling systems, etc. on a turnkey, supply, or erection basis. It also provides project management services, including the evaluation of enquiries and submission of proposals, engineering and design, system drawings, bill of materials, procurement, logistics, construction, testing and commissioning, and after sales service, as well as planning, scheduling, and resulting. The company also has operations Ghana, Ethiopia, Kenya, Zambia, Fiji, Malawi, Mozambique, Tanzania, Liberia, Zimbabwe, Uganda, Rwanda, Bhutan, and Seychelles. Technofab Engineering Limited was founded in 1971 and is based in Faridabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Faridabad"
    },
    "UNITY.NS": {
        "short_name": "UNITY INFRAPROJECT",
        "long_name": "Unity Infraprojects Limited",
        "summary": "Unity Infraprojects Limited engages in the construction and engineering activities in India. The company undertakes projects in buildings and housing, transportation, water supply, and irrigation. It constructs dams, tunnels, bridges, flyovers, subways, roads, and buildings. It serves various companies and governments. Unity Infraprojects Limited was incorporated in 1979 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "UNIVASTU.NS": {
        "short_name": "Univastu India Limited",
        "long_name": "Univastu India Limited",
        "summary": "Univastu India Limited operates as a construction company in India. The company provides integrated engineering, procurement, and construction services for civil and structural construction and infrastructure sector projects. It handles turnkey, civil construction, mass housing, water supply and drainage, road, and minor irrigation projects, as well as sports complexes, multi-purpose halls, commercial and industrial structures, hospitals, educational institutions, etc. The company is also involved in the trading of construction materials, including steel, cement, and electrical materials. It serves public and commercial sectors. The company was founded in 2009 and is headquartered in Pune, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Pune"
    },
    "VASCONEQ.NS": {
        "short_name": "VASCON ENGINEERS L",
        "long_name": "Vascon Engineers Limited",
        "summary": "Vascon Engineers Limited provides engineering, procurement, and construction (EPC) services in India. It operates through EPC, Real Estate Development, and Manufacturing & Building Management System (BMS) segments. The company constructs residential, commercial, industrial, institutional, hospitals, and hospitality; and develops residential properties, hotel premises, industrial parks, retail malls and schools, and community welfare centres. It also manufactures clean room partitions and BMS. Vascon Engineers Limited was founded in 1986 and is based in Pune, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Pune"
    },
    "VINDHYATEL.NS": {
        "short_name": "VINDHYA TELELINKS",
        "long_name": "Vindhya Telelinks Limited",
        "summary": "Vindhya Telelinks Limited manufactures and sells cables in India. It operates in two segments, Cables; and Engineering, Procurement, and Construction. The company offers fiber optic cables, including central-tube, multi-tube single sheath, multi-tube double sheath, breakout tight buffered, fan out tight buffered, and multi-tube double layer unarmored cables; central-tube steel tape, multi-tube single sheath, multi-tube double sheath, multi-tube steel wire, multi-tube FRP rod, and hybrid underground armored cables; and dielectric rodent protected, multi-tube ribbon type, di-electric self-supporting aerial, single-tube figure-8 type aerial, multi-tube figure-8 type aerial, drop, indoor drop, central-tube micro, multi-tube micro, and interconnect cables. It also provides telecom fiber accessories, such as LC, SC, FC, and ST fiber connector series; LC, ST, and SC fiber adapter series; SC, LC, and ST fiber pigtail series; SC, LC, ST, and FC fiber patch cord series; rackmount and wall mount fiber management series; and FOSC 400, as well as solar PV cables. In addition, the company offers copper cables comprising foam skin/solid PE insulated jelly filled telephone cables, self-supporting aerial figure 8 type telephone cables, underground jelly filled quad cables, signaling cables, jumper wires, and electroplated tinned copper wires. Further, it provides power cables that include LT aerial bunched, instrumentation, control, and sheathed and unsheathed PVC insulated industrial cables. Additionally, the company offers turnkey services, which comprise engineering, design, supply, construction, installation, testing, and commissioning services for telecom, FTTH, power, and gas pipeline projects; and LED lighting solutions. It also exports its products. The company was incorporated in 1983 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "WALCHANNAG.NS": {
        "short_name": "WALCHANDNAGAR IND",
        "long_name": "Walchandnagar Industries Limited",
        "summary": "Walchandnagar Industries Limited operates as a heavy engineering and project execution company worldwide. The company offers booster motor casings and nozzles for aerospace applications; design, engineering, manufacture, supply, project management, and supervision services of cement plant equipment and clinker grinding units, as well as custom made solutions for modernization/retrofitting of existing plant; strategic articles, tactical missiles, and platform based equipment to the defense sector; high and low speed, planetary, and marine gear boxes; and mechanical precision instruments and components, including pressure and temperature gauges, pressure transmitters, pressure switches, thermowells, diaphragm seals, and accessories under the TIWIN brand name. It also provides centrifugal machines; equipment for various nuclear power plants; industrial boilers and steam generators; and equipment for onshore production facilities, refineries, and petrochemical and fertilizer plants, as well as undertakes turnkey sugar projects, and installation and integration activities for nuclear power plants. In addition, the company manufactures grey and ductile iron castings; offers consulting engineering services in the areas of nuclear and thermal plants, oil and gas engineering, submarines and ships, design engineering and complex projects, and special purpose machine and R&D projects; and supplies machinery and equipment for nuclear power generation plants. Walchandnagar Industries Limited was founded in 1908 and is based in Pune, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Pune"
    },
    "WELENT.NS": {
        "short_name": "WELSPUN ENTERPRISE",
        "long_name": "Welspun Enterprises Limited",
        "summary": "Welspun Enterprises Limited engages in the engineering, procurement, and construction of infrastructure development projects in India. It operates in two segments, Infrastructure, and Oil and Gas. The company develops and operates roads and highways, and water and urban infrastructure projects on build, operate, and transfer basis; and operates and maintains projects for the transportation sector. It is also involved in the oil and gas exploration activities. The company was formerly known as Welspun Projects Limited and changed its name to Welspun Enterprises Limited in May 2015. Welspun Enterprises Limited was founded in 1976 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    }
}