{"ARSSINFRA.NS": {"short_name": "ARSS INFRASTRUCTUR", "long_name": "ARSS Infrastructure Projects Limited", "summary": "ARSS Infrastructure Projects Limited engages in the construction activities in India. The company undertakes construction of railway, road, urban, marine, bridge, power, and irrigation work projects. It primarily serves government, public sector undertakings, and other government agencies. The company was formerly known as ARSS Stones Pvt. Ltd. and changed its name to ARSS Infrastructure Projects Limited in April 2006. ARSS Infrastructure Projects Limited was founded in 2000 and is based in New Delhi, India.", "currency": "INR", "sector": "Industrials", "industry": "Infrastructure Operations", "exchange": "NSI", "market": "in_market", "country": "India", "city": "New Delhi"}, "BRNL.NS": {"short_name": "BHARAT ROAD NETWOR", "long_name": "Bharat Road Network Limited", "summary": "Bharat Road Network Limited designs, develops, builds, owns, operates, and transfers road and related services in India. It offers financial and concession management services; tolling operations and highway management services; advisory and project management services, including construction supervision/debt syndication; and specialized toll plaza construction and integration with the selected TMS services, as well as corridor and incident management integrated with HTMS services. The company was incorporated in 2006 and is based in Kolkata, India.", "currency": "INR", "sector": "Industrials", "industry": "Infrastructure Operations", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Kolkata"}, "GAMMNINFRA.NS": {"short_name": "GAMMON INFRASTRUCT", "long_name": "Gammon Infrastructure Projects Limited", "summary": "Gammon Infrastructure Projects Limited develops various infrastructure projects in India. The company develops roads and expressways, ports, airports, railways, power transmission lines, and special economic zones, as well as undertakes urban infrastructure, water and wastewater management, hydro power, and agricultural infrastructure projects. It also provides project advisory services; and operation and maintenance services for the transportation sector. The company was incorporated in 2001 and is based in Mumbai, India.", "currency": "INR", "sector": "Industrials", "industry": "Infrastructure Operations", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "GAYAHWS.NS": {"short_name": "GAYATRI HIGHWAYS L", "long_name": "Gayatri Highways Limited", "summary": "Gayatri Highways Limited engages in the construction, operation, and maintenance of roads, highways, vehicle bridges and tunnels, and toll roads in India. The company was incorporated in 2006 and is based in Hyderabad, India.", "currency": "INR", "sector": "Industrials", "industry": "Infrastructure Operations", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Hyderabad"}, "JPINFRATEC.NS": {"short_name": "JAYPEE INFRATECH L", "long_name": "Jaypee Infratech Limited", "summary": "Jaypee Infratech Limited operates as the concessionaire for Yamuna Expressway project in Uttar Pradesh, India. It operates and maintains the Yamuna Expressway, a 165 kilometer long six lane access controlled expressway connecting Greater Noida and Agra. The company is also developing 25 million square meters of land for residential, commercial, institutional, amusement, and industrial purposes at five land parcels along the expressway. In addition, it operates Jaypee Hospital, a 504 bed super specialty hospital in Noida. The company was incorporated in 2007 and is based in Noida, India. Jaypee Infratech Limited is a subsidiary of Jaiprakash Associates Limited.", "currency": "INR", "sector": "Industrials", "industry": "Infrastructure Operations", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Noida"}, "MEP.NS": {"short_name": "MEP INFRASTRUCTURE", "long_name": "MEP Infrastructure Developers Limited", "summary": "MEP Infrastructure Developers Limited engages in the construction, operation, and maintenance of road infrastructure in India. MEP Infrastructure Developers Limited was founded in 2002 and is headquartered in Mumbai, India.", "currency": "INR", "sector": "Industrials", "industry": "Infrastructure Operations", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "NOIDATOLL.NS": {"short_name": "NOIDA TOLL BRIDGE", "long_name": "Noida Toll Bridge Company Limited", "summary": "Noida Toll Bridge Company Limited develops, establishes, constructs, operates, and maintains Delhi Noida toll bridge on a build-own-operate-transfer basis in India. It also provides space advertisement and offices. The company was incorporated in 1996 and is based in Noida, India.", "currency": "INR", "sector": "Industrials", "industry": "Infrastructure Operations", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Noida"}}