{"ADANIPORTS.NS": {"short_name": "ADANI PORT SPECIAL", "long_name": "Adani Ports and Special Economic Zone Limited", "summary": "Adani Ports and Special Economic Zone Limited, together with its subsidiaries, develops, operates, and maintains port infrastructure facilities in India. It also engages in the ports related infrastructure development activities; and development of infrastructure at contiguous Special Economic Zone at Mundra. The company operates nine ports and terminals with 48 berths to facilitate the handling of dry bulk, liquid cargo, crude oil, containers, ro-ro, and project cargo at Mundra, Kandla, Hazira, Dahej, Dhamra, Vizag, Murmugao, Kattupalli, and Ennore port locations. It also provides auto logistics, inland waterways, rail operation, warehousing, and agriculture logistics services, as well as operates multi-modal logistics parks; and offers capital, maintenance, and inland water dredging services. In addition, it is involved in the operation, development, maintenance, improvement, and extension of utility services, including power distribution; provision of non-scheduled passenger airline services, and hospital and related services; and ownership and operation of harbour tugs, barges, other port crafts, ocean towage, and offshore support vessels, as well as offers marine services, such as pilotage, laying, and maintenance of buoys. The company was formerly known as Mundra Port and Special Economic Zone Limited and changed its name to Adani Ports and Special Economic Zone Limited in January 2012. Adani Ports and Special Economic Zone Limited was incorporated in 1998 and is headquartered in Ahmedabad, India.", "currency": "INR", "sector": "Industrials", "industry": "Marine Shipping", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Ahmedabad"}, "ESSARSHPNG.NS": {"short_name": "ESSAR SHIPPING POR", "long_name": "Essar Shipping Limited", "summary": "Essar Shipping Limited provides sea transportation and contract drilling services in India, Singapore, Cyprus, the United Arab Emirates, and the United Kingdom. The company is involved in the fleet operating and chartering activities consisting of tankers and dry bulkers; and oilfields services, such as land and semi- submersible rigs; and logistics services, including trucks, trailers, and tippers. It operates a fleet of 12 vessels, including a double hull VLCC, 6 mini-capesize vessels, a panamax bulk carrier, 2 supramax bulk carriers, and 2 general cargo ships. The company was incorporated in 2010 and is based in Mumbai, India. Essar Shipping Limited is a subsidiary of Essar Shipping Mauritius Holdings Limited.", "currency": "INR", "sector": "Industrials", "industry": "Marine Shipping", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "GESHIP.NS": {"short_name": "GREAT EASTERN SHI", "long_name": "The Great Eastern Shipping Company Limited", "summary": "The Great Eastern Shipping Company Limited, through its subsidiaries, engages in the shipping and offshore oilfield businesses in India and internationally. The company is involved in the transportation of crude oil, petroleum products, and gas and dry bulk commodities through dry bulk carriers and tankers. As of October 09, 2020, it operated a fleet of 46 vessels comprising 33 tankers, including 11 crude carriers, 17 product tankers, and 5 LPG carriers; and 13 dry bulk carriers with an aggregating 3.70 million dwt. The company also offers offshore oilfield services, which include the ownership and/or operation of offshore supply vessels and mobile offshore drilling rigs. It serves various industries, oil companies, and governments. The Great Eastern Shipping Company Limited was incorporated in 1948 and is based in Mumbai, India.", "currency": "INR", "sector": "Industrials", "industry": "Marine Shipping", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "GLOBOFFS.NS": {"short_name": "GLOBAL OFFSHORE SE", "long_name": "Global Offshore Services Limited", "summary": "Global Offshore Services Limited engages in the charter of offshore support vessels in India, the North Sea, Brazil, and West Africa. Its vessels provide support services to the oil and gas exploration activities, including transporting personnel to rigs/platforms from/to onshore bases; delivering cargo/material to rigs/platforms; anchor handling; and towing of rigs, as well as support services for offshore/underwater construction projects. The company was formerly known as Garware Offshore Services Limited and changed its name to Global Offshore Services Limited in March 2011. Global Offshore Services Limited was incorporated in 1976 and is based in Mumbai, India.", "currency": "INR", "sector": "Industrials", "industry": "Marine Shipping", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "GPPL.NS": {"short_name": "GUJARAT PIPAVAV PO", "long_name": "Gujarat Pipavav Port Limited", "summary": "Gujarat Pipavav Port Limited engages in the construction, operation, and maintenance of port at Pipavav in Gujarat, India. It provides port services, including marine services, berth hire, wharfage, container handling, yard operations, stevedorage, and other services. The company's port handles container cargo, such as cotton, wood pulp, sesame seeds, cattle feeds, agricultural products, ceramic tiles, soda ash, auto parts, spices, capital goods, scrap, water paper, and electronics; bulk and break bulk cargo, such as coal, cement, clinker, fertilizers, steel, iron ore, and salt; and liquid cargo, including LPG, POL, chemicals, veg oil, bitumen, etc., as well as offers roll-on roll-off services. Gujarat Pipavav Port Limited was incorporated in 1992 and is based in Mumbai, India.", "currency": "INR", "sector": "Industrials", "industry": "Marine Shipping", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "SEAMECLTD.NS": {"short_name": "SEAMEC LTD", "long_name": "Seamec Limited", "summary": "Seamec Limited owns and operates multi support vessels for providing support services to offshore oilfields in India and internationally. Its services include vessel management, marine management, dive support, firefighting, subsea construction, ROV support, pipe laying, rescue operations, logistics, mooring and de-mooring, and carnage services. The company also operates bulk carrier vessels for providing bulk carrier services. The company was formerly known as South East Asia Marine Engineering & Construction Limited and changed its name to Seamec Limited in June 2007. Seamec Limited was incorporated in 1986 and is based in Mumbai, India. Seamec Limited is a subsidiary of HAL Offshore Limited.", "currency": "INR", "sector": "Industrials", "industry": "Marine Shipping", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "SHREYAS.NS": {"short_name": "SHREYAS SHIP & LO", "long_name": "Shreyas Shipping and Logistics Limited", "summary": "Shreyas Shipping and Logistics Limited, a shipping company, provides coastal container shipping and transshipment services in India, and internationally. The company's services include movement of cargo in containerized form between Indian ports; collection of cargo from various ports in India and feeding cargo at the transshipment hubs; multimodal logistics; and break bulk cargo services. It also operates a direct EXIM route covering Krishnapatnam, Kattupalli, Tuticorin, Cochin, Kandla, and Jebel Ali ports. As of March 31, 2020, it owned and operated a fleet of 12 vessels with a total capacity of 22,794 TEUs; 2,44,919 GRT; and 3,12,016 DWT. The company was incorporated in 1988 and is headquartered in Mumbai, India. Shreyas Shipping and Logistics Limited is a subsidiary of Transworld Holdings Limited.", "currency": "INR", "sector": "Industrials", "industry": "Marine Shipping", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Navi Mumbai"}}