{
    "CEBBCO.NS": {
        "short_name": "COMMERCIAL ENGINEE",
        "long_name": "Commercial Engineers & Body Builders Co Limited",
        "summary": "Commercial Engineers & Body Builders Co Limited produces and sells vehicle and locomotive bodies in India. The company offers tipper and tanker bodies for the mining and road construction sectors; skip-loaders and garbage-bin collectors for solid waste management; water tanker bodies, light recovery vehicle bodies, and garbage tippers for municipal applications; and troop carrier vehicle bodies, prison van bodies, and water bowser bodies for the defense sector. It also provides load cargo bodies; refrigerator-fitted vehicle bodies and containers; and trailer bodies, including for box trailers, tip trailers, skeletal trailers, and flatbed trailers for goods transportation. In addition, the company offers fire engine bodies, ambulance bodies, and vehicle bodies for the transportation of animals. Further, it is involved in the upgradation and refurbishment of railway wagons; and provision of components for locomotives, BOXNR wagons, and EMU coaches, as well as manufacturing of fabricated support structures, towers, components, and parts for equipment, tankages, rollers, machinery, and plants. The company was founded in 1979 and is headquartered in Jabalpur, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Jabalpur"
    },
    "IRCTC.NS": {
        "short_name": "Indian Rail Tour Corp Ltd",
        "long_name": "Indian Railway Catering & Tourism Corporation Limited",
        "summary": "Indian Railway Catering & Tourism Corporation Limited provides catering and hospitality, Internet ticketing, travel and tourism, and packaged drinking water services in India. The company offers mobile catering services, including on-board catering management services through pantry cars on trains; train side vending contracts on mail/express and superfast trains; and pantry cars re-designing and development services. It is also involved in the management of various static catering units of railways, such as refreshment rooms, Jan Ahaars, and cell kitchens, as well as base kitchens; and eight executive lounges in the railway stations, as well as reclining sofa, meals in buffet service, Wi-Fi internet services, shower facilities, and others. In addition, the company operates and maintains railway retiring rooms; operates two budget hotels under the Rail Yatri Niwas name; and offers e-catering, Internet ticketing, and accommodation services. Further, it operates irctctourism.com, a tourism portal; and provides rail-based tourism services comprising rail tour packages, special tourist trains, special interest trains, Buddhist circuit tourist trains, majestic tourist trains, and Maharajas' Express luxury train services, as well as train, coach, and saloon charter services. Additionally, the company offers packaged drinking water under the Rail Neer name; air ticket booking and travel insurance services; and cruise packages and air charter services. The company was founded in 1999 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "TWL.NS": {
        "short_name": "TITAGARH WAGONS",
        "long_name": "Titagarh Wagons Limited",
        "summary": "Titagarh Wagons Limited primarily manufactures and sells railway wagons and coaches in India and internationally. The company provides various wagons, such as ballast, flat, bi-lateral unloading, car carrying, hopper, high sided open type, powder, military, stainless steel, shimns, break van, and tank wagons. It also offers foundry products, including bogies, couplers, and crossings; tractors; bailey bridges; and nuclear biological shelters and other defense related products. In addition, the company provides heavy earth moving and mining equipment, as well as construction cranes for plant erection and maintenance, handling at ports, etc. Further, it engages in the ship building activities. Titagarh Wagons Limited was incorporated in 1997 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    }
}