{
    "NITINFIRE.NS": {
        "short_name": "NITIN FIRE PROTECT",
        "long_name": "Nitin Fire Protection Industries Limited",
        "summary": "Nitin Fire Protection Industries Limited manufactures and sells firefighting equipment under the NITIE brand in India and internationally. The company provides ABC, DCP, CO2, clean agent, foam, automatic modular, water, and K type fire extinguishers; gaseous fire suppression systems; kitchen fire suppression systems; fire detection and alarm systems; fire sprinkler systems; vehicle protection systems; fire pumps; foam equipment and compounds; wet and dry riser systems; emergency luminaires; and special hazards systems. It also offers turnkey solutions, including procurement, design, system integration, commissioning, and installation of firefighting systems. The company exports its products to the United Arab Emirates, South Asia, and European countries. The company was formerly known as Nitin Industries and changed its name to Nitin Fire Protection Industries Limited in 1995. Nitin Fire Protection Industries Limited was founded in 1980 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400076",
        "website": "http://www.nitinfire.com",
        "market_cap": "Nano Cap"
    },
    "SIS.NS": {
        "short_name": "SIS LTD",
        "long_name": "SIS Limited",
        "summary": "SIS Limited, together with its subsidiaries, engages in rendering security and related services company in India, Australia, Singapore, and New Zealand. The company operates through three business groups: Security Services (India), Security Services (International), and Facility Management. Its security and related services include manned guarding, training, physical security, and paramedic and emergency response services; loss prevention, asset protection, and mobile patrolling services; cash logistics services, including cash-in-transit, ATM cash replenishment, and precious items and bullion transportation services; and alarm monitoring and response services, such as trading and installation of electronic security devices and systems. The company also provides facility management services, which include cleaning, house-keeping, pest control management, catering, office support, guest house and service apartment management, mechanical and electrical maintenance, plumbing, preventive maintenance, and repairing, as well as heating, ventilation, and air-conditioning services. It serves power, telecom, transportation, aviation, ports, logistics, real estate and townships, educational institutions, and healthcare establishments. The company was formerly known as Security and Intelligence Services (India) Limited and changed its name to SIS Limited in January 2021. SIS Limited was founded in 1985 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110020",
        "website": "http://www.sisindia.com",
        "market_cap": "Small Cap"
    },
    "ZICOM.NS": {
        "short_name": "ZICOM ELECTRONIC S",
        "long_name": "Zicom Electronic Security Systems Limited",
        "summary": "Zicom Electronic Security Systems Limited, together with its subsidiaries, manufactures, markets, distributes, sells, installs, and monitors electronic security systems, and gadgets and equipment in India. Its products include e-surveillance equipment consisting of CCTV cameras, monitors, DVRs/NVRs, and other accessories; fire equipment, such as sensors and fire extinguishers; access control systems, including proximity/biometric based locks and other accessories; and home safety equipment, such as video door phones and home intrusion alarm. The company also offers various services, such as daily health checkup equipment, replacement of faulty equipment, and regular preventive maintenance; alarm monitoring services, which include installation of various sensors, such as vibration sensors, motion sensors, heat/temperature sensors, unidentified object sensors, shutter up/down sensors, etc.; live monitoring of sites based on trigger generated by various sensors; and employee behavior monitoring, customer behavior monitoring, footfall counting, etc. Zicom Electronic Security Systems Limited was incorporated in 1994 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400063",
        "website": "http://www.zicom.com",
        "market_cap": "Nano Cap"
    }
}