{
    "NECCLTD.NS": {
        "short_name": "NORTH EASTERN CARR",
        "long_name": "North Eastern Carrying Corporation Limited",
        "summary": "North Eastern Carrying Corporation Limited provides transportation and logistics services in India, Nepal, Bhutan, and Bangladesh. The company books small parcels, as well as full truck load, project, and over dimensional consignments. It also offers containerized movement of cargo, packing and moving, warehousing, and third party logistics and storage facilities. The company operates through a network of approximately 250 branches. The company was founded in 1984 and is based in Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Delhi",
        "zipcode": "110006",
        "website": "http://www.neccgroup.com",
        "market_cap": "Nano Cap"
    },
    "VRLLOG.NS": {
        "short_name": "VRL LOGISTICS LTD",
        "long_name": "VRL Logistics Limited",
        "summary": "VRL Logistics Limited operates as a logistics and transport company. The company operates through four segments: Goods Transport, Bus Operations, Sale of Power, and Transport of Passengers by Air. The Goods Transport segment offers services for the transportation of goods using a range of road transportation solutions, including less than full truck load and full truck load for customers across 22 states and 5 union territories in India. This segment also provides courier business for the transportation of small parcels and documents through multi model solutions. The Bus Operations segment provides services of transportation solutions through buses in the states of Karnataka, Maharashtra, Andhra Pradesh, Tamil Nadu, Gujarat, Rajasthan, and Goa through its fleet of approximately 362 buses/coaches. The Sale of Power segment operates a wind farm that consists of wind turbine generators with a capacity of 1.25 MW. The Transport of Passengers by Air segment offers services for the transportation of passengers by air to the individuals and corporate representatives. The company was formerly known as Vijayanand Roadlines Ltd. and changed its name to VRL Logistics Limited in August 2006. VRL Logistics Limited was founded in 1976 and is based in Hubli, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hubli",
        "zipcode": "580029",
        "website": "http://www.vrllogistics.com",
        "market_cap": "Small Cap"
    }
}