{
    "2N9.F": {
        "short_name": "JTC PLC  LS-,01",
        "long_name": "JTC PLC",
        "summary": "JTC PLC provides fund, corporate, and private wealth services to institutional and private clients worldwide. It operates through two segments, Institutional Client Services and Private Client Services. The company offers fund services for the administration of various listed and unlisted funds in a range of asset classes, including real estate, private equity, renewables, hedge, debt, and other administration services. It also provides company secretarial and administration services to small and medium sized enterprises, public companies, multinationals, sovereign wealth funds, and private offices. In addition, the company offers private wealth services, including the formation and administration of vehicles, such as trusts, companies, and partnerships on behalf of high net worth individuals and ultra-high net worth individuals, and private and family offices. JTC PLC was founded in 1987 and is headquartered in St Helier, Jersey.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Jersey",
        "city": "Saint Helier"
    },
    "EJF0.L": {
        "short_name": "EJF INVESTMENTS LTD 2025 ZDP 10",
        "long_name": "EJF Investments Limited",
        "summary": "EJF Investments Limited is a principal investment firm. The firm seeks to invest in financial services sector with a focus in structured debt and equity, loans, bonds, preference shares, convertible notes and private equity. It considers investments domiciled in the United States, the United Kingdom and Europe. EJF Investments Limited is based in Jersey, Channel Island.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Jersey",
        "city": "Saint Helier"
    },
    "EJFI.L": {
        "short_name": "EJF INVESTMENTS LTD ORD NPV",
        "long_name": "EJF Investments Limited",
        "summary": "EJF Investments Limited is a principal investment firm. The firm seeks to invest in financial services sector with a focus in structured debt and equity, loans, bonds, preference shares, convertible notes and private equity. It considers investments domiciled in the United States, the United Kingdom and Europe. EJF Investments Limited is based in Jersey, Channel Island.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Jersey",
        "city": "Saint Helier"
    },
    "EJFZ.L": {
        "short_name": "EJF INVESTMENTS LTD 2022 ZDP NP",
        "long_name": "EJF Investments Limited",
        "summary": "EJF Investments Limited is a principal investment firm. The firm seeks to invest in financial services sector with a focus in structured debt and equity, loans, bonds, preference shares, convertible notes and private equity. It considers investments domiciled in the United States, the United Kingdom and Europe. EJF Investments Limited is based in Jersey, Channel Island.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Jersey",
        "city": "Saint Helier"
    },
    "EMG.L": {
        "short_name": "MAN GROUP PLC ORD USD0.03428571",
        "long_name": "Man Group plc",
        "summary": "Man Group plc is a publicly owned investment manager. The firm provides long-only and alternative investment management services worldwide. It offers a range of liquid investment products and solutions, which include quantitative, multi-manager and discretionary investment styles, and span across various asset classes, like equity, real estate, currency, credit, volatility, and commodities. The firm distributes its products and solutions directly to institutions and to private investors through a global network of intermediaries. Man Group plc was founded in 1783 and is based in St. Helier, Jersey with an additional office in London, United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Jersey",
        "city": "St Helier"
    },
    "JTC.L": {
        "short_name": "JTC PLC ORD GBP0.01",
        "long_name": "JTC PLC",
        "summary": "JTC PLC provides fund, corporate, and private wealth services to institutional and private clients worldwide. It operates through two segments, Institutional Client Services and Private Client Services. The company offers fund services for the administration of various listed and unlisted funds in a range of asset classes, including real estate, private equity, renewables, hedge, debt, and other administration services. It also provides company secretarial and administration services to small and medium sized enterprises, public companies, multinationals, sovereign wealth funds, and private offices. In addition, the company offers private wealth services, including the formation and administration of vehicles, such as trusts, companies, and partnerships on behalf of high net worth individuals and ultra-high net worth individuals, and private and family offices. JTC PLC was founded in 1987 and is headquartered in St Helier, Jersey.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Jersey",
        "city": "Saint Helier"
    },
    "TEAM.L": {
        "short_name": "TEAM PLC ORD NPV",
        "long_name": "TEAM plc",
        "summary": "TEAM plc provides portfolio management services to private clients, trusts, and charities. Its services cover discretionary and advisory investment management. The company is based in Saint Helier, Jersey.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Jersey",
        "city": "Saint Helier"
    },
    "TMT.L": {
        "short_name": "TMT INVESTMENTS PLC ORD NPV",
        "long_name": "TMT Investments PLC",
        "summary": "TMT Investments PLC is a venture capital and private equity firm specializing in startups, small and mid-sized companies. It does invest in pre-growth projects. It prefers to invest in technology, media, and telecommunications (TMT) sectors. It seeks to invest in high-growth technology companies across a number of core specialist sectors. It seeks to invest in mobile software applications, online travel services in emerging markets, business SaaS tools, Social discovery shopping, e-payment systems, e-commerce, big data, cloud solutions, social networking, and internet-based companies. The firm is not geographically restricted in its investments. It considers investments of at least $0.15 million. For private companies, the firm typically invests at least USD$ 0.25 million. For pre-growth stage it invests between $0.25 million and $1 million and for growth stage it invests between $0.25 million and $3 million. The firm typically stays invested from two to four years. It prefers to realize its investments through the sale or merger of a company; the sale of securities of a company by means of public or private offerings; or the disposal of public equity investments through the stock exchanges on which they are listed. For private companies, the firm invests in growth and pre-growth stages in small and mid-sized companies. It prefers to invest in private companies seeking capital for growth and development, consolidation or acquisition, or as a pre-IPO financing. It prefers to invest in the form of equity and convertible loans. The firm prefers to secure at least blocking stakes and board representation in the private companies it invests in. It considers equity investments in lower than blocking stakes only where it sees ways to increase the stakes to blocking or controlling stakes at a later date. The firm also seeks to invest in publicly traded equities which have securities listed on a stock exchange or over-the-counter market and also provides convertible loans. These investments may be in combination with additional debt or equity-related financing, and with other value added financial and/or strategic investors. TMT Investments PLC was established in 2010 and is based in Saint Helier, Jersey.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Jersey",
        "city": "Saint Helier"
    }
}