{
    "1591.TWO": {
        "short_name": "INMAX HOLDING CO LTD",
        "long_name": "Inmax Holding Co., Ltd.",
        "summary": "Inmax Holding Co., Ltd. manufactures and sells a range of fasteners primarily in the Southeast Asia region. It offers pneumatic and industrial nails; coil roofing nails for roofing, asphalt and fiberglass shingles, lathing, insulation board, vinyl siding, fiber cement roofing and siding, and waterproof tar paper applications; coil nails for use in wooden pallets and wooden boxes assembly, siding, decking, panel sheathing, and fencing; and staples for furniture and wooden box manufacturing, as well as for fastening works, such as architectural applications. The company also provides brads for use in finish, trim, drawers, and cabinets; and plastic strip and paper tape nails for framing, sheathing, sub flooring, roof decking, and exterior decks. Inmax Holding Co., Ltd. was incorporated in 2009 and is headquartered in George Town, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "city": "George Town"
    },
    "2236.TW": {
        "short_name": "PATEC PRECISION INDUSTRY CO LTD",
        "long_name": "Patec Precision Industry Co., Ltd.",
        "summary": "Patec Precision Industry Co., Ltd., together with its subsidiaries, manufactures and sells press machines and parts for automobiles and motorcycles in Singapore, China, Indonesia, and Europe. It provides motorcycle and automobile safety system components, such as door lock parts, seat parts, brake disc shock absorbers, flanges, exhaust system hooks, clutch, and other related safety products, as well as processes automobile components. The company also offers medical device and equipment; and sells of manipulator applications. Patec Precision Industry Co., Ltd. was founded in 1992 and is headquartered in George Town, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "city": "George Town"
    },
    "2637.TW": {
        "short_name": "WISDOM MARINE LINES CO LIMITED",
        "long_name": "Wisdom Marine Lines Co., Limited",
        "summary": "Wisdom Marine Lines Co., Limited, together with its subsidiaries, primarily provides marine cargo transportation services in the Netherlands, Japan, Singapore, Denmark, Hong Kong, and internationally. It also offers vessel management and maintenance, vessel chartering, vessel leasing, and shipping agency and management services. The company acquires, operates, and manages dry bulk vessels with a focus on the handysize sector. It operates a fleet of 129 vessels that include bulk carriers, log carriers, tween-deckrs, multi-purpose vessels, RORO ships, and container ships of various sizes. Wisdom Marine Lines Co., Limited was founded in 1999 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "2939.TW": {
        "short_name": "KAYEE INTERNATIONAL GROUP CO LT",
        "long_name": "Kayee International Group Co., Ltd",
        "summary": "Kayee International Group Co., Ltd, through its subsidiaries, develops, manufactures, and sells body care products, household goods, sports equipment, electronic and electrical appliances, and kitchenware products. The company offers health and beauty life products, including leggings, bras, pillows, wireless TV hearing earphones, briefs, slim shapers, and skirts; and outdoor living products, such as multi tools flashlight, rollers, lanterns, solar lights, air fresheners, infrared sensor lights, ironing devices, motion sensor solar power lights, moving flame candles, solar LED ground spot lights, stainless steel solar gutter lights, turbo sweepers, expandable hoses, spin products, and star lasers. It also provides fitness products comprising body shapers, torso training products, and jumping fitness products; appliances that include smokeless grills, air wave fryers, wall heaters, rice cookers with steamers, and USB rechargeable vacuum food sealer; and kitchen products. The company sells its products through direct TV channels, TV shopping channels, retail stores, and mail order/Internet sales channels in Europe, the Americas, Asia, and internationally. Kayee International Group Co., Ltd was founded in 2015 and is headquartered in Grand Cayman, Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "4552.TW": {
        "short_name": "LIDA HOLDINGS LIMITED",
        "long_name": "Lida Holdings Limited",
        "summary": "Lida Holdings Limited, together with its subsidiaries, designs, manufactures, and sells air compressors, electric welders, and power tools. It offers piston, screw, and scroll air compressors used in the medical, food, mining, chemical, electronic power, building materials, automobiles, steel, furniture, machinery manufacturing, and other industries. The company provides its products under the Lida, Luowei, and Eagleland brands in China, Australia, Korea, Turkey, Malaysia, South Africa, France, the United Kingdom, Belgium, Indonesia, and internationally. Lida Holdings Limited was founded in 1993 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "4571.TW": {
        "short_name": "KHGEARS INTERNATIONAL LTD",
        "long_name": "Khgears International Limited",
        "summary": "Khgears International Limited researches, develops, manufactures, and sells gears and gearboxes in Asia, the United States, and Europe. It offers precision gears, such as spiral bevel and cylindrical gears, turbine worms, and synchronous belt wheels; precision hardware products, including camshafts, hammers, and anvils; planetary products, corners, and turbine worm gearboxes; and cup and top hat type products, and integrated harmonic drives. The company's products are primarily used in power and garden tools, industrial sewing machines, yacht industries, automobiles, medical machinery equipment, and industrial robots. Khgears International Limited was founded in 2014 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "5223.TWO": {
        "short_name": "ANLI INTERNATIONAL CO LTD",
        "long_name": "Anli International Co., Ltd.",
        "summary": "Anli International Co., Ltd. primarily engages in the development, production, assembly, and sale of various precision metal stamping and magnesium aluminum die casting in China and Taiwan. The company is also involved in the design, research, and development of electronic components, vehicle components, new metal materials, machine parts, communication equipment, and computer software; manufacture of fine blanking die products; inductance components; metal finishing activities; and installation of automated equipment, as well as in CNC processing business.It also provides automotive products, optical communication products, vision system application products, household products, and other products. The company's stamped and cast metallic parts and components are used in notebook PCs, tablet PCs, desktop PCs, cell phones, wearable devices, internet communications, home appliances, and daily items. It primarily serves the computers, communications, and consumer electronics industries. The company was founded in 2010 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "5281.TWO": {
        "short_name": "STRONGLED LIGHTING SYSTEM CO LT",
        "long_name": "StrongLED Lighting Systems (Cayman) Co., Ltd.",
        "summary": "StrongLED Lighting Systems (Cayman) Co., Ltd., an investment holding, researches, develops, manufactures, and sells LED lighting equipment in China. The company offers outdoor LED lighting products, including LED flood lights, linear lights, dot pixel lights, and in-ground/underwater lights; and indoor LED lighting products, such as LED wall washers, wall grazers, linear lights, flexible strips, downlights, dot pixel lights, and module lights, as well as smart lighting products, panel lights, and pendant lights. It also provides LED lighting control systems and software; intelligent lighting controllers, touch control panels, and LED lighting circuit expanders; and LED power supplies for indoor and outdoor lighting systems. StrongLED Lighting Systems (Cayman) Co., Ltd. was founded in 2002 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "5543.TWO": {
        "short_name": "BUIMA GROUP INC",
        "long_name": "Buima Group Inc.",
        "summary": "Buima Group Inc. engages in the research, design, development, production, and sale of metal building materials in China, rest of Asia, Europe, and internationally. The company offers metal ceiling, such as corrugated board; grid, juno, and tube ceiling; and metal mesh board, square ceiling system, and the clip in ceiling system. It also provides various ceiling grid, such as premium, cliq, buima line, smart, deco, V-grid, eco, and a-line. In addition, the company offers Xing Li, Xing Chai, and Xingde compartment systems, as well as data room decorative wall panel, metal compartment, SD steel door, decorative metal wall panel, office compartment, and glass compartment systems. Further, it engages in punching technology, high-precision leveling technology, and commodity development activities. The company's products are used in medical and biology medicines, aerospace science and technology, cloud data center, and public construction and commercial space applications, as well as engineering, commercial office buildings, and electronic factories applications. The company was founded in 2009 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "8466.TW": {
        "short_name": "MJ INTERNATIONAL CO LTD",
        "long_name": "M.J. International Co., Ltd.",
        "summary": "M.J. International Co., Ltd., together with its subsidiaries, engages in the development, production, and sales of luxury vinyl tile (LVT) floors. The company offers rigid core, LVT click, non-polyvinyl chloride, LVT dry back wood and stone design, and LVT dry back carpet and exclusive design products for commercial and residential customers. It also engages in the production and sales of titles, and decoration and construction materials. The company operates in Europe, North America, Mainland China, Taiwan, and internationally. M.J. International Co., Ltd. was founded in 1982 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "EJH": {
        "short_name": "E-Home Household Service Holdin",
        "long_name": "E-Home Household Service Holdings Limited",
        "summary": "E-Home Household Service Holdings Limited operates as an integrated household service company in the People's Republic of China. The company operates through three segments: Installation and Maintenance, Housekeeping, and Senior Care Services. It engages in the delivery, installation, and repair and maintenance of home appliances, such as refrigerators, stoves, air conditioners, water heaters, and washing machines; and provision of home-moving, house cleaning, and nanny and maternity matron services, as well as senior care services through its Website and WeChat platform. The company also offers its services through offline channels. Its customers primarily include individuals and families. E-Home Household Service Holdings Limited was incorporated in 2018 and is headquartered in Grand Cayman, Cayman Islands.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "NM-PH": {
        "short_name": "Navios Maritime Holdings Inc. S",
        "long_name": "Navios Maritime Holdings Inc.",
        "summary": "Navios Maritime Holdings Inc. operates as a seaborne shipping and logistics company in North America, Australia, Europe, Asia, South America, and internationally. The company operates through two segments, Dry Bulk Vessel Operations and Logistics Business. It focuses on the transportation and transshipment of dry bulk commodities, including iron ores, coal, and grains. The Dry Bulk Vessel Operations segment engages in the transportation and handling of bulk cargoes through the ownership, operation, and trading of vessels and freight. This segment charters its vessels to trading houses, producers, and government-owned entities. The Logistics Business segment operates ports and transfer station terminals, as well as upriver transport facilities in the Hidrovia region; and handles vessels, barges, push boats, and cabotage business. This segment provides its integrated transportation, storage, and related services through its port facilities, the fleet of dry and liquid cargo barges, and product tankers to mineral and grain commodity providers, as well as to users of refined petroleum products. As of April 21, 2021, the company's fleet consisted of 45 vessels totaling 5.0 million deadweight tons. Navios Maritime Holdings Inc. is headquartered in Grand Cayman, Cayman Islands.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "NM": {
        "short_name": "Navios Maritime Holdings Inc.",
        "long_name": "Navios Maritime Holdings Inc.",
        "summary": "Navios Maritime Holdings Inc. operates as a seaborne shipping and logistics company in North America, Australia, Europe, Asia, South America, and internationally. The company operates through two segments, Dry Bulk Vessel Operations and Logistics Business. It focuses on the transportation and transshipment of dry bulk commodities, including iron ores, coal, and grains. The Dry Bulk Vessel Operations segment engages in the transportation and handling of bulk cargoes through the ownership, operation, and trading of vessels and freight. This segment charters its vessels to trading houses, producers, and government-owned entities. The Logistics Business segment operates ports and transfer station terminals, as well as upriver transport facilities in the Hidrovia region; and handles vessels, barges, push boats, and cabotage business. This segment provides its integrated transportation, storage, and related services through its port facilities, the fleet of dry and liquid cargo barges, and product tankers to mineral and grain commodity providers, as well as to users of refined petroleum products. As of April 21, 2021, the company's fleet consisted of 45 vessels totaling 5.0 million deadweight tons. Navios Maritime Holdings Inc. is headquartered in Grand Cayman, Cayman Islands.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "SEMUF": {
        "short_name": "SIEM INDUSTRIES INC",
        "long_name": "Siem Industries S.A.",
        "summary": "Siem Industries Inc., through its subsidiaries, operates in the oil and gas services industry and renewable energy sector worldwide. It operates through Offshore Support Vessels, Reefer Vessels and Car Carriers, Potash production, RoRo vessels, Scientific Core-Drilling, and Corporate and Other. The company provides subsea engineering and construction services; and offshore installation services, as well as related repair and refurbishment services. It also owns and operates fleet of 8 reefer vessels engaged in the refrigerated transportation of fruits and other perishable products; and engages in the provision of car and roll-on/roll-off transportation solutions and capabilities through partnerships with car manufacturers, shipping lines, and logistics companies. In addition, the company is involved in the mining of potash, which is used for fertilizer production, bischofite for the construction industry, magnesium chloride for de-icing, and other materials. Further, it offers finance services, including loans and guarantees, specialist credit advisory services, and investment services, as well as private asset-based financing. The company was formerly known as Norex Industries Inc. and changed its name to Siem Industries Inc. in 1998. Siem Industries Inc. was incorporated in 1980 and is based in George Town, the Cayman Islands.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Cayman Islands",
        "city": "George Town"
    }
}