{"2236.TW": {"short_name": "PATEC PRECISION INDUSTRY CO LTD", "long_name": "Patec Precision Industry Co., Ltd.", "summary": "Patec Precision Industry Co., Ltd., together with its subsidiaries, manufactures and sells press machines and parts for automobiles and motorcycles in Singapore, China, Indonesia, and Europe. It provides motorcycle and automobile safety system components, such as door lock parts, seat parts, brake disc shock absorbers, flanges, exhaust system hooks, clutch, and other related safety products, as well as processes automobile components. The company also offers medical device and equipment; and sells of manipulator applications. Patec Precision Industry Co., Ltd. was founded in 1992 and is headquartered in George Town, the Cayman Islands.", "currency": "TWD", "sector": "Industrials", "industry": "Specialty Industrial Machinery", "exchange": "TAI", "market": "tw_market", "country": "Cayman Islands", "city": "George Town"}, "2939.TW": {"short_name": "KAYEE INTERNATIONAL GROUP CO LT", "long_name": "Kayee International Group Co., Ltd", "summary": "Kayee International Group Co., Ltd, through its subsidiaries, develops, manufactures, and sells body care products, household goods, sports equipment, electronic and electrical appliances, and kitchenware products. The company offers health and beauty life products, including leggings, bras, pillows, wireless TV hearing earphones, briefs, slim shapers, and skirts; and outdoor living products, such as multi tools flashlight, rollers, lanterns, solar lights, air fresheners, infrared sensor lights, ironing devices, motion sensor solar power lights, moving flame candles, solar LED ground spot lights, stainless steel solar gutter lights, turbo sweepers, expandable hoses, spin products, and star lasers. It also provides fitness products comprising body shapers, torso training products, and jumping fitness products; appliances that include smokeless grills, air wave fryers, wall heaters, rice cookers with steamers, and USB rechargeable vacuum food sealer; and kitchen products. The company sells its products through direct TV channels, TV shopping channels, retail stores, and mail order/Internet sales channels in Europe, the Americas, Asia, and internationally. Kayee International Group Co., Ltd was founded in 2015 and is headquartered in Grand Cayman, Cayman Islands.", "currency": "TWD", "sector": "Industrials", "industry": "Conglomerates", "exchange": "TAI", "market": "tw_market", "country": "Cayman Islands", "city": "Grand Cayman"}, "4552.TW": {"short_name": "LIDA HOLDINGS LIMITED", "long_name": "Lida Holdings Limited", "summary": "Lida Holdings Limited, together with its subsidiaries, designs, manufactures, and sells air compressors, electric welders, and power tools. It offers piston, screw, and scroll air compressors used in the medical, food, mining, chemical, electronic power, building materials, automobiles, steel, furniture, machinery manufacturing, and other industries. The company provides its products under the Lida, Luowei, and Eagleland brands in China, Australia, Korea, Turkey, Malaysia, South Africa, France, the United Kingdom, Belgium, Indonesia, and internationally. Lida Holdings Limited was founded in 1993 and is headquartered in Grand Cayman, the Cayman Islands.", "currency": "TWD", "sector": "Industrials", "industry": "Specialty Industrial Machinery", "exchange": "TAI", "market": "tw_market", "country": "Cayman Islands", "city": "Grand Cayman"}, "4571.TW": {"short_name": "KHGEARS INTERNATIONAL LTD", "long_name": "Khgears International Limited", "summary": "Khgears International Limited researches, develops, manufactures, and sells gears and gearboxes in Asia, the United States, and Europe. It offers precision gears, such as spiral bevel and cylindrical gears, turbine worms, and synchronous belt wheels; precision hardware products, including camshafts, hammers, and anvils; planetary products, corners, and turbine worm gearboxes; and cup and top hat type products, and integrated harmonic drives. The company's products are primarily used in power and garden tools, industrial sewing machines, yacht industries, automobiles, medical machinery equipment, and industrial robots. Khgears International Limited was founded in 2014 and is based in Grand Cayman, the Cayman Islands.", "currency": "TWD", "sector": "Industrials", "industry": "Tools & Accessories", "exchange": "TAI", "market": "tw_market", "country": "Cayman Islands", "city": "Grand Cayman"}, "SEMUF": {"short_name": "SIEM INDUSTRIES INC", "long_name": "Siem Industries S.A.", "summary": "Siem Industries Inc., through its subsidiaries, operates in the oil and gas services industry and renewable energy sector worldwide. It operates through Offshore Support Vessels, Reefer Vessels and Car Carriers, Cable-Lay for Offshore Wind Farms, Scientific Core-Drilling, Shipbuilding, Potash-Mining, and Corporate and Other segments. The company provides subsea engineering and construction services; and inner-array and export cables installation service for the offshore renewable energy market, as well as related repair and maintenance services. It also owns and operates fleet to charterers and shippers of fruit and other perishable food; and engages in the provision of car and roll-on/roll-off transportation solutions and capabilities through partnerships with car manufacturers, shipping lines, and logistics companies. In addition, the company is involved in the mining of potash, which is used for fertilizer production, bischofite for the construction industry, magnesium chloride for de-icing, and other materials. Further, it offers finance services, including loans and guarantees, specialist credit advisory services, and investment services. The company was formerly known as Norex Industries Inc. and changed its name to Siem Industries Inc. in 1998. Siem Industries Inc. was founded in 1980 and is based in George Town, the Cayman Islands.", "currency": "USD", "sector": "Industrials", "industry": "Marine Shipping", "exchange": "PNK", "market": "us_market", "country": "Cayman Islands", "city": "George Town"}}