{
    "2236.TW": {
        "short_name": "PATEC PRECISION INDUSTRY CO LTD",
        "long_name": "Patec Precision Industry Co., Ltd.",
        "summary": "Patec Precision Industry Co., Ltd., together with its subsidiaries, manufactures and sells press machines and parts for automobiles and motorcycles in Singapore, China, Indonesia, and Europe. It provides motorcycle and automobile safety system components, such as door lock parts, seat parts, brake disc shock absorbers, flanges, exhaust system hooks, clutch, and other related safety products, as well as processes automobile components. The company also offers medical device and equipment; and sells of manipulator applications. Patec Precision Industry Co., Ltd. was founded in 1992 and is headquartered in George Town, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KYI-9005",
        "website": "http://www.patec-intl.com",
        "market_cap": "Nano Cap"
    },
    "4552.TW": {
        "short_name": "LIDA HOLDINGS LIMITED",
        "long_name": "Lida Holdings Limited",
        "summary": "Lida Holdings Limited, together with its subsidiaries, designs, manufactures, and sells air compressors, electric welders, and power tools. It offers piston, screw, and scroll air compressors used in the medical, food, mining, chemical, electronic power, building materials, automobiles, steel, furniture, machinery manufacturing, and other industries. The company provides its products under the Lida, Luowei, and Eagleland brands in China, Australia, Korea, Turkey, Malaysia, South Africa, France, the United Kingdom, Belgium, Indonesia, and internationally. Lida Holdings Limited was founded in 1993 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1103",
        "website": "http://www.lidaholdings.com",
        "market_cap": "Micro Cap"
    }
}