{
    "1591.TWO": {
        "short_name": "INMAX HOLDING CO LTD",
        "long_name": "Inmax Holding Co., Ltd.",
        "summary": "Inmax Holding Co., Ltd. manufactures and sells a range of fasteners primarily in the Southeast Asia region. It offers pneumatic and industrial nails; coil roofing nails for roofing, asphalt and fiberglass shingles, lathing, insulation board, vinyl siding, fiber cement roofing and siding, and waterproof tar paper applications; coil nails for use in wooden pallets and wooden boxes assembly, siding, decking, panel sheathing, and fencing; and staples for furniture and wooden box manufacturing, as well as for fastening works, such as architectural applications. The company also provides brads for use in finish, trim, drawers, and cabinets; and plastic strip and paper tape nails for framing, sheathing, sub flooring, roof decking, and exterior decks. Inmax Holding Co., Ltd. was incorporated in 2009 and is headquartered in George Town, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-1002",
        "website": "http://www.inmax-fasteners.com",
        "full_time_employees": null
    },
    "4571.TW": {
        "short_name": "KHGEARS INTERNATIONAL LTD",
        "long_name": "Khgears International Limited",
        "summary": "Khgears International Limited researches, develops, manufactures, and sells gears and gearboxes in Asia, the United States, and Europe. It offers precision gears, such as spiral bevel and cylindrical gears, turbine worms, and synchronous belt wheels; precision hardware products, including camshafts, hammers, and anvils; planetary products, corners, and turbine worm gearboxes; and cup and top hat type products, and integrated harmonic drives. The company's products are primarily used in power and garden tools, industrial sewing machines, yacht industries, automobiles, medical machinery equipment, and industrial robots. Khgears International Limited was founded in 2014 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.khgears.com",
        "full_time_employees": null
    }
}