{
    "1C3.SI": {
        "short_name": "$ Samurai",
        "long_name": "Samurai 2K Aerosol Limited",
        "summary": "Samurai 2K Aerosol Limited manufactures, distributes, and markets aerosol coatings for the automotive refinishing and refurbishing industry. The company operates through three segments: Paint Â\u0096 Standard; Paint Â\u0096 Premium; and Maintenance and Others. The Paint Â\u0096 Standard segment offers standard color aerosol spray paint products. The Paint Â\u0096 Premium segment provides fluorescent, candy, and metallic color aerosol spray paint; high temperature aerosol spray paint; primer; epoxy; and 2K products, as well as multi-color one aerosol spray paint products. The Maintenance and Others segment offers cosmetic products, such as metal and paint polish; and maintenance products, including engine degreasers, chain oils, and carburetor and gasket cleaners, as well as brake cleaners, spray greases, motorcycle shampoos, tire shining products, and tire inflators. The company sells its products under the Samurai, Kurobushi, Khameleon, Canbrush, Ninjutsu, Geiji, CanArt, and Bushido brand names. It has operations in Malaysia, Indonesia, Thailand, the Philippines, Vietnam, Cambodia, the United Kingdom, the United States, Singapore, and India. Samurai 2K Aerosol Limited was founded in 1997 and is headquartered in Skudai, Malaysia.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Malaysia",
        "state": null,
        "city": "Sekudai",
        "zipcode": "81120",
        "website": "http://www.samurai2kaerosol.com",
        "market_cap": "Small Cap"
    },
    "1J7.SI": {
        "short_name": "$ Jawala",
        "long_name": "Jawala Inc.",
        "summary": "Jawala Inc., a forest resource company, focuses on industrial tree plantations located in Sabah. The company engages in the management of forestry resources, and the planting and extraction of timber, as well as cultivation of industrial tree plantations. It is also involved in the harvesting, processing, distribution, and sale of timber. The company was incorporated in 2017 and is headquartered in Kota Kinabalu, Malaysia.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kota Kinabalu",
        "zipcode": "88300",
        "website": "http://jawalainc.com",
        "market_cap": "Small Cap"
    },
    "41T.SI": {
        "short_name": "$ GCCP",
        "long_name": "GCCP Resources Limited",
        "summary": "GCCP Resources Limited, an investment holding company, engages in quarrying, processing, and selling limestone in Malaysia and Indonesia. The company produces and sells crushed calcium carbonate of various particle sizes to clients for the manufacture of precipitated calcium carbonate (PCC). It owns Gridland Quarry and Hyper Act Quarries that are located in Ipoh, in the state of Perak, Malaysia. The company was formerly known as Ultimate Prime Ventures Limited and changed its name to GCCP Resources Limited in July 2014. GCCP Resources Limited was incorporated in 2013 and is based in Petaling Jaya, Malaysia.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Malaysia",
        "state": null,
        "city": "Petaling Jaya",
        "zipcode": "47810",
        "website": "http://www.gccpresources.com",
        "market_cap": "Small Cap"
    },
    "43E.SI": {
        "short_name": "$ VCPlus",
        "long_name": "VCPlus Limited",
        "summary": "VCPlus Limited, an investment holding company, engages in the exploration, mining, production, and sale of gold properties in Malaysia. It operates through Gold mining, Granite Business, and Corporate & Others segments. The company is also involved in the exploration, mining, quarry extraction, processing, and sale of granite products and dimension stone granites, as well as marble, aggregates, and related products. Its properties include the Lubuk Mandi and Bukit Chetai mines located in Terengganu, Malaysia. In addition, the company undertakes architectural stone and interior fit-out contracts; provides gold and related mineral mining consultancy services; offers business and management consultancy services; and operates as a contractor of natural resources, as well as undertakes general trading activities. The company was formerly known as Anchor Resources Limited and changed its name to VCPlus Limited in April 2021. VCPlus Limited was founded in 2011 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "55200",
        "website": "http://www.angkaalam.com",
        "market_cap": "Small Cap"
    },
    "GRPEF": {
        "short_name": "GRAPHENE NANOCHEM PLC",
        "long_name": "Graphene NanoChem plc",
        "summary": "Graphene NanoChem plc, a graphene commercialization company, designs, formulates, manufactures, and markets intermediate and performance chemicals, and advanced nano-materials. It offers oilfield chemicals, such as drilling fluids and lubricants for oil and gas industry; and advance materials, including nanofluids, nanocomposites, and conductive inks. The company was founded in 2006 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "60000",
        "website": "http://www.graphenenanochem.com",
        "market_cap": "Small Cap"
    },
    "NINK": {
        "short_name": "NAMI CORP",
        "long_name": "NAMI Corp.",
        "summary": "NAMI Corp., through its subsidiaries, engages in the acquisition, exploration, discovery, development, mining, and production of mineral resources and properties in Malaysia. The group primarily explores for sea sand, river sand, and granite. It is also involved in the bauxite financing and trading activities. The company was incorporated in 2012 and is based in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "59200",
        "website": "http://www.nink-cs.com",
        "market_cap": "Small Cap"
    },
    "OAJ.SI": {
        "short_name": "$ FortressMinerals",
        "long_name": "Fortress Minerals Limited",
        "summary": "Fortress Minerals Limited, an investment holding company, engages in the exploration, mining, production, and sale of iron ore concentrates. The company holds interests in the Bukit Besi mine that covers a total area of approximately 526 hectares located in Terengganu, Malaysia. It is also involved in the wholesale trade of various goods; transportation of iron ore and minerals; rental of transport equipment and vehicles; extraction, dredging, and dealing of industrial sand; acquisition of mines, mining rights, metalliferous land, and quarries; and provision of supporting services for transport equipment and vehicles. The company sells its iron ore concentrate primarily to steel mills in Malaysia. It also exports its products to the People's Republic of China. Fortress Minerals Limited was incorporated in 2017 and is based in Petaling Jaya, Malaysia.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Malaysia",
        "state": null,
        "city": "Petaling Jaya",
        "zipcode": "46150",
        "website": "http://www.fortress.sg",
        "market_cap": "Small Cap"
    },
    "QNS.SI": {
        "short_name": "$ SouthernAlliance",
        "long_name": "Southern Alliance Mining Ltd.",
        "summary": "Southern Alliance Mining Ltd., an investment holding company, engages in the exploration, mining, processing, and sale of iron ore in Malaysia. The company's iron ore products include processed iron ore concentrate for steel mills or traders; and crushed iron ore that are used as pipe coating material. Its principal property is the Chaah Mine that consists of two mining leases covering an adjacent area of 225.7 hectares located at the southwest of the township of Chaah. The company is also involved in the trading of iron ore, manganese, ferromanganese, lead, copper, and tin; and provision of mining contract work and transportation services, as well as quarrying of various minerals and materials. Southern Alliance Mining Ltd. was incorporated in 2019 and is headquartered in Kuantan, Malaysia.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuantan",
        "zipcode": "25200",
        "website": "http://www.saminingltd.com",
        "market_cap": "Small Cap"
    },
    "ST9.F": {
        "short_name": "STEPPE CEMENT LTD",
        "long_name": "Steppe Cement Ltd.",
        "summary": "Steppe Cement Ltd., an investment holding company, produces and sells cement in Kazakhstan. It also engages in the provision of consultancy services; and transmission and distribution of electricity. Steppe Cement Ltd. is based in Kuala Lumpur, Malaysia.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "50450",
        "website": "http://www.steppecement.com",
        "market_cap": "Small Cap"
    },
    "STCM.L": {
        "short_name": "STEPPE CEMENT LTD ORD NPV",
        "long_name": "Steppe Cement Ltd.",
        "summary": "Steppe Cement Ltd., an investment holding company, produces and sells cement in Kazakhstan. The company also engages in the provision of consultancy services; and transmission and distribution of electricity. Steppe Cement Ltd. is based in Kuala Lumpur, Malaysia.",
        "currency": "GBp",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "50450",
        "website": "http://www.steppecement.com",
        "market_cap": "Small Cap"
    },
    "VIP.AX": {
        "short_name": "VIP GLOVES FPO",
        "long_name": "VIP Gloves Limited",
        "summary": "VIP Gloves Limited, through its subsidiaries, researches, develops, manufactures, and sells nitrile disposable gloves in Malaysia and internationally. Its nitrile disposable gloves are used in medical and healthcare, food and beverages, electronics, and manufacturing industries. The company was formerly known as Voltage IP Limited and changed its name to VIP Gloves Limited in November 2018. VIP Gloves Limited was incorporated in 1992 and is based in Beranang, Malaysia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Malaysia",
        "state": null,
        "city": "Beranang",
        "zipcode": "43700",
        "website": "http://www.vipglove.com.my",
        "market_cap": "Small Cap"
    }
}