{
  "OAJ.SI": {
    "city": "Petaling Jaya",
    "country": "Malaysia",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Steel",
    "long_name": "Fortress Minerals Limited",
    "market": "sg_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "$ FortressMinerals",
    "state": null,
    "summary": "Fortress Minerals Limited, an investment holding company, engages in the exploration, mining, production, and sale of iron ore concentrates. The company holds interests in the Bukit Besi mine that covers a total area of approximately 526 hectares located in Terengganu, Malaysia. It is also involved in the wholesale trade of various goods; transportation of iron ore and minerals; rental of transport equipment and vehicles; extraction, dredging, and dealing of industrial sand; acquisition of mines, mining rights, metalliferous land, and quarries; and provision of supporting services for transport equipment and vehicles. The company sells its iron ore concentrate primarily to steel mills in Malaysia. It also exports its products to the People's Republic of China. Fortress Minerals Limited was incorporated in 2017 and is based in Petaling Jaya, Malaysia.",
    "website": "http://www.fortress.sg",
    "zipcode": "46150"
  },
  "QNS.SI": {
    "city": "Kuantan",
    "country": "Malaysia",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Steel",
    "long_name": "Southern Alliance Mining Ltd.",
    "market": "sg_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "$ SouthernAlliance",
    "state": null,
    "summary": "Southern Alliance Mining Ltd., an investment holding company, engages in the exploration, mining, processing, and sale of iron ore in Malaysia. The company's iron ore products include processed iron ore concentrate for steel mills or traders; and crushed iron ore that are used as pipe coating material. Its principal property is the Chaah Mine that consists of two mining leases covering an adjacent area of 225.7 hectares located at the southwest of the township of Chaah. The company is also involved in the trading of iron ore, manganese, ferromanganese, lead, copper, and tin; and provision of mining contract work and transportation services, as well as quarrying of various minerals and materials. Southern Alliance Mining Ltd. was incorporated in 2019 and is headquartered in Kuantan, Malaysia.",
    "website": "http://www.saminingltd.com",
    "zipcode": "25200"
  }
}
