{
    "0MB.F": {
        "short_name": "MARRONE BIO INN.DL-,00001",
        "long_name": "Marrone Bio Innovations, Inc.",
        "summary": "Marrone Bio Innovations, Inc. discovers, develops, produces, and promotes biological products for pest management, plant nutrition, and plant health in the United States and internationally. Its products include Emergen, Foramin, Foramin ST, Pacesetter, UBP, and UBP ST for increasing crop health, yield, and quality; Grandevo, a bioinsecticide that controls sucking and chewing insects through feeding; Haven, a plant health product to reduce sun stress and dehydration; Jet-Ag and Jet-Oxide peroxyacetic acid sanitizers that prevent, suppress, eliminate, and control algae, fungi, and bacterial diseases in agriculture and horticultural industries; and Majestene, a bionematicide to control soil-dwelling nematodes and certain soil borne insects. The company also offers Regalia and Stargus, which are bio fungicides that protects against fungal and bacterial diseases and enhances yields/quality; Venerate, a bioinsecticide, which controls chewing and sucking insects and mites, as well as flies and plant parasitic nematodes; and Zelto, a bionematicide that protects turf, including golf course fairways and greens, and promotes turf health by enhancing plant and root health. The company provides its products directly through sales force, as well as through distributors and other commercial partners. The company formerly known as Marrone Organic Innovations, Inc. Marrone Bio Innovations, Inc. was incorporated in 2006 and is headquartered in Davis, California.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Davis",
        "zipcode": "95618",
        "website": "http://www.marronebio.com",
        "market_cap": "Small Cap"
    },
    "17DN.F": {
        "short_name": "ARCADIA BIOSC.NEW.DL-,001",
        "long_name": "Arcadia Biosciences, Inc.",
        "summary": "Arcadia Biosciences, Inc. engages in developing various crop productivity traits primarily in hemp, wheat, and soybean. The company's crop productivity traits are designed to enhance farm economics by improving the performance of crops in the field, as well as their value as food ingredients, health and wellness products, and their viability for industrial applications. Its products include GoodHemp, a commercial pipeline of non-GMO hemp seed varieties developed with modern crop innovation tools focused on genetic improvement of hemp; GoodWheat that redesigns wheat as a functional food adding value to the wheat supply chain by enabling a range of choices to meet consumer demands; and nutritional oils, such as gamma linolenic acid oils. The company has collaborations with Ardent Mills, LLC, Corteva AgriScience, and Arista Cereal Seeds Pty Ltd, and Bay State Milling Company. It operates in the United States, Argentina, Canada, Africa, Austria, and India. The company was incorporated in 2002 and is headquartered in Davis, California.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Davis",
        "zipcode": "95618",
        "website": "http://www.arcadiabio.com",
        "market_cap": "Small Cap"
    },
    "2X0.F": {
        "short_name": "CORTEVA INC.  DL -,01",
        "long_name": "Corteva, Inc.",
        "summary": "Corteva, Inc. operates in the agriculture business. It operates through two segments, Seed and Crop Protection. The Seed segment develops and supplies advanced germplasm and traits that produce optimum yield for farms. It offers trait technologies that enhance resistance to weather, disease, insects, and herbicides used to control weeds, as well as food and nutritional characteristics. This segment also provides digital solutions that assist farmer decision-making with a view to optimize product selection, and maximize yield and profitability. The Crop Protection segment offers products that protect against weeds, insects and other pests, and diseases, as well as enhances crop health above and below ground through nitrogen management and seed-applied technologies. This segment provides herbicides, insecticides, nitrogen stabilizers, and pasture and range management herbicides. It serves agricultural input industry. The company operates in the United States, Canada, Latin America, the Asia Pacific, Europe, the Middle East, and Africa. Corteva, Inc. is headquartered in Wilmington, Delaware.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "DE",
        "city": "Wilmington",
        "zipcode": "19805-0735",
        "website": "http://www.corteva.com",
        "market_cap": "Large Cap"
    },
    "2X0.SG": {
        "short_name": "Corteva Inc. Registered Shares ",
        "long_name": "Corteva, Inc.",
        "summary": "Corteva, Inc. operates in the agriculture business. It operates through two segments, Seed and Crop Protection. The Seed segment develops and supplies advanced germplasm and traits that produce optimum yield for farms. It offers trait technologies that enhance resistance to weather, disease, insects, and herbicides used to control weeds, as well as food and nutritional characteristics. This segment also provides digital solutions that assist farmer decision-making with a view to optimize product selection, and maximize yield and profitability. The Crop Protection segment offers products that protect against weeds, insects and other pests, and diseases, as well as enhances crop health above and below ground through nitrogen management and seed-applied technologies. This segment provides herbicides, insecticides, nitrogen stabilizers, and pasture and range management herbicides. It serves agricultural input industry. The company operates in the United States, Canada, Latin America, the Asia Pacific, Europe, the Middle East, and Africa. Corteva, Inc. is headquartered in Wilmington, Delaware.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United States",
        "state": "DE",
        "city": "Wilmington",
        "zipcode": "19805-0735",
        "website": "http://www.corteva.com",
        "market_cap": "Large Cap"
    },
    "AGGL": {
        "short_name": "AGTECH GLOBAL INTERNATIONAL INC",
        "long_name": "AgTech Global International, Inc.",
        "summary": "AgTech Global International, Inc. operates as an agricultural supplier. Its proprietary systems and processes use resources, such as water, energy, space, capital, and labor delivering necessary fertilizers and nutrients to specialized growing industries with focus on hemp. It markets a range of non-organic and organic non-GMO fertilizers, nutrients, pesticides, insecticides, herbicides, and mold treatment products via its Website, retail, and wholesale channels, as well as offers patented DRIP irrigation product for indoor and outdoor applications. The company distributes its products in the United States and internationally. AgTech Global International, Inc. is based in Irvine, California.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Irvine",
        "zipcode": "92612",
        "website": "http://www.agtechglobal.net",
        "market_cap": "Small Cap"
    },
    "AGYP": {
        "short_name": "ALLIED ENERGY CORPORATION NEVAD",
        "long_name": "Allied Energy Corporation",
        "summary": "Allied Energy Corporation engages in manufacturing and selling organic bio-fertilizers and soil enhancers under the Building a Better World Green brand name primarily in the Americas. The company is based in Del Mar, California.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Del Mar",
        "zipcode": "92014",
        "website": "http://www.greenalliedenergy.com",
        "market_cap": null
    },
    "AVD": {
        "short_name": "American Vanguard Corporation",
        "long_name": "American Vanguard Corporation",
        "summary": "American Vanguard Corporation, through its subsidiaries, develops, manufactures, and markets specialty chemicals for agricultural, commercial, and consumer uses in the United States and internationally. The company manufactures and formulates chemicals, including insecticides, fungicides, herbicides, molluscicides, growth regulators, and soil fumigants in liquid, powder, and granular forms for crops, turf and ornamental plants, and human and animal health protection. It also markets, sells, and distributes end-use chemical and biological products for crop applications; and distributes chemicals for turf and ornamental markets. The company distributes its products through national distribution companies, and buying groups or co-operatives; and through sales offices, sales force executives, sales agents, and wholly owned distributors. American Vanguard Corporation was incorporated in 1969 and is headquartered in Newport Beach, California.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Newport Beach",
        "zipcode": "92660",
        "website": "http://www.american-vanguard.com",
        "market_cap": "Small Cap"
    },
    "BIONQ": {
        "short_name": "BIO NITROGEN HLDGS CORP",
        "long_name": "BioNitrogen Holdings Corp.",
        "summary": "BioNitrogen Holdings Corp. builds environmentally friendly plants that convert biomass into urea fertilizers by utilizing a patented technology. It produces urea fertilizers, urea ammonium nitrates, melamine, and diesel exhaust fluids. BioNitrogen Holdings Corp. was formerly known as Bio Nitrogen Corporation and changed its name to BioNitrogen Holdings Corp. in September 2013. The company was incorporated in 1990 and is based in Doral, Florida.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Doral",
        "zipcode": "33166",
        "website": null,
        "market_cap": "Small Cap"
    },
    "BWEL": {
        "short_name": "BOSWELL J G CO",
        "long_name": "JG Boswell Company",
        "summary": "JG Boswell Company produces, processes, and markets pima cotton. It is also involved in processing tomatoes for paste and seed crops, as well as livestock operations in Central California. The company was founded in 1925 and is headquartered in Pasadena, California.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Pasadena",
        "zipcode": "91103",
        "website": "http://boswelltomatoes.com",
        "market_cap": null
    },
    "C1FI34.SA": {
        "short_name": "CF INDUSTRIEDRN",
        "long_name": "CF Industries Holdings, Inc.",
        "summary": "CF Industries Holdings, Inc. manufactures and sells hydrogen and nitrogen products for clean energy, fertilizer, emissions abatement, and other industrial applications worldwide. Its principal products include anhydrous ammonia, granular urea, urea ammonium nitrate, and ammonium nitrate products. The company also offers diesel exhaust fluid, urea liquor, nitric acid, and aqua ammonia products; and compound fertilizer products with nitrogen, phosphorus, and potassium. It primarily serves cooperatives, independent fertilizer distributors, traders, wholesalers, and industrial users. The company was founded in 1946 and is headquartered in Deerfield, Illinois.",
        "currency": "BRL",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "IL",
        "city": "Deerfield",
        "zipcode": "60015",
        "website": "http://www.cfindustries.com",
        "market_cap": "Large Cap"
    },
    "C1TV34.SA": {
        "short_name": "CORTEVA INC DRN",
        "long_name": "Corteva, Inc.",
        "summary": "Corteva, Inc. operates in the agriculture business. It operates through two segments, Seed and Crop Protection. The Seed segment develops and supplies advanced germplasm and traits that produce optimum yield for farms. It offers trait technologies that enhance resistance to weather, disease, insects, and herbicides used to control weeds, as well as food and nutritional characteristics. This segment also provides digital solutions that assist farmer decision-making with a view to optimize product selection, and maximize yield and profitability. The Crop Protection segment offers products that protect against weeds, insects and other pests, and diseases, as well as enhances crop health above and below ground through nitrogen management and seed-applied technologies. This segment provides herbicides, insecticides, nitrogen stabilizers, and pasture and range management herbicides. It serves agricultural input industry. The company operates in the United States, Canada, Latin America, the Asia Pacific, Europe, the Middle East, and Africa. Corteva, Inc. is headquartered in Wilmington, Delaware.",
        "currency": "BRL",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "DE",
        "city": "Wilmington",
        "zipcode": "19805-0735",
        "website": "http://www.corteva.com",
        "market_cap": "Large Cap"
    },
    "C4F.F": {
        "short_name": "CF INDS HLDGS  DL-,01",
        "long_name": "CF Industries Holdings, Inc.",
        "summary": "CF Industries Holdings, Inc. manufactures and sells hydrogen and nitrogen products for clean energy, fertilizer, emissions abatement, and other industrial applications worldwide. Its principal products include anhydrous ammonia, granular urea, urea ammonium nitrate, and ammonium nitrate products. The company also offers diesel exhaust fluid, urea liquor, nitric acid, and aqua ammonia products; and compound fertilizer products with nitrogen, phosphorus, and potassium. It primarily serves cooperatives, independent fertilizer distributors, traders, wholesalers, and industrial users. The company was founded in 1946 and is headquartered in Deerfield, Illinois.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "IL",
        "city": "Deerfield",
        "zipcode": "60015",
        "website": "http://www.cfindustries.com",
        "market_cap": "Mid Cap"
    },
    "CF": {
        "short_name": "CF Industries Holdings, Inc.",
        "long_name": "CF Industries Holdings, Inc.",
        "summary": "CF Industries Holdings, Inc. manufactures and sells hydrogen and nitrogen products for clean energy, fertilizer, emissions abatement, and other industrial applications worldwide. Its principal products include anhydrous ammonia, granular urea, urea ammonium nitrate, and ammonium nitrate products. The company also offers diesel exhaust fluid, urea liquor, nitric acid, and aqua ammonia products; and compound fertilizer products with nitrogen, phosphorus, and potassium. It primarily serves cooperatives, independent fertilizer distributors, traders, wholesalers, and industrial users. The company was founded in 1946 and is headquartered in Deerfield, Illinois.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Deerfield",
        "zipcode": "60015",
        "website": "http://www.cfindustries.com",
        "market_cap": "Large Cap"
    },
    "CTA-PA": {
        "short_name": "E.I. du Pont de Nemours and Com",
        "long_name": "E. I. du Pont de Nemours and Company",
        "summary": "E. I. du Pont de Nemours and Company provides seeds and crop protection products for the agriculture industry in the United States, Canada, Europe, the Middle East, Africa, Latin America, and the Asia Pacific. It operates in two segments, Seed and Crop Protection. The Seed segment develops and supplies advanced germplasm and traits that produce yield for farms; offers corn, soybean, and sunflower seeds; trait technologies that enhance resistance to weather, disease, insects, and herbicides, which is used to control weeds, as well as enhances food and nutritional characteristics; and digital solutions that assist farmer decision-making with a view to optimizing product selection and yield. The Crop Protection segment serves the agricultural input industry with products that protect against weeds, insects and other pests, and diseases, as well as enhance overall crop health above and below ground via nitrogen management and seed-applied technologies. This segment provides herbicides, insecticides, nitrogen stabilizers and pasture, and range management herbicides. It offers its products under the Pioneer, Brevant, Dairyland Seed, Hoegemeyer, Nutech, Seed Consultants, AgVenture, Alforex, PhytoGen, Pannar, VP Maxx, HPT, G2, Supreme EX, XL, Power Plus, ENLIST E3, ENLIST, EXZACT, HERCULEX, Leptra, POWERCORE, Optimum, AcreMax, REFUGE ADVANCED, SMARTSTAX, NEXERA, Omega-9 Oils, AQUAmax, Plenish, ExpressSun, Protector, Pioneer MAXIMUS, Qrome, Clearfield, PROPOUND, Conkesta, Conkesta E3, WideStrike, LumiGEN, LUMIDERM, LUMIVIA, LUMIALZA, GRANULAR, ACREVALUE, Granular, and Insights brand names. The company was founded in 1802 and is headquartered in Wilmington, Delaware. E. I. du Pont de Nemours and Company is a subsidiary of Corteva, Inc.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "DE",
        "city": "Wilmington",
        "zipcode": "19805",
        "website": "http://www.corteva.com",
        "market_cap": "Large Cap"
    },
    "CTA-PB": {
        "short_name": "E.I. du Pont de Nemours and Com",
        "long_name": "E. I. du Pont de Nemours and Company",
        "summary": "E. I. du Pont de Nemours and Company provides seeds and crop protection products for the agriculture industry in the United States, Canada, Europe, the Middle East, Africa, Latin America, and the Asia Pacific. It operates in two segments, Seed and Crop Protection. The Seed segment develops and supplies advanced germplasm and traits that produce yield for farms; offers corn, soybean, and sunflower seeds; trait technologies that enhance resistance to weather, disease, insects, and herbicides, which is used to control weeds, as well as enhances food and nutritional characteristics; and digital solutions that assist farmer decision-making with a view to optimizing product selection and yield. The Crop Protection segment serves the agricultural input industry with products that protect against weeds, insects and other pests, and diseases, as well as enhance overall crop health above and below ground via nitrogen management and seed-applied technologies. This segment provides herbicides, insecticides, nitrogen stabilizers and pasture, and range management herbicides. It offers its products under the Pioneer, Brevant, Dairyland Seed, Hoegemeyer, Nutech, Seed Consultants, AgVenture, Alforex, PhytoGen, Pannar, VP Maxx, HPT, G2, Supreme EX, XL, Power Plus, ENLIST E3, ENLIST, EXZACT, HERCULEX, Leptra, POWERCORE, Optimum, AcreMax, REFUGE ADVANCED, SMARTSTAX, NEXERA, Omega-9 Oils, AQUAmax, Plenish, ExpressSun, Protector, Pioneer MAXIMUS, Qrome, Clearfield, PROPOUND, Conkesta, Conkesta E3, WideStrike, LumiGEN, LUMIDERM, LUMIVIA, LUMIALZA, GRANULAR, ACREVALUE, Granular, and Insights brand names. The company was founded in 1802 and is headquartered in Wilmington, Delaware. E. I. du Pont de Nemours and Company is a subsidiary of Corteva, Inc.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "DE",
        "city": "Wilmington",
        "zipcode": "19805",
        "website": "http://www.corteva.com",
        "market_cap": "Large Cap"
    },
    "CTVA.MX": {
        "short_name": "CORTEVA INC",
        "long_name": "Corteva, Inc.",
        "summary": "Corteva, Inc. operates in the agriculture business. It operates through two segments, Seed and Crop Protection. The Seed segment develops and supplies advanced germplasm and traits that produce optimum yield for farms. It offers trait technologies that enhance resistance to weather, disease, insects, and herbicides used to control weeds, as well as food and nutritional characteristics. This segment also provides digital solutions that assist farmer decision-making with a view to optimize product selection, and maximize yield and profitability. The Crop Protection segment offers products that protect against weeds, insects and other pests, and diseases, as well as enhances crop health above and below ground through nitrogen management and seed-applied technologies. This segment provides herbicides, insecticides, nitrogen stabilizers, and pasture and range management herbicides. It serves agricultural input industry. The company operates in the United States, Canada, Latin America, the Asia Pacific, Europe, the Middle East, and Africa. Corteva, Inc. is headquartered in Wilmington, Delaware.",
        "currency": "MXN",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "DE",
        "city": "Wilmington",
        "zipcode": "19805-0735",
        "website": "http://www.corteva.com",
        "market_cap": "Large Cap"
    },
    "CTVA": {
        "short_name": "Corteva, Inc.",
        "long_name": "Corteva, Inc.",
        "summary": "Corteva, Inc. operates in the agriculture business. It operates through two segments, Seed and Crop Protection. The Seed segment develops and supplies advanced germplasm and traits that produce optimum yield for farms. It offers trait technologies that enhance resistance to weather, disease, insects, and herbicides used to control weeds, as well as food and nutritional characteristics. This segment also provides digital solutions that assist farmer decision-making with a view to optimize product selection, and maximize yield and profitability. The Crop Protection segment offers products that protect against weeds, insects and other pests, and diseases, as well as enhances crop health above and below ground through nitrogen management and seed-applied technologies. This segment provides herbicides, insecticides, nitrogen stabilizers, and pasture and range management herbicides. It serves agricultural input industry. The company operates in the United States, Canada, Latin America, the Asia Pacific, Europe, the Middle East, and Africa. Corteva, Inc. is headquartered in Wilmington, Delaware.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "DE",
        "city": "Wilmington",
        "zipcode": "19805-0735",
        "website": "http://www.corteva.com",
        "market_cap": "Large Cap"
    },
    "CTVA.VI": {
        "short_name": "CORTEVA INC",
        "long_name": "Corteva, Inc.",
        "summary": "Corteva, Inc. operates in the agriculture business. It operates through two segments, Seed and Crop Protection. The Seed segment develops and supplies advanced germplasm and traits that produce optimum yield for farms. It offers trait technologies that enhance resistance to weather, disease, insects, and herbicides used to control weeds, as well as food and nutritional characteristics. This segment also provides digital solutions that assist farmer decision-making with a view to optimize product selection, and maximize yield and profitability. The Crop Protection segment offers products that protect against weeds, insects and other pests, and diseases, as well as enhances crop health above and below ground through nitrogen management and seed-applied technologies. This segment provides herbicides, insecticides, nitrogen stabilizers, and pasture and range management herbicides. It serves agricultural input industry. The company operates in the United States, Canada, Latin America, the Asia Pacific, Europe, the Middle East, and Africa. Corteva, Inc. is headquartered in Wilmington, Delaware.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "DE",
        "city": "Wilmington",
        "zipcode": "19805-0735",
        "website": "http://www.corteva.com",
        "market_cap": "Large Cap"
    },
    "DD.BA": {
        "short_name": "DUPONT DE NEMOURS",
        "long_name": "E. I. du Pont de Nemours and Company",
        "summary": "E. I. du Pont de Nemours and Company provides seeds and crop protection products for the agriculture industry in the United States, Canada, Europe, the Middle East, Africa, Latin America, and the Asia Pacific. It operates in two segments, Seed and Crop Protection. The Seed segment develops and supplies advanced germplasm and traits that produce yield for farms; offers corn, soybean, and sunflower seeds; trait technologies that enhance resistance to weather, disease, insects, and herbicides, which is used to control weeds, as well as enhances food and nutritional characteristics; and digital solutions that assist farmer decision-making with a view to optimizing product selection and yield. The Crop Protection segment serves the agricultural input industry with products that protect against weeds, insects and other pests, and diseases, as well as enhance overall crop health above and below ground via nitrogen management and seed-applied technologies. This segment provides herbicides, insecticides, nitrogen stabilizers and pasture, and range management herbicides. It offers its products under the Pioneer, Brevant, Dairyland Seed, Hoegemeyer, Nutech, Seed Consultants, AgVenture, Alforex, PhytoGen, Pannar, VP Maxx, HPT, G2, Supreme EX, XL, Power Plus, ENLIST E3, ENLIST, EXZACT, HERCULEX, Leptra, POWERCORE, Optimum, AcreMax, REFUGE ADVANCED, SMARTSTAX, NEXERA, Omega-9 Oils, AQUAmax, Plenish, ExpressSun, Protector, Pioneer MAXIMUS, Qrome, Clearfield, PROPOUND, Conkesta, Conkesta E3, WideStrike, LumiGEN, LUMIDERM, LUMIVIA, LUMIALZA, GRANULAR, ACREVALUE, Granular, and Insights brand names. The company was founded in 1802 and is headquartered in Wilmington, Delaware. E. I. du Pont de Nemours and Company is a subsidiary of Corteva, Inc.",
        "currency": "ARS",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "state": "DE",
        "city": "Wilmington",
        "zipcode": "19805",
        "website": "http://www.corteva.com",
        "market_cap": "Large Cap"
    },
    "F1MC34.SA": {
        "short_name": "FMC CORP    DRN",
        "long_name": "FMC Corporation",
        "summary": "FMC Corporation, an agricultural sciences company, provides crop protection, plant health, precision agriculture, and professional pest and turf management products. The company develop, markets, and sells crop protection chemicals that include insecticides, herbicides, and fungicides that are used in agriculture to enhance crop yield and quality by controlling a range of insects, weeds, and disease, as well as in non-agricultural markets for pest control. It also offers biologicals products, such as bionematicides under the Quartzo and Presence names. The company sells herbicides under the Authority, Boral, Centium, Command, and Gamit brands, as well as Isoflex active herbicide ingredients; Rynaxypyr and Cyazypyr active ingredients; and insecticides under the Talstar and Hero brands, as well as flutriafol-based fungicides. It sells its products through independent distributors and co-ops, and national and regional distributors, as well as sells directly to growers. The company operates in North America, Latin America, Europe, the Middle East, Africa, and Asia. FMC Corporation was founded in 1883 and is headquartered in Philadelphia, Pennsylvania.",
        "currency": "BRL",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "PA",
        "city": "Philadelphia",
        "zipcode": "19104",
        "website": "http://www.fmc.com",
        "market_cap": "Large Cap"
    },
    "FMC": {
        "short_name": "FMC Corporation",
        "long_name": "FMC Corporation",
        "summary": "FMC Corporation, an agricultural sciences company, provides crop protection, plant health, precision agriculture, and professional pest and turf management products. The company develop, markets, and sells crop protection chemicals that include insecticides, herbicides, and fungicides that are used in agriculture to enhance crop yield and quality by controlling a range of insects, weeds, and disease, as well as in non-agricultural markets for pest control. It also offers biologicals products, such as bionematicides under the Quartzo and Presence names. The company sells herbicides under the Authority, Boral, Centium, Command, and Gamit brands, as well as Isoflex active herbicide ingredients; Rynaxypyr and Cyazypyr active ingredients; and insecticides under the Talstar and Hero brands, as well as flutriafol-based fungicides. It sells its products through independent distributors and co-ops, and national and regional distributors, as well as sells directly to growers. The company operates in North America, Latin America, Europe, the Middle East, Africa, and Asia. FMC Corporation was founded in 1883 and is headquartered in Philadelphia, Pennsylvania.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Philadelphia",
        "zipcode": "19104",
        "website": "http://www.fmc.com",
        "market_cap": "Large Cap"
    },
    "FMQ.F": {
        "short_name": "FMC CORP.  DL-,10",
        "long_name": "FMC Corporation",
        "summary": "FMC Corporation, an agricultural sciences company, provides crop protection, plant health, precision agriculture, and professional pest and turf management products. The company develop, markets, and sells crop protection chemicals that include insecticides, herbicides, and fungicides that are used in agriculture to enhance crop yield and quality by controlling a range of insects, weeds, and disease, as well as in non-agricultural markets for pest control. It also offers biologicals products, such as bionematicides under the Quartzo and Presence names. The company sells herbicides under the Authority, Boral, Centium, Command, and Gamit brands, as well as Isoflex active herbicide ingredients; Rynaxypyr and Cyazypyr active ingredients; and insecticides under the Talstar and Hero brands, as well as flutriafol-based fungicides. It sells its products through independent distributors and co-ops, and national and regional distributors, as well as sells directly to growers. The company operates in North America, Latin America, Europe, the Middle East, Africa, and Asia. FMC Corporation was founded in 1883 and is headquartered in Philadelphia, Pennsylvania.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "Philadelphia",
        "zipcode": "19104",
        "website": "http://www.fmc.com",
        "market_cap": "Large Cap"
    },
    "HUMT": {
        "short_name": "HUMATECH INC",
        "long_name": "Humatech, Inc.",
        "summary": "Humatech, Inc. engages in mining, extracting, and processing humic acids for applications in animal feed and agriculture. Its animal feed ingredient products include DPX 9902, Promax, IGP 5/10, NutriHume, ActiHume, and blended products for use in feed for food-producing animals, such as pigs; beef and dairy cattle; sheep; goats; poultry, including broilers and layers; and farmed fish. The company also offers agricultural products, such as AgriHume, Maximize, Aqua F, Nitro Plus, Macro Plus, and Calcium Plus; and bio remediation products. It distributes its products in the European Union, the Middle East, Asia, and South and Central America. The company was formerly known as Midwest Enterprise Consultants, Inc. and changed its name to Humatech, Inc. in 1997. The company was incorporated in 1988 is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77084",
        "website": "http://www.humatech.com",
        "market_cap": "Small Cap"
    },
    "IGNE": {
        "short_name": "IGENE BIOTECHNOLOGY INC",
        "long_name": "Igene Biotechnology, Inc.",
        "summary": "Igene Biotechnology, Inc. focuses on the research, development, production, and commercialization of specialty ingredients for human and animal nutrition. The company supplies natural astaxanthin, a nutrient used as a source of pigment for coloring farmed salmon and trout species. It also supplies ingredients and finished products to the nutraceutical and feed industry. The company also provides research and development services for microbial strain improvement and fermentation process development and scale up from shake flask, to pilot plant, to commercial sized fermentors; and analytical chemistry services for identification and quantization of carotenoids in foods, feeds, and animal tissues, including verification of wild versus farm raised salmonids. The company was formerly known as IGI Biotechnology, Inc. and changed its name to IGENE Biotechnology, Inc. in April 1986. IGENE Biotechnology, Inc. was founded in 1981 and is based in Columbia, Maryland.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MD",
        "city": "Columbia",
        "zipcode": "21045",
        "website": "http://www.igene.com",
        "market_cap": "Small Cap"
    },
    "IPI": {
        "short_name": "Intrepid Potash, Inc",
        "long_name": "Intrepid Potash, Inc.",
        "summary": "Intrepid Potash, Inc. produces and sells potash and langbeinite products in the United States and internationally. It operates through three segments: Potash, Trio, and Oilfield Solutions. The Potash segment offers muriate of potash or potassium chloride for use as a fertilizer input in the agricultural market; as a component in drilling and fracturing fluids for oil and gas wells, as well as an input to other industrial processes in the industrial market; and as a nutrient supplement in the animal feed market. The Trio segment provides Trio, a specialty fertilizer that delivers potassium, sulfate, and magnesium in a single particle. The Oilfield Solutions segment sells water for use in the oil and gas services industry; and offers potassium chloride real-time mixing services on location for hydraulic fracturing operations and trucking services. The company offers salt for use in animal feeds, industrial applications, pool salts, and treatment of roads and walkways; magnesium chloride for use in the deicing and dedusting of roads; brines for well development and completion activities in the oil and gas industry; and metal recovery salt, a combination of potash and salt to enhance the recovery of aluminum in the aluminum recycling processing facilities. Intrepid Potash, Inc. was founded in 2000 and is based in Denver, Colorado.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Denver",
        "zipcode": "80202",
        "website": "http://www.intrepidpotash.com",
        "market_cap": "Small Cap"
    },
    "ITRO": {
        "short_name": "ITRONICS INC",
        "long_name": "Itronics Inc.",
        "summary": "Itronics Inc. produces GOLD'n GRO liquid fertilizers and pure silver bullion. The company offers photo recycling services, silver-iron sulfide concentrate leaching, silver refining, silver mineral concentrate processing, zinc flue dust recycling, silver battery recycling, cyanide neutralization, tailings leaching, ore processing, silver and gold leaching, and specialty mineral recovery services. It owns and operates photochemical silver and water recycling plant in the United States that converts spent photoliquids into pure silver and GOLD'n GRO liquid fertilizers. The company develops the Fulstone Iron Oxide Copper Gold exploration property in Nevada. Itronics Inc. was founded in 1987 and is headquartered in Reno, Nevada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Reno",
        "zipcode": "89509",
        "website": "http://www.itronics.com",
        "market_cap": "Mid Cap"
    },
    "LBTD": {
        "short_name": "LOTUS BIO TECHNOLOGY DEV CORP",
        "long_name": "Lotus Bio-Technology Development Corp.",
        "summary": "Lotus Bio-Technology Development Corp., a bio-technology development company, focuses on refining organic materials, and production of natural consumer related products in China. The company was formerly known as Starflick.com and changed its name to Lotus Bio-Technology Development Corp. in April 2016. Lotus Bio-Technology Development Corp. was founded in 2011 and is based in Cave Creek, Arizona.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Cave Creek",
        "zipcode": "85331",
        "website": null,
        "market_cap": "Small Cap"
    },
    "M1I.F": {
        "short_name": "MGP INGREDIENTS INC.(NEW)",
        "long_name": "MGP Ingredients, Inc.",
        "summary": "MGP Ingredients, Inc., together with its subsidiaries, produces and supplies distilled spirits, and specialty wheat proteins and starch food ingredients. It operates through two segments, Distillery Products and Ingredient Solutions. The Distillery Products segment provides food grade alcohol for beverage applications that include bourbon and rye whiskeys, as well as grain neutral spirits, including vodka and gin; and food grade industrial alcohol, which is used as an ingredient in foods, personal care products, cleaning solutions, pharmaceuticals, and various other products. This segment also provides fuel grade alcohol for blending with gasoline; distillers feed and related co-products, such as distillers feed and corn oil; and warehouse services, including barrel put away, storage, and retrieval services, as well as blending services. The Ingredient Solutions segment provides specialty wheat starches for food applications under the Fibersym Resistant Starch, FiberRite RW Resistant Starch, Pregel Instant Starch, and Midsol Cook-up Starch names; specialty wheat proteins for food applications under the Arise and Proterra names; gluten free textured pea proteins; commodity wheat starch for food and non-food applications; and commodity wheat proteins. The company sells its products directly or through distributors to manufacturers and processors of finished packaged goods or to bakeries primarily in the United States, Japan, Thailand, Mexico, and Canada. MGP Ingredients, Inc. was founded in 1941 and is headquartered in Atchison, Kansas.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "KS",
        "city": "Atchison",
        "zipcode": "66002-0130",
        "website": "http://www.mgpingredients.com",
        "market_cap": "Small Cap"
    },
    "M1I.SG": {
        "short_name": "MGP Ingredients Inc. (New) Regi",
        "long_name": "MGP Ingredients, Inc.",
        "summary": "MGP Ingredients, Inc., together with its subsidiaries, produces and supplies distilled spirits, and specialty wheat proteins and starch food ingredients. It operates through two segments, Distillery Products and Ingredient Solutions. The Distillery Products segment provides food grade alcohol for beverage applications that include bourbon and rye whiskeys, as well as grain neutral spirits, including vodka and gin; and food grade industrial alcohol, which is used as an ingredient in foods, personal care products, cleaning solutions, pharmaceuticals, and various other products. This segment also provides fuel grade alcohol for blending with gasoline; distillers feed and related co-products, such as distillers feed and corn oil; and warehouse services, including barrel put away, storage, and retrieval services, as well as blending services. The Ingredient Solutions segment provides specialty wheat starches for food applications under the Fibersym Resistant Starch, FiberRite RW Resistant Starch, Pregel Instant Starch, and Midsol Cook-up Starch names; specialty wheat proteins for food applications under the Arise and Proterra names; gluten free textured pea proteins; commodity wheat starch for food and non-food applications; and commodity wheat proteins. The company sells its products directly or through distributors to manufacturers and processors of finished packaged goods or to bakeries primarily in the United States, Japan, Thailand, Mexico, and Canada. MGP Ingredients, Inc. was founded in 1941 and is headquartered in Atchison, Kansas.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United States",
        "state": "KS",
        "city": "Atchison",
        "zipcode": "66002-0130",
        "website": "http://www.mgpingredients.com",
        "market_cap": "Small Cap"
    },
    "M6X3.F": {
        "short_name": "YIELD 10 BIOSCIENCE",
        "long_name": "Yield10 Bioscience, Inc.",
        "summary": "Yield10 Bioscience, Inc., an agricultural bioscience company, engages in developing technologies to enable step-change increases in crop yield in the United States and Canada. The company, through its Trait Factory, is involved in developing oilseed Camelina to produce proprietary products; and high value seed traits for the agriculture and food industries. Yield10 Bioscience, Inc. has license agreements with GDM Seeds; J. R. Simplot; Forage Genetics International, LLC; and Bayer AG. The company was formerly known as Metabolix, Inc. and changed its name to Yield10 Bioscience, Inc. in January 2017. Yield10 Bioscience, Inc. was founded in 1992 and is headquartered in Woburn, Massachusetts.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MA",
        "city": "Woburn",
        "zipcode": "01801",
        "website": "http://www.yield10bio.com",
        "market_cap": "Small Cap"
    },
    "MBII": {
        "short_name": "Marrone Bio Innovations, Inc.",
        "long_name": "Marrone Bio Innovations, Inc.",
        "summary": "Marrone Bio Innovations, Inc. discovers, develops, produces, and promotes biological products for pest management, plant nutrition, and plant health in the United States and internationally. Its products include Emergen, Foramin, Foramin ST, Pacesetter, UBP, and UBP ST for increasing crop health, yield, and quality; Grandevo, a bioinsecticide that controls sucking and chewing insects through feeding; Haven, a plant health product to reduce sun stress and dehydration; Jet-Ag and Jet-Oxide peroxyacetic acid sanitizers that prevent, suppress, eliminate, and control algae, fungi, and bacterial diseases in agriculture and horticultural industries; and Majestene, a bionematicide to control soil-dwelling nematodes and certain soil borne insects. The company also offers Regalia and Stargus, which are bio fungicides that protects against fungal and bacterial diseases and enhances yields/quality; Venerate, a bioinsecticide, which controls chewing and sucking insects and mites, as well as flies and plant parasitic nematodes; and Zelto, a bionematicide that protects turf, including golf course fairways and greens, and promotes turf health by enhancing plant and root health. The company provides its products directly through sales force, as well as through distributors and other commercial partners. The company formerly known as Marrone Organic Innovations, Inc. Marrone Bio Innovations, Inc. was incorporated in 2006 and is headquartered in Davis, California.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Davis",
        "zipcode": "95618",
        "website": "http://www.marronebio.com",
        "market_cap": "Small Cap"
    },
    "MGPI": {
        "short_name": "MGP Ingredients, Inc.",
        "long_name": "MGP Ingredients, Inc.",
        "summary": "MGP Ingredients, Inc., together with its subsidiaries, produces and supplies distilled spirits, and specialty wheat proteins and starch food ingredients. It operates through two segments, Distillery Products and Ingredient Solutions. The Distillery Products segment provides food grade alcohol for beverage applications that include bourbon and rye whiskeys, as well as grain neutral spirits, including vodka and gin; and food grade industrial alcohol, which is used as an ingredient in foods, personal care products, cleaning solutions, pharmaceuticals, and various other products. This segment also provides fuel grade alcohol for blending with gasoline; distillers feed and related co-products, such as distillers feed and corn oil; and warehouse services, including barrel put away, storage, and retrieval services, as well as blending services. The Ingredient Solutions segment provides specialty wheat starches for food applications under the Fibersym Resistant Starch, FiberRite RW Resistant Starch, Pregel Instant Starch, and Midsol Cook-up Starch names; specialty wheat proteins for food applications under the Arise and Proterra names; gluten free textured pea proteins; commodity wheat starch for food and non-food applications; and commodity wheat proteins. The company sells its products directly or through distributors to manufacturers and processors of finished packaged goods or to bakeries primarily in the United States, Japan, Thailand, Mexico, and Canada. MGP Ingredients, Inc. was founded in 1941 and is headquartered in Atchison, Kansas.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "KS",
        "city": "Atchison",
        "zipcode": "66002-0130",
        "website": "http://www.mgpingredients.com",
        "market_cap": "Small Cap"
    },
    "MOS.MX": {
        "short_name": "MOSAIC CO",
        "long_name": "The Mosaic Company",
        "summary": "The Mosaic Company, through its subsidiaries, produces and markets concentrated phosphate and potash crop nutrients in North America and internationally. The company operates through three segments: Phosphates, Potash, and Mosaic Fertilizantes. It owns and operates mines, which produce concentrated phosphate crop nutrients, such as diammonium phosphate, monoammonium phosphate, and ammoniated phosphate products; and phosphate-based animal feed ingredients primarily under the Biofos and Nexfos brand names, as well as produces a double sulfate of potash magnesia product under K-Mag brand name. The company also produces and sells potash for use in the manufacturing of mixed crop nutrients and animal feed ingredients, and for industrial use; and for use in the de-icing and as a water softener regenerant. In addition, it provides nitrogen-based crop nutrients and animal feed ingredients, and other ancillary services; and purchases and sells phosphates, potash, and nitrogen products. The company sells its products to wholesale distributors, retail chains, farmers, cooperatives, independent retailers, and national accounts. The Mosaic Company was incorporated in 2004 and is headquartered in Tampa, Florida.",
        "currency": "MXN",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "FL",
        "city": "Tampa",
        "zipcode": "33602",
        "website": "http://www.mosaicco.com",
        "market_cap": "Large Cap"
    },
    "MOS": {
        "short_name": "Mosaic Company (The)",
        "long_name": "The Mosaic Company",
        "summary": "The Mosaic Company, through its subsidiaries, produces and markets concentrated phosphate and potash crop nutrients in North America and internationally. The company operates through three segments: Phosphates, Potash, and Mosaic Fertilizantes. It owns and operates mines, which produce concentrated phosphate crop nutrients, such as diammonium phosphate, monoammonium phosphate, and ammoniated phosphate products; and phosphate-based animal feed ingredients primarily under the Biofos and Nexfos brand names, as well as produces a double sulfate of potash magnesia product under K-Mag brand name. The company also produces and sells potash for use in the manufacturing of mixed crop nutrients and animal feed ingredients, and for industrial use; and for use in the de-icing and as a water softener regenerant. In addition, it provides nitrogen-based crop nutrients and animal feed ingredients, and other ancillary services; and purchases and sells phosphates, potash, and nitrogen products. The company sells its products to wholesale distributors, retail chains, farmers, cooperatives, independent retailers, and national accounts. The Mosaic Company was incorporated in 2004 and is headquartered in Tampa, Florida.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Tampa",
        "zipcode": "33602",
        "website": "http://www.mosaicco.com",
        "market_cap": "Large Cap"
    },
    "MOSC34.SA": {
        "short_name": "MOSAIC CO   DRN",
        "long_name": "The Mosaic Company",
        "summary": "The Mosaic Company, through its subsidiaries, produces and markets concentrated phosphate and potash crop nutrients in North America and internationally. The company operates through three segments: Phosphates, Potash, and Mosaic Fertilizantes. It owns and operates mines, which produce concentrated phosphate crop nutrients, such as diammonium phosphate, monoammonium phosphate, and ammoniated phosphate products; and phosphate-based animal feed ingredients primarily under the Biofos and Nexfos brand names, as well as produces a double sulfate of potash magnesia product under K-Mag brand name. The company also produces and sells potash for use in the manufacturing of mixed crop nutrients and animal feed ingredients, and for industrial use; and for use in the de-icing and as a water softener regenerant. In addition, it provides nitrogen-based crop nutrients and animal feed ingredients, and other ancillary services; and purchases and sells phosphates, potash, and nitrogen products. The company sells its products to wholesale distributors, retail chains, farmers, cooperatives, independent retailers, and national accounts. The Mosaic Company was incorporated in 2004 and is headquartered in Tampa, Florida.",
        "currency": "BRL",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "FL",
        "city": "Tampa",
        "zipcode": "33602",
        "website": "http://www.mosaicco.com",
        "market_cap": "Large Cap"
    },
    "PC5.F": {
        "short_name": "PLANT HEALTH CARE  LS-,01",
        "long_name": "Plant Health Care plc",
        "summary": "Plant Health Care plc, together with its subsidiaries, provides agricultural biological products and technology solutions in the Americas, Mexico, and internationally. It offers products to enhance the health, vigor, and yield of field crops, such as corn, soybeans, potatoes, and rice, as well as specialty crops, including fruits and vegetables. The company provides Harpin aÃ\u009f, a biostimulant, which stimulates the plant's natural defense systems; and Myconate, a soil treatment solution that stimulates the colonization of plant roots. It also distributes third-party biological products. The company was founded in 1995 and is headquartered in Raleigh, North Carolina.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NC",
        "city": "Raleigh",
        "zipcode": "27608",
        "website": "http://www.planthealthcare.com",
        "market_cap": "Small Cap"
    },
    "PHC.L": {
        "short_name": "PLANT HEALTH CARE PLC ORD 1P",
        "long_name": "Plant Health Care plc",
        "summary": "Plant Health Care plc, together with its subsidiaries, provides agricultural biological products and technology solutions in the Americas, Mexico, and internationally. It offers products to enhance the health, vigor, and yield of field crops, such as corn, soybeans, potatoes, and rice, as well as specialty crops, including fruits and vegetables. The company provides Harpin aÃ\u009f, a biostimulant, which stimulates the plant's natural defense systems; and Myconate, a soil treatment solution that stimulates the colonization of plant roots. It also distributes third-party biological products. The company was founded in 1995 and is headquartered in Raleigh, North Carolina.",
        "currency": "GBp",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United States",
        "state": "NC",
        "city": "Raleigh",
        "zipcode": "27608",
        "website": "http://www.planthealthcare.com",
        "market_cap": "Small Cap"
    },
    "PHOS": {
        "short_name": "PHOSPHATE HOLDINGS INC",
        "long_name": "Phosphate Holdings, Inc.",
        "summary": "Phosphate Holdings, Inc., together with its subsidiary, Mississippi Phosphates Corporation, engages in the production and sale of phosphate fertilizer in Pascagoula, Mississippi. The company also exports its products. Phosphate Holdings, Inc. is based in Madison, Mississippi.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MS",
        "city": "Madison",
        "zipcode": "39110",
        "website": "http://www.missphosphates.com",
        "market_cap": "Small Cap"
    },
    "PLHCF": {
        "short_name": "PLANT HEALTH CARE",
        "long_name": "Plant Health Care plc",
        "summary": "Plant Health Care plc, together with its subsidiaries, provides agricultural biological products and technology solutions in the Americas, Mexico, and internationally. It offers products to enhance the health, vigor, and yield of field crops, such as corn, soybeans, potatoes, and rice, as well as specialty crops, including fruits and vegetables. The company provides Harpin aÃ\u009f, a biostimulant, which stimulates the plant's natural defense systems; and Myconate, a soil treatment solution that stimulates the colonization of plant roots. It also distributes third-party biological products. The company was founded in 1995 and is headquartered in Raleigh, North Carolina.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NC",
        "city": "Raleigh",
        "zipcode": "27608",
        "website": "http://www.planthealthcare.com",
        "market_cap": "Small Cap"
    },
    "PTAM": {
        "short_name": "POTASH AMERICA INC",
        "long_name": "Potash America, Inc.",
        "summary": "Potash America, Inc., an exploration stage company, focuses on the development of fertilizer and agri-business assets in Canada. It intends to acquire and develop potash, montmorillonite, bentonite, and gypsum assets into agri-products. The company was formerly known as Adtomize Inc. and changed its name to Potash America, Inc. in March 2011. Potash America, Inc. was founded in 2007 and is based in Boca Raton, Florida.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Boca Raton",
        "zipcode": "33431",
        "website": "http://potashamerica.net",
        "market_cap": "Small Cap"
    },
    "RKDA": {
        "short_name": "Arcadia Biosciences, Inc.",
        "long_name": "Arcadia Biosciences, Inc.",
        "summary": "Arcadia Biosciences, Inc. engages in developing various crop productivity traits primarily in hemp, wheat, and soybean. The company's crop productivity traits are designed to enhance farm economics by improving the performance of crops in the field, as well as their value as food ingredients, health and wellness products, and their viability for industrial applications. Its products include GoodHemp, a commercial pipeline of non-GMO hemp seed varieties developed with modern crop innovation tools focused on genetic improvement of hemp; GoodWheat that redesigns wheat as a functional food adding value to the wheat supply chain by enabling a range of choices to meet consumer demands; and nutritional oils, such as gamma linolenic acid oils. The company has collaborations with Ardent Mills, LLC, Corteva AgriScience, and Arista Cereal Seeds Pty Ltd, and Bay State Milling Company. It operates in the United States, Argentina, Canada, Africa, Austria, and India. The company was incorporated in 2002 and is headquartered in Davis, California.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Davis",
        "zipcode": "95618",
        "website": "http://www.arcadiabio.com",
        "market_cap": "Small Cap"
    },
    "SCQA.F": {
        "short_name": "SCOTTS MIRAC.GRO A DL-,01",
        "long_name": "The Scotts Miracle-Gro Company",
        "summary": "The Scotts Miracle-Gro Company manufactures, markets, and sells consumer lawn and garden products in the United States and internationally. The company operates through three segments: U.S. Consumer, Hawthorne, and Other. It offers lawn care products, such as lawn fertilizers, grass seed products, spreaders, other durable products, and outdoor cleaners, as well as lawn-related weed, pest, and disease control products. The company also provides gardening and landscape products, including water-soluble and continuous-release plant foods, potting mixes and garden soils, mulch and decorative groundcover products, plant-related pest and disease control products, organic garden products, and lives goods and seeding solutions. In addition, it offers hydroponic products that help users to grow plants, flowers, and vegetables using little or no soil; lighting systems and components for use in hydroponic and indoor gardening applications; and insect, rodent, and weed control products for home areas. The company offers its products under the Scotts, Turf Builder, EZ Seed, PatchMaster, Thick'R Lawn, GrubEx, EdgeGuard, Handy Green II, Miracle-Gro, LiquaFeed, Osmocote, Shake Â\u0091N Feed, Hyponex, Earthgro, SuperSoil, Fafard, Nature Scapes, Ortho, Miracle-Gro Performance Organics, Miracle-Gro Organic Choice, Whitney Farms, EcoScraps, Mother Earth, Botanicare, Hydroponics, Vermicrop, Gavita, Agrolux, Can-Filters, Sun System, Gro Pro, Hurricane, AeroGarden, Titan, Tomcat, Ortho Weed B Gon, Roundup, Groundclear, and Alchemist brands. It serves home centers, mass merchandisers, warehouse clubs, large hardware chains, independent hardware stores, nurseries, garden centers, e-commerce platforms, and food and drug stores, as well as indoor gardening and hydroponic distributors, retailers, and growers through a direct sales force, and network of brokers and distributors. The Scotts Miracle-Gro Company was founded in 1868 and is headquartered in Marysville, Ohio.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OH",
        "city": "Marysville",
        "zipcode": "43041",
        "website": "http://www.scottsmiraclegro.com",
        "market_cap": "Mid Cap"
    },
    "SMG": {
        "short_name": "Scotts Miracle-Gro Company (The",
        "long_name": "The Scotts Miracle-Gro Company",
        "summary": "The Scotts Miracle-Gro Company manufactures, markets, and sells consumer lawn and garden products in the United States and internationally. The company operates through three segments: U.S. Consumer, Hawthorne, and Other. It offers lawn care products, such as lawn fertilizers, grass seed products, spreaders, other durable products, and outdoor cleaners, as well as lawn-related weed, pest, and disease control products. The company also provides gardening and landscape products, including water-soluble and continuous-release plant foods, potting mixes and garden soils, mulch and decorative groundcover products, plant-related pest and disease control products, organic garden products, and lives goods and seeding solutions. In addition, it offers hydroponic products that help users to grow plants, flowers, and vegetables using little or no soil; lighting systems and components for use in hydroponic and indoor gardening applications; and insect, rodent, and weed control products for home areas. The company offers its products under the Scotts, Turf Builder, EZ Seed, PatchMaster, Thick'R Lawn, GrubEx, EdgeGuard, Handy Green II, Miracle-Gro, LiquaFeed, Osmocote, Shake Â\u0091N Feed, Hyponex, Earthgro, SuperSoil, Fafard, Nature Scapes, Ortho, Miracle-Gro Performance Organics, Miracle-Gro Organic Choice, Whitney Farms, EcoScraps, Mother Earth, Botanicare, Hydroponics, Vermicrop, Gavita, Agrolux, Can-Filters, Sun System, Gro Pro, Hurricane, AeroGarden, Titan, Tomcat, Ortho Weed B Gon, Roundup, Groundclear, and Alchemist brands. It serves home centers, mass merchandisers, warehouse clubs, large hardware chains, independent hardware stores, nurseries, garden centers, e-commerce platforms, and food and drug stores, as well as indoor gardening and hydroponic distributors, retailers, and growers through a direct sales force, and network of brokers and distributors. The Scotts Miracle-Gro Company was founded in 1868 and is headquartered in Marysville, Ohio.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Marysville",
        "zipcode": "43041",
        "website": "http://www.scottsmiraclegro.com",
        "market_cap": "Large Cap"
    },
    "UAN": {
        "short_name": "CVR Partners, LP",
        "long_name": "CVR Partners, LP",
        "summary": "CVR Partners, LP, together with its subsidiaries, produces and distributes nitrogen fertilizer products in the United States. The company offers ammonia products for agricultural and industrial customers; and urea and ammonium nitrate products to agricultural customers, as well as retailers and distributors. CVR GP, LLC serves as the general partner of the company. CVR Partners, LP was founded in 2007 and is based in Sugar Land, Texas.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Sugar Land",
        "zipcode": "77479",
        "website": "http://www.cvrpartners.com",
        "market_cap": "Small Cap"
    },
    "USBC": {
        "short_name": "US BIOTEC INC",
        "long_name": "US BioTec, Inc.",
        "summary": "US BioTec, Inc. engages in the development, manufacture, marketing, and distribution of bio-degradable, nontoxic, and noncarcinogenic products in the United States. Its product portfolio consists of approximately 30 products, which stimulate plants that produce crops; correct microbial and mineral problems present in soils; and rehabilitate the soil ecosystem by breaking down the residual build-up of toxic insecticides, herbicides, fungicides, and synthetic fertilizers. The company provides its products for agriculture, commercial turf industry, forestry, golf courses, professional landscapers, nurseries and mass market retail lawn, and garden markets. US BioTec, Inc. is based in Gleason, Tennessee.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TN",
        "city": "Gleason",
        "zipcode": "38229",
        "website": null,
        "market_cap": null
    },
    "VEGL": {
        "short_name": "VEGALAB INC",
        "long_name": "Vegalab, Inc.",
        "summary": "Vegalab, Inc. primarily engages in the citrus packing business. The company operates in two segments, the Agronomy Business and the Packing Business. It also distributes biological pesticides, natural fertilizers, and specialty biological agents under the Vegalab brand name. The company markets its products through stocking distributors. It primarily operates in the United States. The company was formerly known as HPC Acquisitions, Inc. and changed its name to Vegalab, Inc. in November 2017. Vegalab, Inc. was founded in 1968 and is based in North Palm Beach, Florida.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "North Palm Beach",
        "zipcode": "33408",
        "website": "http://vegalab.us",
        "market_cap": "Small Cap"
    },
    "YTEN": {
        "short_name": "Yield10 Bioscience, Inc.",
        "long_name": "Yield10 Bioscience, Inc.",
        "summary": "Yield10 Bioscience, Inc., an agricultural bioscience company, engages in developing technologies to enable step-change increases in crop yield in the United States and Canada. The company, through its Trait Factory, is involved in developing oilseed Camelina to produce proprietary products; and high value seed traits for the agriculture and food industries. Yield10 Bioscience, Inc. has license agreements with GDM Seeds; J. R. Simplot; Forage Genetics International, LLC; and Bayer AG. The company was formerly known as Metabolix, Inc. and changed its name to Yield10 Bioscience, Inc. in January 2017. Yield10 Bioscience, Inc. was founded in 1992 and is headquartered in Woburn, Massachusetts.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "MA",
        "city": "Woburn",
        "zipcode": "01801",
        "website": "http://www.yield10bio.com",
        "market_cap": "Small Cap"
    },
    "ZGSI": {
        "short_name": "ZERO GRAVITY SOLUTIONS INC",
        "long_name": "Zero Gravity Solutions, Inc.",
        "summary": "Zero Gravity Solutions, Inc., an agricultural biotechnology company, focuses on the commercialization of technology derived from and designed for long term spaceflight and planetary colonization with applications to agriculture on earth. The company offers BAM-FX, an ionic nutrient delivery platform for food crops that deliver minerals and micronutrients systemically at the cellular level of a plant; and Directed Selection, which relates to the production and alteration of various novel stem cells with characteristics in the prolonged zero/micro gravity environment of the International Space Station. It patents its stem cells for commercial sale to third parties. The company was formerly known as ElectroHealing Technologies, Inc. and changed its name to Zero Gravity Solutions, Inc. in January 2013. Zero Gravity Solutions, Inc. was founded in 1983 and is headquartered in Boca Raton, Florida.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Boca Raton",
        "zipcode": "33431",
        "website": "http://www.zerogsi.com",
        "market_cap": "Small Cap"
    }
}