{
    "0RT7.L": {
        "short_name": "TENNECO INC TENNECO ORD SHS",
        "long_name": "Tenneco Inc.",
        "summary": "Tenneco Inc. designs, manufactures, and sells clean air, powertrain, and ride performance products and systems for light vehicle, commercial truck, off-highway, industrial, and aftermarket customers worldwide. The company operates through Clean Air, Powertrain, Ride Performance, and Motorparts segments. It offers clean air products and systems, including catalytic converters and diesel oxidation catalysts; diesel particulate filters(DPFs); burner systems; lean nitrogen oxide (NOx) traps; selective catalytic reduction (SCR) systems; hydrocarbon vaporizers and injectors; SCR-coated diesel particulate filters systems; urea dosing systems; four-way catalysts; alternative NOx reduction technologies; mufflers and resonators; fabricated exhaust manifolds; pipes; hydroformed assemblies; elastomeric hangers and isolators; and aftertreatment control units. The company also provides powertrain products and systems, such as pistons; piston rings; cylinder liners; valve seats and guides; bearings; spark plugs; valvetrain products; system protection products; and seals and gaskets. In addition, it offers motor parts, including steering and suspension, braking, sealing, engine, emission, and maintenance products, as well as shocks and struts; and ride performance products and systems comprising advanced suspension technologies, and ride control and braking products, as well as noise, vibration, and harshness performance materials. The company was formerly known as Tenneco Automotive Inc. and changed its name to Tenneco Inc. in 2005. Tenneco Inc. was founded in 1996 and is headquartered in Lake Forest, Illinois.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Auto Parts",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United States",
        "city": "Lake Forest"
    },
    "1316.HK": {
        "short_name": "NEXTEER",
        "long_name": "Nexteer Automotive Group Limited",
        "summary": "Nexteer Automotive Group Limited, an investment holding company, designs, develops, manufactures, and distributes steering and driveline systems and components for automobile manufacturers and other automotive-related companies. It offers electric power steering (EPS) products, such as column, pinion, and rack assist, as well as dual pinion EPS; EPS remanufacturing products, intermediate shafts, and modular power packs; and hydraulic power steering products, such as magnetic torque overlay, smart flow pumps, power steering pumps and reservoirs, rack and pinion steering gears, and recirculating ball steering gears, as well as aftermarket products. The company also provides steering columns products, including power tilts and telescopes, power rakes and telescopes, one-touch adjustable columns, manual rakes and telescopes, non-adjustable columns, intermediate shafts, and transmission shifters, as well as electronics, modules, and sub-assemblies. In addition, it offers front and rear wheel half shafts, intermediate drive shafts, and propeller shaft constant velocity joints. Further, the company provides advanced driver assistance systems and automated driving technologies comprising steer by wire, steering on demand system, quiet wheel steering, and high availability EPS for resilient operational availability, as well as offers customer support and engineering center services. It operates in North America, the Asia Pacific, Europe, the Middle East, Africa, and South America. The company was founded in 1906 and is headquartered in Auburn Hills, Michigan. Nexteer Automotive Group Limited is a subsidiary of Pacific Century Motors, Inc.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "United States",
        "city": "Auburn Hills"
    },
    "1A7.F": {
        "short_name": "ALLISON TRANSM.HLDGS DL-1",
        "long_name": "Allison Transmission Holdings, Inc.",
        "summary": "Allison Transmission Holdings, Inc., together with its subsidiaries, designs, manufactures, and sells commercial and defense fully-automatic transmissions for medium- and heavy-duty commercial vehicles, and medium- and heavy-tactical U.S. defense vehicles worldwide. It offers transmissions for various applications, including distribution, refuse, construction, fire, and emergency on-highway trucks; school and transit buses; motor homes; energy, mining, and construction off-highway vehicles and equipment; and wheeled and tracked defense vehicles. The company markets its transmissions under Allison Transmission brand name; and remanufactured transmissions under ReTran brand name. It also sells branded replacement parts, support equipment, aluminum die cast components, and other products necessary to service the installed base of vehicles utilizing its transmissions, as well as defense kits, engineering services, and extended transmission coverage services to various original equipment manufacturers, distributors, and the U.S. government. The company serves customers through an independent network of approximately 1,400 independent distributor and dealer locations. The company was formerly known as Clutch Holdings, Inc. Allison Transmission Holdings, Inc. was founded in 1915 and is headquartered in Indianapolis, Indiana.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Indianapolis"
    },
    "2GX.F": {
        "short_name": "STONERIDGE INC.",
        "long_name": "Stoneridge, Inc.",
        "summary": "Stoneridge, Inc., together with its subsidiaries, designs and manufactures engineered electrical and electronic components, modules, and systems for the automotive, commercial, off-highway, motorcycle, and agricultural vehicle markets in North America, South America, Europe, and internationally. The company operates in three segments: Control Devices, Electronics, and Stoneridge Brazil. The Control Devices segment offers sensors, switches, actuators, and connectors that monitor, measure, or activate specific functions within a vehicle. The Electronics segment designs and manufactures driver information systems, camera-based vision systems, connectivity, and compliance products. Its products collect, store, and display vehicle information, such as speed, pressure, maintenance data, trip information, operator performance, temperature, distance traveled, and driver messages related to vehicle performance. This segment's electronic control units regulate, coordinate, monitor, and direct the operation of the electrical system within a vehicle. The Stoneridge Brazil segment designs, manufactures, and sells vehicle tracking devices and monitoring services; vehicle security alarms and convenience accessories; in-vehicle audio and infotainment devices; and telematics solutions. It provides its products and systems to various original equipment manufacturers and Tier 1 customers, as well as aftermarket distributors and mass merchandisers for use in various vehicle platforms. Stoneridge, Inc. was founded in 1965 and is headquartered in Novi, Michigan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Novi"
    },
    "ADOM": {
        "short_name": "ADOMANI INC",
        "long_name": "ADOMANI, Inc.",
        "summary": "ADOMANI, Inc. provides zero-emission electric vehicles. It also offers zero-emission electric drivetrain systems for the integration in medium to heavy-duty commercial fleet vehicles, as well as re-power conversion kits for the replacement of drivetrain systems in combustion-powered vehicles. The company was incorporated in 2012 and is based in Corona, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Corona"
    },
    "AEVA": {
        "short_name": "Aeva Technologies, Inc.",
        "long_name": "Aeva Technologies, Inc.",
        "summary": "AEVA, INC. operates as a machine vision company engages in development of optical-based sensors for the automotive industry. It builds lidar, a laser guidance sensor that are expected to be a key component of self-driving vehicles. The company was incorporated in 2016 and is based in Palo Alto, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Palo Alto"
    },
    "AFFL": {
        "short_name": "AFFILIATED RESOURCES CORP",
        "long_name": "Affiliated Resources Corp",
        "summary": "Affiliated Resources Corporation, through ChemWay Systems, Inc., produces aftermarket automotive fluids, including automotive care and performance products, refrigerants, lubricants and solvents. The company intends to focus on the acquisition of those companies whose product or service is technically innovative and market-proven, but whose market penetration can be significantly expanded through enhanced marketing or additional capitalization. The company was incorporated in 1986 and is based in Brecksville, Ohio.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Brecksville"
    },
    "AID1.F": {
        "short_name": "MERITOR INC.",
        "long_name": "Meritor, Inc.",
        "summary": "Meritor, Inc. designs, develops, manufactures, markets, distributes, sells, services, and supports integrated systems, modules, and components to original equipment manufacturers (OEMs) and the aftermarket for the commercial vehicle, transportation, and industrial sectors. It operates through two segments, Commercial Truck; and Aftermarket and Industrial. The Commercial Truck segment supplies drivetrain systems and components, including axles, drivelines, and braking and suspension systems primarily for medium-and heavy-duty trucks and other applications; and various undercarriage products and systems for trailer applications. The Aftermarket and Industrial segment supplies axles, brakes, drivelines, suspension parts, and other replacement parts to commercial vehicle and industrial aftermarket customers. It also supplies drivetrain systems and various components, such as axles, drivelines, brakes, and suspension systems for military, construction, bus and coach, fire and emergency, and other applications. The company also sells other complementary products, including third-party and private label items, which include brake shoes and friction materials; automatic slack adjusters; yokes and shafts; wheel-end hubs and drums; ABS and stability control systems; shock absorbers and air springs; and air brakes. Meritor, Inc. sells its products under the Meritor, Euclid, Trucktechnic, US Gear, AxleTech, and Mach brands primarily to OEMs, their parts marketing operations, and their dealers, as well as other independent distributors and service garages in the aftermarket industry in North America, South America, Europe, and the Asia Pacific. The company was formerly known as ArvinMeritor, Inc. and changed its name to Meritor, Inc. in March 2011. Meritor, Inc. was founded in 1909 and is headquartered in Troy, Michigan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Troy"
    },
    "ALSN": {
        "short_name": "Allison Transmission Holdings, ",
        "long_name": "Allison Transmission Holdings, Inc.",
        "summary": "Allison Transmission Holdings, Inc., together with its subsidiaries, designs, manufactures, and sells commercial and defense fully-automatic transmissions for medium- and heavy-duty commercial vehicles, and medium- and heavy-tactical U.S. defense vehicles worldwide. It offers transmissions for various applications, including distribution, refuse, construction, fire, and emergency on-highway trucks; school and transit buses; motor homes; energy, mining, and construction off-highway vehicles and equipment; and wheeled and tracked defense vehicles. The company markets its transmissions under Allison Transmission brand name; and remanufactured transmissions under ReTran brand name. It also sells branded replacement parts, support equipment, aluminum die cast components, and other products necessary to service the installed base of vehicles utilizing its transmissions, as well as defense kits, engineering services, and extended transmission coverage services to various original equipment manufacturers, distributors, and the U.S. government. The company serves customers through an independent network of approximately 1,400 independent distributor and dealer locations. The company was formerly known as Clutch Holdings, Inc. Allison Transmission Holdings, Inc. was founded in 1915 and is headquartered in Indianapolis, Indiana.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Indianapolis"
    },
    "AMTY": {
        "short_name": "AMERITYRE CORP",
        "long_name": "Amerityre Corporation",
        "summary": "Amerityre Corporation engages in the research and development, manufacture, and sale of polyurethane tires in the United States. The company provides closed-cell polyurethane foam tires for bicycles, carts, hand trucks, lawn and garden equipment, wheelbarrows, personnel carriers, and medical mobility products, as well as custom designed applications; polyurethane elastomer industrial tires for forklifts and scissor lifts; agricultural tires, including seeder tires and hay baler tires, as well as flat-free pivot tires that are used in irrigation systems; and specialty tires and tire-wheel assemblies. It serves original equipment manufacturers of lawn and garden products, and outdoor power equipment; regional tire distributors; retail cooperatives; agricultural tire distributors; and retailers of lawn and garden products, bicycle tires, and hand truck tires. The company was formerly known as American Tire Corporation and changed its name to Amerityre Corporation in December 1999. Amerityre Corporation was founded in 1995 and is headquartered in Boulder City, Nevada.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Boulder City"
    },
    "ATAR": {
        "short_name": "AVATAR VENTURES",
        "long_name": "Avatar Ventures Corp.",
        "summary": "Avatar Ventures Corp., a development stage company, focuses on developing aftermarket electronic accessories for consumer motor vehicles in China. The company is developing a cellular phone car adapter that enables cellular text messages and wireless emails to be displayed on a small liquid crystal display screen attached to the car's dashboard area. It also develops mobile marketing solutions, ranging from simple text messaging campaigns to robust mobile applications. In addition, the company develops iText Direct, a proprietary SMS solution; and a mobile Website intended to assist clients in navigating existing mobile Websites and/or build new mobile Websites. Avatar Ventures Corp. was founded in 2006 and is based in Carson City, Nevada.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Carson City"
    },
    "ATCV": {
        "short_name": "ATC VENTURE GROUP INC",
        "long_name": "ATC Venture Group Inc.",
        "summary": "ATC Venture Group Inc., through its subsidiary, Simonsen Iron Works Inc., engages in the design, manufacture, and assembly of an array of parts for original equipment manufacturers and other customers. The company was formerly known as Cycle Country Accessories Corp. and changed its name to ATC Venture Group Inc. in January 2012. ATC Venture Group Inc. is based in Minnetonka, Minnesota.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Minnetonka"
    },
    "AXL": {
        "short_name": "American Axle & Manufacturing H",
        "long_name": "American Axle & Manufacturing Holdings, Inc.",
        "summary": "American Axle & Manufacturing Holdings, Inc., together with its subsidiaries, designs, engineers, and manufactures driveline and metal forming products in the United States, Mexico, South America, China, other Asian countries, and Europe. The company's Driveline segment offers front and rear axles, driveshafts, differential assemblies, clutch modules, balance shaft systems, disconnecting driveline technology, and electric and hybrid driveline products and systems for light trucks, sport utility vehicles, crossover vehicles, passenger cars, and commercial vehicles. Its Metal Forming segment provides axle and transmission shafts, ring and pinion gears, differential gears and assemblies, and connecting rods and variable valve timing products for original equipment manufacturers and tier 1 automotive suppliers. American Axle & Manufacturing Holdings, Inc. has technology development agreement with Suzhou Inovance Automotive Ltd. The company was founded in 1994 and is headquartered in Detroit, Michigan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Detroit"
    },
    "AXLE": {
        "short_name": "TJT INC",
        "long_name": "T.J.T., Inc.",
        "summary": "T.J.T., Inc. engages in repairing and reconditioning axles and tires for the manufactured housing industry in the United States. It also distributes vinyl siding products, piers, and related set-up products, as well as skirting and other aftermarket accessories. The company serves primarily manufactured housing factories, manufactured housing dealers, contractors, and site-built housing market, as well as to recreational vehicle and residential markets in Idaho, Oregon, California, Utah, Washington, Montana, Colorado, Minnesota, New Mexico, Indiana, Iowa, Nevada, Wisconsin, and North Dakota. T.J.T., Inc. was founded in 1977 and is headquartered in Emmett, Idaho.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Emmett"
    },
    "AYA.F": {
        "short_name": "AM.AXLE + MFG HLDGS DL-01",
        "long_name": "American Axle & Manufacturing Holdings, Inc.",
        "summary": "American Axle & Manufacturing Holdings, Inc., together with its subsidiaries, designs, engineers, and manufactures driveline and metal forming products in the United States, Mexico, South America, China, other Asian countries, and Europe. The company's Driveline segment offers front and rear axles, driveshafts, differential assemblies, clutch modules, balance shaft systems, disconnecting driveline technology, and electric and hybrid driveline products and systems for light trucks, sport utility vehicles, crossover vehicles, passenger cars, and commercial vehicles. Its Metal Forming segment provides axle and transmission shafts, ring and pinion gears, differential gears and assemblies, and connecting rods and variable valve timing products for original equipment manufacturers and tier 1 automotive suppliers. American Axle & Manufacturing Holdings, Inc. has technology development agreement with Suzhou Inovance Automotive Ltd. The company was founded in 1994 and is headquartered in Detroit, Michigan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Detroit"
    },
    "AYA.SG": {
        "short_name": "AMERICAN AXLE & MFG HLDGS INC.R",
        "long_name": "American Axle & Manufacturing Holdings, Inc.",
        "summary": "American Axle & Manufacturing Holdings, Inc., together with its subsidiaries, designs, engineers, and manufactures driveline and metal forming products in the United States, Mexico, South America, China, other Asian countries, and Europe. The company's Driveline segment offers front and rear axles, driveshafts, differential assemblies, clutch modules, balance shaft systems, disconnecting driveline technology, and electric and hybrid driveline products and systems for light trucks, sport utility vehicles, crossover vehicles, passenger cars, and commercial vehicles. Its Metal Forming segment provides axle and transmission shafts, ring and pinion gears, differential gears and assemblies, and connecting rods and variable valve timing products for original equipment manufacturers and tier 1 automotive suppliers. American Axle & Manufacturing Holdings, Inc. has technology development agreement with Suzhou Inovance Automotive Ltd. The company was founded in 1994 and is headquartered in Detroit, Michigan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United States",
        "city": "Detroit"
    },
    "B1WA34.SA": {
        "short_name": "BORGWARNER IDRN",
        "long_name": "BorgWarner Inc.",
        "summary": "BorgWarner Inc. provides solutions for combustion, hybrid, and electric vehicles worldwide. The company's Engine segment offers turbocharger and turbocharger actuators; eBoosters; and timing systems products, including timing chains, variable cam timing, crankshaft and camshaft sprockets, tensioners, guides and snubbers, front-wheel drive transmission chains, four-wheel drive chains, and hybrid power transmission chains. It also provides emissions systems, such as electric air pumps and exhaust gas recirculation (EGR) modules, EGR coolers and valves, glow plugs, and instant starting systems; thermal systems products comprising viscous fan drives, polymer fans, coolant pumps, cabin heaters, battery heaters, and battery charging; and gasoline ignition technologies. The company's Drivetrain segment offers friction and mechanical products that include dual and friction clutch modules, friction and separator plates, transmission bands, torque converter and one-way clutches, and torsional vibration dampers. It also provides electro-hydraulic solenoids, transmission solenoid modules, and dual clutch control modules; rear-wheel drive/all-wheel drive (AWD) transfer case systems, front wheel drive-AWD coupling systems, and cross-axle coupling systems; starters, alternators, and hybrid electric motors; and motor controllers, battery chargers, and uninterrupted power source systems. The company sells its products to original equipment manufacturers of light vehicles, which comprise passenger cars, sport-utility vehicles, vans, and light trucks; commercial vehicles, including medium-duty and heavy-duty trucks, and buses; and off-highway vehicles, such as agricultural and construction machinery, and marine applications, as well as to tier one vehicle systems suppliers and the aftermarket for light, commercial, and off-highway vehicles. The company was formerly known as Borg-Warner Automotive, Inc. BorgWarner Inc. was founded in 1987 and is headquartered in Auburn Hills, Michigan.",
        "currency": "BRL",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Auburn Hills"
    },
    "BGW.F": {
        "short_name": "BORGWARNER INC.  DL-,01",
        "long_name": "BorgWarner Inc.",
        "summary": "BorgWarner Inc. provides solutions for combustion, hybrid, and electric vehicles worldwide. The company's Engine segment offers turbocharger and turbocharger actuators; eBoosters; and timing systems products, including timing chains, variable cam timing, crankshaft and camshaft sprockets, tensioners, guides and snubbers, front-wheel drive transmission chains, four-wheel drive chains, and hybrid power transmission chains. It also provides emissions systems, such as electric air pumps and exhaust gas recirculation (EGR) modules, EGR coolers and valves, glow plugs, and instant starting systems; thermal systems products comprising viscous fan drives, polymer fans, coolant pumps, cabin heaters, battery heaters, and battery charging; and gasoline ignition technologies. The company's Drivetrain segment offers friction and mechanical products that include dual and friction clutch modules, friction and separator plates, transmission bands, torque converter and one-way clutches, and torsional vibration dampers. It also provides electro-hydraulic solenoids, transmission solenoid modules, and dual clutch control modules; rear-wheel drive/all-wheel drive (AWD) transfer case systems, front wheel drive-AWD coupling systems, and cross-axle coupling systems; starters, alternators, and hybrid electric motors; and motor controllers, battery chargers, and uninterrupted power source systems. The company sells its products to original equipment manufacturers of light vehicles, which comprise passenger cars, sport-utility vehicles, vans, and light trucks; commercial vehicles, including medium-duty and heavy-duty trucks, and buses; and off-highway vehicles, such as agricultural and construction machinery, and marine applications, as well as to tier one vehicle systems suppliers and the aftermarket for light, commercial, and off-highway vehicles. The company was formerly known as Borg-Warner Automotive, Inc. BorgWarner Inc. was founded in 1987 and is headquartered in Auburn Hills, Michigan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Auburn Hills"
    },
    "BWA.MX": {
        "short_name": "BORG WARNER INC",
        "long_name": "BorgWarner Inc.",
        "summary": "BorgWarner Inc. provides solutions for combustion, hybrid, and electric vehicles worldwide. The company's Engine segment offers turbocharger and turbocharger actuators; eBoosters; and timing systems products, including timing chains, variable cam timing, crankshaft and camshaft sprockets, tensioners, guides and snubbers, front-wheel drive transmission chains, four-wheel drive chains, and hybrid power transmission chains. It also provides emissions systems, such as electric air pumps and exhaust gas recirculation (EGR) modules, EGR coolers and valves, glow plugs, and instant starting systems; thermal systems products comprising viscous fan drives, polymer fans, coolant pumps, cabin heaters, battery heaters, and battery charging; and gasoline ignition technologies. The company's Drivetrain segment offers friction and mechanical products that include dual and friction clutch modules, friction and separator plates, transmission bands, torque converter and one-way clutches, and torsional vibration dampers. It also provides electro-hydraulic solenoids, transmission solenoid modules, and dual clutch control modules; rear-wheel drive/all-wheel drive (AWD) transfer case systems, front wheel drive-AWD coupling systems, and cross-axle coupling systems; starters, alternators, and hybrid electric motors; and motor controllers, battery chargers, and uninterrupted power source systems. The company sells its products to original equipment manufacturers of light vehicles, which comprise passenger cars, sport-utility vehicles, vans, and light trucks; commercial vehicles, including medium-duty and heavy-duty trucks, and buses; and off-highway vehicles, such as agricultural and construction machinery, and marine applications, as well as to tier one vehicle systems suppliers and the aftermarket for light, commercial, and off-highway vehicles. The company was formerly known as Borg-Warner Automotive, Inc. BorgWarner Inc. was founded in 1987 and is headquartered in Auburn Hills, Michigan.",
        "currency": "MXN",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Auburn Hills"
    },
    "BWA": {
        "short_name": "BorgWarner Inc.",
        "long_name": "BorgWarner Inc.",
        "summary": "BorgWarner Inc. provides solutions for combustion, hybrid, and electric vehicles worldwide. The company's Engine segment offers turbocharger and turbocharger actuators; eBoosters; and timing systems products, including timing chains, variable cam timing, crankshaft and camshaft sprockets, tensioners, guides and snubbers, front-wheel drive transmission chains, four-wheel drive chains, and hybrid power transmission chains. It also provides emissions systems, such as electric air pumps and exhaust gas recirculation (EGR) modules, EGR coolers and valves, glow plugs, and instant starting systems; thermal systems products comprising viscous fan drives, polymer fans, coolant pumps, cabin heaters, battery heaters, and battery charging; and gasoline ignition technologies. The company's Drivetrain segment offers friction and mechanical products that include dual and friction clutch modules, friction and separator plates, transmission bands, torque converter and one-way clutches, and torsional vibration dampers. It also provides electro-hydraulic solenoids, transmission solenoid modules, and dual clutch control modules; rear-wheel drive/all-wheel drive (AWD) transfer case systems, front wheel drive-AWD coupling systems, and cross-axle coupling systems; starters, alternators, and hybrid electric motors; and motor controllers, battery chargers, and uninterrupted power source systems. The company sells its products to original equipment manufacturers of light vehicles, which comprise passenger cars, sport-utility vehicles, vans, and light trucks; commercial vehicles, including medium-duty and heavy-duty trucks, and buses; and off-highway vehicles, such as agricultural and construction machinery, and marine applications, as well as to tier one vehicle systems suppliers and the aftermarket for light, commercial, and off-highway vehicles. The company was formerly known as Borg-Warner Automotive, Inc. BorgWarner Inc. was founded in 1987 and is headquartered in Auburn Hills, Michigan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Auburn Hills"
    },
    "C31.F": {
        "short_name": "COOPER STANDARD HL.DL-,01",
        "long_name": "Cooper-Standard Holdings Inc.",
        "summary": "Cooper-Standard Holdings Inc., through its subsidiary, Cooper-Standard Automotive Inc., designs, manufactures, and sells sealing, fuel and brake delivery, and fluid transfer systems worldwide. The company's sealing systems include obstacle detection sensor system, flush glass systems, dynamic seals, variable extrusion systems, static seals, specialty sealing products, encapsulated glasses, stainless steel trims, and textured surfaces with cloth appearance. Its fuel and brake delivery systems comprise chassis and tank fuel lines and bundles, direct injection and port fuel rails, metallic brake lines and bundles, tube coatings, quick connects, and brake jounce lines. The company's fluid transfer systems consist of heater/coolant hoses, turbo charger hoses, quick connects, charged air cooler ducts/assemblies, DPF and SCR emission lines, secondary air hoses, degas tanks, brake and clutch hoses, air intake and charge systems, and transmission oil cooling hoses. The company's products are primarily used in passenger vehicles and light trucks that are manufactured by automotive original equipment manufacturers and replacement markets. Cooper-Standard Holdings Inc. was founded in 1960 and is headquartered in Northville, Michigan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Northville"
    },
    "CDTI": {
        "short_name": "CDTI ADVANCED MATERIALS INC",
        "long_name": "CDTi Advanced Materials, Inc.",
        "summary": "CDTi Advanced Materials, Inc. provides technology and solutions to the automotive emissions control markets in the United States, Canada, and Europe. Its catalyst products include synergized- platinum group metal (PGM) diesel oxidation catalysts, zero-PGM catalysts, selective catalytic reduction catalysts, and base-metal activated rhodium support catalysts. The company supplies its coated substrates directly to exhaust systems manufacturers; and catalyst technologies to automakers, heavy duty truck manufacturers, catalyst manufacturers, distributors, integrators, and retrofitters. CDTi Advanced Materials, Inc. was founded in 1996 and is headquartered in Oxnard, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Oxnard"
    },
    "CPS": {
        "short_name": "Cooper-Standard Holdings Inc.",
        "long_name": "Cooper-Standard Holdings Inc.",
        "summary": "Cooper-Standard Holdings Inc., through its subsidiary, Cooper-Standard Automotive Inc., designs, manufactures, and sells sealing, fuel and brake delivery, and fluid transfer systems worldwide. The company's sealing systems include obstacle detection sensor system, flush glass systems, dynamic seals, variable extrusion systems, static seals, specialty sealing products, encapsulated glasses, stainless steel trims, and textured surfaces with cloth appearance. Its fuel and brake delivery systems comprise chassis and tank fuel lines and bundles, direct injection and port fuel rails, metallic brake lines and bundles, tube coatings, quick connects, and brake jounce lines. The company's fluid transfer systems consist of heater/coolant hoses, turbo charger hoses, quick connects, charged air cooler ducts/assemblies, DPF and SCR emission lines, secondary air hoses, degas tanks, brake and clutch hoses, air intake and charge systems, and transmission oil cooling hoses. The company's products are primarily used in passenger vehicles and light trucks that are manufactured by automotive original equipment manufacturers and replacement markets. Cooper-Standard Holdings Inc. was founded in 1960 and is headquartered in Northville, Michigan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Northville"
    },
    "CTB": {
        "short_name": "Cooper Tire & Rubber Company",
        "long_name": "Cooper Tire & Rubber Company",
        "summary": "Cooper Tire & Rubber Company, together with its subsidiaries, designs, manufactures, markets, and sells replacement tires in North America, Latin America, Europe, and Asia. The company operates through Americas Tire Operations and International Tire Operations segments. It offers passenger car, light truck, truck and bus radial (TBR), motorcycle, and racing tires, as well as tire retread materials; and markets and distributes racing, TBR, and motorcycle tires. The company sells its products to independent tire dealers, wholesale distributors, regional and national retail tire chains, large retail chains, and other tire and automotive product retail chains, mass merchandisers, and digital channels as well as original equipment manufacturers; and directly to end users through three owned retail stores. Cooper Tire & Rubber Company was founded in 1914 and is headquartered in Findlay, Ohio.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Findlay"
    },
    "CVGI": {
        "short_name": "Commercial Vehicle Group, Inc.",
        "long_name": "Commercial Vehicle Group, Inc.",
        "summary": "Commercial Vehicle Group, Inc., together with its subsidiaries, designs, manufactures, produces, and sells components and assemblies to the global vehicle and the U.S. technology integrator markets in North America, Europe, and the Asia-Pacific regions. It operates in two segments, Electrical Systems and Global Seating. The Electrical Systems segment offers electrical wire harness assemblies that function as current carrying devices in providing electrical interconnections for gauges, lights, control functions, power circuits, powertrain and transmission sensors, emissions systems, and other electronic applications on commercial and other vehicles; and panel assemblies. It also offers electro-mechanical assemblies, such as box builds, complex automated and robotic assemblies, and large multi-cabinet control cabinets with power distribution and cabling; vinyl or cloth-covered appliquÃ©s, armrests, map pocket compartments, and sound-reducing insulations; instrument panels; and plastics decorating and finishing products. In addition, this segment provides cab structures; design products, including armrests, grab handles, storage systems, floor coverings, floor mats, sleeper bunks, headliners, wall panels, and privacy curtains; and mirrors, wipers, and controls used in commercial, military and specialty recreational vehicles. The Global Seating segment offers seats and seating systems, such as mechanical and air suspension, static and military seats, and bus, as well as seats for medium-and heavy-duty trucks (MD/HD trucks); office seating products; and seats, parts, and components for the aftermarket. The company supplies its products and systems for the commercial vehicle market comprising the MD/HD truck market; and MD/HD truck, bus, construction, mining, agricultural, military, industrial, municipal, off-road recreational, and specialty vehicle markets. Commercial Vehicle Group, Inc. was founded in 2000 and is headquartered in New Albany, Ohio.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "New Albany"
    },
    "DAN": {
        "short_name": "Dana Incorporated",
        "long_name": "Dana Incorporated",
        "summary": "Dana Incorporated provides power-conveyance and energy-management solutions for vehicles and machinery in North America, Europe, South America, and the Asia Pacific. It offers sealing solutions, thermal-management technologies, and digital solutions to vehicle and engine manufacturers. The company operates in four segments: Light Vehicle Drive Systems, Commercial Vehicle Drive and Motion Systems, Off-Highway Drive and Motion Systems, and Power Technologies. The Light Vehicle Drive Systems segment offers front drive steer rigid axles, rear drive rigid axles, driveshafts/propshafts, front/rear drive units, AWD systems, power transfer units, electromechanical propulsion systems, EV gearboxes, and differentials for use in light trucks, sport utility vehicles, crossover utility vehicles, vans, and passenger cars. The Commercial Vehicle Drive and Motion Systems segment provides steer and drive axles, driveshafts, tire inflation systems, high and low voltage motors and inverters, vehicle integration services, and connected software solutions for medium and heavy duty trucks, buses, and specialty vehicles. The Off-Highway Drive and Motion Systems segment manufactures front and rear axles; driveshafts; transmissions; torque converters; wheel, track, and winch planetary drives; industrial gear boxes; custom gears and shifting solutions; tire inflation systems; electronic controls; hydraulic valves, pumps and motors; and EV motors and inverter for use in construction, earth moving, agricultural, mining, forestry, material handling, and industrial stationary applications. The Power Technologies segment offers gaskets, cover modules, heat shields, engine sealing systems, cooling products, and heat transfer products for light vehicle, medium/heavy vehicle, and off-highway markets. The company was formerly known as Dana Holding Corporation and changed its name to Dana Incorporated in August 2016. Dana Incorporated was founded in 1904 and is headquartered in Maumee, Ohio.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Maumee"
    },
    "DORM": {
        "short_name": "Dorman Products, Inc.",
        "long_name": "Dorman Products, Inc.",
        "summary": "Dorman Products, Inc. supplies replacement parts and fasteners for passenger cars, light trucks, and heavy-duty trucks in the automotive aftermarket industry in the United States, Canada, Mexico, Europe, the Middle East, and Australia. It offers original equipment dealer products, such as intake and exhaust manifolds, window regulators, radiator fan assemblies, tire pressure monitor sensors, exhaust gas recirculation coolers, and complex electronics modules; fluid reservoirs, variable valve timing components, complex electronics, and integrated door lock actuators; and oil drain plugs, and wheel bolts and lug nuts. The company also provides automotive replacement parts comprising door handles, keyless remotes and cases, and door hinge repairs; and heavy duty aftermarket parts for class 4-8 vehicles, such as lighting, cooling, engine management, wheel hardware, air tanks, and cab products. In addition, it offers powertrain products, including cooling products, harmonic balancers, fluid lines and reservoirs, connectors, 4-wheel drive components, other engine, and transmission and axle components; and chassis products consisting of control arms, brake hardware and hydraulics, axle hardware, suspension arms, knuckles, links, bushings, and other suspension, steering, and brake components. Further, it provides automotive body products, such as window lift motors, switches and handles, wiper, and other interior and exterior automotive body components; and hardware products comprising threaded bolts; auto body and home electrical wiring components; and other hardware assortments and merchandise. The company offers its products under the OE Solutions, HELP!, and HD Solutions brands through automotive aftermarket retailers, including on-line platforms; national, regional, and local warehouse distributors; and specialty markets; salvage yards; local independent parts wholesalers; and mass merchants. The company was founded in 1918 and is headquartered in Colmar, Pennsylvania.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Colmar"
    },
    "EGOC": {
        "short_name": "ENERGY 1 CORPORATION",
        "long_name": "Energy 1 Corporation",
        "summary": "Energy 1 Corporation, an energy research and development company, develops, manufactures, and distributes fuel efficiency and emission reduction solutions for retrofit on diesel and gasoline powered equipment. The company offers ExhausTek, a vortex field ionizer (VFI) for emission reduction on diesel motors; IonTek, a VFI device that focuses on the pre-burn treatment of airflow, which is available in a non-collective unit for vehicles with air filters or as a collective unit for supercharged engines where dust removal is desired; and TekFuel System, a hydrogen-based retrofit system. It also provides clean truck leasing services, which comprise sale or lease of over-the-road Class-8 trucks with pre-installed integrated systems to the long or short haul trucking industry; owner operator services that include managed programs for sole operators and small trucking companies; and custom retrofit services, such as handling retrofit programs or projects, including a standalone generator, a single dump-truck, or a fleet of transit buses. It serves off and on-road diesel trucking market. The company was formerly known as Dairy Fresh Farms, Inc. and changed its name to Energy 1 Corporation in March 2009. Energy 1 Corporation was founded in 2003 and is headquartered in Boca Raton, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Boca Raton"
    },
    "EGTK": {
        "short_name": "ENERGTEK INC",
        "long_name": "Energtek, Inc.",
        "summary": "Energtek, Inc., together with its subsidiaries, provides natural gas delivery solutions based on mobile pipe-less technologies and products. Its solution captures, stores, transports, and delivers natural gas from pipelines and/or stranded/associated/flared gas to industrial/commercial/residential/NGV customers. The company offers natural gas through pipeline on wheels; and CNG Lite system that provide fuel to two and three wheel vehicles using low-pressure technology. Energtek, Inc. is based in New York, New York.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "ENVS": {
        "short_name": "ENOVA SYSTEMS INC",
        "long_name": "Enova Systems, Inc.",
        "summary": "Enova Systems, Inc. designs, develops, and produces drive systems and related components for electric, hybrid electric, and fuel cell systems for mobile applications in the United States, Asia, and Europe. It offers series and parallel hybrid systems. The company's electric and hybrid-electric drive systems, and power management and power conversion systems are used in applications, such as medium and heavy duty trucks, transit buses, and heavy industrial vehicles. It was formerly known as U.S. Electricar, Inc. and changed its name to Enova Systems, Inc. in July 2000. The company was founded in 1976 and is based in Torrance, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Torrance"
    },
    "ESWW": {
        "short_name": "ENVIRO SOLUTIONS WORLDWIDE",
        "long_name": "Environmental Solutions Worldwide, Inc.",
        "summary": "Environmental Solutions Worldwide, Inc., through its subsidiaries, designs, develops, manufactures, and sells diesel emissions control technologies primarily in North America. It operates in two segments, Air Testing Services and MHDD Diesel Emission Control. The company's products include ThermaCat active diesel particulate filter, a level three plus technology for use in a range of on- and off-road engine applications, including exhaust gas recirculation engines; LongMile-S, a level three plus passive diesel particulate filter for use in diesel engines operating in on-road vehicles; and Horizon, a level three plus active diesel particulate filter used in diesel engines operating in on-road vehicles and duty cycles, such as cold exhaust and older engines. It also offers Vista, a diesel particulate (PM) reduction system for a range of on-road diesel engines and applications vehicles; LongView, a level 3 plus passive diesel particulate filter for PM and nitrogen oxide reductions in on-road application diesel engines; and Phoenix and Skyline for PM reduction in off-road application diesel engines, and duty cycles comprising cold exhaust and older engines. In addition, the company manufactures HCD, an off-road product used in diesel engines operating in off-road equipment; and XtrmCat for marine applications, as well as military technologies consisting of the StlthCat and Scat-IR-Shield exhaust shielding technology used in the United States marine light armored vehicles. Further, it operates emissions and durability testing facility to perform engine emissions verification test protocols. The company markets its products through a network of independent distributors and strategic partners, as well as direct sales personnel, local trade magazines, and trade shows. Environmental Solutions Worldwide, Inc. was founded in 1987 and is based in Montgomeryville, Pennsylvania.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Montgomeryville"
    },
    "FDOC": {
        "short_name": "FUEL DOCTOR HOLDINGS INC",
        "long_name": "Fuel Doctor Holdings, Inc.",
        "summary": "Fuel Doctor Holdings, Inc. focuses on locating and negotiating with eligible portfolio companies to acquire an interest in them. Previously, it engaged in the design, marketing, and distribution of auto accessories. The company is based in Vallejo, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Vallejo"
    },
    "FDU.F": {
        "short_name": "COML VEHICLE GROUP DL-,01",
        "long_name": "Commercial Vehicle Group, Inc.",
        "summary": "Commercial Vehicle Group, Inc., together with its subsidiaries, designs, manufactures, produces, and sells components and assemblies to the global vehicle and the U.S. technology integrator markets in North America, Europe, and the Asia-Pacific regions. It operates in two segments, Electrical Systems and Global Seating. The Electrical Systems segment offers electrical wire harness assemblies that function as current carrying devices in providing electrical interconnections for gauges, lights, control functions, power circuits, powertrain and transmission sensors, emissions systems, and other electronic applications on commercial and other vehicles; and panel assemblies. It also offers electro-mechanical assemblies, such as box builds, complex automated and robotic assemblies, and large multi-cabinet control cabinets with power distribution and cabling; vinyl or cloth-covered appliquÃ©s, armrests, map pocket compartments, and sound-reducing insulations; instrument panels; and plastics decorating and finishing products. In addition, this segment provides cab structures; design products, including armrests, grab handles, storage systems, floor coverings, floor mats, sleeper bunks, headliners, wall panels, and privacy curtains; and mirrors, wipers, and controls used in commercial, military and specialty recreational vehicles. The Global Seating segment offers seats and seating systems, such as mechanical and air suspension, static and military seats, and bus, as well as seats for medium-and heavy-duty trucks (MD/HD trucks); office seating products; and seats, parts, and components for the aftermarket. The company supplies its products and systems for the commercial vehicle market comprising the MD/HD truck market; and MD/HD truck, bus, construction, mining, agricultural, military, industrial, municipal, off-road recreational, and specialty vehicle markets. Commercial Vehicle Group, Inc. was founded in 2000 and is headquartered in New Albany, Ohio.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "New Albany"
    },
    "FFLO": {
        "short_name": "FREEFLOW INC",
        "long_name": "Free Flow, Inc.",
        "summary": "Free Flow, Inc. engages in the selling of used auto parts through Internet network to auto body and mechanic shops. The company was incorporated in 2011 and is based in King George, Virginia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "King George"
    },
    "FLES": {
        "short_name": "4 LESS GROUP INC",
        "long_name": "The 4Less Group, Inc.",
        "summary": "The 4Less Group, Inc. operates as an e-commerce auto and truck parts sales company. It offers exhaust systems, suspension systems, wheels, tires, stereo systems, truck bed covers, and shocks through its LiftKits4LESS.com, Bumpers4LESS.com, TruckBedCovers4LESS.com, and Autoparts4Less.com Websites. The company is headquartered in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Las Vegas"
    },
    "GNTX": {
        "short_name": "Gentex Corporation",
        "long_name": "Gentex Corporation",
        "summary": "Gentex Corporation designs, develops, manufactures, markets, and supplies digital vision, connected car, dimmable glass, and fire protection products in the United States, Germany, Japan, Mexico, and internationally. It operates through Automotive Products and Other segments. The company offers automotive products, including interior and exterior electrochromic automatic-dimming rearview mirrors, automotive electronics, and non-automatic-dimming rearview mirrors for automotive passenger cars, light trucks, pick-up trucks, sport utility vehicles, and vans for original equipment manufacturers, automotive suppliers, and various aftermarket and accessory customers. It also provides variable dimmable windows to aircraft manufacturers and airline operators. In addition, the company offers photoelectric smoke detectors and alarms, electrochemical carbon monoxide detectors and alarms, audible and visual signaling alarms, and bells and speakers used in fire detection systems in office buildings, hotels, and other commercial and residential establishments, as well as researches and develops nanofiber chemical sensing products. It sells its fire protection products directly, as well as through sales managers and manufacturer representative organizations to fire protection and security product distributors, electrical wholesale houses, and original equipment manufacturers of fire protection systems. The company was founded in 1974 and is headquartered in Zeeland, Michigan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Zeeland"
    },
    "GT.MX": {
        "short_name": "GOODYEAR TIRE & RUBBER CO",
        "long_name": "The Goodyear Tire & Rubber Company",
        "summary": "The Goodyear Tire & Rubber Company, together with its subsidiaries, develops, manufactures, distributes, and sells tires and related products and services worldwide. It offers various lines of rubber tires for automobiles, trucks, buses, aircrafts, motorcycles, earthmoving and mining equipment, farm implements, industrial equipment, and various other applications under the Goodyear, Dunlop, Kelly, Debica, Sava, Fulda, and various other Goodyear owned house brands, as well as under the private-label brands. The company also retreads truck, aviation, and off-the-road tires; manufactures and sells tread rubber and other tire retreading materials; sells chemical and natural rubber products; and provides automotive and commercial truck maintenance and repair services, and miscellaneous other products and services. It operates approximately 1,000 retail outlets, which offer products for retail sale, and provides repair and other services. The company sells its products worldwide through a network of independent dealers, regional distributors, retail outlets, and retailers. The company has strategic collaboration with ConMet to develop combined digital solutions that connect commercial truck fleets to the health of their tires and wheel ends; and a strategic relationship with UFODRIVE to pursue opportunities to integrate their complementary mobility solutions, including Goodyear's intelligent tire monitoring system and proactive solutions suite and UFODRIVE's advanced eMobility software as a service platform. The Goodyear Tire & Rubber Company was founded in 1898 and is headquartered in Akron, Ohio.",
        "currency": "MXN",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Akron"
    },
    "GT": {
        "short_name": "The Goodyear Tire & Rubber Comp",
        "long_name": "The Goodyear Tire & Rubber Company",
        "summary": "The Goodyear Tire & Rubber Company, together with its subsidiaries, develops, manufactures, distributes, and sells tires and related products and services worldwide. It offers various lines of rubber tires for automobiles, trucks, buses, aircrafts, motorcycles, earthmoving and mining equipment, farm implements, industrial equipment, and various other applications under the Goodyear, Dunlop, Kelly, Debica, Sava, Fulda, and various other Goodyear owned house brands, as well as under the private-label brands. The company also retreads truck, aviation, and off-the-road tires; manufactures and sells tread rubber and other tire retreading materials; sells chemical and natural rubber products; and provides automotive and commercial truck maintenance and repair services, and miscellaneous other products and services. It operates approximately 1,000 retail outlets, which offer products for retail sale, and provides repair and other services. The company sells its products worldwide through a network of independent dealers, regional distributors, retail outlets, and retailers. The company has strategic collaboration with ConMet to develop combined digital solutions that connect commercial truck fleets to the health of their tires and wheel ends; and a strategic relationship with UFODRIVE to pursue opportunities to integrate their complementary mobility solutions, including Goodyear's intelligent tire monitoring system and proactive solutions suite and UFODRIVE's advanced eMobility software as a service platform. The Goodyear Tire & Rubber Company was founded in 1898 and is headquartered in Akron, Ohio.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Akron"
    },
    "GT.SW": {
        "short_name": "GOODYEAR",
        "long_name": "The Goodyear Tire & Rubber Company",
        "summary": "The Goodyear Tire & Rubber Company, together with its subsidiaries, develops, manufactures, distributes, and sells tires and related products and services worldwide. It offers various lines of rubber tires for automobiles, trucks, buses, aircrafts, motorcycles, earthmoving and mining equipment, farm implements, industrial equipment, and various other applications under the Goodyear, Dunlop, Kelly, Debica, Sava, Fulda, and various other Goodyear owned house brands, as well as under the private-label brands. The company also retreads truck, aviation, and off-the-road tires; manufactures and sells tread rubber and other tire retreading materials; sells chemical and natural rubber products; and provides automotive and commercial truck maintenance and repair services, and miscellaneous other products and services. It operates approximately 1,000 retail outlets, which offer products for retail sale, and provides repair and other services. The company sells its products worldwide through a network of independent dealers, regional distributors, retail outlets, and retailers. The company has strategic collaboration with ConMet to develop combined digital solutions that connect commercial truck fleets to the health of their tires and wheel ends; and a strategic relationship with UFODRIVE to pursue opportunities to integrate their complementary mobility solutions, including Goodyear's intelligent tire monitoring system and proactive solutions suite and UFODRIVE's advanced eMobility software as a service platform. The Goodyear Tire & Rubber Company was founded in 1898 and is headquartered in Akron, Ohio.",
        "currency": "CHF",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "United States",
        "city": "Akron"
    },
    "GTR.DE": {
        "short_name": "GOODYEAR TIRE RUBBER",
        "long_name": "The Goodyear Tire & Rubber Company",
        "summary": "The Goodyear Tire & Rubber Company, together with its subsidiaries, develops, manufactures, distributes, and sells tires and related products and services worldwide. It offers various lines of rubber tires for automobiles, trucks, buses, aircrafts, motorcycles, earthmoving and mining equipment, farm implements, industrial equipment, and various other applications under the Goodyear, Dunlop, Kelly, Debica, Sava, Fulda, and various other Goodyear owned house brands, as well as under the private-label brands. The company also retreads truck, aviation, and off-the-road tires; manufactures and sells tread rubber and other tire retreading materials; sells chemical and natural rubber products; and provides automotive and commercial truck maintenance and repair services, and miscellaneous other products and services. It operates approximately 1,000 retail outlets, which offer products for retail sale, and provides repair and other services. The company sells its products worldwide through a network of independent dealers, regional distributors, retail outlets, and retailers. The company has strategic collaboration with ConMet to develop combined digital solutions that connect commercial truck fleets to the health of their tires and wheel ends; and a strategic relationship with UFODRIVE to pursue opportunities to integrate their complementary mobility solutions, including Goodyear's intelligent tire monitoring system and proactive solutions suite and UFODRIVE's advanced eMobility software as a service platform. The Goodyear Tire & Rubber Company was founded in 1898 and is headquartered in Akron, Ohio.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Akron"
    },
    "GTR.F": {
        "short_name": "GOODYEAR TIRE RUBBER",
        "long_name": "The Goodyear Tire & Rubber Company",
        "summary": "The Goodyear Tire & Rubber Company, together with its subsidiaries, develops, manufactures, distributes, and sells tires and related products and services worldwide. It offers various lines of rubber tires for automobiles, trucks, buses, aircrafts, motorcycles, earthmoving and mining equipment, farm implements, industrial equipment, and various other applications under the Goodyear, Dunlop, Kelly, Debica, Sava, Fulda, and various other Goodyear owned house brands, as well as under the private-label brands. The company also retreads truck, aviation, and off-the-road tires; manufactures and sells tread rubber and other tire retreading materials; sells chemical and natural rubber products; and provides automotive and commercial truck maintenance and repair services, and miscellaneous other products and services. It operates approximately 1,000 retail outlets, which offer products for retail sale, and provides repair and other services. The company sells its products worldwide through a network of independent dealers, regional distributors, retail outlets, and retailers. The company has strategic collaboration with ConMet to develop combined digital solutions that connect commercial truck fleets to the health of their tires and wheel ends; and a strategic relationship with UFODRIVE to pursue opportunities to integrate their complementary mobility solutions, including Goodyear's intelligent tire monitoring system and proactive solutions suite and UFODRIVE's advanced eMobility software as a service platform. The Goodyear Tire & Rubber Company was founded in 1898 and is headquartered in Akron, Ohio.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Akron"
    },
    "GTX.DE": {
        "short_name": "GENTEX CORP.  DL-,06",
        "long_name": "Gentex Corporation",
        "summary": "Gentex Corporation designs, develops, manufactures, markets, and supplies digital vision, connected car, dimmable glass, and fire protection products in the United States, Germany, Japan, Mexico, and internationally. It operates through Automotive Products and Other segments. The company offers automotive products, including interior and exterior electrochromic automatic-dimming rearview mirrors, automotive electronics, and non-automatic-dimming rearview mirrors for automotive passenger cars, light trucks, pick-up trucks, sport utility vehicles, and vans for original equipment manufacturers, automotive suppliers, and various aftermarket and accessory customers. It also provides variable dimmable windows to aircraft manufacturers and airline operators. In addition, the company offers photoelectric smoke detectors and alarms, electrochemical carbon monoxide alarms and detectors, audible and visual signaling appliances, and bells and speakers used in fire detection systems in office buildings, hotels, and other commercial and residential establishments, as well as researches and develops nanofiber chemical sensing products. Gentex Corporation sells its fire protection products directly, as well as through sales managers and manufacturer representative organizations to fire protection and security product distributors, electrical wholesale houses, and original equipment manufacturers of fire protection systems. The company was founded in 1974 and is headquartered in Zeeland, Michigan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Zeeland"
    },
    "GTX.F": {
        "short_name": "GENTEX CORP.  DL-,06",
        "long_name": "Gentex Corporation",
        "summary": "Gentex Corporation designs, develops, manufactures, markets, and supplies digital vision, connected car, dimmable glass, and fire protection products in the United States, Germany, Japan, Mexico, and internationally. It operates through Automotive Products and Other segments. The company offers automotive products, including interior and exterior electrochromic automatic-dimming rearview mirrors, automotive electronics, and non-automatic-dimming rearview mirrors for automotive passenger cars, light trucks, pick-up trucks, sport utility vehicles, and vans for original equipment manufacturers, automotive suppliers, and various aftermarket and accessory customers. It also provides variable dimmable windows to aircraft manufacturers and airline operators. In addition, the company offers photoelectric smoke detectors and alarms, electrochemical carbon monoxide alarms and detectors, audible and visual signaling appliances, and bells and speakers used in fire detection systems in office buildings, hotels, and other commercial and residential establishments, as well as researches and develops nanofiber chemical sensing products. Gentex Corporation sells its fire protection products directly, as well as through sales managers and manufacturer representative organizations to fire protection and security product distributors, electrical wholesale houses, and original equipment manufacturers of fire protection systems. The company was founded in 1974 and is headquartered in Zeeland, Michigan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Zeeland"
    },
    "GYT.VI": {
        "short_name": "GOODYEAR TIRE & RUBBER CO",
        "long_name": "The Goodyear Tire & Rubber Company",
        "summary": "The Goodyear Tire & Rubber Company, together with its subsidiaries, develops, manufactures, distributes, and sells tires and related products and services worldwide. It offers various lines of rubber tires for automobiles, trucks, buses, aircrafts, motorcycles, earthmoving and mining equipment, farm implements, industrial equipment, and various other applications under the Goodyear, Dunlop, Kelly, Debica, Sava, Fulda, and various other Goodyear owned house brands, as well as under the private-label brands. The company also retreads truck, aviation, and off-the-road tires; manufactures and sells tread rubber and other tire retreading materials; sells chemical and natural rubber products; and provides automotive and commercial truck maintenance and repair services, and miscellaneous other products and services. It operates approximately 1,000 retail outlets, which offer products for retail sale, and provides repair and other services. The company sells its products worldwide through a network of independent dealers, regional distributors, retail outlets, and retailers. The company has strategic collaboration with ConMet to develop combined digital solutions that connect commercial truck fleets to the health of their tires and wheel ends; and a strategic relationship with UFODRIVE to pursue opportunities to integrate their complementary mobility solutions, including Goodyear's intelligent tire monitoring system and proactive solutions suite and UFODRIVE's advanced eMobility software as a service platform. The Goodyear Tire & Rubber Company was founded in 1898 and is headquartered in Akron, Ohio.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "Akron"
    },
    "HLRD": {
        "short_name": "HILLIARD CORP",
        "long_name": "The Hilliard Corporation",
        "summary": "The Hilliard Corporation designs, manufactures, and sells industrial brakes and braking systems for customers worldwide. It offers liquid fuel filtration products for applications, such as filtration, emission control, ion exchange systems, heat treating, power generation, metalworking, transformers, power utilities, turbines, chemical plants, and more. The company also provides industrial overrunning, intermittent motion, centrifugal, torque limiting, and drivetrain clutches for applications, such as utility and all-terrain vehicles, machine tools, recreation, robotics, mining, mills, industrial vehicles, cranes, marine, lawn and garden, medical equipment, outdoor power equipment, and more. In addition, it offers pneumatic start assembly for applications, which include gas transmission, power generation, turbines, reciprocating engines, oil exploration and gas lift, marine propulsion, and more; and filter presses, poly-presses, wine filters, ceramic membrane, and filter media for mining and metalworking, food and beverage processing, chemical and petrochemical processing, wastewater, cosmetics, pharmaceuticals, and biotech processing applications. Further, the company provides modular brakes, caliper brakes, MK rail and disc brakes, electric brakes, brake boss, brake discs and hubs, and mounting brackets; and hydraulic applied/spring released, spring applied/hydraulic released, pneumatic applied/spring released, spring applied/pneumatic, spring applied/electric released, power unit, brake discs and hubs, and mounting brackets. It serves winches, amusement/stage equipment, cranes, mining/mine hoists, conveyors/material handling, steel mills, lifts/elevators, marine/shipping, renewable energy, and pulp and paper industries. The company sells its products through distributors worldwide. The Hilliard Corporation was founded in 1905 and is based in Elmira, New York.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Elmira"
    },
    "HYGN": {
        "short_name": "HYDROGENETICS INC",
        "long_name": "Hydrogenetics, Inc.",
        "summary": "Hydrogenetics, Inc., through its subsidiary, HydroAxis Technologies, Inc., develops a hydrogen generating system to be used as a complete device for gas and diesel internal combustion engine in various markets worldwide, such as automotive, truck, marine, farm tractors, earth moving vehicles, military, locomotive engines, mining, home heating units, generators, recreation vehicles, fork trucks, and lawn mowers using diesel or gas engines. It also owns Pacific Lights Entertainment, Inc., a film production company that produces small budget films in the comedy and Sci-Fi genres. The company, through its other subsidiary, Buffalo Biodiesel Inc., collects and sources waste vegetable oil from commercial food preparation establishments, and reselling it as raw feedstock to bio-diesel refineries; and sells bio-diesel and yellow grease for the production of bio-diesel to companies in the United States and internationally. The company was formerly known as Global Entertainment Acquisition Corp. and changed its name to Hydrogenetics, Inc. in August 2008. The company is based in Fort Lauderdale, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Fort Lauderdale"
    },
    "HYLN": {
        "short_name": "Hyliion Holdings Corp.",
        "long_name": "Hyliion Holdings Corp.",
        "summary": "Hyliion Holdings Corp. designs, develops, and sells electrified powertrain solutions for the commercial transportation industry. It also provides battery management systems for hybrid and fully electric vehicle applications. The company was founded in 2015 and is headquartered in Cedar Park, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Cedar Park"
    },
    "HZN": {
        "short_name": "Horizon Global Corporation",
        "long_name": "Horizon Global Corporation",
        "summary": "Horizon Global Corporation designs, manufactures, and distributes a range of towing, trailering, cargo management, and other related accessory products worldwide. It operates through Horizon Americas and Horizon Europe-Africa segments. The company provides towing products, such as hitches/tow bars, fifth wheels, gooseneck hitches, weight distribution systems, brake controls, wiring harnesses, draw bars, ball mounts, crossbars, security products, and other towing accessories for attaching a trailer, camper, etc. It also offers trailering products, including brake controls, jacks, winches, couplers, interior and exterior vehicle lighting, and brake replacement parts. In addition, the company provides cargo management products comprising bike racks, roof cross bar systems, cargo carriers, luggage boxes, car interior protective products, loading ramps, and interior travel organizers. Further, it offers other products consisting of tubular push and sports bars, side steps, skid plates, and oil pans. The company sells its products under the Reese, Draw-Tite, Westfalia, Bulldog, BTM, and DHF, as well as Engetran, Fulton, Reese Secure, Reese Explorer, Reese Power Sports, Reese Towpower, ROLA, Tekonsha, WesBarg, and Witter Towbar brands. It serves original equipment(OE) manufacturers and servicers, as well as automotive aftermarket and retail sectors in the agricultural, automotive, construction, fleet, horse/livestock, industrial, marine, military, recreational, trailer, utility, and municipality markets; and consumers through OEs, mass merchants, e-commerce channels, distributors, dealers, and independent installers. The company was incorporated in 2015 is headquartered in Plymouth, Michigan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Plymouth"
    },
    "L1KQ34.SA": {
        "short_name": "LKQ CORP    DRN",
        "long_name": "LKQ Corporation",
        "summary": "LKQ Corporation distributes replacement parts, components, and systems used in the repair and maintenance of vehicles. It operates through three segments: North America, Europe, and Specialty. The company distributes bumper covers, automotive body panels, and lights, as well as automotive glass products, such as windshields; salvage products, including mechanical and collision parts comprising engines; transmissions; door assemblies; sheet metal products, such as trunk lids, fenders, and hoods; lights and bumper assemblies; scrap metal and other materials to metals recyclers; and brake pads, discs and sensors, clutches, steering and suspension products, filters, and oil and automotive fluids, as well as electrical products, including spark plugs and batteries. It also operates self-service retail operations under the LKQ Pick Your Part name; and designs, manufactures, and markets vehicle equipment and accessories. In addition, the company distributes recreational vehicle appliances and air conditioners, towing hitches, truck bed covers, vehicle protection products, cargo management products, wheels, tires, and suspension products. It serves collision and mechanical repair shops, and new and used car dealerships, as well as retail customers. The company operates in the United States, Canada, the United Kingdom, Germany, Belgium, the Netherlands, Luxembourg, Italy, Poland, Slovakia, Austria, Taiwan, and various other European countries. LKQ Corporation was incorporated in 1998 and is headquartered in Chicago, Illinois.",
        "currency": "BRL",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Chicago"
    },
    "LE6N.F": {
        "short_name": "LEAR CORP.  DL-,01",
        "long_name": "Lear Corporation",
        "summary": "Lear Corporation designs, develops, engineers, manufactures, assembles, and supplies automotive seating, and electrical distribution systems and related components for automotive original equipment manufacturers in North America, Europe, Africa, Asia, and South America. Its Seating segment offers seat systems, seat subsystems, key seat components, seat trim covers, seat mechanisms, seat foams, and headrests, as well as surface materials, such as leather and fabric for automobiles and light trucks, compact cars, pick-up trucks, and sport utility vehicles. The company's E-Systems segment provides electrical distribution and connection systems that route electrical signals and networks, and manage electrical power within the vehicle for various powertrains, such as traditional internal combustion engine architectures, hybrid, plug-in hybrid, and battery electric architectures. This segment's products comprise wire harnesses, terminals and connectors, engineered components, and junction boxes; electronic system products, including body domain control modules, smart and passive junction boxes, gateway and communication modules, integrated power modules, and high voltage battery management systems. It also offers software and connected services comprising Xevo Market, an in-vehicle commerce and service platform that connects customers with the brands and services by delivering sales offers through vehicle touch screens and vehicle-branded mobile applications; and software and services for the cloud, vehicles, and mobile devices that enable consumer e-commerce, multi-media applications, and enterprise services. In addition, this segment provides cybersecurity software; advanced vehicle positioning for automated and autonomous driving applications; and short-range communication and cellular protocols for vehicle connectivity. It offers its products and services under the XEVO, GUILFORD, EAGLE OTTAWA, ConfigurE+TM, INTUTM, LEAR CONNEXUSTM, EXOTM, JOURNEYWARE, ProTec, SMART JUNCTION BOXTM, STRUCSURETM, AVENTINO, and TeXstyleTM brands. Lear Corporation was founded in 1917 and is headquartered in Southfield, Michigan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Southfield"
    },
    "LEA": {
        "short_name": "Lear Corporation",
        "long_name": "Lear Corporation",
        "summary": "Lear Corporation designs, develops, engineers, manufactures, assembles, and supplies automotive seating, and electrical distribution systems and related components for automotive original equipment manufacturers in North America, Europe, Africa, Asia, and South America. Its Seating segment offers seat systems, seat subsystems, key seat components, seat trim covers, seat mechanisms, seat foams, and headrests, as well as surface materials, such as leather and fabric for automobiles and light trucks, compact cars, pick-up trucks, and sport utility vehicles. The company's E-Systems segment provides electrical distribution and connection systems that route electrical signals and networks, and manage electrical power within the vehicle for various powertrains, such as traditional internal combustion engine architectures, hybrid, plug-in hybrid, and battery electric architectures. This segment's products comprise wire harnesses, terminals and connectors, engineered components, and junction boxes; electronic system products, including body domain control modules, smart and passive junction boxes, gateway and communication modules, integrated power modules, and high voltage battery management systems. It also offers software and connected services comprising Xevo Market, an in-vehicle commerce and service platform that connects customers with the brands and services by delivering sales offers through vehicle touch screens and vehicle-branded mobile applications; and software and services for the cloud, vehicles, and mobile devices that enable consumer e-commerce, multi-media applications, and enterprise services. In addition, this segment provides cybersecurity software; advanced vehicle positioning for automated and autonomous driving applications; and short-range communication and cellular protocols for vehicle connectivity. It offers its products and services under the XEVO, GUILFORD, EAGLE OTTAWA, ConfigurE+TM, INTUTM, LEAR CONNEXUSTM, EXOTM, JOURNEYWARE, ProTec, SMART JUNCTION BOXTM, STRUCSURETM, AVENTINO, and TeXstyleTM brands. Lear Corporation was founded in 1917 and is headquartered in Southfield, Michigan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Southfield"
    },
    "LKQ": {
        "short_name": "LKQ Corporation",
        "long_name": "LKQ Corporation",
        "summary": "LKQ Corporation distributes replacement parts, components, and systems used in the repair and maintenance of vehicles. It operates through three segments: North America, Europe, and Specialty. The company distributes bumper covers, automotive body panels, and lights, as well as automotive glass products, such as windshields; salvage products, including mechanical and collision parts comprising engines; transmissions; door assemblies; sheet metal products, such as trunk lids, fenders, and hoods; lights and bumper assemblies; scrap metal and other materials to metals recyclers; and brake pads, discs and sensors, clutches, steering and suspension products, filters, and oil and automotive fluids, as well as electrical products, including spark plugs and batteries. It also operates self-service retail operations under the LKQ Pick Your Part name; and designs, manufactures, and markets vehicle equipment and accessories. In addition, the company distributes recreational vehicle appliances and air conditioners, towing hitches, truck bed covers, vehicle protection products, cargo management products, wheels, tires, and suspension products. It serves collision and mechanical repair shops, and new and used car dealerships, as well as retail customers. The company operates in the United States, Canada, the United Kingdom, Germany, Belgium, the Netherlands, Luxembourg, Italy, Poland, Slovakia, Austria, Taiwan, and various other European countries. LKQ Corporation was incorporated in 1998 and is headquartered in Chicago, Illinois.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Chicago"
    },
    "LKQ1.F": {
        "short_name": "LKQ CORP.  DL-,01",
        "long_name": "LKQ Corporation",
        "summary": "LKQ Corporation distributes replacement parts, components, and systems used in the repair and maintenance of vehicles. It operates through three segments: North America, Europe, and Specialty. The company distributes bumper covers, automotive body panels, and lights, as well as automotive glass products, such as windshields; salvage products, including mechanical and collision parts comprising engines; transmissions; door assemblies; sheet metal products, such as trunk lids, fenders, and hoods; lights and bumper assemblies; scrap metal and other materials to metals recyclers; and brake pads, discs and sensors, clutches, steering and suspension products, filters, and oil and automotive fluids, as well as electrical products, including spark plugs and batteries. It also operates self-service retail operations under the LKQ Pick Your Part name; and designs, manufactures, and markets vehicle equipment and accessories. In addition, the company distributes recreational vehicle appliances and air conditioners, towing hitches, truck bed covers, vehicle protection products, cargo management products, wheels, tires, and suspension products. It serves collision and mechanical repair shops, and new and used car dealerships, as well as retail customers. The company operates in the United States, Canada, the United Kingdom, Germany, Belgium, the Netherlands, Luxembourg, Italy, Poland, Slovakia, Austria, Taiwan, and various other European countries. LKQ Corporation was incorporated in 1998 and is headquartered in Chicago, Illinois.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Chicago"
    },
    "MLR": {
        "short_name": "Miller Industries, Inc.",
        "long_name": "Miller Industries, Inc.",
        "summary": "Miller Industries, Inc., together with its subsidiaries, engages in the manufacture and sale of towing and recovery equipment. The company offers wreckers that are used to recover and tow disabled vehicles and other equipment; and car carriers, which are specialized flat-bed vehicles with hydraulic tilt mechanisms that are used to transport new or disabled vehicles and other equipment. It also provides transport trailers for moving various vehicles for auto auctions, car dealerships, leasing companies, and other related applications. The company markets its products under the Century, Vulcan, Challenger, Holmes, Champion, Chevron, Eagle, Titan, Jige, and Boniface brands. It sells its products through independent distributors in the United States, Canada, Mexico, Europe, the Pacific Rim, the Middle East, South America, and Africa; and through prime contractors to governmental entities. The company was founded in 1990 and is based in Ooltewah, Tennessee.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Ooltewah"
    },
    "MMF.F": {
        "short_name": "MODINE MFG  DL -,625",
        "long_name": "Modine Manufacturing Company",
        "summary": "Modine Manufacturing Company provides engineered heat transfer systems and heat transfer components for use in on- and off-highway original equipment manufacturer (OEM) vehicular applications. It operates through Vehicular Thermal Solutions, Commercial and Industrial Solutions, and Building HVAC Systems segments. The company offers powertrain cooling products, including engine cooling assemblies, radiators, condensers, and charge air coolers; auxiliary cooling products, such as power steering and transmission oil coolers; component assemblies; radiators for special applications; on-engine cooling products comprising exhaust gas recirculation, engine oil, fuel, charge air, and intake air coolers; and chillers and cooling plates for battery thermal management. It also provides heat-exchanger and microchannel coils; unit, fluid, transformer oil, and brine coolers, as well as remote condensers; and coatings to protect against corrosion. In addition, the company offers gas-fired, hydronic, electric, and oil-fired unit heaters; indoor and outdoor duct furnaces; infrared units; hydronic products, such as commercial fin-tube radiation, cabinet unit heaters, and convectors; roof-mounted direct- and indirect-fired makeup air units; commercial packaged rooftop ventilation units; unit ventilators; single packaged vertical units; precision air conditioning units for data center applications; air-handling units; chillers; ceiling cassettes; hybrid fan coils; and condensing units. It serves automobile, truck, bus, and specialty vehicle OEMs; agricultural, industrial, and construction equipment OEMs; commercial and industrial equipment OEMs; heating, ventilation, and cooling OEMs; construction architects and contractors; and wholesalers of heating equipment. The company has operations in North America, South America, Europe, the Asia/Pacific, the Middle East, and Africa. Modine Manufacturing Company was founded in 1916 and is headquartered in Racine, Wisconsin.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Racine"
    },
    "MNRO": {
        "short_name": "Monro, Inc.",
        "long_name": "Monro, Inc.",
        "summary": "Monro, Inc. provides automotive undercar repair, and tire sales and services in the United States. It offers range of state inspections services on passenger cars, light trucks, and vans; products and services for brakes; mufflers and exhaust systems; and steering, drive train, suspension, and wheel alignment. The company also provides maintenance services, including oil change, heating and cooling system Â\u0091flush and fill' service, belt installation, fuel system service, and a transmission Â\u0091flush and fill' service. In addition, it replaces and services batteries, starters, and alternators; and offers inspection and air conditioning services. The company operates its stores under the brand names of Monro Auto Service and Tire Centers, Tread Quarters Discount Tire Auto Service Centers, Mr. Tire Auto Service Centers, Autotire Car Care Centers, Tire Warehouse Tires for Less, Tire Barn Warehouse, Ken Towery's Tire & Auto Care, Tire Choice Auto Service Centers, and Car-X Tire & Auto. As of March 28, 2020, it operated 1,283 company-operated stores, 98 franchised locations, eight wholesale locations, three retread facilities, and two dealer-operated stores in 32 states. The company was formerly known as Monro Muffler Brake, Inc. and changed its name to Monro, Inc. in August 2017. Monro, Inc. was founded in 1957 and is headquartered in Rochester, New York.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Rochester"
    },
    "MOD": {
        "short_name": "Modine Manufacturing Company",
        "long_name": "Modine Manufacturing Company",
        "summary": "Modine Manufacturing Company provides engineered heat transfer systems and heat transfer components for use in on- and off-highway original equipment manufacturer (OEM) vehicular applications. It operates through Vehicular Thermal Solutions, Commercial and Industrial Solutions, and Building HVAC Systems segments. The company offers powertrain cooling products, including engine cooling assemblies, radiators, condensers, and charge air coolers; auxiliary cooling products, such as power steering and transmission oil coolers; component assemblies; radiators for special applications; on-engine cooling products comprising exhaust gas recirculation, engine oil, fuel, charge air, and intake air coolers; and chillers and cooling plates for battery thermal management. It also provides heat-exchanger and microchannel coils; unit, fluid, transformer oil, and brine coolers, as well as remote condensers; and coatings to protect against corrosion. In addition, the company offers gas-fired, hydronic, electric, and oil-fired unit heaters; indoor and outdoor duct furnaces; infrared units; hydronic products, such as commercial fin-tube radiation, cabinet unit heaters, and convectors; roof-mounted direct- and indirect-fired makeup air units; commercial packaged rooftop ventilation units; unit ventilators; single packaged vertical units; precision air conditioning units for data center applications; air-handling units; chillers; ceiling cassettes; hybrid fan coils; and condensing units. It serves automobile, truck, bus, and specialty vehicle OEMs; agricultural, industrial, and construction equipment OEMs; commercial and industrial equipment OEMs; heating, ventilation, and cooling OEMs; construction architects and contractors; and wholesalers of heating equipment. The company has operations in North America, South America, Europe, the Asia/Pacific, the Middle East, and Africa. Modine Manufacturing Company was founded in 1916 and is headquartered in Racine, Wisconsin.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Racine"
    },
    "MPAA": {
        "short_name": "Motorcar Parts of America, Inc.",
        "long_name": "Motorcar Parts of America, Inc.",
        "summary": "Motorcar Parts of America, Inc. manufactures, remanufactures, and distributes heavy-duty truck, industrial, marine, and agricultural application replacement parts. The company offers rotating electrical products, including alternators and starters; wheel hub assemblies and bearings; brake-related products comprising brake calipers, brake boosters, and brake master cylinders; and diagnostics and other products, which consist of diagnostics systems and advanced power emulators that are used for development of electric vehicles and aerospace applications, as well as power electronic products for the development and production of electric vehicles and turbochargers. It also designs and manufactures test solutions for performance, endurance, and production testing of electric motors, inverters, alternators, starters, and belt starter generators for the original equipment, aerospace, and aftermarket. The company sells its products to automotive retail chain stores and warehouse distributors, as well as various automobile manufacturers for their aftermarket programs and warranty replacement programs in North America. Motorcar Parts of America, Inc. was founded in 1968 and is headquartered in Torrance, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Torrance"
    },
    "MR2.F": {
        "short_name": "MONRO INC.  DL -,01",
        "long_name": "Monro, Inc.",
        "summary": "Monro, Inc. provides automotive undercar repair, and tire sales and services in the United States. It offers range of state inspections services on passenger cars, light trucks, and vans; products and services for brakes; mufflers and exhaust systems; and steering, drive train, suspension, and wheel alignment. The company also provides maintenance services, including oil change, heating and cooling system Â\u0091flush and fill' service, belt installation, fuel system service, and a transmission Â\u0091flush and fill' service. In addition, it replaces and services batteries, starters, and alternators; and offers inspection and air conditioning services. The company operates its stores under the brand names of Monro Auto Service and Tire Centers, Tread Quarters Discount Tire Auto Service Centers, Mr. Tire Auto Service Centers, Autotire Car Care Centers, Tire Warehouse Tires for Less, Tire Barn Warehouse, Ken Towery's Tire & Auto Care, Tire Choice Auto Service Centers, and Car-X Tire & Auto. As of March 28, 2020, it operated 1,283 company-operated stores, 98 franchised locations, eight wholesale locations, three retread facilities, and two dealer-operated stores in 32 states. The company was formerly known as Monro Muffler Brake, Inc. and changed its name to Monro, Inc. in August 2017. Monro, Inc. was founded in 1957 and is headquartered in Rochester, New York.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Rochester"
    },
    "MTOR": {
        "short_name": "Meritor, Inc.",
        "long_name": "Meritor, Inc.",
        "summary": "Meritor, Inc. designs, develops, manufactures, markets, distributes, sells, services, and supports integrated systems, modules, and components to original equipment manufacturers (OEMs) and the aftermarket for the commercial vehicle, transportation, and industrial sectors. It operates through two segments, Commercial Truck; and Aftermarket and Industrial. The Commercial Truck segment supplies drivetrain systems and components, including axles, drivelines, and braking and suspension systems primarily for medium-and heavy-duty trucks and other applications; and various undercarriage products and systems for trailer applications. The Aftermarket and Industrial segment supplies axles, brakes, drivelines, suspension parts, and other replacement parts to commercial vehicle and industrial aftermarket customers. It also supplies drivetrain systems and various components, such as axles, drivelines, brakes, and suspension systems for military, construction, bus and coach, fire and emergency, and other applications. The company also sells other complementary products, including third-party and private label items, which include brake shoes and friction materials; automatic slack adjusters; yokes and shafts; wheel-end hubs and drums; ABS and stability control systems; shock absorbers and air springs; and air brakes. Meritor, Inc. sells its products under the Meritor, Euclid, Trucktechnic, US Gear, AxleTech, and Mach brands primarily to OEMs, their parts marketing operations, and their dealers, as well as other independent distributors and service garages in the aftermarket industry in North America, South America, Europe, and the Asia Pacific. The company was formerly known as ArvinMeritor, Inc. and changed its name to Meritor, Inc. in March 2011. Meritor, Inc. was founded in 1909 and is headquartered in Troy, Michigan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Troy"
    },
    "MWWC": {
        "short_name": "MARKETING WORLDWIDE CORP",
        "long_name": "Marketing Worldwide Corp",
        "summary": "Marketing Worldwide Corporation, through its subsidiaries, engages in the design, manufacture, painting, and distribution of automotive accessories for motor vehicles in the automotive aftermarket; and industrial components for the commercial machinery industries primarily in North America. The company's primary automotive accessory products services include the refinishing of blow-molded spoilers, front and rear fascia systems, side skirts, door panels, extruded body-side moldings, and interior components. Its principal automotive body components comprise hood scoops, grills, rear deck spoilers, body side moldings, front and rear fascia systems, side skirts, engine components, interior dash components, and large industrial components. The company sells its products to automotive and industrial original equipment manufacturers; and vehicle processing centers, manufacturers, and distributors, as well as through its Tier 1 partner companies. Marketing Worldwide Corporation was incorporated in 2003 and is headquartered in Howell, Michigan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Howell"
    },
    "NTXVF": {
        "short_name": "NEXTEER AUTOMOTIVE GROUP LIMITE",
        "long_name": "Nexteer Automotive Group Limited",
        "summary": "Nexteer Automotive Group Limited, an investment holding company, designs, develops, manufactures, and distributes steering and driveline systems and components for automobile manufacturers and other automotive-related companies. It offers electric power steering (EPS) products, such as column, pinion, and rack assist, as well as dual pinion EPS; EPS remanufacturing products, intermediate shafts, and modular power packs; and hydraulic power steering products, such as magnetic torque overlay, smart flow pumps, power steering pumps and reservoirs, rack and pinion steering gears, and recirculating ball steering gears, as well as aftermarket products. The company also provides steering columns products, including power tilts and telescopes, power rakes and telescopes, one-touch adjustable columns, manual rakes and telescopes, non-adjustable columns, intermediate shafts, and transmission shifters, as well as electronics, modules, and sub-assemblies. In addition, it offers front and rear wheel half shafts, intermediate drive shafts, and propeller shaft constant velocity joints. Further, the company provides advanced driver assistance systems and automated driving technologies comprising steer by wire, steering on demand system, quiet wheel steering, and high availability EPS for resilient operational availability, as well as offers customer support and engineering center services. It operates in North America, the Asia Pacific, Europe, the Middle East, Africa, and South America. The company was founded in 1906 and is headquartered in Auburn Hills, Michigan. Nexteer Automotive Group Limited is a subsidiary of Pacific Century Motors, Inc.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Auburn Hills"
    },
    "ODYC": {
        "short_name": "ODYNE CORPORATION",
        "long_name": "Odyne Corporation",
        "summary": "Odyne Corporation does not have significant operations. Prior to January 20, 2009, it engaged in the design, development, manufacture, and installation of plug-in hybrid electric vehicle propulsion systems for medium and heavy duty trucks and buses in the United States. The company was founded in 2001 and is headquartered in Hauppauge, New York.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Hauppauge"
    },
    "OMTK": {
        "short_name": "OMNITEK ENGINEERING CORP",
        "long_name": "Omnitek Engineering Corp.",
        "summary": "Omnitek Engineering Corp. develops and sells proprietary diesel-to-natural gas engine conversion systems and other products worldwide. The company offers conversion kits for converting diesel engines to run on an alternative fuel, including compressed natural gas, liquefied natural gas, renewable natural gas, and liquid petroleum gas; and natural gas engines and components, as well as high-pressure natural gas coalescing filters. Its products are used for stationary applications; and the transportation market, such as light commercial vehicles, minibuses, heavy-duty trucks, and municipal buses, as well as rail and marine applications. The company sells and delivers its products through its distributors, engine manufacturers, system integrators, fleet operators, and engine conversion companies, as well as directly to end-users. Omnitek Engineering Corp. was founded in 2001 and is headquartered in Vista, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Vista"
    },
    "OPTI": {
        "short_name": "OPTEC INTERNATIONAL INC",
        "long_name": "Optec International, Inc.",
        "summary": "Optec International, Inc. engages in selling and marketing optimized fuel maximizer units in North America and internationally. It markets optimized fuel maximizer for passenger vehicles, intermediate/medium duty trucks, off-road equipment, generator systems, heavy duty diesel on-road vehicles, and transportation refrigeration units. The company was formerly known as Green Meadow Products, Inc. and changed its name to Optec International, Inc. in August 2017. Optec International, Inc. was founded in 2012 and is based in Carlsbad, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Carlsbad"
    },
    "PFTI": {
        "short_name": "PURADYN FILTER TECHNOLOGIES",
        "long_name": "Puradyn Filter Technologies, Inc.",
        "summary": "Puradyn Filter Technologies, Inc. designs, manufactures, markets, and distributes bypass oil filtration systems for use with internal combustion engines and hydraulic equipment that use lubricating oil worldwide. The company offers its products under the Puradyn brand name. Its Puradyn system cleans oil by providing a second circuit of oil filtration and treatment to continually remove solid and liquid contaminants from the oil through a filtration and absorption process. The company also manufactures replacement filter elements for the Puradyn system. Its products are marketed to various industries that include hydraulic applications, and other users of engines or equipment that utilize up to 50 weight oil for lubrication. The company sells its products directly, as well as through manufacturer's representatives, distributors, or other agents to OEMs, other distributors, and national accounts. It serves oil and gas services, power generation, construction and forestry, commercial marine, mining, and transportation industries. The company was founded in 1987 and is based in Boynton Beach, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Boynton Beach"
    },
    "PLNTQ": {
        "short_name": "PROLIANCE INTERNATIONAL INC",
        "long_name": "Proliance International, Inc.",
        "summary": "Proliance International, Inc. designs, manufactures, and markets heat exchange products and temperature control parts for the automotive and light truck aftermarket, as well as heat exchange products. The company's heat exchange products include radiators, heater cores, heaters, radiator cores, and condensers; and temperature control parts comprise condensers, compressors, accumulators/driers, and evaporators. It also offers air conditioning parts and supplies, such as hose and tube assemblies, expansion valves, blowers, and fan clutches. In addition, the company provides charge air coolers, oil coolers, marine coolers, and other specialty heat exchangers for heavy-duty trucks, buses, specialty equipment, and industrial and marine applications, such as agricultural, construction and military vehicles, oil rigs, stationary power generation equipment, and inland sea-going vessels. Its customers include national retailers of aftermarket automotive products, warehouse distributors, radiator shops, hard parts jobbers, and other manufacturers. The company offers its products in the United States, Canada, Mexico, Europe, and Central America. Proliance International, Inc. was formerly known as Transpro, Inc. and changed its name to Proliance International, Inc. in July 2005. The company was founded in 1915 and is based in New Haven, Connecticut.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New Haven"
    },
    "PLOW": {
        "short_name": "Douglas Dynamics, Inc.",
        "long_name": "Douglas Dynamics, Inc.",
        "summary": "Douglas Dynamics, Inc. operates as a manufacturer and upfitter of commercial work truck attachments and equipment in North America. It operates through two segments, Work Truck Attachments and Work Truck Solutions. The Work Truck Attachments segment manufactures and sells snow and ice control attachments, including snowplows, and sand and salt spreaders for light trucks and heavy duty trucks, as well as various related parts and accessories. The Work Truck Solutions segment primarily manufactures municipal snow and ice control products; provides truck and vehicle upfits where it attaches component pieces of equipment, truck bodies, racking, and storage solutions to a vehicle chassis for use by end users for work related purposes; and manufactures storage solutions for trucks and vans, and cable pulling equipment for trucks. This segment also offers up-fit and storage solutions. It also provides customized turnkey solutions to governmental agencies, such as Departments of Transportation and municipalities. The company sells its products under the BLIZZARD, FISHER, HENDERSON, SNOWEX, WESTERN, TURFEX, SWEEPEX, HENDERSON, and DEJANA brands. It distributes its products primarily to professional snowplowers who are contracted to remove snow and ice from commercial and residential areas. The company was founded in 1948 and is headquartered in Milwaukee, Wisconsin.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Milwaukee"
    },
    "QA4A.F": {
        "short_name": "GENTHERM INC. A",
        "long_name": "Gentherm Incorporated",
        "summary": "Gentherm Incorporated designs, develops, manufactures, and markets thermal management technologies. The company operates through two segments, Automotive and Medical. The Automotive segment offers climate comfort system solutions, which include seat heaters, blowers, and thermoelectric devices for variable temperature climate control seats and steering wheel heaters that are designed to provide thermal comfort to automobile passengers; integrated electronic components, such as electronic control units that utilize proprietary electronics technology and software; and other climate comfort system solutions, including neck conditioners and climate control system products for door panels, armrests, cupholders, and storage bins. It also provides battery performance solutions, including cell connecting devices for various types of automotive batteries, as well as thermal management products for heating and cooling 12V, 48V, and high voltage batteries and battery modules; and automotive electronic and software systems comprising electronic control units for climate comfort systems, as well as for memory seat modules and other devices. This segment serves light vehicle original equipment manufacturers (OEMs), commercial vehicle OEMs, and first tier suppliers to the automotive OEMs, including automotive seat manufacturers, as well as aftermarket seat distributors and installers. The Medical segment offers patient temperature management systems. The company provides its products and services in the United States, Germany, Canada, China, Hungary, Japan, Korea, the Czech Republic, Macedonia, Malta, Mexico, the United Kingdom, Ukraine, and Vietnam. The company was formerly known as Amerigon Incorporated and changed its name to Gentherm Incorporated in September 2012. Gentherm Incorporated was incorporated in 1991 and is headquartered in Northville, Michigan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Northville"
    },
    "QS": {
        "short_name": "QuantumScape Corporation",
        "long_name": "QuantumScape Corporation",
        "summary": "QuantumScape Corporation, a development stage company, engages in the development and commercialization of solid-state lithium-metal batteries for electric vehicles and other applications. The company was founded in 2010 and is headquartered in San Jose, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "San Jose"
    },
    "RAB.F": {
        "short_name": "DORMAN PRODUCTS  DL-,01",
        "long_name": "Dorman Products, Inc.",
        "summary": "Dorman Products, Inc. supplies replacement parts and fasteners for passenger cars, light trucks, and heavy-duty trucks in the automotive aftermarket industry in the United States, Canada, Mexico, Europe, the Middle East, and Australia. It offers original equipment dealer products, such as intake and exhaust manifolds, window regulators, radiator fan assemblies, tire pressure monitor sensors, exhaust gas recirculation coolers, and complex electronics modules; fluid reservoirs, variable valve timing components, complex electronics, and integrated door lock actuators; and oil drain plugs, and wheel bolts and lug nuts. The company also provides automotive replacement parts comprising door handles, keyless remotes and cases, and door hinge repairs; and heavy duty aftermarket parts for class 4-8 vehicles, such as lighting, cooling, engine management, wheel hardware, air tanks, and cab products. In addition, it offers powertrain products, including cooling products, harmonic balancers, fluid lines and reservoirs, connectors, 4-wheel drive components, other engine, and transmission and axle components; and chassis products consisting of control arms, brake hardware and hydraulics, axle hardware, suspension arms, knuckles, links, bushings, and other suspension, steering, and brake components. Further, it provides automotive body products, such as window lift motors, switches and handles, wiper, and other interior and exterior automotive body components; and hardware products comprising threaded bolts; auto body and home electrical wiring components; and other hardware assortments and merchandise. The company offers its products under the OE Solutions, HELP!, and HD Solutions brands through automotive aftermarket retailers, including on-line platforms; national, regional, and local warehouse distributors; and specialty markets; salvage yards; local independent parts wholesalers; and mass merchants. The company was founded in 1918 and is headquartered in Colmar, Pennsylvania.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Colmar"
    },
    "RMO": {
        "short_name": "Romeo Power, Inc.",
        "long_name": "Romeo Power, Inc.",
        "summary": "Romeo Power, Inc., an energy storage technology company, designs and manufactures lithium-ion battery modules and packs for commercial electric vehicles in North America. The company operates through two segments, Romeo Power North America and Joint Venture Support. The Romeo Power North America segment designs and manufactures battery modules, battery packs, and battery management system technologies in North America. The Joint Venture Support segment provides design, research and development, and other engineering related services. It serves commercial and high-performance electric vehicle manufacturers, fleet operators, and automobile and recreational vehicle manufacturers. The company was founded in 2014 and is headquartered in Vernon, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Vernon"
    },
    "SAAX": {
        "short_name": "NOUVEAU VENTURES INC",
        "long_name": "Nouveau Ventures Inc.",
        "summary": "Nouveau Ventures Inc. focuses on the development of the Quantumcharger technology. Its Quantumcharger technology is a patented technology for optimizing airflow to internal combustion engines. The company was founded in 2011 and is based in Palmdale, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Palmdale"
    },
    "SHLOQ": {
        "short_name": "Shiloh Industries, Inc.",
        "long_name": "Shiloh Industries, Inc.",
        "summary": "Shiloh Industries, Inc., together with its subsidiaries, designs, engineers, and manufactures lightweight technologies for the automotive and commercial vehicle markets worldwide. It produces components primarily for body structure, chassis, and propulsion systems. The company offers solution materials, including aluminum, magnesium, steel, high strength steel alloys, and acoustic laminates; body structure components, such as shock towers, instrument panels/cross car beams, torque boxes, tunnel and seat supports, seat back frames, hinge pillars, liftgates, door inners, roof supports/roof panels, dashpanels, and body sides; and chassis systems components comprising cross members, frame rails, axle carriers, bearing caps, axle covers, PTU covers, axle tubes, rack and pinion housings, steering column housings, knuckles, links, wheel hubs, steering pumps, brake components, wheel blanks, and flanges. It also provides propulsion systems components consisting of battery boxes and closures, beam axle housings, planetary carriers, clutch housings, transmission gear housings, engine valve covers, valve bodies, rocker arm spacers, heat shields, exhaust manifolds, cones, baffles, muffler shells, engine oil pans, transmission fluid pans, front covers, and transmission covers. In addition, the company produces structural products, such as charger boxes, control boxes, motor housings, battery covers, battery box trays, and battery box rails for electric vehicles. It offers its products under the BlankLight, CastLight, StampLight, and ShilohCore brands. The company serves original equipment manufacturers and tier 1 suppliers. Shiloh Industries, Inc. was founded in 1950 and is headquartered in Valley City, Ohio. On August 30, 2020, Shiloh Industries, Inc., along with its affiliates, filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the District of Delaware.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Valley City"
    },
    "SI4.SG": {
        "short_name": "SHILOH INDUSTRIES INC. Register",
        "long_name": "Shiloh Industries, Inc.",
        "summary": "Shiloh Industries, Inc., together with its subsidiaries, designs, engineers, and manufactures lightweight technologies for the automotive and commercial vehicle markets worldwide. It produces components primarily for body structure, chassis, and propulsion systems. The company offers solution materials, including aluminum, magnesium, steel, high strength steel alloys, and acoustic laminates; body structure components, such as shock towers, instrument panels/cross car beams, torque boxes, tunnel and seat supports, seat back frames, hinge pillars, liftgates, door inners, roof supports/roof panels, dashpanels, and body sides; and chassis systems components comprising cross members, frame rails, axle carriers, bearing caps, axle covers, PTU covers, axle tubes, rack and pinion housings, steering column housings, knuckles, links, wheel hubs, steering pumps, brake components, wheel blanks, and flanges. It also provides propulsion systems components consisting of battery boxes and closures, beam axle housings, planetary carriers, clutch housings, transmission gear housings, engine valve covers, valve bodies, rocker arm spacers, heat shields, exhaust manifolds, cones, baffles, muffler shells, engine oil pans, transmission fluid pans, front covers, and transmission covers. In addition, the company produces structural products, such as charger boxes, control boxes, motor housings, battery covers, battery box trays, and battery box rails for electric vehicles. It offers its products under the BlankLight, CastLight, StampLight, and ShilohCore brands. The company serves original equipment manufacturers and tier 1 suppliers. Shiloh Industries, Inc. was founded in 1950 and is headquartered in Valley City, Ohio. On August 30, 2020, Shiloh Industries, Inc., along with its affiliates, filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the District of Delaware. The plan was later approved as Chapter 11 liquidation on May 7, 2021.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United States",
        "city": "Valley City"
    },
    "SJS.F": {
        "short_name": "SYPRIS SOLUT.INC.  DL-,01",
        "long_name": "Sypris Solutions, Inc.",
        "summary": "Sypris Solutions, Inc. provides truck components, oil and gas pipeline components, and aerospace and defense electronics primarily in North America and Mexico. It operates through two segments, Sypris Technologies and Sypris Electronics. The Sypris Technologies segment supplies forged, machined, welded, and heat-treated steel components for the commercial vehicle, off highway vehicle, recreational vehicle, automotive, industrial, light truck, and energy markets. This segment also offers drive train components, including axle shafts, transmission shafts, gear sets, steer axle knuckles, and other components for automotive and truck manufacturers. In addition, it provides value added operations for drive train assemblies; and manufactures pressure closures and other fabricated products for oil and gas pipelines. The Sypris Electronics segment offers electronic manufacturing services, such as circuit card and full box build manufacturing, high reliability manufacturing, systems assembly and integration, design for manufacturability, and design for specification work for aerospace and defense electronics market. This segment also provides circuit card assembly services for electronic sensors and systems, including radar and targeting systems, tactical ground stations, navigation systems, weapons systems, and targeting and warning systems; and value added solutions, such as low-volume prototype assembly and high-volume turnkey manufacturing. The company also offers engineering design and repair or inspection services. In addition, it sells its engineered product under the Tube Turns brand. The company was incorporated in 1997 and is headquartered in Louisville, Kentucky.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Louisville"
    },
    "SMP": {
        "short_name": "Standard Motor Products, Inc.",
        "long_name": "Standard Motor Products, Inc.",
        "summary": "Standard Motor Products, Inc. manufactures and distributes replacement parts for motor vehicles in the automotive aftermarket industry. The Engine Management segment offers components for the ignition, electrical, emissions, fuel and safety-related systems of motor vehicles under the Standard, SMP Blue Streak, Intermotor, Standard Diesel, BWD Select, BWD, OEM, TechSmart, Tech Expert, GP Sorensen, LockSmart, and Pollak brand names, as well as under private labels comprising NAPA Echlin and NAPA Belden. This segment's products include electronic ignition control modules, camshaft and crankshaft position sensors, distributor caps, rotors, ignition wires and coils, switches and relays, EGR valves and variable valve timing components, mass airflow and fuel pressure sensors, and new and remanufactured diesel injectors and pumps, as well as anti-lock brake, vehicle speed, tire pressure monitoring, and park assist sensors. The Temperature Control segment provides components for the temperature control systems, engine cooling systems, power window accessories, and windshield washer systems of motor vehicles under the Four Seasons, EVERCO, ACI, Hayden, Pro Source, and Factory Air brands. It provides air conditioning compressors, air conditioning repair kits, clutch assemblies, blower and radiator fan motors, filter dryers, evaporators, accumulators, hose assemblies, thermal expansion devices, heater valves and cores, A/C service tools and chemicals, fan assemblies and clutches, oil coolers, window lift motors, window regulators and assemblies, and windshield washer pumps. The company sells its products primarily to automotive aftermarket retailers, program distribution groups, warehouse distributors, original equipment manufacturers, and original equipment service part operations in the United States, Canada, Mexico, Europe, Asia, and other Latin American countries. Standard Motor Products, Inc. was founded in 1919 and is headquartered in Long Island City, New York.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Long Island City"
    },
    "SNSGF": {
        "short_name": "SENSE TECHNOLOGIES INC",
        "long_name": "Sense Technologies, Inc.",
        "summary": "Sense Technologies, Inc. develops and markets automotive safety devices that enhance driver awareness of people or obstacles located in vehicle blind spots in the United States. It offers Guardian Alert Doppler awareness system, which warns vehicle drivers of the presence of people or obstacles in blind spots that exist behind their vehicles when backing up. The company markets its Guardian Alert product primarily to automobile and truck dealers, fleet operators, and other after-market automotive industry participants. It also offers ScopeOut, a system of specially designed mirrors that are placed at specific points on automobiles, trucks, sport utility vehicles, or commercial vehicles to provide drivers a complete view behind the vehicle. The company markets its ScopeOut product to department stores and other retailers as an after-market automotive safety product, as well as sells online at sensetech.com. The company was formerly known as Graham Gold Mining Corporation and changed its name to Sense Technologies, Inc. in October 1997. Sense Technologies, Inc. was founded in 1988 and is based in Grand Island, Nebraska.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Grand Island"
    },
    "SPD.F": {
        "short_name": "SUPERIOR INDUSTRIES INTL",
        "long_name": "Superior Industries International, Inc.",
        "summary": "Superior Industries International, Inc. designs, manufactures, and sells aluminum wheels to the original equipment manufacturers and aftermarket distributors in North America and Europe. The company supplies aluminum wheels to the automobile and light truck manufacturers. It offers its products under the ATS, RIAL, ALUTEC, and ANZIO brand names. The company was founded in 1957 and is headquartered in Southfield, Michigan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Southfield"
    },
    "SRI": {
        "short_name": "Stoneridge, Inc.",
        "long_name": "Stoneridge, Inc.",
        "summary": "Stoneridge, Inc., together with its subsidiaries, designs and manufactures engineered electrical and electronic components, modules, and systems for the automotive, commercial, off-highway, motorcycle, and agricultural vehicle markets in North America, South America, Europe, and internationally. The company operates in three segments: Control Devices, Electronics, and Stoneridge Brazil. The Control Devices segment offers sensors, switches, actuators, and connectors that monitor, measure, or activate specific functions within a vehicle. The Electronics segment designs and manufactures driver information systems, camera-based vision systems, connectivity, and compliance products. Its products collect, store, and display vehicle information, such as speed, pressure, maintenance data, trip information, operator performance, temperature, distance traveled, and driver messages related to vehicle performance. This segment's electronic control units regulate, coordinate, monitor, and direct the operation of the electrical system within a vehicle. The Stoneridge Brazil segment designs, manufactures, and sells vehicle tracking devices and monitoring services; vehicle security alarms and convenience accessories; in-vehicle audio and infotainment devices; and telematics solutions. It provides its products and systems to various original equipment manufacturers and Tier 1 customers, as well as aftermarket distributors and mass merchandisers for use in various vehicle platforms. Stoneridge, Inc. was founded in 1965 and is headquartered in Novi, Michigan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Novi"
    },
    "SRU.F": {
        "short_name": "STAND. MOTOR PROD.  DL 2",
        "long_name": "Standard Motor Products, Inc.",
        "summary": "Standard Motor Products, Inc. manufactures and distributes replacement parts for motor vehicles in the automotive aftermarket industry. The Engine Management segment offers components for the ignition, electrical, emissions, fuel and safety-related systems of motor vehicles under the Standard, SMP Blue Streak, Intermotor, Standard Diesel, BWD Select, BWD, OEM, TechSmart, Tech Expert, GP Sorensen, LockSmart, and Pollak brand names, as well as under private labels comprising NAPA Echlin and NAPA Belden. This segment's products include electronic ignition control modules, camshaft and crankshaft position sensors, distributor caps, rotors, ignition wires and coils, switches and relays, EGR valves and variable valve timing components, mass airflow and fuel pressure sensors, and new and remanufactured diesel injectors and pumps, as well as anti-lock brake, vehicle speed, tire pressure monitoring, and park assist sensors. The Temperature Control segment provides components for the temperature control systems, engine cooling systems, power window accessories, and windshield washer systems of motor vehicles under the Four Seasons, EVERCO, ACI, Hayden, Pro Source, and Factory Air brands. It provides air conditioning compressors, air conditioning repair kits, clutch assemblies, blower and radiator fan motors, filter dryers, evaporators, accumulators, hose assemblies, thermal expansion devices, heater valves and cores, A/C service tools and chemicals, fan assemblies and clutches, oil coolers, window lift motors, window regulators and assemblies, and windshield washer pumps. The company sells its products primarily to automotive aftermarket retailers, program distribution groups, warehouse distributors, original equipment manufacturers, and original equipment service part operations in the United States, Canada, Mexico, Europe, Asia, and other Latin American countries. Standard Motor Products, Inc. was founded in 1919 and is headquartered in Long Island City, New York.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Long Island City"
    },
    "STCC": {
        "short_name": "STERLING CONS CORP NEV",
        "long_name": "Sterling Consolidated Corp.",
        "summary": "Sterling Consolidated Corp., through its subsidiaries, distributes and sells O-rings and other rubber products worldwide. It provides rubber seals, oil seals, custom molded rubber parts, custom Teflon parts, Teflon rods, O-ring cords, bonded seals, O-ring kits, and stuffing box sealant products for use in automotive, pump, transmission, oil and energy, machinery, and packaging industries. The company also offers freight forwarding and related services; and rents commercial space to third parties. It serves smaller distributors and original equipment manufacturers. The company was formerly known as Oceanview Acquisition Corp. and changed its name to Sterling Consolidated Corp. in May 2012. Sterling Consolidated Corp. was founded in 1970 and is headquartered in Neptune, New Jersey.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Neptune"
    },
    "STRT": {
        "short_name": "STRATTEC SECURITY CORPORATION",
        "long_name": "Strattec Security Corporation",
        "summary": "Strattec Security Corporation designs, develops, manufactures, and markets automotive access control products under the VAST Automotive Group brand primarily in North America. The company offers mechanical and electronically enhanced locks and keys, passive entry passive start systems, steering column and instrument panel ignition lock housings, latches, power sliding side door systems, power tailgate and lift gate systems, power deck lid systems, door handles, and related products. It also provides full service and aftermarket support services for its products. The company markets its products to automotive and light truck original equipment manufacturers, as well as other transportation-related manufacturers; and through wholesale distributors, other marketers, and users of component parts, as well as certain products to non-automotive commercial customers. It also exports its products to Europe, Asia, and South America. Strattec Security Corporation was founded in 1908 and is headquartered in Milwaukee, Wisconsin.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "city": "Milwaukee"
    },
    "SUP": {
        "short_name": "Superior Industries Internation",
        "long_name": "Superior Industries International, Inc.",
        "summary": "Superior Industries International, Inc. designs, manufactures, and sells aluminum wheels to the original equipment manufacturers and aftermarket distributors in North America and Europe. The company supplies aluminum wheels to the automobile and light truck manufacturers. It offers its products under the ATS, RIAL, ALUTEC, and ANZIO brand names. The company was founded in 1957 and is headquartered in Southfield, Michigan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Southfield"
    },
    "SVTE": {
        "short_name": "SERVICE TEAM INC",
        "long_name": "Service Team Inc.",
        "summary": "Service Team Inc. manufactures, maintains, and repairs truck bodies in the United States. It manufactures truck bodies that are attached to a truck chassis; and other products used by the trucking industry. The vans are available for hauling dry freight or refrigerated freight. It serves auto dealers and users of trucks, such as dairies, food distributors, and local delivery. The company was founded in 2011 and is based in Villa Park, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Villa Park"
    },
    "SYPR": {
        "short_name": "Sypris Solutions, Inc.",
        "long_name": "Sypris Solutions, Inc.",
        "summary": "Sypris Solutions, Inc. provides truck components, oil and gas pipeline components, and aerospace and defense electronics primarily in North America and Mexico. It operates through two segments, Sypris Technologies and Sypris Electronics. The Sypris Technologies segment supplies forged, machined, welded, and heat-treated steel components for the commercial vehicle, off highway vehicle, recreational vehicle, automotive, industrial, light truck, and energy markets. This segment also offers drive train components, including axle shafts, transmission shafts, gear sets, steer axle knuckles, and other components for automotive and truck manufacturers. In addition, it provides value added operations for drive train assemblies; and manufactures pressure closures and other fabricated products for oil and gas pipelines. The Sypris Electronics segment offers electronic manufacturing services, such as circuit card and full box build manufacturing, high reliability manufacturing, systems assembly and integration, design for manufacturability, and design for specification work for aerospace and defense electronics market. This segment also provides circuit card assembly services for electronic sensors and systems, including radar and targeting systems, tactical ground stations, navigation systems, weapons systems, and targeting and warning systems; and value added solutions, such as low-volume prototype assembly and high-volume turnkey manufacturing. The company also offers engineering design and repair or inspection services. In addition, it sells its engineered product under the Tube Turns brand. The company was incorporated in 1997 and is headquartered in Louisville, Kentucky.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "city": "Louisville"
    },
    "TEN": {
        "short_name": "Tenneco Inc.",
        "long_name": "Tenneco Inc.",
        "summary": "Tenneco Inc. designs, manufactures, and sells clean air, powertrain, and ride performance products and systems for light vehicle, commercial truck, off-highway, industrial, and aftermarket customers worldwide. The company operates through Clean Air, Powertrain, Ride Performance, and Motorparts segments. It offers clean air products and systems, including catalytic converters and diesel oxidation catalysts; diesel particulate filters(DPFs); burner systems; lean nitrogen oxide (NOx) traps; selective catalytic reduction (SCR) systems; hydrocarbon vaporizers and injectors; SCR-coated diesel particulate filters systems; urea dosing systems; four-way catalysts; alternative NOx reduction technologies; mufflers and resonators; fabricated exhaust manifolds; pipes; hydroformed assemblies; elastomeric hangers and isolators; and aftertreatment control units. The company also provides powertrain products and systems, such as pistons; piston rings; cylinder liners; valve seats and guides; bearings; spark plugs; valvetrain products; system protection products; and seals and gaskets. In addition, it offers motor parts, including steering and suspension, braking, sealing, engine, emission, and maintenance products, as well as shocks and struts; and ride performance products and systems comprising advanced suspension technologies, and ride control and braking products, as well as noise, vibration, and harshness performance materials. The company was formerly known as Tenneco Automotive Inc. and changed its name to Tenneco Inc. in 2005. Tenneco Inc. was founded in 1996 and is headquartered in Lake Forest, Illinois.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Lake Forest"
    },
    "THRM": {
        "short_name": "Gentherm Inc",
        "long_name": "Gentherm Incorporated",
        "summary": "Gentherm Incorporated designs, develops, manufactures, and markets thermal management technologies. The company operates through two segments, Automotive and Medical. The Automotive segment offers climate comfort system solutions, which include seat heaters, blowers, and thermoelectric devices for variable temperature climate control seats and steering wheel heaters that are designed to provide thermal comfort to automobile passengers; integrated electronic components, such as electronic control units that utilize proprietary electronics technology and software; and other climate comfort system solutions, including neck conditioners and climate control system products for door panels, armrests, cupholders, and storage bins. It also provides battery performance solutions, including cell connecting devices for various types of automotive batteries, as well as thermal management products for heating and cooling 12V, 48V, and high voltage batteries and battery modules; and automotive electronic and software systems comprising electronic control units for climate comfort systems, as well as for memory seat modules and other devices. This segment serves light vehicle original equipment manufacturers (OEMs), commercial vehicle OEMs, and first tier suppliers to the automotive OEMs, including automotive seat manufacturers, as well as aftermarket seat distributors and installers. The Medical segment offers patient temperature management systems. The company provides its products and services in the United States, Germany, Canada, China, Hungary, Japan, Korea, the Czech Republic, Macedonia, Malta, Mexico, the United Kingdom, Ukraine, and Vietnam. The company was formerly known as Amerigon Incorporated and changed its name to Gentherm Incorporated in September 2012. Gentherm Incorporated was incorporated in 1991 and is headquartered in Northville, Michigan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Northville"
    },
    "TI2.F": {
        "short_name": "COOPER TIRE RUBBER  DL 1",
        "long_name": "Cooper Tire & Rubber Company",
        "summary": "Cooper Tire & Rubber Company, together with its subsidiaries, designs, manufactures, markets, and sells replacement tires in North America, Latin America, Europe, and Asia. The company operates through Americas Tire Operations and International Tire Operations segments. It offers passenger car, light truck, truck and bus radial (TBR), motorcycle, and racing tires, as well as tire retread materials; and markets and distributes racing, TBR, and motorcycle tires. The company sells its products to independent tire dealers, wholesale distributors, regional and national retail tire chains, large retail chains, and other tire and automotive product retail chains, mass merchandisers, and digital channels as well as original equipment manufacturers; and directly to end users through three owned retail stores. Cooper Tire & Rubber Company was founded in 1914 and is headquartered in Findlay, Ohio.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Findlay"
    },
    "TNN.F": {
        "short_name": "TENNECO INC. CL.A DL -,01",
        "long_name": "Tenneco Inc.",
        "summary": "Tenneco Inc. designs, manufactures, and sells clean air, powertrain, and ride performance products and systems for light vehicle, commercial truck, off-highway, industrial, and aftermarket customers worldwide. The company operates through Clean Air, Powertrain, Ride Performance, and Motorparts segments. It offers clean air products and systems, including catalytic converters and diesel oxidation catalysts; diesel particulate filters(DPFs); burner systems; lean nitrogen oxide (NOx) traps; selective catalytic reduction (SCR) systems; hydrocarbon vaporizers and injectors; SCR-coated diesel particulate filters systems; urea dosing systems; four-way catalysts; alternative NOx reduction technologies; mufflers and resonators; fabricated exhaust manifolds; pipes; hydroformed assemblies; elastomeric hangers and isolators; and aftertreatment control units. The company also provides powertrain products and systems, such as pistons; piston rings; cylinder liners; valve seats and guides; bearings; spark plugs; valvetrain products; system protection products; and seals and gaskets. In addition, it offers motor parts, including steering and suspension, braking, sealing, engine, emission, and maintenance products, as well as shocks and struts; and ride performance products and systems comprising advanced suspension technologies, and ride control and braking products, as well as noise, vibration, and harshness performance materials. The company was formerly known as Tenneco Automotive Inc. and changed its name to Tenneco Inc. in 2005. Tenneco Inc. was founded in 1996 and is headquartered in Lake Forest, Illinois.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Lake Forest"
    },
    "TXIC": {
        "short_name": "TONGXIN INTERNATIONAL LTD",
        "long_name": "Tongxin International, Ltd.",
        "summary": "Tongxin International, Ltd., through its subsidiary, Hunan Tongxin Enterprise Co Ltd., designs, manufactures, assembles, and sells engineered vehicle body structures (EVBS) in China. It supplies small, light, medium, and heavy truck EVBS covering cab forward and cab over engine layouts. The company also designs, fabricates, and tests dies and molds used in the vehicle body structure manufacturing process. Its EVBS consist of exterior body panels, including doors, floor pans, hoods, side panels, and fenders. The company serves light passenger and commercial vehicle market segments, and light vehicle market segments. It exports its products to Southeast Asia and the Middle East. The company was founded in 1984 and is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Los Angeles"
    },
    "UFAB": {
        "short_name": "Unique Fabricating, Inc.",
        "long_name": "Unique Fabricating, Inc.",
        "summary": "Unique Fabricating, Inc. engineers and manufactures multi-material foam, rubber, and plastic components utilized in noise, vibration, harshness, acoustical management, water and air sealing, decorative, and other functional applications. The company offers die cut non-metallic materials and components, such as precision die cutting, thermoforming, fusion molding, and reaction injection molding polyurethane products; thermoformed molded products, including heating, ventilation, and air conditioning (HVAC) air ducts, as well as door water shields, HVAC evaporator liners, console bin mats and fender insulators, and others; fusion molded products comprising exterior mirror seals, cowl-to-hood seals, and cowl-to-fender seals, as well as other noise, vibration, and harshness management and sealing applications, such as fillers, spacers, and gaskets; and reaction injection molded products, including rigid foam, integral-skin, viscoelastic, energy absorbing, and high resilience. Unique Fabricating, Inc. sells its products to transportation, medical, marine, military, consumer off-road, construction, athletic equipment, packaging, sporting goods, office furniture, wind blade, appliance, industrial, HVAC, and automotive and heavy-duty truck markets in North America. The company was founded in 1975 and is headquartered in Auburn Hills, Michigan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "city": "Auburn Hills"
    },
    "UFMG": {
        "short_name": "UNIVERSAL MFG CO",
        "long_name": "Universal Mfg. Co.",
        "summary": "Universal Mfg. Co. remanufactures and distributes electric fuel pumps, transfer cases, calipers, transmission assembles, and other automotive parts for various makes and models of vehicles. The company, through its subsidiaries, is also involved in the assembly, manufacture, distribution, and sale of specialty manlift products and mobile hydraulic equipment, such as hazardous environment, scissor, pedestal, aerial, clean room, and explosion proof lifts; design, manufacture, and assembly of products related to armor for military equipment for the United States government; and cutting, forming, bending, welding, and assembling of steel for original equipment manufacturers and other customers that have need for large and heavy gauge steel parts and products. It serves automotive dealers, jobbers, repair shops, and other automotive parts distributors located in the United States and Canada. The company was incorporated in 1945 and is based in Lincoln, Nebraska.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Lincoln"
    },
    "VC": {
        "short_name": "Visteon Corporation",
        "long_name": "Visteon Corporation",
        "summary": "Visteon Corporation engineers, designs, and manufactures automotive electronics and connected car solutions for vehicle manufacturers worldwide. The company provides instrument clusters, including standard analog gauge clusters to high-resolution, all-digital, fully reconfigurable, 2-D, and 3-D display-based devices; information displays that integrate a range of user interface technologies and graphics management capabilities, such as 3-D, dual view, cameras, optics, haptic feedback, light effects, and dual displays; and Phoenix, a display audio and embedded infotainment platform, as well as onboard artificial intelligence based voice assistant. It also offers wired and wireless battery management systems; telematics control unit to enable secure connected car services, software updates, and data, as well as hands-free telephone unit; and head-up displays (HUD), such as combiner HUD and windshield HUD that present critical information to the driver. In addition, the company provides SmartCore, an automotive-grade, integrated domain controller to enhance efficiency, and reduce power consumption and cost; and DriveCore, a platform for addressing multiple levels of vehicle automation. Visteon Corporation was incorporated in 2000 and is headquartered in Van Buren, Michigan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Van Buren"
    },
    "VS51.F": {
        "short_name": "VISTEON CORP.NEW  DL-,01",
        "long_name": "Visteon Corporation",
        "summary": "Visteon Corporation engineers, designs, and manufactures automotive electronics and connected car solutions for vehicle manufacturers worldwide. The company provides instrument clusters, including standard analog gauge clusters to high-resolution, all-digital, fully reconfigurable, 2-D, and 3-D display-based devices; information displays that integrate a range of user interface technologies and graphics management capabilities, such as 3-D, dual view, cameras, optics, haptic feedback, light effects, and dual displays; and Phoenix, a display audio and embedded infotainment platform, as well as onboard artificial intelligence based voice assistant. It also offers wired and wireless battery management systems; telematics control unit to enable secure connected car services, software updates, and data, as well as hands-free telephone unit; and head-up displays (HUD), such as combiner HUD and windshield HUD that present critical information to the driver. In addition, the company provides SmartCore, an automotive-grade, integrated domain controller to enhance efficiency, and reduce power consumption and cost; and DriveCore, a platform for addressing multiple levels of vehicle automation. Visteon Corporation was incorporated in 2000 and is headquartered in Van Buren, Michigan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Van Buren"
    },
    "VYDR": {
        "short_name": "VYDROTECH INC",
        "long_name": "Vydrotech, Inc.",
        "summary": "Vydrotech, Inc., a green technology company, designs, develops, and manufactures green eco-friendly alternative energy/power products and systems in the United States. The company offers H2GO hydrogen enhanced fuel systems for commercial diesel engines in the trucking, bus, and marine industries. It also provides capital and operating lease option on its products. The company was formerly known as Ronn Motor Company, Inc. and changed its name to VydroTech, Inc. in April 2012. VydroTech, Inc. was founded in 1998 and is based in Dallas, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Dallas"
    },
    "XL": {
        "short_name": "XL Fleet Corp.",
        "long_name": "XL Fleet Corp.",
        "summary": "XL Fleet Corp. provides fleet electrification solutions for commercial vehicles in North America. Its products include hybrid electric drive systems are comprised of an electric motor that is mounted onto the vehicle's drive shaft, an inverter motor controller, and a lithium-ion battery pack to store energy to be used for propulsion; plug-in hybrid electric drive system, which offers a more significant MPG and emissions improvement than the hybrid system, while enabling customers to plug in their vehicles to a level 1 or level 2 charging station. In addition, the company offers charging and power management solutions, and Electrification-as-a-Service, which would finance and manage vehicles, powertrains, charging systems, on-site power, and energy storage systems while charging customers on a usage and time basis. It also offers XL Link, an electrification analytics platform. The company offers its products under the brand names of XLH, XL Plug-In, XLP, XL GRID, and XL ELECTRIC. It serves end-use customer base comprising Fortune 500 corporate enterprises, public utilities, and various municipalities. The company was incorporated in 2009 and is headquartered in Boston, Massachusetts.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Boston"
    },
    "XLF.F": {
        "short_name": "XL FLEET CORP.",
        "long_name": "XL Fleet Corp.",
        "summary": "XL Fleet Corp. provides fleet electrification solutions for commercial vehicles in North America. Its products include hybrid electric drive systems are comprised of an electric motor that is mounted onto the vehicle's drive shaft, an inverter motor controller, and a lithium-ion battery pack to store energy to be used for propulsion; plug-in hybrid electric drive system, which offers a more significant MPG and emissions improvement than the hybrid system, while enabling customers to plug in their vehicles to a level 1 or level 2 charging station. In addition, the company offers charging and power management solutions, and Electrification-as-a-Service, which would finance and manage vehicles, powertrains, charging systems, on-site power, and energy storage systems while charging customers on a usage and time basis. It also offers XL Link, an electrification analytics platform. The company offers its products under the brand names of XLH, XL Plug-In, XLP, XL GRID, and XL ELECTRIC. It serves end-use customer base comprising Fortune 500 corporate enterprises, public utilities, and various municipalities. The company was incorporated in 2009 and is headquartered in Boston, Massachusetts.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Boston"
    },
    "XPEL": {
        "short_name": "XPEL, Inc.",
        "long_name": "XPEL, Inc.",
        "summary": "XPEL, Inc. manufactures, sells, distributes, and installs after-market automotive products in the United States, China, Canada, Continental Europe, the United Kingdom, Asia Pacific, Latin America, the Middle East/Africa, and internationally. The company offers automotive surface and paint protection, headlight protection, and automotive and architectural window films, as well as proprietary software. It also provides merchandise and apparel, and ceramic coatings. In addition, the company offers paint protection kits, car wash products, after-care products, and installation tools through its website. It sells its products to independent installers and new car dealerships, third party distributors, owned installation centers, and franchisees and online. The company was founded in 1997 and is headquartered in San Antonio, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "San Antonio"
    },
    "XPX.F": {
        "short_name": "XPEL INC.",
        "long_name": "XPEL, Inc.",
        "summary": "XPEL, Inc. manufactures, sells, distributes, and installs after-market automotive products in the United States, China, Canada, Continental Europe, the United Kingdom, Asia Pacific, Latin America, the Middle East/Africa, and internationally. The company offers automotive surface and paint protection, headlight protection, and automotive and architectural window films, as well as proprietary software. It also provides merchandise and apparel, and ceramic coatings. In addition, the company offers paint protection kits, car wash products, after-care products, and installation tools through its website. It sells its products to independent installers and new car dealerships, third party distributors, owned installation centers, and franchisees and online. The company was founded in 1997 and is headquartered in San Antonio, Texas.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "San Antonio"
    },
    "ZYRX": {
        "short_name": "ZYROX MINING INTL INC",
        "long_name": "Zyrox Mining International, Inc.",
        "summary": "WSPVA Bio Products International, LLC engages in the development, manufacture, and sale of bio-degradable water soluble plastic products in North America. The company's products include plastic bags; clam shells to package fruits/vegetables; hospital gowns and smocks; disposable gloves; plastic bottles; and plastic and shrink wraps. It also licenses its plastic technology. The company is based in Monterey, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Monterey"
    }
}