{
    "ARST": {
        "short_name": "ARISTA FINANCIAL CORP",
        "long_name": "Arista Financial Corp.",
        "summary": "Arista Financial Corp., a finance company, focuses on leases for trucks and construction equipment. It provides financing to other small finance companies that do not have access to the capital markets. The company is based in Short Hills, New Jersey.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Business Software & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Short Hills",
        "zipcode": "07078",
        "website": "http://www.aristafinancial.com",
        "market_cap": "Small Cap"
    },
    "EVTCN.MX": {
        "short_name": "EVERTEC INC",
        "long_name": "EVERTEC, Inc.",
        "summary": "EVERTEC, Inc. engages in transaction processing business in Latin America and the Caribbean. The company operates through four segments: Payment Services - Puerto Rico & Caribbean; Payment Services - Latin America; Merchant Acquiring; and Business Solutions. It provides merchant acquiring services, which enable point of sales and e-commerce merchants to accept and process electronic methods of payment, such as debit, credit, prepaid, and electronic benefit transfer (EBT) cards. The company also offers payment processing services that enable financial institutions and other issuers to manage, support, and facilitate the processing for credit, debit, prepaid, automated teller machines, and EBT card programs; credit and debit card processing, authorization and settlement, and fraud monitoring and control services to debit or credit issuers; and EBT services. In addition, it provides business process management solutions comprising core bank processing, network hosting and management, IT professional services, business process outsourcing, item and cash processing, and fulfillment solutions to financial institutions, and corporate and government customers. Further, the company owns and operates the ATH network, an automated teller machine and personal identification number debit networks. It manages a system of electronic payment networks that process approximately three billion transactions. The company sells and distributes its services primarily through direct sales force. It serves financial institutions, merchants, corporations, and government agencies. The company was formerly known as Carib Latam Holdings, Inc. EVERTEC, Inc. was founded in 1988 and is headquartered in San Juan, Puerto Rico.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Business Software & Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "PR",
        "city": "San Juan",
        "zipcode": "00926",
        "website": "http://www.evertecinc.com",
        "market_cap": "Large Cap"
    }
}