{
    "001.F": {
        "short_name": "CARDTRONICS -,01",
        "long_name": "Cardtronics plc",
        "summary": "Cardtronics plc provides automated consumer financial services through its network of automated teller machines (ATMs) and multi-function financial services kiosks. The company offers cash dispensing and balance inquiries; and financial related services to cardholders, as well as ATM management and ATM equipment-related services to large retail merchants, smaller retailers, financial institutions, and operators of facilities, such as shopping malls, airports, train stations, and casinos. It also provides transaction processing, cash and cash delivery management, supply, and telecommunications, as well as routine and technical maintenance services for ATMs; and owns and operates electronic funds transfer transaction processing platforms that offer transaction processing services to its network of ATMS, as well as other ATMs under managed services arrangements. In addition, the company provides processing services for issuers of debit cards; and owns and operates Allpoint network, a surcharge-free ATM network, which offers surcharge-free ATM access to participating banks, credit unions, digital banks, financial technology companies, and stored-value debit card issuers. As of April 1, 2020, it provided services to approximately 285,000 ATMs in North America, Europe, the Asia-Pacific, and Africa. The company was founded in 1989 and is based in Houston, Texas.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Houston"
    },
    "A1VY34.SA": {
        "short_name": "AVERY DENNISDRN",
        "long_name": "Avery Dennison Corporation",
        "summary": "Avery Dennison Corporation produces and sells pressure-sensitive materials worldwide. The company's Label and Graphic Materials segment offers pressure-sensitive label and packaging materials; and graphics and reflective products under the Fasson, JAC, Avery Dennison, and Mactac brands, as well as durable cast and reflective films. It provides its products to the home and personal care, beer and beverage, durables, pharmaceutical, wine and spirits, and food market segments; architectural, commercial sign, digital printing, and other related market segments; construction, automotive, and fleet transportation market segments, as well as traffic and safety applications; and sign shops, commercial printers, and designers. The company's Retail Branding and Information Solutions segment designs, manufactures, and sells brand embellishments, graphic tickets, tags and labels, and sustainable packaging solutions, as well as offers creative services; item-level radio-frequency identification solutions; visibility and loss prevention solutions; price ticketing and marking solutions; care, content, and country of origin compliance solutions; and brand protection and security solutions. It serves retailers, brand owners, apparel manufacturers, distributors, and industrial customers. The company's Industrial and Healthcare Materials segment offers tapes; pressure-sensitive adhesive based materials and converted products; medical fasteners; and performance polymers under the Fasson, Avery Dennison, and Yongle brands. It serves automotive, electronics, building and construction, general industrial, personal care, and medical markets. The company was formerly known as Avery International Corporation and changed its name to Avery Dennison Corporation in 1990. Avery Dennison Corporation was founded in 1935 and is headquartered in Glendale, California.",
        "currency": "BRL",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Glendale"
    },
    "ACCO": {
        "short_name": "Acco Brands Corporation",
        "long_name": "ACCO Brands Corporation",
        "summary": "ACCO Brands Corporation designs, manufactures, and markets consumer and business products. It operates through three segments: ACCO Brands North America, ACCO Brands EMEA, and ACCO Brands International. The company offers school notebooks, calendars, planners, dry erase boards, and janitorial supplies; storage and organization products, such as three-ring and lever-arch binders, sheet protectors, and indexes; laminating, binding, and shredding machines; writing instruments; stapling and punching products; do-it-yourself tools; and computer accessories and others used in schools, homes, and businesses. It offers its products primarily under the AT-A-GLANCE, Barrilito, Derwent, Esselte, Five Star, Foroni, GBC, Hilroy, Kensington, Leitz, Marbig, Mead, NOBO, Quartet, Rapid, Rexel, Swingline, Tilibra, Spirax, and Wilson Jones brand names. The company markets and sells its products through various channels, including mass retailers; e-tailers; discount, drug/grocery, and variety chains; warehouse clubs; hardware and specialty stores; independent office product dealers; office superstores; wholesalers; and contract stationers, as well as sells products directly to commercial and consumer end-users through its e-commerce platform and direct sales organization. ACCO Brands Corporation was founded in 1893 and is headquartered in Lake Zurich, Illinois.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Lake Zurich"
    },
    "ADDC": {
        "short_name": "ADDMASTER CORP",
        "long_name": "Addmaster Corporation",
        "summary": "Addmaster Corporation designs, manufactures, and sells inkjet printers. The company offers banking printers, including teller receipt validation, bank teller receipt, validation, and color teller receipt bank printers; color label printers, such as color prescription label printers; and OEM printers comprising package coding printers, print bars, and color print mechanism products. Its products are used in the ballot marking, anesthesia labeling, payment processing, kiosk printing, document processing, package coding, money order printing, and other applications. The company was founded in 1962 and is headquartered in Monrovia, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Monrovia"
    },
    "ASTO": {
        "short_name": "ASTRO COMMUNICATIONS INC",
        "long_name": "Astro Communications, Inc.",
        "summary": "Astro Communications, Inc. provides various answering services in the United States. The company offers personalized answering, telephone receptionist, medical answering, SMS text messaging, HIPAA compliant, live customer, conference calling, alphanumeric/digital paging, fax/email message delivery, government provider, emergency dispatch, local and toll free number, and custom auto answering services. It also provides message archiving, seamless direct connect, natural gas generator and ups backup, technology, maintenance support, quality assurance monitoring, order taking/order processing, help desk, customer, messaging, and customer relationship management services. The company serves the funeral home, medical, HVAC, business, service, answering, and property management industries. Astro Communications, Inc. was founded in 1993 and is based in Shepherdsville, Kentucky.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Shepherdsville"
    },
    "AV3.F": {
        "short_name": "AVERY DENNISON  DL 1",
        "long_name": "Avery Dennison Corporation",
        "summary": "Avery Dennison Corporation produces and sells pressure-sensitive materials worldwide. The company's Label and Graphic Materials segment offers pressure-sensitive label and packaging materials; and graphics and reflective products under the Fasson, JAC, Avery Dennison, and Mactac brands, as well as durable cast and reflective films. It provides its products to the home and personal care, beer and beverage, durables, pharmaceutical, wine and spirits, and food market segments; architectural, commercial sign, digital printing, and other related market segments; construction, automotive, and fleet transportation market segments, as well as traffic and safety applications; and sign shops, commercial printers, and designers. The company's Retail Branding and Information Solutions segment designs, manufactures, and sells brand embellishments, graphic tickets, tags and labels, and sustainable packaging solutions, as well as offers creative services; item-level radio-frequency identification solutions; visibility and loss prevention solutions; price ticketing and marking solutions; care, content, and country of origin compliance solutions; and brand protection and security solutions. It serves retailers, brand owners, apparel manufacturers, distributors, and industrial customers. The company's Industrial and Healthcare Materials segment offers tapes; pressure-sensitive adhesive based materials and converted products; medical fasteners; and performance polymers under the Fasson, Avery Dennison, and Yongle brands. It serves automotive, electronics, building and construction, general industrial, personal care, and medical markets. The company was formerly known as Avery International Corporation and changed its name to Avery Dennison Corporation in 1990. Avery Dennison Corporation was founded in 1935 and is headquartered in Glendale, California.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Glendale"
    },
    "AVY": {
        "short_name": "Avery Dennison Corporation",
        "long_name": "Avery Dennison Corporation",
        "summary": "Avery Dennison Corporation produces and sells pressure-sensitive materials worldwide. The company's Label and Graphic Materials segment offers pressure-sensitive label and packaging materials; and graphics and reflective products under the Fasson, JAC, Avery Dennison, and Mactac brands, as well as durable cast and reflective films. It provides its products to the home and personal care, beer and beverage, durables, pharmaceutical, wine and spirits, and food market segments; architectural, commercial sign, digital printing, and other related market segments; construction, automotive, and fleet transportation market segments, as well as traffic and safety applications; and sign shops, commercial printers, and designers. The company's Retail Branding and Information Solutions segment designs, manufactures, and sells brand embellishments, graphic tickets, tags and labels, and sustainable packaging solutions, as well as offers creative services; item-level radio-frequency identification solutions; visibility and loss prevention solutions; price ticketing and marking solutions; care, content, and country of origin compliance solutions; and brand protection and security solutions. It serves retailers, brand owners, apparel manufacturers, distributors, and industrial customers. The company's Industrial and Healthcare Materials segment offers tapes; pressure-sensitive adhesive based materials and converted products; medical fasteners; and performance polymers under the Fasson, Avery Dennison, and Yongle brands. It serves automotive, electronics, building and construction, general industrial, personal care, and medical markets. The company was formerly known as Avery International Corporation and changed its name to Avery Dennison Corporation in 1990. Avery Dennison Corporation was founded in 1935 and is headquartered in Glendale, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Glendale"
    },
    "BOXS": {
        "short_name": "BOXSCORE BRANDS INC",
        "long_name": "BoxScore Brands, Inc.",
        "summary": "BoxScore Brands, Inc. develops, markets, and distributes various self-serve electronic kiosks and mall/airport co-branded islands in North America. It operates its kiosks in high-traffic host locations, such as big box stores, restaurants, malls, airports, casinos, universities, and colleges. The company was formerly known as U-Vend, Inc. and changed its name to BoxScore Brands, Inc. in February 2018. BoxScore Brands, Inc. was founded in 2007 and is headquartered in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Las Vegas"
    },
    "CATM": {
        "short_name": "Cardtronics plc",
        "long_name": "Cardtronics plc",
        "summary": "Cardtronics plc provides automated consumer financial services through its network of automated teller machines (ATMs) and multi-function financial services kiosks. The company offers cash dispensing and balance inquiries; and financial related services to cardholders, as well as ATM management and ATM equipment-related services to large retail merchants, smaller retailers, financial institutions, and operators of facilities, such as shopping malls, airports, train stations, and casinos. It also provides transaction processing, cash and cash delivery management, supply, and telecommunications, as well as routine and technical maintenance services for ATMs; and owns and operates electronic funds transfer transaction processing platforms that offer transaction processing services to its network of ATMS, as well as other ATMs under managed services arrangements. In addition, the company provides processing services for issuers of debit cards; and owns and operates Allpoint network, a surcharge-free ATM network, which offers surcharge-free ATM access to participating banks, credit unions, digital banks, financial technology companies, and stored-value debit card issuers. As of April 1, 2020, it provided services to approximately 285,000 ATMs in North America, Europe, the Asia-Pacific, and Africa. The company was founded in 1989 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "CBDG": {
        "short_name": "THC FARMACEUTICALS INC",
        "long_name": "THC Farmaceuticals, Inc.",
        "summary": "THC Farmaceuticals, Inc. owns and operates non-financial institution cash-dispensing automated teller machines at third-party owned retail and commercial locations. The company's machines are placed in hotels, stores, bowling alleys, and other high customer traffic areas for small and medium sized businesses. As of June 30, 2015, it had a total of eight machines for public use along the Wasatch Front in the State of Utah. The company was formerly known as City Media, Inc. and changed its name to THC Farmaceuticals, Inc. in February 2015. THC Farmaceuticals, Inc. was founded in 2008 and is based in Scottsdale, Arizona. THC Farmaceuticals, Inc. operates as a subsidiary of Weed Growth Fund, Inc.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Scottsdale"
    },
    "CHMP": {
        "short_name": "CHAMPION INDUSTRIES INC W VA",
        "long_name": "Champion Industries, Inc.",
        "summary": "Champion Industries, Inc., together with its subsidiaries, operates as a commercial printer, business forms manufacturer, wide-format printing, office products and office furniture supplier, and mailing solutions provider primarily in West Virginia, Kentucky, Ohio, Indiana, and Louisiana. It operates through two segments, Printing and Office Products and Furniture. The company offers signage, banners, displays, window clings, wall coverings, and printing services. It also provides commercial interior design; and warehousing fulfillment of print and office supply goods. The company was founded in 1992 and is headquartered in Huntington, West Virginia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Huntington"
    },
    "EBF": {
        "short_name": "Ennis, Inc.",
        "long_name": "Ennis, Inc.",
        "summary": "Ennis, Inc. designs, manufactures, and sells business forms and other business products in the United States. The company offers snap sets, continuous forms, laser cut sheets, tags, labels, envelopes, integrated products, jumbo rolls, and pressure sensitive products under the Ennis, Royal Business Forms, Block Graphics, Specialized Printed Forms, 360Âº Custom Labels, ColorWorx, Enfusion, Uncompromised Check Solutions, VersaSeal, Ad Concepts, FormSource Limited, Star Award Ribbon Company, Witt Printing, B&D Litho, Genforms, PrintGraphics, Calibrated Forms, PrintXcel, Printegra, Falcon Business Forms, Forms Manufacturers, Mutual Graphics, TRI-C Business Forms, Major Business Systems, Independent Printing, Hoosier Data Forms, Hayes Graphics, Wright Business Graphics, Wright 360, Integrated Print & Graphics, the Flesh Company, Impressions Direct, and Ace Forms brands. It also provides point of purchase advertising for large franchise and fast food chains, as well as kitting and fulfillment under the Adams McClure brand; and presentation folders and document folders under the Admore, Folder Express, and Independent Folders brands. In addition, the company offers custom printed, high performance labels, and custom and stock tags under the Ennis Tag & Label brands; custom and stock tags and labels under the Allen-Bailey Tag & Label, Atlas Tag & Label, Kay Toledo Tag, and Special Service Partners brands; custom and imprinted envelopes under the Trade Envelopes, Block Graphics, Wisco, and National Imprint Corporation brands; and financial and security documents under the Northstar and General Financial Supply brands. It distributes business products and forms through independent distributors. The company was formerly known as Ennis Business Forms, Inc. Ennis, Inc. was founded in 1909 and is headquartered in Midlothian, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Midlothian"
    },
    "GJB.F": {
        "short_name": "STEELCASE INC. A",
        "long_name": "Steelcase Inc.",
        "summary": "Steelcase Inc. manufactures and sells integrated furniture settings, user-centered technologies, and interior architectural products. It operates through Americas, EMEA, and Other segments. The company's furniture portfolio includes panels, fence and beam-based furniture systems, storage products, fixed and height-adjustable desks, benches, and tables, as well as complementary products, including worktools and screens. Its seating products comprise task chairs; seating for collaborative or casual settings; and specialty seating for specific vertical markets, such as healthcare and education. The company's interior architectural products include full and partial height walls and architectural pods. It also provides textiles, wall coverings, and surface imaging solutions for architects and designers; and workplace strategy consulting, data-driven space measurement, lease origination, furniture `and asset management, and hosted event services. The company markets and sells its products to corporate, government, healthcare, education, and retail customers under the Steelcase, Coalesse, Smith System, AMQ, Turnstone, Orangebox, and Designtex brands. It distributes its products and services through a network of independent and company-owned dealers, as well as directly to end-use customers. The company was founded in 1912 and is headquartered in Grand Rapids, Michigan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Grand Rapids"
    },
    "GPTX": {
        "short_name": "GLOBAL PMT TECHNOLOGIES INC",
        "long_name": "Global Payment Technologies Inc.",
        "summary": "Global Payment Technologies Inc. designs and manufactures currency validators and paper currency stackers. Its equipment is used to process currency in gaming machines and vending machines that dispense products, services, coins, and other currencies. Its customers include gaming equipment and vending machine manufacturers in the United States and internationally. Global Payment Technologies Inc. was formerly known as Coin Bill Validator Inc. and changed its name to Global Payment Technologies Inc. in November 1994. The company was incorporated in 1988 and is based in Hauppauge, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Hauppauge"
    },
    "HNI": {
        "short_name": "HNI Corporation",
        "long_name": "HNI Corporation",
        "summary": "HNI Corporation manufactures and sells office furniture and hearth products in the United States, Canada, China, Hong Kong, India, Mexico, Dubai, Taiwan, and Singapore. Its Office Furniture segment offers a range of commercial and home office furniture, which include panel-based and freestanding furniture systems, seating, storage, tables, and architectural products under the HON, Allsteel, Beyond, Gunlocke, Maxon, HBF, OFM, Respawn, Lamex, and HNI India brands. This segment sells its products through independent dealers, wholesalers, and office product distributors, as well as directly to end-user customers; and federal, state, and local governments. The company's Hearth Products segment provides various gas, wood, electric, and pellet fueled fireplaces; inserts; stoves; facings; and accessories primarily for home use under the Heatilator, Heat & Glo, Majestic, Monessen, Quadra-Fire, Harman, Vermont Castings, PelPro, and Stellar Hearth brands. This segment markets its products through independent dealers and distributors, and corporation-owned distribution and retail outlets. HNI Corporation was incorporated in 1944 and is headquartered in Muscatine, Iowa.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Muscatine"
    },
    "HO9.F": {
        "short_name": "HNI CORP.  DL 1",
        "long_name": "HNI Corporation",
        "summary": "HNI Corporation manufactures and sells office furniture and hearth products in the United States, Canada, China, Hong Kong, India, Mexico, Dubai, Taiwan, and Singapore. Its Office Furniture segment offers a range of commercial and home office furniture, which include panel-based and freestanding furniture systems, seating, storage, tables, and architectural products under the HON, Allsteel, Beyond, Gunlocke, Maxon, HBF, OFM, Respawn, Lamex, and HNI India brands. This segment sells its products through independent dealers, wholesalers, and office product distributors, as well as directly to end-user customers; and federal, state, and local governments. The company's Hearth Products segment provides various gas, wood, electric, and pellet fueled fireplaces; inserts; stoves; facings; and accessories primarily for home use under the Heatilator, Heat & Glo, Majestic, Monessen, Quadra-Fire, Harman, Vermont Castings, PelPro, and Stellar Hearth brands. This segment markets its products through independent dealers and distributors, and corporation-owned distribution and retail outlets. HNI Corporation was incorporated in 1944 and is headquartered in Muscatine, Iowa.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Muscatine"
    },
    "KK6.F": {
        "short_name": "KNOLL INC.  DL -,01",
        "long_name": "Knoll, Inc.",
        "summary": "Knoll, Inc., together with its subsidiaries, designs, manufactures, markets, and sells commercial and residential furniture, accessories, and coverings for the workplace and residential markets in the United States, Canada, Europe, and internationally. The company operates through Office and Lifestyle segments. It provides systems furniture, including integrated panels or table desks, work surfaces and storage units, power and data systems, and lighting products; office seating products comprising various work chairs; and files and storage products, such as lateral files, mobile pedestals and other storage units, bookcases, and overhead cabinets. The company also offers adjustable tables, as well as meeting, conference, training, dining, stand-alone, and table desks; technology support accessories, desktop organizational tools, and lighting and storage products; lounge furniture; side, cafÃ©, and dining chairs; training, conference, dining, and occasional tables; and lighting, rugs, textiles, fabrics, felt, leather, upholstery, drapery, and related architectural products. It serves companies, governmental agencies, and other medium to large sized organizations in various industries, including financial, legal, technology, entertainment, accounting, education, healthcare, and hospitality through its direct sales force and showrooms, distribution partners, and independent dealers and retailers, as well as online. The company was founded in 1938 and is headquartered in East Greenville, Pennsylvania.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "East Greenville"
    },
    "KNL": {
        "short_name": "Knoll, Inc.",
        "long_name": "Knoll, Inc.",
        "summary": "Knoll, Inc., together with its subsidiaries, designs, manufactures, markets, and sells commercial and residential furniture, accessories, and coverings for the workplace and residential markets in the United States, Canada, Europe, and internationally. The company operates through Office and Lifestyle segments. It provides systems furniture, including integrated panels or table desks, work surfaces and storage units, power and data systems, and lighting products; office seating products comprising various work chairs; and files and storage products, such as lateral files, mobile pedestals and other storage units, bookcases, and overhead cabinets. The company also offers adjustable tables, as well as meeting, conference, training, dining, stand-alone, and table desks; technology support accessories, desktop organizational tools, and lighting and storage products; lounge furniture; side, cafÃ©, and dining chairs; training, conference, dining, and occasional tables; and lighting, rugs, textiles, fabrics, felt, leather, upholstery, drapery, and related architectural products. It serves companies, governmental agencies, and other medium to large sized organizations in various industries, including financial, legal, technology, entertainment, accounting, education, healthcare, and hospitality through its direct sales force and showrooms, distribution partners, and independent dealers and retailers, as well as online. The company was founded in 1938 and is headquartered in East Greenville, Pennsylvania.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "East Greenville"
    },
    "MRJT": {
        "short_name": "3D MAKERJET INC",
        "long_name": "3D MakerJet, Inc.",
        "summary": "3D MakerJet, Inc. develops, imports, and sells art 3D printers, scanners, and ancillary equipment in the United States. It focuses on supplying plastic, medical, culinary, and powderless metal 3D printers for individuals and businesses. 3D MakerJet, Inc. was incorporated in 2014 and is based in Orlando, Florida. 3D MakerJet, Inc. operates as a subsidiary of Market Milestones, Inc.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Orlando"
    },
    "PBI": {
        "short_name": "Pitney Bowes Inc.",
        "long_name": "Pitney Bowes Inc.",
        "summary": "Pitney Bowes Inc., a technology company, provides commerce solutions in the United States and internationally. The company operates through Global Ecommerce, Presort Services and SendTech Solutions segments. The Global Ecommerce segment provides products and services for domestic retail and e-commerce shipping solutions, including fulfillment and returns, and cross-border e-commerce transactions. The Presort Services segment offers mail sortation services, which allow clients to qualify volumes of first class mail, marketing mail, and bound and packet mail for postal work sharing discounts. The SendTech Solutions segment provides sending technology solutions for physical and digital mailing, shipping, supplies, and other applications for sending, tracking, and receiving of letters and packages. Pitney Bowes Inc. markets its products, solutions, and services direct and inside salesforce, global and regional partner channels, direct mailings, and Web-based offerings. The company was formerly known as Pitney Bowes Postage Meter Company. Pitney Bowes Inc. was founded in 1920 and is headquartered in Stamford, Connecticut.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Stamford"
    },
    "PBW.F": {
        "short_name": "PITNEY-BOWES INC.  DL 1",
        "long_name": "Pitney Bowes Inc.",
        "summary": "Pitney Bowes Inc., a technology company, provides commerce solutions in the United States and internationally. The company operates through Global Ecommerce, Presort Services and SendTech Solutions segments. The Global Ecommerce segment provides products and services for domestic retail and e-commerce shipping solutions, including fulfillment and returns, and cross-border e-commerce transactions. The Presort Services segment offers mail sortation services, which allow clients to qualify volumes of first class mail, marketing mail, and bound and packet mail for postal work sharing discounts. The SendTech Solutions segment provides sending technology solutions for physical and digital mailing, shipping, supplies, and other applications for sending, tracking, and receiving of letters and packages. Pitney Bowes Inc. markets its products, solutions, and services direct and inside salesforce, global and regional partner channels, direct mailings, and Web-based offerings. The company was formerly known as Pitney Bowes Postage Meter Company. Pitney Bowes Inc. was founded in 1920 and is headquartered in Stamford, Connecticut.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Stamford"
    },
    "PMTS": {
        "short_name": "CPI CARD GROUP INC",
        "long_name": "CPI Card Group Inc.",
        "summary": "CPI Card Group Inc., together with its subsidiaries, engages in the design, production, data personalization, packaging, and fulfillment of financial payment cards. It operates through U.S. Debit and Credit, U.S. Prepaid Debit, and Other segments. The U.S. Debit and Credit segment produces financial payment cards and provides integrated card services to card-issuing banks. Its products include EMV and non-EMV financial payment cards and metal cards, as well as private label credit cards. This segment also provides on-demand services and various integrated card services, including card personalization and fulfillment, and instant issuance services. The U.S. Prepaid Debit segment primarily offers integrated card services comprising tamper-evident security packaging services to prepaid debit card providers. It also produces financial payment cards issued on the networks of the payment card brands. The Other segment sells financial payment cards. It serves national and regional banks, independent community banks, credit unions, prepaid debit card program managers, group service providers, and card transaction processors through sales representatives in the United States. CPI Card Group Inc. has collaboration with CU-Interface. The company was formerly known as CPI Holdings I, Inc. and changed its name to CPI Card Group Inc. in August 2015. CPI Card Group Inc. was founded in 2007 and is based in Littleton, Colorado.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Littleton"
    },
    "PMTS.TO": {
        "short_name": "CPI CARD GROUP INC",
        "long_name": "CPI Card Group Inc.",
        "summary": "CPI Card Group Inc., together with its subsidiaries, engages in the design, production, data personalization, packaging, and fulfillment of financial payment cards. It operates through U.S. Debit and Credit, U.S. Prepaid Debit, and Other segments. The U.S. Debit and Credit segment produces financial payment cards and provides integrated card services to card-issuing banks. Its products include EMV and non-EMV financial payment cards and metal cards, as well as private label credit cards. This segment also provides on-demand services and various integrated card services, including card personalization and fulfillment, and instant issuance services. The U.S. Prepaid Debit segment primarily offers integrated card services comprising tamper-evident security packaging services to prepaid debit card providers. It also produces financial payment cards issued on the networks of the payment card brands. The Other segment sells financial payment cards. It serves national and regional banks, independent community banks, credit unions, prepaid debit card program managers, group service providers, and card transaction processors through sales representatives in the United States. CPI Card Group Inc. has collaboration with CU-Interface. The company was formerly known as CPI Holdings I, Inc. and changed its name to CPI Card Group Inc. in August 2015. CPI Card Group Inc. was founded in 2007 and is based in Littleton, Colorado.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "United States",
        "city": "Littleton"
    },
    "RBSY": {
        "short_name": "ROBOSERVER SYSTEMS CORP",
        "long_name": "Roboserver Systems Corp.",
        "summary": "RoboServer Systems Corp. develops self-serve and point-of sale technologies to the fast food and restaurant industries worldwide. Its systems are designed to work like ATM machines and self-checkout stands, allowing customers to place orders, pay, and go. It serves municipalities, utilities, restaurants, government agencies, service providers, equipment rental agencies, and other users of automated systems for payment processing, through cash, credit cards, debit cards, and gift cards; order-and-pay; and custom applications. The company, formerly known as Equity Thunder, Inc., was founded in 2000 and is based in Las Vegas, Nevada. RoboServer Systems Corp. operates as a subsidiary of AmeriResource Technologies, Inc.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Las Vegas"
    },
    "SCS": {
        "short_name": "Steelcase Inc.",
        "long_name": "Steelcase Inc.",
        "summary": "Steelcase Inc. manufactures and sells integrated furniture settings, user-centered technologies, and interior architectural products. It operates through Americas, EMEA, and Other segments. The company's furniture portfolio includes panels, fence and beam-based furniture systems, storage products, fixed and height-adjustable desks, benches, and tables, as well as complementary products, including worktools and screens. Its seating products comprise task chairs; seating for collaborative or casual settings; and specialty seating for specific vertical markets, such as healthcare and education. The company's interior architectural products include full and partial height walls and architectural pods. It also provides textiles, wall coverings, and surface imaging solutions for architects and designers; and workplace strategy consulting, data-driven space measurement, lease origination, furniture `and asset management, and hosted event services. The company markets and sells its products to corporate, government, healthcare, education, and retail customers under the Steelcase, Coalesse, Smith System, AMQ, Turnstone, Orangebox, and Designtex brands. It distributes its products and services through a network of independent and company-owned dealers, as well as directly to end-use customers. The company was founded in 1912 and is headquartered in Grand Rapids, Michigan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Grand Rapids"
    },
    "SORT": {
        "short_name": "GUNTHER INTERNATIONAL",
        "long_name": "inc.jet Holding, Inc.",
        "summary": "inc.jet Holding, Inc. provides data printing equipment and solutions. It offers embedded boards and components, and software integration services; packaging printing products, such as print controllers and print heads; graphics and mail print solutions; and industrial inks, including solvent and aqueous based inks. The company was formerly known as Gunther International Ltd. and changed its name to inc.jet Holding, Inc. in January 2018. The company was founded in 1978 and is based in Norwich, Connecticut.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Norwich"
    },
    "TCHH": {
        "short_name": "TRUSTCASH HOLDINGS INC",
        "long_name": "Trustcash Holdings, Inc.",
        "summary": "Trustcash Holdings, Inc. provides a technology platform that enables customers to make purchases on the Internet without using a credit card or writing a check. It offers Â\u0091Trustcash' card, an alternative payment system. The company markets its products to online service providers and retailers. Trustcash Holdings, Inc. was formerly known as Ouvo, Inc. and changed its name to Trustcash Holdings, Inc. in 2007. The company was founded in 2000 and is based in Atlanta, Georgia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Atlanta"
    },
    "VEND": {
        "short_name": "GENERATION NEXT FRANCHISE BRAND",
        "long_name": "Generation Next Franchise Brands, Inc.",
        "summary": "Generation Next Franchise Brands, Inc., through its subsidiaries, primarily operates as a franchisor, owner and managing member, and direct seller of unattended retail kiosks. The company was formerly known as Fresh Healthy Vending International, Inc. and changed its name to Generation Next Franchise Brands, Inc. in March 2016. Generation Next Franchise Brands, Inc. was founded in 2010 and is based in San Diego, California. On January 24, 2020, the voluntary petition of Generation Next Franchise Brands, Inc. for reorganization under Chapter 11 was converted to Chapter 7. It had filed for Chapter 11 bankruptcy on December 15, 2019.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "San Diego"
    },
    "VRTV": {
        "short_name": "Veritiv Corporation",
        "long_name": "Veritiv Corporation",
        "summary": "Veritiv Corporation operates as a business-to-business distributor of packaging, facility solutions, print, and publishing products and services in the United States, Canada, Mexico, and internationally. The Packaging segment offers standard, custom, and comprehensive packaging solutions. The Facility Solutions segment sources and sells cleaning, break-room, and other supplies, such as towels, tissues, wipers and dispensers, can liners, commercial cleaning chemicals, soaps and sanitizers, sanitary maintenance supplies and equipment, safety and hazard supplies, and shampoos and amenities. The Print segment sells and distributes commercial printing, writing, copying, digital, and specialty products; and graphics consumables and equipment. It also provides customized paper conversion services of commercial printing paper for distribution to document centers and form printers. The Publishing segment sells and distributes coated and uncoated commercial printing papers to publishers, retailers, converters, printers, and specialty businesses for use in magazines, catalogs, books, directories, gaming, couponing, retail inserts, and direct mail. This segment also provides print management, procurement, and supply chain management solutions. The company also offers logistics solutions. It offers its products under the Endurance, nordic+, Econosource, Starbrite Opaque Select, TUFflex, Reliable, and Spring Grove brands, as well as other brands to courier delivery service companies, manufacturers, higher education institutions, healthcare facilities, sporting and performance arenas, government agencies, property managers and building service contractors, data centers, printers, and publishers. As of February 24, 2020 the Company operated approximately 160 distribution centers. Veritiv Corporation was incorporated in 2013 and is headquartered in Atlanta, Georgia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Atlanta"
    },
    "VRTV.MX": {
        "short_name": "VERITIV CORP",
        "long_name": "Veritiv Corporation",
        "summary": "Veritiv Corporation operates as a business-to-business distributor of packaging, facility solutions, print, and publishing products and services in the United States, Canada, Mexico, and internationally. The Packaging segment offers standard, custom, and comprehensive packaging solutions. The Facility Solutions segment sources and sells cleaning, break-room, and other supplies, such as towels, tissues, wipers and dispensers, can liners, commercial cleaning chemicals, soaps and sanitizers, sanitary maintenance supplies and equipment, safety and hazard supplies, and shampoos and amenities. The Print segment sells and distributes commercial printing, writing, copying, digital, and specialty products; and graphics consumables and equipment. It also provides customized paper conversion services of commercial printing paper for distribution to document centers and form printers. The Publishing segment sells and distributes coated and uncoated commercial printing papers to publishers, retailers, converters, printers, and specialty businesses for use in magazines, catalogs, books, directories, gaming, couponing, retail inserts, and direct mail. This segment also provides print management, procurement, and supply chain management solutions. The company also offers logistics solutions. It offers its products under the Endurance, nordic+, Econosource, Starbrite Opaque Select, TUFflex, Reliable, and Spring Grove brands, as well as other brands to courier delivery service companies, manufacturers, higher education institutions, healthcare facilities, sporting and performance arenas, government agencies, property managers and building service contractors, data centers, printers, and publishers. As of February 24, 2020 the Company operated approximately 160 distribution centers. Veritiv Corporation was incorporated in 2013 and is headquartered in Atlanta, Georgia.",
        "currency": "MXN",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Atlanta"
    }
}