{
    "0UV.F": {
        "short_name": "UNIVAR SOLUT.DL-000000014",
        "long_name": "Univar Solutions Inc.",
        "summary": "Univar Solutions Inc. distributes commodity and specialty chemical products, and related services worldwide. It also provides epoxy resins, polyurethanes, titanium dioxide, fumed silica, esters, plasticizers, silicones, and specialty amines; chemicals and service to midstream pipeline and downstream refinery operators; and commodity and specialty products for meat processing, baked goods, dairy, grain mill products, processed foods, carbonated soft drinks, fruit drinks, and alcoholic beverage markets. In addition, the company offers chemical products for use at various stages of production, from sap stain prevention to pulp and paper manufacturing; ingredients for cleaners, detergents, and disinfectant products; base stocks and performance-enhancing additives for lubricants and metalworking fluids; excipients, solvents, reactants, active pharmaceutical ingredients, and intermediates to pharmaceutical ingredient producers; and products for water treatment that includes pH adjusters, flocculants, coagulants, dechlorinators, and disinfectants. Further, it provides transportation and warehousing infrastructure, chemicals and hazardous materials handling, waste management services, inventory management, and blending and repackaging services, as well as industrial cleaning, site remediation, and emergency environmental response services. Univar Solutions Inc. distributes its products through warehouse and direct-to-consumer delivery channels. The company was formerly known as Univar Inc. and changed its name to Univar Solutions Inc. in September 2019. The company was founded in 1924 and is headquartered in Downers Grove, Illinois.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Downers Grove"
    },
    "AFPW": {
        "short_name": "ALUMIFUEL PWR CORP",
        "long_name": "AlumiFuel Power Corporation",
        "summary": "AlumiFuel Power Corporation, through its subsidiaries, operates as an early production stage renewable energy company that generates hydrogen gas and heat through the chemical reaction of aluminum, water, and proprietary additives. Its hydrogen drives fuel cells for back-up, remote, and portable power; fills inflatable devices, such as weather balloons; and replaces hard-to-handle and high pressure K-cylinders. The company's steam/hydrogen output also drives turbine-based underwater propulsion systems and auxiliary power systems, as well as is used as fuel for flameless ration heaters. It also offers portable balloon inflation system (PBIS)-1000, PBIS-2000, and PBIS-lite hydrogen generators. The company's hydrogen/steam generators also include turbine-based underwater propulsion systems, drop-in recyclable cartridges, and flameless heater packs. Further, it focuses on developing hybrid renewable energy solutions for growing of medical cannabis and oilfield operations. AlumiFuel Power Corporation is based in Englewood, Colorado.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Englewood"
    },
    "AGTT": {
        "short_name": "ANGSTROM TECHNOLOGIES INC",
        "long_name": "Angstrom Technologies, Inc.",
        "summary": "Angstrom Technologies, Inc. provides UV fluorescent chemicals and electronic detection systems. It offers solutions for security, fraud deterrence, and brand protection, as well as process control, and track and trace for manufacturing. The company's UV fluorescent chemical products include invisible fluorescent chemicals, daylight fluorescent chemicals, phosophorescent chemicals, and inks/varnishes for security, research, process control, and entertainment purposes. It also provides chemistry services. The company's electronic detection systems comprise fluorescence detection systems; system accessories and UV lights; and MoneyChecker, a device used for verifying US currency and other documents at a point of sale or office environment. It serves government organizations, companies, and financial institutions. The company was incorporated in 1983 and is based in Florence, Kentucky.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Florence"
    },
    "APCD.VI": {
        "short_name": "AIR PRODUCTS & CHEMICALS INC",
        "long_name": "Air Products and Chemicals, Inc.",
        "summary": "Air Products and Chemicals, Inc. provides atmospheric gases, process and specialty gases, equipment, and services worldwide. The company produces atmospheric gases, including oxygen, nitrogen, argon, and rare gases; process gases, such as hydrogen, helium, carbon dioxide, carbon monoxide, syngas, and specialty gases; and equipment for the production or processing of gases comprising air separation units and non-cryogenic generators for customers in various industries, including refining, chemical, gasification, metals, manufacturing, food and beverage, electronics, magnetic resonance imaging, energy production and refining, and metals. It also designs and manufactures equipment for air separation, hydrocarbon recovery and purification, natural gas liquefaction, and liquid helium and liquid hydrogen transport and storage. Air Products and Chemicals, Inc. was founded in 1940 and is headquartered in Allentown, Pennsylvania.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "Allentown"
    },
    "APD": {
        "short_name": "Air Products and Chemicals, Inc",
        "long_name": "Air Products and Chemicals, Inc.",
        "summary": "Air Products and Chemicals, Inc. provides atmospheric gases, process and specialty gases, equipment, and services worldwide. The company produces atmospheric gases, including oxygen, nitrogen, argon, and rare gases; process gases, such as hydrogen, helium, carbon dioxide, carbon monoxide, syngas, and specialty gases; and equipment for the production or processing of gases comprising air separation units and non-cryogenic generators for customers in various industries, including refining, chemical, gasification, metals, manufacturing, food and beverage, electronics, magnetic resonance imaging, energy production and refining, and metals. It also designs and manufactures equipment for air separation, hydrocarbon recovery and purification, natural gas liquefaction, and liquid helium and liquid hydrogen transport and storage. Air Products and Chemicals, Inc. was founded in 1940 and is headquartered in Allentown, Pennsylvania.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Allentown"
    },
    "ASIX": {
        "short_name": "AdvanSix Inc.",
        "long_name": "AdvanSix Inc.",
        "summary": "AdvanSix Inc. manufactures and sells polymer resins in the United States and internationally. It offers Nylon 6, a polymer resin, which is a synthetic material used to produce engineered plastics, fibers, filaments, and films. The company also provides caprolactam to manufacture polymer resins; ammonium sulfate fertilizers to distributors, farm cooperatives, and retailers; and acetone, which is used by customers in the production of adhesives, paints, coatings, solvents, herbicides, and other engineered plastic resins, as well as other intermediate chemicals, including phenol, alpha-methylstyrene, cyclohexanone, methyl ethyl ketoxime, cyclohexanol, acetaldehyde oxime, 2-pentanone oxime, sulfuric acid, ammonia, and carbon dioxide. It offers its products under the Aegis, Capra, Sulf-N, Nadone, Naxol, and EZ-Blox brands. The company sells its products directly, as well as through distributors. AdvanSix Inc. was incorporated in 2016 and is headquartered in Parsippany, New Jersey.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Parsippany"
    },
    "BLGO": {
        "short_name": "BIOLARGO INC",
        "long_name": "BioLargo, Inc.",
        "summary": "BioLargo, Inc. provides technology-based products and environmental engineering solutions in the United States. The company operates through Odor-No-More, BLEST, BioLargo Water, and Clyra Medical segments. Its Advanced Oxidation System (AOS) platform is a water treatment system for decontamination and disinfection. The company offers odor and volatile organic compound control products, and AOS water treatment technologies, as well as professional engineering and consulting services. In addition, it offers wound care products for traumatic injury, diabetic ulcers, and chronic hard-to-heal wounds, as well as offers stem cell therapy, under SkinDisc brand. The company provides its products under the CupriDyne Clean and Nature's Best Science brand names. BioLargo, Inc. was incorporated in 1991 and is based in Westminster, California.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Westminster"
    },
    "BMRK": {
        "short_name": "BENCHMARK ENERGY CORP NEV",
        "long_name": "Benchmark Energy Corporation",
        "summary": "Benchmark Energy Corporation, through its subsidiary, Energy Partners LLC, buys industrial grade glycerin and sells it to boiler plants as an alternative bunker fuel in the United States and internationally. The company offers crude and refined glycerin, a co-product of biodiesel production used in various industrial and commercial applications, such as power, energy, and boiler operations, as well as in the de-icing process and manufacturing of animal feed. It has a strategic relationship with the University of North Dakota (UND) to utilize industrial grade glycerin as an additive to the UND coal-burning plant. The company is based in Coldspring, Texas.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Coldspring"
    },
    "C1NS34.SA": {
        "short_name": "CELANESE CORDRN",
        "long_name": "Celanese Corporation",
        "summary": "Celanese Corporation, a technology and specialty materials company, manufactures and sells high performance engineered polymers in the United States and internationally. The company operates through Engineered Materials, Acetate Tow, and Acetyl Chain segments. The Engineered Materials segment develops, produces, and supplies specialty polymers for automotive and medical applications, as well as for use in industrial products and consumer electronics. It also offers acesulfame potassium, a sweetener for use in various beverages, confections, and dairy products; and food protection ingredients, such as potassium sorbate and sorbic acid for use in foods, beverages, and personal care products. The Acetate Tow segment provides acetate tows and flakes for use in filter products applications. The Acetyl Chain segment produces and supplies acetyl products, including acetic acid, vinyl acetate monomers, acetic anhydride, and acetate esters that are used as starting materials for colorants, paints, adhesives, coatings, and pharmaceuticals; and organic solvents and intermediates for pharmaceutical, agricultural, and chemical products. It also offers vinyl acetate-based emulsions for use in paints and coatings, adhesives, construction, glass fiber, textiles, and paper applications; and ethylene vinyl acetate resins and compounds, as well as low-density polyethylene for use in flexible packaging films, lamination film products, hot melt adhesives, automotive parts, and carpeting applications. In addition, it manufactures GUR ultra-high molecular weight polyethylene. Celanese Corporation was founded in 1918 and is headquartered in Irving, Texas.",
        "currency": "BRL",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Irving"
    },
    "CE": {
        "short_name": "Celanese Corporation Celanese C",
        "long_name": "Celanese Corporation",
        "summary": "Celanese Corporation, a technology and specialty materials company, manufactures and sells high performance engineered polymers in the United States and internationally. The company operates through Engineered Materials, Acetate Tow, and Acetyl Chain segments. The Engineered Materials segment develops, produces, and supplies specialty polymers for automotive and medical applications, as well as for use in industrial products and consumer electronics. It also offers acesulfame potassium, a sweetener for use in various beverages, confections, and dairy products; and food protection ingredients, such as potassium sorbate and sorbic acid for use in foods, beverages, and personal care products. The Acetate Tow segment provides acetate tows and flakes for use in filter products applications. The Acetyl Chain segment produces and supplies acetyl products, including acetic acid, vinyl acetate monomers, acetic anhydride, and acetate esters that are used as starting materials for colorants, paints, adhesives, coatings, and pharmaceuticals; and organic solvents and intermediates for pharmaceutical, agricultural, and chemical products. It also offers vinyl acetate-based emulsions for use in paints and coatings, adhesives, construction, glass fiber, textiles, and paper applications; and ethylene vinyl acetate resins and compounds, as well as low-density polyethylene for use in flexible packaging films, lamination film products, hot melt adhesives, automotive parts, and carpeting applications. In addition, it manufactures GUR ultra-high molecular weight polyethylene. Celanese Corporation was founded in 1918 and is headquartered in Irving, Texas.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Irving"
    },
    "CINR": {
        "short_name": "Ciner Resources LP",
        "long_name": "Ciner Resources LP",
        "summary": "Ciner Resources LP engages in the trona ore mining and soda ash production businesses in the United States and internationally. It processes trona ore into soda ash, which is a raw material in flat glass, container glass, detergents, chemicals, paper, and other consumer and industrial products. The company has approximately 23,500 acres of leased and licensed subsurface mining areas in the Green River Basin of Wyoming. As of December 31, 2019, it had proven and probable reserves of approximately 211.9 million short tons of trona. Ciner Resource Partners LLC serves as the general partner of the company. The company was formerly known as OCI Resources LP and changed its name to Ciner Resources LP in November 2015. Ciner Resources LP is based in Atlanta, Georgia. Ciner Resources LP is a subsidiary of Ciner Wyoming Holding Co.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Atlanta"
    },
    "DD": {
        "short_name": "DuPont de Nemours, Inc.",
        "long_name": "DuPont de Nemours, Inc.",
        "summary": "DuPont de Nemours, Inc. provides technology-based materials, ingredients, and solutions in the United States, Canada, the Asia Pacific, Latin America, Europe, the Middle East, and Africa. The company provide Electronics & Imaging segment supplies materials to manufacture photovoltaics and solar cells; materials and printing systems to the advanced printing industry; and materials and solutions for the fabrication of semiconductors and integrated circuits addressing front-end and back-end of the manufacturing process. This segment also provides permanent and process chemistries for the fabrication of printed circuit boards to include laminates and substrates, electroless, and electrolytic metallization solutions, as well as patterning solutions, and materials and metallization processes for metal finishing, decorative, and industrial applications. In addition, it offers various materials to manufacture rigid and flexible displays for liquid crystal displays, advanced-matrix organic light emitting diode, and quantum dot applications. It also provide Transportation & Advanced Polymers segment provides engineering resins, adhesives, lubricants, and parts to engineers and designers in the transportation, electronics, healthcare, industrial, and consumer end-markets. The company in Safety & Construction segment provides engineered products and integrated systems for construction, worker safety, energy, oil and gas, transportation, medical device, and water purification and separation industries. The company was formerly known as DowDuPont Inc. and changed its name to DuPont de Nemours, Inc. in June 2019. DuPont de Nemours, Inc. is based in Wilmington, Delaware.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Wilmington"
    },
    "DD.MX": {
        "short_name": "DUPONT DE NEMOURS INC",
        "long_name": "DuPont de Nemours, Inc.",
        "summary": "DuPont de Nemours, Inc. provides technology-based materials, ingredients, and solutions in the United States, Canada, the Asia Pacific, Latin America, Europe, the Middle East, and Africa. The company provide Electronics & Imaging segment supplies materials to manufacture photovoltaics and solar cells; materials and printing systems to the advanced printing industry; and materials and solutions for the fabrication of semiconductors and integrated circuits addressing front-end and back-end of the manufacturing process. This segment also provides permanent and process chemistries for the fabrication of printed circuit boards to include laminates and substrates, electroless, and electrolytic metallization solutions, as well as patterning solutions, and materials and metallization processes for metal finishing, decorative, and industrial applications. In addition, it offers various materials to manufacture rigid and flexible displays for liquid crystal displays, advanced-matrix organic light emitting diode, and quantum dot applications. It also provide Transportation & Advanced Polymers segment provides engineering resins, adhesives, lubricants, and parts to engineers and designers in the transportation, electronics, healthcare, industrial, and consumer end-markets. The company in Safety & Construction segment provides engineered products and integrated systems for construction, worker safety, energy, oil and gas, transportation, medical device, and water purification and separation industries. The company was formerly known as DowDuPont Inc. and changed its name to DuPont de Nemours, Inc. in June 2019. DuPont de Nemours, Inc. is based in Wilmington, Delaware.",
        "currency": "MXN",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Wilmington"
    },
    "DDNB34.SA": {
        "short_name": "DUPONT N INCDRN",
        "long_name": "DuPont de Nemours, Inc.",
        "summary": "DuPont de Nemours, Inc. provides technology-based materials, ingredients, and solutions in the United States, Canada, the Asia Pacific, Latin America, Europe, the Middle East, and Africa. The company provide Electronics & Imaging segment supplies materials to manufacture photovoltaics and solar cells; materials and printing systems to the advanced printing industry; and materials and solutions for the fabrication of semiconductors and integrated circuits addressing front-end and back-end of the manufacturing process. This segment also provides permanent and process chemistries for the fabrication of printed circuit boards to include laminates and substrates, electroless, and electrolytic metallization solutions, as well as patterning solutions, and materials and metallization processes for metal finishing, decorative, and industrial applications. In addition, it offers various materials to manufacture rigid and flexible displays for liquid crystal displays, advanced-matrix organic light emitting diode, and quantum dot applications. It also provide Transportation & Advanced Polymers segment provides engineering resins, adhesives, lubricants, and parts to engineers and designers in the transportation, electronics, healthcare, industrial, and consumer end-markets. The company in Safety & Construction segment provides engineered products and integrated systems for construction, worker safety, energy, oil and gas, transportation, medical device, and water purification and separation industries. The company was formerly known as DowDuPont Inc. and changed its name to DuPont de Nemours, Inc. in June 2019. DuPont de Nemours, Inc. is based in Wilmington, Delaware.",
        "currency": "BRL",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Wilmington"
    },
    "DDPN.VI": {
        "short_name": "DUPONT DE NEMOURS INC",
        "long_name": "DuPont de Nemours, Inc.",
        "summary": "DuPont de Nemours, Inc. provides technology-based materials, ingredients, and solutions in the United States, Canada, the Asia Pacific, Latin America, Europe, the Middle East, and Africa. The company provide Electronics & Imaging segment supplies materials to manufacture photovoltaics and solar cells; materials and printing systems to the advanced printing industry; and materials and solutions for the fabrication of semiconductors and integrated circuits addressing front-end and back-end of the manufacturing process. This segment also provides permanent and process chemistries for the fabrication of printed circuit boards to include laminates and substrates, electroless, and electrolytic metallization solutions, as well as patterning solutions, and materials and metallization processes for metal finishing, decorative, and industrial applications. In addition, it offers various materials to manufacture rigid and flexible displays for liquid crystal displays, advanced-matrix organic light emitting diode, and quantum dot applications. It also provide Transportation & Advanced Polymers segment provides engineering resins, adhesives, lubricants, and parts to engineers and designers in the transportation, electronics, healthcare, industrial, and consumer end-markets. The company in Safety & Construction segment provides engineered products and integrated systems for construction, worker safety, energy, oil and gas, transportation, medical device, and water purification and separation industries. The company was formerly known as DowDuPont Inc. and changed its name to DuPont de Nemours, Inc. in June 2019. DuPont de Nemours, Inc. is based in Wilmington, Delaware.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "Wilmington"
    },
    "DG3.F": {
        "short_name": "CELANESE CORP. DL-,0001",
        "long_name": "Celanese Corporation",
        "summary": "Celanese Corporation, a technology and specialty materials company, manufactures and sells high performance engineered polymers in the United States and internationally. The company operates through Engineered Materials, Acetate Tow, and Acetyl Chain segments. The Engineered Materials segment develops, produces, and supplies specialty polymers for automotive and medical applications, as well as for use in industrial products and consumer electronics. It also offers acesulfame potassium, a sweetener for use in various beverages, confections, and dairy products; and food protection ingredients, such as potassium sorbate and sorbic acid for use in foods, beverages, and personal care products. The Acetate Tow segment provides acetate tows and flakes for use in filter products applications. The Acetyl Chain segment produces and supplies acetyl products, including acetic acid, vinyl acetate monomers, acetic anhydride, and acetate esters that are used as starting materials for colorants, paints, adhesives, coatings, and pharmaceuticals; and organic solvents and intermediates for pharmaceutical, agricultural, and chemical products. It also offers vinyl acetate-based emulsions for use in paints and coatings, adhesives, construction, glass fiber, textiles, and paper applications; and ethylene vinyl acetate resins and compounds, as well as low-density polyethylene for use in flexible packaging films, lamination film products, hot melt adhesives, automotive parts, and carpeting applications. In addition, it manufactures GUR ultra-high molecular weight polyethylene. Celanese Corporation was founded in 1918 and is headquartered in Irving, Texas.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Irving"
    },
    "DOW": {
        "short_name": "Dow Inc.",
        "long_name": "Dow Inc.",
        "summary": "Dow Inc. provides various materials science solutions for consumer care, infrastructure, and packaging markets in the United States, Canada, Europe, the Middle East, Africa, India, the Asia Pacific, and Latin America. It operates through Packaging & Specialty Plastics, Industrial Intermediates & Infrastructure, and Performance Materials and Coatings segments. The Packaging & Specialty Plastics segment provides ethylene, and propylene and aromatic products; and polyethylene, polyolefin elastomers, ethylene vinyl acetate, and ethylene propylene diene monomer rubbers. The Industrial Intermediates & Infrastructure segment offers ethylene oxides, propylene oxide, propylene glycol and polyether polyols, aromatic isocyanates and polyurethane systems, coatings, adhesives, sealants, elastomers, and composites. This segment also provides caustic soda, and ethylene dichloride and vinyl chloride monomers; and cellulose ethers, redispersible latex powders, silicones, and acrylic emulsions. The Performance Materials and Coatings segment provides architectural paints and coatings, and industrial coatings that are used in maintenance and protective industries, wood, metal packaging, traffic markings, thermal paper, and leather; performance monomers and silicones; standalone silicones; and home and personal care solutions. It also engages in property and casualty insurance, as well as reinsurance business. Dow Inc. was incorporated in 2018 and is headquartered in Midland, Michigan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Midland"
    },
    "EAC.F": {
        "short_name": "EASTMAN CHEM. CO.  DL-,01",
        "long_name": "Eastman Chemical Company",
        "summary": "Eastman Chemical Company operates as an advanced materials and specialty additives company worldwide. The company's Additives & Functional Products segment offers specialty coalescent, specialty and commodity solvents, paint additives, and specialty polymers; hydrocarbon and rosin resins; insoluble sulfur and anti-degradant rubber additives; performance resins; amine derivative-based building blocks; heat transfer and aviation fluids; organic acid-based solutions; and metam-based soil fumigants, thiram and ziram based fungicides, and plant growth regulators. It serves the transportation, consumables, building and construction, animal nutrition, crop protection, energy, personal and home care, and other markets. Its Advanced Materials segment provides copolyesters, cellulose esters, polyvinyl butyral (PVB) sheets, and window and protective films, and aftermarket applied film products for value-added end uses in the transportation, consumables, building and construction, durable goods, and health and wellness markets. The company's Chemical Intermediates segment offers Olefin and acetyl derivatives, ethylene, and commodity solvents; primary non-phthalate and phthalate plasticizers, and niche non- phthalate plasticizers; and methylamines and salts higher amines and solvents to the industrial chemicals and processing, building and construction, health and wellness, and agrochemicals. Its Fibers segment provides cellulose acetate tow, triacetin, cellulose acetate flake, and acetic anhydride for use in filtration media primarily cigarette filters; natural and solution dyed acetate yarns for use in consumables, and health and wellness markets; and wet-laid nonwoven media, specialty and engineered papers, and cellulose acetate fibers for transportation, industrial, agriculture and mining, aerospace, personal hygiene, and consumables markets. Eastman Chemical Company was founded in 1920 and is headquartered in Kingsport, Tennessee.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Kingsport"
    },
    "EESE": {
        "short_name": "ENERGY & ENVIRONME",
        "long_name": "Energy and Environmental Services, Inc.",
        "summary": "Energy and Environmental Services, Inc. manufactures and sells custom liquids and solid chemicals for the oil, gas, and agricultural industries. It provides oilfield chemicals for frac and stimulation, completion, and production phases, including scale inhibitors, corrosion inhibitors, packer fluid inhibitors, paraffin dispersant compounds H2S scavengers, biocides, water treating compounds, demulsifiers, emulsion breakers, nonemulsifiers, frac foamers, clay stabilizers, liquid KCL substitutes, cross linkers, wetting agents/surfactants, friction reducers, anti-sludge agents, mutual solvents, silt suspenders, iron sequestrants, iron control products, complete acid gel systems, xylene/acid emulsifiers, and HCl acid retarders under the Enduro-Tech name. The company also offers custom chemical blending, toll blending, and private labeling services to downhole production chemical companies. In addition, it provides powdered coatings under the Enduro-Bond trademark; and Ecozyme system technologies in the industries of agriculture, livestock feed supplements / products, and malodor elimination. Energy and Environmental Services, Inc. is based in Edmond, Oklahoma. As of November 4, 2015, Energy and Environmental Services, Inc. operates as a subsidiary of BlueHawk Energy, Inc.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Edmond"
    },
    "EMN": {
        "short_name": "Eastman Chemical Company",
        "long_name": "Eastman Chemical Company",
        "summary": "Eastman Chemical Company operates as an advanced materials and specialty additives company worldwide. The company's Additives & Functional Products segment offers specialty coalescent, specialty and commodity solvents, paint additives, and specialty polymers; hydrocarbon and rosin resins; insoluble sulfur and anti-degradant rubber additives; performance resins; amine derivative-based building blocks; heat transfer and aviation fluids; organic acid-based solutions; and metam-based soil fumigants, thiram and ziram based fungicides, and plant growth regulators. It serves the transportation, consumables, building and construction, animal nutrition, crop protection, energy, personal and home care, and other markets. Its Advanced Materials segment provides copolyesters, cellulose esters, polyvinyl butyral (PVB) sheets, and window and protective films, and aftermarket applied film products for value-added end uses in the transportation, consumables, building and construction, durable goods, and health and wellness markets. The company's Chemical Intermediates segment offers Olefin and acetyl derivatives, ethylene, and commodity solvents; primary non-phthalate and phthalate plasticizers, and niche non- phthalate plasticizers; and methylamines and salts higher amines and solvents to the industrial chemicals and processing, building and construction, health and wellness, and agrochemicals. Its Fibers segment provides cellulose acetate tow, triacetin, cellulose acetate flake, and acetic anhydride for use in filtration media primarily cigarette filters; natural and solution dyed acetate yarns for use in consumables, and health and wellness markets; and wet-laid nonwoven media, specialty and engineered papers, and cellulose acetate fibers for transportation, industrial, agriculture and mining, aerospace, personal hygiene, and consumables markets. Eastman Chemical Company was founded in 1920 and is headquartered in Kingsport, Tennessee.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Kingsport"
    },
    "FF": {
        "short_name": "FutureFuel Corp.",
        "long_name": "FutureFuel Corp.",
        "summary": "FutureFuel Corp., through its subsidiary, FutureFuel Chemical Company, manufactures and sells diversified chemical, bio-based fuel, and bio-based specialty chemical products in the United States and internationally. The company operates through two segments, Chemicals and Biofuels. The Chemicals segment provides various custom chemicals that are used in the agricultural chemical, coatings, chemical intermediates, industrial and consumer cleaning, oil and gas, and specialty polymers industries; and performance chemicals, such as polymer modifiers, glycerin products, and various specialty chemicals and solvents. The Biofuels segment is involved in the production and sale of biodiesel and petrodiesel blends; and the buying, sale, and shipping of refined petroleum products on common carrier pipelines. This segment markets its biodiesel products directly to customers through trucks, rail, and barges. The company is headquartered in Saint Louis, Missouri.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Saint Louis"
    },
    "FIND": {
        "short_name": "FINDEX COM INC",
        "long_name": "Findex.com, Inc.",
        "summary": "Findex.com, Inc. produces, markets, and distributes specialty surface coatings for use in various industrial, commercial, residential, and consumer applications in the United States. It offers interior flooring and exterior tile, paver and hardscape coatings; coatings for industrial and residential HVAC equipment, commercial refrigeration systems, and power generators; coatings for automobile and motorcycle exteriors; coatings for vessels and marine infrastructure; coatings for heavy trucks and construction equipment/vehicles; and coatings for oil and gas drilling, mining, and related heavy equipment. The company is headquartered in Lake Park, Florida.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Lake Park"
    },
    "FLRE": {
        "short_name": "FLAMERET INC",
        "long_name": "Flameret, Inc.",
        "summary": "Flameret, Inc., a development stage company, focuses on manufacturing and distributing fire barrier product named Flameret. The Flameret is a flame retardant liquid applied to textiles for producing mattresses, to resist ignition from smoldering cigarettes, and to impede ignition from open-flame heat sources. It offers products comprising Flameret, a textile FR treatment; Ultra Flamex, a fire extinguishing product; and Impex. The company was founded in 2009 and is headquartered in Venice, Florida.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Venice"
    },
    "GLTC": {
        "short_name": "GELTECH SOLUTIONS INC",
        "long_name": "GelTech Solutions, Inc.",
        "summary": "GelTech Solutions, Inc. manufactures and markets environmentally friendly products in the United States and internationally. It offers FireIce, a water enhancing powder for use as a fire suppressant in wildland and urban firefighting, and as a medium-term fire retardant to protect wildlands, structures, and firefighters. The company also provides FireIce Shield, a line of asset protection products, including welding blankets, which is used during hot work by plumbers and welders; and FireIce Shield CTP unit that is used in protection of communication towers during welding and cutting. In addition, it offers Soil2O dust control products, including Soil2O dust control that control airborne particulate matter while substantially reducing water usage on traffic areas; Soil2O soil cap, a product that controls dust and erosion of non-traffic and storage areas; and Soil2O Topical and Soil2O Granular used in specialty agriculture, home and commercial landscaping, and golf course maintenance to sustain plant growth while reducing the amount of water needed for irrigation. Further, the company markets Emergency Manhole FireIce Delivery System to deliver FireIce into a manhole in the event of a fire or explosion; FireIce Home Defense Unit, a system for applying FireIce to structures to protect them from wildfires; and FireIce Shield CTP systems to protect communication towers during hot work. It markets its products through municipal and other fire equipment distributors, as well as through online and direct marketing. The company was founded in 2006 and is headquartered in Jupiter, Florida.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Jupiter"
    },
    "HTR.F": {
        "short_name": "HUNTSMAN CORP.  DL-,01",
        "long_name": "Huntsman Corporation",
        "summary": "Huntsman Corporation manufactures and sells differentiated organic chemical products worldwide. The company operates in four segments: Polyurethanes, Performance Products, Advanced Materials, and Textile Effects. The Polyurethanes segment offers polyurethane chemicals, including methyl diphenyl diisocyanate, polyols, thermoplastic polyurethane, propylene oxide, and methyl tertiary-butyl ether products. The Performance Products segment manufactures specialty amines, ethyleneamines, and maleic anhydrides, and technology licenses. The Advanced Materials segment offers epoxy, acrylic, and polyurethane-based polymers formulations; high performance thermoset resins and curing agents; and base liquid and solid resins. The Textile Effects segment provides textile chemicals, dyes, and inks. The company's products are used in a range of applications, including adhesives, aerospace, automotive, construction products, personal care and hygiene, durable and non-durable consumer products, digital inks, electronics, insulation, medical, packaging, coatings and construction, power generation, refining, synthetic fiber, textile chemicals, and dye industries. Huntsman Corporation was founded in 1970 and is headquartered in The Woodlands, Texas.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "The Woodlands"
    },
    "HUN": {
        "short_name": "Huntsman Corporation",
        "long_name": "Huntsman Corporation",
        "summary": "Huntsman Corporation manufactures and sells differentiated organic chemical products worldwide. The company operates in four segments: Polyurethanes, Performance Products, Advanced Materials, and Textile Effects. The Polyurethanes segment offers polyurethane chemicals, including methyl diphenyl diisocyanate, polyols, thermoplastic polyurethane, propylene oxide, and methyl tertiary-butyl ether products. The Performance Products segment manufactures specialty amines, ethyleneamines, and maleic anhydrides, and technology licenses. The Advanced Materials segment offers epoxy, acrylic, and polyurethane-based polymers formulations; high performance thermoset resins and curing agents; and base liquid and solid resins. The Textile Effects segment provides textile chemicals, dyes, and inks. The company's products are used in a range of applications, including adhesives, aerospace, automotive, construction products, personal care and hygiene, durable and non-durable consumer products, digital inks, electronics, insulation, medical, packaging, coatings and construction, power generation, refining, synthetic fiber, textile chemicals, and dye industries. Huntsman Corporation was founded in 1970 and is headquartered in The Woodlands, Texas.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "The Woodlands"
    },
    "IEVM": {
        "short_name": "INTEGRATED ENVIRONMENTAL TECHS ",
        "long_name": "Integrated Environmental Technologies, Ltd.",
        "summary": "Integrated Environmental Technologies, Ltd., through its subsidiary, I.E.T., Inc. produces and sells hypochlorous acid and anti-oxidizing alkaline solutions for use in cleaning, sanitizing, and disinfecting applications. The company offers anolyte that kills various pathogens including, Mycobacterium bovis, almonella enterica, pseudomonas aeruginosa, staphylococcus aureus, methicillin-resistant staphylococcus aureus, h1n1 influenza virus, and respiratory syncytial virus; hospital-acquired, blood-borne, and food-borne pathogens; and yeast, as well as non-enveloped viruses, such as adenovirus, norovirus, rhinovirus, and rotavirus. Its anolyte is also used as hydrogen sulfide scavenger/eliminator and biocide in oil and gas applications; and as a disinfectant to prevent canine distemper virus, canine parvovirus, and bordetella bronchiseptica. In addition, the company offers catholyte, an anti-oxidizing and mild alkaline solution that is effective as an industrial degreaser and cleaner; and manufactures and leases EcaFlo equipment. It markets its anolyte under the Excelyte brand name; and catholyte under the Catholyte Zero brand name. The company sells its products to the oil and gas production, healthcare facilities, and food production markets primarily through independent sales representatives and distributors in the United States. Integrated Environmental Technologies, Ltd. was incorporated in 1999 and is headquartered in Little River, South Carolina.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Little River"
    },
    "LS3.F": {
        "short_name": "LSB IND. INC.  DL-,10",
        "long_name": "LSB Industries, Inc.",
        "summary": "LSB Industries, Inc. manufactures, sells, and markets chemical products in the United States. It provides nitrogen-based fertilizers, such as ammonia, fertilizer grade ammonium nitrate (HDAN), and urea ammonia nitrate for fertilizer and fertilizer blends for corn and other crops, and NPK fertilizer blends applications. The company also offers high purity and commercial grade ammonia, high purity ammonium nitrate, sulfuric acids, mixed nitrating acids, carbon dioxide, and diesel exhaust fluids, as well as concentrated, blended, and regular nitric acids for various applications, including semi-conductor and polyurethane intermediates; pulp and paper, alum, water treatment, metals, and vanadium processing; power plant emissions abatement, water treatment, refrigerants, and metals processing; and exhaust stream additive, and horticulture/greenhouse applications; and refrigeration. In addition, it provides industrial grade ammonium nitrate, ammonium nitrate solutions, and HDAN solutions for the specialty emulsions for mining, surface mining, quarries, and construction applications. The company sells its products through distributors, as well as directly to end customers. LSB Industries, Inc. was founded in 1968 and is headquartered in Oklahoma City, Oklahoma.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Oklahoma City"
    },
    "LXU": {
        "short_name": "LSB Industries, Inc.",
        "long_name": "LSB Industries, Inc.",
        "summary": "LSB Industries, Inc. manufactures, sells, and markets chemical products in the United States. It provides nitrogen-based fertilizers, such as ammonia, fertilizer grade ammonium nitrate (HDAN), and urea ammonia nitrate for fertilizer and fertilizer blends for corn and other crops, and NPK fertilizer blends applications. The company also offers high purity and commercial grade ammonia, high purity ammonium nitrate, sulfuric acids, mixed nitrating acids, carbon dioxide, and diesel exhaust fluids, as well as concentrated, blended, and regular nitric acids for various applications, including semi-conductor and polyurethane intermediates; pulp and paper, alum, water treatment, metals, and vanadium processing; power plant emissions abatement, water treatment, refrigerants, and metals processing; and exhaust stream additive, and horticulture/greenhouse applications; and refrigeration. In addition, it provides industrial grade ammonium nitrate, ammonium nitrate solutions, and HDAN solutions for the specialty emulsions for mining, surface mining, quarries, and construction applications. The company sells its products through distributors, as well as directly to end customers. LSB Industries, Inc. was founded in 1968 and is headquartered in Oklahoma City, Oklahoma.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Oklahoma City"
    },
    "MNK.F": {
        "short_name": "MINERALS TECHS  DL-,10",
        "long_name": "Minerals Technologies Inc.",
        "summary": "Minerals Technologies Inc. develops, produces, and markets various specialty mineral, mineral-based, and synthetic mineral products, and supporting systems and services worldwide. The company's Performance Materials segment supplies bentonite and bentonite-related products, as well as chromite and leonardite. This segment offers metal casting products; household, personal care, and specialty products; and basic minerals, environmental products, and building materials. In addition, this segment provides products for non-residential construction, environmental, and infrastructure projects, as well as for construction project customers. Its Specialty Minerals segment produces and sells precipitated calcium carbonate and quicklime; and provides natural mineral products comprising limestone and talc. This segment's products are used in paper, building materials, paint and coatings, glass, ceramic, polymer, food, automotive, and pharmaceutical industries. The company's Refractories segment offers monolithic and shaped refractory materials; specialty products, services, and application and measurement equipment; and calcium metal and metallurgical wire products that are used in the applications of steel, non-ferrous metal, and glass industries. Its Energy Services segment provides offshore filtration and well testing services to the oil and gas industry. The company markets its products primarily through its direct sales force, as well as regional distributors. Minerals Technologies Inc. was founded in 1968 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "New York"
    },
    "MTX": {
        "short_name": "Minerals Technologies Inc.",
        "long_name": "Minerals Technologies Inc.",
        "summary": "Minerals Technologies Inc. develops, produces, and markets various specialty mineral, mineral-based, and synthetic mineral products, and supporting systems and services worldwide. The company's Performance Materials segment supplies bentonite and bentonite-related products, as well as chromite and leonardite. This segment offers metal casting products; household, personal care, and specialty products; and basic minerals, environmental products, and building materials. In addition, this segment provides products for non-residential construction, environmental, and infrastructure projects, as well as for construction project customers. Its Specialty Minerals segment produces and sells precipitated calcium carbonate and quicklime; and provides natural mineral products comprising limestone and talc. This segment's products are used in paper, building materials, paint and coatings, glass, ceramic, polymer, food, automotive, and pharmaceutical industries. The company's Refractories segment offers monolithic and shaped refractory materials; specialty products, services, and application and measurement equipment; and calcium metal and metallurgical wire products that are used in the applications of steel, non-ferrous metal, and glass industries. Its Energy Services segment provides offshore filtration and well testing services to the oil and gas industry. The company markets its products primarily through its direct sales force, as well as regional distributors. Minerals Technologies Inc. was founded in 1968 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "NUEC": {
        "short_name": "NUEARTH CORPORATION",
        "long_name": "NuEarth Corporation",
        "summary": "NuEarth Corporation develops and markets organic and biodegradable products in the United States. The company develops clean and green soil and water conservation technologies. Its product line includes NuSoil-liquid and granular products to change eroded property to productive land; SaltBlocker, an organic matter that limits the availability of salt cations and anions to the liquid soil, and changes the osmotic pressure within the soil composite; NuWater, a NuSoil water gel additive that helps prevent dust storms; and AquaSolv-liquid and granular formulations that slow down the infiltration rate of water and enables lateral spread through the root zone. The company also provides DustBlocker and RoadBinder, anionic polyacrylamides that enable road managers at mine and building sites to manage the dust and compaction. In addition, it develops the CL-40 line of products, such as cleaners, compound strippers, and graffiti removers for various cleaning applications. The company was formerly known as Eco-Rx, Inc. and changed its name to NuEarth Corporation in July 2009. NuEarth Corporation was founded in 1995 and is based in Miramar Beach, Florida.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Miramar Beach"
    },
    "RKTE": {
        "short_name": "HIGH VELOCITY ALTERNATIVE ENERG",
        "long_name": "Reflectkote, Inc.",
        "summary": "Reflectkote, Inc. develops reflective coatings. Its reflective coatings when applied to various surfaces reflect light back as a mirror, as well as protect surfaces from corrosion. The company is based in State College, Pennsylvania.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "State College"
    },
    "RWFC": {
        "short_name": "RENEWABLE FUEL CORP",
        "long_name": "Renewable Fuel Corp.",
        "summary": "Renewable Fuel Corp, a development stage company, focuses on the production, blending, and distribution of biodiesel, refined glycerine, and related byproducts primarily in Malaysia and Indonesia. It also owns a license to produce biodiesel products in Malaysia and two additional biodiesel licenses in Indonesia. The company plans to sell its biodiesel products to fuel distributors, jobbers, blenders, industrial users, fleet operators, and retail fuel station operators, as well as federal, state, and local governments; and glycerine to distributors, manufacturers, and other buyers or users of refined glycerine products. It also renders consulting services to other companies. Renewable Fuel Corp was founded in 2006 and is headquartered in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Las Vegas"
    },
    "RYAM": {
        "short_name": "Rayonier Advanced Materials Inc",
        "long_name": "Rayonier Advanced Materials Inc.",
        "summary": "Rayonier Advanced Materials Inc. manufactures and sells cellulose specialty products in the United States, China, Japan, Europe, Latin America, other Asian countries, Canada, and internationally. The company operates through High Purity Cellulose, Forest Products, Paperboard, and Pulp & Newsprint segments. Its products include cellulose specialties, which are natural polymers that are used as raw materials to manufacture a range of consumer-oriented products, such as cigarette filters, liquid crystal displays, impact-resistant plastics, thickeners for food products, pharmaceuticals, cosmetics, high-tenacity rayon yarn for tires and industrial hoses, food casings, paints, and lacquers. The company also offers commodity products, such as commodity viscose used in woven applications, including rayon textiles for clothing and other fabrics, as well as in non-woven applications comprising baby wipes, cosmetic and personal wipes, industrial wipes, and mattress ticking; and absorbent materials consisting of fluff fibers that are used as an absorbent medium in disposable baby diapers, feminine hygiene products, incontinence pads, convalescent bed pads, industrial towels and wipes, and non-woven fabrics. In addition, it provides finished dimensional lumber for use in the construction of residential and multi-family homes, light industrial, and commercial facilities, as well as in the home repair and remodel markets. Further, the company offers paperboards for packaging, printing documents, brochures, promotional materials, paperback books or catalog covers, file folders, tags, and tickets; high-yield pulps to produce paperboard and packaging products, printing and writing papers, and various other paper products; and newsprint, a paper grade used to print newspapers, advertising materials, and other publications. Rayonier Advanced Materials Inc. was founded in 1926 and is headquartered in Jacksonville, Florida.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Jacksonville"
    },
    "RYQ.F": {
        "short_name": "RAYONIER ADV. MATERIALS",
        "long_name": "Rayonier Advanced Materials Inc.",
        "summary": "Rayonier Advanced Materials Inc. manufactures and sells cellulose specialty products in the United States, China, Japan, Europe, Latin America, other Asian countries, Canada, and internationally. The company operates through High Purity Cellulose, Forest Products, Paperboard, and Pulp & Newsprint segments. Its products include cellulose specialties, which are natural polymers that are used as raw materials to manufacture a range of consumer-oriented products, such as cigarette filters, liquid crystal displays, impact-resistant plastics, thickeners for food products, pharmaceuticals, cosmetics, high-tenacity rayon yarn for tires and industrial hoses, food casings, paints, and lacquers. The company also offers commodity products, such as commodity viscose used in woven applications, including rayon textiles for clothing and other fabrics, as well as in non-woven applications comprising baby wipes, cosmetic and personal wipes, industrial wipes, and mattress ticking; and absorbent materials consisting of fluff fibers that are used as an absorbent medium in disposable baby diapers, feminine hygiene products, incontinence pads, convalescent bed pads, industrial towels and wipes, and non-woven fabrics. In addition, it provides finished dimensional lumber for use in the construction of residential and multi-family homes, light industrial, and commercial facilities, as well as in the home repair and remodel markets. Further, the company offers paperboards for packaging, printing documents, brochures, promotional materials, paperback books or catalog covers, file folders, tags, and tickets; high-yield pulps to produce paperboard and packaging products, printing and writing papers, and various other paper products; and newsprint, a paper grade used to print newspapers, advertising materials, and other publications. Rayonier Advanced Materials Inc. was founded in 1926 and is headquartered in Jacksonville, Florida.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Jacksonville"
    },
    "SLMNP": {
        "short_name": "LYONDEL LBASELL ADVNCED POLYMER",
        "long_name": "A. Schulman, Inc.",
        "summary": "A. Schulman, Inc. manufactures and supplies plastic compounds and resins. It offers custom performance colors, including standard and customized colors, organic and inorganic pigments, high chroma colors in translucent or opaque formats, and special effects. The company also provides engineered composites, such as bulk molding compounds, sheet molding compounds, and thick molding compounds, as well as engineered structural composite solutions for original equipment manufacturers and custom molders. In addition, it offers concentrates to enhance the performance, appearance, and processing of plastics for intended applications; additive solutions; and application solutions that minimize the use of plastics, or incorporate the use of recycled plastics or renewable-based polymers, as well as provides films for agriculture, packaging, and personal care and hygiene applications. Further, the company offers polymer solutions, which provide structural integrity; multi-component blends that include polyolefins, nylons, polyesters and elastomers, and others; and formulating know-how with fiber reinforcements, such as glass and carbon, nano-reinforcements, flame retardants, impact modifiers, and UV stabilization. Additionally, it offers size reduction services; specialty powders for rotational molding, oil and gas additives, and sports and leisure products; jet milling services used for products requiring fine particle size; and cryogenic milling services. The company also buys, repackages, and resells polymers for processing types, such as injection molding, blow molding, thermoforming, and film and sheet extruding. It serves packaging, mobility, building and construction, electronics and electrical, agriculture, personal care and hygiene, custom services, sports, home, and leisure markets worldwide. The company was founded in 1928 and is headquartered in Fairlawn, Ohio. As of August 21, 2018, A. Schulman, Inc. operates as a subsidiary of LyondellBasell Industries N.V.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Fairlawn"
    },
    "T5X.F": {
        "short_name": "TRONOX HLDGS PLC  DL -,01",
        "long_name": "Tronox Holdings plc",
        "summary": "Tronox Holdings plc operates as a vertically integrated manufacturer of TiO2 pigment in South and Central America, Europe, the Middle East, Africa, and the Asia Pacific. The company operates titanium-bearing mineral sand mines, and beneficiation and smelting operations. Its products include TiO2, zircon, and pig iron, as well as feedstock and other products comprising rutile prime, ilmenite, chloride slag, and other mining products. The company's products are used for the manufacture of paints, coatings, plastics, and paper, as well as a range of other applications. Tronox Holdings plc is based in Stamford, Connecticut.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Stamford"
    },
    "TROX": {
        "short_name": "Tronox Holdings plc",
        "long_name": "Tronox Holdings plc",
        "summary": "Tronox Holdings plc operates as a vertically integrated manufacturer of TiO2 pigment in South and Central America, Europe, the Middle East, Africa, and the Asia Pacific. The company operates titanium-bearing mineral sand mines, and beneficiation and smelting operations. Its products include TiO2, zircon, and pig iron, as well as feedstock and other products comprising rutile prime, ilmenite, chloride slag, and other mining products. The company's products are used for the manufacture of paints, coatings, plastics, and paper, as well as a range of other applications. Tronox Holdings plc is based in Stamford, Connecticut.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Stamford"
    },
    "UNVR": {
        "short_name": "Univar Solutions Inc.",
        "long_name": "Univar Solutions Inc.",
        "summary": "Univar Solutions Inc. distributes commodity and specialty chemical products, and related services worldwide. It also provides epoxy resins, polyurethanes, titanium dioxide, fumed silica, esters, plasticizers, silicones, and specialty amines; chemicals and service to midstream pipeline and downstream refinery operators; and commodity and specialty products for meat processing, baked goods, dairy, grain mill products, processed foods, carbonated soft drinks, fruit drinks, and alcoholic beverage markets. In addition, the company offers chemical products for use at various stages of production, from sap stain prevention to pulp and paper manufacturing; ingredients for cleaners, detergents, and disinfectant products; base stocks and performance-enhancing additives for lubricants and metalworking fluids; excipients, solvents, reactants, active pharmaceutical ingredients, and intermediates to pharmaceutical ingredient producers; and products for water treatment that includes pH adjusters, flocculants, coagulants, dechlorinators, and disinfectants. Further, it provides transportation and warehousing infrastructure, chemicals and hazardous materials handling, waste management services, inventory management, and blending and repackaging services, as well as industrial cleaning, site remediation, and emergency environmental response services. Univar Solutions Inc. distributes its products through warehouse and direct-to-consumer delivery channels. The company was formerly known as Univar Inc. and changed its name to Univar Solutions Inc. in September 2019. The company was founded in 1924 and is headquartered in Downers Grove, Illinois.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Downers Grove"
    },
    "VHI": {
        "short_name": "Valhi, Inc.",
        "long_name": "Valhi, Inc.",
        "summary": "Valhi, Inc. engages in the chemicals, component products, and real estate management and development businesses in the Asia Pacific, Europe, North America, and internationally. The company's Chemicals segment produces and markets titanium dioxide pigments (TiO2), which are white inorganic pigments used in various applications by paint, plastics, decorative laminate, and paper manufacturers. It offers TiO2 under the KRONOS name through agents and distributors. This segment also offers ilmenite, a raw material used directly as a feedstock by sulfate-process TiO2 plants; iron-based chemicals; and titanium oxychloride and titanyl sulfate. The company's Component Products segment manufactures mechanical and electrical cabinet locks, and other locking mechanisms for use in ignition systems, mailboxes, file cabinets, desk drawers, tool storage cabinets, vending and gaming machines, medical cabinetry security, electronic circuit panels, storage compartments, and gas station security applications. It also provides stainless steel exhaust components, gauges, throttle controls, wake enhancement systems, trim tabs, and related hardware and accessories primarily for performance and ski/wakeboard boats. The company's Real Estate Management and Development segment offers utility services to industrial and municipal customers; owns real properties; and develops land holdings for commercial, industrial, and residential purposes. It also provides insurance brokerage and risk management services; and holds marketable securities and other investments. The company is based in Dallas, Texas. Valhi, Inc. is a subsidiary of Contran Corporation.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Dallas"
    },
    "VULC": {
        "short_name": "VULCAN INTERNATIONAL CORP",
        "long_name": "Vulcan International Corporation",
        "summary": "Vulcan International Corporation, through its subsidiaries, manufactures and sells rubber and foam products in Tennessee, the United States. The company offers mixed and uncured rubber products; firm sheet products from SBR, Nitrile, and Neoprene polymers; expanded rubber sheets; polyethylene foams; cross-linked, closed cell, and EVA co-polymer foams; and low density closed cell SBR products. It also provides molded sheet stock and specialty items, such as automobile mats and footwear components. In addition, the company engages in the real estate management and development activities. Vulcan International Corporation was founded in 1909 and is based in Wilmington, Delaware.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Wilmington"
    },
    "WLKP": {
        "short_name": "Westlake Chemical Partners LP",
        "long_name": "Westlake Chemical Partners LP",
        "summary": "Westlake Chemical Partners LP acquires, develops, and operates ethylene production facilities and related assets in the United States. The company's ethylene production facilities primarily convert ethane into ethylene. It also sells ethylene co-products, including propylene, crude butadiene, pyrolysis gasoline, and hydrogen directly to third parties on a spot or contract basis. Westlake Chemical Partners GP LLC serves as the general partner of the company. The company was founded in 2014 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    }
}