{
    "DELLC.MX": {
        "short_name": "DELL TECHNOLOGIES INC",
        "long_name": "Dell Technologies Inc.",
        "summary": "Dell Technologies Inc. designs, develops, manufactures, markets, sells, and support IT hardware, software, and services solutions worldwide. It operates through three segments: Infrastructure Solutions Group (ISG), Client Solutions Group (CSG), and VMware. The ISG segment provides traditional and next-generation storage solutions; and rack, blade, tower, and hyperscale servers. It also offers networking products and services that help its business customers to transform and modernize their infrastructure, mobilize and enrich end-user experiences, and accelerate business applications and processes; and attached software and peripherals, as well as support and deployment, configuration, and extended warranty services. The CSG segment offers desktops, notebooks, and workstations; displays and projectors; attached and third-party software and peripherals, as well as support and deployment, configuration, and extended warranty services. The VMware segment supports and addresses various IT priorities of customers, including accelerating their cloud journey, modernizing their applications, empowering digital workspaces, transforming networking, and embracing intrinsic security. This segment enables its customers to digitally transform their operations as they ready their applications, infrastructure, and employees for constantly evolving business needs. It also offers cloud-native platform that makes software development and IT operations a strategic advantage for customers. The company also provides information security and cybersecurity solutions; cloud software and infrastructure-as-a-service solutions that enable customers to migrate, run, and manage mission-critical applications in cloud-based IT environments; cloud-based integration services; and financial services. The company was formerly known as Denali Holding Inc. and changed its name to Dell Technologies Inc. in August 2016. Dell Technologies Inc. was founded in 1984 and is headquartered in Round Rock, Texas.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Computer Based Systems",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Round Rock"
    },
    "SSYSN.MX": {
        "short_name": "STRATASYS LTD",
        "long_name": "Stratasys Ltd.",
        "summary": "Stratasys Ltd. provides 3D printing and additive manufacturing solutions for individuals, businesses, and enterprises. Its 3D printing systems utilize its fused deposition modeling (FDM) and inkjet-based PolyJet technologies to enable the production of prototypes, tools used for production, and manufactured goods directly from 3D CAD files or other 3D content. The company offers entry-level desktop 3D printers to systems for rapid prototyping, and production systems for direct digital manufacturing. It also provides 3D printing consumable materials, including FDM cartridge-based materials, PolyJet cartridge-based materials, non-color digital materials, and color variations. In addition, the company offers GrabCAD Print software that provides job programming, scheduling, monitoring, and analytics across various 3D printing technologies; and GrabCAD Workbench, a cloud-based project data management solution. Further, it operates Thingiverse, an online community for sharing downloadable digital 3D designs; and GrabCAD Community for mechanical engineers, designers, manufacturers, and students to best practices through tutorials, discussion forums, and design/print challenges. Additionally, the company offers customer support, basic warranty, and extended support programs, as well as strategy, operations, and engineering consultancy services; leases or rents 3D printers and 3D production systems; produces prototypes and end-use parts for customers from a customer-provided CAD file; and offers plastic and metal parts for rapid prototyping and production processes, as well as related professional services, carbon-fiber based printers, and elastomeric materials. Its products and services are primarily used in the automotive, aerospace, medical, dental, education, and consumer goods markets. The company sells its products through a network of resellers and independent sales agents worldwide. Stratasys Ltd. was founded in 1989 and is headquartered in Eden Prairie, Minnesota.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Computer Based Systems",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Eden Prairie"
    }
}