{
  "GTSO": {
    "city": "San Jose",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Green Technology Solutions, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Conglomerates",
    "short_name": "GREEN TECHNOLOGY SOLUTIONS INC",
    "state": "CA",
    "summary": "Green Technology Solutions, Inc. focuses on providing business support services to the horticultural and medical cannabis markets. It intends to provide payment processing, security, and transport support services; hemp delivery systems; and specialty organic soils and fertilizers, lighting systems, and methods to produce other cannabinoid products. The company was formerly known as Sunrise Energy Resources, Inc. and changed its name to Green Technology Solutions, Inc. in October 2010. Green Technology Solutions, Inc. was incorporated in 1991 and is based in San Jose, California.",
    "website": null,
    "zipcode": "95134"
  },
  "IEP": {
    "city": "Sunny Isles Beach",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Conglomerates",
    "long_name": "Icahn Enterprises L.P.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "Icahn Enterprises L.P. - Deposi",
    "state": "FL",
    "summary": "Icahn Enterprises L.P., through its subsidiaries, operates in investment, energy, automotive, food packaging, metals, real estate, home fashion, and pharma businesses in the United States and Internationally. The company's Investment segment invests its proprietary capital through various private investment funds. Its Energy segment refines and markets transportation fuels; and produces and markets nitrogen fertilizers in the form of urea ammonium nitrate and ammonia. The company's Automotive segment is involved in the retail and wholesale distribution of automotive parts; and offers automotive repair and maintenance services. This segment also purchases and leases vehicles. Its Food Packaging segment produces and sells cellulosic, fibrous, and plastic casings that are used for preparing processed meat products. The company's Metals segment collects, processes, and sells ferrous and non-ferrous metals, as well as processes and distributes steel pipe and plate products. Its Real Estate segment is involved in the rental of retail, office, and industrial properties; construction and sale of single-family and multi-family homes, lots in subdivisions and planned communities, and raw land for residential development; and golf and club operations. The company's Home Fashion segment manufactures, sources, markets, distributes, and sells home fashion consumer products. Its Pharma segment offers pharmaceutical products and services. Icahn Enterprises L.P. was incorporated in 1987 and is headquartered in Sunny Isles Beach, Florida.",
    "website": "http://www.ielp.com",
    "zipcode": "33160"
  },
  "IGC": {
    "city": "Potomac",
    "country": "United States",
    "currency": "USD",
    "exchange": "ASE",
    "industry": "Conglomerates",
    "long_name": "India Globalization Capital, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "India Globalization Capital Inc",
    "state": "MD",
    "summary": "India Globalization Capital, Inc. purchases and resells physical infrastructure commodities. The company operates through two segments, Infrastructure Business, and Life Sciences. It buys and sells infrastructure commodities, such as steel, wooden doors, marble, and tiles; rents heavy construction equipment, including motor grader, transit mixers and rollers; and undertakes highway construction contracts. The company also develops cannabinoid-based products and therapies, such as Hyalolex for the treatment of patients from anxiety, agitation, dementia, depression, and sleep disorder diseases; and Serosapse for the treatment of Parkinson's disease. In addition, it offers offer extraction, distillation, tolling, and white labeling services under the Holi Hemp brand; and hemp crude extracts, hemp isolates, and hemp distillates. The company operates in the United States, India, and Hong Kong. India Globalization Capital, Inc. was founded in 2005 and is based in Potomac, Maryland.",
    "website": "http://www.igcinc.us",
    "zipcode": "20854"
  },
  "IGS1.F": {
    "city": "Potomac",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Conglomerates",
    "long_name": "India Globalization Capital, Inc.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "INDIA GLOBAL.CAP. DL -,01",
    "state": "MD",
    "summary": "India Globalization Capital, Inc. purchases and resells physical infrastructure commodities. The company operates through two segments, Infrastructure Business, and Life Sciences. It buys and sells infrastructure commodities, such as steel, wooden doors, marble, and tiles; rents heavy construction equipment, including motor grader, transit mixers and rollers; and undertakes highway construction contracts. The company also develops cannabinoid-based products and therapies, such as Hyalolex for the treatment of patients from anxiety, agitation, dementia, depression, and sleep disorder diseases; and Serosapse for the treatment of Parkinson's disease. In addition, it offers offer extraction, distillation, tolling, and white labeling services under the Holi Hemp brand; and hemp crude extracts, hemp isolates, and hemp distillates. The company operates in the United States, India, and Hong Kong. India Globalization Capital, Inc. was founded in 2005 and is based in Potomac, Maryland.",
    "website": "http://www.igcinc.us",
    "zipcode": "20854"
  },
  "IRNS": {
    "city": "San Francisco",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Ironstone Group, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "IRONSTONE GROUP INC",
    "state": "CA",
    "summary": "Ironstone Group, Inc. does not have significant operations. It seeks appropriate business combination opportunities. The company was incorporated in 1972 and is based in San Francisco, California.",
    "website": "http://www.ironstonegroupinc.com",
    "zipcode": "94133"
  },
  "IVST": {
    "city": "Chesterland",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Innovest Global, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "INNOVEST GLOBAL INC",
    "state": "OH",
    "summary": "Innovest Global, Inc. engages in the commercial and industrial, energy, and biotechnology and health services sectors. It designs, engineers, tests, and manufactures curtain wall systems; supplies personal protection equipment, apparel, and safety supplies; offers inbound and outbound call services; negotiates and purchases various exterior building products. The company also provides energy services to reduce businesses overall energy costs; and LED lighting products, as well as acts as independent energy broker. In addition, it develops immunotherapeutic for treating patients with glioblastoma multiforme. The company was formerly known as Aurum Resource and Asset Management, Inc. and changed its name to Innovest Global, Inc. in January 2017. Innovest Global, Inc. was incorporated in 1999 and is based in Chesterland, Ohio.",
    "website": "http://www.innovestglobal.com",
    "zipcode": "44026"
  },
  "KGHI": {
    "city": "Birmingham",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Kaiser Group Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "KAISER GROUP HOLDINGS INC",
    "state": "AL",
    "summary": "Kaiser Group Holdings, Inc., through its subsidiary, Kaiser Aircraft Industries, Inc., provides aircraft maintenance and modification services for government, military, and commercial customers. It also manufactures and assemblies parts and kits. The company was founded in 1969 and is headquartered in Birmingham, Alabama.",
    "website": null,
    "zipcode": "35212"
  },
  "LIDM": {
    "city": "Ventura",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Limco Del Mar, Ltd.",
    "market": "us_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "LIMCO DEL MAR LTD",
    "state": "CA",
    "summary": "Limco Del Mar, Ltd. produces fruits and related agricultural products. The company is based in Ventura, California.",
    "website": null,
    "zipcode": "93003"
  },
  "LPTC": {
    "city": "Fort Lauderdale",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Le@p Technology, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "LEAP TECHNOLOGY INC",
    "state": "FL",
    "summary": "Le@P Technology, Inc. does not have significant operations. The company plans to pursue acquisition, joint venture, and investment opportunities primarily in the areas of health care technology, and products and services, as well as life sciences. Previously, it was involved in leasing a real property. Le@P Technology, Inc. was founded in 1997 and is based in Fort Lauderdale, Florida.",
    "website": "http://www.leaptec.com",
    "zipcode": "33334"
  },
  "LWCTF": {
    "city": "Houston",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "LCTI Low Carbon Technologies International Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "LCTI LOW CARBON TECHNOLOGIES IN",
    "state": "TX",
    "summary": "LCTI Low Carbon Technologies International Inc., a technology company, focuses on securing, licensing, and deploying green technologies. The company has technologies in various stages of development in the cleantech sector. LCTI Low Carbon Technologies International Inc. was formerly known as Sustainable Energy Properties Inc. and changed its name to LCTI Low Carbon Technologies International Inc. in January 2012. The company was incorporated in 2009 and is based in Houston, Texas.",
    "website": "http://www.lctiinc.com",
    "zipcode": "77056"
  },
  "MATW": {
    "city": "Pittsburgh",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Conglomerates",
    "long_name": "Matthews International Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Matthews International Corporat",
    "state": "PA",
    "summary": "Matthews International Corporation provides brand solutions, memorialization products, and industrial technologies worldwide. The company's SGK Brand Solutions segment offers brand management and pre-media services, printing plates and cylinders, engineered products, imaging services, digital asset management, merchandising display systems, and marketing and design services primarily for the consumer goods and retail industries. Its Memorialization segment manufactures and markets a range of memorialization products for use in cemeteries, funeral homes, and crematories. This segment offers cast bronze memorials, flush bronze and granite memorials, upright granite memorials and monuments, cremation memorialization products, granite benches, flower vases, crypt plates and letters, cremation urns, niche units, cemetery features and statues, caskets, community and family mausoleums, bronze plaques, letters, emblems, vases, lights, and photo ceramics, as well as architectural products to identify or commemorate people, places, events, and accomplishments. The company's Industrial Technologies segment designs, manufactures, and distributes marking and coding equipment and consumables, industrial automation products, warehouse automation systems, and order fulfillment systems for identifying, tracking, picking, and conveying consumer and industrial products. This segment serves manufacturers, suppliers, and distributors of durable goods and building products; consumer goods manufacturers; and pharmaceutical producers. Matthews International Corporation was founded in 1850 and is headquartered in Pittsburgh, Pennsylvania.",
    "website": "http://www.matw.com",
    "zipcode": "15212-5851"
  },
  "MLCG": {
    "city": "Fountain Hills",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "ML Capital Group, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ML CAPITAL GROUP INC",
    "state": "AZ",
    "summary": "ML Capital Group, Inc. produces products and provides services that support the medical marijuana industry. It is producing and marketing its products and services under the Superstar Products brand name, including vapor pens, mobile applications, and books. The company offers SUPERSTAR MMJ DISPENSARIES APP, a smartphone application that provides location based on services and detailed information on medical marijuana dispensaries; SUPERSTAR VAPOR PEN, an vapor smokeless devise, which enables consumers to consume tobacco, wax, or liquid form in clean and safer manner; and SUPERSTAR MMJ RECIPE BOOK, which enables consumers to create various meals, drinks, and sweets favorites with recipe book. ML Capital Group, Inc. was founded in 2009 and is based in Fountain Hills, Arizona.",
    "website": "http://mlcapitalgroupinc.com",
    "zipcode": "85268"
  },
  "MVNT": {
    "city": "Houston",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Movement Industries Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "MOVEMENT INDS CORP",
    "state": "TX",
    "summary": "Movement Industries Corporation, through its subsidiaries, provides computer numerically controlled (CNC) machining and fabrication services to energy organizations. It also offers valves for the oil and gas industry. The company was formerly known as Visual Healthcare Corp. and changed its name to Movement Industries Corporation in August 2019. The company is based in Houston, Texas. Movement Industries Corporation is a subsidiary of LTN Capital Ventures, LLC.",
    "website": null,
    "zipcode": "77040"
  },
  "MVPT": {
    "city": "Fresno",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "MVP Holdings Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "MVP HOLDINGS INC",
    "state": "CA",
    "summary": "MVP Holdings Inc. engages in the real estate, consumer goods, consumer services, and web-based service businesses. It is also involved in the health and benefits, financial services, manufacturing, hospitality, technology, and logistics businesses. The company is based in Fresno, California.",
    "website": "http://mvpholdingsinc.com",
    "zipcode": "93711"
  },
  "MW1A.F": {
    "city": "Pittsburgh",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Conglomerates",
    "long_name": "Matthews International Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "MATTHEWS INTL CORP.A DL 1",
    "state": "PA",
    "summary": "Matthews International Corporation provides brand solutions, memorialization products, and industrial technologies worldwide. The company's SGK Brand Solutions segment offers brand management and pre-media services, printing plates and cylinders, engineered products, imaging services, digital asset management, merchandising display systems, and marketing and design services primarily for the consumer goods and retail industries. Its Memorialization segment manufactures and markets a range of memorialization products for use in cemeteries, funeral homes, and crematories. This segment offers cast bronze memorials, flush bronze and granite memorials, upright granite memorials and monuments, cremation memorialization products, granite benches, flower vases, crypt plates and letters, cremation urns, niche units, cemetery features and statues, caskets, community and family mausoleums, bronze plaques, letters, emblems, vases, lights, and photo ceramics, as well as architectural products to identify or commemorate people, places, events, and accomplishments. The company's Industrial Technologies segment designs, manufactures, and distributes marking and coding equipment and consumables, industrial automation products, warehouse automation systems, and order fulfillment systems for identifying, tracking, picking, and conveying consumer and industrial products. This segment serves manufacturers, suppliers, and distributors of durable goods and building products; consumer goods manufacturers; and pharmaceutical producers. Matthews International Corporation was founded in 1850 and is headquartered in Pittsburgh, Pennsylvania.",
    "website": "http://www.matw.com",
    "zipcode": "15212-5851"
  },
  "NNBR": {
    "city": "Charlotte",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Conglomerates",
    "long_name": "NN, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "NN, Inc.",
    "state": "NC",
    "summary": "NN, Inc., a diversified industrial company, designs, manufactures, and sells high-precision components and assemblies primarily for the electrical, automotive, general industrial, aerospace and defense, and medical markets. It operates through Mobile Solutions and Power Solutions segments. The Mobile Solutions segment manufactures and sells system critical components for fuel systems, engines and transmissions, power steering systems, and electromechanical motors for general industrial and automotive end markets. The Power Solutions segment designs, manufactures, and sells a range of high-precision metal and plastic components, assemblies, and finished devices used in applications ranging from power control to flight control and for military devices. Its products include electrical contacts, connectors, contact assemblies, and precision stampings for the electrical end market; and high precision products for the aerospace and defense end markets. This segment also produces various tools and instruments for the orthopaedics and medical/surgical end markets. The company sells its products worldwide primarily to manufacturers directly. NN, Inc. was founded in 1980 and is headquartered in Charlotte, North Carolina.",
    "website": "http://www.nninc.com",
    "zipcode": "28277"
  },
  "NSRS": {
    "city": "Riverview",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "North Springs Resources Corp",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "NORTH SPRINGS RESOURCES CORP",
    "state": "FL",
    "summary": "North Springs Resources Corp. focuses on the evaluation, acquisition, exploration, and development of mineral resource properties. It also focuses on the acquisition and development of various products and services in the pharmaceutical and medical technology industries. The company was formerly known as Aurum Resources Corp. and changed its name to North Springs Resources Corp. in June 2011. North Springs Resources Corp. was founded in 2009 and is based in Riverview, Florida.",
    "website": "http://www.northspringsresourcescorp.com",
    "zipcode": "33569"
  },
  "OBC.F": {
    "city": "Fort Lauderdale",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Conglomerates",
    "long_name": "Ocean Bio-Chem, Inc.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "OCEAN BIO-CHEM INC.DL-,01",
    "state": "FL",
    "summary": "Ocean Bio-Chem, Inc. manufactures, markets, and distributes appearance, performance, and maintenance products for the marine, automotive, power sports, recreational vehicle, home care, and outdoor power equipment markets in the United States and Canada. The company offers marine products, including polishes, cleaners, protectants, waxes, enzyme fuel treatments, private label products, motor and teak oils, boat washes, vinyl and teak cleaners, bilge and hull cleaners, silicone and polyurethane sealants, polysulfide sealants, gasket materials, lubricants, antifouling additives, and anti-freeze coolants; and brushes, brush handles, tie-downs, and other related accessories. It also manufactures automotive products, such as fuel treatments for gas and diesel engines, motor oils, greases, and related items; anti-freeze and windshield washes; and automotive polishes, cleaners, and other items. In addition, the company offers fuel treatment and other specialty products to the recreational vehicle market; solutions to various problems associated with E-10 fuel; and other specialty recreational vehicle/power sports products, including cleaners, polishes, detergents, fabric cleaners and protectors, silicone sealants, waterproofers, gasket materials, degreasers, vinyl cleaners and protectors, toilet treatment fluids, and anti-freeze/coolants. Further, it provides solutions to rectify operating engine problems in commercial lawn, and other home and garden power equipment; deodorizers, disinfectants, and sanitizers, as well as mildew odor control bags and boat odor sanitizers; blends and packages chemical formulations; and manufactures PVC and HDPE blow molded bottles. The company sells its products under the Star Tron, Performacide, and Star brite brands through retailers and online retailers, as well as to distributors. Ocean Bio-Chem, Inc. was founded in 1973 and is headquartered in Fort Lauderdale, Florida.",
    "website": "http://www.oceanbiochem.com",
    "zipcode": "33314"
  },
  "OBCI": {
    "city": "Fort Lauderdale",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Conglomerates",
    "long_name": "Ocean Bio-Chem, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "Ocean Bio-Chem, Inc.",
    "state": "FL",
    "summary": "Ocean Bio-Chem, Inc. manufactures, markets, and distributes appearance, performance, and maintenance products for the marine, automotive, power sports, recreational vehicle, home care, and outdoor power equipment markets in the United States and Canada. The company offers marine products, including polishes, cleaners, protectants, waxes, enzyme fuel treatments, private label products, motor and teak oils, boat washes, vinyl and teak cleaners, bilge and hull cleaners, silicone and polyurethane sealants, polysulfide sealants, gasket materials, lubricants, antifouling additives, and anti-freeze coolants; and brushes, brush handles, tie-downs, and other related accessories. It also manufactures automotive products, such as fuel treatments for gas and diesel engines, motor oils, greases, and related items; anti-freeze and windshield washes; and automotive polishes, cleaners, and other items. In addition, the company offers fuel treatment and other specialty products to the recreational vehicle market; solutions to various problems associated with E-10 fuel; and other specialty recreational vehicle/power sports products, including cleaners, polishes, detergents, fabric cleaners and protectors, silicone sealants, waterproofers, gasket materials, degreasers, vinyl cleaners and protectors, toilet treatment fluids, and anti-freeze/coolants. Further, it provides solutions to rectify operating engine problems in commercial lawn, and other home and garden power equipment; deodorizers, disinfectants, and sanitizers, as well as mildew odor control bags and boat odor sanitizers; blends and packages chemical formulations; and manufactures PVC and HDPE blow molded bottles. The company sells its products under the Star Tron, Performacide, and Star brite brands through retailers and online retailers, as well as to distributors. Ocean Bio-Chem, Inc. was founded in 1973 and is headquartered in Fort Lauderdale, Florida.",
    "website": "http://www.oceanbiochem.com",
    "zipcode": "33314"
  },
  "PRLX": {
    "city": "Santa Monica",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Parallax Health Sciences, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Conglomerates",
    "short_name": "PARALLAX HEALTH SCIENCES INC",
    "state": "CA",
    "summary": "Parallax Health Sciences, Inc. builds and expands an integrated digital healthcare network with products and services that provide remote communication, diagnosis, treatment, and monitoring of patients. The company offers remote healthcare products, including patent pending software and mobile apps, and other services, as well as electronic kits and devices from third-party licensed platforms that are designated towards a patient's primary health concern, such as diabetes, blood pressure, cardiovascular, general monitoring, etc.; and audio and video options that interface with the patient's healthcare providers. It also provides prescription medication dosage monitoring services; and behavioral health products comprising REBOOT, a proprietary behavioral health technology for an individual or an organization to transform the cost of treating and managing chronic illnesses that include pulmonary-COPD-asthma, diabetes, and cardiovascular diseases by effecting the modification of behavior in patients being treated for these chronic diseases. In addition, the company offers diagnostics products, which comprise Target System, a proprietary POC diagnostic immunoassay testing platform; and test cartridges for the areas of infectious diseases, cardiac markers, drugs of abuse, and various other medical conditions, as well as VT-1000 desktop analyzers, target antigen detection systems, and other products. Further, it provides SPARKS Mobile, a target system hand-held analyzer; COMPASS for behavioral modification; Fotodigm platform for remote patient monitoring, telehealth, and POC diagnostic testing services; and Intrinsic Code technology for actionable insights to behavior modification. The company was formerly known as Endeavor Power Corporation and changed its name to Parallax Health Sciences, Inc. in January 2014. Parallax Health Sciences, Inc. was founded in 2005 and is headquartered in Santa Monica, California.",
    "website": "http://www.parallaxhealthsciences.com",
    "zipcode": "90401"
  },
  "PRTT": {
    "city": "Las Vegas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Protect Pharmaceutical Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "PROTECT PHARMACEUTICALS CORPORA",
    "state": "NV",
    "summary": "Protect Pharmaceutical Corporation primarily focuses on crop farming and agricultural businesses. It acquires the Can Noguera property located in Selva Girona region in Spain. Its property consists of 60 hectares of arable land, 390 hectares of forests, 6 mineral and freshwater wells, and 3000 square meters of built properties. The company was formerly known as Pro-Tect, Inc. and changed its name to Protect Pharmaceutical Corporation in March 2010. Protect Pharmaceutical Corporation was founded in 1987 and is based in Las Vegas, Nevada.",
    "website": "http://agropharmacy.com",
    "zipcode": "89115"
  },
  "PTPF": {
    "city": "Carson City",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "All Marketing Solutions, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Conglomerates",
    "short_name": "ALL MARKETING SOLUTIONS INC",
    "state": "NV",
    "summary": "All Marketing Solutions, Inc. provides patent consulting and technology transfer services. It focuses on assisting small business and entrepreneurs that have developed patentable novel products or services but does not have the financial resources to fund their own patent application. The company was formerly known as Patents Professional, Inc. All Marketing Solutions, Inc. was founded in 2008 and is based in Carson City, Nevada.",
    "website": null,
    "zipcode": "89703"
  },
  "RAGL": {
    "city": "Dallas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "RA Global Services, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "RA GLOBAL SERVICES INC",
    "state": "TX",
    "summary": "RA Global Services, Inc. provides oilfield services to the oil and gas industry. It offers logistics/project freight management, supply, and procurement services; and fabrication, oilfield inspections, and testing and services. The company also offers catering and facilities management services. It operates in the United States, Canada, West and Central Africa, the Middle East, Central Asia, and Russia. The company was formerly known as RealAmerica Co. and changed its name to RA Global Services, Inc. in March 2007. RA Global Services, Inc. is headquartered in Dallas, Texas with an additional office in London, United Kingdom.",
    "website": null,
    "zipcode": "75205"
  },
  "RIGG": {
    "city": "Oceanside",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Richland Resources International Group Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "RICHLAND RES INTL GROUP INC",
    "state": "NY",
    "summary": "Richland Resources International Group Inc., a development stage company, does not have significant operations. It intends effect a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more businesses. The company was formerly known as Nevtah Capital Management Corporation and changed its name to Richland Resources International Group Inc. in July 2020. Richland Resources International Group Inc. was founded in 1986 and is based in Oceanside, New York.",
    "website": null,
    "zipcode": "11572"
  },
  "RJDG": {
    "city": "Tulsa",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "RJD Green, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "RJD GREEN INC",
    "state": "OK",
    "summary": "RJD Green, Inc., a development stage company, focuses on acquiring and managing assets and companies in green environmental, energy, and specialty contracting services sectors. The company was formerly known as Silex Holdings, Inc. and changed its name to RJD Green, Inc. in October 2014. RJD Green, Inc. was founded in 2009 and is based in Tulsa, Oklahoma.",
    "website": "http://www.rjdgreen.com",
    "zipcode": "74135"
  },
  "S0V.F": {
    "city": "Merriam",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Conglomerates",
    "long_name": "Seaboard Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "SEABOARD CORP (DEL.) DL 1",
    "state": "KS",
    "summary": "Seaboard Corporation operates as an agribusiness and transportation company worldwide. It operates through six segments: Pork, Commodity Trading and Milling (CT&M), Marine, Sugar and Alcohol, Power, and Turkey. The Pork segment produces and sells fresh and frozen pork products to further processors, foodservice operators, grocery stores, and distributors; hogs; and biodiesel. The CT&M segment sources, transports, and markets wheat, corn, soybeans, soybean meal, and other commodities; and produces wheat flour, maize meal, manufactured feed, and oilseed crush commodities. The Marine segment provides cargo shipping services in the United States, as well as in 26 countries in the Caribbean, and Central and South America; dry, refrigerated, and specialized containers, as well as other related equipment; and operates a terminal and an off-port warehouse for cargo consolidation and temporary storage. This segment operates through a fleet of 21 chartered and 3 owned vessels. The Sugar and Alcohol segment produces and sells sugar and alcohol; and generates and sells energy through its 51-megawatt cogeneration power plant that is fueled by sugarcane by-products, natural gas, and other biomass. The Power segment operates as an independent power producer that generates electricity for the power grid in the Dominican Republic. The Turkey segment produces and processes organic turkey products to retail stores, foodservice outlets, and industrial entities, as well as exports products to Mexico and internationally. The company also processes and sells jalapeño peppers. Seaboard Corporation was founded in 1918 and is headquartered in Merriam, Kansas.",
    "website": "http://www.seaboardcorp.com",
    "zipcode": "66202"
  },
  "SBDG": {
    "city": "Saint Cloud",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Small Business Development Group, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SMALL BUSINESS DEVELOPMENT GROU",
    "state": "FL",
    "summary": "Small Business Development Group, Inc., a business solutions firm, provides financial advisory services. It offers advisory services related to merchant banking for small and mid-cap, private, or public companies; crisis management and turnaround consulting; buy-side and sell-side transactions; mergers and acquisitions; and formation of business development companies. The company is based in Saint Cloud, Florida.",
    "website": "http://www.rysgp.com/sbdg",
    "zipcode": "34769"
  },
  "SBOX": {
    "city": "Oceanside",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "QuantumKore Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SUPERBOX INC",
    "state": "NY",
    "summary": "QuantumKore Inc. provides technology solutions related to the waste conversion process and energy sector. It engages in the research and development of technology solutions related to desulphurization of fuels, nano emulsions, and waste to energy. The company was formerly known as SuperBox Inc. and changed its name to QuantumKore Inc. in March 2021. QuantumKore Inc. was incorporated in 1999 and is based in Oceanside, New York.",
    "website": "http://www.quantumkore.com",
    "zipcode": "11572"
  },
  "SEB": {
    "city": "Merriam",
    "country": "United States",
    "currency": "USD",
    "exchange": "ASE",
    "industry": "Conglomerates",
    "long_name": "Seaboard Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "Seaboard Corporation",
    "state": "KS",
    "summary": "Seaboard Corporation operates as an agribusiness and transportation company worldwide. It operates through six segments: Pork, Commodity Trading and Milling (CT&M), Marine, Sugar and Alcohol, Power, and Turkey. The Pork segment produces and sells fresh and frozen pork products to further processors, foodservice operators, grocery stores, and distributors; hogs; and biodiesel. The CT&M segment sources, transports, and markets wheat, corn, soybeans, soybean meal, and other commodities; and produces wheat flour, maize meal, manufactured feed, and oilseed crush commodities. The Marine segment provides cargo shipping services in the United States, as well as in 26 countries in the Caribbean, and Central and South America; dry, refrigerated, and specialized containers, as well as other related equipment; and operates a terminal and an off-port warehouse for cargo consolidation and temporary storage. This segment operates through a fleet of 21 chartered and 3 owned vessels. The Sugar and Alcohol segment produces and sells sugar and alcohol; and generates and sells energy through its 51-megawatt cogeneration power plant that is fueled by sugarcane by-products, natural gas, and other biomass. The Power segment operates as an independent power producer that generates electricity for the power grid in the Dominican Republic. The Turkey segment produces and processes organic turkey products to retail stores, foodservice outlets, and industrial entities, as well as exports products to Mexico and internationally. The company also processes and sells jalapeño peppers. Seaboard Corporation was founded in 1918 and is headquartered in Merriam, Kansas.",
    "website": "http://www.seaboardcorp.com",
    "zipcode": "66202"
  },
  "SIGN": {
    "city": "Palm Beach",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Signet International Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SIGNET INTERNATIONAL HOLDINGS I",
    "state": "FL",
    "summary": "Signet International Holdings, Inc., a development stage company, focuses on developing advanced technologies, energy solutions, and medical devices. It focuses on development of bioscience and sport medicines, including Sterilal self-sanitizing devices, PASS smart denture mouth guards, handheld heart attack sensors, and melanoma detection systems. The company also offers InCharge magnetic-based battery device that provides energy; and develops applications for de-icing application of graphene for use in the airline industry, as well as technology for arc melted glass piles for structural foundations. Signet International Holdings, Inc., was founded in 2003 and is based in Palm Beach, Florida.",
    "website": "http://www.signetinternationalholdings.com",
    "zipcode": "33480"
  },
  "SPGX": {
    "city": "Naples",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Sustainable Projects Group Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SUSTAINABLE PROJECTS GROUP INC",
    "state": "FL",
    "summary": "Sustainable Projects Group Inc., a business development company, engages in project development and holdings through value based investments and collaborative partnerships with companies in various sectors. The company, through its 55% joint venture interest in Hero Wellness Systems Inc., engages in importing, marketing, distributing, and selling luxury massage therapeutic chairs. The company was formerly known as Sustainable Petroleum Group Inc. and changed its name to Sustainable Projects Group Inc. in October 2017. Sustainable Projects Group Inc. was founded in 2009 and is headquartered in Naples, Florida.",
    "website": "http://www.spgroupe.com",
    "zipcode": "34102"
  },
  "SPLP": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Conglomerates",
    "long_name": "Steel Partners Holdings L.P.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Steel Partners Holdings LP LTD ",
    "state": "NY",
    "summary": "Steel Partners Holdings L.P., through its subsidiaries, engages in industrial products, energy, defense, supply chain management, logistics, direct marketing, banking, and youth sports businesses worldwide. It operates through Diversified Industrial, Energy, and Financial Services segments. The company fabricates precious metals and alloys into brazing alloys; manufactures and sells seamless stainless steel tubing coils; fasteners, adhesives, and fastening systems for the commercial low slope roofing industry, as well as specialty fasteners for the building products industry; and woven substrates of fiberglass, quartz, carbon, and aramid materials for specialty applications. It also designs, manufactures, and markets power electronics and protection, motion control, power quality electromagnetic equipment, custom ball-screws, and gears and gearboxes used in medical, commercial and military aerospace, computer, datacom, industrial, specialty LED lighting, test and measurement, and telecom applications. In addition, the company provides meat-room blade products, repair services, and distributed products for the meat and deli departments of supermarkets, restaurants, and meat and fish processing plants, as well as for electrical saws and cutting equipment distributors; cutting blades for bakeries; and wood cutting blade products for the pallet manufacturing, pallet recycler, and portable saw mill industries. Further, it manufactures and distributes coated, laminated and metallized films for imaging, aerospace, insulation and solar photo-voltaic markets; originates and funds consumer and small business loans; issues credit cards; takes deposits; participates in syndicated commercial and industrial, and asset based credit facilities and securitizations; and offers drilling and production services to the oil and gas industry. Steel Partners Holdings GP Inc. serves as the general partner of the company. The company was founded in 1990 and is based in New York, New York.",
    "website": "http://www.steelpartners.com",
    "zipcode": "10022"
  },
  "SPLP-PA": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Conglomerates",
    "long_name": "Steel Partners Holdings L.P.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Steel Partners Holdings LP 6.0%",
    "state": "NY",
    "summary": "Steel Partners Holdings L.P., through its subsidiaries, engages in industrial products, energy, defense, supply chain management, logistics, direct marketing, banking, and youth sports businesses worldwide. It operates through Diversified Industrial, Energy, and Financial Services segments. The company fabricates precious metals and alloys into brazing alloys; manufactures and sells seamless stainless steel tubing coils; fasteners, adhesives, and fastening systems for the commercial low slope roofing industry, as well as specialty fasteners for the building products industry; and woven substrates of fiberglass, quartz, carbon, and aramid materials for specialty applications. It also designs, manufactures, and markets power electronics and protection, motion control, power quality electromagnetic equipment, custom ball-screws, and gears and gearboxes used in medical, commercial and military aerospace, computer, datacom, industrial, specialty LED lighting, test and measurement, and telecom applications. In addition, the company provides meat-room blade products, repair services, and distributed products for the meat and deli departments of supermarkets, restaurants, and meat and fish processing plants, as well as for electrical saws and cutting equipment distributors; cutting blades for bakeries; and wood cutting blade products for the pallet manufacturing, pallet recycler, and portable saw mill industries. Further, it manufactures and distributes coated, laminated and metallized films for imaging, aerospace, insulation and solar photo-voltaic markets; originates and funds consumer and small business loans; issues credit cards; takes deposits; participates in syndicated commercial and industrial, and asset based credit facilities and securitizations; and offers drilling and production services to the oil and gas industry. Steel Partners Holdings GP Inc. serves as the general partner of the company. The company was founded in 1990 and is based in New York, New York.",
    "website": "http://www.steelpartners.com",
    "zipcode": "10022"
  },
  "STCN": {
    "city": "Waltham",
    "country": "United States",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Conglomerates",
    "long_name": "Steel Connect, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "Steel Connect, Inc. Common Stoc",
    "state": "MA",
    "summary": "Steel Connect, Inc., together with its subsidiaries, provides direct marketing and supply chain services in the United States, China, the Netherlands, and internationally. It offers data-driven marketing solutions, including strategy, data and analytics, response analysis, creative services, lithographic and digital printing, envelope printing and converting, component manufacturing, promotional cards, data processing and hygiene, content and asset management, personalization, lettershop and bindery, and postal optimization for paper-based direct marketing and omnichannel marketing campaigns, as well as provides business continuity and disaster recovery services. The company also offers product configuration and packaging, kitting, and assembly of components and parts into finished goods; and value-added processes, such as product testing, radio frequency identification tagging, product or service activation, language settings, personalization and engraving, multi-channel packaging, and packaging design services. In addition, it provides fulfillment services comprising order management, pick, pack and ship, retail compliance, and demand planning services; and reverse logistics services that simplifies the returns process for retailers and manufacturers, as well as operates a cloud-based e-commerce platform. Steel Connect, Inc. offers its supply chain services to customers in the consumer electronics, communications, computing, medical devices, software, storage, and retail markets. The company was formerly known as ModusLink Global Solutions, Inc. and changed its name to Steel Connect, Inc. in February 2018. Steel Connect, Inc. was incorporated in 1986 and is headquartered in Waltham, Massachusetts.",
    "website": "http://www.steelconnectinc.com",
    "zipcode": "02451"
  },
  "SYVN": {
    "city": "Park City",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Sycamore Ventures, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SYCAMORE VENTURES INC",
    "state": "UT",
    "summary": "Sycamore Ventures, Inc. engages in the manufacture and supply of food based meals and snacks, and non-toxic personal care products in the United States. The company provides Appulse, a snack and meal replacement; and food energy bars. Its personal care products include shampoos and lip balms; Congest Ease, a decongestant that eliminate congestion in the respiratory system; Breathe Easy products to moisturize and sooth irritated nasal passages; and Divine skin care creams. The company also offers Tooth Fairy, a cleanser, deodorizer, and breath freshener. In addition, it publishes farmacist desk reference books; and educational posters. The company was founded in 2006 and is based in Park City, Utah.",
    "website": null,
    "zipcode": "84098"
  },
  "TALC": {
    "city": "Las Vegas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Tal-Cap, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "TAL CAP INC",
    "state": "NV",
    "summary": "Tal Cap, Inc. does not have significant operations. It focuses on acquiring a viable business. The company is based in Las Vegas, Nevada.",
    "website": null,
    "zipcode": "89118"
  },
  "TRC": {
    "city": "Lebec",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Conglomerates",
    "long_name": "Tejon Ranch Co.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Tejon Ranch Co",
    "state": "CA",
    "summary": "Tejon Ranch Co. operates as a diversified real estate development and agribusiness company. It operates through five segments: Commercial/Industrial Real Estate Development, Resort/Residential Real Estate Development, Mineral Resources, Farming, and Ranch Operations. The Commercial/Industrial Real Estate Development segment engages in the planning and permitting of land for development; construction of infrastructure projects, pre-leased buildings, and buildings to be leased or sold; and sale of land to third parties for their own development. It is also involved in the activities related to communications leases, and landscape maintenance. This segment leases land to two auto service stations with convenience stores, 13 fast-food operations, a full-service restaurants, a motel, an antique shop, and a post office; various microwave repeater locations, radio and cellular transmitter sites, and fiber optic cable routes; and 32 acres of land for an electric power plant. The Resort/Residential Real Estate Development segment engages in land entitlement, planning, pre-construction engineering, stewardship, and conservation activities. The Mineral Resources segment includes oil and gas royalties, rock and aggregate royalties, and royalties from a cement operation leased to National Cement Company of California, Inc.; and the management of water assets and infrastructure projects. The Farming segment farms permanent crops, such as wine grapes in 835 acres, almonds in 2,281 acres, and pistachios in 1,053 acres. It also manages the farming of alfalfa and forage mix on 626 acres in the Antelope Valley; and leases 720 acres of land for growing vegetables, as well as almonds. The Ranch Operations segment provides game management and ancillary land services comprising grazing leases and filming, as well as various guided hunts. The company was founded in 1843 and is headquartered in Lebec, California.",
    "website": "http://tejonranch.com",
    "zipcode": "93243"
  },
  "TRRE": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Terra Energy Resources, Ltd.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "TERRA ENERGY & RESOURCE TECHNOL",
    "state": "NY",
    "summary": "Terra Energy Resources, Ltd. engages in the process of polymer based recycling and reformation activities. The company produces and sells various kinds of oil based polymer materials to manufacturers for re-use. It serves food, maritime, auto, and construction industries. The company was formerly known as Terra Media, Ltd. and changed its name to Terra Energy Resources, Ltd. in June 2008. Terra Energy Resources, Ltd. is headquartered in New York, New York.",
    "website": null,
    "zipcode": "10001"
  },
  "TSTS": {
    "city": "Salt Lake City",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "That Marketing Solution, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Conglomerates",
    "short_name": "THAT MARKETING SOLUTION INC",
    "state": "UT",
    "summary": "That Marketing Solution, Inc., a development stage company, focuses on the development, manufacturing, advertising, sale, and marketing of nutritional products. It acquired the rights to a proprietary formula for a blend of nutritional supplements called Low-T capsules that are intended to be a natural, non-FDA regulated, and over-the-counter supplement, which addresses the primary contributing factors of decreased levels of testosterone in males over the age of 30. The company was formerly known as Vista Holding Group, Corp. and changed its name to That Marketing Solution, Inc. in September 2014. That Marketing Solution, Inc. was founded in 2012 and is based in Salt Lake City, Utah.",
    "website": "http://www.thatmarketingsolution.com",
    "zipcode": "84117"
  },
  "TTHG": {
    "city": "San Antonio",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Titanium Holdings Group, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "TITANIUM HOLDINGS GROUP INC",
    "state": "TX",
    "summary": "Titanium Holdings Group, Inc., together with its subsidiary, Cleaning Ideas Corp. manufactures and distributes sanitary maintenance supplies and paper products in the United States. It operates nine Cleaning Ideas retail stores. The company is based in San Antonio, Texas.",
    "website": "http://www.titaniumholdings.com",
    "zipcode": "78207"
  },
  "UATG": {
    "city": "Tampa",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Umbra Applied Technologies Group, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "UMBRA APPLIED TECHNOLOGIES GROU",
    "state": "FL",
    "summary": "Umbra Applied Technologies Group, Inc. operates as a green technology development, fabrication, and commercialization company. The company develops and manufactures equipment, products, and systems to global remediation projects. Its technologies include power generation, oil and sand processing, oil shale processing, inland and salt water oil spill remediation, water remediation, water desalinization and medical waste remediation, and e-waste remediation. The company was formerly known as Green Processing Technologies, Inc. and changed its name to Umbra Applied Technologies Group, Inc. in January 2014. The company is headquartered in Tampa, Florida. Umbra Applied Technologies Group, Inc. is a subsidiary of Green Processing Technologies, Inc.",
    "website": "http://www.uatgroup.com",
    "zipcode": "33607"
  },
  "UMCN": {
    "city": "Pampa",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "UMC, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "UMC INC",
    "state": "TX",
    "summary": "UMC, Inc. provides medical insurance claims coding and processing, electronic medical records storage, chargemaster review, pricing comparison, and accounts receivable management services to healthcare providers. Its customers primarily include hospitals, medical clinics, and physician practitioners in the United States. The company was formerly known as United Medicorp, Inc. and changed its name to UMC, Inc. in May 2007. UMC, Inc. was incorporated in 1989 and is based in Pampa, Texas.",
    "website": null,
    "zipcode": "79065"
  },
  "UPIN": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Universal Power Industry Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "UNIVERSAL POWER INDUSTRY CORP",
    "state": "NY",
    "summary": "Universal Power Industry Corporation engages in the development of certified offshore programmers database. Its database is used to locate and refer qualified programmers. The company also intends to offer programming services in an offshore floating vessel. The company was formerly known as Code Navy and changed its name to Universal Power Industry Corporation in April 2016. Universal Power Industry Corporation was founded in 2007 and is based in New York, New York.",
    "website": "http://www.upinholdings.com",
    "zipcode": "10018"
  },
  "USDF": {
    "city": "Pasadena",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "US-Dadi Fertilizer Industry International, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "US-DADI FERTILIZER IND INTL INC",
    "state": "CA",
    "summary": "US-DADI Fertilizer Industry International, Inc. focuses on fertilizer-related products and equipment exporting business. The company was founded in 2010 and is based in Pasadena, California.",
    "website": null,
    "zipcode": "91107"
  },
  "VBVT": {
    "city": "Orlando",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Viabuilt Ventures Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "VIABUILT VENTURES INC",
    "state": "FL",
    "summary": "Firetainment, Inc. designs and manufactures fire pit tables for home and commercial outdoor patio, deck, and backyard spaces. The company was founded in 2011 and is based in Orlando, Florida.",
    "website": "http://www.firetainment.com",
    "zipcode": "32804"
  },
  "VIVC": {
    "city": "Las Vegas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Vivic Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "VIVIC CORP",
    "state": "NV",
    "summary": "Vivic Corp. operates as a travel agency in the Dominican Republic. The company organizes individual and group tours, such as cultural, recreational, sport, business, eco tours, and other travel tours. It also engages in the construction of marinas and yachts under the brand Monte Fino; operation of Joy Wave, an online platform that offers yacht rental and leisure services; development of energy-saving yacht engines; and provision of tourism consultancy and of yacht services. The company was incorporated in 2017 and is based in Las Vegas, Nevada. Vivic Corp. is a subsidiary of Honetech Inc.",
    "website": "http://www.vivic.biz",
    "zipcode": "89119"
  },
  "VRTV": {
    "city": "Atlanta",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Conglomerates",
    "long_name": "Veritiv Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Veritiv Corporation",
    "state": "GA",
    "summary": "Veritiv Corporation operates as a business-to-business provider of value-added packaging products and services, as well as facility solutions, print, and publishing products and services in the United States, Canada, Mexico, and internationally. The Packaging segment provides custom and standard packaging solutions. The Facility Solutions segment sources and sells cleaning, break-room, and other supplies, such as towels, tissues, commercial cleaning chemicals, personal protective equipment and safety supplies, wipers, can liners, soaps and sanitizers, dispensers, sanitary maintenance supplies and equipment, hazard supplies, and shampoos and amenities. The Print segment sells and distributes commercial printing, writing, copying, digital, and specialty products; and graphics consumables and equipment. It also provides customized paper conversion services of commercial printing paper for distribution to document centers and form printers. The Publishing segment sells and distributes coated and uncoated commercial printing papers to publishers, retailers, converters, printers, and specialty businesses for use in magazines, catalogs, books, directories, gaming, couponing, retail inserts, and direct mail. This segment also provides print management, procurement, and supply chain management solutions. The company also offers logistics solutions. Veritiv Corporation offers its products under the Endurance, nordic+, Comet, Starbrite Opaque Select, TUFflex, Reliable, and Spring Grove brands, as well as other brands to customers in manufacturing, food processing and service, fulfillment and internet retail, property management, higher education, healthcare, entertainment and hospitality, commercial printing and publishing sectors. As of December 31, 2020 the Company operated approximately 125 distribution centers. Veritiv Corporation was incorporated in 2013 and is headquartered in Atlanta, Georgia.",
    "website": "http://www.veritivcorp.com",
    "zipcode": "30328"
  },
  "VRTV.MX": {
    "city": "Atlanta",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Conglomerates",
    "long_name": "Veritiv Corporation",
    "market": "mx_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "VERITIV CORP",
    "state": "GA",
    "summary": "Veritiv Corporation operates as a business-to-business provider of value-added packaging products and services, as well as facility solutions, print, and publishing products and services in the United States, Canada, Mexico, and internationally. The Packaging segment provides custom and standard packaging solutions. The Facility Solutions segment sources and sells cleaning, break-room, and other supplies, such as towels, tissues, commercial cleaning chemicals, personal protective equipment and safety supplies, wipers, can liners, soaps and sanitizers, dispensers, sanitary maintenance supplies and equipment, hazard supplies, and shampoos and amenities. The Print segment sells and distributes commercial printing, writing, copying, digital, and specialty products; and graphics consumables and equipment. It also provides customized paper conversion services of commercial printing paper for distribution to document centers and form printers. The Publishing segment sells and distributes coated and uncoated commercial printing papers to publishers, retailers, converters, printers, and specialty businesses for use in magazines, catalogs, books, directories, gaming, couponing, retail inserts, and direct mail. This segment also provides print management, procurement, and supply chain management solutions. The company also offers logistics solutions. Veritiv Corporation offers its products under the Endurance, nordic+, Comet, Starbrite Opaque Select, TUFflex, Reliable, and Spring Grove brands, as well as other brands to customers in manufacturing, food processing and service, fulfillment and internet retail, property management, higher education, healthcare, entertainment and hospitality, commercial printing and publishing sectors. As of December 31, 2020 the Company operated approximately 125 distribution centers. Veritiv Corporation was incorporated in 2013 and is headquartered in Atlanta, Georgia.",
    "website": "http://www.veritivcorp.com",
    "zipcode": "30328"
  },
  "WNRS": {
    "city": "Henderson",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Winners, Inc.",
    "market": "us_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "WINNERS INC",
    "state": "NV",
    "summary": "VegasWinners, Inc. provides sports gaming information, analysis, advice, and predictions services. The company provides analysis, and handicapping advice, and analyzes and predicts sports event winners for sports bettors. The company caters to sports fans, both major bettors and newcomers in the betting landscape. The company was incorporated in 2018 and is based in Henderson, Nevada.",
    "website": "http://vegaswinners.com",
    "zipcode": "89002"
  },
  "ZNNC": {
    "city": "Fenton",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Zann Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ZANN CORP",
    "state": "MI",
    "summary": "Zann Corp. does not have significant operations. It intends to acquire, or merge with other operating entity. Previously, the company was engaged in the marketing and sale of nutritional supplements. Zann Corp. was incorporated in 1999 and is based in Fenton, Michigan.",
    "website": "http://www.zann-pjt.com",
    "zipcode": "48430"
  }
}
