{
  "0EV.F": {
    "city": "Fort Worth",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "Elevate Credit, Inc.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "ELEVATE CREDIT INC -,0004",
    "state": "TX",
    "summary": "Elevate Credit, Inc. provides online credit solutions to non-prime consumers in the United States. It offers unsecured online installment loans, lines of credit, and credit cards. Its products include Rise, an installment loan product; Elastic, a line of credit product; and Today Card, a credit card product. The company was founded in 2014 and is headquartered in Fort Worth, Texas.",
    "website": "http://www.elevate.com",
    "zipcode": "76109"
  },
  "0S1.F": {
    "city": "Evansville",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "OneMain Holdings, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "ONEMAIN HOLDINGS  DL-,01",
    "state": "IN",
    "summary": "OneMain Holdings, Inc., a financial service holding company, engages in the consumer finance and insurance businesses. The company originates, underwrites, and services personal loans secured by automobiles, other titled collateral, or are unsecured. The company also offers credit insurance products comprising life, disability, and involuntary unemployment insurance; optional non-credit insurance; guaranteed asset protection coverage as a waiver product or insurance; and membership plans. It operates through a network of approximately 1,500 branch offices in 44 states in the United States, as well as through its Website onemainfinancial.com. The company was formerly known as Springleaf Holdings, Inc. and changed its name to OneMain Holdings, Inc. in November 2015. OneMain Holdings, Inc. was founded in 1920 and is based in Evansville, Indiana.",
    "website": "http://www.onemainfinancial.com",
    "zipcode": "47708-1013"
  },
  "0SEA.F": {
    "city": "Minneapolis",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "Sezzle Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "SEZZLE INC. CDIS/1/1",
    "state": "MN",
    "summary": "Sezzle Inc. operates as a technology-enabled payments company in United States, Canada, India, and Europe. The company provides a payments platform that facilitates payments between consumers with merchants. Its platform enables customers to make online purchases and split the payment for the purchase in four equal interest free payments over six weeks. The company offers its payment solution to online stores, as well as brick-and-mortar retailers. Sezzle Inc. was incorporated in 2016 and is headquartered in Minneapolis, Minnesota.",
    "website": "http://www.sezzle.com",
    "zipcode": "55401"
  },
  "10D.F": {
    "city": "Wilmington",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "Navient Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "NAVIENT CORP.  DL-,01",
    "state": "DE",
    "summary": "Navient Corporation provides education loan management and business processing solutions for education, healthcare, and government clients at the federal, state, and local levels in the United States. It operates through four segments: Federal Education Loans, Consumer Lending, Business Processing, and Other. The company owns Federal Family Education Loan Program loans that are insured or guaranteed by state or not-for-profit agencies; and performs servicing and asset recovery services on its own loan portfolio, and federal education loans owned by the United States Department of Education and other institutions. It also owns, originates, and acquires private education loans; and offers healthcare services that include revenue cycle outsourcing, accounts receivable management, extended business office support, consulting engagement, and public health programs, as well as business processing services to state governments, agencies, court systems, municipalities, and parking and tolling authorities. In addition, the company provides customizable solutions for its clients that include hospitals, hospital systems, medical centers, large physician groups, other healthcare providers, and departments of public health; and corporate liquidity portfolio and debt repurchase services. Navient Corporation was founded in 1973 and is headquartered in Wilmington, Delaware.",
    "website": "http://www.navient.com",
    "zipcode": "19801"
  },
  "27E.F": {
    "city": "Chicago",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "Enova International, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "ENOVA INTL INC.  DL-,01",
    "state": "IL",
    "summary": "Enova International, Inc., a technology and analytics company, provides online financial services in the United States, Brazil, Australia, and Canada. The company offers installment loans; line of credit accounts; receivables purchase agreements; income share agreements; CSO programs, including arranging loans with independent third-party lenders and assisting in the preparation of loan applications and loan documents; and bank programs, such as marketing services and loan servicing for near-prime unsecured consumer installment loan. It also provides Enova Decisions, an analytics as a service designed to automate or augment customer decisions, which include credit risk, fraud risk, identity verification, customer profitability, payments, and collection. The company markets its financing products under the CashNetUSA, NetCredit, OnDeck, Headway Capital, The Business Backer, and Simplic names. Enova International, Inc. was incorporated in 2011 and is headquartered in Chicago, Illinois.",
    "website": "http://www.enova.com",
    "zipcode": "60604"
  },
  "2D5.F": {
    "city": "Southfield",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "Credit Acceptance Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "CRED. ACC. CORP.",
    "state": "MI",
    "summary": "Credit Acceptance Corporation provides financing programs, and related products and services to independent and franchised automobile dealers in the United States. The company advances money to dealers in exchange for the right to service the underlying consumer loans; and buys the consumer loans from the dealers and keeps various amounts collected from the consumers. It is also involved in the business of reinsuring coverage under vehicle service contracts sold to consumers by dealers on vehicles financed by the company. Credit Acceptance Corporation was founded in 1972 and is headquartered in Southfield, Michigan.",
    "website": "http://www.creditacceptance.com",
    "zipcode": "48034-8339"
  },
  "2PP.DE": {
    "city": "San Jose",
    "country": "United States",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Credit Services",
    "long_name": "PayPal Holdings, Inc.",
    "market": "de_market",
    "market_cap": "Mega Cap",
    "sector": "Financial Services",
    "short_name": "PAYPAL HDGS INC.DL-,0001",
    "state": "CA",
    "summary": "PayPal Holdings, Inc. operates as a technology platform and digital payments company that enables digital and mobile payments on behalf of consumers and merchants worldwide. Its payment solutions include PayPal, PayPal Credit, Braintree, Venmo, Xoom, Hyperwallet, and iZettle products. The company's payments platform allows consumers to send and receive payments, withdraw funds to their bank accounts, and hold balances in their PayPal accounts in various currencies. It also offers gateway services that enable merchants to accept payments online with credit or debit cards, as well as digital wallets. PayPal Holdings, Inc. was founded in 1998 and is headquartered in San Jose, California.",
    "website": "http://www.paypal.com",
    "zipcode": "95131"
  },
  "2PP.F": {
    "city": "San Jose",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "PayPal Holdings, Inc.",
    "market": "dr_market",
    "market_cap": "Mega Cap",
    "sector": "Financial Services",
    "short_name": "PAYPAL HDGS INC.DL-,0001",
    "state": "CA",
    "summary": "PayPal Holdings, Inc. operates as a technology platform and digital payments company that enables digital and mobile payments on behalf of consumers and merchants worldwide. Its payment solutions include PayPal, PayPal Credit, Braintree, Venmo, Xoom, Hyperwallet, and iZettle products. The company's payments platform allows consumers to send and receive payments, withdraw funds to their bank accounts, and hold balances in their PayPal accounts in various currencies. It also offers gateway services that enable merchants to accept payments online with credit or debit cards, as well as digital wallets. PayPal Holdings, Inc. was founded in 1998 and is headquartered in San Jose, California.",
    "website": "http://www.paypal.com",
    "zipcode": "95131"
  },
  "3V64.DE": {
    "city": "San Francisco",
    "country": "United States",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Credit Services",
    "long_name": "Visa Inc.",
    "market": "de_market",
    "market_cap": "Mega Cap",
    "sector": "Financial Services",
    "short_name": "VISA INC. CL. A DL -,0001",
    "state": "CA",
    "summary": "Visa Inc. operates as a payments technology company worldwide. The company facilitates digital payments among consumers, merchants, financial institutions, businesses, strategic partners, and government entities. It operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. In addition, the company offers card products, platforms, and value-added services. It provides its services under the Visa, Visa Electron, Interlink, VPAY, and PLUS brands. The company was founded in 1958 and is headquartered in San Francisco, California.",
    "website": "http://usa.visa.com",
    "zipcode": "94128"
  },
  "8LCA.F": {
    "city": "San Francisco",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "LendingClub Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "LENDINGCLUB CORP.  DL-,01",
    "state": "CA",
    "summary": "LendingClub Corporation, operates as a bank holding company for LendingClub Bank, National Association that provides range of financial products and services through a technology-driven platform in the United States. The company provides commercial and industrial, commercial real estate, small business, and equipment loans, as well as leases equipment; and unsecured personal and auto, patient finance, and education finance loans. It also operates an online lending marketplace platform that connects borrowers and investors. The company was incorporated in 2006 and is headquartered in San Francisco, California.",
    "website": "http://www.lendingclub.com",
    "zipcode": "94105"
  },
  "9M1N.F": {
    "city": "Dallas",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "MoneyGram International, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "MONEYGRAM INTL NEW DL-,01",
    "state": "TX",
    "summary": "MoneyGram International, Inc., together with its subsidiaries, provides cross-border peer-to-peer payments and money transfer services in the United States and internationally. The company operates through two segments, Global Funds Transfer and Financial Paper Products. The Global Funds Transfer segment offers money transfer services and bill payment services through third-party agents, including retail chains, independent retailers, post offices, banks, and other financial institutions; and digital solutions, such as moneygram.com, mobile solutions, digital partners, wallets, and account deposit services. The Financial Paper Products segment provides money orders to consumers through its agents and financial institutions under the MoneyGram brand and on a private label or co-branded basis with various agents and financial institutions; and official check outsourcing services for banks and credit unions. MoneyGram International, Inc. was incorporated in 2003 and is based in Dallas, Texas.",
    "website": "http://corporate.moneygram.com",
    "zipcode": "75201"
  },
  "A1LL34.SA": {
    "city": "Columbus",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Credit Services",
    "long_name": "Alliance Data Systems Corporation",
    "market": "br_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "ALLIANCE DATDRN",
    "state": "OH",
    "summary": "Alliance Data Systems Corporation provides data-driven marketing, loyalty, and payment solutions in the United States, Canada, Europe, the Middle East, Africa, the Asia Pacific, and internationally. It operates through two segments, LoyaltyOne and Card Services. The LoyaltyOne segment offers AIR MILES reward program; short term loyalty program; and loyalty services, which include loyalty consulting, customer analytics, creative services, and mobile solutions. The Card Services segment provides receivable financing services comprising underwriting and risk management, as well as receivables funding services, including comenity card, private label and co-brand credit card programs, and installment lending; processing services, such as new account processing, bill processing, remittance processing, and customer care; marketing services; and digital offerings, including Bread digital payments platform and enhanced digital suite. It serves clients across various end-markets, including financial services, specialty retail, grocery and drugstore chains, petroleum retail, home furnishing and hardware, beauty and jewelry, hospitality and travel, and telecommunications. Alliance Data Systems Corporation was founded in 1996 and is headquartered in Columbus, Ohio.",
    "website": "http://www.alliancedata.com",
    "zipcode": "43219"
  },
  "A35.F": {
    "city": "Washington",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "Federal Agricultural Mortgage Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "FEDERAL AGRICULTURAL C",
    "state": "DC",
    "summary": "Federal Agricultural Mortgage Corporation provides a secondary market for various loans made to borrowers in the United States. It operates through four segments: Farm & Ranch, USDA (United States Department of Agriculture) Guarantees, Rural Utilities, and Institutional Credit. The Farm & Ranch segment purchases and retains eligible mortgage loans that are secured by first liens on agricultural real estate; securitizes eligible mortgage loans, and guarantees the timely payment of principal and interest on securities representing interests in or obligations secured by pools of mortgage loans; and issues long-term standby purchase commitments (LTSPC) on designated eligible mortgage loans. The USDA Guarantees segment purchases portions of certain agricultural and rural development loans guaranteed by the USDA. The Rural Utilities segment purchases and guarantees securities that are backed by loans for electric or telecommunications facilities by lenders organized as cooperatives to borrowers; and purchases eligible rural utilities loans and guarantees of securities backed by those loans, as well as LTSPCs for pools of eligible rural utilities loans. The Institutional Credit segment guarantees and purchases general obligations of lenders and other financial institutions that are secured by pools of loans eligible under the Farmer Mac's Farm & Ranch, USDA Guarantees, or Rural Utilities lines of business. Federal Agricultural Mortgage Corporation was founded in 1987 and is headquartered in Washington, District of Columbia.",
    "website": "http://www.farmermac.com",
    "zipcode": "20006"
  },
  "ADS": {
    "city": "Columbus",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Alliance Data Systems Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "Alliance Data Systems Corporati",
    "state": "OH",
    "summary": "Alliance Data Systems Corporation provides data-driven marketing, loyalty, and payment solutions in the United States, Canada, Europe, the Middle East, Africa, the Asia Pacific, and internationally. It operates through two segments, LoyaltyOne and Card Services. The LoyaltyOne segment offers AIR MILES reward program; short term loyalty program; and loyalty services, which include loyalty consulting, customer analytics, creative services, and mobile solutions. The Card Services segment provides receivable financing services comprising underwriting and risk management, as well as receivables funding services, including comenity card, private label and co-brand credit card programs, and installment lending; processing services, such as new account processing, bill processing, remittance processing, and customer care; marketing services; and digital offerings, including Bread digital payments platform and enhanced digital suite. It serves clients across various end-markets, including financial services, specialty retail, grocery and drugstore chains, petroleum retail, home furnishing and hardware, beauty and jewelry, hospitality and travel, and telecommunications. Alliance Data Systems Corporation was founded in 1996 and is headquartered in Columbus, Ohio.",
    "website": "http://www.alliancedata.com",
    "zipcode": "43219"
  },
  "AEC1.DE": {
    "city": "New York",
    "country": "United States",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Credit Services",
    "long_name": "American Express Company",
    "market": "de_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "AMER. EXPRESS  DL -,20",
    "state": "NY",
    "summary": "American Express Company, together with its subsidiaries, provides charge and credit payment card products, and travel-related services worldwide. The company operates through three segments: Global Consumer Services Group, Global Commercial Services, and Global Merchant and Network Services. Its products and services include payment and financing products; network services; accounts payable expense management products and services; and travel and lifestyle services. The company's products and services also comprise merchant acquisition and processing, servicing and settlement, point-of-sale marketing, and information products and services for merchants; and fraud prevention services, as well as the design and operation of customer loyalty programs. It sells its products and services to consumers, small businesses, mid-sized companies, and large corporations through mobile and online applications, third-party vendors and business partners, direct mail, telephone, in-house sales teams, and direct response advertising. American Express Company was founded in 1850 and is headquartered in New York, New York.",
    "website": "http://www.americanexpress.com",
    "zipcode": "10285"
  },
  "AEC1.F": {
    "city": "New York",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "American Express Company",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "AMER. EXPRESS  DL -,20",
    "state": "NY",
    "summary": "American Express Company, together with its subsidiaries, provides charge and credit payment card products, and travel-related services worldwide. The company operates through three segments: Global Consumer Services Group, Global Commercial Services, and Global Merchant and Network Services. Its products and services include payment and financing products; network services; accounts payable expense management products and services; and travel and lifestyle services. The company's products and services also comprise merchant acquisition and processing, servicing and settlement, point-of-sale marketing, and information products and services for merchants; and fraud prevention services, as well as the design and operation of customer loyalty programs. It sells its products and services to consumers, small businesses, mid-sized companies, and large corporations through mobile and online applications, third-party vendors and business partners, direct mail, telephone, in-house sales teams, and direct response advertising. American Express Company was founded in 1850 and is headquartered in New York, New York.",
    "website": "http://www.americanexpress.com",
    "zipcode": "10285"
  },
  "AGM": {
    "city": "Washington",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Federal Agricultural Mortgage Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "Federal Agricultural Mortgage C",
    "state": "DC",
    "summary": "Federal Agricultural Mortgage Corporation provides a secondary market for various loans made to borrowers in the United States. It operates through four segments: Farm & Ranch, USDA (United States Department of Agriculture) Guarantees, Rural Utilities, and Institutional Credit. The Farm & Ranch segment purchases and retains eligible mortgage loans that are secured by first liens on agricultural real estate; securitizes eligible mortgage loans, and guarantees the timely payment of principal and interest on securities representing interests in or obligations secured by pools of mortgage loans; and issues long-term standby purchase commitments (LTSPC) on designated eligible mortgage loans. The USDA Guarantees segment purchases portions of certain agricultural and rural development loans guaranteed by the USDA. The Rural Utilities segment purchases and guarantees securities that are backed by loans for electric or telecommunications facilities by lenders organized as cooperatives to borrowers; and purchases eligible rural utilities loans and guarantees of securities backed by those loans, as well as LTSPCs for pools of eligible rural utilities loans. The Institutional Credit segment guarantees and purchases general obligations of lenders and other financial institutions that are secured by pools of loans eligible under the Farmer Mac's Farm & Ranch, USDA Guarantees, or Rural Utilities lines of business. Federal Agricultural Mortgage Corporation was founded in 1987 and is headquartered in Washington, District of Columbia.",
    "website": "http://www.farmermac.com",
    "zipcode": "20006"
  },
  "AGM-A": {
    "city": "Washington",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Federal Agricultural Mortgage Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "Federal Agricultural Mortgage C",
    "state": "DC",
    "summary": "Federal Agricultural Mortgage Corporation provides a secondary market for various loans made to borrowers in the United States. It operates through four segments: Farm & Ranch, USDA (United States Department of Agriculture) Guarantees, Rural Utilities, and Institutional Credit. The Farm & Ranch segment purchases and retains eligible mortgage loans that are secured by first liens on agricultural real estate; securitizes eligible mortgage loans, and guarantees the timely payment of principal and interest on securities representing interests in or obligations secured by pools of mortgage loans; and issues long-term standby purchase commitments (LTSPC) on designated eligible mortgage loans. The USDA Guarantees segment purchases portions of certain agricultural and rural development loans guaranteed by the USDA. The Rural Utilities segment purchases and guarantees securities that are backed by loans for electric or telecommunications facilities by lenders organized as cooperatives to borrowers; and purchases eligible rural utilities loans and guarantees of securities backed by those loans, as well as LTSPCs for pools of eligible rural utilities loans. The Institutional Credit segment guarantees and purchases general obligations of lenders and other financial institutions that are secured by pools of loans eligible under the Farmer Mac's Farm & Ranch, USDA Guarantees, or Rural Utilities lines of business. Federal Agricultural Mortgage Corporation was founded in 1987 and is headquartered in Washington, District of Columbia.",
    "website": "http://www.farmermac.com",
    "zipcode": "20006"
  },
  "AGM-PC": {
    "city": "Washington",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Federal Agricultural Mortgage Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "Federal Agricultural Mortgage C",
    "state": "DC",
    "summary": "Federal Agricultural Mortgage Corporation provides a secondary market for various loans made to borrowers in the United States. It operates through four segments: Farm & Ranch, USDA (United States Department of Agriculture) Guarantees, Rural Utilities, and Institutional Credit. The Farm & Ranch segment purchases and retains eligible mortgage loans that are secured by first liens on agricultural real estate; securitizes eligible mortgage loans, and guarantees the timely payment of principal and interest on securities representing interests in or obligations secured by pools of mortgage loans; and issues long-term standby purchase commitments (LTSPC) on designated eligible mortgage loans. The USDA Guarantees segment purchases portions of certain agricultural and rural development loans guaranteed by the USDA. The Rural Utilities segment purchases and guarantees securities that are backed by loans for electric or telecommunications facilities by lenders organized as cooperatives to borrowers; and purchases eligible rural utilities loans and guarantees of securities backed by those loans, as well as LTSPCs for pools of eligible rural utilities loans. The Institutional Credit segment guarantees and purchases general obligations of lenders and other financial institutions that are secured by pools of loans eligible under the Farmer Mac's Farm & Ranch, USDA Guarantees, or Rural Utilities lines of business. Federal Agricultural Mortgage Corporation was founded in 1987 and is headquartered in Washington, District of Columbia.",
    "website": "http://www.farmermac.com",
    "zipcode": "20006"
  },
  "AGM-PD": {
    "city": "Washington",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Federal Agricultural Mortgage Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "Federal Agricultural Mortgage C",
    "state": "DC",
    "summary": "Federal Agricultural Mortgage Corporation provides a secondary market for various loans made to borrowers in the United States. It operates through four segments: Farm & Ranch, USDA (United States Department of Agriculture) Guarantees, Rural Utilities, and Institutional Credit. The Farm & Ranch segment purchases and retains eligible mortgage loans that are secured by first liens on agricultural real estate; securitizes eligible mortgage loans, and guarantees the timely payment of principal and interest on securities representing interests in or obligations secured by pools of mortgage loans; and issues long-term standby purchase commitments (LTSPC) on designated eligible mortgage loans. The USDA Guarantees segment purchases portions of certain agricultural and rural development loans guaranteed by the USDA. The Rural Utilities segment purchases and guarantees securities that are backed by loans for electric or telecommunications facilities by lenders organized as cooperatives to borrowers; and purchases eligible rural utilities loans and guarantees of securities backed by those loans, as well as LTSPCs for pools of eligible rural utilities loans. The Institutional Credit segment guarantees and purchases general obligations of lenders and other financial institutions that are secured by pools of loans eligible under the Farmer Mac's Farm & Ranch, USDA Guarantees, or Rural Utilities lines of business. Federal Agricultural Mortgage Corporation was founded in 1987 and is headquartered in Washington, District of Columbia.",
    "website": "http://www.farmermac.com",
    "zipcode": "20006"
  },
  "AGM-PE": {
    "city": "Washington",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Federal Agricultural Mortgage Corporation",
    "market": "us_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "Federal Agricultural Mortgage C",
    "state": "DC",
    "summary": "Federal Agricultural Mortgage Corporation provides a secondary market for various loans made to borrowers in the United States. It operates through four segments: Farm & Ranch, USDA (United States Department of Agriculture) Guarantees, Rural Utilities, and Institutional Credit. The Farm & Ranch segment purchases and retains eligible mortgage loans that are secured by first liens on agricultural real estate; securitizes eligible mortgage loans, and guarantees the timely payment of principal and interest on securities representing interests in or obligations secured by pools of mortgage loans; and issues long-term standby purchase commitments (LTSPC) on designated eligible mortgage loans. The USDA Guarantees segment purchases portions of certain agricultural and rural development loans guaranteed by the USDA. The Rural Utilities segment purchases and guarantees securities that are backed by loans for electric or telecommunications facilities by lenders organized as cooperatives to borrowers; and purchases eligible rural utilities loans and guarantees of securities backed by those loans, as well as LTSPCs for pools of eligible rural utilities loans. The Institutional Credit segment guarantees and purchases general obligations of lenders and other financial institutions that are secured by pools of loans eligible under the Farmer Mac's Farm & Ranch, USDA Guarantees, or Rural Utilities lines of business. Federal Agricultural Mortgage Corporation was founded in 1987 and is headquartered in Washington, District of Columbia.",
    "website": "http://www.farmermac.com",
    "zipcode": "20006"
  },
  "AGM-PF": {
    "city": "Washington",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Federal Agricultural Mortgage Corporation",
    "market": "us_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "Federal Agricultural Mortgage C",
    "state": "DC",
    "summary": "Federal Agricultural Mortgage Corporation provides a secondary market for various loans made to borrowers in the United States. It operates through four segments: Farm & Ranch, USDA (United States Department of Agriculture) Guarantees, Rural Utilities, and Institutional Credit. The Farm & Ranch segment purchases and retains eligible mortgage loans that are secured by first liens on agricultural real estate; securitizes eligible mortgage loans, and guarantees the timely payment of principal and interest on securities representing interests in or obligations secured by pools of mortgage loans; and issues long-term standby purchase commitments (LTSPC) on designated eligible mortgage loans. The USDA Guarantees segment purchases portions of certain agricultural and rural development loans guaranteed by the USDA. The Rural Utilities segment purchases and guarantees securities that are backed by loans for electric or telecommunications facilities by lenders organized as cooperatives to borrowers; and purchases eligible rural utilities loans and guarantees of securities backed by those loans, as well as LTSPCs for pools of eligible rural utilities loans. The Institutional Credit segment guarantees and purchases general obligations of lenders and other financial institutions that are secured by pools of loans eligible under the Farmer Mac's Farm & Ranch, USDA Guarantees, or Rural Utilities lines of business. Federal Agricultural Mortgage Corporation was founded in 1987 and is headquartered in Washington, District of Columbia.",
    "website": "http://www.farmermac.com",
    "zipcode": "20006"
  },
  "AGMGP": {
    "city": "Washington",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "Federal Agricultural Mortgage Corporation",
    "market": "us_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "FEDERAL AGRICULTURAL MORTGAGE C",
    "state": "DC",
    "summary": "Federal Agricultural Mortgage Corporation provides a secondary market for various loans made to borrowers in the United States. It operates through four segments: Farm & Ranch, USDA (United States Department of Agriculture) Guarantees, Rural Utilities, and Institutional Credit. The Farm & Ranch segment purchases and retains eligible mortgage loans that are secured by first liens on agricultural real estate; securitizes eligible mortgage loans, and guarantees the timely payment of principal and interest on securities representing interests in or obligations secured by pools of mortgage loans; and issues long-term standby purchase commitments (LTSPC) on designated eligible mortgage loans. The USDA Guarantees segment purchases portions of certain agricultural and rural development loans guaranteed by the USDA. The Rural Utilities segment purchases and guarantees securities that are backed by loans for electric or telecommunications facilities by lenders organized as cooperatives to borrowers; and purchases eligible rural utilities loans and guarantees of securities backed by those loans, as well as LTSPCs for pools of eligible rural utilities loans. The Institutional Credit segment guarantees and purchases general obligations of lenders and other financial institutions that are secured by pools of loans eligible under the Farmer Mac's Farm & Ranch, USDA Guarantees, or Rural Utilities lines of business. Federal Agricultural Mortgage Corporation was founded in 1987 and is headquartered in Washington, District of Columbia.",
    "website": "http://www.farmermac.com",
    "zipcode": "20006"
  },
  "AGRIP": {
    "city": "Saint Paul",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "AgriBank, FCB",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "AGRIBANK FCB",
    "state": "MN",
    "summary": "AgriBank, FCB provides funding to Farm Credit Associations that provides loans and financial services to farmers, ranchers, and rural businesses and homeowners. The company also offers wholesale funding services; leasing services; risk management services, including credit and enterprise risk management; and corporate and health insurance. In addition, it provides retail bank support services, including product development and support, as well as business services, such as financial reporting, procurement and execution of meeting, and travel services. The company operates in Arkansas, Illinois, Indiana, Iowa, Kentucky, Michigan, Minnesota, Missouri, Nebraska, North Dakota, Ohio, South Dakota, Tennessee, Wisconsin, and Wyoming. AgriBank, FCB was founded in 1992 and is based in Saint Paul, Minnesota. AgriBank, FCB operates as a subsidiary of Farm Credit System",
    "website": "http://www.agribank.com",
    "zipcode": "55101"
  },
  "ALLY": {
    "city": "Detroit",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Ally Financial Inc.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "Ally Financial Inc.",
    "state": "MI",
    "summary": "Ally Financial Inc., a bank holding company, provides various digital financial products and services to consumer, commercial, and corporate customers primarily in the United States and Canada. It operates through four segments: Automotive Finance Operations, Insurance Operations, Mortgage Finance Operations, and Corporate Finance Operations. The Automotive Finance Operations segment offers automotive financing services, including providing retail installment sales contracts, loans and operating leases, term loans, financing dealer floorplans, warehouse lines to automotive retailers, and fleet financing. It also provides financing services to companies and municipalities for the purchase or lease of vehicles, and vehicle-remarketing services. The Insurance Operations segment offers consumer finance protection and insurance products through the automotive dealer channel, and commercial insurance products directly to dealers. This segment provides vehicle service and maintenance contract, and guaranteed asset protection products; and underwrites commercial insurance coverages, which primarily insure dealers' vehicle inventory. The Mortgage Finance Operations segment manages held-for-investment consumer mortgage loan portfolio that includes bulk purchases of jumbo and low-to-moderate income mortgage loans originated by third parties, as well as direct-to-consumer mortgage offerings. The Corporate Finance Operations segment provides senior secured leveraged cash flow and asset-based loans to middle market companies; leveraged loans; and commercial real estate product to serve companies in the healthcare industry. The company, through its subsidiary, Ally Bank, also offers commercial banking products and services. In addition, it provides securities brokerage and investment advisory services. The company was formerly known as GMAC Inc. and changed its name to Ally Financial Inc. in May 2010. Ally Financial Inc. was founded in 1919 and is based in Detroit, Michigan.",
    "website": "http://www.ally.com",
    "zipcode": "48226"
  },
  "ALLY1.MX": {
    "city": "Detroit",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Credit Services",
    "long_name": "Ally Financial Inc.",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "ALLY FINANCIAL INC",
    "state": "MI",
    "summary": "Ally Financial Inc., a bank holding company, provides various digital financial products and services to consumer, commercial, and corporate customers primarily in the United States and Canada. It operates through four segments: Automotive Finance Operations, Insurance Operations, Mortgage Finance Operations, and Corporate Finance Operations. The Automotive Finance Operations segment offers automotive financing services, including providing retail installment sales contracts, loans and operating leases, term loans, financing dealer floorplans, warehouse lines to automotive retailers, and fleet financing. It also provides financing services to companies and municipalities for the purchase or lease of vehicles, and vehicle-remarketing services. The Insurance Operations segment offers consumer finance protection and insurance products through the automotive dealer channel, and commercial insurance products directly to dealers. This segment provides vehicle service and maintenance contract, and guaranteed asset protection products; and underwrites commercial insurance coverages, which primarily insure dealers' vehicle inventory. The Mortgage Finance Operations segment manages held-for-investment consumer mortgage loan portfolio that includes bulk purchases of jumbo and low-to-moderate income mortgage loans originated by third parties, as well as direct-to-consumer mortgage offerings. The Corporate Finance Operations segment provides senior secured leveraged cash flow and asset-based loans to middle market companies; leveraged loans; and commercial real estate product to serve companies in the healthcare industry. The company, through its subsidiary, Ally Bank, also offers commercial banking products and services. In addition, it provides securities brokerage and investment advisory services. The company was formerly known as GMAC Inc. and changed its name to Ally Financial Inc. in May 2010. Ally Financial Inc. was founded in 1919 and is based in Detroit, Michigan.",
    "website": "http://www.ally.com",
    "zipcode": "48226"
  },
  "AMSA": {
    "city": "Alpharetta",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "American Seniors Association Holding Group, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "AMERICAN SENIORS ASSOCIATION HL",
    "state": "GA",
    "summary": "American Seniors Association Holding Group, Inc., a for-profit membership services company, provides information and discounts to senior citizens in the United States. The company's benefits and discounted services comprise insurance products, including medicare, property, and casualty products. It also has contracts for reverse mortgages, checking, savings, and forward mortgages; offers discounted roadside assistant programs, ASA travel services, discounted prices on computers, retirement planning, and credit cards; and operates restaurants. The company was formerly known as American Seniors Association Holding Group, Inc. and changed its name to ASF Group, Inc. in January 2010. American Seniors Association Holding Group, Inc. was founded in 1997 and is based in Alpharetta, Georgia.",
    "website": "http://www.americanseniors.org",
    "zipcode": "30022"
  },
  "ARWD": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "Arrow Resources Development, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "ARROW RESOURCES DEVELOPMENT INC",
    "state": "NY",
    "summary": "Arrow Resources Development, Inc., a development stage company, provides marketing, sales, distribution, corporate operations, and corporate finance services for the commercial exploitation of natural resources worldwide. It has a marketing and distribution agreement with Arrow Pacific Resources Group Limited to market corn, lumber, and related products. The company is based in New York, New York.",
    "website": null,
    "zipcode": "10019"
  },
  "ASFZ": {
    "city": "Irving",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "Associates First Capital Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "ASSOCIATES FIRST CAPITAL CORP",
    "state": "TX",
    "summary": "Associates First Capital Corporation, a financial services organization, provides finance, leasing, insurance, and related services to individual consumers and businesses in the United States and internationally. The company was founded in 1918 and is based in Irving, Texas. Associates First Capital Corporation operates as a subsidiary of Citicorp Banking Corporation.",
    "website": null,
    "zipcode": "75062"
  },
  "ATIN": {
    "city": "Raleigh",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "ATI Nationwide Holding Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "ATI NATIONWIDE HOLDING CORP",
    "state": "NC",
    "summary": "ATI Nationwide Holding Corp. operates as the holding company for Nationwide Microfinance Limited that focuses on providing national savings and loan operating services in Ghana and internationally. The company was formerly known as EXA, Inc. and changed its name to ATI Nationwide Holding Corp. in October 2016. ATI Nationwide Holding Corp. was incorporated in 2001 and is headquartered in Raleigh, North Carolina. ATI Nationwide Holding Corp. is a subsidiary of AmericaTowne, Inc.",
    "website": "http://www.atinationwide.com",
    "zipcode": "27609"
  },
  "ATLC": {
    "city": "Atlanta",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Credit Services",
    "long_name": "Atlanticus Holdings Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "Atlanticus Holdings Corporation",
    "state": "GA",
    "summary": "Atlanticus Holdings Corporation provides credit and related financial services and products to customers the United States. It operates in two segments, Credit and Other Investments, and Auto Finance. The Credit and Other Investments segment originates a range of consumer loan products, such as private label and general purpose credit cards originated by lenders through various channels, including retail point-of-sale, direct mail solicitation, online, and partnerships with third parties; and offers credit to their customers for the purchase of various goods and services, including consumer electronics, furniture, elective medical procedures, healthcare, educational services, and home-improvements by partnering with retailers and service providers. This segment also invests in and services portfolios of credit card receivables. In addition, it offers loan servicing, such as risk management and customer service outsourcing for third parties; and engages in testing and investment activities in consumer finance technology platforms. The Auto Finance segment purchases and/or services loans secured by automobiles from or for a pre-qualified network of independent automotive dealers and automotive finance companies in the buy-here, pay-here, and used car business. This segment also provides floor plan financing and installment lending products. The company was formerly known as CompuCredit Holdings Corporation and changed its name to Atlanticus Holdings Corporation in November 2012. Atlanticus Holdings Corporation was founded in 1996 and is headquartered in Atlanta, Georgia.",
    "website": "http://www.atlanticus.com",
    "zipcode": "30328"
  },
  "AWKS": {
    "city": "Sciota",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "AmeriWorks, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "AMERIWORKS INC",
    "state": "PA",
    "summary": "AmeriWorks, Inc. provides debt collection services and various other financial products to supermarkets and retail stores in the United States. Its debt collection services include collection of checks, credit cards, rents, property membership dues, taxes, municipal fees, student loans, private school tuition, business to business invoices, medical debt, and other debts. The company offers POS University, a proprietary, on-line, front end training course for corporate employees and/or individuals in counterfeit money, bad checks, and other point of sale techniques; and StaBILLity payment solutions, a proprietary e-payment program for professional and non-professional businesses, such as doctors, hospitals, dentists, veterinarians and retail business establishments to allow their consumers who have no cash, credit, or medical insurance to pay for goods and services through an extended payment program. It also provides the DOT.chek system, an anti-fraud identification and payment system to reduce consumer check fraud at the point of sale and allow payment using a driver license or State ID card to initiate a DOT-Chek transaction. In addition, the company develops kiosks for use in casinos, theme parks, resorts, malls, airports, and arenas to collect charitable donations for various charities. AmeriWorks, Inc. is based in Sciota, Pennsylvania.",
    "website": null,
    "zipcode": "18354"
  },
  "AXP": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "American Express Company",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "American Express Company",
    "state": "NY",
    "summary": "American Express Company, together with its subsidiaries, provides charge and credit payment card products, and travel-related services worldwide. The company operates through three segments: Global Consumer Services Group, Global Commercial Services, and Global Merchant and Network Services. Its products and services include payment and financing products; network services; accounts payable expense management products and services; and travel and lifestyle services. The company's products and services also comprise merchant acquisition and processing, servicing and settlement, point-of-sale marketing, and information products and services for merchants; and fraud prevention services, as well as the design and operation of customer loyalty programs. It sells its products and services to consumers, small businesses, mid-sized companies, and large corporations through mobile and online applications, third-party vendors and business partners, direct mail, telephone, in-house sales teams, and direct response advertising. American Express Company was founded in 1850 and is headquartered in New York, New York.",
    "website": "http://www.americanexpress.com",
    "zipcode": "10285"
  },
  "AXP.BA": {
    "city": "New York",
    "country": "United States",
    "currency": "ARS",
    "exchange": "BUE",
    "industry": "Credit Services",
    "long_name": "American Express Company",
    "market": "ar_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "AMER EXPRESS CO",
    "state": "NY",
    "summary": "American Express Company, together with its subsidiaries, provides charge and credit payment card products, and travel-related services worldwide. The company operates through three segments: Global Consumer Services Group, Global Commercial Services, and Global Merchant and Network Services. Its products and services include payment and financing products; network services; accounts payable expense management products and services; and travel and lifestyle services. The company's products and services also comprise merchant acquisition and processing, servicing and settlement, point-of-sale marketing, and information products and services for merchants; and fraud prevention services, as well as the design and operation of customer loyalty programs. It sells its products and services to consumers, small businesses, mid-sized companies, and large corporations through mobile and online applications, third-party vendors and business partners, direct mail, telephone, in-house sales teams, and direct response advertising. American Express Company was founded in 1850 and is headquartered in New York, New York.",
    "website": "http://www.americanexpress.com",
    "zipcode": "10285"
  },
  "AXP.MX": {
    "city": "New York",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Credit Services",
    "long_name": "American Express Company",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "AMERICAN EXPRESS CO",
    "state": "NY",
    "summary": "American Express Company, together with its subsidiaries, provides charge and credit payment card products, and travel-related services worldwide. The company operates through three segments: Global Consumer Services Group, Global Commercial Services, and Global Merchant and Network Services. Its products and services include payment and financing products; network services; accounts payable expense management products and services; and travel and lifestyle services. The company's products and services also comprise merchant acquisition and processing, servicing and settlement, point-of-sale marketing, and information products and services for merchants; and fraud prevention services, as well as the design and operation of customer loyalty programs. It sells its products and services to consumers, small businesses, mid-sized companies, and large corporations through mobile and online applications, third-party vendors and business partners, direct mail, telephone, in-house sales teams, and direct response advertising. American Express Company was founded in 1850 and is headquartered in New York, New York.",
    "website": "http://www.americanexpress.com",
    "zipcode": "10285"
  },
  "AXP.SN": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "SGO",
    "industry": "Credit Services",
    "long_name": "American Express Company",
    "market": "cl_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "AMER EXPRESS CO",
    "state": "NY",
    "summary": "American Express Company, together with its subsidiaries, provides charge and credit payment card products, and travel-related services worldwide. The company operates through three segments: Global Consumer Services Group, Global Commercial Services, and Global Merchant and Network Services. Its products and services include payment and financing products; network services; accounts payable expense management products and services; and travel and lifestyle services. The company's products and services also comprise merchant acquisition and processing, servicing and settlement, point-of-sale marketing, and information products and services for merchants; and fraud prevention services, as well as the design and operation of customer loyalty programs. It sells its products and services to consumers, small businesses, mid-sized companies, and large corporations through mobile and online applications, third-party vendors and business partners, direct mail, telephone, in-house sales teams, and direct response advertising. American Express Company was founded in 1850 and is headquartered in New York, New York.",
    "website": "http://www.americanexpress.com",
    "zipcode": "10285"
  },
  "AXP.VI": {
    "city": "New York",
    "country": "United States",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Credit Services",
    "long_name": "American Express Company",
    "market": "at_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "AMERICAN EXPRESS CO",
    "state": "NY",
    "summary": "American Express Company, together with its subsidiaries, provides charge and credit payment card products, and travel-related services worldwide. The company operates through three segments: Global Consumer Services Group, Global Commercial Services, and Global Merchant and Network Services. Its products and services include payment and financing products; network services; accounts payable expense management products and services; and travel and lifestyle services. The company's products and services also comprise merchant acquisition and processing, servicing and settlement, point-of-sale marketing, and information products and services for merchants; and fraud prevention services, as well as the design and operation of customer loyalty programs. It sells its products and services to consumers, small businesses, mid-sized companies, and large corporations through mobile and online applications, third-party vendors and business partners, direct mail, telephone, in-house sales teams, and direct response advertising. American Express Company was founded in 1850 and is headquartered in New York, New York.",
    "website": "http://www.americanexpress.com",
    "zipcode": "10285"
  },
  "AXPB34.SA": {
    "city": "New York",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Credit Services",
    "long_name": "American Express Company",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "AMERICAN EXPDRN",
    "state": "NY",
    "summary": "American Express Company, together with its subsidiaries, provides charge and credit payment card products, and travel-related services worldwide. The company operates through three segments: Global Consumer Services Group, Global Commercial Services, and Global Merchant and Network Services. Its products and services include payment and financing products; network services; accounts payable expense management products and services; and travel and lifestyle services. The company's products and services also comprise merchant acquisition and processing, servicing and settlement, point-of-sale marketing, and information products and services for merchants; and fraud prevention services, as well as the design and operation of customer loyalty programs. It sells its products and services to consumers, small businesses, mid-sized companies, and large corporations through mobile and online applications, third-party vendors and business partners, direct mail, telephone, in-house sales teams, and direct response advertising. American Express Company was founded in 1850 and is headquartered in New York, New York.",
    "website": "http://www.americanexpress.com",
    "zipcode": "10285"
  },
  "BBDC": {
    "city": "Charlotte",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Barings BDC, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "Barings BDC, Inc.",
    "state": "NC",
    "summary": "Barings BDC, Inc. (NYSE: BBDC) is a publicly traded, externally managed investment company that has elected to be treated as a business development company under the Investment Company Act of 1940. Barings BDC seeks to invest primarily in senior secured loans to private U.S. middle-market companies that operate across a wide range of industries. It specializes in mezzanine, leveraged buyouts, management buyouts, ESOPs, change of control transactions, acquisition financings, growth financing, and recapitalizations in lower middle market, mature, and later stage companies. Barings BDC's investment activities are managed by its investment adviser, Barings LLC, a leading global asset manager based in Charlotte, NC with over $335 billion of AUM firm-wide. For more information, visit www.baringsbdc.com.",
    "website": "http://www.baringsbdc.com",
    "zipcode": "28202"
  },
  "BCAP": {
    "city": "Fort Lauderdale",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "Baron Capital Enterprise, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "BARON CAP ENTERPRISE INC",
    "state": "FL",
    "summary": "Baron Capital Enterprise, Inc., through its subsidiaries, provides stock transfer agency services in Florida. The company was formerly known as 247MGI, Inc. and changed its name to Baron Capital Enterprises, Inc. in November 2011. Baron Capital Enterprise, Inc. is based in Fort Lauderdale, Florida.",
    "website": "http://www.baroncapitalenterprise.com",
    "zipcode": "33309"
  },
  "BWMY": {
    "city": "Fort Lauderdale",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "BorrowMoney.com, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "BORROWMONEY COM INC",
    "state": "FL",
    "summary": "BorrowMoney.com, Inc. operates an online loan marketplace for consumers seeking loans and other credit-based offerings. The company provides consumers with access to product offerings from network lenders, including mortgage loans, home equity loans and lines of credit, reverse mortgage loans, auto loans, credit cards, deposit accounts, personal loans, student loans, and small business loans and other related offerings. It also offers credit repair, debt relief, home improvement, personal credit data, and real estate brokerage services, as well as various consumer insurance products, including home and automobile. In addition, the company provides tools and resources, including free credit scores that facilitate comparison shopping for loans, deposits, and other credit-based offerings. BorrowMoney.com, Inc. was incorporated in 2000 and is based in Fort Lauderdale, Florida.",
    "website": "http://www.borrowmoney.com",
    "zipcode": "33304"
  },
  "CACC": {
    "city": "Southfield",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Credit Services",
    "long_name": "Credit Acceptance Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "Credit Acceptance Corporation",
    "state": "MI",
    "summary": "Credit Acceptance Corporation provides financing programs, and related products and services to independent and franchised automobile dealers in the United States. The company advances money to dealers in exchange for the right to service the underlying consumer loans; and buys the consumer loans from the dealers and keeps various amounts collected from the consumers. It is also involved in the business of reinsuring coverage under vehicle service contracts sold to consumers by dealers on vehicles financed by the company. Credit Acceptance Corporation was founded in 1972 and is headquartered in Southfield, Michigan.",
    "website": "http://www.creditacceptance.com",
    "zipcode": "48034-8339"
  },
  "CAFI": {
    "city": "Las Vegas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "Consumer Automotive Finance, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "CONSUMER AUTOMOTIVE FINANCE INC",
    "state": "NV",
    "summary": "Consumer Automotive Finance Inc. operates as a retailer in the used vehicle market of the United States. It focuses primarily on the buy here/pay here segment of the independent used vehicle sales and finance market. The company sells approximately 2000 and newer model-year used vehicles and provides related financing through sale type leases. As of December 31, 2010, it had two retail locations in Arizona. The company was formerly known as NowAuto Group, Inc. Consumer Automotive Finance Inc. is based in Las Vegas, Nevada.",
    "website": "http://www.cafius.com",
    "zipcode": "89128"
  },
  "CAON34.SA": {
    "city": "McLean",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Credit Services",
    "long_name": "Capital One Financial Corporation",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "CAPITAL ONE DRN",
    "state": "VA",
    "summary": "Capital One Financial Corporation operates as the financial services holding company for the Capital One Bank (USA), National Association; and Capital One, National Association, which provides various financial products and services in the United States, Canada, and the United Kingdom. It operates through three segments: Credit Card, Consumer Banking, and Commercial Banking. The company accepts checking accounts, money market deposits, negotiable order of withdrawals, savings deposits, and time deposits. Its loan products include credit card loans; auto and retail banking loans; and commercial and multifamily real estate, and commercial and industrial loans. The company also offers credit and debit card products; online direct banking services; and treasury management and depository services. It serves consumers, small businesses, and commercial clients through digital channels, branches, cafs, and other distribution channels located in New York, Louisiana, Texas, Maryland, Virginia, New Jersey, and California. Capital One Financial Corporation was founded in 1988 and is headquartered in McLean, Virginia.",
    "website": "http://www.capitalone.com",
    "zipcode": "22102"
  },
  "CCGN": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "Consumer Capital Group, Inc",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "CONSUMER CAPITAL GROUP INC",
    "state": "NY",
    "summary": "Consumer Capital Group, Inc., through its subsidiaries, provides microfinancing services for micro, and small-to-medium sized enterprises (SMEs) in China. It offers direct loans to SMEs and sole proprietors; and private loans to borrowers, as well as acts as an intermediary to facilitate the loan transactions. The company also provides financial consulting services; and advisory and risk assessment services to lenders and borrowers. In addition, it offers asset management, management consulting, and Internet information services, as well as advertising design, production, agent, and publishing services. Further, the company maintains various computer systems, software, and data; owns intellectual property rights for consumer market network; and assists in payment collection for e-commerce business. Consumer Capital Group, Inc. was incorporated in 2008 and is headquartered in New York, New York.",
    "website": null,
    "zipcode": "10960"
  },
  "CFGX": {
    "city": "Murray",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "Capital Financial Global, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "CAPITAL FINANCIAL GLOBAL INC",
    "state": "UT",
    "summary": "Capital Financial Global, Inc., a specialty finance company, provides asset-backed financing and loan advisory services. It offers bridge loans, long-term loans, hard-money loans, and loan restructuring services for commercial real estate owners or managers. The company also provides portfolio loans, single loans, bridge loans, renovation loans, and loan restructuring services for residential real estate investors to purchase, refinance, and renovate projects. In addition, it offers credit facilities, premium finance arrangements, and other custom lending solutions for insurance trusts. The company is headquartered in Murray, Utah.",
    "website": "http://www.capfiglobal.com",
    "zipcode": "84123"
  },
  "CFNB": {
    "city": "Newport Beach",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "California First Leasing Corporation",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "California First National Banco",
    "state": "CA",
    "summary": "California First Leasing Corporation provides loans and lease financing for universities, businesses, and other commercial or non-profit organizations. The company was formerly known as California First National Bancorp and changed its name to California First Leasing Corporation in February 2021. California First Leasing Corporation was founded in 1977 and is based in Newport Beach, California.",
    "website": "http://www.calfirstbancorp.com",
    "zipcode": "92660"
  },
  "CFX.DE": {
    "city": "McLean",
    "country": "United States",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Credit Services",
    "long_name": "Capital One Financial Corporation",
    "market": "de_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "CAPITAL ONE FINL  DL-,01",
    "state": "VA",
    "summary": "Capital One Financial Corporation operates as the financial services holding company for the Capital One Bank (USA), National Association; and Capital One, National Association, which provides various financial products and services in the United States, Canada, and the United Kingdom. It operates through three segments: Credit Card, Consumer Banking, and Commercial Banking. The company accepts checking accounts, money market deposits, negotiable order of withdrawals, savings deposits, and time deposits. Its loan products include credit card loans; auto and retail banking loans; and commercial and multifamily real estate, and commercial and industrial loans. The company also offers credit and debit card products; online direct banking services; and treasury management and depository services. It serves consumers, small businesses, and commercial clients through digital channels, branches, cafs, and other distribution channels located in New York, Louisiana, Texas, Maryland, Virginia, New Jersey, and California. Capital One Financial Corporation was founded in 1988 and is headquartered in McLean, Virginia.",
    "website": "http://www.capitalone.com",
    "zipcode": "22102"
  },
  "CFX.F": {
    "city": "McLean",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "Capital One Financial Corporation",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "CAPITAL ONE FINL  DL-,01",
    "state": "VA",
    "summary": "Capital One Financial Corporation operates as the financial services holding company for the Capital One Bank (USA), National Association; and Capital One, National Association, which provides various financial products and services in the United States, Canada, and the United Kingdom. It operates through three segments: Credit Card, Consumer Banking, and Commercial Banking. The company accepts checking accounts, money market deposits, negotiable order of withdrawals, savings deposits, and time deposits. Its loan products include credit card loans; auto and retail banking loans; and commercial and multifamily real estate, and commercial and industrial loans. The company also offers credit and debit card products; online direct banking services; and treasury management and depository services. It serves consumers, small businesses, and commercial clients through digital channels, branches, cafs, and other distribution channels located in New York, Louisiana, Texas, Maryland, Virginia, New Jersey, and California. Capital One Financial Corporation was founded in 1988 and is headquartered in McLean, Virginia.",
    "website": "http://www.capitalone.com",
    "zipcode": "22102"
  },
  "CGE.MU": {
    "city": "Wichita",
    "country": "United States",
    "currency": "EUR",
    "exchange": "MUN",
    "industry": "Credit Services",
    "long_name": "CURO Group Holdings Corp.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "CURO GRP HLDGS DL-,001",
    "state": "KS",
    "summary": "CURO Group Holdings Corp., a diversified consumer finance company, provides consumer finance products to a range of underbanked consumers in the United States and Canada. The company offers unsecured installment loans, secured installment loans, open-end loans, and single-pay loans, as well as ancillary financial products, including check cashing, proprietary reloadable prepaid debit cards, demand deposit accounts, credit protection insurance, retail installment sales, and money transfer services. It also provides loans through online. The company was formerly known as Speedy Group Holdings Corp. and changed its name to CURO Group Holdings Corp. in May 2016. CURO Group Holdings Corp. was founded in 1997 and is headquartered in Wichita, Kansas.",
    "website": "http://www.curo.com",
    "zipcode": "67205"
  },
  "CHFI": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "China Finance, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "CHINA FINANCE INC",
    "state": "NY",
    "summary": "China Finance, Inc. operates as a financial services company and provides guarantees to small and medium enterprises. It provides surety guarantees to Chinese SMEs seeking to become publicly-traded companies in the United States by being acquired by a United States reporting company in a reverse merger or merger and acquisition transaction; loan guarantees to assist SMEs and individuals in obtaining loans from Chinese banks for business operations and/or personal use; and various direct loans for business operations. The company also offers consulting services, including business and introduction services, translation services, and access to office facilities, such as conference rooms, computers, telephone, and fax lines. The company was formerly known as Value Global International Limited and changed its name to China Finance, Inc. in September 2004. The company was incorporated in 2000 and is based in New York, New York.",
    "website": null,
    "zipcode": "10019"
  },
  "COF": {
    "city": "McLean",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Capital One Financial Corporation",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "Capital One Financial Corporati",
    "state": "VA",
    "summary": "Capital One Financial Corporation operates as the financial services holding company for the Capital One Bank (USA), National Association; and Capital One, National Association, which provides various financial products and services in the United States, Canada, and the United Kingdom. It operates through three segments: Credit Card, Consumer Banking, and Commercial Banking. The company accepts checking accounts, money market deposits, negotiable order of withdrawals, savings deposits, and time deposits. Its loan products include credit card loans; auto and retail banking loans; and commercial and multifamily real estate, and commercial and industrial loans. The company also offers credit and debit card products; online direct banking services; and treasury management and depository services. It serves consumers, small businesses, and commercial clients through digital channels, branches, cafs, and other distribution channels located in New York, Louisiana, Texas, Maryland, Virginia, New Jersey, and California. Capital One Financial Corporation was founded in 1988 and is headquartered in McLean, Virginia.",
    "website": "http://www.capitalone.com",
    "zipcode": "22102"
  },
  "COF-PG": {
    "city": "McLean",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Capital One Financial Corporation",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "Capital One Financial Corporati",
    "state": "VA",
    "summary": "Capital One Financial Corporation operates as the financial services holding company for the Capital One Bank (USA), National Association; and Capital One, National Association, which provides various financial products and services in the United States, Canada, and the United Kingdom. It operates through three segments: Credit Card, Consumer Banking, and Commercial Banking. The company accepts checking accounts, money market deposits, negotiable order of withdrawals, savings deposits, and time deposits. Its loan products include credit card loans; auto and retail banking loans; and commercial and multifamily real estate, and commercial and industrial loans. The company also offers credit and debit card products; online direct banking services; and treasury management and depository services. It serves consumers, small businesses, and commercial clients through digital channels, branches, cafs, and other distribution channels located in New York, Louisiana, Texas, Maryland, Virginia, New Jersey, and California. Capital One Financial Corporation was founded in 1988 and is headquartered in McLean, Virginia.",
    "website": "http://www.capitalone.com",
    "zipcode": "22102"
  },
  "COF-PH": {
    "city": "McLean",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Capital One Financial Corporation",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "Capital One Financial Corporati",
    "state": "VA",
    "summary": "Capital One Financial Corporation operates as the financial services holding company for the Capital One Bank (USA), National Association; and Capital One, National Association, which provides various financial products and services in the United States, Canada, and the United Kingdom. It operates through three segments: Credit Card, Consumer Banking, and Commercial Banking. The company accepts checking accounts, money market deposits, negotiable order of withdrawals, savings deposits, and time deposits. Its loan products include credit card loans; auto and retail banking loans; and commercial and multifamily real estate, and commercial and industrial loans. The company also offers credit and debit card products; online direct banking services; and treasury management and depository services. It serves consumers, small businesses, and commercial clients through digital channels, branches, cafs, and other distribution channels located in New York, Louisiana, Texas, Maryland, Virginia, New Jersey, and California. Capital One Financial Corporation was founded in 1988 and is headquartered in McLean, Virginia.",
    "website": "http://www.capitalone.com",
    "zipcode": "22102"
  },
  "COF-PI": {
    "city": "McLean",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Capital One Financial Corporation",
    "market": "us_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "Capital One Financial Corporati",
    "state": "VA",
    "summary": "Capital One Financial Corporation operates as the financial services holding company for the Capital One Bank (USA), National Association; and Capital One, National Association, which provides various financial products and services in the United States, Canada, and the United Kingdom. It operates through three segments: Credit Card, Consumer Banking, and Commercial Banking. The company accepts checking accounts, money market deposits, negotiable order of withdrawals, savings deposits, and time deposits. Its loan products include credit card loans; auto and retail banking loans; and commercial and multifamily real estate, and commercial and industrial loans. The company also offers credit and debit card products; online direct banking services; and treasury management and depository services. It serves consumers, small businesses, and commercial clients through digital channels, branches, cafs, and other distribution channels located in New York, Louisiana, Texas, Maryland, Virginia, New Jersey, and California. Capital One Financial Corporation was founded in 1988 and is headquartered in McLean, Virginia.",
    "website": "http://www.capitalone.com",
    "zipcode": "22102"
  },
  "COF-PJ": {
    "city": "McLean",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Capital One Financial Corporation",
    "market": "us_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "Capital One Financial Corporati",
    "state": "VA",
    "summary": "Capital One Financial Corporation operates as the financial services holding company for the Capital One Bank (USA), National Association; and Capital One, National Association, which provides various financial products and services in the United States, Canada, and the United Kingdom. It operates through three segments: Credit Card, Consumer Banking, and Commercial Banking. The company accepts checking accounts, money market deposits, negotiable order of withdrawals, savings deposits, and time deposits. Its loan products include credit card loans; auto and retail banking loans; and commercial and multifamily real estate, and commercial and industrial loans. The company also offers credit and debit card products; online direct banking services; and treasury management and depository services. It serves consumers, small businesses, and commercial clients through digital channels, branches, cafs, and other distribution channels located in New York, Louisiana, Texas, Maryland, Virginia, New Jersey, and California. Capital One Financial Corporation was founded in 1988 and is headquartered in McLean, Virginia.",
    "website": "http://www.capitalone.com",
    "zipcode": "22102"
  },
  "COF.MX": {
    "city": "McLean",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Credit Services",
    "long_name": "Capital One Financial Corporation",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "CAPITAL ONE FINANCIAL CORP",
    "state": "VA",
    "summary": "Capital One Financial Corporation operates as the financial services holding company for the Capital One Bank (USA), National Association; and Capital One, National Association, which provides various financial products and services in the United States, Canada, and the United Kingdom. It operates through three segments: Credit Card, Consumer Banking, and Commercial Banking. The company accepts checking accounts, money market deposits, negotiable order of withdrawals, savings deposits, and time deposits. Its loan products include credit card loans; auto and retail banking loans; and commercial and multifamily real estate, and commercial and industrial loans. The company also offers credit and debit card products; online direct banking services; and treasury management and depository services. It serves consumers, small businesses, and commercial clients through digital channels, branches, cafs, and other distribution channels located in New York, Louisiana, Texas, Maryland, Virginia, New Jersey, and California. Capital One Financial Corporation was founded in 1988 and is headquartered in McLean, Virginia.",
    "website": "http://www.capitalone.com",
    "zipcode": "22102"
  },
  "COFPL": {
    "city": "McLean",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "Capital One Financial Corporation",
    "market": "us_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "CAPITAL ONE FINANCIAL CORP DEP ",
    "state": "VA",
    "summary": "Capital One Financial Corporation operates as the financial services holding company for the Capital One Bank (USA), National Association; and Capital One, National Association, which provides various financial products and services in the United States, Canada, and the United Kingdom. It operates through three segments: Credit Card, Consumer Banking, and Commercial Banking. The company accepts checking accounts, money market deposits, negotiable order of withdrawals, savings deposits, and time deposits. Its loan products include credit card loans; auto and retail banking loans; and commercial and multifamily real estate, and commercial and industrial loans. The company also offers credit and debit card products; online direct banking services; and treasury management and depository services. It serves consumers, small businesses, and commercial clients through digital channels, branches, cafs, and other distribution channels located in New York, Louisiana, Texas, Maryland, Virginia, New Jersey, and California. Capital One Financial Corporation was founded in 1988 and is headquartered in McLean, Virginia.",
    "website": "http://www.capitalone.com",
    "zipcode": "22102"
  },
  "CPB1.F": {
    "city": "Littleton",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "CPI Card Group Inc.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "CPI CARD GROUP  DL-,001",
    "state": "CO",
    "summary": "CPI Card Group Inc., together with its subsidiaries, engages in the design, production, data personalization, packaging, and fulfillment of financial payment cards. It operates through Debit and Credit, and Prepaid Debit segments. The Debit and Credit segment produces financial payment cards and provides integrated card services to card-issuing banks. Its products include EMV and non-EMV financial payment cards and metal cards, as well as private label credit cards. This segment also provides on-demand services and various integrated card services, including card personalization and fulfillment, and instant issuance services. The Prepaid Debit segment primarily offers integrated card services comprising tamper-evident security packaging services to prepaid debit card providers. It also produces financial payment cards issued on the networks of the payment card brands. CPI Card Group Inc. serves issuers of debit and credit cards, Prepaid Debit Card program managers, community banks, credit unions, group service providers, and card transaction processors in the United States. The company was formerly known as CPI Holdings I, Inc. and changed its name to CPI Card Group Inc. in August 2015. CPI Card Group Inc. was founded in 2007 and is based in Littleton, Colorado.",
    "website": "http://www.cpicardgroup.com",
    "zipcode": "80127"
  },
  "CPSS": {
    "city": "Las Vegas",
    "country": "United States",
    "currency": "USD",
    "exchange": "NGM",
    "industry": "Credit Services",
    "long_name": "Consumer Portfolio Services, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "Consumer Portfolio Services, In",
    "state": "NV",
    "summary": "Consumer Portfolio Services, Inc. operates as a specialty finance company in the United States. It purchases and services retail automobile contracts originated by franchised automobile dealers and select independent dealers in the sale of new and used automobiles, light trucks, and passenger vans. The company, through its automobile contract purchases, offers indirect financing to the customers of dealers with limited credit histories or past credit problems. It serves as an alternative source of financing for dealers, facilitating sales to customers who might not be able to obtain financing from commercial banks, credit unions, and the captive finance companies. The company also acquires installment purchase contracts in four merger and acquisition transactions; and offers financing directly to sub-prime consumers to facilitate their purchase of a new or used automobile, light truck, or passenger van. The company services its automobile contracts through its branches in California, Nevada, Virginia, Florida, and Illinois. Consumer Portfolio Services, Inc. was founded in 1991 and is based in Las Vegas, Nevada.",
    "website": "http://www.consumerportfolio.com",
    "zipcode": "89169"
  },
  "CRDA34.SA": {
    "city": "Southfield",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Credit Services",
    "long_name": "Credit Acceptance Corporation",
    "market": "br_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "CREDIT ACCEPDRN",
    "state": "MI",
    "summary": "Credit Acceptance Corporation provides financing programs, and related products and services to independent and franchised automobile dealers in the United States. The company advances money to dealers in exchange for the right to service the underlying consumer loans; and buys the consumer loans from the dealers and keeps various amounts collected from the consumers. It is also involved in the business of reinsuring coverage under vehicle service contracts sold to consumers by dealers on vehicles financed by the company. Credit Acceptance Corporation was founded in 1972 and is headquartered in Southfield, Michigan.",
    "website": "http://www.creditacceptance.com",
    "zipcode": "48034-8339"
  },
  "CTON": {
    "city": "Fort Lauderdale",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "Second Street Capital, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "SECOND STR CAP INC",
    "state": "FL",
    "summary": "Second Street Capital, Inc. operates as a specialty finance company in the United States. It provides asset based lending to small and medium sized businesses, export trading companies, and small and medium sized homebuilders, developers, and investors. The company offers revenue participation asset based and mortgage loans, as well as preferred equity investments and senior secured loans. It also makes and manages investments in qualified real estate related assets as a principal and on behalf of institutional clients. The company was formerly known as Calton, Inc. and changed its name to Second Street Capital, Inc. in November 2011. Second Street Capital, Inc. was founded in 1969 and is headquartered in Fort Lauderdale, Florida.",
    "website": "http://www.secondstreetcap.com",
    "zipcode": "33304"
  },
  "CURO": {
    "city": "Wichita",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "CURO Group Holdings Corp.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "CURO Group Holdings Corp.",
    "state": "KS",
    "summary": "CURO Group Holdings Corp., a diversified consumer finance company, provides consumer finance products to a range of underbanked consumers in the United States and Canada. The company offers unsecured installment loans, secured installment loans, open-end loans, and single-pay loans, as well as ancillary financial products, including check cashing, proprietary reloadable prepaid debit cards, demand deposit accounts, credit protection insurance, retail installment sales, and money transfer services. It also provides loans through online. The company was formerly known as Speedy Group Holdings Corp. and changed its name to CURO Group Holdings Corp. in May 2016. CURO Group Holdings Corp. was founded in 1997 and is headquartered in Wichita, Kansas.",
    "website": "http://www.curo.com",
    "zipcode": "67205"
  },
  "CYIO": {
    "city": "Washington",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "CYIOS Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "CYIOS CORPORATION",
    "state": "DC",
    "summary": "CYIOS Corporation, through its subsidiaries, operates as a systems integrator and knowledge management solutions provider supporting the United States army, Department of Defense, and federal government agencies. The company builds knowledge management solutions, which support organizations with business continuity and information technology services, as well as offers the U.S. Army Knowledge Online, a knowledge management portal that supports approximately 1.8 million soldiers and civilians worldwide. It also markets and sells CYIPRO, a Web-based business transformation tool that provides a virtual work space for collaboration, project management, and document management to help manage people, processes, and information. The CYIPRO tool suite includes e-mail, document and file management, calendar, tasks, meetings, contacts, project management, reporting, and timesheet management. The CYIPRO tool also offers solutions for compliance with Securities and Exchange Commission Sarbanes-Oxley regulations, compliance with Defense Contract Audit Agency, and performance based contracting for government contractors. CYIOS Corporation was founded in 1994 and is headquartered in Washington, District Of Columbia.",
    "website": "http://www.cyios.com",
    "zipcode": "20004"
  },
  "D1FS34.SA": {
    "city": "Riverwoods",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Credit Services",
    "long_name": "Discover Financial Services",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "DISCOVER FINDRN",
    "state": "IL",
    "summary": "Discover Financial Services, through its subsidiaries, operates as a digital banking and payment services company in the United States. It operates in two segments, Digital Banking and Payment Services. The Digital Banking segment offers Discover-branded credit cards to individuals; and other consumer products and services, including private student loans, personal loans, home loans, and other consumer lending, as well as deposit products, such as certificates of deposit, money market accounts, IRA certificates of deposit, IRA savings accounts, checking accounts, and sweep accounts. The Payment Services segment operates the PULSE network, an automated teller machine, debit, and electronic funds transfer network; Diners Club International, a payments network that issues Diners Club branded charge cards and/or provides card acceptance services; and Discover Network that processes transactions for Discover-branded credit and debit cards, as well as provides payment transaction processing and settlement services. The company was incorporated in 1960 and is based in Riverwoods, Illinois.",
    "website": "http://www.discover.com",
    "zipcode": "60015"
  },
  "DC7.F": {
    "city": "Riverwoods",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "Discover Financial Services",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "DISCOVER FINL SRVCS DL-01",
    "state": "IL",
    "summary": "Discover Financial Services, through its subsidiaries, operates as a digital banking and payment services company in the United States. It operates in two segments, Digital Banking and Payment Services. The Digital Banking segment offers Discover-branded credit cards to individuals; and other consumer products and services, including private student loans, personal loans, home loans, and other consumer lending, as well as deposit products, such as certificates of deposit, money market accounts, IRA certificates of deposit, IRA savings accounts, checking accounts, and sweep accounts. The Payment Services segment operates the PULSE network, an automated teller machine, debit, and electronic funds transfer network; Diners Club International, a payments network that issues Diners Club branded charge cards and/or provides card acceptance services; and Discover Network that processes transactions for Discover-branded credit and debit cards, as well as provides payment transaction processing and settlement services. The company was incorporated in 1960 and is based in Riverwoods, Illinois.",
    "website": "http://www.discover.com",
    "zipcode": "60015"
  },
  "DFS": {
    "city": "Riverwoods",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Discover Financial Services",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "Discover Financial Services",
    "state": "IL",
    "summary": "Discover Financial Services, through its subsidiaries, operates as a digital banking and payment services company in the United States. It operates in two segments, Digital Banking and Payment Services. The Digital Banking segment offers Discover-branded credit cards to individuals; and other consumer products and services, including private student loans, personal loans, home loans, and other consumer lending, as well as deposit products, such as certificates of deposit, money market accounts, IRA certificates of deposit, IRA savings accounts, checking accounts, and sweep accounts. The Payment Services segment operates the PULSE network, an automated teller machine, debit, and electronic funds transfer network; Diners Club International, a payments network that issues Diners Club branded charge cards and/or provides card acceptance services; and Discover Network that processes transactions for Discover-branded credit and debit cards, as well as provides payment transaction processing and settlement services. The company was incorporated in 1960 and is based in Riverwoods, Illinois.",
    "website": "http://www.discover.com",
    "zipcode": "60015"
  },
  "ECDD": {
    "city": "Stuart",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "Ecrid, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "ECRID INC",
    "state": "FL",
    "summary": "Ecrid, Inc. offers services in the credit repair industry. It provides up to date credit report services to lenders through its credit monitoring software. The company was formerly known as dPollution International Inc. Ecrid, Inc. was incorporated in 2010 and is based in Stuart, Florida.",
    "website": "http://www.ecrid.com",
    "zipcode": "34994"
  },
  "ECN.TO": {
    "city": "West Palm Beach",
    "country": "United States",
    "currency": "CAD",
    "exchange": "TOR",
    "industry": "Credit Services",
    "long_name": "ECN Capital Corp.",
    "market": "ca_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "ECN CAPITAL CORP",
    "state": "FL",
    "summary": "ECN Capital Corp. originates, manages, and advises on prime consumer credit portfolios primarily in the United States. The company operates through Service Finance-Home Improvement Loans; KG  Co-Branded Credit Cards and Related Financial Products; and Triad Financial Services - Manufactured Home Loans segments. It provides prime credit portfolio solutions that include unsecured consumer loan portfolios, including home improvement loans; secured consumer loan portfolios, such as manufactured home loans; and consumer credit card portfolios focused on co-branded credit cards and related financial products. The company serves banks, credit unions, life insurance companies, and investment funds. ECN Capital Corp. was incorporated in 2016 and is headquartered in Toronto, Canada.",
    "website": "http://www.ecncapitalcorp.com",
    "zipcode": "33401"
  },
  "ECNCF": {
    "city": "West Palm Beach",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "ECN Capital Corp.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "ECN CAPITAL CORP",
    "state": "FL",
    "summary": "ECN Capital Corp. originates, manages, and advises on prime consumer credit portfolios primarily in the United States. The company operates through Service Finance-Home Improvement Loans; KG  Co-Branded Credit Cards and Related Financial Products; and Triad Financial Services - Manufactured Home Loans segments. It provides prime credit portfolio solutions that include unsecured consumer loan portfolios, including home improvement loans; secured consumer loan portfolios, such as manufactured home loans; and consumer credit card portfolios focused on co-branded credit cards and related financial products. The company serves banks, credit unions, life insurance companies, and investment funds. ECN Capital Corp. was incorporated in 2016 and is headquartered in Toronto, Canada.",
    "website": "http://www.ecncapitalcorp.com",
    "zipcode": "33401"
  },
  "ELVT": {
    "city": "Fort Worth",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Elevate Credit, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "Elevate Credit, Inc.",
    "state": "TX",
    "summary": "Elevate Credit, Inc. provides online credit solutions to non-prime consumers in the United States. It offers unsecured online installment loans, lines of credit, and credit cards. Its products include Rise, an installment loan product; Elastic, a line of credit product; and Today Card, a credit card product. The company was founded in 2014 and is headquartered in Fort Worth, Texas.",
    "website": "http://www.elevate.com",
    "zipcode": "76109"
  },
  "ENVA": {
    "city": "Chicago",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Enova International, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "Enova International, Inc.",
    "state": "IL",
    "summary": "Enova International, Inc., a technology and analytics company, provides online financial services in the United States, Brazil, Australia, and Canada. The company offers installment loans; line of credit accounts; receivables purchase agreements; income share agreements; CSO programs, including arranging loans with independent third-party lenders and assisting in the preparation of loan applications and loan documents; and bank programs, such as marketing services and loan servicing for near-prime unsecured consumer installment loan. It also provides Enova Decisions, an analytics as a service designed to automate or augment customer decisions, which include credit risk, fraud risk, identity verification, customer profitability, payments, and collection. The company markets its financing products under the CashNetUSA, NetCredit, OnDeck, Headway Capital, The Business Backer, and Simplic names. Enova International, Inc. was incorporated in 2011 and is headquartered in Chicago, Illinois.",
    "website": "http://www.enova.com",
    "zipcode": "60604"
  },
  "EPOR": {
    "city": "Austin",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "Epic Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "EPIC CORPORATION COLO",
    "state": "TX",
    "summary": "Epic Corp. provides financing services to development and growth companies. The company focuses on the corporate, business, and financial development of subsidiaries, affiliates, and joint ventures. It offers individual investors and their retirement plans with short and long term high yield investments in outside-the-box private trading companies. Epic Corp. was formerly known as Tensleep Corp. and changed its name to Epic Corp. in September 2007. The company was founded in 1997 and is based in Austin, Texas. Epic Corp. is a former subsidiary of R Tucker & Associate, Inc.",
    "website": "http://www.epiccor.com",
    "zipcode": "78739"
  },
  "EQUI": {
    "city": "Spring Lake",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "EquiFin, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "EQUIFIN INC",
    "state": "NJ",
    "summary": "EquiFin, Inc. provides structured credit to small and mid-sized business enterprises in the form of accounts receivable funding and senior secured loans in the United States. Its financial instruments include time deposits, factored receivables and loans, notes receivables, and long-term debts. The company was founded in 1984 and is based in Spring Lake, New Jersey.",
    "website": null,
    "zipcode": "07762"
  },
  "EZ2A.F": {
    "city": "Austin",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "EZCORP, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "EZCORP INC. A  DL-,01",
    "state": "TX",
    "summary": "EZCORP, Inc. provides pawn loans in the United States and Latin America. The company offers pawn loans, which are non-recourse loans collateralized by tangible personal property, including jewelry, consumer electronics, tools, sporting goods, and musical instruments; and sells merchandise, such as collateral forfeited from pawn lending operations and used merchandise purchased from customers. It also provides payday and installment loan products through its financial services stores. In addition, the company offers Lana, a web-based engagement platform to manage pawn loans. As of September 30, 2020, the company owned and operated 505 pawn stores in the United States; 368 pawn stores in Mexico; and 132 pawn stores in Guatemala, El Salvador, Honduras, and Peru. EZCORP, Inc. was founded in 1989 and is headquartered in Austin, Texas.",
    "website": "http://www.ezcorp.com",
    "zipcode": "78746"
  },
  "EZPW": {
    "city": "Austin",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Credit Services",
    "long_name": "EZCORP, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "EZCORP, Inc.",
    "state": "TX",
    "summary": "EZCORP, Inc. provides pawn loans in the United States and Latin America. The company offers pawn loans, which are non-recourse loans collateralized by tangible personal property, including jewelry, consumer electronics, tools, sporting goods, and musical instruments; and sells merchandise, such as collateral forfeited from pawn lending operations and used merchandise purchased from customers. It also provides payday and installment loan products through its financial services stores. In addition, the company offers Lana, a web-based engagement platform to manage pawn loans. As of September 30, 2020, the company owned and operated 505 pawn stores in the United States; 368 pawn stores in Mexico; and 132 pawn stores in Guatemala, El Salvador, Honduras, and Peru. EZCORP, Inc. was founded in 1989 and is headquartered in Austin, Texas.",
    "website": "http://www.ezcorp.com",
    "zipcode": "78746"
  },
  "FAVO": {
    "city": "Garden City",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "FAVO Capital, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "FAVO CAPITAL INC",
    "state": "NY",
    "summary": "FAVO Capital, Inc., a direct funding company, provides customized and short-term funding to small and mid-sized businesses in the United States. It offers equipment financing, small business administration loans, business term loans, merchant cash advances, invoice financing, business line of credit, and commercial mortgage. The company also invests in commercial real estate properties, as well as offers real estate funding options. The company was formerly known as Favo Realty, Inc. and changed its name to FAVO Capital, Inc. in March 2021. FAVO Capital, Inc. is based in Garden City, New York.",
    "website": "http://www.favocap.com",
    "zipcode": "11530"
  },
  "FC8.F": {
    "city": "Las Vegas",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "Consumer Portfolio Services, Inc.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "CONSUMER PORTF. SVCS",
    "state": "NV",
    "summary": "Consumer Portfolio Services, Inc. operates as a specialty finance company in the United States. It purchases and services retail automobile contracts originated by franchised automobile dealers and select independent dealers in the sale of new and used automobiles, light trucks, and passenger vans. The company, through its automobile contract purchases, offers indirect financing to the customers of dealers with limited credit histories or past credit problems. It serves as an alternative source of financing for dealers, facilitating sales to customers who might not be able to obtain financing from commercial banks, credit unions, and the captive finance companies. The company also acquires installment purchase contracts in four merger and acquisition transactions; and offers financing directly to sub-prime consumers to facilitate their purchase of a new or used automobile, light truck, or passenger van. The company services its automobile contracts through its branches in California, Nevada, Virginia, Florida, and Illinois. Consumer Portfolio Services, Inc. was founded in 1991 and is based in Las Vegas, Nevada.",
    "website": "http://www.consumerportfolio.com",
    "zipcode": "89169"
  },
  "FCFS": {
    "city": "Fort Worth",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Credit Services",
    "long_name": "FirstCash, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "FirstCash, Inc.",
    "state": "TX",
    "summary": "FirstCash, Inc., together with its subsidiaries, operates retail pawn stores in the United States and Latin America. Its pawn stores lend money on the collateral of pledged personal property, including jewelry, electronics, tools, appliances, sporting goods, and musical instruments; and retails merchandise acquired through collateral forfeitures on forfeited pawn loans and over-the-counter purchases of merchandise directly from customers. The company is also involved in melting scrap jewelry, as well as sells gold, silver, and diamonds in commodity markets. As of December 31, 2020, it operated 1,046 stores in the United States and the District of Columbia; 1,616 stores in Mexico; 59 stores in Guatemala; 13 stores in El Salvador; and 14 stores in Colombia. The company was formerly known as First Cash Financial Services, Inc. and changed its name to FirstCash, Inc. in September 2016. FirstCash, Inc. was founded in 1988 and is headquartered in Fort Worth, Texas.",
    "website": "http://www.firstcash.com",
    "zipcode": "76102"
  },
  "FCFS.MX": {
    "city": "Fort Worth",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Credit Services",
    "long_name": "FirstCash, Inc.",
    "market": "mx_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "FIRSTCASH INC",
    "state": "TX",
    "summary": "FirstCash, Inc., together with its subsidiaries, operates retail pawn stores in the United States and Latin America. Its pawn stores lend money on the collateral of pledged personal property, including jewelry, electronics, tools, appliances, sporting goods, and musical instruments; and retails merchandise acquired through collateral forfeitures on forfeited pawn loans and over-the-counter purchases of merchandise directly from customers. The company is also involved in melting scrap jewelry, as well as sells gold, silver, and diamonds in commodity markets. As of December 31, 2020, it operated 1,046 stores in the United States and the District of Columbia; 1,616 stores in Mexico; 59 stores in Guatemala; 13 stores in El Salvador; and 14 stores in Colombia. The company was formerly known as First Cash Financial Services, Inc. and changed its name to FirstCash, Inc. in September 2016. FirstCash, Inc. was founded in 1988 and is headquartered in Fort Worth, Texas.",
    "website": "http://www.firstcash.com",
    "zipcode": "76102"
  },
  "FDTC": {
    "city": "Jacksonville",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "FNDS3000 Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "FNDS3000 CORP",
    "state": "FL",
    "summary": "FNDS3000 Corp. provides prepaid debit card solutions in South Africa. The company's payment processing platform supports payroll, insurance, medical aid, gift card and corporate incentives, prepaid cellular charges, and small-scale international funds transfer. Its products include microfinance cards; payroll cards for wages and salaries; and other prepaid cards. The company was formerly known as FundsTech Corp. and changed its name to FNDS3000 Corp. in March 2008. FNDS3000 Corp. was founded in 2006 and is based in Jacksonville, Florida.",
    "website": "http://www.fnds3000.com",
    "zipcode": "32256"
  },
  "FF6.F": {
    "city": "Fort Worth",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "FirstCash, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "FIRSTCASH INC.  DL-,01",
    "state": "TX",
    "summary": "FirstCash, Inc., together with its subsidiaries, operates retail pawn stores in the United States and Latin America. Its pawn stores lend money on the collateral of pledged personal property, including jewelry, electronics, tools, appliances, sporting goods, and musical instruments; and retails merchandise acquired through collateral forfeitures on forfeited pawn loans and over-the-counter purchases of merchandise directly from customers. The company is also involved in melting scrap jewelry, as well as sells gold, silver, and diamonds in commodity markets. As of December 31, 2020, it operated 1,046 stores in the United States and the District of Columbia; 1,616 stores in Mexico; 59 stores in Guatemala; 13 stores in El Salvador; and 14 stores in Colombia. The company was formerly known as First Cash Financial Services, Inc. and changed its name to FirstCash, Inc. in September 2016. FirstCash, Inc. was founded in 1988 and is headquartered in Fort Worth, Texas.",
    "website": "http://www.firstcash.com",
    "zipcode": "76102"
  },
  "FFC.F": {
    "city": "Los Angeles",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "Oaktree Specialty Lending Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "OAKTREE SPEC.LEND. DL-,01",
    "state": "CA",
    "summary": "Oaktree Specialty Lending Corporation is a business development company specializing in investments in middle market, bridge financing, first and second lien debt financing, mezzanine debt, senior and junior secured debt, expansions, sponsor-led acquisitions, and management buyouts in small and mid-sized companies. The fund seeks to invest in education services, business services, retail and consumer, healthcare, manufacturing, food and restaurants, construction and engineering, and media and advertising sectors. It invests between $5 million to $75 million principally in the form of one-stop, first lien, and second lien debt investments, which may include an equity co-investment component in companies with enterprise value between $20 million and $150 million and EBITDA between $3 million and $50 million. The fund has a hold size of up to $75 million and may underwrite transactions up to $100 million. It primarily invests in North America. The fund seeks to be a lead investor in its portfolio companies.",
    "website": "http://www.oaktreespecialtylending.com",
    "zipcode": "90071"
  },
  "FLXP": {
    "city": "Tampa",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "Flex-Power Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "FLEXPOWER INC",
    "state": "FL",
    "summary": "Flex-Power Inc., a financial services company, through its subsidiaries, provides discreet secured collateralized lending services. Its IntelliCash platform offers asset lending services to small business owners, entrepreneurs, and high-net-worth individuals allowing liquidity against personal assets, such as jewelry, luxury watches, luxury cars, fine art, and antiques. The company is based in Tampa, Florida.",
    "website": "http://www.flexpowerinc.com",
    "zipcode": "33606"
  },
  "FOA": {
    "city": "Irving",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Finance Of America Companies Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "Finance of America Companies In",
    "state": "TX",
    "summary": "Finance of America Companies Inc. operates a consumer lending platform in the United States. The company provides residential mortgages, reverse mortgages, and loans to residential real estate investors distributed across retail, third party network, and digital channels. It also offers complementary lending services to enhance the customer experience, as well as capital markets and portfolio management services to optimize distribution to investors. The company is headquartered in Irving, Texas.",
    "website": "http://www.financeofamerica.com",
    "zipcode": "75039"
  },
  "FRNV": {
    "city": "Poway",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "Frontera Investment, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "FRONTERA INVESTMENT INC",
    "state": "CA",
    "summary": "Frontera Investment, Inc. provides various financial services to the un-banked and under-banked financial services customers. The company offers check cashing services, including payroll, tax checks, government checks, insurance drafts, cashier's checks, business checks, and other check cashing services; payday loans, cash advances, and payday advances; auto title, car title, and pink slip loans; gold buying and selling; pawn loans; money transfer services as an agent for Western Union; bill pay services; and money orders as an agent. It also provides currency exchange, international faxing, prepaid cellular, notary, and lottery services; and phone cards, post office boxes, stamps and copies, and photo membership cards. As of September 30, 2014, the company operated 13 full service stores, including 12 stores located in California and 1 store in Florida. Frontera Investment, Inc. is based in Poway, California.",
    "website": "http://www.fronteracashandloan.com",
    "zipcode": "92064"
  },
  "GAFL": {
    "city": "Norristown",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "Great American Financial Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "GREAT AMERICAN FINANCIAL CORP",
    "state": "PA",
    "summary": "Great American Financial Corporation does not have significant operations. The company intends to be a holding company to invest in and building a network of operating subsidiaries that are engaged in different businesses. Previously, it operated in the gaming industry. The company operated in traditional pari-mutuel wagering on horse and dog racing, casino and riverboat gambling, lotteries, charitable organization gambling, and sports book. It offered services through Internet, Intranet, telecommunications, and broadband video. The company also provided licensing and royalties on its products, advertising services from its portal Websites, and Internet related business-to-business development and design services. Great American Financial was incorporated as Interactive Gaming and Communications Corporation in 1986 and is based in Norristown, Pennsylvania.",
    "website": null,
    "zipcode": "19401-4931"
  },
  "GDOT": {
    "city": "Pasadena",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Green Dot Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "Green Dot Corporation",
    "state": "CA",
    "summary": "Green Dot Corporation operates as a financial technology and bank holding company in the United States. It operates in two segments, Account Services, and Processing and Settlement Services. The company offers deposit account programs, such network-branded reloadable prepaid debit cards under the consumer brand names of General Purpose Reloadable cards, consumer and small business checking accounts, network-branded gift cards, secured credit cards, and payroll debit cards. It also provides money processing services, including cash transfer services that help consumers to add funds directly to an account at the point-of-sale at any participating retailer; and simply paid disbursement services that enable wages and authorized funds disbursement to deposit account programs and accounts issued by any third-party bank or program manager. In addition, the company offers tax processing services that include tax refund transfers, which provide the processing technology to facilitate receipt of a taxpayers' refund proceeds; small business lending to independent tax preparation providers that seek small advances; and fast cash advance, a consumer-friendly loan that enables tax refund recipients. It markets its products under the Green Dot, GoBank, MoneyPak, TPG, and other brands. Green Dot Corporation markets and sells its products and services through retail stores; mobile applications; and various direct-to-consumer channels, such as online search engine optimization, online displays, direct mail campaigns, mobile advertising, and affiliate referral programs, as well as distributes through Banking as a Service' platform. The company was formerly known as Next Estate Communications, Inc. and changed its name to Green Dot Corporation in October 2005. Green Dot Corporation was incorporated in 1999 and is based in Pasadena, California.",
    "website": "http://www.greendot.com",
    "zipcode": "91107"
  },
  "GMZ.F": {
    "city": "Detroit",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "Ally Financial Inc.",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "ALLY FINANCIAL INC.DL-,10",
    "state": "MI",
    "summary": "Ally Financial Inc., a bank holding company, provides various digital financial products and services to consumer, commercial, and corporate customers primarily in the United States and Canada. It operates through four segments: Automotive Finance Operations, Insurance Operations, Mortgage Finance Operations, and Corporate Finance Operations. The Automotive Finance Operations segment offers automotive financing services, including providing retail installment sales contracts, loans and operating leases, term loans, financing dealer floorplans, warehouse lines to automotive retailers, and fleet financing. It also provides financing services to companies and municipalities for the purchase or lease of vehicles, and vehicle-remarketing services. The Insurance Operations segment offers consumer finance protection and insurance products through the automotive dealer channel, and commercial insurance products directly to dealers. This segment provides vehicle service and maintenance contract, and guaranteed asset protection products; and underwrites commercial insurance coverages, which primarily insure dealers' vehicle inventory. The Mortgage Finance Operations segment manages held-for-investment consumer mortgage loan portfolio that includes bulk purchases of jumbo and low-to-moderate income mortgage loans originated by third parties, as well as direct-to-consumer mortgage offerings. The Corporate Finance Operations segment provides senior secured leveraged cash flow and asset-based loans to middle market companies; leveraged loans; and commercial real estate product to serve companies in the healthcare industry. The company, through its subsidiary, Ally Bank, also offers commercial banking products and services. In addition, it provides securities brokerage and investment advisory services. The company was formerly known as GMAC Inc. and changed its name to Ally Financial Inc. in May 2010. Ally Financial Inc. was founded in 1919 and is based in Detroit, Michigan.",
    "website": "http://www.ally.com",
    "zipcode": "48226"
  },
  "GSBD": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Goldman Sachs BDC, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "Goldman Sachs BDC, Inc.",
    "state": "NY",
    "summary": "Goldman Sachs BDC, Inc. is a business development company specializing in middle market and mezzanine investment in private companies. It seeks to make capital appreciation through direct originations of secured debt, senior secured debt, junior secured debt, including first lien, first lien/last-out unitranche and second lien debt, unsecured debt, including mezzanine debt and, to a lesser extent, investments in equities. The fund primarily invests in United States. It seeks to invest between $10 million and $75 million in companies with EBITDA between $5 million and $75 million annually.",
    "website": "http://www.goldmansachsbdc.com/content/gsam/us/en/bdc/homepage.html",
    "zipcode": "10282"
  },
  "HXPR": {
    "city": "Los Angeles",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "Hispanic Express, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "HISPANIC EXPRESS INC",
    "state": "CA",
    "summary": "Hispanic Express, Inc. operates in two segments Consumer Financial Business (CFB) and Travel Business (TB). CFB includes the small loan portfolio, travel finance portfolio and insurance, and other products provided to customers. In CFB the company acts as an intermediary for an independent insurance carrier that sells credit life and credit accident and health insurance to its customers. TB comprises the retail travel stores and travel Internet business. This segment sells discount airline tickets to Hispanics residing in the United States who travel to Latin America. The company's customers typically have been between the ages of 21 and 45, earn less than $25,000 per year, have little or no savings, and have limited or short-term employment histories. The majority of the company's business is focused in Southern California.",
    "website": null,
    "zipcode": "90054"
  },
  "KYNC": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "KYN Capital Group, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "KYN CAPITAL GROUP INC",
    "state": "NY",
    "summary": "KYN Capital Group, Inc. operates as a capital finance leasing company. It provides capital-finance-leasing services for cars and trucks, construction equipment and tools, and earth moving equipment. The company was formerly known as New Taohuayuan Culture Tourism Co., Ltd. and changed its name to KYN Capital Group, Inc. in April 2015. KYN Capital Group, Inc. was founded in 1997 and is headquartered in New York, New York.",
    "website": "http://kyncapitalgroup.com",
    "zipcode": "10017"
  },
  "LC": {
    "city": "San Francisco",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "LendingClub Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "LendingClub Corporation",
    "state": "CA",
    "summary": "LendingClub Corporation, operates as a bank holding company for LendingClub Bank, National Association that provides range of financial products and services through a technology-driven platform in the United States. The company provides commercial and industrial, commercial real estate, small business, and equipment loans, as well as leases equipment; and unsecured personal and auto, patient finance, and education finance loans. It also operates an online lending marketplace platform that connects borrowers and investors. The company was incorporated in 2006 and is headquartered in San Francisco, California.",
    "website": "http://www.lendingclub.com",
    "zipcode": "94105"
  },
  "LID.F": {
    "city": "Columbus",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "Alliance Data Systems Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "ALLIANCE DATA SYS. DL-,01",
    "state": "OH",
    "summary": "Alliance Data Systems Corporation provides data-driven marketing, loyalty, and payment solutions in the United States, Canada, Europe, the Middle East, Africa, the Asia Pacific, and internationally. It operates through two segments, LoyaltyOne and Card Services. The LoyaltyOne segment offers AIR MILES reward program; short term loyalty program; and loyalty services, which include loyalty consulting, customer analytics, creative services, and mobile solutions. The Card Services segment provides receivable financing services comprising underwriting and risk management, as well as receivables funding services, including comenity card, private label and co-brand credit card programs, and installment lending; processing services, such as new account processing, bill processing, remittance processing, and customer care; marketing services; and digital offerings, including Bread digital payments platform and enhanced digital suite. It serves clients across various end-markets, including financial services, specialty retail, grocery and drugstore chains, petroleum retail, home furnishing and hardware, beauty and jewelry, hospitality and travel, and telecommunications. Alliance Data Systems Corporation was founded in 1996 and is headquartered in Columbus, Ohio.",
    "website": "http://www.alliancedata.com",
    "zipcode": "43219"
  },
  "LID.SG": {
    "city": "Columbus",
    "country": "United States",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Credit Services",
    "long_name": "Alliance Data Systems Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "ALLIANCE DATA SYSTEMS CORP. Reg",
    "state": "OH",
    "summary": "Alliance Data Systems Corporation provides data-driven marketing, loyalty, and payment solutions in the United States, Canada, Europe, the Middle East, Africa, the Asia Pacific, and internationally. It operates through two segments, LoyaltyOne and Card Services. The LoyaltyOne segment offers AIR MILES reward program; short term loyalty program; and loyalty services, which include loyalty consulting, customer analytics, creative services, and mobile solutions. The Card Services segment provides receivable financing services comprising underwriting and risk management, as well as receivables funding services, including comenity card, private label and co-brand credit card programs, and installment lending; processing services, such as new account processing, bill processing, remittance processing, and customer care; marketing services; and digital offerings, including Bread digital payments platform and enhanced digital suite. It serves clients across various end-markets, including financial services, specialty retail, grocery and drugstore chains, petroleum retail, home furnishing and hardware, beauty and jewelry, hospitality and travel, and telecommunications. Alliance Data Systems Corporation was founded in 1996 and is headquartered in Columbus, Ohio.",
    "website": "http://www.alliancedata.com",
    "zipcode": "43219"
  },
  "LPRO": {
    "city": "Austin",
    "country": "United States",
    "currency": "USD",
    "exchange": "NGM",
    "industry": "Credit Services",
    "long_name": "Open Lending Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "Open Lending Corporation",
    "state": "TX",
    "summary": "Open Lending Corporation provides lending enablement and risk analytics solutions to credit unions, regional banks, and captive finance companies of original equipment manufacturers in the United States. It offers Lenders Protection Program (LPP), which is a Software as a Service platform that facilitates loan decision making and automated underwriting by third-party lenders and the issuance of credit default insurance through third-party insurance providers. The company's LPP products include loan analytics, risk-based loan pricing, risk modeling, and automated decision technology for automotive lenders. Open Lending Corporation was founded in 2000 and is based in Austin, Texas.",
    "website": "http://www.openlending.com",
    "zipcode": "78746"
  },
  "M4I.DE": {
    "city": "Purchase",
    "country": "United States",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Credit Services",
    "long_name": "Mastercard Incorporated",
    "market": "de_market",
    "market_cap": "Mega Cap",
    "sector": "Financial Services",
    "short_name": "MASTERCARD INC.A DL-,0001",
    "state": "NY",
    "summary": "Mastercard Incorporated, a technology company, provides transaction processing and other payment-related products and services in the United States and internationally. It facilitates the processing of payment transactions, including authorization, clearing, and settlement, as well as delivers related products and services. The company offers integrated products and services for account holders, merchants, financial institutions, businesses, governments, and other organizations, such as programs that enable issuers to provide consumers with credits to defer payments; payment products and solutions that allow its customers to access funds in deposit and other accounts; prepaid payment programs and management services; and commercial credit and debit payment products and solutions. It also provides value-added products and services comprising cyber and intelligence products, information and analytics services, consulting services, loyalty and reward programs, processing and open banking services, and issuer and acquirer processing services. The company offers payment solutions and services under the MasterCard, Maestro, and Cirrus brands. Mastercard Incorporated was founded in 1966 and is headquartered in Purchase, New York.",
    "website": "http://www.mastercard.com",
    "zipcode": "10577"
  },
  "M4I.F": {
    "city": "Purchase",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "Mastercard Incorporated",
    "market": "dr_market",
    "market_cap": "Mega Cap",
    "sector": "Financial Services",
    "short_name": "MASTERCARD INC.A DL-,0001",
    "state": "NY",
    "summary": "Mastercard Incorporated, a technology company, provides transaction processing and other payment-related products and services in the United States and internationally. It facilitates the processing of payment transactions, including authorization, clearing, and settlement, as well as delivers related products and services. The company offers integrated products and services for account holders, merchants, financial institutions, businesses, governments, and other organizations, such as programs that enable issuers to provide consumers with credits to defer payments; payment products and solutions that allow its customers to access funds in deposit and other accounts; prepaid payment programs and management services; and commercial credit and debit payment products and solutions. It also provides value-added products and services comprising cyber and intelligence products, information and analytics services, consulting services, loyalty and reward programs, processing and open banking services, and issuer and acquirer processing services. The company offers payment solutions and services under the MasterCard, Maestro, and Cirrus brands. Mastercard Incorporated was founded in 1966 and is headquartered in Purchase, New York.",
    "website": "http://www.mastercard.com",
    "zipcode": "10577"
  },
  "MA": {
    "city": "Purchase",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Mastercard Incorporated",
    "market": "us_market",
    "market_cap": "Mega Cap",
    "sector": "Financial Services",
    "short_name": "Mastercard Incorporated",
    "state": "NY",
    "summary": "Mastercard Incorporated, a technology company, provides transaction processing and other payment-related products and services in the United States and internationally. It facilitates the processing of payment transactions, including authorization, clearing, and settlement, as well as delivers related products and services. The company offers integrated products and services for account holders, merchants, financial institutions, businesses, governments, and other organizations, such as programs that enable issuers to provide consumers with credits to defer payments; payment products and solutions that allow its customers to access funds in deposit and other accounts; prepaid payment programs and management services; and commercial credit and debit payment products and solutions. It also provides value-added products and services comprising cyber and intelligence products, information and analytics services, consulting services, loyalty and reward programs, processing and open banking services, and issuer and acquirer processing services. The company offers payment solutions and services under the MasterCard, Maestro, and Cirrus brands. Mastercard Incorporated was founded in 1966 and is headquartered in Purchase, New York.",
    "website": "http://www.mastercard.com",
    "zipcode": "10577"
  },
  "MA.BA": {
    "city": "Purchase",
    "country": "United States",
    "currency": "ARS",
    "exchange": "BUE",
    "industry": "Credit Services",
    "long_name": "Mastercard Incorporated",
    "market": "ar_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "MASTERCARD INCORPO",
    "state": "NY",
    "summary": "Mastercard Incorporated, a technology company, provides transaction processing and other payment-related products and services in the United States and internationally. It facilitates the processing of payment transactions, including authorization, clearing, and settlement, as well as delivers related products and services. The company offers integrated products and services for account holders, merchants, financial institutions, businesses, governments, and other organizations, such as programs that enable issuers to provide consumers with credits to defer payments; payment products and solutions that allow its customers to access funds in deposit and other accounts; prepaid payment programs and management services; and commercial credit and debit payment products and solutions. It also provides value-added products and services comprising cyber and intelligence products, information and analytics services, consulting services, loyalty and reward programs, processing and open banking services, and issuer and acquirer processing services. The company offers payment solutions and services under the MasterCard, Maestro, and Cirrus brands. Mastercard Incorporated was founded in 1966 and is headquartered in Purchase, New York.",
    "website": "http://www.mastercard.com",
    "zipcode": "10577"
  },
  "MA.MX": {
    "city": "Purchase",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Credit Services",
    "long_name": "Mastercard Incorporated",
    "market": "mx_market",
    "market_cap": "Mega Cap",
    "sector": "Financial Services",
    "short_name": "MASTERCARD INCORPORATED",
    "state": "NY",
    "summary": "Mastercard Incorporated, a technology company, provides transaction processing and other payment-related products and services in the United States and internationally. It facilitates the processing of payment transactions, including authorization, clearing, and settlement, as well as delivers related products and services. The company offers integrated products and services for account holders, merchants, financial institutions, businesses, governments, and other organizations, such as programs that enable issuers to provide consumers with credits to defer payments; payment products and solutions that allow its customers to access funds in deposit and other accounts; prepaid payment programs and management services; and commercial credit and debit payment products and solutions. It also provides value-added products and services comprising cyber and intelligence products, information and analytics services, consulting services, loyalty and reward programs, processing and open banking services, and issuer and acquirer processing services. The company offers payment solutions and services under the MasterCard, Maestro, and Cirrus brands. Mastercard Incorporated was founded in 1966 and is headquartered in Purchase, New York.",
    "website": "http://www.mastercard.com",
    "zipcode": "10577"
  },
  "MAST.VI": {
    "city": "Purchase",
    "country": "United States",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Credit Services",
    "long_name": "Mastercard Incorporated",
    "market": "at_market",
    "market_cap": "Mega Cap",
    "sector": "Financial Services",
    "short_name": "MASTERCARD INC",
    "state": "NY",
    "summary": "Mastercard Incorporated, a technology company, provides transaction processing and other payment-related products and services in the United States and internationally. It facilitates the processing of payment transactions, including authorization, clearing, and settlement, as well as delivers related products and services. The company offers integrated products and services for account holders, merchants, financial institutions, businesses, governments, and other organizations, such as programs that enable issuers to provide consumers with credits to defer payments; payment products and solutions that allow its customers to access funds in deposit and other accounts; prepaid payment programs and management services; and commercial credit and debit payment products and solutions. It also provides value-added products and services comprising cyber and intelligence products, information and analytics services, consulting services, loyalty and reward programs, processing and open banking services, and issuer and acquirer processing services. The company offers payment solutions and services under the MasterCard, Maestro, and Cirrus brands. Mastercard Incorporated was founded in 1966 and is headquartered in Purchase, New York.",
    "website": "http://www.mastercard.com",
    "zipcode": "10577"
  },
  "MBM.F": {
    "city": "Mount Laurel",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "Marlin Business Services Corp.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "MARLIN BUSINESS  DL-,01",
    "state": "NJ",
    "summary": "Marlin Business Services Corp. provides credit products and services to small and mid-sized businesses in the United States. The company's products and services include loans and leases for the acquisition of commercial equipment and working capital loans. It offers lease finance to approximately 100 categories of equipment. As of December 31, 2020, the company had a portfolio of approximately 80,000 equipment finance leases and loans. It also offers reinsurance services; and operates a commercial bank that issues certificates of deposit and money market deposit accounts. The company provides its solutions through a network of independent commercial equipment dealers and national account programs, as well as through direct solicitation and relationships with select lease and loan brokers. Marlin Business Services Corp. was founded in 1997 and is based in Mount Laurel, New Jersey.",
    "website": "http://marlincapitalsolutions.com",
    "zipcode": "08054"
  },
  "MD5.F": {
    "city": "New York",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "Medallion Financial Corp.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "MEDALLION FINL  DL-,01",
    "state": "NY",
    "summary": "Medallion Financial Corp., together with its subsidiaries, operates as a finance company in the United States. It originates, acquires, and services loans that finance taxi medallions and various types of commercial businesses. The company offers consumer loans for the purchase of recreational vehicles, boats, motorcycles, and trailers, as well as to finance home improvements; commercial loans for the purchase of equipment and related assets necessary to open a new business, or purchase or improvement of an existing business; and medallion loans. It also provides debt, mezzanine, and equity investment capital to companies in various industries. In addition, the company raises deposits and conducts other banking activities. Medallion Financial Corp. was founded in 1995 and is headquartered in New York City, New York.",
    "website": "http://www.medallion.com",
    "zipcode": "10022"
  },
  "MFIN": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Credit Services",
    "long_name": "Medallion Financial Corp.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "Medallion Financial Corp.",
    "state": "NY",
    "summary": "Medallion Financial Corp., together with its subsidiaries, operates as a finance company in the United States. It originates, acquires, and services loans that finance taxi medallions and various types of commercial businesses. The company offers consumer loans for the purchase of recreational vehicles, boats, motorcycles, and trailers, as well as to finance home improvements; commercial loans for the purchase of equipment and related assets necessary to open a new business, or purchase or improvement of an existing business; and medallion loans. It also provides debt, mezzanine, and equity investment capital to companies in various industries. In addition, the company raises deposits and conducts other banking activities. Medallion Financial Corp. was founded in 1995 and is headquartered in New York City, New York.",
    "website": "http://www.medallion.com",
    "zipcode": "10022"
  },
  "MGI": {
    "city": "Dallas",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Credit Services",
    "long_name": "MoneyGram International, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "Moneygram International, Inc.",
    "state": "TX",
    "summary": "MoneyGram International, Inc., together with its subsidiaries, provides cross-border peer-to-peer payments and money transfer services in the United States and internationally. The company operates through two segments, Global Funds Transfer and Financial Paper Products. The Global Funds Transfer segment offers money transfer services and bill payment services through third-party agents, including retail chains, independent retailers, post offices, banks, and other financial institutions; and digital solutions, such as moneygram.com, mobile solutions, digital partners, wallets, and account deposit services. The Financial Paper Products segment provides money orders to consumers through its agents and financial institutions under the MoneyGram brand and on a private label or co-branded basis with various agents and financial institutions; and official check outsourcing services for banks and credit unions. MoneyGram International, Inc. was incorporated in 2003 and is based in Dallas, Texas.",
    "website": "http://corporate.moneygram.com",
    "zipcode": "75201"
  },
  "MRLN": {
    "city": "Mount Laurel",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Credit Services",
    "long_name": "Marlin Business Services Corp.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "Marlin Business Services Corp.",
    "state": "NJ",
    "summary": "Marlin Business Services Corp. provides credit products and services to small and mid-sized businesses in the United States. The company's products and services include loans and leases for the acquisition of commercial equipment and working capital loans. It offers lease finance to approximately 100 categories of equipment. As of December 31, 2020, the company had a portfolio of approximately 80,000 equipment finance leases and loans. It also offers reinsurance services; and operates a commercial bank that issues certificates of deposit and money market deposit accounts. The company provides its solutions through a network of independent commercial equipment dealers and national account programs, as well as through direct solicitation and relationships with select lease and loan brokers. Marlin Business Services Corp. was founded in 1997 and is based in Mount Laurel, New Jersey.",
    "website": "http://marlincapitalsolutions.com",
    "zipcode": "08054"
  },
  "MSCD34.SA": {
    "city": "Purchase",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Credit Services",
    "long_name": "Mastercard Incorporated",
    "market": "br_market",
    "market_cap": "Mega Cap",
    "sector": "Financial Services",
    "short_name": "MASTERCARD  DRN",
    "state": "NY",
    "summary": "Mastercard Incorporated, a technology company, provides transaction processing and other payment-related products and services in the United States and internationally. It facilitates the processing of payment transactions, including authorization, clearing, and settlement, as well as delivers related products and services. The company offers integrated products and services for account holders, merchants, financial institutions, businesses, governments, and other organizations, such as programs that enable issuers to provide consumers with credits to defer payments; payment products and solutions that allow its customers to access funds in deposit and other accounts; prepaid payment programs and management services; and commercial credit and debit payment products and solutions. It also provides value-added products and services comprising cyber and intelligence products, information and analytics services, consulting services, loyalty and reward programs, processing and open banking services, and issuer and acquirer processing services. The company offers payment solutions and services under the MasterCard, Maestro, and Cirrus brands. Mastercard Incorporated was founded in 1966 and is headquartered in Purchase, New York.",
    "website": "http://www.mastercard.com",
    "zipcode": "10577"
  },
  "MUTM": {
    "city": "Wilmington",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "Mutual Merchant Services, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "MUTUAL MERCHANT SERVICES INC",
    "state": "DE",
    "summary": "Mutual Merchant Services, Inc. provides various financial products and services for merchants, financial institutions, and banks in the United States. The company offers credit and debit card acceptance, check guarantee, check verification, check conversion, check 21, advance funding, ACH check processing, and prepaid and bill pay services. It also provides point of sale software and terminals; and management services primarily for startup operations, as well as for individuals in the entertainment industry. In addition, the company operates MUTM business education channel for educating and helping small businesses and start up entrepreneurs. The company was formerly known as Sage Global Solutions, Inc. Mutual Merchant Services, Inc. is headquartered in Wilmington, Delaware.",
    "website": "http://mutualmerchantservices.com",
    "zipcode": "19807"
  },
  "NAVI": {
    "city": "Wilmington",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Credit Services",
    "long_name": "Navient Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "Navient Corporation",
    "state": "DE",
    "summary": "Navient Corporation provides education loan management and business processing solutions for education, healthcare, and government clients at the federal, state, and local levels in the United States. It operates through four segments: Federal Education Loans, Consumer Lending, Business Processing, and Other. The company owns Federal Family Education Loan Program loans that are insured or guaranteed by state or not-for-profit agencies; and performs servicing and asset recovery services on its own loan portfolio, and federal education loans owned by the United States Department of Education and other institutions. It also owns, originates, and acquires private education loans; and offers healthcare services that include revenue cycle outsourcing, accounts receivable management, extended business office support, consulting engagement, and public health programs, as well as business processing services to state governments, agencies, court systems, municipalities, and parking and tolling authorities. In addition, the company provides customizable solutions for its clients that include hospitals, hospital systems, medical centers, large physician groups, other healthcare providers, and departments of public health; and corporate liquidity portfolio and debt repurchase services. Navient Corporation was founded in 1973 and is headquartered in Wilmington, Delaware.",
    "website": "http://www.navient.com",
    "zipcode": "19801"
  },
  "NECA": {
    "city": "Las Vegas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "New America Energy Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "NEW AMERICA ENERGY CORP",
    "state": "NV",
    "summary": "New America Energy Corp., through its subsidiary, Title King, LLC, provides short-term high interest loans to consumers through the collateral use of car and truck titles. It offers automobile title loans, as well as other forms of consumer loans, check cashing, money orders, and money transfers. The company was formerly known as Atheron Inc. and changed its name to New America Energy Corp. in November 2010. New America Energy Corp. was founded in 2006 and is headquartered in Las Vegas, Nevada.",
    "website": null,
    "zipcode": "89103"
  },
  "NICK": {
    "city": "Clearwater",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Credit Services",
    "long_name": "Nicholas Financial, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "Nicholas Financial, Inc.",
    "state": "FL",
    "summary": "Nicholas Financial, Inc. operates as a consumer finance company in the United States. The company engages in acquiring and servicing automobile finance installment contracts for the purchase of new and used automobiles and light trucks. It also originates direct consumer loans and sells consumer-finance related products. As of March 31, 2020, the company operated 43 branch offices located in Florida, Georgia, Ohio, Illinois, Indiana, Kentucky, Missouri, North Carolina, Alabama, South Carolina, Tennessee, Michigan, Kansas, Pennsylvania, and Wisconsin. Nicholas Financial, Inc. was founded in 1985 and is headquartered in Clearwater, Florida.",
    "website": "http://www.nicholasfinancial.com",
    "zipcode": "33759"
  },
  "NIJ.F": {
    "city": "Lincoln",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "Nelnet, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "NELNET INC. CL. A  DL-,01",
    "state": "NE",
    "summary": "Nelnet, Inc. engages in loan servicing, communications, and education technology, services, and payment processing businesses worldwide. The company's Loan Servicing and Systems is involved in loan servicing activities, such as loan conversion, application processing, borrower updates, customer service, payment processing, due diligence procedures, funds management reconciliation, and claim processing activities for student loan portfolio and third-party clients. This segment also provides student loan servicing software; business process outsourcing services specialized in contact center management, such as inbound calls, outreach campaigns and sales, and interacting with customers through multi-channels. The Education Technology, Services, and Payment Processing segment offers financial management services; assistance with financial needs assessment; school information system software that automates administrative processes; professional development and educational instruction services; and technology products that aid in teacher and student evaluations. It also offers technology and payments services, including electronic transfer and credit card processing, reporting, billing and invoicing, mobile and virtual terminal solutions, and specialized integrations to business software; and mobile first technology focused on increasing engagement, online giving, and communication for church and not-for-profit customers. Its Communications segment fiber optic service to homes and businesses for internet, television, and telephone services. Its data services include high-speed internet access; and telephone services comprise local and long distance telephone, hostedPBX, and other services. Its Asset Generation and Management segment acquires, manages, and owns loan assets. It also provides investment advisory services. The company was founded in 1978 and is headquartered in Lincoln, Nebraska.",
    "website": "http://www.nelnet.com",
    "zipcode": "68508"
  },
  "NNI": {
    "city": "Lincoln",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Nelnet, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "Nelnet, Inc.",
    "state": "NE",
    "summary": "Nelnet, Inc. engages in loan servicing, communications, and education technology, services, and payment processing businesses worldwide. The company's Loan Servicing and Systems is involved in loan servicing activities, such as loan conversion, application processing, borrower updates, customer service, payment processing, due diligence procedures, funds management reconciliation, and claim processing activities for student loan portfolio and third-party clients. This segment also provides student loan servicing software; business process outsourcing services specialized in contact center management, such as inbound calls, outreach campaigns and sales, and interacting with customers through multi-channels. The Education Technology, Services, and Payment Processing segment offers financial management services; assistance with financial needs assessment; school information system software that automates administrative processes; professional development and educational instruction services; and technology products that aid in teacher and student evaluations. It also offers technology and payments services, including electronic transfer and credit card processing, reporting, billing and invoicing, mobile and virtual terminal solutions, and specialized integrations to business software; and mobile first technology focused on increasing engagement, online giving, and communication for church and not-for-profit customers. Its Communications segment fiber optic service to homes and businesses for internet, television, and telephone services. Its data services include high-speed internet access; and telephone services comprise local and long distance telephone, hostedPBX, and other services. Its Asset Generation and Management segment acquires, manages, and owns loan assets. It also provides investment advisory services. The company was founded in 1978 and is headquartered in Lincoln, Nebraska.",
    "website": "http://www.nelnet.com",
    "zipcode": "68508"
  },
  "OCSL": {
    "city": "Los Angeles",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Credit Services",
    "long_name": "Oaktree Specialty Lending Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "Oaktree Specialty Lending Corpo",
    "state": "CA",
    "summary": "Oaktree Specialty Lending Corporation is a business development company specializing in investments in middle market, bridge financing, first and second lien debt financing, mezzanine debt, senior and junior secured debt, expansions, sponsor-led acquisitions, and management buyouts in small and mid-sized companies. The fund seeks to invest in education services, business services, retail and consumer, healthcare, manufacturing, food and restaurants, construction and engineering, and media and advertising sectors. It invests between $5 million to $75 million principally in the form of one-stop, first lien, and second lien debt investments, which may include an equity co-investment component in companies with enterprise value between $20 million and $150 million and EBITDA between $3 million and $50 million. The fund has a hold size of up to $75 million and may underwrite transactions up to $100 million. It primarily invests in North America. The fund seeks to be a lead investor in its portfolio companies.",
    "website": "http://www.oaktreespecialtylending.com",
    "zipcode": "90071"
  },
  "OMF": {
    "city": "Evansville",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "OneMain Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "OneMain Holdings, Inc.",
    "state": "IN",
    "summary": "OneMain Holdings, Inc., a financial service holding company, engages in the consumer finance and insurance businesses. The company originates, underwrites, and services personal loans secured by automobiles, other titled collateral, or are unsecured. The company also offers credit insurance products comprising life, disability, and involuntary unemployment insurance; optional non-credit insurance; guaranteed asset protection coverage as a waiver product or insurance; and membership plans. It operates through a network of approximately 1,500 branch offices in 44 states in the United States, as well as through its Website onemainfinancial.com. The company was formerly known as Springleaf Holdings, Inc. and changed its name to OneMain Holdings, Inc. in November 2015. OneMain Holdings, Inc. was founded in 1920 and is based in Evansville, Indiana.",
    "website": "http://www.onemainfinancial.com",
    "zipcode": "47708-1013"
  },
  "OPRT": {
    "city": "San Carlos",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Credit Services",
    "long_name": "Oportun Financial Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "Oportun Financial Corporation",
    "state": "CA",
    "summary": "Oportun Financial Corporation provides financial services in the United States. It offers personal loans, auto loans, and credit cards. The company serves customers online and over-the-phone, as well as through retail locations. Oportun Financial Corporation was founded in 2005 and is headquartered in San Carlos, California.",
    "website": "http://www.oportun.com",
    "zipcode": "94070"
  },
  "ORCC": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Owl Rock Capital Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "Owl Rock Capital Corporation",
    "state": "NY",
    "summary": "Owl Rock Capital Corporation is a business development company. The fund makes investments in senior secured or unsecured loans, subordinated loans or mezzanine loans and also considers equity-related securities including warrants and preferred stocks. It seeks to invest in middle market companies based in the United States, with EBITDA between $10 million and $250 million annually and/or annual revenue of $50 million and $2.5 billion at the time of investment.",
    "website": "http://owlrock.com/overview-orcc/",
    "zipcode": "10167"
  },
  "PMTS": {
    "city": "Littleton",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "CPI Card Group Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "CPI CARD GROUP INC",
    "state": "CO",
    "summary": "CPI Card Group Inc., together with its subsidiaries, engages in the design, production, data personalization, packaging, and fulfillment of financial payment cards. It operates through Debit and Credit, and Prepaid Debit segments. The Debit and Credit segment produces financial payment cards and provides integrated card services to card-issuing banks. Its products include EMV and non-EMV financial payment cards and metal cards, as well as private label credit cards. This segment also provides on-demand services and various integrated card services, including card personalization and fulfillment, and instant issuance services. The Prepaid Debit segment primarily offers integrated card services comprising tamper-evident security packaging services to prepaid debit card providers. It also produces financial payment cards issued on the networks of the payment card brands. CPI Card Group Inc. serves issuers of debit and credit cards, Prepaid Debit Card program managers, community banks, credit unions, group service providers, and card transaction processors in the United States. The company was formerly known as CPI Holdings I, Inc. and changed its name to CPI Card Group Inc. in August 2015. CPI Card Group Inc. was founded in 2007 and is based in Littleton, Colorado.",
    "website": "http://www.cpicardgroup.com",
    "zipcode": "80127"
  },
  "PMTS.TO": {
    "city": "Littleton",
    "country": "United States",
    "currency": "CAD",
    "exchange": "TOR",
    "industry": "Credit Services",
    "long_name": "CPI Card Group Inc.",
    "market": "ca_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "CPI CARD GROUP INC",
    "state": "CO",
    "summary": "CPI Card Group Inc., together with its subsidiaries, engages in the design, production, data personalization, packaging, and fulfillment of financial payment cards. It operates through Debit and Credit, and Prepaid Debit segments. The Debit and Credit segment produces financial payment cards and provides integrated card services to card-issuing banks. Its products include EMV and non-EMV financial payment cards and metal cards, as well as private label credit cards. This segment also provides on-demand services and various integrated card services, including card personalization and fulfillment, and instant issuance services. The Prepaid Debit segment primarily offers integrated card services comprising tamper-evident security packaging services to prepaid debit card providers. It also produces financial payment cards issued on the networks of the payment card brands. CPI Card Group Inc. serves issuers of debit and credit cards, Prepaid Debit Card program managers, community banks, credit unions, group service providers, and card transaction processors in the United States. The company was formerly known as CPI Holdings I, Inc. and changed its name to CPI Card Group Inc. in August 2015. CPI Card Group Inc. was founded in 2007 and is based in Littleton, Colorado.",
    "website": "http://www.cpicardgroup.com",
    "zipcode": "80127"
  },
  "POV1.F": {
    "city": "Norfolk",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "PRA Group, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "PRA GROUP INC.  DL-,01",
    "state": "VA",
    "summary": "PRA Group, Inc., a services company, engages in the purchase, collection, and management of portfolios of nonperforming loans in the Americas, Australia, and Europe. It is involved in the purchase of accounts that are primarily the unpaid obligations of individuals owed to credit originators, which include banks and other types of consumer, retail, and auto finance companies. The company also acquires nonperforming loans, including Visa and MasterCard credit cards, private label and other credit cards, installment loans, lines of credit, deficiency balances of various types, legal judgments, and trade payables from banks, credit unions, consumer finance companies, retailers, utilities, automobile finance companies, and other credit originators. In addition, it provides fee-based services on class action claims recoveries and by servicing consumer bankruptcy accounts. The company was formerly known as Portfolio Recovery Associates, Inc. and changed its name to PRA Group, Inc. in October 2014. PRA Group, Inc. was incorporated in 1996 and is headquartered in Norfolk, Virginia.",
    "website": "http://www.pragroup.com",
    "zipcode": "23502"
  },
  "PRAA": {
    "city": "Norfolk",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Credit Services",
    "long_name": "PRA Group, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "PRA Group, Inc.",
    "state": "VA",
    "summary": "PRA Group, Inc., a services company, engages in the purchase, collection, and management of portfolios of nonperforming loans in the Americas, Australia, and Europe. It is involved in the purchase of accounts that are primarily the unpaid obligations of individuals owed to credit originators, which include banks and other types of consumer, retail, and auto finance companies. The company also acquires nonperforming loans, including Visa and MasterCard credit cards, private label and other credit cards, installment loans, lines of credit, deficiency balances of various types, legal judgments, and trade payables from banks, credit unions, consumer finance companies, retailers, utilities, automobile finance companies, and other credit originators. In addition, it provides fee-based services on class action claims recoveries and by servicing consumer bankruptcy accounts. The company was formerly known as Portfolio Recovery Associates, Inc. and changed its name to PRA Group, Inc. in October 2014. PRA Group, Inc. was incorporated in 1996 and is headquartered in Norfolk, Virginia.",
    "website": "http://www.pragroup.com",
    "zipcode": "23502"
  },
  "PYPL": {
    "city": "San Jose",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Credit Services",
    "long_name": "PayPal Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Mega Cap",
    "sector": "Financial Services",
    "short_name": "PayPal Holdings, Inc.",
    "state": "CA",
    "summary": "PayPal Holdings, Inc. operates as a technology platform and digital payments company that enables digital and mobile payments on behalf of consumers and merchants worldwide. Its payment solutions include PayPal, PayPal Credit, Braintree, Venmo, Xoom, Hyperwallet, and iZettle products. The company's payments platform allows consumers to send and receive payments, withdraw funds to their bank accounts, and hold balances in their PayPal accounts in various currencies. It also offers gateway services that enable merchants to accept payments online with credit or debit cards, as well as digital wallets. PayPal Holdings, Inc. was founded in 1998 and is headquartered in San Jose, California.",
    "website": "http://www.paypal.com",
    "zipcode": "95131"
  },
  "PYPL.BA": {
    "city": "San Jose",
    "country": "United States",
    "currency": "ARS",
    "exchange": "BUE",
    "industry": "Credit Services",
    "long_name": "PayPal Holdings, Inc.",
    "market": "ar_market",
    "market_cap": "Mega Cap",
    "sector": "Financial Services",
    "short_name": "PAYPAL HOLDINGS IN",
    "state": "CA",
    "summary": "PayPal Holdings, Inc. operates as a technology platform and digital payments company that enables digital and mobile payments on behalf of consumers and merchants worldwide. Its payment solutions include PayPal, PayPal Credit, Braintree, Venmo, Xoom, Hyperwallet, and iZettle products. The company's payments platform allows consumers to send and receive payments, withdraw funds to their bank accounts, and hold balances in their PayPal accounts in various currencies. It also offers gateway services that enable merchants to accept payments online with credit or debit cards, as well as digital wallets. PayPal Holdings, Inc. was founded in 1998 and is headquartered in San Jose, California.",
    "website": "http://www.paypal.com",
    "zipcode": "95131"
  },
  "PYPL.MX": {
    "city": "San Jose",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Credit Services",
    "long_name": "PayPal Holdings, Inc.",
    "market": "mx_market",
    "market_cap": "Mega Cap",
    "sector": "Financial Services",
    "short_name": "PAYPAL HOLDINGS INC",
    "state": "CA",
    "summary": "PayPal Holdings, Inc. operates as a technology platform and digital payments company that enables digital and mobile payments on behalf of consumers and merchants worldwide. Its payment solutions include PayPal, PayPal Credit, Braintree, Venmo, Xoom, Hyperwallet, and iZettle products. The company's payments platform allows consumers to send and receive payments, withdraw funds to their bank accounts, and hold balances in their PayPal accounts in various currencies. It also offers gateway services that enable merchants to accept payments online with credit or debit cards, as well as digital wallets. PayPal Holdings, Inc. was founded in 1998 and is headquartered in San Jose, California.",
    "website": "http://www.paypal.com",
    "zipcode": "95131"
  },
  "PYPL.VI": {
    "city": "San Jose",
    "country": "United States",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Credit Services",
    "long_name": "PayPal Holdings, Inc.",
    "market": "at_market",
    "market_cap": "Mega Cap",
    "sector": "Financial Services",
    "short_name": "PAYPAL HOLDINGS INC",
    "state": "CA",
    "summary": "PayPal Holdings, Inc. operates as a technology platform and digital payments company that enables digital and mobile payments on behalf of consumers and merchants worldwide. Its payment solutions include PayPal, PayPal Credit, Braintree, Venmo, Xoom, Hyperwallet, and iZettle products. The company's payments platform allows consumers to send and receive payments, withdraw funds to their bank accounts, and hold balances in their PayPal accounts in various currencies. It also offers gateway services that enable merchants to accept payments online with credit or debit cards, as well as digital wallets. PayPal Holdings, Inc. was founded in 1998 and is headquartered in San Jose, California.",
    "website": "http://www.paypal.com",
    "zipcode": "95131"
  },
  "RM": {
    "city": "Greer",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Regional Management Corp.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "Regional Management Corp.",
    "state": "SC",
    "summary": "Regional Management Corp, a diversified consumer finance company, provides various installment loan products primarily to customers with limited access to consumer credit from banks, thrifts, credit card companies, and other lenders. It offers small and large installment loans; retail loans to finance the purchase of furniture, appliances, and other retail products; insurance products, including credit life, credit accident and health, credit property, vehicle single interest, and credit involuntary unemployment insurance; collateral protection insurance; and property insurance, as well as reinsurance products. The company's loans are sourced through branches, direct mail campaigns, digital partners, and retailers, as well as its consumer website. As of April 20, 2021, it operated a network of 366 branches in the Southeastern, Southwestern, Mid-Atlantic, and Midwestern United States. Regional Management Corp. was incorporated in 1987 and is headquartered in Greer, South Carolina.",
    "website": "http://www.regionalmanagement.com",
    "zipcode": "29651"
  },
  "S1YF34.SA": {
    "city": "Stamford",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Credit Services",
    "long_name": "Synchrony Financial",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "SYNCHRONY FIDRN",
    "state": "CT",
    "summary": "Synchrony Financial operates as a consumer financial services company in the United States. It provides a range of specialized financing programs and consumer banking products to digital, retail, home, auto, travel, health, and pet industries. The company also offers private label credit cards, dual cards, general purpose co-branded credit cards, and small and medium-sized business credit products; and promotional financing for consumer purchases, such as private label credit cards, dual cards, and installment loans. In addition, it provides promotional financing to consumers for health, veterinary and personal care procedures, and services and products, such as dental, vision, audiology, and cosmetic; debt cancellation products; and deposit products, including certificates of deposit, individual retirement accounts, money market accounts, and savings accounts to retail and commercial customers, as well as accepts deposits through third-party securities brokerage firms. The company offers its credit products through programs established with a group of national and regional retailers, local merchants, manufacturers, buying groups, industry associations, and healthcare service providers; and deposit products through various channels, such as digital and print. Synchrony Financial was incorporated in 2003 and is headquartered in Stamford, Connecticut.",
    "website": "http://www.synchrony.com",
    "zipcode": "06902"
  },
  "SC": {
    "city": "Dallas",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Santander Consumer USA Holdings Inc.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "Santander Consumer USA Holdings",
    "state": "TX",
    "summary": "Santander Consumer USA Holdings Inc., a specialized consumer finance company, provides vehicle finance and third-party servicing in the United States. It offers vehicle financial products and services, including retail installment contracts and vehicle leases, as well as dealer loans for inventory, construction, real estate, working capital, and revolving lines of credit. The company also provides financial products and services related to recreational and marine vehicles; originates vehicle loans through RoadLoans.com, a web-based direct lending program; purchases vehicle retail installment contracts from other lenders; and services automobile, and recreational and marine vehicle portfolios for other lenders. In addition, it originates private-label loans and leases; and offers personal loans, as well as provides point-of-sale financing. The company was founded in 1995 and is headquartered in Dallas, Texas. Santander Consumer USA Holdings Inc. is a subsidiary of Santander Holdings USA, Inc.",
    "website": "http://www.santanderconsumerusa.com",
    "zipcode": "75201"
  },
  "SEZNL": {
    "city": "Minneapolis",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "Sezzle Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "SEZZLE INC NPV CDI 1:1",
    "state": "MN",
    "summary": "Sezzle Inc. operates as a technology-enabled payments company in United States, Canada, India, and Europe. The company provides a payments platform that facilitates payments between consumers with merchants. Its platform enables customers to make online purchases and split the payment for the purchase in four equal interest free payments over six weeks. The company offers its payment solution to online stores, as well as brick-and-mortar retailers. Sezzle Inc. was incorporated in 2016 and is headquartered in Minneapolis, Minnesota.",
    "website": "http://www.sezzle.com",
    "zipcode": "55401"
  },
  "SFE.DE": {
    "city": "Stamford",
    "country": "United States",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Credit Services",
    "long_name": "Synchrony Financial",
    "market": "de_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "SYNCHRONY FIN.  DL-,001",
    "state": "CT",
    "summary": "Synchrony Financial operates as a consumer financial services company in the United States. It provides a range of specialized financing programs and consumer banking products to digital, retail, home, auto, travel, health, and pet industries. The company also offers private label credit cards, dual cards, general purpose co-branded credit cards, and small and medium-sized business credit products; and promotional financing for consumer purchases, such as private label credit cards, dual cards, and installment loans. In addition, it provides promotional financing to consumers for health, veterinary and personal care procedures, and services and products, such as dental, vision, audiology, and cosmetic; debt cancellation products; and deposit products, including certificates of deposit, individual retirement accounts, money market accounts, and savings accounts to retail and commercial customers, as well as accepts deposits through third-party securities brokerage firms. The company offers its credit products through programs established with a group of national and regional retailers, local merchants, manufacturers, buying groups, industry associations, and healthcare service providers; and deposit products through various channels, such as digital and print. Synchrony Financial was incorporated in 2003 and is headquartered in Stamford, Connecticut.",
    "website": "http://www.synchrony.com",
    "zipcode": "06902"
  },
  "SFE.F": {
    "city": "Stamford",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "Synchrony Financial",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "SYNCHRONY FIN.  DL-,001",
    "state": "CT",
    "summary": "Synchrony Financial operates as a consumer financial services company in the United States. It provides a range of specialized financing programs and consumer banking products to digital, retail, home, auto, travel, health, and pet industries. The company also offers private label credit cards, dual cards, general purpose co-branded credit cards, and small and medium-sized business credit products; and promotional financing for consumer purchases, such as private label credit cards, dual cards, and installment loans. In addition, it provides promotional financing to consumers for health, veterinary and personal care procedures, and services and products, such as dental, vision, audiology, and cosmetic; debt cancellation products; and deposit products, including certificates of deposit, individual retirement accounts, money market accounts, and savings accounts to retail and commercial customers, as well as accepts deposits through third-party securities brokerage firms. The company offers its credit products through programs established with a group of national and regional retailers, local merchants, manufacturers, buying groups, industry associations, and healthcare service providers; and deposit products through various channels, such as digital and print. Synchrony Financial was incorporated in 2003 and is headquartered in Stamford, Connecticut.",
    "website": "http://www.synchrony.com",
    "zipcode": "06902"
  },
  "SFE.MU": {
    "city": "Stamford",
    "country": "United States",
    "currency": "EUR",
    "exchange": "MUN",
    "industry": "Credit Services",
    "long_name": "Synchrony Financial",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "SYNCHRONY FIN.  DL-,001",
    "state": "CT",
    "summary": "Synchrony Financial operates as a consumer financial services company in the United States. It provides a range of specialized financing programs and consumer banking products to digital, retail, home, auto, travel, health, and pet industries. The company also offers private label credit cards, dual cards, general purpose co-branded credit cards, and small and medium-sized business credit products; and promotional financing for consumer purchases, such as private label credit cards, dual cards, and installment loans. In addition, it provides promotional financing to consumers for health, veterinary and personal care procedures, and services and products, such as dental, vision, audiology, and cosmetic; debt cancellation products; and deposit products, including certificates of deposit, individual retirement accounts, money market accounts, and savings accounts to retail and commercial customers, as well as accepts deposits through third-party securities brokerage firms. The company offers its credit products through programs established with a group of national and regional retailers, local merchants, manufacturers, buying groups, industry associations, and healthcare service providers; and deposit products through various channels, such as digital and print. Synchrony Financial was incorporated in 2003 and is headquartered in Stamford, Connecticut.",
    "website": "http://www.synchrony.com",
    "zipcode": "06902"
  },
  "SLM": {
    "city": "Newark",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Credit Services",
    "long_name": "SLM Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "SLM Corporation",
    "state": "DE",
    "summary": "SLM Corporation, through its subsidiaries, originates and services private education loans to students and their families to finance the cost of their education in the United States. It also offers retail deposit accounts, including certificates of deposit, money market deposit accounts, and high-yield savings accounts; and omnibus accounts. The company was formerly known as New BLC Corporation and changed its name to SLM Corporation in December 2013. SLM Corporation was founded in 1972 and is headquartered in Newark, Delaware.",
    "website": "http://www.salliemae.com",
    "zipcode": "19713"
  },
  "SLM.MX": {
    "city": "Newark",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Credit Services",
    "long_name": "SLM Corporation",
    "market": "mx_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "SLM CORP",
    "state": "DE",
    "summary": "SLM Corporation, through its subsidiaries, originates and services private education loans to students and their families to finance the cost of their education in the United States. It also offers retail deposit accounts, including certificates of deposit, money market deposit accounts, and high-yield savings accounts; and omnibus accounts. The company was formerly known as New BLC Corporation and changed its name to SLM Corporation in December 2013. SLM Corporation was founded in 1972 and is headquartered in Newark, Delaware.",
    "website": "http://www.salliemae.com",
    "zipcode": "19713"
  },
  "SLMBP": {
    "city": "Newark",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Credit Services",
    "long_name": "SLM Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "SLM Corporation - Floating Rate",
    "state": "DE",
    "summary": "SLM Corporation, through its subsidiaries, originates and services private education loans to students and their families to finance the cost of their education in the United States. It also offers retail deposit accounts, including certificates of deposit, money market deposit accounts, and high-yield savings accounts; and omnibus accounts. The company was formerly known as New BLC Corporation and changed its name to SLM Corporation in December 2013. SLM Corporation was founded in 1972 and is headquartered in Newark, Delaware.",
    "website": "http://www.salliemae.com",
    "zipcode": "19713"
  },
  "SM1.F": {
    "city": "Newark",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "SLM Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "SLM CORP.  DL-,20",
    "state": "DE",
    "summary": "SLM Corporation, through its subsidiaries, originates and services private education loans to students and their families to finance the cost of their education in the United States. It also offers retail deposit accounts, including certificates of deposit, money market deposit accounts, and high-yield savings accounts; and omnibus accounts. The company was formerly known as New BLC Corporation and changed its name to SLM Corporation in December 2013. SLM Corporation was founded in 1972 and is headquartered in Newark, Delaware.",
    "website": "http://www.salliemae.com",
    "zipcode": "19713"
  },
  "SNFCA": {
    "city": "Draper",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Credit Services",
    "long_name": "Security National Financial Corporation",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "Security National Financial Cor",
    "state": "UT",
    "summary": "Security National Financial Corporation engages in life insurance, cemetery and mortuary, and mortgage businesses. The company's Life Insurance segment is involved in selling and servicing lines of life insurance, annuity products, and accident and health insurance. It offers various life insurance products, including funeral plans and interest-sensitive life insurance, as well as other traditional life, accident, and health insurance products; annuity products comprising single and flexible premium deferred annuities, and immediate annuities; and diver's accident policies. This segment also cedes and assumes various risks with various authorized unaffiliated reinsurers pursuant to reinsurance treaties. Its Cemetery and Mortuary segment operates eight mortuaries and five cemeteries in Utah; and one cemetery in California. This segment also offers plots, interment vaults, mausoleum crypts, markers, caskets, urns, and other death care related products; and provides professional services of funeral directors, opening and closing of graves, use of chapels and viewing rooms, and use of automobiles and clothing. The company's Mortgage segment originates and underwrites residential and commercial loans for new construction, existing homes, and real estate projects primarily in Florida, Nevada, Texas, and Utah. It offers residential mortgage lending services to real estate brokers, builders, and independent mortgage loan originators. Security National Financial Corporation was founded in 1965 and is headquartered in Draper, Utah.",
    "website": "http://www.securitynational.com",
    "zipcode": "84020"
  },
  "SOFI": {
    "city": "San Francisco",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Credit Services",
    "long_name": "SoFi Technologies, Inc.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "SoFi Technologies, Inc.",
    "state": "CA",
    "summary": "SoFi Technologies, Inc., a finance company, operates an online platform that provides financial services. It offers student loan refinancing, private student loans, personal loans, auto loan refinance, home loans, mortgage loans, and investments, as well as insurance products for renters, homeowners, automobiles, and others. The company was incorporated in 2011 and is based in San Francisco, California.",
    "website": "http://www.sofi.com",
    "zipcode": "94105"
  },
  "SYF": {
    "city": "Stamford",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Synchrony Financial",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "Synchrony Financial",
    "state": "CT",
    "summary": "Synchrony Financial operates as a consumer financial services company in the United States. It provides a range of specialized financing programs and consumer banking products to digital, retail, home, auto, travel, health, and pet industries. The company also offers private label credit cards, dual cards, general purpose co-branded credit cards, and small and medium-sized business credit products; and promotional financing for consumer purchases, such as private label credit cards, dual cards, and installment loans. In addition, it provides promotional financing to consumers for health, veterinary and personal care procedures, and services and products, such as dental, vision, audiology, and cosmetic; debt cancellation products; and deposit products, including certificates of deposit, individual retirement accounts, money market accounts, and savings accounts to retail and commercial customers, as well as accepts deposits through third-party securities brokerage firms. The company offers its credit products through programs established with a group of national and regional retailers, local merchants, manufacturers, buying groups, industry associations, and healthcare service providers; and deposit products through various channels, such as digital and print. Synchrony Financial was incorporated in 2003 and is headquartered in Stamford, Connecticut.",
    "website": "http://www.synchrony.com",
    "zipcode": "06902"
  },
  "SYF-PA": {
    "city": "Stamford",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Synchrony Financial",
    "market": "us_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "Synchrony Financial Depositary ",
    "state": "CT",
    "summary": "Synchrony Financial operates as a consumer financial services company in the United States. It provides a range of specialized financing programs and consumer banking products to digital, retail, home, auto, travel, health, and pet industries. The company also offers private label credit cards, dual cards, general purpose co-branded credit cards, and small and medium-sized business credit products; and promotional financing for consumer purchases, such as private label credit cards, dual cards, and installment loans. In addition, it provides promotional financing to consumers for health, veterinary and personal care procedures, and services and products, such as dental, vision, audiology, and cosmetic; debt cancellation products; and deposit products, including certificates of deposit, individual retirement accounts, money market accounts, and savings accounts to retail and commercial customers, as well as accepts deposits through third-party securities brokerage firms. The company offers its credit products through programs established with a group of national and regional retailers, local merchants, manufacturers, buying groups, industry associations, and healthcare service providers; and deposit products through various channels, such as digital and print. Synchrony Financial was incorporated in 2003 and is headquartered in Stamford, Connecticut.",
    "website": "http://www.synchrony.com",
    "zipcode": "06902"
  },
  "SYF.MX": {
    "city": "Stamford",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Credit Services",
    "long_name": "Synchrony Financial",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "SYNCHRONY FINANCIAL",
    "state": "CT",
    "summary": "Synchrony Financial operates as a consumer financial services company in the United States. It provides a range of specialized financing programs and consumer banking products to digital, retail, home, auto, travel, health, and pet industries. The company also offers private label credit cards, dual cards, general purpose co-branded credit cards, and small and medium-sized business credit products; and promotional financing for consumer purchases, such as private label credit cards, dual cards, and installment loans. In addition, it provides promotional financing to consumers for health, veterinary and personal care procedures, and services and products, such as dental, vision, audiology, and cosmetic; debt cancellation products; and deposit products, including certificates of deposit, individual retirement accounts, money market accounts, and savings accounts to retail and commercial customers, as well as accepts deposits through third-party securities brokerage firms. The company offers its credit products through programs established with a group of national and regional retailers, local merchants, manufacturers, buying groups, industry associations, and healthcare service providers; and deposit products through various channels, such as digital and print. Synchrony Financial was incorporated in 2003 and is headquartered in Stamford, Connecticut.",
    "website": "http://www.synchrony.com",
    "zipcode": "06902"
  },
  "SZL.AX": {
    "city": "Minneapolis",
    "country": "United States",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Credit Services",
    "long_name": "Sezzle Inc.",
    "market": "au_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "SEZZLE INC CDI FORUS",
    "state": "MN",
    "summary": "Sezzle Inc. operates as a technology-enabled payments company in United States, Canada, India, and Europe. The company provides a payments platform that facilitates payments between consumers with merchants. Its platform enables customers to make online purchases and split the payment for the purchase in four equal interest free payments over six weeks. The company offers its payment solution to online stores, as well as brick-and-mortar retailers. Sezzle Inc. was incorporated in 2016 and is headquartered in Minneapolis, Minnesota.",
    "website": "http://www.sezzle.com",
    "zipcode": "55401"
  },
  "TRY.F": {
    "city": "Charlotte",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "Barings BDC, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "BARINGS BDC INC. DL -,001",
    "state": "NC",
    "summary": "Barings BDC, Inc. (NYSE: BBDC) is a publicly traded, externally managed investment company that has elected to be treated as a business development company under the Investment Company Act of 1940. Barings BDC seeks to invest primarily in senior secured loans to private U.S. middle-market companies that operate across a wide range of industries. It specializes in mezzanine, leveraged buyouts, management buyouts, ESOPs, change of control transactions, acquisition financings, growth financing, and recapitalizations in lower middle market, mature, and later stage companies. Barings BDC's investment activities are managed by its investment adviser, Barings LLC, a leading global asset manager based in Charlotte, NC with over $335 billion of AUM firm-wide. For more information, visit www.baringsbdc.com.",
    "website": "http://www.baringsbdc.com",
    "zipcode": "28202"
  },
  "UPST": {
    "city": "San Mateo",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Credit Services",
    "long_name": "Upstart Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "Upstart Holdings, Inc.",
    "state": "CA",
    "summary": "Upstart Holdings, Inc. operates a cloud- based artificial intelligence (AI) lending platform. The company's platform aggregates consumer demand for loans and connects it to its network of the company's AI- enabled bank partners. Its platform connects consumers, banks, and institutional investors through a shared AI lending platform. Upstart Holdings, Inc. was incorporated in 2012 and is headquartered in San Mateo, California.",
    "website": "http://www.upstart.com",
    "zipcode": "94403"
  },
  "V": {
    "city": "San Francisco",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "Visa Inc.",
    "market": "us_market",
    "market_cap": "Mega Cap",
    "sector": "Financial Services",
    "short_name": "Visa Inc.",
    "state": "CA",
    "summary": "Visa Inc. operates as a payments technology company worldwide. The company facilitates digital payments among consumers, merchants, financial institutions, businesses, strategic partners, and government entities. It operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. In addition, the company offers card products, platforms, and value-added services. It provides its services under the Visa, Visa Electron, Interlink, VPAY, and PLUS brands. The company was founded in 1958 and is headquartered in San Francisco, California.",
    "website": "http://usa.visa.com",
    "zipcode": "94128"
  },
  "V.BA": {
    "city": "San Francisco",
    "country": "United States",
    "currency": "ARS",
    "exchange": "BUE",
    "industry": "Credit Services",
    "long_name": "Visa Inc.",
    "market": "ar_market",
    "market_cap": "Mega Cap",
    "sector": "Financial Services",
    "short_name": "VISA INC",
    "state": "CA",
    "summary": "Visa Inc. operates as a payments technology company worldwide. The company facilitates digital payments among consumers, merchants, financial institutions, businesses, strategic partners, and government entities. It operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. In addition, the company offers card products, platforms, and value-added services. It provides its services under the Visa, Visa Electron, Interlink, VPAY, and PLUS brands. The company was founded in 1958 and is headquartered in San Francisco, California.",
    "website": "http://usa.visa.com",
    "zipcode": "94128"
  },
  "V.MX": {
    "city": "San Francisco",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Credit Services",
    "long_name": "Visa Inc.",
    "market": "mx_market",
    "market_cap": "Mega Cap",
    "sector": "Financial Services",
    "short_name": "VISA INC",
    "state": "CA",
    "summary": "Visa Inc. operates as a payments technology company worldwide. The company facilitates digital payments among consumers, merchants, financial institutions, businesses, strategic partners, and government entities. It operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. In addition, the company offers card products, platforms, and value-added services. It provides its services under the Visa, Visa Electron, Interlink, VPAY, and PLUS brands. The company was founded in 1958 and is headquartered in San Francisco, California.",
    "website": "http://usa.visa.com",
    "zipcode": "94128"
  },
  "V.SN": {
    "city": "San Francisco",
    "country": "United States",
    "currency": "USD",
    "exchange": "SGO",
    "industry": "Credit Services",
    "long_name": "Visa Inc.",
    "market": "cl_market",
    "market_cap": "Mega Cap",
    "sector": "Financial Services",
    "short_name": "VISA INC",
    "state": "CA",
    "summary": "Visa Inc. operates as a payments technology company worldwide. The company facilitates digital payments among consumers, merchants, financial institutions, businesses, strategic partners, and government entities. It operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. In addition, the company offers card products, platforms, and value-added services. It provides its services under the Visa, Visa Electron, Interlink, VPAY, and PLUS brands. The company was founded in 1958 and is headquartered in San Francisco, California.",
    "website": "http://usa.visa.com",
    "zipcode": "94128"
  },
  "VISA.VI": {
    "city": "San Francisco",
    "country": "United States",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Credit Services",
    "long_name": "Visa Inc.",
    "market": "at_market",
    "market_cap": "Mega Cap",
    "sector": "Financial Services",
    "short_name": "VISA INC-CLASS A SHARES",
    "state": "CA",
    "summary": "Visa Inc. operates as a payments technology company worldwide. The company facilitates digital payments among consumers, merchants, financial institutions, businesses, strategic partners, and government entities. It operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. In addition, the company offers card products, platforms, and value-added services. It provides its services under the Visa, Visa Electron, Interlink, VPAY, and PLUS brands. The company was founded in 1958 and is headquartered in San Francisco, California.",
    "website": "http://usa.visa.com",
    "zipcode": "94128"
  },
  "VISA34.SA": {
    "city": "San Francisco",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Credit Services",
    "long_name": "Visa Inc.",
    "market": "br_market",
    "market_cap": "Mega Cap",
    "sector": "Financial Services",
    "short_name": "VISA INC    DRN",
    "state": "CA",
    "summary": "Visa Inc. operates as a payments technology company worldwide. The company facilitates digital payments among consumers, merchants, financial institutions, businesses, strategic partners, and government entities. It operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. In addition, the company offers card products, platforms, and value-added services. It provides its services under the Visa, Visa Electron, Interlink, VPAY, and PLUS brands. The company was founded in 1958 and is headquartered in San Francisco, California.",
    "website": "http://usa.visa.com",
    "zipcode": "94128"
  },
  "W3U.F": {
    "city": "Denver",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "The Western Union Company",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "WESTERN UNION CO.  DL-,01",
    "state": "CO",
    "summary": "The Western Union Company provides money movement and payment services worldwide. It operates in two segments, Consumer-to-Consumer and Business Solutions. The Consumer-to-Consumer segment facilitates money transfers between two consumers, primarily through a network of third-party agents and sub-agents. This segment offers international cross-border transfers and intra-country transfers, as well as money transfer transactions through websites and mobile devices. The Business Solutions segment provides payment and foreign exchange solutions, primarily cross-border and cross-currency transactions for small and medium size enterprises, other organizations, and individuals; and foreign currency forward and option contracts. The company also offers bill payment services that facilitates payments from consumers to businesses and other organizations, as well as offers money order and other services. It serves primarily through a network of agents. The Western Union Company was founded in 1851 and is headquartered in Denver, Colorado.",
    "website": "http://www.westernunion.com",
    "zipcode": "80237"
  },
  "WOA.F": {
    "city": "Greenville",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "World Acceptance Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "WORLD ACCEPTANCE",
    "state": "SC",
    "summary": "World Acceptance Corporation, together with its subsidiaries, engages in small-loan consumer finance business. The company offers short-term small installment loans, medium-term larger installment loans, related credit insurance, and ancillary products and services to individuals. It also provides automobile club memberships to its borrowers; and income tax return preparation and electronic filing services. In addition, the company markets and sells credit life, credit accident and health, credit property and auto, unemployment, and accidental death and dismemberment insurance in connection with its loans. It serves individuals with limited access to other sources of consumer credit, such as banks, credit unions, other consumer finance businesses, and credit card lenders. As of March 31, 2020, it operates 1,243 branches in Alabama, Georgia, Idaho, Illinois, Indiana, Kentucky, Louisiana, Mississippi, Missouri, New Mexico, Oklahoma, South Carolina, Texas, Tennessee, Utah, and Wisconsin. World Acceptance Corporation was founded in 1962 and is headquartered in Greenville, South Carolina.",
    "website": "http://www.loansbyworld.com",
    "zipcode": "29601"
  },
  "WORC": {
    "city": "Provo",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "Wake Up Now, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "WAKE UP NOW INC",
    "state": "UT",
    "summary": "Wake Up Now, Inc., together with its subsidiaries, operates as a subscription based direct sales financial wellness company in the United States. Its products include a suite of personal financial tools designed to enable individuals manage their finances; and an affiliate network through which members receive discounts on purchases. The company was formerly known as Wordcraft Systems, Inc. and changed its name to Wake Up Now, Inc. in November 2010. Wake Up Now, Inc. was founded in 1967 and is headquartered in Provo, Utah.",
    "website": null,
    "zipcode": "84604"
  },
  "WRLD": {
    "city": "Greenville",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Credit Services",
    "long_name": "World Acceptance Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "World Acceptance Corporation",
    "state": "SC",
    "summary": "World Acceptance Corporation, together with its subsidiaries, engages in small-loan consumer finance business. The company offers short-term small installment loans, medium-term larger installment loans, related credit insurance, and ancillary products and services to individuals. It also provides automobile club memberships to its borrowers; and income tax return preparation and electronic filing services. In addition, the company markets and sells credit life, credit accident and health, credit property and auto, unemployment, and accidental death and dismemberment insurance in connection with its loans. It serves individuals with limited access to other sources of consumer credit, such as banks, credit unions, other consumer finance businesses, and credit card lenders. As of March 31, 2020, it operates 1,243 branches in Alabama, Georgia, Idaho, Illinois, Indiana, Kentucky, Louisiana, Mississippi, Missouri, New Mexico, Oklahoma, South Carolina, Texas, Tennessee, Utah, and Wisconsin. World Acceptance Corporation was founded in 1962 and is headquartered in Greenville, South Carolina.",
    "website": "http://www.loansbyworld.com",
    "zipcode": "29601"
  },
  "WU": {
    "city": "Denver",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Credit Services",
    "long_name": "The Western Union Company",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "Western Union Company (The)",
    "state": "CO",
    "summary": "The Western Union Company provides money movement and payment services worldwide. It operates in two segments, Consumer-to-Consumer and Business Solutions. The Consumer-to-Consumer segment facilitates money transfers between two consumers, primarily through a network of third-party agents and sub-agents. This segment offers international cross-border transfers and intra-country transfers, as well as money transfer transactions through websites and mobile devices. The Business Solutions segment provides payment and foreign exchange solutions, primarily cross-border and cross-currency transactions for small and medium size enterprises, other organizations, and individuals; and foreign currency forward and option contracts. The company also offers bill payment services that facilitates payments from consumers to businesses and other organizations, as well as offers money order and other services. It serves primarily through a network of agents. The Western Union Company was founded in 1851 and is headquartered in Denver, Colorado.",
    "website": "http://www.westernunion.com",
    "zipcode": "80237"
  },
  "WUNI34.SA": {
    "city": "Denver",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Credit Services",
    "long_name": "The Western Union Company",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "WESTERNUNIONDRN",
    "state": "CO",
    "summary": "The Western Union Company provides money movement and payment services worldwide. It operates in two segments, Consumer-to-Consumer and Business Solutions. The Consumer-to-Consumer segment facilitates money transfers between two consumers, primarily through a network of third-party agents and sub-agents. This segment offers international cross-border transfers and intra-country transfers, as well as money transfer transactions through websites and mobile devices. The Business Solutions segment provides payment and foreign exchange solutions, primarily cross-border and cross-currency transactions for small and medium size enterprises, other organizations, and individuals; and foreign currency forward and option contracts. The company also offers bill payment services that facilitates payments from consumers to businesses and other organizations, as well as offers money order and other services. It serves primarily through a network of agents. The Western Union Company was founded in 1851 and is headquartered in Denver, Colorado.",
    "website": "http://www.westernunion.com",
    "zipcode": "80237"
  },
  "XSF.CN": {
    "city": "Los Angeles",
    "country": "United States",
    "currency": "CAD",
    "exchange": "CNQ",
    "industry": "Credit Services",
    "long_name": "XS Financial Inc.",
    "market": "ca_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "XSFinInc",
    "state": "CA",
    "summary": "XS Financial Inc., a specialty finance company, provides equipment leasing solutions in the United States. It offers and leases extraction, processing, distillation, and related equipment used to extract and distill oil from cannabis and hemp plants. The company's services include equipment selection and procurement, such as extraction methods, pre- and post-processing, peripheral, analytical, and remediation equipment, as well as consumables. It also provides on-site support services comprising facilitation of equipment installation, process development, product formulation, and staffing; and service packages and sale-leaseback services. The company serves owner/operators of cannabis and hemp oil extraction facilities, as well as companies requiring product testing services and formulated product makers. The company was formerly known as Xtraction Services Holdings Corp. and changed its name to XS Financial Inc. in June 2020. XS Financial Inc. was founded in 2017 and is based in Los Angeles, California.",
    "website": "http://www.xsfinancial.com",
    "zipcode": "90067"
  },
  "XSHLF": {
    "city": "Los Angeles",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Credit Services",
    "long_name": "XS Financial Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "XS FINANCIAL INC",
    "state": "CA",
    "summary": "XS Financial Inc., a specialty finance company, provides equipment leasing solutions in the United States. It offers and leases extraction, processing, distillation, and related equipment used to extract and distill oil from cannabis and hemp plants. The company's services include equipment selection and procurement, such as extraction methods, pre- and post-processing, peripheral, analytical, and remediation equipment, as well as consumables. It also provides on-site support services comprising facilitation of equipment installation, process development, product formulation, and staffing; and service packages and sale-leaseback services. The company serves owner/operators of cannabis and hemp oil extraction facilities, as well as companies requiring product testing services and formulated product makers. The company was formerly known as Xtraction Services Holdings Corp. and changed its name to XS Financial Inc. in June 2020. XS Financial Inc. was founded in 2017 and is based in Los Angeles, California.",
    "website": "http://www.xsfinancial.com",
    "zipcode": "90067"
  },
  "XSNA.F": {
    "city": "Draper",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Credit Services",
    "long_name": "Security National Financial Corporation",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "SECURITY NATL FINL A DL 2",
    "state": "UT",
    "summary": "Security National Financial Corporation engages in life insurance, cemetery and mortuary, and mortgage businesses. The company's Life Insurance segment is involved in selling and servicing lines of life insurance, annuity products, and accident and health insurance. It offers various life insurance products, including funeral plans and interest-sensitive life insurance, as well as other traditional life, accident, and health insurance products; annuity products comprising single and flexible premium deferred annuities, and immediate annuities; and diver's accident policies. This segment also cedes and assumes various risks with various authorized unaffiliated reinsurers pursuant to reinsurance treaties. Its Cemetery and Mortuary segment operates eight mortuaries and five cemeteries in Utah; and one cemetery in California. This segment also offers plots, interment vaults, mausoleum crypts, markers, caskets, urns, and other death care related products; and provides professional services of funeral directors, opening and closing of graves, use of chapels and viewing rooms, and use of automobiles and clothing. The company's Mortgage segment originates and underwrites residential and commercial loans for new construction, existing homes, and real estate projects primarily in Florida, Nevada, Texas, and Utah. It offers residential mortgage lending services to real estate brokers, builders, and independent mortgage loan originators. Security National Financial Corporation was founded in 1965 and is headquartered in Draper, Utah.",
    "website": "http://www.securitynational.com",
    "zipcode": "84020"
  },
  "ZBT.AX": {
    "city": "Carlsbad",
    "country": "United States",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Credit Services",
    "long_name": "Zebit, Inc.",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "ZEBIT CDI FORUS",
    "state": "CA",
    "summary": "Zebit, Inc. operates as an e-commerce company in the United States. It offers a range of products through its website, zebit.com. The company was founded in 2015 and is based in Carlsbad, California.",
    "website": "http://zebit.com",
    "zipcode": "92008-6583"
  }
}
