{
    "33626L.KS": {
        "short_name": "Doosanfc(2PB)",
        "long_name": "Doosan Fuel Cell America, Inc.",
        "summary": "Doosan Fuel Cell America, Inc. designs, engineers, and manufactures stationary fuel cells for commercial and industrial applications. It offers Doosan PureCell system, an energy solution for generating clean electricity and heat through an electrochemical process with no combustion or moving parts, and natural gas. The company also provides multi-fuel cell installations for data centers, industrial facilities, and microgrids, as well as single fuel cell applications for commercial buildings. It also offers project development, installation, remote monitoring and control, equipment services, and financial solutions in partnership with finance providers. The company's products have applications in commercial mixed-use, data centers and telcom, education, healthcare, industrial, retail, and utility markets. Doosan Fuel Cell America, Inc. was formerly known as ClearEdge Power, Inc. As a result of the acquisition of ClearEdge Power, Inc. by Doosan Corporation, ClearEdge Power, Inc.'s name was changed. The company was founded in 2003 and is headquartered in South Windsor, Connecticut. As of July 18, 2014, Doosan Fuel Cell America, Inc. operates as a subsidiary of Doosan Corporation.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "United States",
        "state": "CT",
        "city": "South Windsor",
        "zipcode": "06074",
        "website": "http://www.doosanfuelcell.com",
        "market_cap": null
    },
    "33B.F": {
        "short_name": "BADGER METER  DL 1",
        "long_name": "Badger Meter, Inc.",
        "summary": "Badger Meter, Inc. manufactures and markets flow measurement, quality, control, and communication solutions in the United States, Asia, Canada, Europe, Mexico, the Middle East, and internationally. It offers mechanical or static water meters, and related radio and software technologies and services to municipal water utilities. The company also provides flow instrumentation products, including meters, valves, and other sensing instruments to measure and control fluids going through a pipe or pipeline, including water, air, steam, oil, and other liquids and gases to original equipment manufacturers as the primary flow measurement device within a product or system, as well as through manufacturers' representatives. Its flow instrumentation products are used in water/wastewater, heating, ventilating and air conditioning, and corporate sustainability markets. In addition, the company offers ORION Migratable for automatic meter reading; ORION (SE) for traditional fixed network applications; and ORION Cellular for infrastructure-free fixed network meter reading solution, as well as BEACON advanced metering analytics, a secure cloud-hosted software suite that establishes alerts for specific conditions and allows consumer engagement tools that permit end water customers to view and manage their water usage activity. It also serves water utilities, industrial, and other industries. The company sells its products directly, as well as through resellers and representatives. Badger Meter, Inc. was founded in 1905 and is headquartered in Milwaukee, Wisconsin.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "WI",
        "city": "Milwaukee",
        "zipcode": "53224",
        "website": "http://www.badgermeter.com",
        "market_cap": "Mid Cap"
    },
    "49V.F": {
        "short_name": "VERTIV HOL.CL A DL-,0001",
        "long_name": "Vertiv Holdings Co",
        "summary": "Vertiv Holdings Co, together with its subsidiaries, designs, manufactures, and services critical digital infrastructure technologies and life cycle services for data centers, communication networks, and commercial and industrial environments in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. It offers power management products, uninterruptible power systems, thermal management products, integrated rack systems, modular solutions, and management systems for monitoring and controlling digital infrastructure that are integral to the technologies used for various services, including e-commerce, online banking, file sharing, video on-demand, energy storage, wireless communications, Internet of Things, and online gaming. The company also provides lifecycle management services, predictive analytics, and professional services for deploying, maintaining, and optimizing these products and their related systems. It offers its products primarily under the Liebert, NetSure, Geist, and Avocent brands. The company serves social media, financial services, healthcare, transportation, retail, education, and government industries through a network of direct sales professionals, independent sales representatives, channel partners, and original equipment manufacturers. Vertiv Holdings Co is headquartered in Columbus, Ohio.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OH",
        "city": "Columbus",
        "zipcode": "43085",
        "website": "http://www.vertiv.com",
        "market_cap": "Mid Cap"
    },
    "AEIS": {
        "short_name": "Advanced Energy Industries, Inc",
        "long_name": "Advanced Energy Industries, Inc.",
        "summary": "Advanced Energy Industries, Inc. designs, manufactures, sells, and supports precision power conversion, measurement, and control solutions worldwide. It offers process power solutions, including direct current (DC), pulsed DC, low frequency alternating current, high voltage, and radio frequency (RF) power supplies, as well as RF matching networks and remote plasma sources for reactive gas applications and RF instrumentation. The company also provides power control modules and thermal instrumentation products for rapid thermal processing, chemical vapor deposition, crystal growing, and other semiconductor and adjacent thin film applications, as well as in chemical processing, metal and glass manufacturing, and other general industrial power applications; high voltage DC-DC products for semiconductor wafer processing and metrology, electrostatic clamping of substrates, scientific instrumentation, mass spectrometry, and analytical X-ray systems for industrial and analytical applications; and low voltage DC-DC board mounted solutions for use in healthcare, telecommunications, test and measurement, instrumentation, and industrial equipment applications, as well as distributed power in server and storage systems. In addition, it offers gas detection and monitoring products for the automotive, energy, environmental control, aerospace, medical, and research industries; and embedded power products for medical equipment or IEC 60950-1 for information technology equipment. Further, it offers conversions, upgrades, and refurbishments and used equipment to companies, as well as repair services. The company provides its products through a direct sales force, independent sales representatives, channel partners, and distributors. Advanced Energy Industries, Inc. was incorporated in 1981 and is headquartered in Denver, Colorado.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Denver",
        "zipcode": "80202",
        "website": "http://www.advancedenergy.com",
        "market_cap": "Mid Cap"
    },
    "AI7.F": {
        "short_name": "AZZ INC.  DL 1",
        "long_name": "AZZ Inc.",
        "summary": "AZZ Inc. provides galvanizing and metal coating solutions, welding solutions, specialty electrical equipment, and engineered services to the power generation, transmission, distribution, refining, and industrial markets in the United States and internationally. The company operates through two segments, Infrastructure Solutions and Metal Coatings. The Metal Coatings segment offers hot dip galvanizing, powder coating, anodizing, plating, and other metal coating applications to the steel fabrication and other industries. It serves fabricators or manufacturers that provide services to the electrical and telecommunications, bridge and highway, petrochemical, and general industrial markets, as well as original equipment manufacturers. The Infrastructure Solutions segment provides products and services to support industrial and electrical applications.  It offers custom switchgear, electrical enclosures, medium and high voltage bus ducts, explosion proof and hazardous duty lighting, nuclear safety-related equipment, and tubular products, as well as solutions and engineering resources to multi-national companies and small independent companies. This segment sells its products through internal sales force, manufacturers' representatives, distributors, and agents. The company was incorporated in 1956 and is headquartered in Fort Worth, Texas.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Fort Worth",
        "zipcode": "76107",
        "website": "http://www.azz.com",
        "market_cap": "Small Cap"
    },
    "AOA.F": {
        "short_name": "ATKORE  DL-,01",
        "long_name": "Atkore Inc.",
        "summary": "Atkore Inc. manufactures and distributes electrical raceway products, and mechanical products and solutions (MP&S) in the United States and internationally. The company offers electrical raceway products, including electrical conduits and fittings, armored cables and fittings, and cable trays and mounting systems and fittings. It also provides MP&S products comprising metal framing and fittings, mechanical pipes, and barbed tapes, as well as construction services related to design, fabrication and installation, modular support structures, and fall protection. The company offers its products under the Allied Tube & Conduit, AFC Cable Systems, Heritage Plastics, Unistrut, Power-Strut, Cope, and Calpipe brands, as well as other sub-brands. It serves a group of end markets, including new construction; maintenance, repair, and remodel, as well as infrastructure; diversified industrials; alternative power generation; healthcare; data centers; and government through electrical, industrial, and mechanical contractors, as well as original equipment manufacturers. The company was formerly known as Atkore International Group Inc. and changed its name to Atkore Inc. in February 2021. Atkore Inc. was founded in 1959 and is headquartered in Harvey, Illinois.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "IL",
        "city": "Harvey",
        "zipcode": "60426",
        "website": "http://www.atkore.com",
        "market_cap": "Mid Cap"
    },
    "AQ8.F": {
        "short_name": "ACUITY BRANDS INC. DL-,01",
        "long_name": "Acuity Brands, Inc.",
        "summary": "Acuity Brands, Inc. provides lighting and building management solutions and services for commercial, institutional, industrial, infrastructure, and residential applications in North America and internationally. The company offers lighting and control products and solutions, including recessed, surface, and suspended lighting; down, decorative, emergency and exit, track, day, special-use, street and roadway, parking garage, tunnel, underwater, area pedestrian, flood, decorative site, and landscape lighting; occupancy sensors; photo controls; relay panels; architectural dimming panels; and integrated lighting controls systems. It also provides building management systems, lighting, lighting controls, and location aware applications; and light emitting diode drivers, power supplies, modular wiring, sensors, glass, and inverters, as well as services across applications that primarily relate to monitoring and controlling lighting systems through network technologies and the commissioning of control systems. The company markets its products under the Lithonia Lighting, Holophane, Peerless, Gotham, Mark Architectural Lighting, Winona Lighting, Juno, Indy, Aculux, Healthcare Lighting, Hydrel, American Electric Lighting, Sunoptics, eldoLED, Distech Controls, nLight, ROAM, Sensor Switch, IOTA, A-light, Cyclone, Eureka, Luminaire LED, Luminis, Dark to Light, RELOC Wiring Solutions, DGLogik, and Atrius brands. It serves electrical distributors, retail home improvement centers, electric utilities, national accounts, system integrators, utility distributors, value-added resellers, digital retailers, government entities and municipalities, lighting showrooms, developers, original equipment manufacturers, and energy service companies, as well as the new construction, renovation, and maintenance and repair markets. Acuity Brands, Inc. was incorporated in 2001 and is headquartered in Atlanta, Georgia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30309-7676",
        "website": "http://www.acuitybrands.com",
        "market_cap": "Mid Cap"
    },
    "ATKR.MX": {
        "short_name": "ATKORE INC",
        "long_name": "Atkore Inc.",
        "summary": "Atkore Inc. manufactures and distributes electrical raceway products, and mechanical products and solutions (MP&S) in the United States and internationally. The company offers electrical raceway products, including electrical conduits and fittings, armored cables and fittings, and cable trays and mounting systems and fittings. It also provides MP&S products comprising metal framing and fittings, mechanical pipes, and barbed tapes, as well as construction services related to design, fabrication and installation, modular support structures, and fall protection. The company offers its products under the Allied Tube & Conduit, AFC Cable Systems, Heritage Plastics, Unistrut, Power-Strut, Cope, and Calpipe brands, as well as other sub-brands. It serves a group of end markets, including new construction; maintenance, repair, and remodel, as well as infrastructure; diversified industrials; alternative power generation; healthcare; data centers; and government through electrical, industrial, and mechanical contractors, as well as original equipment manufacturers. The company was formerly known as Atkore International Group Inc. and changed its name to Atkore Inc. in February 2021. Atkore Inc. was founded in 1959 and is headquartered in Harvey, Illinois.",
        "currency": "MXN",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "IL",
        "city": "Harvey",
        "zipcode": "60426",
        "website": "http://www.atkore.com",
        "market_cap": "Mid Cap"
    },
    "ATKR": {
        "short_name": "Atkore Inc.",
        "long_name": "Atkore Inc.",
        "summary": "Atkore Inc. manufactures and distributes electrical raceway products, and mechanical products and solutions (MP&S) in the United States and internationally. The company offers electrical raceway products, including electrical conduits and fittings, armored cables and fittings, and cable trays and mounting systems and fittings. It also provides MP&S products comprising metal framing and fittings, mechanical pipes, and barbed tapes, as well as construction services related to design, fabrication and installation, modular support structures, and fall protection. The company offers its products under the Allied Tube & Conduit, AFC Cable Systems, Heritage Plastics, Unistrut, Power-Strut, Cope, and Calpipe brands, as well as other sub-brands. It serves a group of end markets, including new construction; maintenance, repair, and remodel, as well as infrastructure; diversified industrials; alternative power generation; healthcare; data centers; and government through electrical, industrial, and mechanical contractors, as well as original equipment manufacturers. The company was formerly known as Atkore International Group Inc. and changed its name to Atkore Inc. in February 2021. Atkore Inc. was founded in 1959 and is headquartered in Harvey, Illinois.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Harvey",
        "zipcode": "60426",
        "website": "http://www.atkore.com",
        "market_cap": "Mid Cap"
    },
    "AVX.F": {
        "short_name": "ADVANCED EN. INDS DL-,001",
        "long_name": "Advanced Energy Industries, Inc.",
        "summary": "Advanced Energy Industries, Inc. designs, manufactures, sells, and supports precision power conversion, measurement, and control solutions worldwide. It offers process power solutions, including direct current (DC), pulsed DC, low frequency alternating current, high voltage, and radio frequency (RF) power supplies, as well as RF matching networks and remote plasma sources for reactive gas applications and RF instrumentation. The company also provides power control modules and thermal instrumentation products for rapid thermal processing, chemical vapor deposition, crystal growing, and other semiconductor and adjacent thin film applications, as well as in chemical processing, metal and glass manufacturing, and other general industrial power applications; high voltage DC-DC products for semiconductor wafer processing and metrology, electrostatic clamping of substrates, scientific instrumentation, mass spectrometry, and analytical X-ray systems for industrial and analytical applications; and low voltage DC-DC board mounted solutions for use in healthcare, telecommunications, test and measurement, instrumentation, and industrial equipment applications, as well as distributed power in server and storage systems. In addition, it offers gas detection and monitoring products for the automotive, energy, environmental control, aerospace, medical, and research industries; and embedded power products for medical equipment or IEC 60950-1 for information technology equipment. Further, it offers conversions, upgrades, and refurbishments and used equipment to companies, as well as repair services. The company provides its products through a direct sales force, independent sales representatives, channel partners, and distributors. Advanced Energy Industries, Inc. was incorporated in 1981 and is headquartered in Denver, Colorado.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CO",
        "city": "Denver",
        "zipcode": "80202",
        "website": "http://www.advancedenergy.com",
        "market_cap": "Mid Cap"
    },
    "AXPWQ": {
        "short_name": "AXION POWER INTERNATIONAL INC",
        "long_name": "Axion Power International, Inc.",
        "summary": "Axion Power International, Inc. focuses on PbC battery technology business. It offers hybrid asymmetric energy storage devices. The company was founded in 2003 and is based in Boardman, Ohio.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Boardman",
        "zipcode": "44513",
        "website": "http://www.axionpower.com",
        "market_cap": "Nano Cap"
    },
    "AYI": {
        "short_name": "Acuity Brands, Inc.",
        "long_name": "Acuity Brands, Inc.",
        "summary": "Acuity Brands, Inc. provides lighting and building management solutions and services for commercial, institutional, industrial, infrastructure, and residential applications in North America and internationally. The company offers lighting and control products and solutions, including recessed, surface, and suspended lighting; down, decorative, emergency and exit, track, day, special-use, street and roadway, parking garage, tunnel, underwater, area pedestrian, flood, decorative site, and landscape lighting; occupancy sensors; photo controls; relay panels; architectural dimming panels; and integrated lighting controls systems. It also provides building management systems, lighting, lighting controls, and location aware applications; and light emitting diode drivers, power supplies, modular wiring, sensors, glass, and inverters, as well as services across applications that primarily relate to monitoring and controlling lighting systems through network technologies and the commissioning of control systems. The company markets its products under the Lithonia Lighting, Holophane, Peerless, Gotham, Mark Architectural Lighting, Winona Lighting, Juno, Indy, Aculux, Healthcare Lighting, Hydrel, American Electric Lighting, Sunoptics, eldoLED, Distech Controls, nLight, ROAM, Sensor Switch, IOTA, A-light, Cyclone, Eureka, Luminaire LED, Luminis, Dark to Light, RELOC Wiring Solutions, DGLogik, and Atrius brands. It serves electrical distributors, retail home improvement centers, electric utilities, national accounts, system integrators, utility distributors, value-added resellers, digital retailers, government entities and municipalities, lighting showrooms, developers, original equipment manufacturers, and energy service companies, as well as the new construction, renovation, and maintenance and repair markets. Acuity Brands, Inc. was incorporated in 2001 and is headquartered in Atlanta, Georgia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30309-7676",
        "website": "http://www.acuitybrands.com",
        "market_cap": "Mid Cap"
    },
    "AZZ": {
        "short_name": "AZZ Inc.",
        "long_name": "AZZ Inc.",
        "summary": "AZZ Inc. provides galvanizing and metal coating solutions, welding solutions, specialty electrical equipment, and engineered services to the power generation, transmission, distribution, refining, and industrial markets in the United States and internationally. The company operates through two segments, Infrastructure Solutions and Metal Coatings. The Metal Coatings segment offers hot dip galvanizing, powder coating, anodizing, plating, and other metal coating applications to the steel fabrication and other industries. It serves fabricators or manufacturers that provide services to the electrical and telecommunications, bridge and highway, petrochemical, and general industrial markets, as well as original equipment manufacturers. The Infrastructure Solutions segment provides products and services to support industrial and electrical applications.  It offers custom switchgear, electrical enclosures, medium and high voltage bus ducts, explosion proof and hazardous duty lighting, nuclear safety-related equipment, and tubular products, as well as solutions and engineering resources to multi-national companies and small independent companies. This segment sells its products through internal sales force, manufacturers' representatives, distributors, and agents. The company was incorporated in 1956 and is headquartered in Fort Worth, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Fort Worth",
        "zipcode": "76107",
        "website": "http://www.azz.com",
        "market_cap": "Small Cap"
    },
    "BDC": {
        "short_name": "Belden Inc",
        "long_name": "Belden Inc.",
        "summary": "Belden Inc. operates as a signal transmission solutions company in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. It operates in two segments, Enterprise Solutions and Industrial Solutions. The Enterprise Solutions segment offers copper cable and connectivity solutions, fiber cable and connectivity solutions, racks and enclosures, and signal extension and matrix switching systems for use in applications, such as local area networks, data centers, access control, fiber, and home and building automation. It also provides power, cooling, and airflow management products for mission-critical data center operations; and end-to-end copper and fiber network systems, which include cable, assemblies, interconnect panels, and enclosures. This segment serves customers in markets comprising healthcare, education, financial, government, and corporate enterprises, as well as end-markets, including sports venues and academia. The Industrial Solutions segment offers infrastructure components and on-machine connectivity systems; and industrial Ethernet switches, network management software, routers, firewalls, gateways, input/output (I/O) connectors/systems, industrial Ethernet cables, optical fiber industrial Ethernet cables, Fieldbus cables, IP and networking cables, I/O modules, distribution boxes, and customer specific wiring solutions. This segment provides its products for use in industrial automation applications comprising network and fieldbus infrastructure; sensor and actuator connectivity; and power, control, and data transmission; and supplies heat-shrinkable tubing and wire management products to protect and organize wire and cable assemblies. It serves distributors, original equipment manufacturers, installers, and end-users. The company was formerly known as Belden CDT Inc. and changed its name to Belden Inc. in May 2007. Belden Inc. was founded in 1902 and is based in St. Louis, Missouri.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MO",
        "city": "Saint Louis",
        "zipcode": "63105",
        "website": "http://www.belden.com",
        "market_cap": "Mid Cap"
    },
    "BE": {
        "short_name": "Bloom Energy Corporation",
        "long_name": "Bloom Energy Corporation",
        "summary": "Bloom Energy Corporation designs, manufactures, and sells solid-oxide fuel cell systems for on-site power generation in the United States, Japan, China, India, and the Republic of Korea. The company offers Bloom Energy Server, a power generation platform that converts standard low-pressure natural gas, biogas, or hydrogen into electricity through an electrochemical process without combustion. It serves hospitals, healthcare companies, retailers, and data centers. The company was formerly known as Ion America Corp. and changed its name to Bloom Energy Corporation in September 2006. Bloom Energy Corporation was incorporated in 2001 and is headquartered in San Jose, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Jose",
        "zipcode": "95134",
        "website": "http://www.bloomenergy.com",
        "market_cap": "Mid Cap"
    },
    "BMI": {
        "short_name": "Badger Meter, Inc.",
        "long_name": "Badger Meter, Inc.",
        "summary": "Badger Meter, Inc. manufactures and markets flow measurement, quality, control, and communication solutions in the United States, Asia, Canada, Europe, Mexico, the Middle East, and internationally. It offers mechanical or static water meters, and related radio and software technologies and services to municipal water utilities. The company also provides flow instrumentation products, including meters, valves, and other sensing instruments to measure and control fluids going through a pipe or pipeline, including water, air, steam, oil, and other liquids and gases to original equipment manufacturers as the primary flow measurement device within a product or system, as well as through manufacturers' representatives. Its flow instrumentation products are used in water/wastewater, heating, ventilating and air conditioning, and corporate sustainability markets. In addition, the company offers ORION Migratable for automatic meter reading; ORION (SE) for traditional fixed network applications; and ORION Cellular for infrastructure-free fixed network meter reading solution, as well as BEACON advanced metering analytics, a secure cloud-hosted software suite that establishes alerts for specific conditions and allows consumer engagement tools that permit end water customers to view and manage their water usage activity. It also serves water utilities, industrial, and other industries. The company sells its products directly, as well as through resellers and representatives. Badger Meter, Inc. was founded in 1905 and is headquartered in Milwaukee, Wisconsin.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "WI",
        "city": "Milwaukee",
        "zipcode": "53224",
        "website": "http://www.badgermeter.com",
        "market_cap": "Mid Cap"
    },
    "BSTK": {
        "short_name": "BRITE-STRIKE TACTI",
        "long_name": "Brite-Strike Tactical Illumination Products, Inc.",
        "summary": "Brite-Strike Tactical Illumination Products, Inc. designs and manufactures tactical lighting products and solutions for the military, law enforcement, hunting, camping, outdoor recreation, and marine safety markets in the United States. The company provides Tactical Blue Dot series products, perimeter infrared intrusion security alert products, adhesive light strips, remote pressure switches, rolling illuminated distraction and disorientation devices, baton integrated lights, duty light cameras, basic tactical lights, observation cameras, police cycle and traffic safety gloves, executive precision lighting instruments, and helmet light attachment systems, as well as accessories, such as holsters, color lenses, and batteries. It also offers outdoor adventure and recreation products, including rechargeable lighted dog collars and leashes, adhesive light strips, outdoor adventure signal safety packs, camp alert perimeter security and survival signaling systems, and sport gloves; and citizens safety products comprising personal protection systems, personal alarms, and anodized aluminum LED multi-tools, as well as tactical flashlight instructor courses. The company is based in Plymouth, Massachusetts.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MA",
        "city": "Plymouth",
        "zipcode": "02360",
        "website": "http://www.brite-strike.com",
        "market_cap": "Nano Cap"
    },
    "BW": {
        "short_name": "Babcock & Wilcox Enterprises, I",
        "long_name": "Babcock & Wilcox Enterprises, Inc.",
        "summary": "Babcock & Wilcox Enterprises, Inc., together with its subsidiaries, provides energy and environmental technologies and services for the power and industrial markets worldwide. The company operates through three segments: Babcock & Wilcox Renewable; Babcock & Wilcox Environmental; and Babcock & Wilcox Thermal. The Babcock & Wilcox Renewable segment offers technologies for waste-to-energy and biomass energy systems, as well as black liquor systems for the pulp and paper industry. This segment provides technologies support solutions for diverting waste from landfills to use for power generation and replacing fossil fuels while recovering metals and reducing emissions. The Babcock & Wilcox Environmental segment offers a range of emissions control and environmental technology solutions for utility, waste to energy, biomass, carbon black, and industrial steam generation applications. This segment provides systems for cooling, ash handling, particulate control, nitrogen oxides and sulfur dioxides removal, chemical looping for carbon control, and mercury control. The Babcock & Wilcox Thermal segment offers steam generation equipment; aftermarket parts; and construction, maintenance, and field services for plants in the power generation, oil and gas, and industrial sectors. This segment has an installed equipment for utilities and general industrial applications, including refining, petrochemical, food processing, metals, and others. Babcock & Wilcox Enterprises, Inc. was founded in 1867 and is headquartered in Akron, Ohio.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Akron",
        "zipcode": "44305",
        "website": "http://www.babcock.com",
        "market_cap": "Small Cap"
    },
    "CAPC": {
        "short_name": "CAPSTONE COMPANIES INC",
        "long_name": "Capstone Companies, Inc.",
        "summary": "Capstone Companies, Inc., through its subsidiaries, develops, markets, and sells consumer home light-emitting diode (LED) lighting products for indoor and outdoor applications worldwide. Its lighting products include connected surfacesÂ\u0096smart mirrors, standard rectangular wardrobe/fitness mirrors, LED puck lights, LED under cabinet lights, LED motion sensor lights, Eco-i-Lites, wireless remote-control outlets, and wireless remote-controlled LED accent lights. The company markets its products under the Capstone Lighting and Duracell brand names, as well as under the Hoover Home LED licensed brand through a network of direct sales force, retailers, and distributors. It sells its products through retail warehouse clubs, hardware centers, and e-commerce websites. The company was formerly known as CHDT Corporation and changed its name to Capstone Companies, Inc. in June 2012. Capstone Companies, Inc. was incorporated in 1986 and is headquartered in Deerfield Beach, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Deerfield Beach",
        "zipcode": "33441",
        "website": "http://capstonecompaniesinc.com",
        "market_cap": "Micro Cap"
    },
    "CETY": {
        "short_name": "CLEAN ENERGY TECHNOLOGIES INC",
        "long_name": "Clean Energy Technologies, Inc.",
        "summary": "Clean Energy Technologies, Inc. designs, produces, and markets clean energy products and integrated solutions focused on energy efficiency and renewable. It operates through three segments: Clean Energy HRS, Cety Europe, and Electronic Assembly. The company's principal product is the Clean Cycle, a generator that captures waste heat from various sources and turns it into electricity. It also offers a range of electrical, mechanical, and software engineering services; supply chain management services. The company was formerly known as Probe Manufacturing, Inc. and changed its name to Clean Energy Technologies, Inc. in November 2015. The company was founded in 1993 and is headquartered in Costa Mesa, California. Clean Energy Technologies, Inc. is a subsidiary of MGW Investments I Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Costa Mesa",
        "zipcode": "92626",
        "website": "http://www.cetyinc.com",
        "market_cap": "Micro Cap"
    },
    "CHGI": {
        "short_name": "CHINA CARBON GRAPHITE GROUP INC",
        "long_name": "China Carbon Graphite Group, Inc.",
        "summary": "China Carbon Graphite Group, Inc., together with its subsidiaries, engages in the research and development, manufacture, rework, and sale of graphene, graphene oxide, carbon graphite felt, and graphite bipolar plates in the People's Republic of China. Its graphene oxide is used as a conductive agent in lithium ion batteries, super capacitors, rubber and plastic additives, conductive inks, special coatings, transparent conductive thin films, and chips; and graphite bipolar plates are used in solar power storage. The company operates roycarbon.com, a business-to-business and business-to-consumers Internet portal for graphite related products. China Carbon Graphite Group, Inc. was founded in 1986 and is based in Diamond Bar, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Diamond Bar",
        "zipcode": "91765",
        "website": "http://www.chinacarboninc.com",
        "market_cap": "Nano Cap"
    },
    "DLYT": {
        "short_name": "DAIS CORPORATION",
        "long_name": "Dais Corporation",
        "summary": "Dais Corporation, a nano-structured polymer technology materials company, develops and commercializes products using its nano-structure polymer technology. The company offers Aqualyte, a platform plastic material technology for use in air, energy, and water applications; ConsERV, a fixed plate energy recovery ventilator that addresses the building indoor fresh air requirements for various forms of heating, ventilation, and air conditioning equipment; and NanoClear, a water clean-up process useful in the creation of potable water from contaminated water, including industrial process wastewater sea, brackish, or waste water. In addition, it develops PolyCool, a cooling tower system; licenses its nano-structure polymer technology. The company was formerly known as Dais Analytic Corporation Inc. and changed its name to Dais Corporation in February 2019. Dais Corporation was incorporated in 1993 and is headquartered in Odessa, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Odessa",
        "zipcode": "33556",
        "website": "http://daisanalytic.com",
        "market_cap": "Nano Cap"
    },
    "DP2.F": {
        "short_name": "AULT GLOBAL HLDGS DL-,001",
        "long_name": "Ault Global Holdings, Inc.",
        "summary": "Ault Global Holdings Inc., through its subsidiaries, designs, develops, manufactures, and sells power system solutions for the military/aerospace, medical, and industrial-telecommunication industries in North America, Europe, the Middle East, and internationally. It offers custom power system solutions; high-grade flexibility series power supply products, such as power rectifiers; and value-added services for original equipment manufacturers. The comany also provides power conversion and distribution equipment, direct current/active current inverters, and uninterrupted power supply (UPS) products; and radio frequency and microwave filters, diplexers, multiplexers, detectors, switch filters, integrated assemblies, and detector logarithmic video amplifiers, as well as provides commercial loans. In addition, it manufactures specialized electronic systems for the military market; and offers AC-DC power supplies, DC-DC converters, and displays and EMC filters, as well as distributes value added power supply solutions, UPS systems, fans, filters, line cords, and other power-related components. Further, the company also operates data centers, and provides digital marketing services. It sells its products directly through its sales force, as well as through independent manufacturer representatives and distributors. The company was formerly known as DPW Holdings, Inc. and changed its name to Ault Global Holdings Inc. in January 2021. Ault Global Holdings Inc. was incorporated in 1969 and is headquartered in Las Vegas, Nevada.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89141",
        "website": "http://www.aultglobal.com",
        "market_cap": "Micro Cap"
    },
    "DPW": {
        "short_name": "Ault Global Holdings, Inc.",
        "long_name": "Ault Global Holdings, Inc.",
        "summary": "Ault Global Holdings Inc., through its subsidiaries, designs, develops, manufactures, and sells power system solutions for the military/aerospace, medical, and industrial-telecommunication industries in North America, Europe, the Middle East, and internationally. It offers custom power system solutions; high-grade flexibility series power supply products, such as power rectifiers; and value-added services for original equipment manufacturers. The comany also provides power conversion and distribution equipment, direct current/active current inverters, and uninterrupted power supply (UPS) products; and radio frequency and microwave filters, diplexers, multiplexers, detectors, switch filters, integrated assemblies, and detector logarithmic video amplifiers, as well as provides commercial loans. In addition, it manufactures specialized electronic systems for the military market; and offers AC-DC power supplies, DC-DC converters, and displays and EMC filters, as well as distributes value added power supply solutions, UPS systems, fans, filters, line cords, and other power-related components. Further, the company also operates data centers, and provides digital marketing services. It sells its products directly through its sales force, as well as through independent manufacturer representatives and distributors. The company was formerly known as DPW Holdings, Inc. and changed its name to Ault Global Holdings Inc. in January 2021. Ault Global Holdings Inc. was incorporated in 1969 and is headquartered in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89141",
        "website": "http://www.aultglobal.com",
        "market_cap": "Micro Cap"
    },
    "EAF": {
        "short_name": "GrafTech International Ltd.",
        "long_name": "GrafTech International Ltd.",
        "summary": "GrafTech International Ltd. researches, develops, manufactures, and sells graphite and carbon based products worldwide. It offers graphite electrodes to produce electric arc furnace steel and other ferrous and non-ferrous metals; and petroleum needle coke, a crystalline form of carbon used in the production of graphite electrodes. The company sells its products primarily through direct sales force, independent sales representatives, and distributors. GrafTech International Ltd. was founded in 1886 and is headquartered in Brooklyn Heights, Ohio.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Brooklyn Heights",
        "zipcode": "44131",
        "website": "http://www.graftech.com",
        "market_cap": "Mid Cap"
    },
    "EGG.F": {
        "short_name": "ENERGIZER HLDG.NEW DL-,01",
        "long_name": "Energizer Holdings, Inc.",
        "summary": "Energizer Holdings, Inc., together with its subsidiaries, manufactures, markets, and distributes household batteries, specialty batteries, and lighting products worldwide. It offers lithium, alkaline, carbon zinc, nickel metal hydride, zinc air, and silver oxide batteries under the Energizer and Eveready brands, as well as primary, rechargeable, specialty, and hearing aid batteries. The company also provides headlights, lanterns, and children's and area lights, as well as flash lights under the Energizer, Eveready, Rayovac, Hard Case, Dolphin, Varta, and WeatherReady brands. In addition, it licenses the Energizer and Eveready brands to companies developing consumer solutions in gaming, automotive batteries, portable power for critical devices, LED light bulbs, generators, power tools, household light bulbs, and other lighting products. Further, the company designs and markets automotive fragrance and appearance products, including protectants, wipes, tire and wheel care products, glass cleaners, leather care products, air fresheners, and washes to clean, shine, refresh, and protect interior and exterior automobile surfaces under the brand names of Armor All, Nu Finish, Refresh Your Car!, LEXOL, Eagle One, California Scents, Driven, and Bahama & Co; STP branded fuel and oil additives, functional fluids, and other performance chemical products; and do-it-yourself automotive air conditioning recharge products under the A/C PRO brand name, as well as other refrigerant and recharge kits, sealants, and accessories. It sells its products through direct sales force, distributors, and wholesalers; and through various retail and business-to-business channels, including mass merchandisers, club, electronics, food, home improvement, dollar store, auto, drug, hardware, e-commerce, convenience, sporting goods, hobby/craft, office, industrial, medical, and catalog. Energizer Holdings, Inc. is headquartered in St. Louis, Missouri.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MO",
        "city": "Saint Louis",
        "zipcode": "63141",
        "website": "http://www.energizerholdings.com",
        "market_cap": "Mid Cap"
    },
    "EIPC": {
        "short_name": "ENABLE IPC CORP.",
        "long_name": "Enable IPC Corporation",
        "summary": "Enable IPC Corporation develops and commercializes novel nanostructures in the United States. The company's products include S/Cap asset management RFID tags that are used in aerospace, asset management, cargo identification/tracking, marine, military, pallet identification/tracking, rail, and vehicle identification/tracking applications; RFID Fuse Tags for use in machinery, transportation, and other applications; anodized aluminum oxide nanopore templates for use in nano-filters and nanowire making; ultracapacitors that are used in consumer electronics, industrial, and transportation applications; and SolRayo Potentiostats for use in electrochemistry applications. The company was founded in 2005 and is based in Saugus, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Saugus",
        "zipcode": "91350",
        "website": "http://www.enableipc.com",
        "market_cap": "Nano Cap"
    },
    "ENR-PA": {
        "short_name": "Energizer Holdings, Inc. 7.50% ",
        "long_name": "Energizer Holdings, Inc.",
        "summary": "Energizer Holdings, Inc., together with its subsidiaries, manufactures, markets, and distributes household batteries, specialty batteries, and lighting products worldwide. It offers lithium, alkaline, carbon zinc, nickel metal hydride, zinc air, and silver oxide batteries under the Energizer and Eveready brands, as well as primary, rechargeable, specialty, and hearing aid batteries. The company also provides headlights, lanterns, and children's and area lights, as well as flash lights under the Energizer, Eveready, Rayovac, Hard Case, Dolphin, Varta, and WeatherReady brands. In addition, it licenses the Energizer and Eveready brands to companies developing consumer solutions in gaming, automotive batteries, portable power for critical devices, LED light bulbs, generators, power tools, household light bulbs, and other lighting products. Further, the company designs and markets automotive fragrance and appearance products, including protectants, wipes, tire and wheel care products, glass cleaners, leather care products, air fresheners, and washes to clean, shine, refresh, and protect interior and exterior automobile surfaces under the brand names of Armor All, Nu Finish, Refresh Your Car!, LEXOL, Eagle One, California Scents, Driven, and Bahama & Co; STP branded fuel and oil additives, functional fluids, and other performance chemical products; and do-it-yourself automotive air conditioning recharge products under the A/C PRO brand name, as well as other refrigerant and recharge kits, sealants, and accessories. It sells its products through direct sales force, distributors, and wholesalers; and through various retail and business-to-business channels, including mass merchandisers, club, electronics, food, home improvement, dollar store, auto, drug, hardware, e-commerce, convenience, sporting goods, hobby/craft, office, industrial, medical, and catalog. Energizer Holdings, Inc. is headquartered in St. Louis, Missouri.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MO",
        "city": "Saint Louis",
        "zipcode": "63141",
        "website": "http://www.energizerholdings.com",
        "market_cap": "Mid Cap"
    },
    "ENR": {
        "short_name": "Energizer Holdings, Inc.",
        "long_name": "Energizer Holdings, Inc.",
        "summary": "Energizer Holdings, Inc., together with its subsidiaries, manufactures, markets, and distributes household batteries, specialty batteries, and lighting products worldwide. It offers lithium, alkaline, carbon zinc, nickel metal hydride, zinc air, and silver oxide batteries under the Energizer and Eveready brands, as well as primary, rechargeable, specialty, and hearing aid batteries. The company also provides headlights, lanterns, and children's and area lights, as well as flash lights under the Energizer, Eveready, Rayovac, Hard Case, Dolphin, Varta, and WeatherReady brands. In addition, it licenses the Energizer and Eveready brands to companies developing consumer solutions in gaming, automotive batteries, portable power for critical devices, LED light bulbs, generators, power tools, household light bulbs, and other lighting products. Further, the company designs and markets automotive fragrance and appearance products, including protectants, wipes, tire and wheel care products, glass cleaners, leather care products, air fresheners, and washes to clean, shine, refresh, and protect interior and exterior automobile surfaces under the brand names of Armor All, Nu Finish, Refresh Your Car!, LEXOL, Eagle One, California Scents, Driven, and Bahama & Co; STP branded fuel and oil additives, functional fluids, and other performance chemical products; and do-it-yourself automotive air conditioning recharge products under the A/C PRO brand name, as well as other refrigerant and recharge kits, sealants, and accessories. It sells its products through direct sales force, distributors, and wholesalers; and through various retail and business-to-business channels, including mass merchandisers, club, electronics, food, home improvement, dollar store, auto, drug, hardware, e-commerce, convenience, sporting goods, hobby/craft, office, industrial, medical, and catalog. Energizer Holdings, Inc. is headquartered in St. Louis, Missouri.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MO",
        "city": "Saint Louis",
        "zipcode": "63141",
        "website": "http://www.energizerholdings.com",
        "market_cap": "Mid Cap"
    },
    "ENS": {
        "short_name": "EnerSys",
        "long_name": "EnerSys",
        "summary": "EnerSys provides various stored energy solutions for industrial applications worldwide. The company offers energy systems, which combine enclosures, power conversion, power distribution, and energy storage are used in the telecommunication, broadband and utility industries, uninterruptible power supplies, and other applications requiring stored energy solutions; motive power batteries and chargers that are utilized in electric forklift trucks and other industrial electric powered vehicles; and specialty batteries, which are used in aerospace and defense applications, large over-the-road trucks, automotive, medical, and security systems applications. It also provides battery chargers, power equipment, battery accessories, and outdoor equipment enclosure solutions; and aftermarket and customer support services. The company sells its batteries under the PowerSafe, DataSafe, Hawker, Genesis, Odyssey, Cyclon, IRONCLAD, General Battery, Fiamm Motive Power, Oldham, Express, and NexSys brands. The company was formerly known as Yuasa, Inc. and changed its name to EnerSys in January 2001. EnerSys was incorporated in 2000 and is headquartered in Reading, Pennsylvania.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Reading",
        "zipcode": "19605",
        "website": "http://www.enersys.com",
        "market_cap": "Mid Cap"
    },
    "EOSE": {
        "short_name": "Eos Energy Enterprises, Inc.",
        "long_name": "Eos Energy Enterprises, Inc.",
        "summary": "Eos Energy Enterprises, Inc. designs, manufactures, and deploys battery storage solutions for utility, commercial and industrial, and renewable energy markets in the United States. The company offers stationary battery storage solutions. Its flagship product is the Eos Znyth DC battery system designed to meet the requirements of the grid-scale energy storage market. The company was founded in 2008 and is headquartered in Edison, New Jersey.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Edison",
        "zipcode": "08820",
        "website": "http://www.eosenergystorage.com",
        "market_cap": "Small Cap"
    },
    "ESP": {
        "short_name": "Espey Mfg. & Electronics Corp.",
        "long_name": "Espey Mfg. & Electronics Corp.",
        "summary": "Espey Mfg. & Electronics Corp., a power electronics design and original equipment manufacturing company, designs, manufactures, and tests electronic equipment primarily for use in military and industrial applications in the United States and internationally. Its principal products include power supplies, power converters, filters, power transformers, magnetic components, power distribution equipment, UPS systems, antennas, and high power radar systems for use in AC and DC locomotives, shipboard power, shipboard radar, airborne power, ground-based radar, and ground mobile power applications. The company also provides various services that consist of design and development to specification, build to print, design services, design studies, environmental testing services, metal fabrication, painting services, and development of automatic testing equipment. It serves industrial manufacturers and defense companies, the government of the United States, foreign governments, and foreign electronic equipment companies through its direct sales organization and outside sales representatives. Espey Mfg. & Electronics Corp. was founded in 1928 and is based in Saratoga Springs, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Saratoga Springs",
        "zipcode": "12866-4755",
        "website": "http://www.espey.com",
        "market_cap": "Nano Cap"
    },
    "EW3.F": {
        "short_name": "ENCORE WIRE CORP.  DL-,01",
        "long_name": "Encore Wire Corporation",
        "summary": "Encore Wire Corporation manufactures and sells electrical building wires and cables for interior electrical wiring in the United States. Its products include NM-B cables for use as interior wiring in homes, apartments, and manufactured housing; THHN/THWN-2 cables and metal-clad and armored cables for use as wiring in commercial and industrial buildings; UF-B cables; XHHW-2 cables; RHH/RHW-2 cables; USE-2 cables; and other types of wire products. The company sells its products to wholesale electrical distributors primarily through independent manufacturers' representatives. Encore Wire Corporation was incorporated in 1989 and is headquartered in McKinney, Texas.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "McKinney",
        "zipcode": "75069",
        "website": "http://www.encorewire.com",
        "market_cap": "Small Cap"
    },
    "FCEL.MX": {
        "short_name": "FUELCELL ENERGY INC",
        "long_name": "FuelCell Energy, Inc.",
        "summary": "FuelCell Energy, Inc., together with its subsidiaries, designs, manufactures, sells, installs, operates, and services stationary fuel cell power plants for distributed baseload power generation. The company offers SureSource product line based on carbonate fuel cell technology in various configurations, including on-site power, utility grid support, distributed hydrogen, and carbon utilization, as well as micro-grid and multi-megawatt applications; and SureSource Recovery power plants for natural gas pipeline applications. It also provides SureSource Capture system that separates and concentrates carbon dioxide from the flue gases of natural gas, biomass, or coal-fired power plants, as well as industrial facilities; and SOFC/SOEC and Energy Storage, a solution for energy storage using solid oxide technology. The company's SureSource power plants generate clean electricity, usable heat, water, and hydrogen. It serves various markets, such as utilities and independent power producers, industrial and process applications, education and health care, data centers and communication, wastewater treatment, government, morcrogrids, and commercial and hospitality. The company primarily operates in the United States, South Korea, England, Germany, and Switzerland. FuelCell Energy, Inc. was founded in 1969 and is headquartered in Danbury, Connecticut.",
        "currency": "MXN",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CT",
        "city": "Danbury",
        "zipcode": "06810",
        "website": "http://www.fuelcellenergy.com",
        "market_cap": "Mid Cap"
    },
    "FCEL": {
        "short_name": "FuelCell Energy, Inc.",
        "long_name": "FuelCell Energy, Inc.",
        "summary": "FuelCell Energy, Inc., together with its subsidiaries, designs, manufactures, sells, installs, operates, and services stationary fuel cell power plants for distributed baseload power generation. The company offers SureSource product line based on carbonate fuel cell technology in various configurations, including on-site power, utility grid support, distributed hydrogen, and carbon utilization, as well as micro-grid and multi-megawatt applications; and SureSource Recovery power plants for natural gas pipeline applications. It also provides SureSource Capture system that separates and concentrates carbon dioxide from the flue gases of natural gas, biomass, or coal-fired power plants, as well as industrial facilities; and SOFC/SOEC and Energy Storage, a solution for energy storage using solid oxide technology. The company's SureSource power plants generate clean electricity, usable heat, water, and hydrogen. It serves various markets, such as utilities and independent power producers, industrial and process applications, education and health care, data centers and communication, wastewater treatment, government, morcrogrids, and commercial and hospitality. The company primarily operates in the United States, South Korea, England, Germany, and Switzerland. FuelCell Energy, Inc. was founded in 1969 and is headquartered in Danbury, Connecticut.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Danbury",
        "zipcode": "06810",
        "website": "http://www.fuelcellenergy.com",
        "market_cap": "Mid Cap"
    },
    "FCEL.VI": {
        "short_name": "FUELCELL ENERGY INC",
        "long_name": "FuelCell Energy, Inc.",
        "summary": "FuelCell Energy, Inc., together with its subsidiaries, designs, manufactures, sells, installs, operates, and services stationary fuel cell power plants for distributed baseload power generation. The company offers SureSource product line based on carbonate fuel cell technology in various configurations, including on-site power, utility grid support, distributed hydrogen, and carbon utilization, as well as micro-grid and multi-megawatt applications; and SureSource Recovery power plants for natural gas pipeline applications. It also provides SureSource Capture system that separates and concentrates carbon dioxide from the flue gases of natural gas, biomass, or coal-fired power plants, as well as industrial facilities; and SOFC/SOEC and Energy Storage, a solution for energy storage using solid oxide technology. The company's SureSource power plants generate clean electricity, usable heat, water, and hydrogen. It serves various markets, such as utilities and independent power producers, industrial and process applications, education and health care, data centers and communication, wastewater treatment, government, morcrogrids, and commercial and hospitality. The company primarily operates in the United States, South Korea, England, Germany, and Switzerland. FuelCell Energy, Inc. was founded in 1969 and is headquartered in Danbury, Connecticut.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "CT",
        "city": "Danbury",
        "zipcode": "06810",
        "website": "http://www.fuelcellenergy.com",
        "market_cap": "Mid Cap"
    },
    "FCELB": {
        "short_name": "FUELCELL ENERGY INC",
        "long_name": "FuelCell Energy, Inc.",
        "summary": "FuelCell Energy, Inc., together with its subsidiaries, designs, manufactures, sells, installs, operates, and services stationary fuel cell power plants for distributed baseload power generation. The company offers SureSource product line based on carbonate fuel cell technology in various configurations, including on-site power, utility grid support, distributed hydrogen, and carbon utilization, as well as micro-grid and multi-megawatt applications; and SureSource Recovery power plants for natural gas pipeline applications. It also provides SureSource Capture system that separates and concentrates carbon dioxide from the flue gases of natural gas, biomass, or coal-fired power plants, as well as industrial facilities; and SOFC/SOEC and Energy Storage, a solution for energy storage using solid oxide technology. The company's SureSource power plants generate clean electricity, usable heat, water, and hydrogen. It serves various markets, such as utilities and independent power producers, industrial and process applications, education and health care, data centers and communication, wastewater treatment, government, morcrogrids, and commercial and hospitality. The company primarily operates in the United States, South Korea, England, Germany, and Switzerland. FuelCell Energy, Inc. was founded in 1969 and is headquartered in Danbury, Connecticut.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Danbury",
        "zipcode": "06810",
        "website": "http://www.fuelcellenergy.com",
        "market_cap": "Nano Cap"
    },
    "FDN.F": {
        "short_name": "ENERSYS  DL-,01",
        "long_name": "EnerSys",
        "summary": "EnerSys provides various stored energy solutions for industrial applications worldwide. The company offers energy systems, which combine enclosures, power conversion, power distribution, and energy storage are used in the telecommunication, broadband and utility industries, uninterruptible power supplies, and other applications requiring stored energy solutions; motive power batteries and chargers that are utilized in electric forklift trucks and other industrial electric powered vehicles; and specialty batteries, which are used in aerospace and defense applications, large over-the-road trucks, automotive, medical, and security systems applications. It also provides battery chargers, power equipment, battery accessories, and outdoor equipment enclosure solutions; and aftermarket and customer support services. The company sells its batteries under the PowerSafe, DataSafe, Hawker, Genesis, Odyssey, Cyclon, IRONCLAD, General Battery, Fiamm Motive Power, Oldham, Express, and NexSys brands. The company was formerly known as Yuasa, Inc. and changed its name to EnerSys in January 2001. EnerSys was incorporated in 2000 and is headquartered in Reading, Pennsylvania.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "Reading",
        "zipcode": "19605",
        "website": "http://www.enersys.com",
        "market_cap": "Mid Cap"
    },
    "FEY2.F": {
        "short_name": "FUELCELL ENERGY  DL-,0001",
        "long_name": "FuelCell Energy, Inc.",
        "summary": "FuelCell Energy, Inc., together with its subsidiaries, designs, manufactures, sells, installs, operates, and services stationary fuel cell power plants for distributed baseload power generation. The company offers SureSource product line based on carbonate fuel cell technology in various configurations, including on-site power, utility grid support, distributed hydrogen, and carbon utilization, as well as micro-grid and multi-megawatt applications; and SureSource Recovery power plants for natural gas pipeline applications. It also provides SureSource Capture system that separates and concentrates carbon dioxide from the flue gases of natural gas, biomass, or coal-fired power plants, as well as industrial facilities; and SOFC/SOEC and Energy Storage, a solution for energy storage using solid oxide technology. The company's SureSource power plants generate clean electricity, usable heat, water, and hydrogen. It serves various markets, such as utilities and independent power producers, industrial and process applications, education and health care, data centers and communication, wastewater treatment, government, morcrogrids, and commercial and hospitality. The company primarily operates in the United States, South Korea, England, Germany, and Switzerland. FuelCell Energy, Inc. was founded in 1969 and is headquartered in Danbury, Connecticut.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CT",
        "city": "Danbury",
        "zipcode": "06810",
        "website": "http://www.fuelcellenergy.com",
        "market_cap": "Mid Cap"
    },
    "FLUX": {
        "short_name": "Flux Power Holdings, Inc.",
        "long_name": "Flux Power Holdings, Inc.",
        "summary": "Flux Power Holdings, Inc., through its subsidiary Flux Power, Inc., designs, develops, manufactures, and sells rechargeable lithium-ion energy storage systems for electric forklifts, airport ground support equipment, and other industrial motive applications in the United States. It offers battery management system (BMS) that provides cell balancing, monitoring, and error reporting functions for battery systems. The company also provides 24-volt onboard chargers for its Class 3 Walkie LiFT packs; and smart wall mounted chargers to interface with its BMS. The company sells its products directly to small companies, end-users, and Fortune 500 companies, as well as through original equipment manufacturers, lift equipment dealers, and battery distributors. Flux Power Holdings, Inc. was incorporated in 1998 and is based in Vista, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Vista",
        "zipcode": "92081",
        "website": "http://www.fluxpower.com",
        "market_cap": "Micro Cap"
    },
    "FWAV": {
        "short_name": "FOURTH WAVE ENERGY INC",
        "long_name": "Fourth Wave Energy, Inc.",
        "summary": "Fourth Wave Energy, Inc. designs energy system to reduce energy consumption and associated carbon emissions in residences and commercial buildings. Its energy system is based on combining solar power and other energy technologies into one fully integrated system. The company is headquartered in San Jose, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Jose",
        "zipcode": "95113",
        "website": "http://fourthwaveenergy.com",
        "market_cap": "Nano Cap"
    },
    "G6G.F": {
        "short_name": "GRAFTECH INTL. LTD DL-,01",
        "long_name": "GrafTech International Ltd.",
        "summary": "GrafTech International Ltd. researches, develops, manufactures, and sells graphite and carbon based products worldwide. It offers graphite electrodes to produce electric arc furnace steel and other ferrous and non-ferrous metals; and petroleum needle coke, a crystalline form of carbon used in the production of graphite electrodes. The company sells its products primarily through direct sales force, independent sales representatives, and distributors. GrafTech International Ltd. was founded in 1886 and is headquartered in Brooklyn Heights, Ohio.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OH",
        "city": "Brooklyn Heights",
        "zipcode": "44131",
        "website": "http://www.graftech.com",
        "market_cap": "Mid Cap"
    },
    "GCLL": {
        "short_name": "GREENCELL INC",
        "long_name": "GreenCell, Inc.",
        "summary": "GreenCell, Inc., a development stage company, engages in developing gas system and appliance igniters, oxygen sensors, fuel cells, and brake pad products primarily for original equipment manufacturers, manufacturers, industry distributors and resellers that operate in the home device, automotive, heating and cooling, and medical industries. The company was founded in 2009 and is headquartered in Penn Yan, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Penn Yan",
        "zipcode": "14527",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "GNAL": {
        "short_name": "GENERATION ALPHA INC",
        "long_name": "Generation Alpha, Inc.",
        "summary": "Generation Alpha, Inc. focuses on the research, design, development, and manufacturing of indoor horticulture lighting and related equipment in the United States and internationally. The company offers digital ballasts; metal halide, and mercury vapor and high-pressure sodium lamps; light emitting diode lighting products that produce less heat; digital lightning controller, a temperature monitoring control system; reflectors; and high intensity ng accessories, as well as plant nutrients and fertilizers. Its primarily serves commercial and retail cannabis growers in the medical and adult use recreational markets; distributors; and retailers. Generation Alpha, Inc. markets its products directly; and through distributors to hydroponic retailers, as well as through direct contacts, online email advertising, social media, trade magazine advertising, trade show promotions, and cross-promotional offerings, as well as ecommerce websites. The company was formerly known as Solis Tek Inc. Generation Alpha, Inc. was incorporated in 2007 and is headquartered in Upland, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Upland",
        "zipcode": "91786",
        "website": "http://genalphainc.com",
        "market_cap": "Nano Cap"
    },
    "GPGC": {
        "short_name": "GLOBAL POLE TRUSION GROUP CORP",
        "long_name": "Global Poletrusion Group Corp",
        "summary": "Global Poletrusion Group Corp., together with its subsidiary, Los Santos Energy Corp provides electrical distribution/transmission poles and towers for utility companies in the United States, Central America, Mexico, Canada, and internationally. It offers composite utility poles and transmission structures. The company was formerly known as Novacab International Inc. and changed its name to Global Poletrusion Group Corp. in April 2017. Global Poletrusion Group Corp. was incorporated in 1995 and is based in Miami, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Miami",
        "zipcode": "33132",
        "website": "http://globalpoletrusiongroup.com",
        "market_cap": "Nano Cap"
    },
    "HAYW": {
        "short_name": "Hayward Holdings, Inc.",
        "long_name": "Hayward Holdings, Inc.",
        "summary": "Hayward Holdings, Inc. operates as a designer, manufacturer, and marketer of various pool equipment and associated automation systems. The company offers a range of pool equipment, including pumps, filters, heaters, automatic cleaners, sanitizers, controls, and LED lights, as well as industrial thermoplastic valves and process liquid control products for in-ground residential pools, above ground pools, and commercial pools. Hayward Holdings, Inc. is based in Berkeley Heights, New Jersey.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Berkeley Heights",
        "zipcode": "07922",
        "website": "http://investor.hayward.com",
        "market_cap": "Mid Cap"
    },
    "HUBB": {
        "short_name": "Hubbell Inc",
        "long_name": "Hubbell Incorporated",
        "summary": "Hubbell Incorporated, together with its subsidiaries, designs, manufactures, and sells electrical and electronic products in the United States and internationally. The company operates through two segments, Electrical Solution and Utility Solution. The Electrical Solution segment offers standard and special application wiring device products, rough-in electrical products, connector and grounding products, lighting fixtures and controls, and other electrical equipment for use in industrial, commercial, and institutional facilities by electrical contractors, maintenance personnel, electricians, utilities, and telecommunications companies, as well as components and assemblies for the natural gas distribution market. It also designs and manufactures various industrial controls, and communication systems for use in the non-residential and industrial markets, as well as in the oil and gas, and mining industries. This segment sells its products through electrical and industrial distributors, home centers, retail and hardware outlets, lighting showrooms, and residential product oriented Internet sites; and special application products primarily through wholesale distributors to contractors, industrial customers, and original equipment manufacturers. The Utility Solution segment designs, manufactures, and sells distribution, transmission, substation, and telecommunications products. This segment sells its products to distributors, as well as directly to users, such as utilities, telecommunication companies, industrial firms, construction and engineering firms, and civil construction, water utility, transportation industries. The company was founded in 1888 and is headquartered in Shelton, Connecticut.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Shelton",
        "zipcode": "06484-1000",
        "website": "http://www.hubbell.com",
        "market_cap": "Large Cap"
    },
    "HUEC.F": {
        "short_name": "HUBBELL INC.  DL-,01",
        "long_name": "Hubbell Incorporated",
        "summary": "Hubbell Incorporated, together with its subsidiaries, designs, manufactures, and sells electrical and electronic products in the United States and internationally. The company operates through two segments, Electrical Solution and Utility Solution. The Electrical Solution segment offers standard and special application wiring device products, rough-in electrical products, connector and grounding products, lighting fixtures and controls, and other electrical equipment for use in industrial, commercial, and institutional facilities by electrical contractors, maintenance personnel, electricians, utilities, and telecommunications companies, as well as components and assemblies for the natural gas distribution market. It also designs and manufactures various industrial controls, and communication systems for use in the non-residential and industrial markets, as well as in the oil and gas, and mining industries. This segment sells its products through electrical and industrial distributors, home centers, retail and hardware outlets, lighting showrooms, and residential product oriented Internet sites; and special application products primarily through wholesale distributors to contractors, industrial customers, and original equipment manufacturers. The Utility Solution segment designs, manufactures, and sells distribution, transmission, substation, and telecommunications products. This segment sells its products to distributors, as well as directly to users, such as utilities, telecommunication companies, industrial firms, construction and engineering firms, and civil construction, water utility, transportation industries. The company was founded in 1888 and is headquartered in Shelton, Connecticut.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CT",
        "city": "Shelton",
        "zipcode": "06484-1000",
        "website": "http://www.hubbell.com",
        "market_cap": "Mid Cap"
    },
    "HYEG": {
        "short_name": "HYDROGEN ENGINE CENTER INC",
        "long_name": "Hydrogen Engine Center, Inc.",
        "summary": "Hydrogen Engine Center, Inc., an alternative energy company, manufactures and installs power generation systems and engines for use in the types of distributive power applications. The company's products include generators and wet-sleeve engines. It serves power generation, agriculture, airport service vehicles, stranded power, and transportation markets; and industrial clients that use alternative fuels, such as hydrogen, natural gas, anhydrous ammonia, methanol, propane, syn-gas, landfill gas and other alternative fuels. The company was founded in 2003 and is based in Algona, Iowa.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "IA",
        "city": "Algona",
        "zipcode": "50511",
        "website": "http://www.hectina.net",
        "market_cap": "Nano Cap"
    },
    "IHGP": {
        "short_name": "INTERACT HOLDINGS GROUP INC",
        "long_name": "Interact Holdings Group, Inc.",
        "summary": "Interact Holdings Group, Inc. provides infrastructure management and technology services. The company intends to restructure its business through the acquisition of additional business opportunities. Interact Holdings Group, Inc. was founded in 1998 and is based in San Diego, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Diego",
        "zipcode": "92108",
        "website": "http://www.interactholdings.com",
        "market_cap": "Nano Cap"
    },
    "IPWR": {
        "short_name": "Ideal Power Inc.",
        "long_name": "Ideal Power Inc.",
        "summary": "Ideal Power Inc. focuses on the development and commercialization of its B-TRAN technology. It develops Bi-directional bi-polar junction TRANsistor solid state switch technology. The company was formerly known as Ideal Power Converters Inc. and changed its name to Ideal Power Inc. in July 2013. Ideal Power Inc. was incorporated in 2007 and is headquartered in Austin, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Austin",
        "zipcode": "78744",
        "website": "http://www.idealpower.com",
        "market_cap": "Nano Cap"
    },
    "KE": {
        "short_name": "Kimball Electronics, Inc.",
        "long_name": "Kimball Electronics, Inc.",
        "summary": "Kimball Electronics, Inc. provides contract electronics manufacturing services and diversified manufacturing services to customers in the automotive, medical, industrial, and public safety end markets. The company's manufacturing services include design services and support, supply chain services and support, and rapid prototyping and product introduction support services, as well as product design, and process validation and qualification services. Its manufacturing services also comprise industrialization and automation of manufacturing processes; reliability testing, including testing of products under a series of environmental conditions; production and testing of printed circuit board assemblies; assembly, production, and packaging of medical disposables and other non-electronic products; design engineering and manufacturing of automation equipment, test and inspection equipment, and precision molded plastics; software design services; and product life cycle management services. The company has operations in the United States, China, Mexico, Poland, Romania, Thailand, and Vietnam. Kimball Electronics, Inc. was founded in 1961 and is headquartered in Jasper, Indiana.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "IN",
        "city": "Jasper",
        "zipcode": "47546",
        "website": "http://www.kimballelectronics.com",
        "market_cap": "Small Cap"
    },
    "LSCG": {
        "short_name": "LIGHTING SCIENCE GROUP CORP",
        "long_name": "Lighting Science Group Corporation",
        "summary": "Lighting Science Group Corporation designs, develops, and markets general illumination products that use light emitting diodes (LEDs) as their light source for retailers and original equipment manufacturers in the United States. It offers a range of LED retrofit lamps to fit into existing light fixtures as replacements for traditional incandescent, compact fluorescent, and halogen lamps; and LED luminaires comprising FreeLED, a street lighting solution that uses solar energy as its power source. The company also provides biological lighting products, which include Good Night and Good Day circadian replacement lamps, VividGro grow light product, MyNature Coastal lamps and outdoor luminaires, and MyNature Grow lighting lamps and high bay luminaires. It serves Residential and office, Retail and hospitality, Government-owned and private infrastructure, and School and university markets through branded and co-branded private label programs, direct sales force, distributors, and independent sales agents. Lighting Science Group Corporation was incorporated in 1988 and is headquartered in West Warwick, Rhode Island.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "RI",
        "city": "West Warwick",
        "zipcode": "02893",
        "website": "http://www.lsgc.com",
        "market_cap": "Nano Cap"
    },
    "LTBR": {
        "short_name": "Lightbridge Corporation",
        "long_name": "Lightbridge Corporation",
        "summary": "Lightbridge Corporation, together with its subsidiaries, develops nuclear fuel technology under the Lightbridge Fuel name. It focuses on developing and commercializing metallic nuclear fuels that could enhance resistance of nuclear fuel in existing and new nuclear reactors with a meaningful impact on addressing climate change and air pollution. The company was formerly known as Thorium Power, Ltd. and changed its name to Lightbridge Corporation in September 2009. Lightbridge Corporation was incorporated in 1992 and is based in Reston, Virginia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Reston",
        "zipcode": "20190",
        "website": "http://www.ltbridge.com",
        "market_cap": "Nano Cap"
    },
    "MCELQ": {
        "short_name": "MILLENNIUM CELL",
        "long_name": "Millennium Cell, Inc.",
        "summary": "Millennium Cell, Inc., a development stage company, develops hydrogen batteries for use primarily in portable electronic devices for the military, medical, industrial, and consumer markets. The hydrogen batteries comprise a fuel cell and hydrogen storage technology. The fuel blends used in the hydrogen battery technology include combination of water, sodium borohydride, and other chemicals. The hydrogen produced by its hydrogen fuel cartridge technology is converted into electricity by a fuel cell. The company develops the technology in partnership with corporate and government entities. It also licenses its hydrogen cartridge technology and designs to companies, which develop fuel cell systems. Millennium Cell has a strategic relationship with The Dow Chemical Company for the commercialization of its hydrogen battery technology in the military and consumer electronics markets, as well as has a joint development and licensing agreement with Horizon Fuel Cells Plc. The company was founded in 1998 and is based in Eatontown, New Jersey. Millennium Cell Inc. is in liquidation.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Eatontown",
        "zipcode": "07724",
        "website": "http://www.millenniumcell.com",
        "market_cap": "Nano Cap"
    },
    "N7ON.F": {
        "short_name": "LIGHTBRIDGE CORP. DL-,001",
        "long_name": "Lightbridge Corporation",
        "summary": "Lightbridge Corporation, together with its subsidiaries, develops nuclear fuel technology under the Lightbridge Fuel name. It focuses on developing and commercializing metallic nuclear fuels that could enhance resistance of nuclear fuel in existing and new nuclear reactors with a meaningful impact on addressing climate change and air pollution. The company was formerly known as Thorium Power, Ltd. and changed its name to Lightbridge Corporation in September 2009. Lightbridge Corporation was incorporated in 1992 and is based in Reston, Virginia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "VA",
        "city": "Reston",
        "zipcode": "20190",
        "website": "http://www.ltbridge.com",
        "market_cap": "Nano Cap"
    },
    "NEOV": {
        "short_name": "NEOVOLTA INC",
        "long_name": "NeoVolta Inc.",
        "summary": "NeoVolta Inc. was incorporated in 2018 and is based in La Jolla, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "La Jolla",
        "zipcode": "92037",
        "website": null,
        "market_cap": null
    },
    "OESX": {
        "short_name": "Orion Energy Systems, Inc.",
        "long_name": "Orion Energy Systems, Inc.",
        "summary": "Orion Energy Systems, Inc. researches, designs, develops, manufactures, markets, sells, installs, and implements energy management systems for commercial office and retail, exterior area lighting, and industrial applications in North America. The company operates in three segments: Orion Engineered Systems, Orion Distribution Services, and Orion U.S. Markets. It offers interior light emitting diode (LED) high bay fixtures; smart building control systems, which provide lighting control options and data intelligence capabilities for building managers; and LED troffer door retrofit for use in office or retail grid ceilings. The company also offers various other LED and HIF fixtures for lighting and energy management needs comprising fixtures for agribusinesses, parking lots, roadways, retail, mezzanine, outdoor applications, and private label resale. In addition, it provides lighting-related energy management services, such as site assessment, site field verification, utility incentive and government subsidy management, engineering design, project management, installation, facility design commissioning, and recycling; and sells and distributes replacement lamps and fixture components into the after-market. The company serves customers directly; and through independent sales agencies and distributors, and electrical contractors and energy service companies. Orion Energy Systems, Inc. was incorporated in 1996 and is headquartered in Manitowoc, Wisconsin.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "WI",
        "city": "Manitowoc",
        "zipcode": "54220",
        "website": "http://www.orionlighting.com",
        "market_cap": "Micro Cap"
    },
    "OPTT": {
        "short_name": "Ocean Power Technologies, Inc.",
        "long_name": "Ocean Power Technologies, Inc.",
        "summary": "Ocean Power Technologies, Inc. develops and commercializes proprietary systems that generate electricity by harnessing the renewable energy of ocean waves in North and South America, Europe, and Asia. It offers PB3 PowerBuoy system that generates power for use independent of the power grid in remote offshore locations. The company also provides hybrid PowerBuoy products; subsea battery systems; and payloads, integration services, and marine installation services. In addition, it offers electric power and real-time data communications for remote offshore and subsea applications in markets, such as offshore oil and gas, defense and security, science and research, and communications. The company serves public and private entities, and agencies that require remote offshore power. Ocean Power Technologies, Inc. was founded in 1984 and is headquartered in Monroe Township, New Jersey.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Monroe Township",
        "zipcode": "08831",
        "website": "http://www.oceanpowertechnologies.com",
        "market_cap": "Micro Cap"
    },
    "ORBT": {
        "short_name": "ORBIT INTERNATIONAL INC",
        "long_name": "Orbit International Corp.",
        "summary": "Orbit International Corp. designs, manufactures, and sells electronic components and subsystems, and commercial and custom power units for prime contractors, government procurement agencies, and research and development laboratories worldwide. The company operates in two segments, Electronics Group and Power Group. The Electronics Group segment engages in the design, manufacture, and sale of customized electronic components and subsystems. This segment's principal products include remote control units, intercommunication panels, displays, keyboards, keypads and pointing devices, operator control trays, and command display units. The Power Group segment designs and manufactures commercial power units, AC power supplies, frequency converters, uninterruptible power supplies, and commercial-off-the-shelf power solutions, as well as the electronic products for measurement and display. The company was formerly known as Orbit Instrument Corp. and changed its name to Orbit International Corp. in July 1991. Orbit International Corp. was founded in 1957 and is based in Hauppauge, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Hauppauge",
        "zipcode": "11788",
        "website": "http://www.orbitintl.com",
        "market_cap": "Nano Cap"
    },
    "OZSC": {
        "short_name": "OZOP ENERGY SOLUTIONS INC",
        "long_name": "Ozop Energy Solutions, Inc.",
        "summary": "Ozop Energy Solutions, Inc., together with its subsidiaries, designs, develops, manufactures, and distributes renewable energy products in the United States. It offers DC and AC power supplies, high voltage battery chargers, converters/inverters, 400hz aircraft ground support equipment, power electronic modules, and other power electronic products. The company also designs and constructs electrical generating PV systems; and provides electric vehicle chargers, as well as distributes components, such as PV panels, solar inverters, solar mounting systems, stationary batteries, onsite generators, and other associated electrical equipment. It serves clients in energy storage, shore power, DEWs, microgrid, telecommunications, military, transportation, renewable energy, aerospace, and mission critical defense systems sectors. The company was founded in 1991 and is based in Warwick, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Warwick",
        "zipcode": "10990",
        "website": "http://www.ozopenergy.com",
        "market_cap": "Small Cap"
    },
    "P4L.F": {
        "short_name": "PREFORMED LINE PROD. DL 2",
        "long_name": "Preformed Line Products Company",
        "summary": "Preformed Line Products Company, together with its subsidiaries, designs and manufactures products and systems used in the construction and maintenance of overhead, ground-mounted, and underground networks for the energy, telecommunication, cable operator, information, and other industries. The company offers formed wire products to support, protect, terminate, and secure power conductor and communication cables, as well as to control cable dynamics; and hardware products to support and protect transmission conductors, spacers, spacer-dampers, stockbridge dampers, corona suppression devices, and various compression fittings for dead-end applications. It also provides protective closures and splice cases to protect fixed line communication networks, such as copper cable or fiber optic cable from moisture, environmental hazards, and other contaminants; and data communication cabinets, hardware assemblies, pole line hardware, resale products, underground connectors, solar hardware systems, guy markers, tree guards, fiber optic cable markers, pedestal markers, and urethane products that are used by energy, renewable energy, communications, cable, and special industries for various applications. The company serves public and private energy utilities and communication companies, cable operators, financial institutions, governmental agencies, contractors and subcontractors, distributors, and value-added resellers in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. It markets its products through a direct sales force, as well as through manufacturing representatives. The company was incorporated in 1947 and is headquartered in Mayfield, Ohio.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OH",
        "city": "Mayfield",
        "zipcode": "44143",
        "website": "http://www.preformed.com",
        "market_cap": "Small Cap"
    },
    "PLPC": {
        "short_name": "Preformed Line Products Company",
        "long_name": "Preformed Line Products Company",
        "summary": "Preformed Line Products Company, together with its subsidiaries, designs and manufactures products and systems used in the construction and maintenance of overhead, ground-mounted, and underground networks for the energy, telecommunication, cable operator, information, and other industries. The company offers formed wire products to support, protect, terminate, and secure power conductor and communication cables, as well as to control cable dynamics; and hardware products to support and protect transmission conductors, spacers, spacer-dampers, stockbridge dampers, corona suppression devices, and various compression fittings for dead-end applications. It also provides protective closures and splice cases to protect fixed line communication networks, such as copper cable or fiber optic cable from moisture, environmental hazards, and other contaminants; and data communication cabinets, hardware assemblies, pole line hardware, resale products, underground connectors, solar hardware systems, guy markers, tree guards, fiber optic cable markers, pedestal markers, and urethane products that are used by energy, renewable energy, communications, cable, and special industries for various applications. The company serves public and private energy utilities and communication companies, cable operators, financial institutions, governmental agencies, contractors and subcontractors, distributors, and value-added resellers in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. It markets its products through a direct sales force, as well as through manufacturing representatives. The company was incorporated in 1947 and is headquartered in Mayfield, Ohio.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Mayfield",
        "zipcode": "44143",
        "website": "http://www.preformed.com",
        "market_cap": "Small Cap"
    },
    "PLUG.MX": {
        "short_name": "PLUG POWER INC",
        "long_name": "Plug Power Inc.",
        "summary": "Plug Power Inc. provides hydrogen fuel cell turnkey solutions for the electric mobility and stationary power markets in North America and Europe. It focuses on proton exchange membrane (PEM) fuel cell and fuel processing technologies, fuel cell/battery hybrid technologies, and related hydrogen storage and dispensing infrastructure. The company offers GenDrive, a hydrogen fueled PEM fuel cell system that provides power to material handling electric vehicles; GenFuel, a hydrogen fueling delivery, generation, storage, and dispensing system; GenCare, an ongoing maintenance and service program for GenDrive and GenSure fuel cells, GenFuel products, and ProGen engines; and GenSure, a stationary fuel cell solution that provides modular PEM fuel cell power to support the backup and grid-support power requirements of the telecommunications, transportation, and utility sectors. It also provides GenKey, a turn-key solution for transitioning to fuel cell power; and ProGen, a fuel cell stack and engine technology used in mobility and stationary fuel cell systems, and as engines in electric delivery vans. The company offers its products to retail-distribution and manufacturing businesses through direct product sales force, original equipment manufacturers, and dealer networks. Plug Power Inc. was founded in 1997 and is headquartered in Latham, New York.",
        "currency": "MXN",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "NY",
        "city": "Latham",
        "zipcode": "12110",
        "website": "http://www.plugpower.com",
        "market_cap": "Large Cap"
    },
    "PLUG": {
        "short_name": "Plug Power, Inc.",
        "long_name": "Plug Power Inc.",
        "summary": "Plug Power Inc. provides hydrogen fuel cell turnkey solutions for the electric mobility and stationary power markets in North America and Europe. It focuses on proton exchange membrane (PEM) fuel cell and fuel processing technologies, fuel cell/battery hybrid technologies, and related hydrogen storage and dispensing infrastructure. The company offers GenDrive, a hydrogen fueled PEM fuel cell system that provides power to material handling electric vehicles; GenFuel, a hydrogen fueling delivery, generation, storage, and dispensing system; GenCare, an ongoing maintenance and service program for GenDrive and GenSure fuel cells, GenFuel products, and ProGen engines; and GenSure, a stationary fuel cell solution that provides modular PEM fuel cell power to support the backup and grid-support power requirements of the telecommunications, transportation, and utility sectors. It also provides GenKey, a turn-key solution for transitioning to fuel cell power; and ProGen, a fuel cell stack and engine technology used in mobility and stationary fuel cell systems, and as engines in electric delivery vans. The company offers its products to retail-distribution and manufacturing businesses through direct product sales force, original equipment manufacturers, and dealer networks. Plug Power Inc. was founded in 1997 and is headquartered in Latham, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Latham",
        "zipcode": "12110",
        "website": "http://www.plugpower.com",
        "market_cap": "Large Cap"
    },
    "PLUG.VI": {
        "short_name": "PLUG POWER INC",
        "long_name": "Plug Power Inc.",
        "summary": "Plug Power Inc. provides hydrogen fuel cell turnkey solutions for the electric mobility and stationary power markets in North America and Europe. It focuses on proton exchange membrane (PEM) fuel cell and fuel processing technologies, fuel cell/battery hybrid technologies, and related hydrogen storage and dispensing infrastructure. The company offers GenDrive, a hydrogen fueled PEM fuel cell system that provides power to material handling electric vehicles; GenFuel, a hydrogen fueling delivery, generation, storage, and dispensing system; GenCare, an ongoing maintenance and service program for GenDrive and GenSure fuel cells, GenFuel products, and ProGen engines; and GenSure, a stationary fuel cell solution that provides modular PEM fuel cell power to support the backup and grid-support power requirements of the telecommunications, transportation, and utility sectors. It also provides GenKey, a turn-key solution for transitioning to fuel cell power; and ProGen, a fuel cell stack and engine technology used in mobility and stationary fuel cell systems, and as engines in electric delivery vans. The company offers its products to retail-distribution and manufacturing businesses through direct product sales force, original equipment manufacturers, and dealer networks. Plug Power Inc. was founded in 1997 and is headquartered in Latham, New York.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "NY",
        "city": "Latham",
        "zipcode": "12110",
        "website": "http://www.plugpower.com",
        "market_cap": "Large Cap"
    },
    "PLUN.DE": {
        "short_name": "PLUG POWER INC. DL-,01",
        "long_name": "Plug Power Inc.",
        "summary": "Plug Power Inc. provides hydrogen fuel cell turnkey solutions for the electric mobility and stationary power markets in North America and Europe. It focuses on proton exchange membrane (PEM) fuel cell and fuel processing technologies, fuel cell/battery hybrid technologies, and related hydrogen storage and dispensing infrastructure. The company offers GenDrive, a hydrogen fueled PEM fuel cell system that provides power to material handling electric vehicles; GenFuel, a hydrogen fueling delivery, generation, storage, and dispensing system; GenCare, an ongoing maintenance and service program for GenDrive and GenSure fuel cells, GenFuel products, and ProGen engines; and GenSure, a stationary fuel cell solution that provides modular PEM fuel cell power to support the backup and grid-support power requirements of the telecommunications, transportation, and utility sectors. It also provides GenKey, a turn-key solution for transitioning to fuel cell power; and ProGen, a fuel cell stack and engine technology used in mobility and stationary fuel cell systems, and as engines in electric delivery vans. The company offers its products to retail-distribution and manufacturing businesses through direct product sales force, original equipment manufacturers, and dealer networks. Plug Power Inc. was founded in 1997 and is headquartered in Latham, New York.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "NY",
        "city": "Latham",
        "zipcode": "12110",
        "website": "http://www.plugpower.com",
        "market_cap": "Large Cap"
    },
    "PLUN.F": {
        "short_name": "PLUG POWER INC. DL-,01",
        "long_name": "Plug Power Inc.",
        "summary": "Plug Power Inc. provides hydrogen fuel cell turnkey solutions for the electric mobility and stationary power markets in North America and Europe. It focuses on proton exchange membrane (PEM) fuel cell and fuel processing technologies, fuel cell/battery hybrid technologies, and related hydrogen storage and dispensing infrastructure. The company offers GenDrive, a hydrogen fueled PEM fuel cell system that provides power to material handling electric vehicles; GenFuel, a hydrogen fueling delivery, generation, storage, and dispensing system; GenCare, an ongoing maintenance and service program for GenDrive and GenSure fuel cells, GenFuel products, and ProGen engines; and GenSure, a stationary fuel cell solution that provides modular PEM fuel cell power to support the backup and grid-support power requirements of the telecommunications, transportation, and utility sectors. It also provides GenKey, a turn-key solution for transitioning to fuel cell power; and ProGen, a fuel cell stack and engine technology used in mobility and stationary fuel cell systems, and as engines in electric delivery vans. The company offers its products to retail-distribution and manufacturing businesses through direct product sales force, original equipment manufacturers, and dealer networks. Plug Power Inc. was founded in 1997 and is headquartered in Latham, New York.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "Latham",
        "zipcode": "12110",
        "website": "http://www.plugpower.com",
        "market_cap": "Large Cap"
    },
    "POLA": {
        "short_name": "Polar Power, Inc.",
        "long_name": "Polar Power, Inc.",
        "summary": "Polar Power, Inc. designs, manufactures, and sells direct current (DC), power generators, renewable energy, and cooling systems in the United States and internationally. It offers DC base power systems, DC hybrid power systems, and DC solar hybrid power systems. The company serves customers in the telecommunications, military, commercial, industrial, and marine markets. It sells its products through direct sales force, and a network of independent service providers and dealers. The company was formerly known as Polar Products, Inc. and changed its name to Polar Power, Inc. in October 1991. Polar Power, Inc. was incorporated in 1979 and is based in Gardena, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Gardena",
        "zipcode": "90248",
        "website": "http://www.polarpower.com",
        "market_cap": "Micro Cap"
    },
    "POWL": {
        "short_name": "Powell Industries, Inc.",
        "long_name": "Powell Industries, Inc.",
        "summary": "Powell Industries, Inc., together with its subsidiaries, designs, develops, manufactures, sells, and services custom-engineered equipment and systems for the distribution, control, and monitoring of electrical energy. The company's principal products include integrated power control room substations, custom-engineered modules, electrical houses, medium-voltage circuit breakers, monitoring and control communications systems, motor control centers, and bus duct systems, as well as traditional and arc-resistant distribution switchgears and control gears. Its products have application in voltages ranging from 480 volts to 38,000 volts; and are used in oil and gas refining, offshore oil and gas production, petrochemical, liquid natural gas terminals, pipeline, terminal, mining and metals, light rail traction power, electric utility, pulp and paper, and other heavy industrial markets. It also provides value-added services, such as spare parts, field service inspection, installation, commissioning, modification and repair, retrofit and retrofill components for existing systems, and replacement circuit breakers for switchgear. The company has operations in the United States, Canada, the Middle East, Africa, the Far East, Europe, Mexico, and Central and South America. Powell Industries, Inc. was founded in 1947 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77075-1180",
        "website": "http://www.powellind.com",
        "market_cap": "Small Cap"
    },
    "PPSI": {
        "short_name": "Pioneer Power Solutions, Inc.",
        "long_name": "Pioneer Power Solutions, Inc.",
        "summary": "Pioneer Power Solutions, Inc., together with its subsidiaries, manufactures, sells, and services specialty electrical transmission, distribution, and on-site power generation equipment in the United States, Canada, and internationally. The company operates in two segments, Transmission & Distribution Solutions and Critical Power Solutions. The Transmission & Distribution Solutions segment designs, develops, and manufactures low and medium voltage electric power distribution panel boards, low voltage switchgears, and switchboards. The Critical Power Solutions segment provides aftermarket field-services to ensure smooth and uninterrupted power to operations during times of emergency. It serves utility, industrial, commercial, and backup power markets. The company was incorporated in 2008 and is headquartered in Fort Lee, New Jersey. Pioneer Power Solutions, Inc. is a subsidiary of Provident Pioneer Partners, L.P.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Fort Lee",
        "zipcode": "07024",
        "website": "http://www.pioneerpowersolutions.com",
        "market_cap": "Nano Cap"
    },
    "PPW.F": {
        "short_name": "POLAR POWER INC. DL-,0001",
        "long_name": "Polar Power, Inc.",
        "summary": "Polar Power, Inc. designs, manufactures, and sells direct current (DC), power generators, renewable energy, and cooling systems in the United States and internationally. It offers DC base power systems, DC hybrid power systems, and DC solar hybrid power systems. The company serves customers in the telecommunications, military, commercial, industrial, and marine markets. It sells its products through direct sales force, and a network of independent service providers and dealers. The company was formerly known as Polar Products, Inc. and changed its name to Polar Power, Inc. in October 1991. Polar Power, Inc. was incorporated in 1979 and is based in Gardena, California.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Gardena",
        "zipcode": "90248",
        "website": "http://www.polarpower.com",
        "market_cap": "Micro Cap"
    },
    "PSTO": {
        "short_name": "POWERSTORM HOLDINGS INC",
        "long_name": "Powerstorm Holdings, Inc.",
        "summary": "Powerstorm Holdings, Inc. focuses on developing and delivering turnkey power management and energy storage solutions worldwide. The company's products include modular energy storage solution, a containerized hybrid energy solution powered by solar and/or wind turbines that consists of a diesel generator/alternator combined with lithium ion battery-based system, which provides renewable off-grid power. It also offers zeroXess, an off-grid solar lighting kit for personal use in small house, humanitarian relief, disaster recovery, and camping applications. The company was formerly known as Powerstorm Capital Corporation and changed its name to Powerstorm Holdings, Inc. in February 2015. Powerstorm Holdings, Inc. was founded in 2011 and is based in Rancho Palos Verdes, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Rancho Palos Verdes",
        "zipcode": "90275",
        "website": "http://www.powerstormcapital.com",
        "market_cap": "Nano Cap"
    },
    "PURY": {
        "short_name": "PURERAY CORPORATION",
        "long_name": "PureRay Corporation",
        "summary": "PureRay Corporation develops and manufactures solar-based charging and lighting systems. The company offers a self-contained and solar-powered lighting and charging solution that consists of a charging station, a solar panel, and a set of three energy-efficient LED light bulbs. Its solution could power LED light bulbs, as well as other appliances, such as fans, radios, TVs, and cell phones. The company provides its products to customers in the United States, as well as in developing countries in Africa, South Asia, the Caribbean, and Latin America. PureRay Corporation was founded in 2007 and is headquartered in Atlanta, Georgia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30305",
        "website": "http://www.pureraycorp.com",
        "market_cap": "Nano Cap"
    },
    "PW2.F": {
        "short_name": "POWELL IND. INC.  DL -,01",
        "long_name": "Powell Industries, Inc.",
        "summary": "Powell Industries, Inc., together with its subsidiaries, designs, develops, manufactures, sells, and services custom-engineered equipment and systems for the distribution, control, and monitoring of electrical energy. The company's principal products include integrated power control room substations, custom-engineered modules, electrical houses, medium-voltage circuit breakers, monitoring and control communications systems, motor control centers, and bus duct systems, as well as traditional and arc-resistant distribution switchgears and control gears. Its products have application in voltages ranging from 480 volts to 38,000 volts; and are used in oil and gas refining, offshore oil and gas production, petrochemical, liquid natural gas terminals, pipeline, terminal, mining and metals, light rail traction power, electric utility, pulp and paper, and other heavy industrial markets. It also provides value-added services, such as spare parts, field service inspection, installation, commissioning, modification and repair, retrofit and retrofill components for existing systems, and replacement circuit breakers for switchgear. The company has operations in the United States, Canada, the Middle East, Africa, the Far East, Europe, Mexico, and Central and South America. Powell Industries, Inc. was founded in 1947 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77075-1180",
        "website": "http://www.powellind.com",
        "market_cap": "Small Cap"
    },
    "PWVI": {
        "short_name": "POWERVERDE INC",
        "long_name": "374Water, Inc.",
        "summary": "374Water, Inc. develops a wastewater treatment systems to recover resources from the waste and to keep drinking water clean. It offers AirSCWO Waste Processors, which is a supercritical water oxidation (SCWO) reactor that converts waste to clean water and carbon dioxide. The processor converts wastes such as biosolids (fecal sludge, primary, secondary, and digested sludge), animal manure, food and beverage waste, pharmaceutical wastes, and hazardous and industrial wastes. The company was incorporated in 2018 and is based in Durham, North Carolina.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Miami",
        "zipcode": "33156",
        "website": "http://www.374water.com",
        "market_cap": "Nano Cap"
    },
    "QBAK": {
        "short_name": "QUALSTAR CORP",
        "long_name": "Qualstar Corporation",
        "summary": "Qualstar Corporation engages in power solutions and data storage systems businesses worldwide. The company operates through two segments, Power Solutions and Data Storage Systems. It provides data storage systems under the Qualstar brand and power solutions under the N2Power brand. The company designs, manufactures, and sells switching power supplies that are used to convert AC line voltage to DC voltages; or DC voltages to other DC voltages for use in various electronic equipment, such as telecommunications equipment, machine tools, routers, switches, wireless systems, and gaming devices. It also supports and sells data storage devices used to store, retrieve, and manage electronic data primarily in network computing environments. The company serves original equipment manufacturers, information technology departments, and lower and middle market companies through distributor and reseller network, distributors, and independent outside sales representatives. Qualstar Corporation was founded in 1984 and is based in Camarillo, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Camarillo",
        "zipcode": "93012",
        "website": "http://www.qualstar.com",
        "market_cap": "Nano Cap"
    },
    "QCTA.F": {
        "short_name": "BELDEN INC.  DL -,01",
        "long_name": "Belden Inc.",
        "summary": "Belden Inc. operates as a signal transmission solutions company in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. It operates in two segments, Enterprise Solutions and Industrial Solutions. The Enterprise Solutions segment offers copper cable and connectivity solutions, fiber cable and connectivity solutions, racks and enclosures, and signal extension and matrix switching systems for use in applications, such as local area networks, data centers, access control, fiber, and home and building automation. It also provides power, cooling, and airflow management products for mission-critical data center operations; and end-to-end copper and fiber network systems, which include cable, assemblies, interconnect panels, and enclosures. This segment serves customers in markets comprising healthcare, education, financial, government, and corporate enterprises, as well as end-markets, including sports venues and academia. The Industrial Solutions segment offers infrastructure components and on-machine connectivity systems; and industrial Ethernet switches, network management software, routers, firewalls, gateways, input/output (I/O) connectors/systems, industrial Ethernet cables, optical fiber industrial Ethernet cables, Fieldbus cables, IP and networking cables, I/O modules, distribution boxes, and customer specific wiring solutions. This segment provides its products for use in industrial automation applications comprising network and fieldbus infrastructure; sensor and actuator connectivity; and power, control, and data transmission; and supplies heat-shrinkable tubing and wire management products to protect and organize wire and cable assemblies. It serves distributors, original equipment manufacturers, installers, and end-users. The company was formerly known as Belden CDT Inc. and changed its name to Belden Inc. in May 2007. Belden Inc. was founded in 1902 and is based in St. Louis, Missouri.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MO",
        "city": "Saint Louis",
        "zipcode": "63105",
        "website": "http://www.belden.com",
        "market_cap": "Mid Cap"
    },
    "RF5.F": {
        "short_name": "RF INDUSTRIES  DL-,01",
        "long_name": "RF Industries, Ltd.",
        "summary": "RF Industries, Ltd., together with its subsidiaries, designs, manufactures, and markets interconnect products and systems in the United States, Canada, Mexico, and internationally. The company operates through two segments, RF Connector and Cable Assembly and Custom Cabling Manufacturing and Assembly. The company's RF Connector and Cable Assembly segment designs, manufactures, and distributes coaxial connectors and cable assemblies that are integrated with coaxial connectors. The Custom Cabling Manufacturing and Assembly segment designs, manufactures, markets and distributes custom copper and fiber cable assemblies, complex hybrid fiber optic and power solution cables, energy-efficient cooling systems for wireless base stations and remote equipment shelters, and custom designed pole-ready 5G small cell integrated enclosures. It also manufactures and sells custom and standard cable assemblies, hybrid fiber optic power solution cables, adapters, and electromechanical wiring harnesses for communication, computer, LAN, automotive, and medical equipment. In addition, the company designs and manufactures cable assemblies and wiring harnesses for blue chip industrial, oilfield, instrumentation, and military customers. It also designs and manufactures quality connectivity solutions to telecommunications and data communications distributors. The company sells its products through warehousing distributors and in-house marketing and sales team. It serves telecommunications carriers and equipment manufacturers, wireless and network infrastructure carriers, and OEMs. The company was formerly known as Celltronics, Inc. and changed its name to RF Industries, Ltd. in November 1990. RF Industries, Ltd. was founded in 1979 and is headquartered in San Diego, California.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "San Diego",
        "zipcode": "92126-4202",
        "website": "http://www.rfindustries.com",
        "market_cap": "Micro Cap"
    },
    "RFIL": {
        "short_name": "RF Industries, Ltd.",
        "long_name": "RF Industries, Ltd.",
        "summary": "RF Industries, Ltd., together with its subsidiaries, designs, manufactures, and markets interconnect products and systems in the United States, Canada, Mexico, and internationally. The company operates through two segments, RF Connector and Cable Assembly and Custom Cabling Manufacturing and Assembly. The company's RF Connector and Cable Assembly segment designs, manufactures, and distributes coaxial connectors and cable assemblies that are integrated with coaxial connectors. The Custom Cabling Manufacturing and Assembly segment designs, manufactures, markets and distributes custom copper and fiber cable assemblies, complex hybrid fiber optic and power solution cables, energy-efficient cooling systems for wireless base stations and remote equipment shelters, and custom designed pole-ready 5G small cell integrated enclosures. It also manufactures and sells custom and standard cable assemblies, hybrid fiber optic power solution cables, adapters, and electromechanical wiring harnesses for communication, computer, LAN, automotive, and medical equipment. In addition, the company designs and manufactures cable assemblies and wiring harnesses for blue chip industrial, oilfield, instrumentation, and military customers. It also designs and manufactures quality connectivity solutions to telecommunications and data communications distributors. The company sells its products through warehousing distributors and in-house marketing and sales team. It serves telecommunications carriers and equipment manufacturers, wireless and network infrastructure carriers, and OEMs. The company was formerly known as Celltronics, Inc. and changed its name to RF Industries, Ltd. in November 1990. RF Industries, Ltd. was founded in 1979 and is headquartered in San Diego, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Diego",
        "zipcode": "92126-4202",
        "website": "http://www.rfindustries.com",
        "market_cap": "Micro Cap"
    },
    "RUOC.F": {
        "short_name": "OCEAN POWER TECH.  DL-,01",
        "long_name": "Ocean Power Technologies, Inc.",
        "summary": "Ocean Power Technologies, Inc. develops and commercializes proprietary systems that generate electricity by harnessing the renewable energy of ocean waves in North and South America, Europe, and Asia. It offers PB3 PowerBuoy system that generates power for use independent of the power grid in remote offshore locations. The company also provides hybrid PowerBuoy products; subsea battery systems; and payloads, integration services, and marine installation services. In addition, it offers electric power and real-time data communications for remote offshore and subsea applications in markets, such as offshore oil and gas, defense and security, science and research, and communications. The company serves public and private entities, and agencies that require remote offshore power. Ocean Power Technologies, Inc. was founded in 1984 and is headquartered in Monroe Township, New Jersey.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NJ",
        "city": "Monroe Township",
        "zipcode": "08831",
        "website": "http://www.oceanpowertechnologies.com",
        "market_cap": "Micro Cap"
    },
    "SVT": {
        "short_name": "Servotronics, Inc.",
        "long_name": "Servotronics, Inc.",
        "summary": "Servotronics, Inc. designs, manufactures, and markets control components and consumer products in the United States and internationally. It operates in two segments, Advanced Technology Group (ATG) and Consumer Products Group (CPG). The ATG segment provides servo-control components to the commercial aerospace, aircraft, and government related industries; and medical and industrial markets. This segment's principal components include torque motors, electromagnetic actuators, hydraulic and pneumatic valves, and related devices that convert an electrical current into a mechanical force or movement, and other products. It also offers metallic seals of various cross-sectional configurations to close tolerances from standard and special alloy steels. This segment markets and sells its products to the United States Government, government prime contractors, government subcontractors, commercial manufacturers, and end-users. The CPG segment provides cutlery products, including steak, carving, bread, butcher, and paring knives for household use, as well as for use in restaurants, institutions, and the private industry; fixed and folding knives for hunting, fishing, and camping; and machetes, bayonets, axes, strap cutters, and other tools primarily for military and rescue/first-responder use, as well as for commercial markets. It also offers various specialty tools, putty knives, linoleum sheet cutters, field knives, scalpels, and micro-spatulas; and plastic and metal fabrication, as well as engineering, design, and OEM/white-label manufacturing services to customers in the consumer and commercial industries. This segment markets its products through its sales resources and independent manufacturers' representatives to big box, hardware, supermarket, variety, department, discount, gift, drug, outdoor, and sporting stores, as well as through electronic commerce. The company was incorporated in 1959 and is headquartered in Elma, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Elma",
        "zipcode": "14059",
        "website": "http://www.servotronics.com",
        "market_cap": "Nano Cap"
    },
    "TAER": {
        "short_name": "TARSIER LTD",
        "long_name": "Tarsier Ltd.",
        "summary": "Tarsier Ltd., through its subsidiaries, manufactures and distributes energy efficient products in Kazakhstan and other Eastern European countries. It also focuses on acquiring the assets of various companies in the energy sector. The company would serve approximately 6,000 commercial and residential energy customers who are purchasing electric and/or natural gas from the targeted companies. It offers T-Flow Energy Management System, a proprietary energy management software platform; and operates ShopTarsier.com, an e-commerce portal that would sell LED Bulbs and other energy saving and home/business automation products in consumer market. In addition, the company offers LED lighting products, such as LED streetlights and LED bulbs. Further, it provides streetlights and solar lights for fitting with an array of optional equipment, including surveillance, monitoring, and communications devices. The company was formerly known as Huayue Electronics, Inc. and changed its name to Tarsier Ltd. in December 2015. Tarsier Ltd. was founded in 1999 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10016",
        "website": "http://www.tarsierltd.com",
        "market_cap": "Nano Cap"
    },
    "TNRK": {
        "short_name": "TNR TECHICAL INC COM",
        "long_name": "TNR Technical, Inc.",
        "summary": "TNR Technical, Inc. designs, assembles, and markets batteries and multi-cell battery packs to industrial, commercial, and retail markets in the United States. The company's batteries are used in various applications, such as utilities, personal watercraft, photography, power tools, watches, instrumentation, laptops, CNC, airsoft, surveying equipment, radio control, mobile radios, alarms, U.P.S., door locks, marine, medical, mobility, motorcycle, programmable logic controllers, and emergency lighting, as well as other various consumer products. It also distributes nickel-cadmium, nickel metal hydride, alkaline, lithium, and sealed lead acid batteries. The company sells its batteries and battery packs to original equipment manufacturers, municipalities, hotels/resorts, military, aerospace, government agencies, electrical wholesalers, battery distributors, exporters, and consumers. TNR Technical, Inc. was founded in 1979 and is based in Sanford, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Sanford",
        "zipcode": "32771",
        "website": "http://www.tnrtechnical.com",
        "market_cap": "Nano Cap"
    },
    "TRUL": {
        "short_name": "TRULITE INC",
        "long_name": "Trulite, Inc.",
        "summary": "Trulite, Inc., a development stage company, engages in the development, production, sourcing, marketing, and sale of portable, semi-portable and stationary products, components, and systems that generate powers for off-grid applications in the United States. The company offers hydrogen fuel cells, photovoltaic solar panels, wind micro-turbines, batteries, charge controllers, and inverters. It provides HydroCell that utilizes a cartridge filled with a chemical hydride that, when injected with water, produces hydrogen on demand for portable and stationary power devices; and integrated fuel cell power generation system that uses the HydroCell. The company also provides Kitty Hawk system, which consists of various technologies that generates hydrogen gas from dry chemical hydride compounds; transforms the hydrogen gas into electricity; and controls for the flow of hydrogen for the actual generation of electricity. Its products are used for back-up power, off-grid power, and remote monitoring applications. The company was founded in 2004 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77010",
        "website": "http://www.trulitetech.com",
        "market_cap": "Nano Cap"
    },
    "UBW1.F": {
        "short_name": "BABCOCK+WILCOX ENT.DL-,01",
        "long_name": "Babcock & Wilcox Enterprises, Inc.",
        "summary": "Babcock & Wilcox Enterprises, Inc., together with its subsidiaries, provides energy and environmental technologies and services for the power and industrial markets worldwide. The company operates through three segments: Babcock & Wilcox Renewable; Babcock & Wilcox Environmental; and Babcock & Wilcox Thermal. The Babcock & Wilcox Renewable segment offers technologies for waste-to-energy and biomass energy systems, as well as black liquor systems for the pulp and paper industry. This segment provides technologies support solutions for diverting waste from landfills to use for power generation and replacing fossil fuels while recovering metals and reducing emissions. The Babcock & Wilcox Environmental segment offers a range of emissions control and environmental technology solutions for utility, waste to energy, biomass, carbon black, and industrial steam generation applications. This segment provides systems for cooling, ash handling, particulate control, nitrogen oxides and sulfur dioxides removal, chemical looping for carbon control, and mercury control. The Babcock & Wilcox Thermal segment offers steam generation equipment; aftermarket parts; and construction, maintenance, and field services for plants in the power generation, oil and gas, and industrial sectors. This segment has an installed equipment for utilities and general industrial applications, including refining, petrochemical, food processing, metals, and others. Babcock & Wilcox Enterprises, Inc. was founded in 1867 and is headquartered in Akron, Ohio.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OH",
        "city": "Akron",
        "zipcode": "44305",
        "website": "http://www.babcock.com",
        "market_cap": "Small Cap"
    },
    "ULB.F": {
        "short_name": "ULTRALIFE CORP.  DL -,10",
        "long_name": "Ultralife Corporation",
        "summary": "Ultralife Corporation, together with its subsidiaries, designs, manufactures, installs, and maintains power, and communication and electronics systems worldwide. The company serves government, defense, and commercial sectors. The company operates in two segments, Battery & Energy Products and Communications Systems. The Battery & Energy Products segment offers lithium 9-volt, cylindrical, thin lithium manganese dioxide, rechargeable, and other non-rechargeable batteries; lithium-ion cells, multi-kilowatt module lithium ion battery systems, and uninterruptable power supplies; and rugged military and commercial battery charging systems and accessories, including smart chargers, multi-bay charging systems, and various cables. The Communications Systems segment provides communications systems and accessories to support military communications systems, such as radio frequency amplifiers, power supplies and cables, connector assemblies, amplified speakers, equipment mounts, case equipment, man-portable systems, and integrated communication systems for fixed or vehicle applications comprising vehicle adapters, vehicle installed power enhanced rifleman appliquÃ© systems, and SATCOM systems. This segment's military communications systems and accessories are designed to enhance and extend the operation of communications equipment, such as vehicle-mounted, manpack, and handheld transceivers. It sells its products under the Ultralife, Lithium Power, McDowell Research, AMTI, ABLE, ACCUTRONICS, ACCUPRO, ENTELLION, SWE Southwest Electronic Energy Group, SWE DRILL-DATA, and SWE SEASAFE brands through original equipment manufacturers, and industrial and defense supply distributors, as well as directly to the United States and international defense departments. In addition, the company sells its 9-volt battery to the broader consumer market through national and regional retail chains and online retailers. The company was founded in 1990 and is headquartered in Newark, New York.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "Newark",
        "zipcode": "14513",
        "website": "http://www.ultralifecorporation.com",
        "market_cap": "Micro Cap"
    },
    "ULBI": {
        "short_name": "Ultralife Corporation",
        "long_name": "Ultralife Corporation",
        "summary": "Ultralife Corporation, together with its subsidiaries, designs, manufactures, installs, and maintains power, and communication and electronics systems worldwide. The company serves government, defense, and commercial sectors. The company operates in two segments, Battery & Energy Products and Communications Systems. The Battery & Energy Products segment offers lithium 9-volt, cylindrical, thin lithium manganese dioxide, rechargeable, and other non-rechargeable batteries; lithium-ion cells, multi-kilowatt module lithium ion battery systems, and uninterruptable power supplies; and rugged military and commercial battery charging systems and accessories, including smart chargers, multi-bay charging systems, and various cables. The Communications Systems segment provides communications systems and accessories to support military communications systems, such as radio frequency amplifiers, power supplies and cables, connector assemblies, amplified speakers, equipment mounts, case equipment, man-portable systems, and integrated communication systems for fixed or vehicle applications comprising vehicle adapters, vehicle installed power enhanced rifleman appliquÃ© systems, and SATCOM systems. This segment's military communications systems and accessories are designed to enhance and extend the operation of communications equipment, such as vehicle-mounted, manpack, and handheld transceivers. It sells its products under the Ultralife, Lithium Power, McDowell Research, AMTI, ABLE, ACCUTRONICS, ACCUPRO, ENTELLION, SWE Southwest Electronic Energy Group, SWE DRILL-DATA, and SWE SEASAFE brands through original equipment manufacturers, and industrial and defense supply distributors, as well as directly to the United States and international defense departments. In addition, the company sells its 9-volt battery to the broader consumer market through national and regional retail chains and online retailers. The company was founded in 1990 and is headquartered in Newark, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Newark",
        "zipcode": "14513",
        "website": "http://www.ultralifecorporation.com",
        "market_cap": "Micro Cap"
    },
    "USGA": {
        "short_name": "US GLOBAL NANOSPACE INC",
        "long_name": "US Global Nanospace, Inc.",
        "summary": "US Global Nanospace, Inc., a research and development company, is engaged in identifying, developing, and commercializing technologies and products for integration into the security, defense, and health and safety markets. It offers modular autonomous perimeter security and non-lethal defense system, an autonomous, intelligent, and integrated wide area perimeter security and denial system for large wide area perimeter applications, such as international and sovereign borders, oil and gas infrastructure, and other high value critical asset installations. The company also provides non-toxic decontaminant foam for the neutralization of chemical and biological weapons and contaminants; filter element materials; lightweight blast mitigation materials; castable blast mitigation products for munitions containers, munitions storage facilities, and other applications; and lightweight shielded turret for the high mobility multipurpose wheeled vehicles. In addition, it offers light weight anti-ballistic\\blast fragment barrier materials; antiballistic replacement door skin products that are lightweight antiballistic panels designed to protect vehicle occupants in elevated-threat locations; cigarette filters; and radomes, a protective housing for radar antenna. It serves aerospace, homeland security, defense, transportation, construction, and industrial markets. US Global Nanospace, Inc. was founded in 2002 and is based in Carson City, Nevada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Carson City",
        "zipcode": "89706",
        "website": "http://www.usgn.com",
        "market_cap": "Nano Cap"
    },
    "USLG": {
        "short_name": "US LIGHTING GROUP INC",
        "long_name": "US Lighting Group, Inc.",
        "summary": "US Lighting Group, Inc. designs, manufactures, and distributes commercial LED lighting products in the United States and internationally. It provides LED digital gauges and accessories for commercial and industrial customers, as well as LED lighting tubes and bulbs. The company also offers direct fit replacement gauge panels for specific vehicle models; universal gauges for other makes and models of classic cars; and vehicle lighting, ignition systems, RPM switches, and other automotive electronics, as well as GPS controlled marine speedometers and Prometheus ignition systems to guard against ignition failures. In addition, it is involved in the original equipment manufacturing of electronics. The company was formerly known as Luxurious Travel Corp. and changed its name to US Lighting Group, Inc. in September 2016. US Lighting Group, Inc. was founded in 2003 and is based in Euclid, Ohio.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Euclid",
        "zipcode": "44117",
        "website": "http://www.uslightinggroup.com",
        "market_cap": "Nano Cap"
    },
    "VRT": {
        "short_name": "Vertiv Holdings, LLC",
        "long_name": "Vertiv Holdings Co",
        "summary": "Vertiv Holdings Co, together with its subsidiaries, designs, manufactures, and services critical digital infrastructure technologies and life cycle services for data centers, communication networks, and commercial and industrial environments in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. It offers power management products, uninterruptible power systems, thermal management products, integrated rack systems, modular solutions, and management systems for monitoring and controlling digital infrastructure that are integral to the technologies used for various services, including e-commerce, online banking, file sharing, video on-demand, energy storage, wireless communications, Internet of Things, and online gaming. The company also provides lifecycle management services, predictive analytics, and professional services for deploying, maintaining, and optimizing these products and their related systems. It offers its products primarily under the Liebert, NetSure, Geist, and Avocent brands. The company serves social media, financial services, healthcare, transportation, retail, education, and government industries through a network of direct sales professionals, independent sales representatives, channel partners, and original equipment manufacturers. Vertiv Holdings Co is headquartered in Columbus, Ohio.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Columbus",
        "zipcode": "43085",
        "website": "http://www.vertiv.com",
        "market_cap": "Mid Cap"
    },
    "WIRE": {
        "short_name": "Encore Wire Corporation",
        "long_name": "Encore Wire Corporation",
        "summary": "Encore Wire Corporation manufactures and sells electrical building wires and cables for interior electrical wiring in the United States. Its products include NM-B cables for use as interior wiring in homes, apartments, and manufactured housing; THHN/THWN-2 cables and metal-clad and armored cables for use as wiring in commercial and industrial buildings; UF-B cables; XHHW-2 cables; RHH/RHW-2 cables; USE-2 cables; and other types of wire products. The company sells its products to wholesale electrical distributors primarily through independent manufacturers' representatives. Encore Wire Corporation was incorporated in 1989 and is headquartered in McKinney, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "McKinney",
        "zipcode": "75069",
        "website": "http://www.encorewire.com",
        "market_cap": "Small Cap"
    },
    "XNNHQ": {
        "short_name": "XENONICS HOLDINGS INC",
        "long_name": "Xenonics Holdings, Inc.",
        "summary": "Xenonics Holdings, Inc. designs, manufactures, and markets portable illumination products and low light viewing systems (night vision) in the United States. It offers NightHunter ONE, a lightweight illumination system, which can be used on vehicles, boats, and helicopters; NightHunter EXT, a lightweight illumination system for mounting on heavy guns and for use on stationary platforms, or vehicles, boats, or helicopters; and NightHunter 3 for handheld use or mounting on light, medium, and heavy machine guns or vehicles. The company also provides SuperVision that allows user to see in the dark with clarity than conventional night vision; SuperVision Video Out to connect the video signal to a computer recording device or monitor for surveillance; SuperVision Tactical Packages for law enforcement professionals; and SuperVision Vehicle Patrol Packages to make law enforcement patrol operations safer. It markets its illumination products under the NightHunter brand and night vision products under the SuperVision brand. The company serves military forces; the U.S. Department of Homeland Security; law enforcement, fire, search, and rescue; and commercial markets. Xenonics Holdings, Inc. was founded in 1996 and is headquartered in Carlsbad, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Carlsbad",
        "zipcode": "92010",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "ZNRG": {
        "short_name": "ZNERGY INC",
        "long_name": "Znergy, Inc.",
        "summary": "Znergy, Inc. provides lighting products, lighting controls, and energy management solutions in the United States. It is also involved in the retrofitting of lighting solutions. The company was formerly known as Mazzal Holding Corp. Znergy, Inc. was founded in 2013 and is based in Syracuse, Indiana.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "IN",
        "city": "Syracuse",
        "zipcode": "46567",
        "website": "http://www.znergyworld.com",
        "market_cap": "Nano Cap"
    }
}