{
    "109.F": {
        "short_name": "CASTLIGHT HEALT.B DL-0001",
        "long_name": "Castlight Health, Inc.",
        "summary": "Castlight Health, Inc. provides health navigation solutions for employers and health plan customers in education, manufacturing, retail, government, and technology industries in the United States. It provides Care Guidance Navigator that enables users to make better care decisions and navigate the employer-sponsored healthcare benefit programs; Wellbeing Navigator, which helps to drive engagement across an employer's benefits program; Complete Health Navigator that combines the Wellbeing Navigator and Care Guidance Navigator packages for unified user experience; and Castlight Care Guides, a high-touch navigation service. The company also offers white-labeled health navigation solutions and embedded platform technology services. In addition, it provides implementation and marketplace services. The company was formerly known as Ventana Health Services and changed its name to Castlight Health, Inc. in April 2010. Castlight Health, Inc. was incorporated in 2008 and is headquartered in San Francisco, California.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "San Francisco"
    },
    "19P.F": {
        "short_name": "PHREESIA INC.  DL-,01",
        "long_name": "Phreesia, Inc.",
        "summary": "Phreesia, Inc. provides an integrated SaaS-based software and payment platform for the healthcare industry in the United States and Canada. Its Phreesia Platform offers a suite of solutions to manage the patient intake process, as well as an integrated payments solution for processing of patient payments. The company deploys its platform in a range of modalities, such as Phreesia Mobile, a patients' mobile device; Phreesia Dashboard, a Web-based dashboard for providers; PhreesiaPads, which are self-service intake tablets; and Arrivals Kiosks that are on-site kiosks. Its Phreesia Platform also provides a registration solution to automate patient self-registration; revenue cycle solution, which offer insurance-verification processes, point-of-sale payments applications, and cost estimation tools; appointments solution for online appointments, reminders, and referral tracking; and patient activation solution that enables providers to communicate with their patients through surveys, announcements, messaging, and health campaigns. In addition, the company's Phreesia Platform offers clinical support solution, which collects clinical intake and PRO data for approximately 25 specialties; and life sciences solution to deliver targeted and clinically relevant marketing content to patients, as well as COVID-19 product offerings for managing COVID-19 vaccine delivery and identify vaccine-hesitant patients, screening for self-reported COVID-19 risk factors, enabling contactless check-in during in-person visits, and collecting intake information during telehealth visits. It serves patients; single-specialty practices, multi-specialty groups, and health systems; and pharmaceutical, medical device, and biotechnology companies. The company was founded in 2005 and is headquartered in Raleigh, North Carolina.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Raleigh"
    },
    "2HE.F": {
        "short_name": "HEALTHEQUITY INC.DL-,0001",
        "long_name": "HealthEquity, Inc.",
        "summary": "HealthEquity, Inc. provides technology-enabled services platforms to consumers and employers in the United States. The company offers cloud-based platforms for individuals to make health saving and spending decisions, pay healthcare bills, compare treatment options and prices, receive personalized benefit and clinical information, earn wellness incentives, grow their savings, and make investment choices; and health savings accounts. It also provides mutual fund investment platform; and online-only automated investment advisory services through Advisor, a Web-based tool. In addition, the company offers flexible spending accounts; health reimbursement arrangements; and Consolidated Omnibus Budget Reconciliation Act continuation services, as well as administers pre-tax commuter benefit programs. It serves clients through a direct sales force; benefits brokers and advisors; and a network of health plans, benefits administrators, benefits brokers and consultants, and retirement plan record-keepers. HealthEquity, Inc. was incorporated in 2002 and is headquartered in Draper, Utah.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Draper"
    },
    "2NJ.DE": {
        "short_name": "COVETRUS INC.",
        "long_name": "Covetrus, Inc.",
        "summary": "Covetrus, Inc., together with its subsidiaries, operates as an animal-health technology and services company. It engages in the sale of animal-health consumable products, including proprietary and Covetrus branded products, small equipment, laboratory products, large equipment, equipment repair services, branded and generic pharmaceuticals, vaccines, surgical products, diagnostic tests, infection-control products, parasiticides, and vitamins and supplements to wholesale and retail customers. The company also offers value-added solutions that include, inventory management and e-commerce, as well as continuing education services for practitioners. In addition, it provides practice management software systems for veterinary practitioners and animal-health clinics, client communication services, reminders, data backup services, and hardware sales and support services. Further, the company engages in the distribution of finished goods pharmacy and specialty pharmaceutical compounding products, as well as shipping, manufacturer incentives, service fees, and data integration and support services. It serves animal-health and veterinary practices, and clinics in the companion-animal and equine markets primarily in North America, Europe, and the Asia Pacific. The company was formerly known as HS Spinco, Inc. Covetrus, Inc. was incorporated in 2018 and is headquartered in Portland, Maine.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Portland"
    },
    "2NJ.F": {
        "short_name": "COVETRUS INC.",
        "long_name": "Covetrus, Inc.",
        "summary": "Covetrus, Inc., together with its subsidiaries, operates as an animal-health technology and services company. It engages in the sale of animal-health consumable products, including proprietary and Covetrus branded products, small equipment, laboratory products, large equipment, equipment repair services, branded and generic pharmaceuticals, vaccines, surgical products, diagnostic tests, infection-control products, parasiticides, and vitamins and supplements to wholesale and retail customers. The company also offers value-added solutions that include, inventory management and e-commerce, as well as continuing education services for practitioners. In addition, it provides practice management software systems for veterinary practitioners and animal-health clinics, client communication services, reminders, data backup services, and hardware sales and support services. Further, the company engages in the distribution of finished goods pharmacy and specialty pharmaceutical compounding products, as well as shipping, manufacturer incentives, service fees, and data integration and support services. It serves animal-health and veterinary practices, and clinics in the companion-animal and equine markets primarily in North America, Europe, and the Asia Pacific. The company was formerly known as HS Spinco, Inc. Covetrus, Inc. was incorporated in 2018 and is headquartered in Portland, Maine.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Portland"
    },
    "43T.F": {
        "short_name": "TABULA RASA HEAL.DL-,0001",
        "long_name": "Tabula Rasa HealthCare, Inc.",
        "summary": "Tabula Rasa HealthCare, Inc. operates as a healthcare technology company in the United States. The company operates through two segments, CareVention HealthCare and MedWise HealthCare. It offers EireneRx, a cloud-based medication decision-support and e-prescribing platform to access patient medication-related information; and MedWise software that provides medication decision support components for clients seeking to manage their medication risk and improve medication outcomes, and patient relationships by enhancing their existing programs or systems. The company also provides RxCompanion, a cloud-based MTM software platform designed to aid in the identification and resolution of medication and other health related problems; TruChart, a web-based electronic health record for Programs of All-Inclusive Care for the Elderly (PACE) organizations; PACElogic, which delivers real-time sharable workflows comprising EHR, customer relationship management, claims adjudication, electronic data interchange, care management, coordination and planning, integration with community-based providers, and various federal and state required reporting. In addition, the company offers DoseMeRx, a decision support software; PrescribeWellness, a patient engagement center platform; and clinical pharmacist collaboration, prescription fulfillment and reminder packaging, and pharmacy cost management services, as well as health plan management services, including risk adjustment and third party administrator services. As of December 31, 2020, it served approximately 130 healthcare organizations; and 280 health plans and approximately 14,000 retail pharmacies. The company provides cloud-based software applications to assist prescribers and pharmacists. Tabula Rasa HealthCare, Inc. was founded in 2009 and is headquartered in Moorestown, New Jersey.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Moorestown"
    },
    "4LL.F": {
        "short_name": "TELADOC HEALTH INC.DL-001",
        "long_name": "Teladoc Health, Inc.",
        "summary": "Teladoc Health, Inc. provides virtual healthcare services on a business-to-business basis in the United States and internationally. It covers various clinical conditions, including non-critical, episodic care, chronic, and complicated cases like cancer and congestive heart failure, as well as offers telehealth solutions, chronic condition management, expert medical services, behavioral health solutions, guidance and support, and platform and program services. It serves health employers, health plans, hospitals, health systems, and insurance and financial services companies. The company offers its products and services under the Teladoc, Livongo, Advance Medical, Best Doctors, BetterHelp, and HealthiestYou brands. The company was formerly known as Teladoc, Inc. and changed its name to Teladoc Health, Inc. in August 2018. Teladoc Health, Inc. was Incorporated in 2002 and is headquartered in Purchase, New York.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Purchase"
    },
    "4NE1.F": {
        "short_name": "ACCOLADE INC.  DL-,0001",
        "long_name": "Accolade, Inc.",
        "summary": "Accolade, Inc. develops and provides technology-enabled solutions that help people understand, navigate, and utilize the healthcare system and their workplace benefits in the United States. The company offers a platform with cloud-based technology and with multimodal support from a team of health assistants and clinicians, including nurses, physician medical directors, and behavioral health specialists. Its customers are primarily employers who provide their employees and their employees' families a single place to turn for their health, healthcare, and benefits needs. Accolade, Inc. was founded in 2007 and is headquartered in Plymouth Meeting, Pennsylvania.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Plymouth Meeting"
    },
    "4R8.F": {
        "short_name": "SCWORK CORP.  DL-,01",
        "long_name": "SCWorx Corp.",
        "summary": "SCWorx Corp. provides software solutions for the management of health care providers' foundational business applications in the United States. The company provides services related to repair, normalization, and interoperability of information, as well as big data analytics model that provides Web portal for display, and reporting and analysis of the information contained within the data warehouse. It also offers various software solutions and services, such as virtualized item master file repair, expansion, and automation; electronic medical record management, a module that integrates the advanced data attributes created in the item master to the electronic medical records; charge description master management(CDM), a module, which assists healthcare providers by integrating the CDM data into the workflow of the hospitals purchasing systems; contract management, a module that assists healthcare providers to establish a contract management system and to provide care to patients; request for proposal automation solution; rebate management; ScanWorx, a mobile perioperative closed loop scanning solution; and data integration and warehousing, as well as solutions for integration of acquired businesses, which enable deployment of a virtual item master files. The company sells its solutions and services to hospitals and health systems through its distribution and reseller partnerships. In addition, it provides CageTix, a ticketing platform for mixed martial arts industry. Further, the company focuses on selling rapid test kits for COVID-19; and personal protective equipment. SCWorx Corp. is based in New York, New York.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "New York"
    },
    "5CE.F": {
        "short_name": "CERTIVE SOLUTIONS INC.",
        "long_name": "Certive Solutions Inc.",
        "summary": "Certive Solutions Inc. provides healthcare information technology solutions to hospitals and healthcare administrators in the United States. It offers revenue cycle management services. The company was formerly known as Visual Vault Corporation and changed its name to Certive Solutions Inc. in October 2013. Certive Solutions Inc. was incorporated in 2010 and is headquartered in Scottsdale, Arizona.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Scottsdale"
    },
    "6819.HK": {
        "short_name": "INTELLICENTRICS",
        "long_name": "IntelliCentrics Global Holdings Ltd.",
        "summary": "IntelliCentrics Global Holdings Ltd., an investment holding company, provides credentialing services in the United States, Canada, and the United Kingdom. It primarily operates a credentialing platform for compliance and security purposes in the healthcare industry. The company's platform collects, processes, and verifies data and information in accordance with the various requirements of locations of care, including hospitals and other types of healthcare locations. It primarily provides vendor credentialing solution and medical credentialing solution through its platform, as well as add-on services. The company was formerly known as 31 Frameworks Ltd. and changed its name to IntelliCentrics Global Holdings Ltd. in February 2018. The company was founded in 2007 and is headquartered in Dallas, Texas. IntelliCentrics Global Holdings Ltd. is a subsidiary of Ocin Corp.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "United States",
        "city": "Dallas"
    },
    "9EH.F": {
        "short_name": "EVOLENT HEALTH A  DL-,01",
        "long_name": "Evolent Health, Inc.",
        "summary": "Evolent Health, Inc., through its subsidiary, Evolent Health LLC, provides health care delivery and payment solutions in the United States. The company operates through two segments, Services and True Health. The Services segment provides value-based care services that include Identifi, a proprietary technology system that aggregates and analyzes data, manages care workflows and engages patients; population health performance that delivers patient-centric cost effective care; and delivery network alignments. This segment also offers specialty care management solutions that support a range of specialty care delivery stakeholders during their transition from fee-for-service to value-based care, independent of their stage of maturation, and specific market dynamics; and comprehensive health plan administrative services that helps providers assemble the complete infrastructure required to operate, manage, and capitalize on a variety of financial and administrative management services. The True Health segment operates a commercial health plan for small and large businesses in New Mexico. Evolent Health, Inc. was founded in 2011 and is headquartered in Arlington, Virginia.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Arlington"
    },
    "ACCD": {
        "short_name": "Accolade, Inc.",
        "long_name": "Accolade, Inc.",
        "summary": "Accolade, Inc. develops and provides technology-enabled solutions that help people understand, navigate, and utilize the healthcare system and their workplace benefits in the United States. The company offers a platform with cloud-based technology and with multimodal support from a team of health assistants and clinicians, including nurses, physician medical directors, and behavioral health specialists. Its customers are primarily employers who provide their employees and their employees' families a single place to turn for their health, healthcare, and benefits needs. Accolade, Inc. was founded in 2007 and is headquartered in Plymouth Meeting, Pennsylvania.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Plymouth Meeting"
    },
    "ACNV": {
        "short_name": "ACCELERA INNOVATIONS INC",
        "long_name": "Accelera Innovations, Inc",
        "summary": "Accelera Innovations, Inc., a healthcare service company, focuses on the development of Internet-based software in the United States. The company's Accelera Technology, an Internet-based software platform enhances the functionality and performance of healthcare services through making clinical healthcare data available to healthcare consumers. It also provides billing, practice management, and administrative services to doctors and other clinicians, as well as home health services to patients in Chicago. The company was formerly known as Accelerated Acquisitions IV, Inc. and changed its name to Accelera Innovations, Inc. in October 2011. Accelera Innovations, Inc. was founded in 2008 and is based in Colorado Springs, Colorado.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Colorado Springs"
    },
    "AGTI": {
        "short_name": "Agiliti, Inc.",
        "long_name": "Agiliti, Inc.",
        "summary": "Agiliti, Inc. provides healthcare technology management and service solutions to the healthcare industry in the United States. The company offers onsite managed services, including programs for the management, reprocessing, and logistics of medical equipment at individual facilities and integrated delivery networks to monitor and adjust equipment quantities and availability to address fluctuations in patient census and acuity; and clinical engineering services comprising maintenance, repair, and remediation solutions for various type of medical equipment, including general biomedical and diagnostic imaging equipment through supplemental and outsourced offerings. It also provides equipment solutions, which primarily provide supplemental, peak need, and per-case rental of general biomedical, specialty, and surgical equipment to acute care hospitals and alternate site providers, including premier healthcare institutions and integrated delivery networks. As of December 31, 2020, it owned or managed approximately a million units of medical equipment for approximately 7,000 national, regional, and local acute care hospitals, health system integrated delivery networks, and alternate site providers. Agiliti, Inc. was founded in 2018 and is headquartered in Minneapolis, Minnesota.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Minneapolis"
    },
    "AL21.F": {
        "short_name": "ALLSCRIPTS HEAL.SOL.DL-01",
        "long_name": "Allscripts Healthcare Solutions, Inc.",
        "summary": "Allscripts Healthcare Solutions, Inc., together with its subsidiaries, provides information technology solutions and services to healthcare organizations in the United States, Canada, and internationally. It offers electronic health records (EHR), information connectivity, private cloud hosting, outsourcing, analytics, patient access, and population health management solutions. The company operates in two segments: The Core Clinical and Financial Solutions; and The Data, Analytics and Care Coordination. The Core Clinical and Financial Solutions segment provides software applications for patient engagement, and integrated clinical and financial management solutions, which primarily include EHR-related software; and financial and practice management software solutions, as well as related installation, support and maintenance, outsourcing, private cloud hosting, and revenue cycle management services. The Data, Analytics and Care Coordination segment offers practice reimbursement, and payer and life sciences solutions, which are primarily targeted at physician practices, payers, life sciences companies, and other healthcare stakeholders. Its solutions enable clients to transition, analyze, and coordinate care and enhance the healthcare delivery across the care community. The company serves physicians, hospitals, governments, health systems, health plans, life-sciences companies, retail clinics, retail pharmacies, pharmacy benefit managers, insurance companies, and employer wellness clinics, as well as post-acute organizations, such as home health and hospice agencies. Allscripts Healthcare Solutions, Inc. was founded in 1986 and is headquartered in Chicago, Illinois.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Chicago"
    },
    "AMWL": {
        "short_name": "American Well Corporation",
        "long_name": "American Well Corporation",
        "summary": "American Well Corporation operates as a telehealth company that enables digital delivery of care for healthcare. Its application offers urgent care; pediatrics; therapy; menopause nutrition; menopause counseling; telestroke; population health management; telepsychiatry; pregnancy and postpartum care; pregnancy and postpartum therapy; breastfeed support; and menopause care. The company also provides telemedicine equipment, including telemedicine carts, peripherals, TV kits, tablets, and kiosks. American Well Corporation was incorporated in 2006 and is headquartered in Boston, Massachusetts.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Boston"
    },
    "APYI": {
        "short_name": "ASPYRA INC",
        "long_name": "Aspyra Inc.",
        "summary": "Aspyra Inc. provides health care products and services for the laboratory and imaging marketplaces. It offers engineered workflow solutions that include software, interfaces, hardware, and professional services to various markets comprising specialty labs, reference labs, clinics, hospitals, imaging centers, and orthopedic practices. The company was formerly known as Creative Computer Applications Inc. and changed its name to Aspyra Inc. in November 2005. Aspyra Inc. was founded in 1978 and is headquartered in Jacksonville, Florida.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Jacksonville"
    },
    "AUGX": {
        "short_name": "AUGMEDIX INC",
        "long_name": "Augmedix, Inc.",
        "summary": "Augmedix, Inc. provides remote medical documentation solutions and live clinical support services in the United States. It offers software that is compatible with off-the-shelf, mobile client devices, which enables clinicians to communicate with remotely located documentation specialists (RDSs). The company's services include Augmedix Live, a real time service, in which RDSs provide medical documentation and live clinical support services; and Augmedix Notes, a non-real time product where RDSs offer medical documentation based upon recorded visits. Its clients include health systems and specialty groups. The company was founded in 2013 and is headquartered in San Francisco, California.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "San Francisco"
    },
    "C1ER34.SA": {
        "short_name": "CERNER CORP DRN",
        "long_name": "Cerner Corporation",
        "summary": "Cerner Corporation, together with its subsidiaries, provides health care information technology solutions and tech-enabled services in the United States and internationally. The company offers Cerner Millennium architecture, a person-centric computing framework, which includes clinical, financial, and management information systems that allow providers to access an individual's electronic health record (EHR) at the point of care, and organizes and delivers information for physicians, nurses, laboratory technicians, pharmacists, front- and back-office professionals, and consumers. It also provides HealtheIntent platform, a cloud-based platform to aggregate, transform, and reconcile data across the continuum of care; and CareAware, an EHR agnostic platform that facilitates connectivity of health care devices to EHRs. In addition, the company offers a portfolio of clinical and financial health care information technology solutions, as well as departmental and care coordination solutions. Further, it provides tech-enabled services, such as implementation and training, remote hosting, operational management services, revenue cycle services, support and maintenance, health care data analysis, real-world evidence, clinical process optimization, transaction processing, employer health centers, employee wellness programs, and third-party administrator services; and complementary hardware and devices for third parties. The company serves integrated delivery networks, physician groups and networks, managed care organizations, hospitals, medical centers, reference laboratories, home health agencies, blood banks, imaging centers, pharmacies, pharmaceutical manufacturers, employers, governments, and public health organizations. Cerner Corporation was founded in 1979 and is headquartered in North Kansas City, Missouri.",
        "currency": "BRL",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "North Kansas City"
    },
    "CBP.CN": {
        "short_name": "CertiveSoln",
        "long_name": "Certive Solutions Inc.",
        "summary": "Certive Solutions Inc. provides healthcare information technology solutions to hospitals and healthcare administrators in the United States. It offers revenue cycle management services. The company was formerly known as Visual Vault Corporation and changed its name to Certive Solutions Inc. in October 2013. Certive Solutions Inc. was incorporated in 2010 and is headquartered in Scottsdale, Arizona.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "United States",
        "city": "Scottsdale"
    },
    "CERN.MX": {
        "short_name": "CERNER CORP",
        "long_name": "Cerner Corporation",
        "summary": "Cerner Corporation, together with its subsidiaries, provides health care information technology solutions and tech-enabled services in the United States and internationally. The company offers Cerner Millennium architecture, a person-centric computing framework, which includes clinical, financial, and management information systems that allow providers to access an individual's electronic health record (EHR) at the point of care, and organizes and delivers information for physicians, nurses, laboratory technicians, pharmacists, front- and back-office professionals, and consumers. It also provides HealtheIntent platform, a cloud-based platform to aggregate, transform, and reconcile data across the continuum of care; and CareAware, an EHR agnostic platform that facilitates connectivity of health care devices to EHRs. In addition, the company offers a portfolio of clinical and financial health care information technology solutions, as well as departmental and care coordination solutions. Further, it provides tech-enabled services, such as implementation and training, remote hosting, operational management services, revenue cycle services, support and maintenance, health care data analysis, real-world evidence, clinical process optimization, transaction processing, employer health centers, employee wellness programs, and third-party administrator services; and complementary hardware and devices for third parties. The company serves integrated delivery networks, physician groups and networks, managed care organizations, hospitals, medical centers, reference laboratories, home health agencies, blood banks, imaging centers, pharmacies, pharmaceutical manufacturers, employers, governments, and public health organizations. Cerner Corporation was founded in 1979 and is headquartered in North Kansas City, Missouri.",
        "currency": "MXN",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "North Kansas City"
    },
    "CERN": {
        "short_name": "Cerner Corporation",
        "long_name": "Cerner Corporation",
        "summary": "Cerner Corporation, together with its subsidiaries, provides health care information technology solutions and tech-enabled services in the United States and internationally. The company offers Cerner Millennium architecture, a person-centric computing framework, which includes clinical, financial, and management information systems that allow providers to access an individual's electronic health record (EHR) at the point of care, and organizes and delivers information for physicians, nurses, laboratory technicians, pharmacists, front- and back-office professionals, and consumers. It also provides HealtheIntent platform, a cloud-based platform to aggregate, transform, and reconcile data across the continuum of care; and CareAware, an EHR agnostic platform that facilitates connectivity of health care devices to EHRs. In addition, the company offers a portfolio of clinical and financial health care information technology solutions, as well as departmental and care coordination solutions. Further, it provides tech-enabled services, such as implementation and training, remote hosting, operational management services, revenue cycle services, support and maintenance, health care data analysis, real-world evidence, clinical process optimization, transaction processing, employer health centers, employee wellness programs, and third-party administrator services; and complementary hardware and devices for third parties. The company serves integrated delivery networks, physician groups and networks, managed care organizations, hospitals, medical centers, reference laboratories, home health agencies, blood banks, imaging centers, pharmacies, pharmaceutical manufacturers, employers, governments, and public health organizations. Cerner Corporation was founded in 1979 and is headquartered in North Kansas City, Missouri.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "North Kansas City"
    },
    "CERN.VI": {
        "short_name": "CERNER CORP",
        "long_name": "Cerner Corporation",
        "summary": "Cerner Corporation, together with its subsidiaries, provides health care information technology solutions and tech-enabled services in the United States and internationally. The company offers Cerner Millennium architecture, a person-centric computing framework, which includes clinical, financial, and management information systems that allow providers to access an individual's electronic health record (EHR) at the point of care, and organizes and delivers information for physicians, nurses, laboratory technicians, pharmacists, front- and back-office professionals, and consumers. It also provides HealtheIntent platform, a cloud-based platform to aggregate, transform, and reconcile data across the continuum of care; and CareAware, an EHR agnostic platform that facilitates connectivity of health care devices to EHRs. In addition, the company offers a portfolio of clinical and financial health care information technology solutions, as well as departmental and care coordination solutions. Further, it provides tech-enabled services, such as implementation and training, remote hosting, operational management services, revenue cycle services, support and maintenance, health care data analysis, real-world evidence, clinical process optimization, transaction processing, employer health centers, employee wellness programs, and third-party administrator services; and complementary hardware and devices for third parties. The company serves integrated delivery networks, physician groups and networks, managed care organizations, hospitals, medical centers, reference laboratories, home health agencies, blood banks, imaging centers, pharmacies, pharmaceutical manufacturers, employers, governments, and public health organizations. Cerner Corporation was founded in 1979 and is headquartered in North Kansas City, Missouri.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "North Kansas City"
    },
    "CHNG.MX": {
        "short_name": "CHANGE HEALTHCARE INC",
        "long_name": "Change Healthcare Inc.",
        "summary": "Change Healthcare Inc., an independent healthcare technology platform, provides data and analytics-driven solutions to enhance clinical, financial, administrative, and patient engagement outcomes in the United States healthcare system. It operates through three segments: Software and Analytics, Network Solutions, and Technology-Enabled Services. The Software and Analytics segment offers software and analytics solutions for financial performance, payment accuracy, clinical decision management, value-based payment, provider and consumer engagement, and imaging and clinical workflow. The Network Solutions segment enables financial, administrative, and clinical transactions; electronic business-to-business and consumer-to-business payments; and aggregation and analytics of clinical and financial data. The Technology-Enabled Services segment provides solutions for financial and administrative management, value-based care, communication and payment, pharmacy benefits administration, and healthcare consulting. Change Healthcare Inc. has a collaboration with Amazon Web Services, Inc. The company was founded in 2016 and is headquartered in Nashville, Tennessee.",
        "currency": "MXN",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Nashville"
    },
    "CHNG": {
        "short_name": "Change Healthcare Inc.",
        "long_name": "Change Healthcare Inc.",
        "summary": "Change Healthcare Inc., an independent healthcare technology platform, provides data and analytics-driven solutions to enhance clinical, financial, administrative, and patient engagement outcomes in the United States healthcare system. It operates through three segments: Software and Analytics, Network Solutions, and Technology-Enabled Services. The Software and Analytics segment offers software and analytics solutions for financial performance, payment accuracy, clinical decision management, value-based payment, provider and consumer engagement, and imaging and clinical workflow. The Network Solutions segment enables financial, administrative, and clinical transactions; electronic business-to-business and consumer-to-business payments; and aggregation and analytics of clinical and financial data. The Technology-Enabled Services segment provides solutions for financial and administrative management, value-based care, communication and payment, pharmacy benefits administration, and healthcare consulting. Change Healthcare Inc. has a collaboration with Amazon Web Services, Inc. The company was founded in 2016 and is headquartered in Nashville, Tennessee.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Nashville"
    },
    "CLNH": {
        "short_name": "CLINIGENCE HLDGS INC",
        "long_name": "Accountable Healthcare America Inc.",
        "summary": "Accountable Healthcare America Inc. provides health care services. It offers medicare management, performance metrics, cost improvement and performance improvement plans, and health management services. The company was incorporated in 2014 and is based in Fort Lauderdale, Florida.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Fort Lauderdale"
    },
    "CMPD": {
        "short_name": "COMPUMED INC",
        "long_name": "CompuMed, Inc.",
        "summary": "CompuMed, Inc., an enterprise telemedicine solutions company, provides clinical care services for patients and medical facilities. It offers telecardiology and teleradiology services that provide real-time access to U.S. Board-Certified specialists through cloud-based technology and integrated medical devices to medical facilities worldwide. The company provides enterprise telemedicine solutions, such as network of specialists, cloud-based telemedicine technology, telemedicine-enabled medical devices, 24/7 call center customer support, professional, and training services; a suite of telecardiology services and diagnostic exam interpretations for pediatric and adult patients, including electrocardiogram (ECG) devices, echocardiogram, ECG, vascular, holter, nuclear, and video consults; and reading, transcription, reporting, storage, and video consultations in the areas of Vscan, X-ray, ultrasound, mammography, computed tomography, magnetic resonance imaging, and radiologist video consults. It also offers OsteoGram software that works in combination with standard or digital X-ray equipment to support osteoporosis screening, diagnosis, and therapy monitoring. In addition, the company provides mobile ECG and ultrasound solutions that provide patients with immediate access to its board-certified specialists; and Vscan, a handheld, pocket-sized visualization tool that houses ultrasound technology, which strengthens the clinical confidence of physicians and aids in speedy diagnosis. It serves organ procurement organizations, rural healthcare, and correctional healthcare industries. CompuMed, Inc. was founded in 1973 and is headquartered in Los Angeles, California.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Los Angeles"
    },
    "CPSI": {
        "short_name": "Computer Programs and Systems, ",
        "long_name": "Computer Programs and Systems, Inc.",
        "summary": "Computer Programs and Systems, Inc. provides healthcare information technology solutions and services in the United States and the Caribbean nation of St. Maarten. Its software systems include patient management software that enables a hospital to identify a patient at various points in the healthcare delivery system, as well as to collect and maintain patient information throughout the process of patient care; and financial accounting software, which offers business office applications to track and coordinate information needed for managerial decision-making. The company also provides clinical software that automates record keeping and reporting for various clinical functions, including laboratory, radiology, physical therapy, respiratory care, and pharmacy; patient care applications; and enterprise applications that support its products for use in various areas of the hospital. In addition, it offers Centriq, an intuitive user interface to centralize data from various care areas that provide the end user with a tool to view past and present patient information. Further, the company provides software solutions that promote data-driven clinical and financial outcomes for customers in the post-acute care industry; software application support, hardware maintenance, and education and related services; post-acute care support and maintenance services; revenue cycle management products and services, consulting and business management services, and managed information technology services; patient engagement and empowerment technology solutions; and system implementation and training services. It serves community hospitals and physician clinics, skilled nursing and assisted living facilities, and small specialty hospitals. Computer Programs and Systems, Inc. was founded in 1979 and is headquartered in Mobile, Alabama.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Mobile"
    },
    "CRE.F": {
        "short_name": "CERNER CORP.  DL-,01",
        "long_name": "Cerner Corporation",
        "summary": "Cerner Corporation, together with its subsidiaries, provides health care information technology solutions and tech-enabled services in the United States and internationally. The company offers Cerner Millennium architecture, a person-centric computing framework, which includes clinical, financial, and management information systems that allow providers to access an individual's electronic health record (EHR) at the point of care, and organizes and delivers information for physicians, nurses, laboratory technicians, pharmacists, front- and back-office professionals, and consumers. It also provides HealtheIntent platform, a cloud-based platform to aggregate, transform, and reconcile data across the continuum of care; and CareAware, an EHR agnostic platform that facilitates connectivity of health care devices to EHRs. In addition, the company offers a portfolio of clinical and financial health care information technology solutions, as well as departmental and care coordination solutions. Further, it provides tech-enabled services, such as implementation and training, remote hosting, operational management services, revenue cycle services, support and maintenance, health care data analysis, real-world evidence, clinical process optimization, transaction processing, employer health centers, employee wellness programs, and third-party administrator services; and complementary hardware and devices for third parties. The company serves integrated delivery networks, physician groups and networks, managed care organizations, hospitals, medical centers, reference laboratories, home health agencies, blood banks, imaging centers, pharmacies, pharmaceutical manufacturers, employers, governments, and public health organizations. Cerner Corporation was founded in 1979 and is headquartered in North Kansas City, Missouri.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "North Kansas City"
    },
    "CRVW": {
        "short_name": "CAREVIEW COMMUNICATIONS INC",
        "long_name": "CareView Communications, Inc.",
        "summary": "CareView Communications, Inc. provides products and on-demand application services for the healthcare industry in the United States. The company provides CareView Patient Safety System, a video monitoring tool to improve the practice of nursing, create a better work environment, and make the patient's hospital stay more satisfying, which is used in hospitals, nursing homes, adult living centers, and outpatient care facilities; and Caregiver Platform, which offers caregiver connect mobile application to provide a convenient and intuitive interface to capture critical workflows, such as acknowledging and documenting alert presses by the resident. It also offers CareView Connect, which provides resident monitoring products and services for the long- term care industry; an array of wearable and stationary buttons that allow a resident to summon help either for an emergency or assistance; a mobile app capable of delivering an alert to the caregiver and allows them document information around that alert; and alert management and monitoring system. CareView Communications, Inc. is based in Lewisville, Texas.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Lewisville"
    },
    "CSLT": {
        "short_name": "Castlight Health, Inc.",
        "long_name": "Castlight Health, Inc.",
        "summary": "Castlight Health, Inc. provides health navigation solutions for employers and health plan customers in education, manufacturing, retail, government, and technology industries in the United States. It provides Care Guidance Navigator that enables users to make better care decisions and navigate the employer-sponsored healthcare benefit programs; Wellbeing Navigator, which helps to drive engagement across an employer's benefits program; Complete Health Navigator that combines the Wellbeing Navigator and Care Guidance Navigator packages for unified user experience; and Castlight Care Guides, a high-touch navigation service. The company also offers white-labeled health navigation solutions and embedded platform technology services. In addition, it provides implementation and marketplace services. The company was formerly known as Ventana Health Services and changed its name to Castlight Health, Inc. in April 2010. Castlight Health, Inc. was incorporated in 2008 and is headquartered in San Francisco, California.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "San Francisco"
    },
    "CSOC": {
        "short_name": "CADUCEUS SOFTWARE SYSTEMS CORP",
        "long_name": "Caduceus Software Systems Corp.",
        "summary": "Caduceus Software Systems Corp., a development stage company, provides medical software solutions to medical professionals. The company offers a suite of medical management software applications for use in the medical industry for patient management, patient appointment scheduling, physician memorandum recording, medical symptom and ailment recording, and digital image recording. It provides Caduceus MMS, a software suite to manage an entire medical practice that consists of accounting records, patient billing, appointment scheduler, human anatomical mapping, imaging, and document editor or prescription writer modules. The company intends to market its software suite in the areas of healthcare patient information management; electronic healthcare recording; electronic medical billing systems; and contact management, and appointment scheduling and booking. Caduceus Software Systems Corp. was formerly known as Bosco Holdings Inc. and changed its name to Caduceus Software Systems Corp. in March 2011. The company was founded in 2006 and is based in Johnston, Rhode Island.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Johnston"
    },
    "CTHZ": {
        "short_name": "CANCER TREATMENT HOLDINGS INC",
        "long_name": "Cancer Treatment Holdings, Inc.",
        "summary": "Cancer Treatment Holdings, Inc., through its subsidiaries, engages in providing IT-enabled services; the exploitation of an invention related to the on-site production of chlorine gas and related compounds; and providing radiation therapy, diagnostic imaging, and other medical related services. The company, through a 50% interest in a joint venture, offers IT-enabled services, including medical transcriptions, billing and collecting, bookkeeping, and claims processing services. The company enables users to manufacture chlorine on-site and when needed through its device. It has a 51% interest in a radiation therapy center located in Logan, West Virginia. In addition, through its wholly owned subsidiary, CTI Management Corp., the company's president provides management services. The company is based in Carson City, Nevada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Carson City"
    },
    "CTVEF": {
        "short_name": "CERTIVE SOLUTIONS INC",
        "long_name": "Certive Solutions Inc.",
        "summary": "Certive Solutions Inc. provides healthcare information technology solutions to hospitals and healthcare administrators in the United States. It offers revenue cycle management services. The company was formerly known as Visual Vault Corporation and changed its name to Certive Solutions Inc. in October 2013. Certive Solutions Inc. was incorporated in 2010 and is headquartered in Scottsdale, Arizona.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Scottsdale"
    },
    "CVET": {
        "short_name": "Covetrus, Inc.",
        "long_name": "Covetrus, Inc.",
        "summary": "Covetrus, Inc., together with its subsidiaries, operates as an animal-health technology and services company. It engages in the sale of animal-health consumable products, including proprietary and Covetrus branded products, small equipment, laboratory products, large equipment, equipment repair services, branded and generic pharmaceuticals, vaccines, surgical products, diagnostic tests, infection-control products, parasiticides, and vitamins and supplements to wholesale and retail customers. The company also offers value-added solutions that include, inventory management and e-commerce, as well as continuing education services for practitioners. In addition, it provides practice management software systems for veterinary practitioners and animal-health clinics, client communication services, reminders, data backup services, and hardware sales and support services. Further, the company engages in the distribution of finished goods pharmacy and specialty pharmaceutical compounding products, as well as shipping, manufacturer incentives, service fees, and data integration and support services. It serves animal-health and veterinary practices, and clinics in the companion-animal and equine markets primarily in North America, Europe, and the Asia Pacific. The company was formerly known as HS Spinco, Inc. Covetrus, Inc. was incorporated in 2018 and is headquartered in Portland, Maine.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Portland"
    },
    "DSOL": {
        "short_name": "DRUG FREE SOLUTION INC",
        "long_name": "Drug Free Solution, Inc.",
        "summary": "Drug Free Solution, Inc., a lifestyle company, delivers proprietary emotional wellness technology, known as Living Breath Process. Its Living Breath Process is a three-step process that combines self-analysis, breath, and language addressing various markets, including addiction/prevention, self help, emotional wellness, and lifestyle. The company also offers the Living Breath Series of programs with products, education, and services. Its Living Breath Project, through protocols, lifestyle enhancement products, training, and education, focuses on creating community wellness centers, wellness homes, and correctional facility support networks and centers that combine various offerings to diminish addiction and incarceration rates in the United States. The company was formerly known as Living Breath Project, Inc. and changed its name to Drug Free Solution, Inc. in January 2014. Drug Free Solution, Inc. is based in El Segundo, California.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "El Segundo"
    },
    "DTRK": {
        "short_name": "DATATRAK INTERNATIONAL INC",
        "long_name": "DATATRAK International, Inc.",
        "summary": "DATATRAK International, Inc., a technology and services company, provides unified clinical solutions and related services for the clinical trials industry. The company offers DATATRAK ONE Unified Experience, a clinical enterprise solution that allows clinical users and service providers to design, deliver, and manage clinical trials. Its products include UX CTMS 360 for planning and managing trials; UX Trial to streamline design-to-deployment process using a tool; UX EDC & Medical Coding for capturing and delivering data; UX Randomization and Trial Supply Management to randomize patients and automate supply; UX Patient Data Capture; UX Safety; and UX Training to train users and track certificates. The company also provides DATATRAK Clinical Consulting Services, such as training, support, learning center, Software as a Service hosting, standards, and trial design services. It serves contract research organizations, pharma and biotech companies, and clinical trial device companies. DATATRAK International, Inc. was founded in 1991 and is headquartered in Mayfield Heights, Ohio.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Mayfield Heights"
    },
    "EBYH": {
        "short_name": "E-BUY HOME INC",
        "long_name": "Strainsforpains, Inc.",
        "summary": "Strainsforpains, Inc. operates as a medical marijuana data recommendation system. The company develops Strainsforpains app, a user-based application that scientifically determines which cannabis brand or strain is right for patients based upon personal data and strain genetics. It serves medical specialists, dispensaries, and consumers. The company was incorporated in 1990 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "EMOR": {
        "short_name": "HEALIXA INC",
        "long_name": "Healixa Inc.",
        "summary": "Pura Vida Health, LLC, a health and wellness company, researches, develops, and sells cannabidiol and other natural ingredients based products for wellness, recovery, sports and fitness, and animals. The company was founded in 2017 and is based in Farmingdale, New York.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Farmingdale"
    },
    "ESSI": {
        "short_name": "ECO SCIENCE SOLUTIONS INC",
        "long_name": "Eco Science Solutions, Inc.",
        "summary": "Eco Science Solutions, Inc. provides consumer and enterprise technology products and services for the health, wellness, and alternative medicine industry. Its services include business location, localized communications between consumers and business operators, social networking, inventory management/selection, and payment facilitation and delivery arrangement. The company's e-commerce and content platform enables health, wellness, and alternative medicine enthusiasts to locate, access, and connect with others to facilitate the research of and purchasing of eco-science friendly products. In addition, it offers Herbo app that enables consumers to find products and services, which support the intake of alternative medicines for a naturopathic way of living; and develops app for marijuana businesses and delivery services. Eco Science Solutions, Inc. was founded in 2009 and is headquartered in Makawao, Hawaii.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Makawao"
    },
    "EVH": {
        "short_name": "Evolent Health, Inc",
        "long_name": "Evolent Health, Inc.",
        "summary": "Evolent Health, Inc., through its subsidiary, Evolent Health LLC, provides health care delivery and payment solutions in the United States. The company operates through two segments, Services and True Health. The Services segment provides value-based care services that include Identifi, a proprietary technology system that aggregates and analyzes data, manages care workflows and engages patients; population health performance that delivers patient-centric cost effective care; and delivery network alignments. This segment also offers specialty care management solutions that support a range of specialty care delivery stakeholders during their transition from fee-for-service to value-based care, independent of their stage of maturation, and specific market dynamics; and comprehensive health plan administrative services that helps providers assemble the complete infrastructure required to operate, manage, and capitalize on a variety of financial and administrative management services. The True Health segment operates a commercial health plan for small and large businesses in New Mexico. Evolent Health, Inc. was founded in 2011 and is headquartered in Arlington, Virginia.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Arlington"
    },
    "EWLL": {
        "short_name": "EWELLNESS HEALTHCARE CORP",
        "long_name": "eWellness Healthcare Corporation",
        "summary": "eWellness Healthcare Corporation, a physical therapy telehealth company, offers real-time distance monitored assessments and treatments. It provides PHZIO platform, which enables patients to engage with live or on-demand video for digital telehealth assessments and treatments from home or office. The company is based in Fort Lauderdale, Florida.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Fort Lauderdale"
    },
    "FDBH": {
        "short_name": "FOUNDERS BAY HOLDINGS",
        "long_name": "Founders Bay Holdings",
        "summary": "Founders Bay Holdings and its subsidiaries provide medical diagnostic services. The company develops, operates, and administers the use of magnetic resonance imaging equipment in medical diagnostic centers, which provide medical diagnostic services to health maintenance organizations, preferred provider organizations, trade unions, clinics, and other health care providers. The company was incorporated in 1986 and is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Las Vegas"
    },
    "FORA": {
        "short_name": "Forian Inc.",
        "long_name": "Forian Inc.",
        "summary": "Forian Inc. provides a suite of SaaS solutions, data management capabilities, and proprietary data and analytics to optimize and measure operational, clinical, and financial performance for customers within the life sciences and healthcare payor and provider segments, as well as cannabis manufacturers, dispensaries, cultivators, and regulators. The company is headquartered in Newtown, Pennsylvania.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Newtown"
    },
    "GDRX": {
        "short_name": "GoodRx Holdings, Inc.",
        "long_name": "GoodRx Holdings, Inc.",
        "summary": "GoodRx Holdings, Inc., through its subsidiaries, provides information and tools to enables consumers compare prices and save on their prescription drug purchases in the United States. The company operates a price comparison platform that provides consumers with curated, geographically relevant prescription pricing, and access to negotiated prices through GoodRx codes that can be used to save money on prescriptions across the United States. It also offers other healthcare products and services, including telehealth services. The company serves pharmacy benefit managers that manage formularies and prescription transactions, including establishing pricing between consumers and pharmacies. GoodRx Holdings, Inc. was incorporated in 2015 and is based in Santa Monica, California.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Santa Monica"
    },
    "HCAT": {
        "short_name": "Health Catalyst, Inc",
        "long_name": "Health Catalyst, Inc.",
        "summary": "Health Catalyst, Inc. provides data and analytics technology and services to healthcare organizations. Its solutions include a cloud-based data platform, analytics software, and professional services. The company was formerly known as HQC Holdings, Inc. and changed its name to Health Catalyst, Inc. in March 2017. The company was founded in 2008 and is headquartered in South Jordan, Utah.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "South Jordan"
    },
    "HDVY": {
        "short_name": "HEALTH DISCOVERY CORPORATION",
        "long_name": "Health Discovery Corporation",
        "summary": "Health Discovery Corporation operates as a pattern recognition company that uses mathematical techniques to analyze data to uncover patterns primarily in the field of molecular diagnostics in the United States. Its intellectual property includes Support Vector Machines (SVM), which are mathematical algorithms; and biomarkers that are biological indicators or genetic expression signatures of certain disease states, as well as Fractal Genomic Modeling technology. The company was incorporated in 2001 and is based in Atlanta, Georgia.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Atlanta"
    },
    "HITC": {
        "short_name": "HEALTHCARE INTEGRATED TECH INC",
        "long_name": "Healthcare Integrated Technologies, Inc.",
        "summary": "Healthcare Integrated Technologies, Inc.through its subsidiary, develops healthcare technology solutions to integrate and automate the continuing care, home care, and professional healthcare spaces. The company's product include SafeSpace, an ambient fall detection solution for continuing care communities and at home use. It provides healthcare services, and health and safety monitoring equipment; and integrated solution for the professional healthcare community that integrates electronic health records, remote patient monitoring, telehealth, and other items. The company was formerly known as Grasshopper Staffing, Inc. and changed its name to Healthcare Integrated Technologies, Inc. in May 2018. Healthcare Integrated Technologies, Inc. was founded in 2013 and is based in Knoxville, Tennessee.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Knoxville"
    },
    "HL5.F": {
        "short_name": "HEALTHSTREAM INC.  DL-,01",
        "long_name": "HealthStream, Inc.",
        "summary": "HealthStream, Inc. provides workforce and provider solutions for healthcare organizations in the United States. It operates through two segments, Workforce Solutions and Provider Solutions. The company offers workforce solutions, including software-as-a-service (SaaS) based services and subscription-based solutions to meet the range of its clinical development, talent management, training, certification, scheduling, competency assessment, performance appraisal, and other needs, as well as implementation and account management services. It also provides applications for learning, compensation management, succession planning, competency management, disclosure management, simulation-based education, quality management, and industry training. In addition, the company offers VerityStream that delivers enterprise-class solutions to transform the healthcare provider experience for ambulatory surgery centers, urgent care facilities, clinics, medical groups, and other healthcare organizations; EchoCredentialing and MSOW platforms that manage medical staff credentialing, enrollment, and privileging processes for hospitals; and EchoOneApp, a provider enrollment platform for medical groups. Further, it provides CredentialMyDoc, a credentialing and enrollment SaaS solution for medical groups and surgery centers; CredentialStream, a SaaS-based provider credentialing, privileging, and enrollment solution; and NurseGrid Mobile for nurse managers. The company offers its solutions in healthcare industry companies that include private, not-for-profit, and government entities, as well as pharmaceutical and medical device companies through direct sales teams. HealthStream, Inc. was incorporated in 1990 and is headquartered in Nashville, Tennessee.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Nashville"
    },
    "HLTT": {
        "short_name": "HEALTHTECH SOLUTIONS INC",
        "long_name": "Healthtech Solutions Inc.",
        "summary": "Healthtech Solutions, Inc. engages in the creation and commercialization of cloud-based software for ultrasound scans in the United States. It is also involved in the development of medical therapies for the treatment of disease or injury, such as damage resulting from COVID-19 infection; and acquisition or investment in integrative medical diagnostic or therapeutic software or devices. The company was incorporated in 1985 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "HLYK": {
        "short_name": "HEALTHLYNKED CORP",
        "long_name": "HealthLynked Corp.",
        "summary": "HealthLynked Corp. operates a cloud-based patient information network and record archiving system in the United States. It operates through four divisions: Health Services, Digital HealthCare, Accountable Care Organization/Managed Service Organization (ACO/MSO), and Medical Distribution. The Health Services division provides obstetrical and gynecological medical services to patients; functional medicine focusing on neurodegenerative diseases, such as Alzheimer's, Parkinson's, and multiple sclerosis; and Bridging the Gap Physical Therapy, a physical therapy practice to speed patients' recovery and manage pain without pain medication or surgery. The Digital HealthCare division operates HealthLynked Network, which enables patients and doctors to keep track of medical information via Internet in a cloud-based system; and enables patients to enter a detailed online personal medical history, including past surgical history, medications, allergies, and family medical history. This segment also offers online scheduling function for patients to book appointments with providers. The ACO/MSO division operates an ACO and MSO that assists physician practices in providing care to patients via the Medicare Shared Savings Program; and offers contracted consulting services to healthcare providers and other ACOs. The Medical Distribution Division operates as a virtual distributor of discounted medical supplies selling to consumers and medical practice. The company was incorporated in 2014 and is headquartered in Naples, Florida.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Naples"
    },
    "HQY": {
        "short_name": "HealthEquity, Inc.",
        "long_name": "HealthEquity, Inc.",
        "summary": "HealthEquity, Inc. provides technology-enabled services platforms to consumers and employers in the United States. The company offers cloud-based platforms for individuals to make health saving and spending decisions, pay healthcare bills, compare treatment options and prices, receive personalized benefit and clinical information, earn wellness incentives, grow their savings, and make investment choices; and health savings accounts. It also provides mutual fund investment platform; and online-only automated investment advisory services through Advisor, a Web-based tool. In addition, the company offers flexible spending accounts; health reimbursement arrangements; and Consolidated Omnibus Budget Reconciliation Act continuation services, as well as administers pre-tax commuter benefit programs. It serves clients through a direct sales force; benefits brokers and advisors; and a network of health plans, benefits administrators, benefits brokers and consultants, and retirement plan record-keepers. HealthEquity, Inc. was incorporated in 2002 and is headquartered in Draper, Utah.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Draper"
    },
    "HSTM": {
        "short_name": "HealthStream, Inc.",
        "long_name": "HealthStream, Inc.",
        "summary": "HealthStream, Inc. provides workforce and provider solutions for healthcare organizations in the United States. It operates through two segments, Workforce Solutions and Provider Solutions. The company offers workforce solutions, including software-as-a-service (SaaS) based services and subscription-based solutions to meet the range of its clinical development, talent management, training, certification, scheduling, competency assessment, performance appraisal, and other needs, as well as implementation and account management services. It also provides applications for learning, compensation management, succession planning, competency management, disclosure management, simulation-based education, quality management, and industry training. In addition, the company offers VerityStream that delivers enterprise-class solutions to transform the healthcare provider experience for ambulatory surgery centers, urgent care facilities, clinics, medical groups, and other healthcare organizations; EchoCredentialing and MSOW platforms that manage medical staff credentialing, enrollment, and privileging processes for hospitals; and EchoOneApp, a provider enrollment platform for medical groups. Further, it provides CredentialMyDoc, a credentialing and enrollment SaaS solution for medical groups and surgery centers; CredentialStream, a SaaS-based provider credentialing, privileging, and enrollment solution; and NurseGrid Mobile for nurse managers. The company offers its solutions in healthcare industry companies that include private, not-for-profit, and government entities, as well as pharmaceutical and medical device companies through direct sales teams. HealthStream, Inc. was incorporated in 1990 and is headquartered in Nashville, Tennessee.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Nashville"
    },
    "HWT1.F": {
        "short_name": "ICAD INC.  DL-,01",
        "long_name": "iCAD, Inc.",
        "summary": "iCAD, Inc. provides image analysis, workflow solutions, and radiation therapy for the treatment of cancer in the United States. It operates through two segments, Cancer Detection and Cancer Therapy. The company offers PowerLook platform, which hosts the AI algorithm solutions and manages the communications between imaging acquisition systems, and image storage and review systems; SecondLook, a machine learning-based cancer detection algorithm that analyzes 2D full-field digital mammography images to identify and mark suspicious masses and calcifications; and automated density assessment solutions, which provides automated, consistent, and standardized density assessment. It also offers ProFound AI, a deep-learning algorithm designed to detect malignant soft-tissue densities and calcifications in digital breast tomosynthesis; ProFound AI Risk, a tool that provides breast cancer risk estimation based on a screening mammogram; and magnetic resonance imaging applications, a tool to detect breast and prostate cancer. In addition, the company offers VeraLook, a solution designed to support the detection of colonic polyps in conjunction with CT Colonography. Further, it provides Xoft Axxent electronic brachytherapy systems for the treatment of early stage breast, non-melanoma skin, and gynecological cancers to university research and community hospitals, cancer care clinics, veterinary facilities, and dermatology offices. The company serves healthcare centers through direct sales organizations, as well as through various original equipment manufacturer partners, distributors, and resellers. It also exports its products in Europe, Taiwan, Canada, China, and internationally. The company was formerly known as Howtek, Inc. and changed its name to iCAD, Inc. in June 2002. iCAD, Inc. was incorporated in 1984 and is headquartered in Nashua, New Hampshire.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Nashua"
    },
    "ICAD": {
        "short_name": "icad inc.",
        "long_name": "iCAD, Inc.",
        "summary": "iCAD, Inc. provides image analysis, workflow solutions, and radiation therapy for the treatment of cancer in the United States. It operates through two segments, Cancer Detection and Cancer Therapy. The company offers PowerLook platform, which hosts the AI algorithm solutions and manages the communications between imaging acquisition systems, and image storage and review systems; SecondLook, a machine learning-based cancer detection algorithm that analyzes 2D full-field digital mammography images to identify and mark suspicious masses and calcifications; and automated density assessment solutions, which provides automated, consistent, and standardized density assessment. It also offers ProFound AI, a deep-learning algorithm designed to detect malignant soft-tissue densities and calcifications in digital breast tomosynthesis; ProFound AI Risk, a tool that provides breast cancer risk estimation based on a screening mammogram; and magnetic resonance imaging applications, a tool to detect breast and prostate cancer. In addition, the company offers VeraLook, a solution designed to support the detection of colonic polyps in conjunction with CT Colonography. Further, it provides Xoft Axxent electronic brachytherapy systems for the treatment of early stage breast, non-melanoma skin, and gynecological cancers to university research and community hospitals, cancer care clinics, veterinary facilities, and dermatology offices. The company serves healthcare centers through direct sales organizations, as well as through various original equipment manufacturer partners, distributors, and resellers. It also exports its products in Europe, Taiwan, Canada, China, and internationally. The company was formerly known as Howtek, Inc. and changed its name to iCAD, Inc. in June 2002. iCAD, Inc. was incorporated in 1984 and is headquartered in Nashua, New Hampshire.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Nashua"
    },
    "ICCO": {
        "short_name": "INTERCARE DX INC",
        "long_name": "InterCare DX, Inc.",
        "summary": "InterCare DX, Inc. operates as a biomedical and other software products development and services company. It creates, publishes, and markets software products that are embedded with sound, text, and video for relaxation training and stress management. The company also develops an integrated Internet-ready and RFID enabled applications, which target education, hospitality, legal system, human capital, and healthcare industry markets. Its products comprise e-Learning Integrated Technology Enterprise Systems for integrated tuition, boarding and lodging management, enterprise vendor portal, customer relationship management, enterprise budgeting, and financial management, as well as other tools used in administering education at all levels; InterCare Clinical Explorer, a software application designed to integrate virtually all aspects of the healthcare enterprise; and InterCare Vascular Diagnostic Center to measure vascular health in patients before exhibiting symptoms. The company was formerly known as InterCare Diagnostics. InterCare DX, Inc. was founded in 1991 and is based in Hawthorne, California. InterCare DX, Inc.is a subsidiary of Meridian Holdings, Inc.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Hawthorne"
    },
    "ICCT": {
        "short_name": "ICORECONNECT INC",
        "long_name": "iCoreConnect Inc.",
        "summary": "iCoreConnect Inc. builds cloud-based communications systems primarily for the healthcare sector in the United States. The company offers cloud based software products. Its products include iCoreExchange that enables hospitals, physician practices and dental practices, and other healthcare professionals to transfer patient health information; iCoreCodeGenius that provides the coding standards for the 10th revision of the international statistical classification of diseases and related health problems; iCoreSecure, an encrypted email to protect personal and financial data; and iCoreMD and iCoreDental software platforms for the medical and dental communities. The company's products also comprise iCoreMobile, an electronic health record software platform for mobile medical and dental care centers; iCoreHuddle, a tool to instantly reveal the revenue potential of each patient; iCoreRx, a compliant electronic ePrescription software; and IT Managed services. It also offers consulting services for physician and dental practices. The company was formerly known as iMedicor, Inc. and changed its name to iCoreConnect Inc. in June 2017. iCoreConnect Inc. was incorporated in 2001 and is headquartered in Winter Garden, Florida.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Winter Garden"
    },
    "IGRW": {
        "short_name": "INTERACTIVE HEALTH NETWORK",
        "long_name": "Interactive Health Network",
        "summary": "Interactive Health Network, doing business as House of Mohan, distributes incense in the United States. Incense is composed of aromatic biotic materials, which release fragrant smoke when burned. It distributes 70 flavors, designer scents, zodiac signs scents, and a line of charcoal and natural herb incense. The company was formerly known as HPC POS System, Corp. and changed its name to Interactive Health Network in April 2014. Interactive Health Network was founded in 1995 and is based in Washington, District of Columbia.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Washington"
    },
    "INOV": {
        "short_name": "Inovalon Holdings, Inc.",
        "long_name": "Inovalon Holdings, Inc.",
        "summary": "Inovalon Holdings, Inc. provides cloud-based platforms for data-driven healthcare. It operates Inovalon ONE Platform, an integrated, real-time cloud native platform that interconnect with the healthcare ecosystem to aggregate and analyze data in real-time, as well as empowers the application in resulting insights. The company also operates myABILITY software platform, an integrated set of cloud-based applications for providers that offers connectivity, administrative, clinical and quality analysis, management, and performance improvement capabilities to acute, post-acute, and ambulatory point-of-care provider facilities. In addition, it offers advisory, implementation, and support services. The company serves health plans and provider organizations, as well as pharmaceutical, medical device, and diagnostics companies. Its platforms include information of data pertaining to approximately one million physicians; 574,000 clinical facilities; and approximately 332 million individuals and 61 billion medical events. Inovalon Holdings, Inc. was founded in 1998 and is headquartered in Bowie, Maryland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Bowie"
    },
    "IOV.F": {
        "short_name": "INOVALON HLD. A DL-000025",
        "long_name": "Inovalon Holdings, Inc.",
        "summary": "Inovalon Holdings, Inc. provides cloud-based platforms for data-driven healthcare. It operates Inovalon ONE Platform, an integrated, real-time cloud native platform that interconnect with the healthcare ecosystem to aggregate and analyze data in real-time, as well as empowers the application in resulting insights. The company also operates myABILITY software platform, an integrated set of cloud-based applications for providers that offers connectivity, administrative, clinical and quality analysis, management, and performance improvement capabilities to acute, post-acute, and ambulatory point-of-care provider facilities. In addition, it offers advisory, implementation, and support services. The company serves health plans and provider organizations, as well as pharmaceutical, medical device, and diagnostics companies. Its platforms include information of data pertaining to approximately one million physicians; 574,000 clinical facilities; and approximately 332 million individuals and 61 billion medical events. Inovalon Holdings, Inc. was founded in 1998 and is headquartered in Bowie, Maryland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Bowie"
    },
    "KERN": {
        "short_name": "Akerna Corp.",
        "long_name": "Akerna Corp.",
        "summary": "Akerna Corp. operates as a technology company. The company offers MJ Platform, an enterprise resource planning system to the cannabis industry; and Leaf Data Systems, a tracking system designed for government agencies. It also provides consulting services to cannabis industry; business intelligence, an infrastructure as a service tool, which delivers supply chain analytics for the cannabis, hemp, and CBD industries; and Last Call Analytics, a subscription analytics tool for alcohol brands to analyze their retail sales analytics. In addition, the company operates seed-to-sale platform that allows cultivators to track and report various stage of their cannabis growing operations, production, and sales processes. Further, it offers cannabis cultivation management and software to manage and optimize operational workflow in business analytics; and cannabis tracking technology that provides seed-to-sale-to-self data. Akerna Corp. was founded in 2010 and is headquartered in Denver, Colorado.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "Denver"
    },
    "LGBI": {
        "short_name": "CANNABIZ MOBILE INC",
        "long_name": "Cannabiz Mobile, Inc.",
        "summary": "Cannabiz Mobile, Inc. operates as a mobile media and marketing company for businesses in the medical marijuana industry primarily in the United States and Canada. The company markets a subscription based, in the cloud, mobile media solution that enables care givers, dispensaries, hydroponic, and ancillary product retailers to create, deploy, and analytically measure mobile marketing campaigns using various networks and devices. It also enables businesses to create customizable personal audio and video advertisements, commercials, podcasts, and presentations that are accessible through various smart phone devices; and designs generic action pages and custom mobile Websites in which the end user has the ability to save the Mobile APP to their home screen. In addition, the company provides suppliers with mobile solutions to facilitate them in running their business through the use of the company's mobile marketing software, including mobile coupons, birthday reminders, alerts mobile business cards, mobile sites, and apps. Its software also facilitates in keeping patients informed of new medicine, as well as uses SMS text as a way to communicate for appointment reminders, refills, etc.; and provides refill reminders. The company was formerly known as Lion Gold Brazil, Inc. and changed its name to Cannabiz Mobile, Inc. in June 2014. Cannabiz Mobile, Inc. is based in Cambridge, Massachusetts.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Cambridge"
    },
    "LV1.F": {
        "short_name": "STREAMLINE HEA.SOL.DL-,01",
        "long_name": "Streamline Health Solutions, Inc.",
        "summary": "Streamline Health Solutions, Inc. provides health information technology solutions and associated services for hospitals and health systems in the United States and Canada. It provides computer software-based solutions and auditing services, which captures, aggregates, and translates structured and unstructured data to deliver predictive insights. The company also offers coding and clinical documentation improvement (CDI) solutions, which includes integrated cloud-based software suite, CDI, and abstracting and physician query; and eValuator, a cloud-based pre-bill coding analysis platform. In addition, it provides financial management solutions, including accounts receivable management, denials management, claims processing, spend management, and audit management; patient care solutions; and custom integration services for CDI/abstracting, training, and audit services. The company sells its solutions and services through direct sales force and reseller partnerships. Streamline Health Solutions, Inc. was incorporated in 1989 and is based in Alpharetta, Georgia.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Alpharetta"
    },
    "M7T.AX": {
        "short_name": "MACH7 FPO",
        "long_name": "Mach7 Technologies Limited",
        "summary": "Mach7 Technologies Limited provides enterprise imaging data sharing, storage, and interoperability solutions for healthcare enterprises worldwide. The company operates through two segments, Sale of Software Licenses and Provision of Professional Services. It offers Management Studio that enables healthcare delivery organizations to own, archive, and communicate imaging data across the enterprise and connect that data with the electronic medical record. The company's Management Studio comprises enterprise imaging platform, vendor neutral archive, communication workflow engine, routing engine, fetching engine, and migration engine products. It also provides Diagnostic Studio that includes a suite of solutions to drive specialty workflows. The company's Diagnostic Studio solutions include PACS and QC solution; and Universal Worklist. In addition, the company offers Clinical Studio, which provides access to view, navigate, review, and share patient medical data over the Web and across the enterprise. Its Clinical Studio solutions consist of clinical portal, clinical viewer, image sharing, and procedure import/export products, as well as iModality, a mobile medical image capture using smart device technology. Further, the company provides professional services, such as implementation and training, data migration, support, and maintenance services; and archive migration services. Mach7 Technologies Limited was founded in 2007 and is based in South Burlington, Vermont.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "United States",
        "city": "South Burlington"
    },
    "MDRX": {
        "short_name": "Allscripts Healthcare Solutions",
        "long_name": "Allscripts Healthcare Solutions, Inc.",
        "summary": "Allscripts Healthcare Solutions, Inc., together with its subsidiaries, provides information technology solutions and services to healthcare organizations in the United States, Canada, and internationally. It offers electronic health records (EHR), information connectivity, private cloud hosting, outsourcing, analytics, patient access, and population health management solutions. The company operates in two segments: The Core Clinical and Financial Solutions; and The Data, Analytics and Care Coordination. The Core Clinical and Financial Solutions segment provides software applications for patient engagement, and integrated clinical and financial management solutions, which primarily include EHR-related software; and financial and practice management software solutions, as well as related installation, support and maintenance, outsourcing, private cloud hosting, and revenue cycle management services. The Data, Analytics and Care Coordination segment offers practice reimbursement, and payer and life sciences solutions, which are primarily targeted at physician practices, payers, life sciences companies, and other healthcare stakeholders. Its solutions enable clients to transition, analyze, and coordinate care and enhance the healthcare delivery across the care community. The company serves physicians, hospitals, governments, health systems, health plans, life-sciences companies, retail clinics, retail pharmacies, pharmacy benefit managers, insurance companies, and employer wellness clinics, as well as post-acute organizations, such as home health and hospice agencies. Allscripts Healthcare Solutions, Inc. was founded in 1986 and is headquartered in Chicago, Illinois.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Chicago"
    },
    "MDWK": {
        "short_name": "MDWERKS INC",
        "long_name": "MDwerks, Inc.",
        "summary": "MDwerks, Inc., through its subsidiaries, distributes healthcare technology solutions and provides services to the health care industry. It markets and leases digital pen technology, which includes sale of digital pens to healthcare providers, as well as provides funding to the healthcare provider industry. The company also offers FUNDwerks solutions, which electronically manage loans, loan repayments, and the movement of funds through linked bank accounts. Its customers include doctors, clinics, surgical or hospital based practices, home health care, nursing homes, and other healthcare providers. MDwerks, Inc. was founded in 2003 and is based in Deerfield Beach, Florida.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Deerfield Beach"
    },
    "MDXL": {
        "short_name": "MEDIXALL GROUP INC",
        "long_name": "MediXall Group, Inc.",
        "summary": "MediXall Group, Inc., together with its subsidiaries, operates a healthcare marketplace platform in the United States. The company's cloud- based MediXall.com platform connects patients with healthcare providers and wellness services, as well as provides facilities to search and compare medical, dental, and wellness services to consumers and healthcare providers. It also offers patient, cosmetic and elective procedure, commercial, and medical accounts receivable financing services to the healthcare sector. MediXall Group, Inc. was incorporated in 1998 and is based in Fort Lauderdale, Florida.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Fort Lauderdale"
    },
    "MITI": {
        "short_name": "MITESCO INC",
        "long_name": "Mitesco, Inc.",
        "summary": "Mitesco, Inc. operates medical clinics under the The Good Clinic name in North East Minneapolis, the United States. It offers wellness coaching, behavioral health care, episodic care, dermatologic services, and supplements. The company was formerly known as True Nature Holding, Inc. and changed its name to Mitesco, Inc. in April 2020. Mitesco, Inc. is based in Minnetonka, Minnesota.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Minnetonka"
    },
    "MOST": {
        "short_name": "MOBILESMITH INC",
        "long_name": "MobileSmith, Inc.",
        "summary": "MobileSmith, Inc. develops software applications for the healthcare industry in the United States. Its product portfolio includes PeriOp Patient Adherence, an EMR integrated mobile app-based set of pre and postoperative instructions that establish a clinical procedure management process between a patient and a healthcare provider; COVID Response Mobile Apps, a healthcare mobile apps supporting COVID-19 communications challenges for hospitals and their communities; and COVIDClear that assess and track the COVID-19 status of the workforce. The company was formerly known as Smart Online, Inc. and changed its name to MobileSmith, Inc. in July 2013. MobileSmith, Inc. was incorporated in 1993 and is headquartered in Raleigh, North Carolina.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Raleigh"
    },
    "MSRT": {
        "short_name": "MASSROOTS INC",
        "long_name": "MassRoots, Inc.",
        "summary": "MassRoots, Inc., together with its subsidiaries, operates a technology platform for the cannabis industry in the United States. The company operates www.MassRoots.com, which enables users to share their cannabis content, follow their favorite dispensaries, and stay connected with the legalization movement, as well as enables cannabis consumers to find products, connect with other enthusiasts, and deliver fresh content that informs audience. MassRoots, Inc. was incorporated in 2013 and is based in Denver, Colorado.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Denver"
    },
    "MTB0.F": {
        "short_name": "CARECLOUD INC.  DL-,001",
        "long_name": "CareCloud, Inc.",
        "summary": "CareCloud, Inc., a healthcare information technology (IT) company, provides a suite of cloud-based solutions and related business services to healthcare providers and hospitals primarily in the United States. It operates through two segments, Healthcare IT and Practice Management. The company's Software-as-a-Service platform includes revenue cycle management, practice management, electronic health record, business intelligence, telehealth, and patient experience management solutions, as well as complementary software tools and business services for medical groups and health systems. It serves physicians, nurses, nurse practitioners, physician assistants, and other clinicians that render bills for their services. The company was formerly known as MTBC, Inc. and changed its name to CareCloud, Inc. in March 2021. CareCloud, Inc. was founded in 1999 and is headquartered in Somerset, New Jersey.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Somerset"
    },
    "MTBB.F": {
        "short_name": "CARECLOUD INC.PREF. SR. A",
        "long_name": "CareCloud, Inc.",
        "summary": "CareCloud, Inc., a healthcare information technology (IT) company, provides a suite of cloud-based solutions and related business services to healthcare providers and hospitals primarily in the United States. It operates through two segments, Healthcare IT and Practice Management. The company's Software-as-a-Service platform includes revenue cycle management, practice management, electronic health record, business intelligence, telehealth, and patient experience management solutions, as well as complementary software tools and business services for medical groups and health systems. It serves physicians, nurses, nurse practitioners, physician assistants, and other clinicians that render bills for their services. The company was formerly known as MTBC, Inc. and changed its name to CareCloud, Inc. in March 2021. CareCloud, Inc. was founded in 1999 and is headquartered in Somerset, New Jersey.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Somerset"
    },
    "MTBC": {
        "short_name": "CareCloud, Inc.",
        "long_name": "CareCloud, Inc.",
        "summary": "CareCloud, Inc., a healthcare information technology (IT) company, provides a suite of cloud-based solutions and related business services to healthcare providers and hospitals primarily in the United States. It operates through two segments, Healthcare IT and Practice Management. The company's Software-as-a-Service platform includes revenue cycle management, practice management, electronic health record, business intelligence, telehealth, and patient experience management solutions, as well as complementary software tools and business services for medical groups and health systems. It serves physicians, nurses, nurse practitioners, physician assistants, and other clinicians that render bills for their services. The company was formerly known as MTBC, Inc. and changed its name to CareCloud, Inc. in March 2021. CareCloud, Inc. was founded in 1999 and is headquartered in Somerset, New Jersey.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "city": "Somerset"
    },
    "MTBCP": {
        "short_name": "CareCloud, Inc. - 11% Series A ",
        "long_name": "CareCloud, Inc.",
        "summary": "CareCloud, Inc., a healthcare information technology (IT) company, provides a suite of cloud-based solutions and related business services to healthcare providers and hospitals primarily in the United States. It operates through two segments, Healthcare IT and Practice Management. The company's Software-as-a-Service platform includes revenue cycle management, practice management, electronic health record, business intelligence, telehealth, and patient experience management solutions, as well as complementary software tools and business services for medical groups and health systems. It serves physicians, nurses, nurse practitioners, physician assistants, and other clinicians that render bills for their services. The company was formerly known as MTBC, Inc. and changed its name to CareCloud, Inc. in March 2021. CareCloud, Inc. was founded in 1999 and is headquartered in Somerset, New Jersey.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Somerset"
    },
    "NEL.F": {
        "short_name": "NANTHEALTH INC.  DL-,0001",
        "long_name": "NantHealth, Inc.",
        "summary": "NantHealth, Inc., together with its subsidiaries, operates as a healthcare IT company in the United States and internationally. It offers Eviti, a software-as-a-service (SaaS) based clinical decision support solution that centralizes clinical content and treatment cost data from Medicare reimbursements and treatment toxicity data; Eviti Connect, which utilizes the platform to offer pre-authorization automation that helps payers and providers navigate the complexities of cancer care; and Eviti Advisor product that allows physicians to access the Eviti platform's comprehensive library of evidence-based treatment standards and protocols to inform treatment decisions. The company also provides NaviNet, a suite of SaaS-based solution enabling payers and providers to streamline communication and consolidate information; NaviNet Open, a payer-provider collaboration platform for communication between health plans and providers; NaviNet AllPayer that provides eligibility, benefit, and claim status information to provider offices for commercial and government plans and CMS for Medicare beneficiaries through the NaviNet portal; and OpenNMS is an open-source network monitoring solution for enterprise-grade networks. In addition, it offers GPS Cancer, a comprehensive molecular profile that integrates whole genome/exome (DNA) sequencing of tumor and normal germline samples and whole transcriptome (RNA) sequencing; Omics Core, an in-vitro diagnostic built on a custom-targeted whole exome sequencing platform; and Quadris, a data solution that includes multi-data analysis, reporting, and professional service. The company was formerly known as Nant Health, LLC and changed its name to NantHealth, Inc. in June 2016. The company was incorporated in 2010 and is headquartered in Culver City, California. NantHealth, Inc. is as a subsidiary of NantWorks, LLC.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Culver City"
    },
    "NH": {
        "short_name": "NantHealth, Inc.",
        "long_name": "NantHealth, Inc.",
        "summary": "NantHealth, Inc., together with its subsidiaries, operates as a healthcare IT company in the United States and internationally. It offers Eviti, a software-as-a-service (SaaS) based clinical decision support solution that centralizes clinical content and treatment cost data from Medicare reimbursements and treatment toxicity data; Eviti Connect, which utilizes the platform to offer pre-authorization automation that helps payers and providers navigate the complexities of cancer care; and Eviti Advisor product that allows physicians to access the Eviti platform's comprehensive library of evidence-based treatment standards and protocols to inform treatment decisions. The company also provides NaviNet, a suite of SaaS-based solution enabling payers and providers to streamline communication and consolidate information; NaviNet Open, a payer-provider collaboration platform for communication between health plans and providers; NaviNet AllPayer that provides eligibility, benefit, and claim status information to provider offices for commercial and government plans and CMS for Medicare beneficiaries through the NaviNet portal; and OpenNMS is an open-source network monitoring solution for enterprise-grade networks. In addition, it offers GPS Cancer, a comprehensive molecular profile that integrates whole genome/exome (DNA) sequencing of tumor and normal germline samples and whole transcriptome (RNA) sequencing; Omics Core, an in-vitro diagnostic built on a custom-targeted whole exome sequencing platform; and Quadris, a data solution that includes multi-data analysis, reporting, and professional service. The company was formerly known as Nant Health, LLC and changed its name to NantHealth, Inc. in June 2016. The company was incorporated in 2010 and is headquartered in Culver City, California. NantHealth, Inc. is as a subsidiary of NantWorks, LLC.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Culver City"
    },
    "NMXS": {
        "short_name": "NET MEDICAL XPRESS SOLUTIONS IN",
        "long_name": "Net Medical Xpress Solutions, Inc.",
        "summary": "Net Medical Xpress Solutions, Inc. develops and markets Internet technology-based software solutions. It offers software products and services, such as telemedicine building block, an online service for doctors, offices, hospitals, and clinics for telemedicine services; digital paper, a paper form and turns into an online fill-out list; and single pane of glass software that allows a provider to be connected into a video conference with a patient. The company also provides electronic prescription system for physicians in private practice; electronic prior authorization system, which connects to health plans and pharmacies to verify prior authorization requirements related to medical tests, procedures, devices, and drugs that require pre-approval by insurers; and Electronic Medical Records (EMR) that provides the ability to connect with 43 various hospital EMR systems. In addition, it offers hardware products, such as Web real time communications, an advanced televideo conferencing system, as well as medical cart and various net medical USB digital diagnosing tools. Further, the company provides video clinical services, such as neurology and stroke assessment, behavioral assessment, and critical care; diagnostic services, including radiology and cardiology; and video primary care services. Additionally, it provides management and administrative services, such as credentialing, call center, recruiting and staffing, and professional liability insurance services; software hosting and maintenance, and custom programming; scanning services; and consulting, training, and installation services. The company was formerly known as New Mexico Software, Inc. and changed its name to Net Medical Xpress Solutions, Inc. in January 2013. Net Medical Xpress Solutions, Inc. was founded in 1980 and is based in Albuquerque, New Mexico.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Albuquerque"
    },
    "NXGN": {
        "short_name": "NextGen Healthcare, Inc.",
        "long_name": "NextGen Healthcare, Inc.",
        "summary": "NextGen Healthcare, Inc. provides ambulatory-focused healthcare software and services solutions in the United States. The company offers NextGen Enterprise electronic health record (EHR), which stores and maintains clinical patient information; and a workflow module, prescription management, automatic document and letter generation, patient education, referral tracking, interfaces to billing and lab systems, physician alerts and reminders, and reporting and data analysis tools. Its products also comprise NextGen Enterprise PM, a practice management (PM) solution; NextGen Office, a cloud-based EHR and PM solution; NextGen Mobile; and NextGen Electronic Healthcare Transactions. In addition, it provides population health solutions, such as NextGen Population Health Analytics, NextGen Population Health Patient Care Management, and NextGen Population Health Performance Management; and patient engagement solutions comprising NextGen Patient Portal, NextGen Self Scheduling, NextGen Patient Pay, and NextGen Virtual Visits solutions. Further, the company offers NextGen Connect Integration Engine, NextGen Health Data Hub, and NextGen Share interoperability solutions; managed services, including NextGen Managed Cloud and NextGen Revenue Cycle Management Services; professional services; and client service and support. It serves managed service organizations, independent physician associations, accountable care organizations, ambulatory care centers, and community health centers through a sales force and reseller channel. The company was formerly known as Quality Systems, Inc. and changed its name to NextGen Healthcare, Inc. in September 2018. NextGen Healthcare, Inc. was founded in 1974 and is headquartered in Irvine, California.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Irvine"
    },
    "OC9.F": {
        "short_name": "OMNICELL INC.  DL-,001",
        "long_name": "Omnicell, Inc.",
        "summary": "Omnicell, Inc., together with its subsidiaries, provides medication management automation solutions and adherence tools for healthcare systems and pharmacies the United States and internationally. The company offers central pharmacy automation solutions, including automated storage and retrieval systems, such as XR2 Automated Central Pharmacy System, a building block of autonomous pharmacy vision; IV compounding robots and workflow management systems; inventory management software; and controlled substance management systems. It also provides point of care automation solutions to improve clinician workflows in patient care areas of the healthcare system; XT Series automated dispensing systems for medications and supplies used in nursing units and other clinical areas of the hospital, as well as specialized automated dispensing systems for operating room; Omnicell Interface Software that offers interface and integration between its medication-use products or supply products, and a healthcare facility's in-house information management systems; and robotic dispensing systems for handling the stocking and retrieval of boxed medications. In addition, the company provides automated systems to help pharmacies in filling its multimed adherence packaging based on individual patient medication orders; single dose automation solutions to fill and label for incoming prescriptions; semi-automated filling equipment for the long-term care institutional pharmacy; and medication blister card packaging and packaging supplies to enhance medication adherence in non-acute care settings. Further, it offers EnlivenHealth Patient Engagement, a web-based nexus of solutions. The company was formerly known as Omnicell Technologies, Inc. and changed its name to Omnicell, Inc. in 2001. Omnicell, Inc. was incorporated in 1992 and is headquartered in Mountain View, California.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Mountain View"
    },
    "OLMM": {
        "short_name": "ONELIFE TECHNOLOGIES CORP",
        "long_name": "OneLife Technologies Corp.",
        "summary": "OneLife Technologies Corp. operates as a mobile medical hardware, software, and data collection company in the United States and internationally. The company offers a suite of medical grade tracking technologies to provide patients, physicians, nursing homes, and hospitals with real-time comprehensive health data and monitoring. Its products include Sensation, a wearable designed for the health and medical markets who want or need to track aspects of their physical health, such as heart rate, activity, sleep patterns, and location; and Tricorder that captures blood pressure, heart rate, ECG/EKG, SpO2, and temperature from a patient. The company's products also comprise Personal Data Vault that offers the user a data vault, which is the central repository of their health data. OneLife Technologies Corp. is based in Rolling Meadows, Illinois.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Rolling Meadows"
    },
    "OMCL": {
        "short_name": "Omnicell, Inc.",
        "long_name": "Omnicell, Inc.",
        "summary": "Omnicell, Inc., together with its subsidiaries, provides medication management automation solutions and adherence tools for healthcare systems and pharmacies the United States and internationally. The company offers central pharmacy automation solutions, including automated storage and retrieval systems, such as XR2 Automated Central Pharmacy System, a building block of autonomous pharmacy vision; IV compounding robots and workflow management systems; inventory management software; and controlled substance management systems. It also provides point of care automation solutions to improve clinician workflows in patient care areas of the healthcare system; XT Series automated dispensing systems for medications and supplies used in nursing units and other clinical areas of the hospital, as well as specialized automated dispensing systems for operating room; Omnicell Interface Software that offers interface and integration between its medication-use products or supply products, and a healthcare facility's in-house information management systems; and robotic dispensing systems for handling the stocking and retrieval of boxed medications. In addition, the company provides automated systems to help pharmacies in filling its multimed adherence packaging based on individual patient medication orders; single dose automation solutions to fill and label for incoming prescriptions; semi-automated filling equipment for the long-term care institutional pharmacy; and medication blister card packaging and packaging supplies to enhance medication adherence in non-acute care settings. Further, it offers EnlivenHealth Patient Engagement, a web-based nexus of solutions. The company was formerly known as Omnicell Technologies, Inc. and changed its name to Omnicell, Inc. in 2001. Omnicell, Inc. was incorporated in 1992 and is headquartered in Mountain View, California.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Mountain View"
    },
    "ONEM": {
        "short_name": "1Life Healthcare, Inc.",
        "long_name": "1Life Healthcare, Inc.",
        "summary": "1Life Healthcare, Inc. operates a membership-based primary care platform under the One Medical brand. The company has developed a healthcare membership model based on direct consumer enrollment, as well as employer sponsorship. Its membership model includes seamless access to digital health services paired with inviting in-office care routinely covered under health insurance programs. The company also offers administrative and managerial services pursuant to contracts with physician-owned professional corporations or One Medical Entities. As of December 31, 2020, it had approximately 549,000 members in 13 markets in the United States; and 8,000 enterprise clients. The company was incorporated in 2002 and is headquartered in San Francisco, California.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "San Francisco"
    },
    "OPRX": {
        "short_name": "OptimizeRx Corporation",
        "long_name": "OptimizeRx Corporation",
        "summary": "OptimizeRx Corporation operates as a digital health company that provides communications solutions for life science companies, physicians, and patients. Its products and applications include financial messaging, a virtual patient support center that allows doctors and staff to access sample vouchers, co-pay coupons, and other patient support through their EMR and/or e-prescribe systems; and brand awareness and therapeutic support messaging services, such as brand awareness messages, reminder ads, therapeutic support messages, and unbranded messages. The company also offers brand support services, which focuses on educating and working with pharmaceutical manufacturers on identifying, formulating, and implementing new eRx media strategies, including drug file integration, sales force training, and strategy development services for promoting their products. In addition, it operates cloud based Mobile Health Messenger platform that provides interactive health messaging for enhanced medication adherence and care coordination; and HIPAA-compliant automated mobile messaging platform that allows pharmaceutical manufactures and related entities to directly engage with patients to enhance regimen compliance. Further, the company offers patient programs with treatment and affordability information, lifestyle and condition trackers, Internet device connectivity, forms, and surveys. OptimizeRx Corporation is headquartered in Rochester, Michigan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "Rochester"
    },
    "ORHB": {
        "short_name": "ORHUB INC",
        "long_name": "ORHub, Inc.",
        "summary": "ORHub, Inc. provides surgical software focusing on real-time surgical data analytics. The company's suite of products serves the needs of the health care industry, hospitals, patients, the government, and medical device vendors. The company provides a cloud-based software solution that captures information before, during, and after surgery. Its software applications allow hospitals and medical device vendors to utilize Web-enabled device to create an anatomical graphic depiction during surgery. The company is based in Phoenix, Arizona.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Phoenix"
    },
    "PASO": {
        "short_name": "PATIENT ACCESS SOLUTIONS INC",
        "long_name": "Patient Access Solutions, Inc.",
        "summary": "Patient Access Solutions, Inc. provides healthcare/financial processing solutions for the healthcare and dental industries. The company, through its merchant processing platform, provides patient eligibility, medical billing, and patient self-pay solutions. It also provides practice management, business management consulting, GAP analysis, and marketing and practice development services; and treatment services for autism, concussion, PTSD, and other biomedical conditions, as well as diagnostic testing services. Patient Access Solutions, Inc. is based in Plainview, New York.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Plainview"
    },
    "PBSV": {
        "short_name": "PHARMA-BIO SERVICES INC",
        "long_name": "Pharma-Bio Serv, Inc.",
        "summary": "Pharma-Bio Serv, Inc. operates as a compliance and technology transfer services consulting firm. It provides compliance consulting services to the pharmaceutical, chemical, biotechnology, medical device, cosmetic, food industries, and allied products in Puerto Rico, the United States, Europe, and Brazil. The company's technical consulting services comprise regulatory compliance, validation, technology transfer, engineering, project management, and process support. Pharma-Bio Serv, Inc. was founded in 1993 and is headquartered in Dorado, Puerto Rico.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Dorado"
    },
    "PCYS": {
        "short_name": "PRIMECARE SYSTEMS INC",
        "long_name": "PrimeCare Systems, Inc.",
        "summary": "PrimeCare Systems, Inc., together with its subsidiaries, engages in the creation, ownership, maintenance, and marketing of patient management systems primarily in the United States. The company offers PrimeCare Version Ten, a multitier patient management system; and CodeComplierJ, an application software program that organizes the data in the proper classification and also calculates the evaluation and management reimbursement code level for third party payers. Its principal target markets include national and local health care systems, military organizations, correctional facilities, health maintenance organizations, hospitals with outpatient services, ambulatory/outpatient medical facilities, clinics, group practices, and solo practitioners. The company also creates, owns, maintains, and markets Web sites containing secure Internet enhanced and targeted components of the PrimeCare System. Its Web sites include PrimeCareOnTheWeb.com, a physician and patient interactive Website; YourOwnDoctor.com, which provides free individual Websites for physicians, physician groups, and other health care providers who register for PrimeCareOnTheWeb; and YourOwnHealth.com, an online health and wellness Website. The company focuses on selling its products directly to at-risk healthcare entities, and through distributors and private labeling opportunities. PrimeCare Systems, Inc. was incorporated in 1994 and is based in Newport News, Virginia.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Newport News"
    },
    "PGNY": {
        "short_name": "Progyny, Inc.",
        "long_name": "Progyny, Inc.",
        "summary": "Progyny, Inc., a benefits management company, specializes in fertility and family building benefits solutions for employers in the United States. Its fertility benefits solution includes differentiated benefits plan design, personalized concierge-style member support services, and selective network of fertility specialists. The company also offers Progyny Rx, an integrated pharmacy benefits solution that provides its members with access to the medications needed during their treatment. In addition, it provides surrogacy and adoption reimbursement programs for employers. The company was formerly known as Auxogyn, Inc. and changed its name to Progyny, Inc. in 2015. Progyny, Inc. was incorporated in 2008 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "PHR": {
        "short_name": "Phreesia, Inc.",
        "long_name": "Phreesia, Inc.",
        "summary": "Phreesia, Inc. provides an integrated SaaS-based software and payment platform for the healthcare industry in the United States and Canada. Its Phreesia Platform offers a suite of solutions to manage the patient intake process, as well as an integrated payments solution for processing of patient payments. The company deploys its platform in a range of modalities, such as Phreesia Mobile, a patients' mobile device; Phreesia Dashboard, a Web-based dashboard for providers; PhreesiaPads, which are self-service intake tablets; and Arrivals Kiosks that are on-site kiosks. Its Phreesia Platform also provides a registration solution to automate patient self-registration; revenue cycle solution, which offer insurance-verification processes, point-of-sale payments applications, and cost estimation tools; appointments solution for online appointments, reminders, and referral tracking; and patient activation solution that enables providers to communicate with their patients through surveys, announcements, messaging, and health campaigns. In addition, the company's Phreesia Platform offers clinical support solution, which collects clinical intake and PRO data for approximately 25 specialties; and life sciences solution to deliver targeted and clinically relevant marketing content to patients, as well as COVID-19 product offerings for managing COVID-19 vaccine delivery and identify vaccine-hesitant patients, screening for self-reported COVID-19 risk factors, enabling contactless check-in during in-person visits, and collecting intake information during telehealth visits. It serves patients; single-specialty practices, multi-specialty groups, and health systems; and pharmaceutical, medical device, and biotechnology companies. The company was founded in 2005 and is headquartered in Raleigh, North Carolina.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Raleigh"
    },
    "PINC": {
        "short_name": "Premier, Inc.",
        "long_name": "Premier, Inc.",
        "summary": "Premier, Inc., together with its subsidiaries, operates as a healthcare improvement company in the United States. It operates through two segments, Supply Chain Services and Performance Services. The Supply Chain Services segment offers its members with access to a range of products and services, including medical and surgical products, pharmaceuticals, laboratory supplies, capital equipment, information technology, facilities and construction, and food and nutritional products, as well as purchased services, such as clinical engineering and document shredding services. It is also involved in the provision of the ASCEND Collaborative service for members to receive group purchasing programs, tiers, and prices, as well as managed services; SURPASS Collaborative service; STOCKD, an e-commerce platform; and PROVIDEGX program, which identifies supply sources for drugs that are on or may be at risk of being added to the national drug shortage list, or that are vulnerable to pricing volatility, as well as direct sourcing business. The Performance Services segment offers PremierConnect for members to address existing cost and quality imperatives, enable them manage a value-based care reimbursement model, and support their regulatory reporting framework; performance improvement collaborative; and consulting and insurance services. This segment's various PremierConnect domains include PremierConnect Quality & Regulatory, PremierConnect Clinical Surveillance & Safety, PremierConnect Supply Chain & ERP, PremierConnect Operations, PremierConnect Enterprise Analytics, and PREMIERCONNECT Clinical Decision Support domains. Premier, Inc. has a collaboration to develop a same-day breast cancer diagnosis and treatment model. The company was incorporated in 2013 and is headquartered in Charlotte, North Carolina.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Charlotte"
    },
    "PM8.F": {
        "short_name": "PREMIER INC.  DL-,01",
        "long_name": "Premier, Inc.",
        "summary": "Premier, Inc., together with its subsidiaries, operates as a healthcare improvement company in the United States. It operates through two segments, Supply Chain Services and Performance Services. The Supply Chain Services segment offers its members with access to a range of products and services, including medical and surgical products, pharmaceuticals, laboratory supplies, capital equipment, information technology, facilities and construction, and food and nutritional products, as well as purchased services, such as clinical engineering and document shredding services. It is also involved in the provision of the ASCEND Collaborative service for members to receive group purchasing programs, tiers, and prices, as well as managed services; SURPASS Collaborative service; STOCKD, an e-commerce platform; and PROVIDEGX program, which identifies supply sources for drugs that are on or may be at risk of being added to the national drug shortage list, or that are vulnerable to pricing volatility, as well as direct sourcing business. The Performance Services segment offers PremierConnect for members to address existing cost and quality imperatives, enable them manage a value-based care reimbursement model, and support their regulatory reporting framework; performance improvement collaborative; and consulting and insurance services. This segment's various PremierConnect domains include PremierConnect Quality & Regulatory, PremierConnect Clinical Surveillance & Safety, PremierConnect Supply Chain & ERP, PremierConnect Operations, PremierConnect Enterprise Analytics, and PREMIERCONNECT Clinical Decision Support domains. Premier, Inc. has a collaboration to develop a same-day breast cancer diagnosis and treatment model. The company was incorporated in 2013 and is headquartered in Charlotte, North Carolina.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Charlotte"
    },
    "PPJE": {
        "short_name": "PPJ HEALTHCARE ENTERPRISES INC",
        "long_name": "PPJ Healthcare Enterprises, Inc.",
        "summary": "PPJ Healthcare Enterprises, Inc., through its subsidiaries, provides automated healthcare reimbursement cycle, online health information digital-systems, and practice information management digital-system software to health care providers and general businesses worldwide. The company offers the Automated Biller, a medical billing system that allows physicians to bill their medical insurance claims at the point of service without data entry, coding, or billing personnel. It also provides billing, specialty medical billing, collection, and workers comp lien collection services for health care providers in the areas of pain management, anesthesia and surgery centers practices, and various specialties of medicine. The company was formerly known as PPJ Enterprise and changed its name to PPJ Healthcare Enterprises, Inc. in October 2014. PPJ Healthcare Enterprises, Inc. was founded in 2000 and is headquartered in Reno, Nevada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Reno"
    },
    "PRVA": {
        "short_name": "Privia Health Group, Inc.",
        "long_name": "Privia Health Group, Inc.",
        "summary": "Privia Health Group, Inc. operates as a physician practice management and population health technology company in the United States. The company comprises regional medical groups, accountable care organizations, and specialty verticals. It offers technology and population health tools to enhance independent providers' workflows; management service organization that enables providers to reduce administrative work focus on their patients; single-TIN medical group that facilitates payer negotiation, clinical integration and alignment of financial incentives; physician-led accountable care organization, which engages patients, reduces inappropriate utilization, and enhances coordination and patient quality metrics to drive value-based care and transform the healthcare delivery system; and network for purchasers and payers. The company was founded in 2007 and is headquartered in Arlington, Virginia. Privia Health Group, Inc. operates as a subsidiary of Brighton Health Group Holdings, LLC.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Arlington"
    },
    "PS1.F": {
        "short_name": "COMPUTER PROGRAMS + SYS",
        "long_name": "Computer Programs and Systems, Inc.",
        "summary": "Computer Programs and Systems, Inc. provides healthcare information technology solutions and services in the United States and the Caribbean nation of St. Maarten. Its software systems include patient management software that enables a hospital to identify a patient at various points in the healthcare delivery system, as well as to collect and maintain patient information throughout the process of patient care; and financial accounting software, which offers business office applications to track and coordinate information needed for managerial decision-making. The company also provides clinical software that automates record keeping and reporting for various clinical functions, including laboratory, radiology, physical therapy, respiratory care, and pharmacy; patient care applications; and enterprise applications that support its products for use in various areas of the hospital. In addition, it offers Centriq, an intuitive user interface to centralize data from various care areas that provide the end user with a tool to view past and present patient information. Further, the company provides software solutions that promote data-driven clinical and financial outcomes for customers in the post-acute care industry; software application support, hardware maintenance, and education and related services; post-acute care support and maintenance services; revenue cycle management products and services, consulting and business management services, and managed information technology services; patient engagement and empowerment technology solutions; and system implementation and training services. It serves community hospitals and physician clinics, skilled nursing and assisted living facilities, and small specialty hospitals. Computer Programs and Systems, Inc. was founded in 1979 and is headquartered in Mobile, Alabama.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Mobile"
    },
    "QEBR": {
        "short_name": "VIRTUAL MEDICAL INTERNATIONAL I",
        "long_name": "Virtual Medical International, Inc.",
        "summary": "Virtual Medical International, Inc. operates as a health wellness company in the hemp-derived CBD sector. It focuses on cultivating, harvesting, and packaging cannabis. The company provides its products under the brand name Amsterdam CafÃ©: Welcome to Your Whole Health. It sells its products through company-owned retail stores and franchise stores, as well as through online. The company is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Las Vegas"
    },
    "QY1.F": {
        "short_name": "NEXTGEN HEALTHC.  DL-,01",
        "long_name": "NextGen Healthcare, Inc.",
        "summary": "NextGen Healthcare, Inc. provides ambulatory-focused healthcare software and services solutions in the United States. The company offers NextGen Enterprise electronic health record (EHR), which stores and maintains clinical patient information; and a workflow module, prescription management, automatic document and letter generation, patient education, referral tracking, interfaces to billing and lab systems, physician alerts and reminders, and reporting and data analysis tools. Its products also comprise NextGen Enterprise PM, a practice management (PM) solution; NextGen Office, a cloud-based EHR and PM solution; NextGen Mobile; and NextGen Electronic Healthcare Transactions. In addition, it provides population health solutions, such as NextGen Population Health Analytics, NextGen Population Health Patient Care Management, and NextGen Population Health Performance Management; and patient engagement solutions comprising NextGen Patient Portal, NextGen Self Scheduling, NextGen Patient Pay, and NextGen Virtual Visits solutions. Further, the company offers NextGen Connect Integration Engine, NextGen Health Data Hub, and NextGen Share interoperability solutions; managed services, including NextGen Managed Cloud and NextGen Revenue Cycle Management Services; professional services; and client service and support. It serves managed service organizations, independent physician associations, accountable care organizations, ambulatory care centers, and community health centers through a sales force and reseller channel. The company was formerly known as Quality Systems, Inc. and changed its name to NextGen Healthcare, Inc. in September 2018. NextGen Healthcare, Inc. was founded in 1974 and is headquartered in Irvine, California.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Irvine"
    },
    "RCM": {
        "short_name": "R1 RCM Inc.",
        "long_name": "R1 RCM Inc.",
        "summary": "R1 RCM Inc. provides revenue cycle management (RCM) for healthcare providers in the United States. The company offers end-to-end RCM services to manage their revenue cycle operations that encompass patient registration, insurance and benefit verification, medical treatment documentation and coding, bill preparation, and collections from patients and payers. It also provides modular services comprising physician advisory services, which assists healthcare organizations in complying with payer requirements regarding whether to classify a hospital visit as an in-patient or an out-patient observation case for billing purposes; practice management services that offers administrative and operational support for patient care and outsource non-core functions; revenue integrity solutions, including charge capture, charge description master maintenance, and pricing services; coding management services, such as business intelligence and analysis, human capital management, accountability framework, and quality management programs; patient experience; and business office services. In addition, the company offers software-as-a-service based scheduling and patient access solutions. It serves healthcare providers, including health systems, hospitals, and physician groups. The company was formerly known as Accretive Health, Inc. and changed its name to R1 RCM Inc. in January 2017. R1 RCM Inc. was incorporated in 2003 and is headquartered in Chicago, Illinois.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Chicago"
    },
    "REFG": {
        "short_name": "MEDICAL CANNABIS PAYMENT SOLUTI",
        "long_name": "Medical Cannabis Payment Solutions, Inc.",
        "summary": "Medical Cannabis Payment Solutions, Inc. develops and markets a payment system for medical cannabis transactions. Its solution assists in the state tracking of sales, collection of tax, and supervision of sales to consumers. The company was incorporated in 2013 and is based in Cheyenne, Wyoming.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Cheyenne"
    },
    "SD3.F": {
        "short_name": "SIMULATIONS PLUS  DL-,01",
        "long_name": "Simulations Plus, Inc.",
        "summary": "Simulations Plus, Inc. develops drug discovery and development software for mechanistic modeling and simulation, and prediction of properties of molecules utilizing artificial-intelligence- and machine-learning-based technology worldwide. The company offers GastroPlus, which simulates the absorption, pharmacokinetics (PK), pharmacodynamics, and drug-drug interactions of compounds administered to humans and animals; DDDPlus that simulates in vitro laboratory experiments; and MembranePlus, which simulates laboratory experiments. It also provides PKPlus, a program that provides the functionality needed by pharmaceutical industry scientists to perform the analyses and generate the outputs needed to satisfy regulatory agency requirements for noncompartmental analysis and compartmental PK modelling; ADMET Predictor, a chemistry-based computer program that takes molecular structures as inputs and predicts their properties; and MedChem Designer, a molecule drawing program or sketcher. In addition, it offers KIWI, a cloud-based web application to organize, process, maintain, and communicate the volume of data and results generated by pharmacologists and scientists over the duration of a drug development program; DILIsym, a quantitative systems pharmacology software; NAFLDsym, a simulation program for analyzing nonalcoholic fatty liver disease; RENAsym for investigating and predicting drug-induced or acute kidney injury; IPFsym, a software tool to treat or cure idiopathic pulmonary fibrosis; and the Monolix Suite, a solution for modeling and simulation. Further, the company provides population modeling and simulation contract research services; and clinical-pharmacology-based consulting services in support of regulatory submissions. It serves pharmaceutical, biotechnology, agrochemical, cosmetics, and food companies, as well as academic and regulatory agencies. The company was founded in 1996 and is headquartered in Lancaster, California.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Lancaster"
    },
    "SDGR": {
        "short_name": "Schrodinger, Inc.",
        "long_name": "Schrödinger, Inc.",
        "summary": "SchrÃ¶dinger, Inc. provides physics-based software platform that enables discovery of novel molecules for drug development and materials applications. The company operates through two segments, Software and Drug Discovery. The Software segment is focused on selling its software for drug discovery in the life sciences industry, as well as to customers in materials science industries. The Drug Discovery segment focuses on building a portfolio of preclinical and clinical programs, internally and through collaborations. The company serves biopharmaceutical and industrial companies, academic institutions, and government laboratories worldwide. SchrÃ¶dinger, Inc. has strategic collaborations with Thermo Fisher Scientific to extend the use of cryo-EM in connection within silico compound screening to accelerate drug discovery; Bristol Myers Squibb Company to discover, develop, and commercialize therapeutics in multiple disease areas; and NVIDIA designed to harness DGX SuperPODs. . The company was incorporated in 1990 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "SGFY": {
        "short_name": "Signify Health, Inc.",
        "long_name": "Signify Health, Inc.",
        "summary": "Signify Health, Inc. operates a healthcare platform that utilizes analytics, technology, and healthcare provider networks in the United States. The company operates in two segments, Home & Community Services and Episodes of Care Services. The Home & Community Services segment offers health evaluations performed within the patient's home or at a healthcare provider facility primarily to Medicare Advantage health plans; diagnostic screening and other ancillary services; and services to address healthcare concerns related to social determinants of health. The Episodes of Care Services segment provides services to enhance the healthcare delivery through developing and managing episodic payment programs in partnership with healthcare providers primarily under the Medicare Bundled Payment for Care Improvement Advanced program with Centers for Medicare and Medicaid Services; and care management services. Its customers include health plans, governments, employers, health systems, and physician groups. The company was founded in 2017 and is headquartered in Dallas, Texas with additional offices in Austin, New York, Norwalk, and Rapid City.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Dallas"
    },
    "SLP": {
        "short_name": "Simulations Plus, Inc.",
        "long_name": "Simulations Plus, Inc.",
        "summary": "Simulations Plus, Inc. develops drug discovery and development software for mechanistic modeling and simulation, and prediction of properties of molecules utilizing artificial-intelligence- and machine-learning-based technology worldwide. The company offers GastroPlus, which simulates the absorption, pharmacokinetics (PK), pharmacodynamics, and drug-drug interactions of compounds administered to humans and animals; DDDPlus that simulates in vitro laboratory experiments; and MembranePlus, which simulates laboratory experiments. It also provides PKPlus, a program that provides the functionality needed by pharmaceutical industry scientists to perform the analyses and generate the outputs needed to satisfy regulatory agency requirements for noncompartmental analysis and compartmental PK modelling; ADMET Predictor, a chemistry-based computer program that takes molecular structures as inputs and predicts their properties; and MedChem Designer, a molecule drawing program or sketcher. In addition, it offers KIWI, a cloud-based web application to organize, process, maintain, and communicate the volume of data and results generated by pharmacologists and scientists over the duration of a drug development program; DILIsym, a quantitative systems pharmacology software; NAFLDsym, a simulation program for analyzing nonalcoholic fatty liver disease; RENAsym for investigating and predicting drug-induced or acute kidney injury; IPFsym, a software tool to treat or cure idiopathic pulmonary fibrosis; and the Monolix Suite, a solution for modeling and simulation. Further, the company provides population modeling and simulation contract research services; and clinical-pharmacology-based consulting services in support of regulatory submissions. It serves pharmaceutical, biotechnology, agrochemical, cosmetics, and food companies, as well as academic and regulatory agencies. The company was founded in 1996 and is headquartered in Lancaster, California.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "Lancaster"
    },
    "STRM": {
        "short_name": "Streamline Health Solutions, In",
        "long_name": "Streamline Health Solutions, Inc.",
        "summary": "Streamline Health Solutions, Inc. provides health information technology solutions and associated services for hospitals and health systems in the United States and Canada. It provides computer software-based solutions and auditing services, which captures, aggregates, and translates structured and unstructured data to deliver predictive insights. The company also offers coding and clinical documentation improvement (CDI) solutions, which includes integrated cloud-based software suite, CDI, and abstracting and physician query; and eValuator, a cloud-based pre-bill coding analysis platform. In addition, it provides financial management solutions, including accounts receivable management, denials management, claims processing, spend management, and audit management; patient care solutions; and custom integration services for CDI/abstracting, training, and audit services. The company sells its solutions and services through direct sales force and reseller partnerships. Streamline Health Solutions, Inc. was incorporated in 1989 and is based in Alpharetta, Georgia.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Alpharetta"
    },
    "T2DH34.SA": {
        "short_name": "TELADOCHEALTDRN",
        "long_name": "Teladoc Health, Inc.",
        "summary": "Teladoc Health, Inc. provides virtual healthcare services on a business-to-business basis in the United States and internationally. It covers various clinical conditions, including non-critical, episodic care, chronic, and complicated cases like cancer and congestive heart failure, as well as offers telehealth solutions, chronic condition management, expert medical services, behavioral health solutions, guidance and support, and platform and program services. It serves health employers, health plans, hospitals, health systems, and insurance and financial services companies. The company offers its products and services under the Teladoc, Livongo, Advance Medical, Best Doctors, BetterHelp, and HealthiestYou brands. The company was formerly known as Teladoc, Inc. and changed its name to Teladoc Health, Inc. in August 2018. Teladoc Health, Inc. was Incorporated in 2002 and is headquartered in Purchase, New York.",
        "currency": "BRL",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Purchase"
    },
    "TDOC.MX": {
        "short_name": "TELADOC HEALTH INC",
        "long_name": "Teladoc Health, Inc.",
        "summary": "Teladoc Health, Inc. provides virtual healthcare services on a business-to-business basis in the United States and internationally. It covers various clinical conditions, including non-critical, episodic care, chronic, and complicated cases like cancer and congestive heart failure, as well as offers telehealth solutions, chronic condition management, expert medical services, behavioral health solutions, guidance and support, and platform and program services. It serves health employers, health plans, hospitals, health systems, and insurance and financial services companies. The company offers its products and services under the Teladoc, Livongo, Advance Medical, Best Doctors, BetterHelp, and HealthiestYou brands. The company was formerly known as Teladoc, Inc. and changed its name to Teladoc Health, Inc. in August 2018. Teladoc Health, Inc. was Incorporated in 2002 and is headquartered in Purchase, New York.",
        "currency": "MXN",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Purchase"
    },
    "TDOC": {
        "short_name": "Teladoc Health, Inc.",
        "long_name": "Teladoc Health, Inc.",
        "summary": "Teladoc Health, Inc. provides virtual healthcare services on a business-to-business basis in the United States and internationally. It covers various clinical conditions, including non-critical, episodic care, chronic, and complicated cases like cancer and congestive heart failure, as well as offers telehealth solutions, chronic condition management, expert medical services, behavioral health solutions, guidance and support, and platform and program services. It serves health employers, health plans, hospitals, health systems, and insurance and financial services companies. The company offers its products and services under the Teladoc, Livongo, Advance Medical, Best Doctors, BetterHelp, and HealthiestYou brands. The company was formerly known as Teladoc, Inc. and changed its name to Teladoc Health, Inc. in August 2018. Teladoc Health, Inc. was Incorporated in 2002 and is headquartered in Purchase, New York.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Purchase"
    },
    "TRHC": {
        "short_name": "Tabula Rasa HealthCare, Inc.",
        "long_name": "Tabula Rasa HealthCare, Inc.",
        "summary": "Tabula Rasa HealthCare, Inc. operates as a healthcare technology company in the United States. The company operates through two segments, CareVention HealthCare and MedWise HealthCare. It offers EireneRx, a cloud-based medication decision-support and e-prescribing platform to access patient medication-related information; and MedWise software that provides medication decision support components for clients seeking to manage their medication risk and improve medication outcomes, and patient relationships by enhancing their existing programs or systems. The company also provides RxCompanion, a cloud-based MTM software platform designed to aid in the identification and resolution of medication and other health related problems; TruChart, a web-based electronic health record for Programs of All-Inclusive Care for the Elderly (PACE) organizations; PACElogic, which delivers real-time sharable workflows comprising EHR, customer relationship management, claims adjudication, electronic data interchange, care management, coordination and planning, integration with community-based providers, and various federal and state required reporting. In addition, the company offers DoseMeRx, a decision support software; PrescribeWellness, a patient engagement center platform; and clinical pharmacist collaboration, prescription fulfillment and reminder packaging, and pharmacy cost management services, as well as health plan management services, including risk adjustment and third party administrator services. As of December 31, 2020, it served approximately 130 healthcare organizations; and 280 health plans and approximately 14,000 retail pharmacies. The company provides cloud-based software applications to assist prescribers and pharmacists. Tabula Rasa HealthCare, Inc. was founded in 2009 and is headquartered in Moorestown, New Jersey.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Moorestown"
    },
    "TXG.MX": {
        "short_name": "10X GENOMICS INC",
        "long_name": "10x Genomics, Inc.",
        "summary": "10x Genomics, Inc., a life science technology company, develops and sells instruments, consumables, and software for analyzing biological systems in North America, Europe, the Middle East, Africa, China, and the Asia Pacific. The company provides chromium and chromium connect instruments, microfluidic chips, slides, reagents, and other consumables products. Its single cell solutions runs on its chromium instruments, which include single cell gene expression for measuring gene activity on a cell-by-cell basis; single cell immune profiling for measuring the activity of immune cells and their targets; single cell ATAC for measuring epigenetics comprising the physical organization of DNA; and single cell multiome ATAC + gene expression for measuring the genetic activity and epigenetic programming in the same cells across tens of thousands of cells in a single experiment. The company also provides visium spatial gene expression solution for measuring spatial gene expression patterns across a single tissue sample or gene expression and protein co-detection when combined with immunofluorescence. It serves various academic, government, biopharmaceutical, biotechnology, and other institutions. The company was formerly known as 10X Technologies, Inc. and changed its name to 10x Genomics, Inc. in November 2014. 10x Genomics, Inc. was incorporated in 2012 and is headquartered in Pleasanton, California.",
        "currency": "MXN",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Pleasanton"
    },
    "TXG": {
        "short_name": "10x Genomics, Inc.",
        "long_name": "10x Genomics, Inc.",
        "summary": "10x Genomics, Inc., a life science technology company, develops and sells instruments, consumables, and software for analyzing biological systems in North America, Europe, the Middle East, Africa, China, and the Asia Pacific. The company provides chromium and chromium connect instruments, microfluidic chips, slides, reagents, and other consumables products. Its single cell solutions runs on its chromium instruments, which include single cell gene expression for measuring gene activity on a cell-by-cell basis; single cell immune profiling for measuring the activity of immune cells and their targets; single cell ATAC for measuring epigenetics comprising the physical organization of DNA; and single cell multiome ATAC + gene expression for measuring the genetic activity and epigenetic programming in the same cells across tens of thousands of cells in a single experiment. The company also provides visium spatial gene expression solution for measuring spatial gene expression patterns across a single tissue sample or gene expression and protein co-detection when combined with immunofluorescence. It serves various academic, government, biopharmaceutical, biotechnology, and other institutions. The company was formerly known as 10X Technologies, Inc. and changed its name to 10x Genomics, Inc. in November 2014. 10x Genomics, Inc. was incorporated in 2012 and is headquartered in Pleasanton, California.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Pleasanton"
    },
    "UCBB": {
        "short_name": "US-CHINA BIOMEDICAL TECHNOLOGY ",
        "long_name": "US-China Biomedical Technology, Inc.",
        "summary": "US-China Biomedical Technology, Inc. operates as an early stage biomedical technology and services company. The company was formerly known as Cloud Security Corporation and changed its name to US-China Biomedical Technology, Inc. in February 2018. US-China Biomedical Technology, Inc. was founded in 2010 and is headquartered in Irvine, California.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Irvine"
    },
    "USAQ": {
        "short_name": "USA EQUITIES CORP",
        "long_name": "USA Equities Corp.",
        "summary": "USA Equities Corp. focuses on healthcare, informatics, and algorithmic personalized medicine. It intends to develop digital therapeutics, behavior based remote patient monitoring, chronic care, and preventive medicines. The company also provides QHSLab, a cloud based medical office and mobile patient education solution; and distributes AllergiEnd, an allergy diagnostic and allergen immunotherapy system, and related components to non-allergy specialist physicians. Its products and information service portfolio include prevention, early detection, management, and reversal of cardio-metabolic and other chronic diseases. The company was formerly known as American Biogenetic Sciences, Inc. and changed its name to USA Equities Corp. in May 2015. USA Equities Corp. was incorporated in 1983 and is based in West Palm Beach, Florida.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "West Palm Beach"
    },
    "VASO": {
        "short_name": "VASO CORP",
        "long_name": "Vaso Corporation",
        "summary": "Vaso Corporation, together with its subsidiaries, operates in the healthcare equipment and information technology industries in the United States and internationally. The company operates through three segments: IT, Professional Sales Service, and Equipment. The IT segment primarily focuses on healthcare IT and managed network technology services. This segment offers managed diagnostic imaging applications, managed network infrastructure, managed network transport, and managed security services. The Professional Sales Service segment principally focuses on the sale of healthcare capital equipment for General Electric Healthcare (GEHC) into the health provider middle market. Its offerings include GEHC diagnostic imaging capital equipment, GEHC service agreements, and GEHC and third party financial services. The Equipment segment primarily focuses on the design, manufacture, sale, and service of proprietary medical devices. This segment provides Biox series Holter monitors and ambulatory blood pressure recorders; ARCS series analysis, reporting, and communication software for physiological signals, such as ECG and blood pressure; MobiCare multi-parameter wireless vital-sign monitoring systems; and Enhanced External Counterpulsaion therapy systems that are used for non-invasive, outpatient treatment of ischemic heart disease, as well as in-service training support. The company was formerly known as Vasomedical, Inc. and changed its name to Vaso Corporation in November 2016. The company was founded in 1987 and is headquartered in Plainview, New York.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Plainview"
    },
    "VEE.DE": {
        "short_name": "VEEVA SYSTEMS A DL-,00001",
        "long_name": "Veeva Systems Inc.",
        "summary": "Veeva Systems Inc. provides cloud-based software for the life sciences industry in North America, Europe, the Asia Pacific, the Middle East, Africa, and Latin America. The company offers Veeva Commercial Cloud, a suite of software, data, and analytics solutions, which include Veeva customer relationship management (CRM) and Veeva Medical CRM, Veeva CLM, Veeva CRM Approved Email, Veeva CRM Engage, Veeva Align, Veeva CRM Events Management, Veeva Nitro, Veeva Andi, Veeva OpenData, Veeva Link, Veeva Network Customer Master, Veeva Crossix, Veeva Data Cloud, and MyVeeva for Doctors; and Veeva Vault, a cloud-based enterprise content and data management applications for managing commercial functions, including sales and marketing, and medical content and communications, as well as research and development functions, such as clinical, regulatory, quality, and safety. It also provides professional and support services in the areas of implementation and deployment planning and project management; requirements analysis, solution design, and configuration; systems environment management and deployment services; services focused on advancing or transforming business and operating processes related to Veeva solutions; technical consulting services related to data migration and systems integrations; training on its solutions; and ongoing managed services that include outsourced systems administration. The company was formerly known as Verticals onDemand, Inc. and changed its name to Veeva Systems Inc. in April 2009. Veeva Systems Inc. was incorporated in 2007 and is headquartered in Pleasanton, California.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Pleasanton"
    },
    "VEE.F": {
        "short_name": "VEEVA SYSTEMS A DL-,00001",
        "long_name": "Veeva Systems Inc.",
        "summary": "Veeva Systems Inc. provides cloud-based software for the life sciences industry in North America, Europe, the Asia Pacific, the Middle East, Africa, and Latin America. The company offers Veeva Commercial Cloud, a suite of software, data, and analytics solutions, which include Veeva customer relationship management (CRM) and Veeva Medical CRM, Veeva CLM, Veeva CRM Approved Email, Veeva CRM Engage, Veeva Align, Veeva CRM Events Management, Veeva Nitro, Veeva Andi, Veeva OpenData, Veeva Link, Veeva Network Customer Master, Veeva Crossix, Veeva Data Cloud, and MyVeeva for Doctors; and Veeva Vault, a cloud-based enterprise content and data management applications for managing commercial functions, including sales and marketing, and medical content and communications, as well as research and development functions, such as clinical, regulatory, quality, and safety. It also provides professional and support services in the areas of implementation and deployment planning and project management; requirements analysis, solution design, and configuration; systems environment management and deployment services; services focused on advancing or transforming business and operating processes related to Veeva solutions; technical consulting services related to data migration and systems integrations; training on its solutions; and ongoing managed services that include outsourced systems administration. The company was formerly known as Verticals onDemand, Inc. and changed its name to Veeva Systems Inc. in April 2009. Veeva Systems Inc. was incorporated in 2007 and is headquartered in Pleasanton, California.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Pleasanton"
    },
    "VEEV.MX": {
        "short_name": "VEEVA SYSTEMS INC",
        "long_name": "Veeva Systems Inc.",
        "summary": "Veeva Systems Inc. provides cloud-based software for the life sciences industry in North America, Europe, the Asia Pacific, the Middle East, Africa, and Latin America. The company offers Veeva Commercial Cloud, a suite of software, data, and analytics solutions, which include Veeva customer relationship management (CRM) and Veeva Medical CRM, Veeva CLM, Veeva CRM Approved Email, Veeva CRM Engage, Veeva Align, Veeva CRM Events Management, Veeva Nitro, Veeva Andi, Veeva OpenData, Veeva Link, Veeva Network Customer Master, Veeva Crossix, Veeva Data Cloud, and MyVeeva for Doctors; and Veeva Vault, a cloud-based enterprise content and data management applications for managing commercial functions, including sales and marketing, and medical content and communications, as well as research and development functions, such as clinical, regulatory, quality, and safety. It also provides professional and support services in the areas of implementation and deployment planning and project management; requirements analysis, solution design, and configuration; systems environment management and deployment services; services focused on advancing or transforming business and operating processes related to Veeva solutions; technical consulting services related to data migration and systems integrations; training on its solutions; and ongoing managed services that include outsourced systems administration. The company was formerly known as Verticals onDemand, Inc. and changed its name to Veeva Systems Inc. in April 2009. Veeva Systems Inc. was incorporated in 2007 and is headquartered in Pleasanton, California.",
        "currency": "MXN",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Pleasanton"
    },
    "VEEV": {
        "short_name": "Veeva Systems Inc.",
        "long_name": "Veeva Systems Inc.",
        "summary": "Veeva Systems Inc. provides cloud-based software for the life sciences industry in North America, Europe, the Asia Pacific, the Middle East, Africa, and Latin America. The company offers Veeva Commercial Cloud, a suite of software, data, and analytics solutions, which include Veeva customer relationship management (CRM) and Veeva Medical CRM, Veeva CLM, Veeva CRM Approved Email, Veeva CRM Engage, Veeva Align, Veeva CRM Events Management, Veeva Nitro, Veeva Andi, Veeva OpenData, Veeva Link, Veeva Network Customer Master, Veeva Crossix, Veeva Data Cloud, and MyVeeva for Doctors; and Veeva Vault, a cloud-based enterprise content and data management applications for managing commercial functions, including sales and marketing, and medical content and communications, as well as research and development functions, such as clinical, regulatory, quality, and safety. It also provides professional and support services in the areas of implementation and deployment planning and project management; requirements analysis, solution design, and configuration; systems environment management and deployment services; services focused on advancing or transforming business and operating processes related to Veeva solutions; technical consulting services related to data migration and systems integrations; training on its solutions; and ongoing managed services that include outsourced systems administration. The company was formerly known as Verticals onDemand, Inc. and changed its name to Veeva Systems Inc. in April 2009. Veeva Systems Inc. was incorporated in 2007 and is headquartered in Pleasanton, California.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Pleasanton"
    },
    "VMCS": {
        "short_name": "VISUALMED CLINICAL SOLUTIONS",
        "long_name": "VisualMED Clinical Solutions Corp.",
        "summary": "VisualMED Clinical Solutions Corp., a medical information company, distributes clinical information systems. The company provides VisualMED system, a suite of software modules that constitute a functional Clinical Information System. VisualMED is an informatics tool that enables the physician to make informed diagnostic and therapeutic decisions at the point of care. It also offers VisualMED modules, including administrative/support module that allows users with the appropriate security rights to access screens that are used to define and modify the basic architectural structure; VisualMED nursing module, which integrates all physician/nursing clinical functions at the order entry and clinical data entry levels; and VisualMED clinical module that correspond to the individual clinical specialty of medicine of the healthcare institution or a particular division or ward of the institution, such as VisualER, VisualSurgeon, VisualPediatrics, and VisualICU. In addition, the company provides electronic medical record modules, which are used by physicians, consultants, nursing staff, and paramedical staff to record patient's admission and progress notes; and VisualONCOLOGY module to oncology departments and cancer clinics. It serves hospitals, healthcare delivery organizations, and regional and national healthcare authorities. The company was formerly known as Ancona Mining Corp. and changed its name to VisualMED Clinical Solutions Corp. in November 2004. VisualMED Clinical Solutions Corp. was founded in 1999 and is based in Reno, Nevada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Reno"
    },
    "VNTH": {
        "short_name": "NANO MOBILE HEALTHCARE INC",
        "long_name": "Nano Mobile Healthcare, Inc.",
        "summary": "Nano Mobile Healthcare, Inc. operates as a mobile health technology company in the United States. The company develops personalized and point-of-care screening using applications based upon chemical sensing methods. It has a strategic partnership with Theranostics Laboratory, a translational research company. The company was formerly known as Vantage mHealthcare, Inc. and changed its name to Nano Mobile Healthcare, Inc. in September 2015. Nano Mobile Healthcare, Inc. was incorporated in 2010 and is based in Boston, Massachusetts. Nano Mobile Healthcare, Inc. is a subsidiary of Nanobeak, LLC.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Boston"
    },
    "VYND": {
        "short_name": "VYNLEADS INC",
        "long_name": "Vynleads, Inc.",
        "summary": "Vynleads, Inc. provides health and wellness information to pre-diabetic individuals or type 2 diabetes sufferers. The company offers Lifestyle Blueprint, a digital guide that provides dietary recommendations for a very low calorie eight-week diet, as well as nutritional information. It also sells nutritional supplements; and monthly subscriptions to proprietary newsletter that covers a range of healthy living-related topics. Vynleads, Inc. was incorporated in 2015 and is headquartered in Rock Hill, South Carolina.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Rock Hill"
    },
    "WMGR": {
        "short_name": "WELLNESS MATRIX GROUP INC",
        "long_name": "Wellness Matrix Group, Inc.",
        "summary": "Wellness Matrix Group, Inc. focuses on developing and designing virtual reality/AR creative artificial intelligence platform through integrating the health and wellness industry networks, and program tools. It intends to offer the doctors and methodologies with genome analysis, monitoring, and predictive modeling simulation providing a state of the art wellness program for quality of life longevity under the Wellness Matrix Group brand. The company was formerly known as Fuhuiyuan International Holdings Limited and changed its name to Wellness Matrix Group, Inc. in June 2018. Wellness Matrix Group, Inc. was incorporated in 2009 and is headquartered in Huntington Beach, California.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Huntington Beach"
    },
    "WORX": {
        "short_name": "SCWorx Corp.",
        "long_name": "SCWorx Corp.",
        "summary": "SCWorx Corp. provides software solutions for the management of health care providers' foundational business applications in the United States. The company provides services related to repair, normalization, and interoperability of information, as well as big data analytics model that provides Web portal for display, and reporting and analysis of the information contained within the data warehouse. It also offers various software solutions and services, such as virtualized item master file repair, expansion, and automation; electronic medical record management, a module that integrates the advanced data attributes created in the item master to the electronic medical records; charge description master management(CDM), a module, which assists healthcare providers by integrating the CDM data into the workflow of the hospitals purchasing systems; contract management, a module that assists healthcare providers to establish a contract management system and to provide care to patients; request for proposal automation solution; rebate management; ScanWorx, a mobile perioperative closed loop scanning solution; and data integration and warehousing, as well as solutions for integration of acquired businesses, which enable deployment of a virtual item master files. The company sells its solutions and services to hospitals and health systems through its distribution and reseller partnerships. In addition, it provides CageTix, a ticketing platform for mixed martial arts industry. Further, the company focuses on selling rapid test kits for COVID-19; and personal protective equipment. SCWorx Corp. is based in New York, New York.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "ZCBD": {
        "short_name": "BODY BASICS INC",
        "long_name": "Body Basics Inc.",
        "summary": "Body Basics Inc. does not have any business operations. The company was formerly known as Platforms Wireless International Corporation and changed its name to Body Basics Inc. in January 2019. The company was incorporated in 1992 and is headquartered in Northridge, California.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Northridge"
    }
}