{
    "ACA.MX": {
        "short_name": "ARCOSA INC",
        "long_name": "Arcosa, Inc.",
        "summary": "Arcosa, Inc., together with its subsidiaries, provides infrastructure-related products and solutions for the construction, energy, and transportation markets in North America. It operates through three segments: Construction Products, Engineered Structures, and Transportation Products. The Construction Products segment offers natural and lightweight aggregates; specialty materials, including lightweight aggregates and plaster; trench shields and shoring products for residential and non-residential construction, agriculture, specialty building products, and underground construction markets, as well as for infrastructure, including road, bridge, and other public products markets. The Engineered Structures segment provides utility structures, wind towers, traffic and lighting structures, telecommunication structures, storage and distribution tanks for electricity transmission and distribution, wind power generation, highway road construction, and wireless communication markets, as well as for gas and liquids storage and transportation for residential, commercial, agriculture, and industrial markets. The Transportation Products segment offers inland barges; fiberglass barge covers, winches, and other components; axles and couplers for railcars and locomotives; industrial and military castings, and forged products for transportation products serving various markets, including agriculture/food, refined, chemicals, upstream oil, and railcar manufacturers and maintenance operations industries. Arcosa, Inc. was incorporated in 2018 and is headquartered in Dallas, Texas.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Heavy Construction",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75201",
        "website": "http://www.arcosa.com",
        "market_cap": "Large Cap"
    }
}