{
    "AZFL": {
        "short_name": "AMAZONAS FLORESTAL LTD",
        "long_name": "Amazonas Florestal, Ltd",
        "summary": "Amazonas Florestal, Ltd operates and manages timber tracts. The company was incorporated in 2008 and is based in Miami, Florida. Amazonas Florestal, Ltd was formerly known as Ecologic Systems, Inc and changed its name to Amazonas Florestal, Ltd in 2012. Amazonas Florestal, Ltd operates as a subsidiary of Peartrack Security Systems, Inc.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Miami",
        "zipcode": "33131",
        "website": "http://www.azflus.com",
        "market_cap": "Small Cap"
    },
    "BC0.F": {
        "short_name": "BOISE CASCADE CO. DL -,01",
        "long_name": "Boise Cascade Company",
        "summary": "Boise Cascade Company manufactures wood products and distributes building materials in the United States and Canada. It operates in two segments, Wood Products and Building Materials Distribution. The Wood Products segment manufactures laminated veneer lumber and laminated beams used in headers and beams; I-joists for residential and commercial flooring and roofing systems, and other structural applications; and structural, appearance, and industrial plywood panels. This segment's products are used in new residential construction, residential repair-and-remodeling markets, light commercial construction, and industrial applications. It sells its products to wholesalers, home improvement centers, retail lumberyards, and industrial converters. The Building Materials Distribution segment distributes a line of building materials, including oriented strand boards, plywood, and lumber; general line items, such as siding, composite decking, doors, metal products, insulation, and roofing; and engineered wood products. This segment sells its products to retail lumberyards, home improvement centers, and specialty distributors. The company was founded in 2004 and is headquartered in Boise, Idaho.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "ID",
        "city": "Boise",
        "zipcode": "83702-5389",
        "website": "http://www.bc.com",
        "market_cap": "Mid Cap"
    },
    "BCC": {
        "short_name": "Boise Cascade, L.L.C.",
        "long_name": "Boise Cascade Company",
        "summary": "Boise Cascade Company manufactures wood products and distributes building materials in the United States and Canada. It operates in two segments, Wood Products and Building Materials Distribution. The Wood Products segment manufactures laminated veneer lumber and laminated beams used in headers and beams; I-joists for residential and commercial flooring and roofing systems, and other structural applications; and structural, appearance, and industrial plywood panels. This segment's products are used in new residential construction, residential repair-and-remodeling markets, light commercial construction, and industrial applications. It sells its products to wholesalers, home improvement centers, retail lumberyards, and industrial converters. The Building Materials Distribution segment distributes a line of building materials, including oriented strand boards, plywood, and lumber; general line items, such as siding, composite decking, doors, metal products, insulation, and roofing; and engineered wood products. This segment sells its products to retail lumberyards, home improvement centers, and specialty distributors. The company was founded in 2004 and is headquartered in Boise, Idaho.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "ID",
        "city": "Boise",
        "zipcode": "83702-5389",
        "website": "http://www.bc.com",
        "market_cap": "Mid Cap"
    },
    "BMSPF": {
        "short_name": "BIOMASS SECURE POWER INC",
        "long_name": "Biomass Secure Power Inc.",
        "summary": "Biomass Secure Power Inc. engages in the production and supply of torrefied biomass briquettes from forest residuals and waste for use as a substitute for coal in Canada. The company is headquartered in Natchitoches, Louisiana.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "LA",
        "city": "Natchitoches",
        "zipcode": "71411",
        "website": "http://www.biomasssecurepower.ca",
        "market_cap": "Small Cap"
    },
    "EVA": {
        "short_name": "Enviva Partners, LP",
        "long_name": "Enviva Partners, LP",
        "summary": "Enviva Partners, LP produces and sells utility-grade wood pellets. The company's products are used as a substitute for coal in power generation, and combined heat and power plants. It serves power generators in the United Kingdom, Europe, and Japan. Enviva Partners GP, LLC operates as the general partner of the company. Enviva Partners, LP was founded in 2013 and is headquartered in Bethesda, Maryland.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MD",
        "city": "Bethesda",
        "zipcode": "20814",
        "website": "http://www.envivabiomass.com",
        "market_cap": "Small Cap"
    },
    "EXRG": {
        "short_name": "ECOLOGIX RESOURCES GROUP INC",
        "long_name": "EcoLogix Resource Group, Inc.",
        "summary": "Ecologix Resource Group, Inc., a natural resource company, focuses on harvesting and marketing timber. The company engages in harvesting various species of hardwood. It also involves in the production of alternative energy solutions, such as ethanol and biodiesel. The company was formerly known as Battery Control Corp. and changed its name to Ecologix Resource Group, Inc. on July 14, 2009. Ecologix Resource Group, Inc. was founded in 2007 and is based in Beverly Hills, California.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Beverly Hills",
        "zipcode": "90212",
        "website": null,
        "market_cap": "Small Cap"
    },
    "HMTC": {
        "short_name": "HOMASOTE CO",
        "long_name": "Homasote Company",
        "summary": "Homasote Company manufactures and sells building and industrial products for the construction and manufacturing industries in the United States. The company operates in two divisions, Millboard and Industrial. The Millboard division provides wall and floor sound insulation products, roof and floor deckings, concrete expansion joints and forming boards, and finished interior panels. The Industrial division offers various shapes and coated strips for product separation and breakage reduction that protects customer's products during interplant transport primarily for use in glass, paper, and metal industries, as well as provides packaging products to end-users, appliance manufacturers, and office furniture makers. The company's products are applied in various applications that include sound control, basement and concrete slab conversions, cathedral ceilings, fire-rated products, concrete forming, decorative/tackable panels, floors, floor and surface protection products, hobbies, house and workshops, ice rink conversions, roofs and ceilings, shock absorptions, and thermal insulations, as well as construction and renovation of multi-family dwellings, commercial office buildings, educational facilities, single-family dwellings, and retail establishments. It serves building material wholesalers and contractors, and industrial manufacturers. The company also exports its products to Canada and internationally. Homasote Company was founded in 1909 and is based in West Trenton, New Jersey.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "West Trenton",
        "zipcode": "08628-0240",
        "website": "http://www.homasote.com",
        "market_cap": "Small Cap"
    },
    "JCTCF": {
        "short_name": "Jewett-Cameron Trading Company",
        "long_name": "Jewett-Cameron Trading Company Ltd.",
        "summary": "Jewett-Cameron Trading Company Ltd., through its subsidiaries, manufactures and distributes specialty metal products and distributes wood products to home centers and other retailers primarily in the United States. The company operates through three segments: Industrial Wood Products; Lawn, Garden, Pet and Other; and Seed Processing and Sales. The Industrial Wood Products segment processes and distributes industrial wood products. It offers treated plywood to the transportation industry. The Lawn, Garden, Pet and Other segment is involved in the wholesale of wood products, such as fencing and landscape timbers; and manufacture and distribution of specialty metal products comprising dog kennels, proprietary gate support systems, perimeter fencings, and greenhouses. The Seed Processing and Sales segment processes and distributes agricultural seeds to distributors, as well as cleaning seeds. The company was founded in 1953 and is based in North Plains, Oregon.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "OR",
        "city": "North Plains",
        "zipcode": "97133",
        "website": "http://www.jewettcameron.com",
        "market_cap": "Small Cap"
    },
    "KEWL": {
        "short_name": "KEWEENAW LAND ASSOCIATIN",
        "long_name": "Keweenaw Land Association, Limited",
        "summary": "Keweenaw Land Association, Limited operates as a land and timber management company in the United States. It provides pulpwood, pallet sawbolts, sawtimber, and veneer for consuming mills. The company also sells real estate properties, and sand and gravel; and offers recreational and mineral rights leasing services, as well as wood scaling and inventory management services for various customers. As of December 31, 2020, it had 182,399 acres of surface land and 401,532 acres of subsurface mineral rights located in the western Upper Peninsula of Michigan and northern Wisconsin. The company was founded in 1865 and is headquartered in Ironwood, Michigan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MI",
        "city": "Ironwood",
        "zipcode": "49938",
        "website": "http://www.keweenaw.com",
        "market_cap": "Small Cap"
    },
    "SGTM": {
        "short_name": "SUSTAINABLE GREEN TEAM LTD",
        "long_name": "Sustainable Green Team, Ltd.",
        "summary": "Sustainable Green Team, Ltd., through its subsidiaries, provides storm/disaster recovery services. It offers tree, debris hauling and removal, and biomass recycling services. The company also manufactures, packages, and sells mulch to landscapers, installers, and garden centers. It serves governmental, residential, and commercial customers. The company was formerly known as National Storm Recovery Inc. and changed its name to Sustainable Green Team, Ltd. in July 2020. Sustainable Green Team, Ltd. is based in Apopka, Florida.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Apopka",
        "zipcode": "32703",
        "website": "http://www.thesustainablegreenteam.com",
        "market_cap": "Small Cap"
    },
    "TCOR": {
        "short_name": "TREECON RESOURCES INC",
        "long_name": "TreeCon Resources, Inc.",
        "summary": "TreeCon Resources, Inc., through its subsidiaries, distributes, leases, and finances industrial and logging equipment in the United States. It is also involved in sawmill operations; and producing water-based fluids for the oil and gas industry. The company was formerly known as Overhill Corporation. TreeCon Resources, Inc. was incorporated in 1963 and is based in Lufkin, Texas.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Lufkin",
        "zipcode": "75901",
        "website": "http://treeconresources.com",
        "market_cap": "Small Cap"
    },
    "UFPI": {
        "short_name": "UFP Industries, Inc.",
        "long_name": "UFP Industries, Inc.",
        "summary": "UFP Industries, Inc., through its subsidiaries, designs, manufactures, and markets wood and wood-alternative products in North America, Europe, Asia, and Australia. The company offers preserved and unpreserved dimensional lumber; outdoor living products, including wood and wood composite decking and related accessories, and decorative lawn and garden products; and engineered wood components, which include roof and floor trusses, wall panels, engineered floor systems, I-joists, and lumber packages. It also provides pallets, specialty crates, wooden boxes, and other containers and products that are used for packaging, shipping, and material handling applications; designs, manufactures, and installs interior fixtures that are used in retail and commercial structures; and provides lumber cut and shaped, plywood, oriented strand board, and dimensional lumber products for use in the construction of manufactured housings. In addition, the company supplies siding, electrical, and plumbing products to manufactured housing and recreational vehicle customers; and wood forms and related products to set or form concrete for various structures, such as parking garages, stadiums, and bridges. Further, it provides framing services; and specialty wood packaging, components, and packing materials for various industries. The company primarily sells its products under the roWood, Deckorators, UFP-Edge, Outdoor Essentials, Dimensions, and ProWood FR trademarks.  The company was formerly known as Universal Forest Products, Inc. and changed its name to UFP Industries, Inc. in April 2020. UFP Industries, Inc. was founded in 1955 and is headquartered in Grand Rapids, Michigan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "MI",
        "city": "Grand Rapids",
        "zipcode": "49525",
        "website": "http://www.ufpi.com",
        "market_cap": "Mid Cap"
    }
}