{
    "PUMD": {
        "short_name": "PROUROCARE MEDICAL INC",
        "long_name": "ProUroCare Medical Inc.",
        "summary": "ProUroCare Medical Inc. engages in developing products for the detection and characterization of male urological prostate disease. It offers the ProUroScan System, a prostate imaging system that aids the physician in documenting abnormalities in the prostate that have been previously detected by a digital rectal exam. The company has licensing, development, and commercialization agreements with Artann Laboratories Inc. for its ProUroScan System. ProUroCare Medical Inc. was founded in 1999 and is based in Eden Prairie, Minnesota.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Appliances & Equipment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MN",
        "city": "Eden Prairie",
        "zipcode": "55416",
        "website": "http://www.prourocare.com",
        "full_time_employees": 2
    },
    "SCIE": {
        "short_name": "SPECTRASCIENCE INC",
        "long_name": "SpectraScience, Inc.",
        "summary": "SpectraScience, Inc. develops and markets a technology platform to instantly determine whether a tissue is normal, pre-cancerous, or cancerous without the need for a physical biopsy in the United States, Europe, and internationally. It offers WavSTAT3 optical biopsy system to determine whether a colon tissue is normal, pre-cancerous, or cancerous without physically removing tissue from the body; and WavSTAT4 optical biopsy system, a colon diagnostic product that operates by using UV laser light to optically illuminate and analyze tissue, enabling the physician to make an instant diagnosis during endoscopy when screening for cancer. The company also sells mobile consoles and disposable forceps. In addition, it engages in developing an esophageal diagnosis application for the detection of pre-cancerous and cancerous tissues in various tissues of the body. The company was formerly known as GV Medical, Inc. and changed its name to SpectraScience, Inc. in October 1992. SpectraScience, Inc. was founded in 1983 and is based in San Diego, California.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Appliances & Equipment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Diego",
        "zipcode": "92121",
        "website": "http://www.spectrascience.com",
        "full_time_employees": 5
    },
    "SGLN": {
        "short_name": "SURGLINE INTL INC",
        "long_name": "SurgLine International, Inc.",
        "summary": "Surgline International, Inc. sources and sells medical and surgical products. It offers a range of surgical instruments, including scissors, forceps, basket punches, reamers, and pulse lavages. The company also provides surgical sets, such as hand and foot, and hips and small fragments; spine products consisting of ALIF systems, anterior cervical plates, PLIF systems, TLIF systems, cervical PEEK IBFDs, and pedicle screw systems; drill system and power tools comprising cordless and pneumatic drills, chucks, sleeves, saws, hoes, charges, and batteries. In addition, it offers emergency removal devices for broken screws and implant removal; a range of endoscopes; surgical burs and blades; and medical, surgical, and dental disposables. The company sells its products under the Surg brand. It serves acute care hospitals, ambulatory surgery centers, physicians, dentists, urgent care centers, and insurers, as well as others. The company was formerly known as China Nuvo Solar Energy, Inc. and changed its name to Surgline International, Inc. in October 2011. Surgline International, Inc. is based in Newport Beach, California.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Appliances & Equipment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "West Palm Beach",
        "zipcode": "33401",
        "website": null,
        "full_time_employees": null
    },
    "TSNI": {
        "short_name": "TECHNISCAN INC",
        "long_name": "TechniScan, Inc.",
        "summary": "TechniScan, Inc., a development stage company, engages in the research, development, and commercialization of non-invasive medical imaging products for the detection and diagnosis of breast cancer. It intends to develop the Warm Bath Ultrasound system, an ultrasound-based imaging device that provides radiologists with information about the bulk properties of tissue in the breast, as well as images of the tissue structure. The company is based in Salt Lake City, Utah.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Appliances & Equipment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "UT",
        "city": "Salt Lake City",
        "zipcode": "84106",
        "website": null,
        "full_time_employees": 5
    },
    "VNM.DE": {
        "short_name": "VARIAN MEDICAL SYS  DL 1",
        "long_name": "Varian Medical Systems, Inc.",
        "summary": "Varian Medical Systems, Inc. designs, manufactures, sells, and services medical devices and software products for treating cancer and other medical conditions worldwide. It operates through Oncology Systems and Proton Solutions segments. The Oncology Systems segment offers hardware and software products for treating cancer with radiotherapy, fixed field intensity-modulated radiation therapy, image-guided radiation therapy, volumetric modulated arc therapy, stereotactic radiosurgery, stereotactic body radiotherapy, artificial intelligence based adaptive radiotherapy, and brachytherapy, as well as quality assurance equipment. Its products include linear accelerators, brachytherapy afterloaders, treatment accessories, and quality assurance software; and information management, treatment planning, image processing, clinical knowledge exchange, patient care management, decision-making support, and practice management software. This segment serves university research and community hospitals, private and governmental institutions, healthcare agencies, physicians' offices, medical oncology practices, radiotherapy centers, and cancer care clinics. The company has a strategic agreement with McKesson Corp. to supply treatment delivery systems and planning, services, and radiotherapy information system solutions to its U.S. Oncology Network and Vantage Oncology affiliated sites of care; strategic partnership with Siemens AG to represent Siemens diagnostic imaging products to radiation oncology clinics in the United States and other select markets; and collaboration with Google Cloud. Varian Medical Systems, Inc. was formerly known as Varian Associates, Inc. and changed its name to Varian Medical Systems, Inc. in April 1999. The company was founded in 1948 and is headquartered in Palo Alto, California. As of April 15, 2021, Varian Medical Systems, Inc. operates as a subsidiary of Siemens Healthineers AG.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Appliances & Equipment",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "CA",
        "city": "Palo Alto",
        "zipcode": "94304-1038",
        "website": "http://www.varian.com",
        "full_time_employees": 10000
    }
}