{
    "NVIC": {
        "short_name": "N-VIRO INTERNATIONAL CORP",
        "long_name": "N-Viro International Corporation",
        "summary": "N-Viro International Corporation markets its N-Viro Fuel technology that produces a renewable alternative fuel product out of certain bio-organic wastes. N-Viro Fuel is a patented biomass alternative energy fuel process that produces a product that has physical and chemical characteristics similar to certain coals and is created from municipal biosolids, collectable animal manure, pulp and paper sludge, and other organic wastes. The company owns and licenses the N-Viro Process, a patented technology to treat and recycle wastewater sludges and other bio-organic wastes, utilizing certain alkaline by-products produced by the cement, lime, and other industries, as well as electric utilities. Its N-Viro Process stabilizes and pasteurizes sludge; reduces odors to acceptable levels; neutralizes or immobilizes various constituents; and generates N-Viro Soil, a product that has a granular appearance similar to soil and is used in various agricultural applications. In addition, the company is involved in the distribution and resale of alkaline admixtures. N-Viro International Corporation was founded in 1979 and is based in Toledo, Ohio.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Toledo"
    },
    "OWUV": {
        "short_name": "ONE WORLD UNIVERSE INC",
        "long_name": "One World Universe Inc.",
        "summary": "One World Universe Inc. engages in the manufacture, sale, and rental of water purification equipment utilizing reverse osmosis filtration processes and water vending equipment. Its products are used in various water treatment applications for commercial, residential, industrial, and institutional purposes. The company was formerly known as Ultra Pure Water Technologies, Inc. and changed its name to One World Universe Inc. in October 2020. One World Universe Inc. was incorporated in 1989 and is based in Lafayette, Louisiana.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Lafayette"
    },
    "OXQ1.F": {
        "short_name": "ADVANCED EMISS. SOL.",
        "long_name": "Advanced Emissions Solutions, Inc.",
        "summary": "Advanced Emissions Solutions, Inc., together with its subsidiaries, provides emission reduction technologies and specialty chemicals in the United States. It operates through two segments, Refined Coal; and Power Generation and Industrials. The company offers CyClean technology, a pre-combustion coal treatment process to enhance combustion, as well as to reduce emissions of nitrogen oxide and mercury from coals burned in cyclone boilers; and M-45 and M-45-PC technologies, which are pre-combustion coal treatment technologies used to control emissions from circulating fluidized bed boilers and pulverized coal boilers. It also provides powdered activated carbon, granular activated carbon, coal additives, and scrubber additives, as well as owns an associated lignite mine that supplies the raw material for the powdered activated carbon plant. The company serves customers in the coal-fired power generation and industrial boiler processes, as well as drinking water and wastewater treatment markets. Advanced Emissions Solutions, Inc. was founded in 1996 and is headquartered in Greenwood Village, Colorado.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Greenwood Village"
    },
    "PCTL": {
        "short_name": "PCT LTD",
        "long_name": "PCT Ltd",
        "summary": "PCT Ltd, through its subsidiary, Paradigm Convergence Technologies Corporation, designs, develops manufactures, and licenses environmentally safe solutions worldwide. The company offers Hydrolyte, a sanitizer/disinfectant microbiocide for use in institutional facilities, including hospitals, nursing homes, hotels, correctional facilities, and schools; agriculture industry for pre- and post-harvest disinfection of crops, sanitization in food processing, and applications in animal husbandry; oil and gas industry to disinfect water and to kill sulfate reducing bacteria in oil and gas wells; and disinfecting and sanitizing water in public and private water systems and industrial waste-water systems. It also provides Catholyte, a mild detergent, degreaser, and surfactant that is used for janitorial cleaning purposes. The company was formerly known as Bingham Canyon Corporation and changed its name to PCT LTD in February 2018. PCT Ltd was founded in 1986 and is based in Little River, South Carolina.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Little River"
    },
    "PGTK": {
        "short_name": "PACIFIC GREEN TECHNOLOGIES INC",
        "long_name": "Pacific Green Technologies Inc.",
        "summary": "Pacific Green Technologies Inc. acquires, develops, and markets emission control technologies in North America, Europe, and Asia. The company offers ENVI-Clean, a system that removes sulphur dioxides, particulate matters, greenhouse gases, and other hazardous air pollutants; and ENVI-Pure, which removes acid gases, particulate matter, dioxins, VOCs, and other regulated hazardous air pollutants from the flue gases produced by the combustion of coal, biomass, municipal solid waste, diesel, and other fuels. It also provides ENVI-Marine, a scrubber for application in diesel exhaust emissions. The company was founded incorporated in 1994 and is based in Dover, Delaware.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Dover"
    },
    "PURA": {
        "short_name": "PURATION INC",
        "long_name": "Puration, Inc.",
        "summary": "Puration, Inc. engages in the design, development, production, marketing, and distribution of personal or individual water purification products. The company's personal water filtration systems include personal water filter bottles, sports bottles, collapsible water pouches, portable purification devices, portable biological filtration devices, replacement filters, and travel filters. Its products also include water filter pitchers, canteens, shower head filters, water filter pumps, and air-to-water machines. Puration, Inc. sells its products under the Filter 2GO brand. The company has a partnership with Alkame Holdings Inc. to produce and test market a CBD infused liquid sugar, a CBD infused pet food supplement and a CBD sexual wellness flavored lubricant. Puration, Inc. was founded in 2011 and is based in Farmers Branch, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Farmers Branch"
    },
    "SINX": {
        "short_name": "SIONIX CORP",
        "long_name": "Sionix Corp.",
        "summary": "Sionix Corp. designs, constructs, and operates mobile water treatment systems based on its proprietary dissolved air flotation (DAF) technology. Its systems are used in energy applications; government facilities; healthcare facilities; emergency water supplies during natural disasters; housing development projects; and various industrial processes, including subterranean fracturing used in oil and gas drilling, as well as for pre-treatment of desalination and other membrane filtration applications. The company's system is also used to remove organic and inorganic compounds, including hydrocarbons, insoluble metals, infectious bacteria from contaminated water, algae, color, and more, as well as serves dairy, agribusiness, meat processing, mining, poultry operations, and other industries that uses water in the manufacture of their products or delivery of their services. Sionix Corp. was founded in 1985 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "SYEV": {
        "short_name": "SEYCHELLE ENVIRONMENTAL TECHNOL",
        "long_name": "Seychelle Environmental Technologies, Inc.",
        "summary": "Seychelle Environmental Technologies, Inc. designs, assembles, and distributes absorption micron filters for portable filter devices worldwide. Its products include flip-top and pull top bottles, canteens, water pitchers, pure water pumps, stainless steel bottles, in-line filters, pure water bags, pure water pouches, and pure water straws, as well as Pump N' Pure. The company sells its products to individuals, dealers, distributors, multilevel marketing companies and missionaries, non-governmental organizations, and emergency relief organizations. It also sells its products as a private label supplier. The company was formerly known as Royal Net, Inc. and changed its name to Seychelle Environmental Technologies, Inc. in January 1998. Seychelle Environmental Technologies, Inc. was incorporated in 1986 and is based in Aliso Viejo, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Aliso Viejo"
    },
    "TEGY": {
        "short_name": "TRANSACT ENERGY CORPORATION",
        "long_name": "TransAct Energy Corp.",
        "summary": "TransAct Energy Corp., a development stage company, develops and manages zero emission waste optimization plants worldwide. Its principal products include carbon black, phenol resins, and levoglucosan. The company also produces fertilizers for the agricultural industry; a brick mix for the construction industry; reclaimed metals and purified water; and acetic acid and furfural for industrial chemical manufacturers. Its target service customers include corporations or municipalities; manufacturers of fuels for airlines, shipping companies, bus companies, trucking companies, or fuel retailers; friction and wood product manufacturers; manufacturers of biodegradable plastics and pharmaceuticals; and tire and rubber manufacturers, lithographers, and printers. The company was founded in 2006 and is headquartered in Bellingham, Washington.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Bellingham"
    },
    "TNKE": {
        "short_name": "TANKE INCORPORATED",
        "long_name": "Tanke, Inc.",
        "summary": "Tanke, Inc., through its subsidiaries, develops and markets environmental and water technologies. The company offers Tripple R Water Recycling for the reclamation, treatment, and recycling of wastewater or storm water collected from homes, commercial buildings and industrial facilities; and Tripple R Water Recycling, a water recycling system for hotels, dry kitchens, and buildings. It also provides uSMART, a Software-as-a-Service enterprise resource planning proprietary software technology. Tanke, Inc. was formerly known as LP Holdings Inc. and changed its name to Tanke, Inc. in 2007. The company was incorporated in 1984 and is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Las Vegas"
    },
    "TOMZ": {
        "short_name": "TOMI Environmental Solutions, I",
        "long_name": "TOMI Environmental Solutions, Inc.",
        "summary": "TOMI Environmental Solutions, Inc. provides disinfection and decontamination products and services for indoor and outdoor surface, and air decontamination in the United States and internationally. The company's products and services include SteraMist Surface Unit, a point and spray disinfection/decontamination system; SteraMist Environment System, a system that provides room disinfection/decontamination of a sealed space up to 103.8 m3; and The SteraMist Hospital Disinfection Cart, a solution to aid its hospital-healthcare customers in providing the quality of care and safety to their patients by disinfecting patient and operating rooms, pharmacies, ambulances, and emergency environments in a hospital or healthcare facility. Its products and services also comprise SteraMist Select Surface Unit; Stainless Steel 90-Degree Applicator; SteraMist Permanent iHP Complete Disinfection Room, an automated system that is plumbed utilizing the facilities' existing HVAC system; and iHP Plasma Decontamination Chamber. In addition, the company offers full room, equipment, facility, and emergency disinfection/decontamination services. It manufactures, sells, services, and licenses SteraMist Binary Ionization Technology, a hydrogen peroxide-based mist and fog. The company's products and services are used in pharmaceutical companies, clean rooms, hospitals and medical facilities, ambulances, bio-safety labs, tissue labs, vivariums, research universities, military and government agencies, office buildings, schools, athletic facilities, single-family homes and multi-unit residences, cruise ships, schools, and entertainment establishments; patient medical transport airline, hospitality, transportation industries; and cannabis market. TOMI Environmental Solutions, Inc. was incorporated in 1979 and is headquartered in Beverly Hills, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "Beverly Hills"
    },
    "UVFT": {
        "short_name": "UV FLU TECHNOLOGIES INC",
        "long_name": "UV Flu Technologies, Inc.",
        "summary": "UV Flu Technologies, Inc. engages in the research, development, manufacture, and sale of air purification systems and products primarily in the United States. Its flagship product is the ViraTech UV-400, which utilizes high-intensity germicidal ultraviolet radiation inside a killing chamber that goes beyond filtering to trap and destroy harmful microbes. The company also offers RX Air product line, which include HEPA based air purifiers. Its products are used in hotels, hair and nail salons, pet kennels, test labs, hospitals, restaurants, casinos, and military installations. The company was formerly known as Northwest Chariots Incorporated and changed its name to UV Flu Technologies, Inc. in November 2009. UV Flu Technologies, Inc. was founded in 2006 and is based in Lincolnshire, Illinois.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Lincolnshire"
    },
    "WCE.F": {
        "short_name": "CECO ENVIRONMTL  DL-,01",
        "long_name": "CECO Environmental Corp.",
        "summary": "CECO Environmental Corp. provides industrial air quality and fluid handling systems for the energy, industrial, and other markets worldwide. The company operates through three segments: Energy Solutions, Industrial Solutions, and Fluid Handling Solutions. The company engineers, designs, builds, and installs systems that capture, clean, and destroy airborne contaminants from industrial facilities, as well as equipment that control emissions from such facilities; and fluid handling and filtration systems. Its products and services include dampers and diverters, selective catalytic reduction and selective non-catalytic reduction systems, cyclonic technology, thermal oxidizers, filtration systems, scrubbers, and fluid handling equipment, as well as plant engineering services and engineered design build fabrication. The company markets its products and services to natural gas processors, transmission and distribution companies, refineries, power generators, boiler manufacturers, compressor manufacturers, metals and minerals, industrial manufacturing, and engineering and construction companies. CECO Environmental Corp. was founded in 1966 and is headquartered in Dallas, Texas.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Dallas"
    },
    "WTII": {
        "short_name": "WATER TECHNOLOGIES INTERNATIONA",
        "long_name": "Water Technologies International, Inc.",
        "summary": "Water Technologies International, Inc. engages in designing, manufacturing, and distributing atmospheric water generators and related products (AWG) in the United States. Its AWGs produce drinking water from humidity in the atmosphere, as well as provide air conditioning during the use. The company also provides packaged wastewater plants for the wastewater treatment. In addition, it provides filtration devices for AWGs. Further, the company produces and sells CBD and non-THC products, including CBD, hemp derived cannabidiol specialty water. It serves restaurants, hospitals, schools, hotels/motels, restaurants, large institutions, and military/emergency and disaster deployments. The company is based in Port St. Lucie, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Port St. Lucie"
    },
    "WTNW": {
        "short_name": "WATER NOW INC",
        "long_name": "Water Now, Inc.",
        "summary": "Water Now, Inc. develops and commercializes gas/diesel or electric powered portable devices for processing and purifying contaminated water. Its products include The Aqua 125 model for purifying fresh water that is contaminated primarily with partially dissolved solid materials, microorganisms, and other pathogens; The Aqua 1000 model to desalinate salt water with a capacity of up to 800 gallons per day; and an upgraded Aqua 1000 unit that is complemented with a reservoir mounted on a trailer with a capacity of purifying up to 800 gallons of water per day. The company also engages in the installation and operation of oil recovery systems. The company offers its products for disaster relief, military, and agricultural applications. Water Now, Inc. was founded in 2016 and is based in Fort Worth, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Fort Worth"
    }
}