{
    "1KB.F": {
        "short_name": "AH BELO CORP. A  DL-,01",
        "long_name": "A.H. Belo Corporation",
        "summary": "A.H. Belo Corporation, together with its subsidiaries, operates as a local news and information publishing company in Texas. The company publishes The Dallas Morning News, a newspaper; Briefing, a newspaper; and Al Dia, a Spanish-language newspaper, as well as operates related websites and mobile applications. It also offers commercial printing, distribution, direct mail, and shared mail packaging services; and auto dealerships advertising services on the cars.com platform. In addition, the company provides digital marketing services, such as multi-channel marketing solutions through subscription sales of its cloud-based software; digital and marketing analytics, search engine marketing, and other marketing related services; social media account management and content marketing services; and multi- channel digital advertising and marketing services campaigns, as well as marketing and promotional products for businesses. A.H. Belo Corporation was founded in 1842 and is headquartered in Dallas, Texas.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75222-4866",
        "website": "http://www.ahbelo.com",
        "market_cap": "Small Cap"
    },
    "2N2A.F": {
        "short_name": "GANNETT CO.INC  DL-,01",
        "long_name": "Gannett Co., Inc.",
        "summary": "Gannett Co., Inc. operates as a media and marketing solutions company in the United States. It operates through two segments, Publishing and Digital Marketing Solutions. The company's principal products include 253 daily newspapers with total paid circulation of approximately 2.6 million and Sunday circulation of 3.0 million; 308 weekly newspapers with total circulation of approximately 1.6 million; and 375 locally-focused Websites. Its principal products also comprise 121 daily and weekly news media brands and approximately 100 magazines, and related digital platforms; USATODAY.com and mobile applications, and sports network, as well as Reviewed.com, an affiliate marketing service; and USA TODAY NETWORK, a community events platform. The company also offers digital marketing solutions, such as online presence solutions, online advertising products, conversion software, and cloud-based software solutions. In addition, it produces niche publications that address specific local market interests, such as recreation, sports, healthcare, and real estate. Further, the company offers local market news and information, as well as advertising and subscriptions, and commercial printing and distribution services; and prints commercial materials, including flyers, business cards, and invitations. Additionally, it produces approximately 250 events with a collective attendance approximately 700,000. The company was formerly known as New Media Investment Group Inc. and changed its name to Gannett Co., Inc. in November 2019. Gannett Co., Inc. was founded in 1997 and is headquartered in McLean, Virginia.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "VA",
        "city": "McLean",
        "zipcode": "22107-0910",
        "website": "http://www.gannett.com",
        "market_cap": "Small Cap"
    },
    "6T71.F": {
        "short_name": "TRIBUNE PUBLISHING DL-,01",
        "long_name": "Tribune Publishing Company",
        "summary": "Tribune Publishing Company, a media company, publishes newspapers worldwide. It publishes daily newspapers, weekly newspapers, and niche publications and direct mail. The company also provides various digital marketing services, which include the development of mobile websites, search engine marketing and optimization, social media account management, and content marketing for its customers' web presence for small to medium size businesses. In addition, it operates Tribune Content Agency, a syndication and licensing business that provides content solutions for publishers. Tribune Publishing Company operates media businesses in eight markets with titles, including the Chicago Tribune, New York Daily News, The Baltimore Sun, Hartford Courant, South Florida's Sun Sentinel, Orlando Sentinel, Virginia's Daily Press and The Virginian-Pilot, and The Morning Call of Lehigh Valley, Pennsylvania. The company engages in business of testing, researching, and reviewing consumer products. The company was formerly known as tronc, Inc. and changed its name to Tribune Publishing Company in October 2018. Tribune Publishing Company was founded in 2013 and is headquartered in Chicago, Illinois.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "IL",
        "city": "Chicago",
        "zipcode": "60654",
        "website": "http://www.tribpub.com",
        "market_cap": "Small Cap"
    },
    "ACNI": {
        "short_name": "AMERICAN COMMUNITY NEWSPAPERS I",
        "long_name": "American Community Newspapers Inc.",
        "summary": "American Community Newspapers Inc. publishes community newspapers. The company was formerly known as Lionheart Newspapers, LLC and changed its name to American Community Newspapers Inc. in November 2002. The company was founded in 1998 and is based in Addison, Texas.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Addison",
        "zipcode": "75254",
        "website": null,
        "market_cap": "Small Cap"
    },
    "AHC": {
        "short_name": "A.H. Belo Corporation (TX)",
        "long_name": "A.H. Belo Corporation",
        "summary": "A.H. Belo Corporation, together with its subsidiaries, operates as a local news and information publishing company in Texas. The company publishes The Dallas Morning News, a newspaper; Briefing, a newspaper; and Al Dia, a Spanish-language newspaper, as well as operates related websites and mobile applications. It also offers commercial printing, distribution, direct mail, and shared mail packaging services; and auto dealerships advertising services on the cars.com platform. In addition, the company provides digital marketing services, such as multi-channel marketing solutions through subscription sales of its cloud-based software; digital and marketing analytics, search engine marketing, and other marketing related services; social media account management and content marketing services; and multi- channel digital advertising and marketing services campaigns, as well as marketing and promotional products for businesses. A.H. Belo Corporation was founded in 1842 and is headquartered in Dallas, Texas.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75222-4866",
        "website": "http://www.ahbelo.com",
        "market_cap": "Small Cap"
    },
    "CMTX": {
        "short_name": "COMTEX NEWS NETWORKS INC",
        "long_name": "COMTEX News Network, Inc.",
        "summary": "Comtex News Network, Inc. provides electronic real-time news, and content and proprietary market products in the United States. The company receives, enhances, combines, and filters news and content received from national and international news bureaus, agencies, and publications. Its products comprise CustomWires, the real-time and subject-specific newswires, such as finance, business, foreign exchange, and public companies, as well as real-time trading data in the global stock markets, commodities and futures prices, SEC filing information, personal investment news, economic indicator data, international trade policies, business news, IRS bulletins, and actions from the global financial institutions; and Comtex Top News that include editorial news summaries in 29 categories. The company also provides feed products and custom solutions; and SmarTrend products for managing investments. Comtex News Network, Inc. is based in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10017",
        "website": "http://www.comtex.com",
        "market_cap": "Small Cap"
    },
    "DJCO": {
        "short_name": "Daily Journal Corp. (S.C.)",
        "long_name": "Daily Journal Corporation",
        "summary": "Daily Journal Corporation publishes newspapers and websites covering in California, Arizona, and Utah. It operates in two segments, Traditional Business and Journal Technologies. The company publishes 10 newspapers of general circulation, including Los Angeles Daily Journal, San Francisco Daily Journal, Daily Commerce, The Daily Recorder, The Inter-City Express, San Jose Post-Record, Orange County Reporter, The Daily Transcript, Business Journal, and The Record Reporter. It also provides specialized information services; and serves as an advertising and newspaper representative for commercial and public notice advertising. In addition, the company offers case management software systems and related products, including eCourt, eProsecutor, eDefender, and eProbation, which are browser-based case processing systems; eFile, a browser-based interface that allows attorneys and the general public to electronically file documents with the court; and ePayIt, a service primarily for the online payment of traffic citations. It provides its software systems and related products for courts; prosecutor and public defender offices; probation departments; and other justice agencies, including administrative law organizations, city and county governments, and bar associations to manage cases and information electronically, to interface with other justice partners, and to extend electronic services to bar members and the public in 42 states and internationally. Daily Journal Corporation was incorporated in 1987 and is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Angeles",
        "zipcode": "90012",
        "website": "http://www.dailyjournal.com",
        "market_cap": "Small Cap"
    },
    "DTRL": {
        "short_name": "DETROIT LEGAL NEWS CO",
        "long_name": "The Detroit Legal News Company",
        "summary": "The Detroit Legal News Company provides sheet fed commercial printing services to customers located in southeastern Michigan. The company, through its subsidiary, Detroit Legal News Publishing, LLC, publishes legal newspapers principally for subscribers in southern Michigan. The Detroit Legal News Company was incorporated in 1898 and is based in Detroit, Michigan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MI",
        "city": "Detroit",
        "zipcode": "48216",
        "website": null,
        "market_cap": "Small Cap"
    },
    "EDUC": {
        "short_name": "Educational Development Corpora",
        "long_name": "Educational Development Corporation",
        "summary": "Educational Development Corporation, a publishing company, operates as a trade co-publisher of the line of educational children's books in the United States. The company offers various books, including Touchy-Feely board books, activity and flashcards, adventure and search books, art books, sticker books, and foreign language books, as well as science and math titles, and chapter books and novels. It operates through two divisions, Home Business and Publishing. The Home Business division distributes books through a network of independent consultants using a combination of direct sales, home parties, book fairs, and Internet based social media platforms. The Publishing division markets books to bookstores, toy stores, specialty stores, museums, and other retail outlets throughout the country. The company distributes children's books published by Usborne Publishing Limited in the United Kingdom. Educational Development Corporation was founded in 1965 and is headquartered in Tulsa, Oklahoma.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "state": "OK",
        "city": "Tulsa",
        "zipcode": "74146",
        "website": "http://www.edcpub.com",
        "market_cap": "Small Cap"
    },
    "FMPR": {
        "short_name": "FAME PRODUCTIONS INC",
        "long_name": "Fame Productions, Inc.",
        "summary": "Fame Productions, Inc., a media company, acquires, develops, and operates underserved and underdeveloped urban media assets and brands that serve various markets. It focuses on the ownership and operation of multi-media brands, intellectual property, and content development. The company develops and analyzes brand strategies to meet the changing needs of marketing in a post digital millennial. It also works with clients, advertisers, and sponsors to develop intellectual property, as well as integrated programs that include retail events, consumer engagement experiences, and sampling opportunities followed up with post-event content. In addition, the company creates custom content for various media platforms, as well as distribution and amplification of those assets to the consumer market place. Fame Productions, Inc. is based in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10034",
        "website": "http://www.fameproinc.com",
        "market_cap": "Small Cap"
    },
    "FUGI": {
        "short_name": "FUEGO ENTERPRISES INC",
        "long_name": "Fuego Enterprises, Inc.",
        "summary": "Fuego Enterprises, Inc., a holding company, engages in the travel and hospitality, media and entertainment, consumer products and promotional goods, data analytics, and e-commerce businesses. It offers various travel programs to Cuba as a full-service agency, as well as manages hospitality properties and real estate. The company also provides print and digital magazines and operates online news portal through OnCubaNews.com, OnCuba Travel Magazine, and Art OnCuba Magazine; and produces and distributes consumer products, including handcrafted souvenirs, destination-unique promotional products, and made-to-order goods. In addition, it offers data analytics, including data mining, predictive analytics, and text mining; and operates online marketplace and community for the sale of Cuban-made and Cuban-themed products. The company was formerly known as Cuba Business Development Group, Inc. and changed its name to Fuego Enterprises, Inc. in October 2012. The company is based in Miami, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Miami",
        "zipcode": "33137",
        "website": "http://www.fuegoenterprisesinc.com",
        "market_cap": "Small Cap"
    },
    "GCI": {
        "short_name": "Gannett Co., Inc.",
        "long_name": "Gannett Co., Inc.",
        "summary": "Gannett Co., Inc. operates as a media and marketing solutions company in the United States. It operates through two segments, Publishing and Digital Marketing Solutions. The company's principal products include 253 daily newspapers with total paid circulation of approximately 2.6 million and Sunday circulation of 3.0 million; 308 weekly newspapers with total circulation of approximately 1.6 million; and 375 locally-focused Websites. Its principal products also comprise 121 daily and weekly news media brands and approximately 100 magazines, and related digital platforms; USATODAY.com and mobile applications, and sports network, as well as Reviewed.com, an affiliate marketing service; and USA TODAY NETWORK, a community events platform. The company also offers digital marketing solutions, such as online presence solutions, online advertising products, conversion software, and cloud-based software solutions. In addition, it produces niche publications that address specific local market interests, such as recreation, sports, healthcare, and real estate. Further, the company offers local market news and information, as well as advertising and subscriptions, and commercial printing and distribution services; and prints commercial materials, including flyers, business cards, and invitations. Additionally, it produces approximately 250 events with a collective attendance approximately 700,000. The company was formerly known as New Media Investment Group Inc. and changed its name to Gannett Co., Inc. in November 2019. Gannett Co., Inc. was founded in 1997 and is headquartered in McLean, Virginia.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "McLean",
        "zipcode": "22107-0910",
        "website": "http://www.gannett.com",
        "market_cap": "Small Cap"
    },
    "GPIW": {
        "short_name": "GRAND PERFECTA INC",
        "long_name": "Grand Perfecta, Inc.",
        "summary": "Grand Perfecta, Inc. does not have significant operations. Previously, it was engaged in gathering, publishing, and disseminating horse racing information and other content related to horse racing in Japan. The company was formerly known as STI Holdings, Inc. and changed its name to Grand Perfecta, Inc. in May 2013. Grand Perfecta, Inc. was incorporated in 2002 and is based in Carson City, Nevada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Carson City",
        "zipcode": "89706",
        "website": "http://www.grandperfecta.com",
        "market_cap": "Small Cap"
    },
    "HRDI": {
        "short_name": "HERE MEDIA INC",
        "long_name": "Here Media Inc.",
        "summary": "Here Media Inc. offers original programming content tailored for the lesbian, gay, bisexual, and transgender (LGBT) community on a subscription basis. The company publishes magazines and books, as well as operates companion Websites targeting the LGBT community. Its products include the magazines Out, The Advocate, and HIVPlus, as well as books published by Alyson Books, which are distributed through traditional newsstands, other retail outlets, and by subscriptions of print and digital editions of the magazines. It also operates PlanetOut, an online media company serving the LGBT community through its website Gay.com, a social networking Website; and a companion Website, heretv.com that features original shows, podcasts, news, and other entertainment, as well as a library of LGBT-themed streaming video. In addition, the company provides subscription video-on-demand and/or regularly scheduled television channel services through cable, satellite, and fiber-optic television providers serving domestic television households in the United States; and syndicates free-to-the-user content to Websites, including msn.com and aol.com. It serves customers through cable television, direct-to-home satellite television, fiber-optic television, and the Internet under the brand name Â\u0093here!Â\u0094. The company is was founded in 2009 and is headquartered in Los Angeles, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Angeles",
        "zipcode": "90024",
        "website": "http://www.heremedia.com",
        "market_cap": "Small Cap"
    },
    "IDWM": {
        "short_name": "IDW MEDIA HOLDINGS",
        "long_name": "IDW Media Holdings, Inc.",
        "summary": "IDW Media Holdings, Inc., a diversified media company, engages in the publishing, television entertainment, and media distribution businesses worldwide. It operates through Publishing and IDW Entertainment segments. The Publishing segment publishes comic books, graphic novels, digital content, and board and tabletop games; and trades in paperback products. The IDW Entertainment segment develops, produces, and distributes content and formats based on comic books and graphic novels for global platforms and services. The company was formerly known as CTM Media Holdings, Inc. and changed its name to IDW Media Holdings, Inc. in July 2015. IDW Media Holdings, Inc. was incorporated in 2009 and is based in Newark, New Jersey.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Newark",
        "zipcode": "07102",
        "website": "http://www.idwmediaholdings.com",
        "market_cap": "Small Cap"
    },
    "JW-A": {
        "short_name": "John Wiley & Sons, Inc.",
        "long_name": "John Wiley & Sons, Inc.",
        "summary": "John Wiley & Sons, Inc. operates as a research and learning company worldwide. The company operates through three segments: Research Publishing & Platforms, Academic & Professional Learning, and Education Services. The Research Publishing & Platforms segment offers scientific, technical, medical, and scholarly journals, as well as related content and services to learned societies, individual researchers, other professionals, and academic, corporate, and government libraries. This segment also publishes physical sciences and engineering, health sciences, social sciences, and humanities and life sciences journals; and provides a publishing software and service for scholarly and professional societies, and publishers to deliver, host, enhance, market, and manage their content on the web through the Literatum platform. It sells its products in digital and print formats through research libraries and library consortia, and independent subscription agents, as well as directly to professional society members, bookstores, online booksellers, and other customers. The Academic & Professional Learning segment provides scientific, professional, and education books in print and digital formats, digital courseware, and test preparation services to libraries, corporations, students, professionals, and researchers, as well as learning, development, and assessment services for businesses and professionals. This segment distributes its products in digital and print formats through chain and online booksellers, libraries, colleges and universities, corporations, direct to consumer, Websites, distributor networks, and other online applications. The Education Services segment provides online program management services for higher education institutions and mthree training, upskilling, and talent placement services for professionals and businesses. The company was founded in 1807 and is headquartered in Hoboken, New Jersey.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Hoboken",
        "zipcode": "07030",
        "website": "http://www.wiley.com",
        "market_cap": "Mid Cap"
    },
    "JW-B": {
        "short_name": "John Wiley & Sons, Inc.",
        "long_name": "John Wiley & Sons, Inc.",
        "summary": "John Wiley & Sons, Inc. operates as a research and learning company worldwide. The company operates through three segments: Research Publishing & Platforms, Academic & Professional Learning, and Education Services. The Research Publishing & Platforms segment offers scientific, technical, medical, and scholarly journals, as well as related content and services to learned societies, individual researchers, other professionals, and academic, corporate, and government libraries. This segment also publishes physical sciences and engineering, health sciences, social sciences, and humanities and life sciences journals; and provides a publishing software and service for scholarly and professional societies, and publishers to deliver, host, enhance, market, and manage their content on the web through the Literatum platform. It sells its products in digital and print formats through research libraries and library consortia, and independent subscription agents, as well as directly to professional society members, bookstores, online booksellers, and other customers. The Academic & Professional Learning segment provides scientific, professional, and education books in print and digital formats, digital courseware, and test preparation services to libraries, corporations, students, professionals, and researchers, as well as learning, development, and assessment services for businesses and professionals. This segment distributes its products in digital and print formats through chain and online booksellers, libraries, colleges and universities, corporations, direct to consumer, Websites, distributor networks, and other online applications. The Education Services segment provides online program management services for higher education institutions and mthree training, upskilling, and talent placement services for professionals and businesses. The company was founded in 1807 and is headquartered in Hoboken, New Jersey.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Hoboken",
        "zipcode": "07030",
        "website": "http://www.wiley.com",
        "market_cap": "Mid Cap"
    },
    "LE70.F": {
        "short_name": "LEE ENTERPRISES INC. DL 2",
        "long_name": "Lee Enterprises, Incorporated",
        "summary": "Lee Enterprises, Incorporated provides local news and information, and advertising services in the United States. The company offers print and digital editions of daily, weekly, and monthly newspapers and publications; and digital services, including Web hosting and content management for other content producers. It also provides advertising and marketing services, such as audience extension, search engine optimization, search engine marketing, web and mobile production, social media services, and reputation monitoring and management, as well as digital marketing services to small to medium businesses, including search engine marketing and social media. In addition, the company offers integrated digital publishing and content management solutions for creating, distributing, and monetizing multimedia content for daily and weekly newspapers, as well as universities, television stations, and niche publications. Further, it provides commercial printing services; distributes third party publications; and operates a digital marketing agency. Additionally, the company publishes 9 daily newspapers, and weekly newspapers and specialty publications. Lee Enterprises, Incorporated was founded in 1890 and is based in Davenport, Iowa.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "IA",
        "city": "Davenport",
        "zipcode": "52807",
        "website": "http://www.lee.net",
        "market_cap": "Small Cap"
    },
    "LEE": {
        "short_name": "Lee Enterprises, Incorporated",
        "long_name": "Lee Enterprises, Incorporated",
        "summary": "Lee Enterprises, Incorporated provides local news and information, and advertising services in the United States. The company offers print and digital editions of daily, weekly, and monthly newspapers and publications; and digital services, including Web hosting and content management for other content producers. It also provides advertising and marketing services, such as audience extension, search engine optimization, search engine marketing, web and mobile production, social media services, and reputation monitoring and management, as well as digital marketing services to small to medium businesses, including search engine marketing and social media. In addition, the company offers integrated digital publishing and content management solutions for creating, distributing, and monetizing multimedia content for daily and weekly newspapers, as well as universities, television stations, and niche publications. Further, it provides commercial printing services; distributes third party publications; and operates a digital marketing agency. Additionally, the company publishes 9 daily newspapers, and weekly newspapers and specialty publications. Lee Enterprises, Incorporated was founded in 1890 and is based in Davenport, Iowa.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "IA",
        "city": "Davenport",
        "zipcode": "52807",
        "website": "http://www.lee.net",
        "market_cap": "Small Cap"
    },
    "MAHI": {
        "short_name": "MONARCH SERVCES INC",
        "long_name": "Monarch Services, Inc.",
        "summary": "Monarch Services, Inc., through its subsidiaries, publishes Â\u0091Girls Life', a bi-monthly magazine for girls age ten to fifteen. The company sells its magazines through direct mail solicitation, insert cards, and subscription agents. In addition, it operates a restaurant under the name Â\u0091Peerce's Plantation' with catering facility and bar. Monarch Services was founded in 1976 and is based in Baltimore, Maryland.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MD",
        "city": "Baltimore",
        "zipcode": "21214",
        "website": null,
        "market_cap": "Small Cap"
    },
    "MDP": {
        "short_name": "Meredith Corporation",
        "long_name": "Meredith Corporation",
        "summary": "Meredith Corporation operates as a diversified media company primarily in the United States. It operates in two segments, National Media and Local Media. The National Media segment offers national consumer media brands through various media platforms, including print magazines, digital and mobile media, brand licensing activities, database-related activities, affinity marketing, and business-to-business marketing products and services. It publishes media in entertainment, food, lifestyle, parenting, and home categories, such as People, Better Homes & Gardens, InStyle, Allrecipes, Real Simple, Shape, Southern Living, Martha Stewart Living, and other brands, as well as 300 special interest publications under approximately 70 brands. This segment operates approximately 50 Websites and applications. It is also involved in the brand licensing, affinity marketing, third-party marketing, consumer database, and other related operations, as well as provision of magazine advertising and circulation, digital and customer relationship marketing, other custom publishing project, and ancillary products and services. In addition, this segment operates The Foundry 360, a creative content studio, which develops content marketing programs across various platforms comprising native advertising that enable clients to engage new consumers and build long-term relationships with existing customers for a range of industries. The Local Media segment operates approximately 17 television stations that include 7 CBS affiliates, 5 FOX affiliates, 2 MyNetworkTV affiliates, 1 NBC affiliate, 1 ABC affiliate, and 2 independent stations. It also includes 12 Websites and 12 applications focused on news, sports, and weather-related information. In addition, this segment sells geographic and demographic-targeted digital and print advertising programs to third parties. The company was founded in 1902 and is headquartered in Des Moines, Iowa.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "IA",
        "city": "Des Moines",
        "zipcode": "50309-3023",
        "website": "http://www.meredith.com",
        "market_cap": "Small Cap"
    },
    "MEZ.F": {
        "short_name": "MEREDITH CORP.  DL 1",
        "long_name": "Meredith Corporation",
        "summary": "Meredith Corporation operates as a diversified media company primarily in the United States. It operates in two segments, National Media and Local Media. The National Media segment offers national consumer media brands through various media platforms, including print magazines, digital and mobile media, brand licensing activities, database-related activities, affinity marketing, and business-to-business marketing products and services. It publishes media in entertainment, food, lifestyle, parenting, and home categories, such as People, Better Homes & Gardens, InStyle, Allrecipes, Real Simple, Shape, Southern Living, Martha Stewart Living, and other brands, as well as 300 special interest publications under approximately 70 brands. This segment operates approximately 50 Websites and applications. It is also involved in the brand licensing, affinity marketing, third-party marketing, consumer database, and other related operations, as well as provision of magazine advertising and circulation, digital and customer relationship marketing, other custom publishing project, and ancillary products and services. In addition, this segment operates The Foundry 360, a creative content studio, which develops content marketing programs across various platforms comprising native advertising that enable clients to engage new consumers and build long-term relationships with existing customers for a range of industries. The Local Media segment operates approximately 17 television stations that include 7 CBS affiliates, 5 FOX affiliates, 2 MyNetworkTV affiliates, 1 NBC affiliate, 1 ABC affiliate, and 2 independent stations. It also includes 12 Websites and 12 applications focused on news, sports, and weather-related information. In addition, this segment sells geographic and demographic-targeted digital and print advertising programs to third parties. The company was founded in 1902 and is headquartered in Des Moines, Iowa.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "IA",
        "city": "Des Moines",
        "zipcode": "50309-3023",
        "website": "http://www.meredith.com",
        "market_cap": "Small Cap"
    },
    "MRPT": {
        "short_name": "MACREPORT.NET INC",
        "long_name": "MacReport.Net, Inc.",
        "summary": "MacReport.Net, Inc. is a blank check company. The company was founded in 2000 and is based in Marcellus, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Marcellus",
        "zipcode": "13108",
        "website": "http://www.macreportmedia.com",
        "market_cap": "Small Cap"
    },
    "NYT.F": {
        "short_name": "N.Y. TIMES CL.A  DL-,10",
        "long_name": "The New York Times Company",
        "summary": "The New York Times Company, together with its subsidiaries, provides news and information for readers and viewers across various platforms worldwide. It offers The New York Times (The Times), a daily and Sunday newspaper in the United States, as well as international edition of The Times; and operates the NYTimes.com Website. The company also transmits articles, graphics, and photographs from The Times and other publications to approximately 1,500 newspapers, magazines, and Websites; licenses electronic databases to resellers in the business, professional, and library markets; and offers magazine licensing, news digests, book development, and rights and permissions. In addition, it engages in the live events business, which hosts physical and virtual live events to connect audiences with journalists and outside thought leaders; operates Wirecutter, a product review and recommendation Website that serves as a guide to technology gear, home products, and other consumer goods; develops mobile applications, including games and Cooking products; prints and distributes products for third parties; and offers other products and services. The company was founded in 1851 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10018",
        "website": "http://www.nytco.com",
        "market_cap": "Mid Cap"
    },
    "NYT": {
        "short_name": "New York Times Company (The)",
        "long_name": "The New York Times Company",
        "summary": "The New York Times Company, together with its subsidiaries, provides news and information for readers and viewers across various platforms worldwide. It offers The New York Times (The Times), a daily and Sunday newspaper in the United States, as well as international edition of The Times; and operates the NYTimes.com Website. The company also transmits articles, graphics, and photographs from The Times and other publications to approximately 1,500 newspapers, magazines, and Websites; licenses electronic databases to resellers in the business, professional, and library markets; and offers magazine licensing, news digests, book development, and rights and permissions. In addition, it engages in the live events business, which hosts physical and virtual live events to connect audiences with journalists and outside thought leaders; operates Wirecutter, a product review and recommendation Website that serves as a guide to technology gear, home products, and other consumer goods; develops mobile applications, including games and Cooking products; prints and distributes products for third parties; and offers other products and services. The company was founded in 1851 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10018",
        "website": "http://www.nytco.com",
        "market_cap": "Mid Cap"
    },
    "PDOS": {
        "short_name": "PLATINUM STUDIOS INC",
        "long_name": "Platinum Studios, Inc",
        "summary": "Platinum Studios, Inc. an entertainment company, creates, produces, and distributes comic-based content. It adapts, produces, and licenses comic book characters for various forms of media, such as print, film, online, mobile/wireless, television, animation, gaming, and merchandising. The company's library comprises approximately 3,800 characters and stories of genres, including teen, action, horror, adventure, science fiction, romance, war, comedy, and, superheroes. Platinum Studios, Inc. was founded in 1996 and is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Angeles",
        "zipcode": "90064",
        "website": "http://www.platinumstudios.com",
        "market_cap": "Small Cap"
    },
    "PEDH": {
        "short_name": "PEOPLES EDUCATIONAL HLDGS INC",
        "long_name": "Mastery Education",
        "summary": "Mastery Education develops and sells print and online educational materials for the K-12 school market. The company offers its educational materials, primarily under the Measuring Up brand. Mastery Education was founded in 1989 and is based in Saddle Brook, New Jersey.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Saddle Brook",
        "zipcode": "07663",
        "website": "http://www.masteryeducation.com",
        "market_cap": "Small Cap"
    },
    "SADL": {
        "short_name": "SADLIER(WILLIAM H.) INC",
        "long_name": "William H. Sadlier, Inc.",
        "summary": "William H. Sadlier, Inc. publishes print, digital, and online educational materials for public and nonpublic schools. It also publishes catechetical materials for catholic schools, parishes, and families. The company was founded in 1832 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10005",
        "website": "http://www.sadlier.com",
        "market_cap": "Small Cap"
    },
    "SALN": {
        "short_name": "SALON CITY INC",
        "long_name": "Salon City, Inc.",
        "summary": "Salon City, Inc. publishes and distributes Salon Citymagazine in the United States and internationally. Salon Citymagazine is a trade/consumer magazine for salons, spas, and their clients. The company sells its magazine through national retailers, bookstores, newsstands, and grocery and drug chains. Salon City, Inc. was founded in 1995 and is based in West Hollywood, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "West Hollywood",
        "zipcode": "90069",
        "website": null,
        "market_cap": "Small Cap"
    },
    "SCHL": {
        "short_name": "Scholastic Corporation",
        "long_name": "Scholastic Corporation",
        "summary": "Scholastic Corporation publishes and distributes children's books worldwide. It operates in three segments: Children's Book Publishing and Distribution, Education, and International. The Children's Book Publishing and Distribution segment publishes and distributes children's books, e-books, media, and interactive products through its school book club and school book fair channels, as well as through its trade channel. Its original publications include the Harry Potter, Hunger Games, Bad Guys, Baby-Sitters Club graphic novels, Magic School Bus, I Spy, Captain Underpants, Dog Man, Wings of Fire, Goosebumps, and Clifford The Big Red Dog; and licensed properties comprise the Peppa Pig, Five Nights at Freddy's, Pokemon, and Geronimo Stilton. In addition, this segment publishes and creates books plus products for children, including titles, such as the Mini Grocery Store, Rocks, Gems & Geodes Maker Lab, LEGO Chain Reactions, Hope the Rainbow Fairy, and other titles under the Klutz and the Make Believe Ideas names. The Education segment publishes and distributes classroom magazines under the Scholastic News, Scope, Storyworks, Let's Find Out, and Junior Scholastic names; non-fiction books under the Children's Press and Franklin Watts names; and literacy curriculum products under the Scholastic Literacy name, as well as provides children's books, other print and online references, fiction focused products, classroom materials, and consulting services. The International segment offers original trade and educational publishing programs; distributes children's books, digital educational resources, and other materials through school-based book clubs, school-based book fairs, and trade channels; produces and distributes magazines; and offers online subscription services. The company distributes its products and services directly to schools and libraries through retail stores and the Internet. Scholastic Corporation was founded in 1920 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10012",
        "website": "http://www.scholastic.com",
        "market_cap": "Small Cap"
    },
    "SL1.F": {
        "short_name": "SCHOLASTIC CORP.  DL-,01",
        "long_name": "Scholastic Corporation",
        "summary": "Scholastic Corporation publishes and distributes children's books worldwide. It operates in three segments: Children's Book Publishing and Distribution, Education, and International. The Children's Book Publishing and Distribution segment publishes and distributes children's books, e-books, media, and interactive products through its school book club and school book fair channels, as well as through its trade channel. Its original publications include the Harry Potter, Hunger Games, Bad Guys, Baby-Sitters Club graphic novels, Magic School Bus, I Spy, Captain Underpants, Dog Man, Wings of Fire, Goosebumps, and Clifford The Big Red Dog; and licensed properties comprise the Peppa Pig, Five Nights at Freddy's, Pokemon, and Geronimo Stilton. In addition, this segment publishes and creates books plus products for children, including titles, such as the Mini Grocery Store, Rocks, Gems & Geodes Maker Lab, LEGO Chain Reactions, Hope the Rainbow Fairy, and other titles under the Klutz and the Make Believe Ideas names. The Education segment publishes and distributes classroom magazines under the Scholastic News, Scope, Storyworks, Let's Find Out, and Junior Scholastic names; non-fiction books under the Children's Press and Franklin Watts names; and literacy curriculum products under the Scholastic Literacy name, as well as provides children's books, other print and online references, fiction focused products, classroom materials, and consulting services. The International segment offers original trade and educational publishing programs; distributes children's books, digital educational resources, and other materials through school-based book clubs, school-based book fairs, and trade channels; produces and distributes magazines; and offers online subscription services. The company distributes its products and services directly to schools and libraries through retail stores and the Internet. Scholastic Corporation was founded in 1920 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10012",
        "website": "http://www.scholastic.com",
        "market_cap": "Small Cap"
    },
    "TPCO": {
        "short_name": "Tribune Publishing Company",
        "long_name": "Tribune Publishing Company",
        "summary": "Tribune Publishing Company, a media company, publishes newspapers worldwide. It publishes daily newspapers, weekly newspapers, and niche publications and direct mail. The company also provides various digital marketing services, which include the development of mobile websites, search engine marketing and optimization, social media account management, and content marketing for its customers' web presence for small to medium size businesses. In addition, it operates Tribune Content Agency, a syndication and licensing business that provides content solutions for publishers. Tribune Publishing Company operates media businesses in eight markets with titles, including the Chicago Tribune, New York Daily News, The Baltimore Sun, Hartford Courant, South Florida's Sun Sentinel, Orlando Sentinel, Virginia's Daily Press and The Virginian-Pilot, and The Morning Call of Lehigh Valley, Pennsylvania. The company engages in business of testing, researching, and reviewing consumer products. The company was formerly known as tronc, Inc. and changed its name to Tribune Publishing Company in October 2018. Tribune Publishing Company was founded in 2013 and is headquartered in Chicago, Illinois.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Chicago",
        "zipcode": "60654",
        "website": "http://www.tribpub.com",
        "market_cap": "Small Cap"
    }
}