{
  "42A0.F": {
    "city": "Bethesda",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Real Estate - Development",
    "long_name": "Alset EHome International Inc.",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "ALSET EHOME INTL  DL-,001",
    "state": "MD",
    "summary": "Alset EHome International Inc., through its subsidiaries, engages in property development, digital transformation technology, and biohealth activities in the United States, Singapore, Hong Kong, Australia, and South Korea. The company engages in the land development, home building, sales and rental, and property management businesses. It designs applications for enterprise messaging and e-commerce software platforms; and engages in the research of nutritional chemistry to create a natural sugar alternative, products to slow the spread of disease, and natural foods and supplements, as well as to treat neurological and immune-related diseases. The company was formerly known as HF Enterprises Inc. and changed its name to Alset EHome International Inc. in February 2021. Alset EHome International Inc. was incorporated in 2018 and is based in Bethesda, Maryland.",
    "website": "http://www.alsetehomeintl.com",
    "zipcode": "20814"
  },
  "4F31.F": {
    "city": "Arlington",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Real Estate - Development",
    "long_name": "Forestar Group Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "FORESTAR GROUP INC. DL 1",
    "state": "TX",
    "summary": "Forestar Group Inc. operates as a residential lot development company in the United States. The acquires land and develops infrastructure for single-family residential communities. The company sells its residential single-family finished lots to homebuilders. The company is headquartered in Arlington, Texas. Forestar Group Inc. is a subsidiary of D.R. Horton, Inc.",
    "website": "http://www.forestar.com",
    "zipcode": "76006"
  },
  "AEI": {
    "city": "Bethesda",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Real Estate - Development",
    "long_name": "Alset EHome International Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "Alset EHome International Inc.",
    "state": "MD",
    "summary": "Alset EHome International Inc., through its subsidiaries, engages in property development, digital transformation technology, and biohealth activities in the United States, Singapore, Hong Kong, Australia, and South Korea. The company engages in the land development, home building, sales and rental, and property management businesses. It designs applications for enterprise messaging and e-commerce software platforms; and engages in the research of nutritional chemistry to create a natural sugar alternative, products to slow the spread of disease, and natural foods and supplements, as well as to treat neurological and immune-related diseases. The company was formerly known as HF Enterprises Inc. and changed its name to Alset EHome International Inc. in February 2021. Alset EHome International Inc. was incorporated in 2018 and is based in Bethesda, Maryland.",
    "website": "http://www.alsetehomeintl.com",
    "zipcode": "20814"
  },
  "ANCE": {
    "city": "Sparks",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Restance, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "RESTANCE INC",
    "state": "NV",
    "summary": "Restance, Inc. is a private equity and mezzanine firm specializing in acquisitions, management buyouts, structured recapitalizations, buyouts of small-to-medium size companies, public-to-private transactions, consolidation, and distressed (turn-around) opportunities to late-stage companies. The firm also specializes in asset-based financings in real estate, construction, project, and other cash flow pledged credit, structured solutions; corporate credit in the form of senior secured, unsecured, distressed, mezzanine and convertible; providing debt and equity capital, and capital formation for expansion and/or industry consolidation. The firm typically invests in insurance and reinsurance, consumer businesses, power and energy focusing on upstream and midstream asset development in the oil and natural gas industry, project development in the renewable energy industry, and wine sectors. The firm seeks long-term investments with a buy-and-hold strategy. The firm prefers to invest between $25 million and $250 million in its portfolio companies. Restance, Inc.was founded in 2010 and is based in Sparks, Nevada with additional offices in New York, New York; George Town, Cayman Islands; Hamilton, Bermuda; Seattle, Washington; and Wilmington, Delaware.",
    "website": "http://www.restanceinc.com",
    "zipcode": "89434"
  },
  "ARL": {
    "city": "Dallas",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Real Estate - Development",
    "long_name": "American Realty Investors, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Real Estate",
    "short_name": "American Realty Investors, Inc.",
    "state": "TX",
    "summary": "American Realty Investors, Inc. acquires, develops, and owns multifamily apartment communities and commercial real estate properties in the southwestern, southeastern, and mid-western United States. The company leases apartment units to residents; and leases office, industrial, and retail space to various for-profit businesses, as well as local, state, and federal agencies; and sells land and properties. As of December 31, 2020, its portfolio included six commercial properties comprising five office buildings and 1 retail properties; Ten multifamily apartment communities consisting of 1,639 units; and fifty-one multifamily apartment communities totaling 10,137 units. The company also owns or controls 1,980 acres of developed and undeveloped land. American Realty Investors, Inc. was founded in 1999 and is headquartered in Dallas, Texas.",
    "website": "http://www.americanrealtyinvest.com",
    "zipcode": "75234"
  },
  "BPCP": {
    "city": "Riverton",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Bishop Capital Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "BISHOP CAPITAL CORP WYOMING",
    "state": "WY",
    "summary": "Bishop Capital Corporation, through its subsidiaries, engages in the development and sale of real estate properties in the United States. The company owns and operates a 328 unit apartment complex located in Colorado Springs, Colorado. It also owns approximately 2 acres of developed and 16 acres of undeveloped land in Colorado. The company is developing a 16 acre parcel called The Crossing at Palmer Park and 11 acre parcel called Creekside Center at Galley. In addition, it has a royalty interest in a natural gas property located in Wyoming. Bishop Capital, formerly known as Bishop Cable Communications Corporation, was incorporated in 1983 and changed its name to Bishop Capital Corporation in 1995. The company is based in Riverton, Wyoming.",
    "website": null,
    "zipcode": "82501"
  },
  "CAPV": {
    "city": "Spokane",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Cabo Verde Capital Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "CABO VERDE CAPITAL INC",
    "state": "WA",
    "summary": "Cabo Verde Capital Inc. engages in the development, manufacture, and distribution of atmospheric water generators for use in home and office, commercial, industrial, and infrastructure applications in the United States and internationally. Its atmospheric water generators extract water from air and turn it into drinking water. The company's products include AirJuicer 4010, an atmospheric water generator that generates and purifies water from the atmosphere; CI-2500, an atmospheric water generator that produces water depending on the relative humidity of the geographical location; CI-5000, which produces potable water-from-air; WaterProducer Greenhouse that produces drinking water and irrigation water; and WaterWall/WaterProducer, which produces water by condensing moisture from the air. Its installed or mobile unit produces drinking water for the bottling industry, restaurants, emergency/disaster relief, humanitarian initiatives, troop support, and remote camps. The company provides its products online. Cabo Verde Capital Inc. was formerly known as Watair Inc. and changed its name to Cabo Verde Capital Inc. in May 2014. The company was incorporated in 2000 and is based in Spokane, Washington.",
    "website": null,
    "zipcode": "99201"
  },
  "CHIT": {
    "city": "Bedford",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Cherubim Interests Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "CHERUBIM INTERESTS INC",
    "state": "TX",
    "summary": "Cherubim Interests Inc. focuses on the alternative, commercial, single, and multifamily dwelling opportunities for the purpose of investment purchase. The company is involved in the due diligence, acquisition, planning, construction, renovation, and property management. It also provides renovation services to third party multifamily dwelling unit owners on a turn-key basis. The company was founded in 2006 and is based in Bedford, Texas.",
    "website": "http://www.cherubiminterests.com",
    "zipcode": "76022"
  },
  "COWP": {
    "city": "Port Jefferson Station",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Canal Capital Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "CANAL CAPITAL CORP",
    "state": "NY",
    "summary": "Canal Capital Corporation engages in real estate and stockyard operations in the United States. The company is involved in the development, management, and sale of its real estate properties. Its real estate properties comprise exchange buildings; land and structures leased to meat packing facilities, railcar repair shops, lumber yards, and various other commercial and retail businesses; and vacant land for development or resale. The company has real estate properties in Sioux City, Iowa; South St Paul, Minnesota; St Joseph, Missouri; and Omaha, Nebraska. As of October 31, 2011, it owned approximately 2 acres of undeveloped land in Sioux City, Iowa. The company also operates a central public stockyard located in St. Joseph, Missouri. Its stockyard provides various services and facilities required to operate an independent market for the sale of livestock, including veterinary facilities, auction arenas, auctioneers, weigh masters and scales, feed and bedding facilities, and security personnel, as well as offers other services, such as pure bred and other specialty sales for producer organizations. In addition, the company sells its antiquities through independent art dealers and at public art auctions. Canal Capital Corporation was founded in 1964 and is headquartered in Port Jefferson Station, New York.",
    "website": null,
    "zipcode": "11776"
  },
  "CTO": {
    "city": "Daytona Beach",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Real Estate - Development",
    "long_name": "CTO Realty Growth, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "CTO Realty Growth, Inc.",
    "state": "FL",
    "summary": "CTO Realty Growth, Inc. is a Florida-based publicly traded real estate company, which owns income properties comprised of approximately 2.4 million square feet in diversified markets in the United States and an approximately 23.5% interest in Alpine Income Property Trust, Inc., a publicly traded net lease real estate investment trust (NYSE: PINE).",
    "website": "http://ctorealtygrowth.com",
    "zipcode": "32114"
  },
  "DEVM": {
    "city": "Birmingham",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "DevMar Equities, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "DEVMAR EQUITIES INC",
    "state": "MI",
    "summary": "DevMar Equities, Inc. engages in the real estate acquisition and development of multifamily/mixed-use and hospitality projects in urban locations with a focus in Florida. The company was formerly known as La Cortez Energy, Inc. and changed its name to DevMar Equities, Inc. in February 2019. DevMar Equities, Inc. is based in Birmingham, Michigan.",
    "website": "http://www.devmarequities.com",
    "zipcode": "48009"
  },
  "EGXP": {
    "city": "Littleton",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Eagle Exploration Co.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "EAGLE EXPLORATION CO",
    "state": "CO",
    "summary": "Eagle Exploration Company, together with its subsidiaries, is engaged in the purchase and development of residential and commercial real estate properties in the United States. It also holds interests in oil and gas properties. The company is based in Littleton, Colorado.",
    "website": null,
    "zipcode": "80123"
  },
  "FHRT": {
    "city": "Manchester",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "First Hartford Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "FIRST HARTFORD CORP",
    "state": "CT",
    "summary": "First Hartford Corporation, together with its subsidiaries, engages in the purchase, development, ownership, management, and sale of real estate properties in the United States. It operates through two segments, Real Estate Operations and Fee for Service. The company owns interests in various properties, which are used as shopping centers, colleges, restaurants, police stations, and apartments located in Connecticut, Delaware, Louisiana, Massachusetts, Missouri, New York, New Jersey, Rhode Island, and Texas. It also provides preferred developer services for corporate franchise operators, as well as owns and operates a movie theater, a liquor store, and a restaurant. First Hartford Corporation was incorporated in 1909 and is based in Manchester, Connecticut.",
    "website": "http://www.firsthartford.com",
    "zipcode": "06042"
  },
  "FOR": {
    "city": "Arlington",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Real Estate - Development",
    "long_name": "Forestar Group Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "Forestar Group Inc",
    "state": "TX",
    "summary": "Forestar Group Inc. operates as a residential lot development company in the United States. The acquires land and develops infrastructure for single-family residential communities. The company sells its residential single-family finished lots to homebuilders. The company is headquartered in Arlington, Texas. Forestar Group Inc. is a subsidiary of D.R. Horton, Inc.",
    "website": "http://www.forestar.com",
    "zipcode": "76006"
  },
  "FP9.F": {
    "city": "Irvine",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Real Estate - Development",
    "long_name": "Five Point Holdings, LLC",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "FIVE PT.HLDGS CL.AREP.",
    "state": "CA",
    "summary": "Five Point Holdings, LLC, through its subsidiary, Five Point Operating Company, LP, designs and develops mixed-use and planned communities in Orange County, Los Angeles County, and San Francisco County. The company operates in four segments: Valencia, San Francisco, Great Park, and Commercial. It sells residential and commercial land sites to homebuilders, commercial developers, and commercial buyers; operates and owns a commercial office, medical campus, and other properties; and provides development and property management services. The company was formerly known as Newhall Holding Company, LLC and changed its name to Five Point Holdings, LLC in May 2016. Five Point Holdings, LLC was incorporated in 2009 and is headquartered in Irvine, California.",
    "website": "http://www.fivepoint.com",
    "zipcode": "92618"
  },
  "FPH": {
    "city": "Irvine",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Real Estate - Development",
    "long_name": "Five Point Holdings, LLC",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "Five Point Holdings, LLC",
    "state": "CA",
    "summary": "Five Point Holdings, LLC, through its subsidiary, Five Point Operating Company, LP, designs and develops mixed-use and planned communities in Orange County, Los Angeles County, and San Francisco County. The company operates in four segments: Valencia, San Francisco, Great Park, and Commercial. It sells residential and commercial land sites to homebuilders, commercial developers, and commercial buyers; operates and owns a commercial office, medical campus, and other properties; and provides development and property management services. The company was formerly known as Newhall Holding Company, LLC and changed its name to Five Point Holdings, LLC in May 2016. Five Point Holdings, LLC was incorporated in 2009 and is headquartered in Irvine, California.",
    "website": "http://www.fivepoint.com",
    "zipcode": "92618"
  },
  "GCCO": {
    "city": "Garden City",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Garden City Co.",
    "market": "us_market",
    "market_cap": null,
    "sector": "Real Estate",
    "short_name": "GARDEN CITY CO COLORADO",
    "state": "KS",
    "summary": "Garden City Co. is headquartered in Garden City, Kansas.",
    "website": "http://garden-city-company-the.business.site",
    "zipcode": "67846"
  },
  "GL40.F": {
    "city": "New York",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Real Estate - Development",
    "long_name": "INDUS Realty Trust, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "INDUS REALTY TRUST DL-,01",
    "state": "NY",
    "summary": "INDUS Realty Trust, Inc. is a real estate business principally engaged in developing, acquiring, managing and leasing industrial/warehouse properties. INDUS owns 41 buildings totaling approximately 4.6 million square feet (4.2 million of which is industrial/warehouse space) in Connecticut, Pennsylvania, North Carolina and Florida in addition to over 3,400 acres of undeveloped land.",
    "website": "http://indusrt.com",
    "zipcode": "10022"
  },
  "GLCO": {
    "city": "Las Vegas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Global Links Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "GLOBAL LINKS CORP",
    "state": "NV",
    "summary": "Global Links Corp., together with its subsidiaries, engages in the design, construction, and sale of factory-built homes in underdeveloped countries worldwide. The company develops affordable housing projects using stackable housing designs; and provides a service whereby members can exchange goods and services for trade dollars' in place of cash. It also sells hemp and medical marijuana products and services. The company was formerly known as United Trading.Com and changed its name to Global Links Corp. in February 2003. Global Links Corp. was founded in 1952 and is based in Las Vegas, Nevada.",
    "website": "http://www.globallinkscorp.com",
    "zipcode": "89120"
  },
  "GRHI": {
    "city": "Las Vegas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Gold Rock Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "GOLD ROCK HOLDINGS INC",
    "state": "NV",
    "summary": "Gold Rock Holdings, Inc., through its subsidiaries, develops techniques, products, and services for consumption worldwide. It focuses on the certification of the patented Z MIX material and the subsequent use of Z MIX in construction of large scale housing developments. The company also engages in the business of international forest management, including harvesting damaged forest areas and replanting with a hybrid tree. It is also involved in building wind turbines, the management of power plants, wood processing, reforestation, and construction projects. In addition, the company engages in the production, generation, transmission, and sale of electricity through power plants on tribal/Indian lands. Further, it designs, produces, and sells wind turbine equipment worldwide. The company was formerly known as Composite Holdings, Inc. and changed its name to Gold Rock Holdings, Inc. in September 2004. Gold Rock Holdings, Inc. was founded in 1993 and is based in Las Vegas, Nevada.",
    "website": null,
    "zipcode": "89118"
  },
  "HCDI": {
    "city": "Gig Harbor",
    "country": "United States",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Real Estate - Development",
    "long_name": "Harbor Custom Development, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Real Estate",
    "short_name": "Harbor Custom Development, Inc.",
    "state": "WA",
    "summary": "Harbor Custom Development, Inc. engages in the real estate development business in Western Washington's Puget Sound region. The company undertakes projects, such as residential lots, home communities, and single family and multi-family properties. It is involved in the land development cycle activities, including land acquisition, entitlements, construction of project infrastructure, home building, marketing, sales, and management of various residential projects. The company was formerly known as Harbor Custom Homes, Inc. and changed its name to Harbor Custom Development, Inc. in August 2019. Harbor Custom Development, Inc. was founded in 2014 and is headquartered in Gig Harbor, Washington.",
    "website": "http://www.harborcustomhomes.com",
    "zipcode": "98332"
  },
  "HIHI": {
    "city": "Holiday Island",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Holiday Island Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "HOLIDAY ISLAND HOLDINGS INC",
    "state": "AR",
    "summary": "Holiday Island Holdings, Inc. primarily engages in land development activities. It acquires, develops, manages, and sells income producing commercial and residential real estate properties located in Holiday Island, Arkansas. The company was formerly known as VillageEDOCS, Inc. and changed its name to Holiday Island Holdings, Inc. in February 2014. Holiday Island Holdings, Inc. was founded in 1996 and is based in Holiday Island, Arkansas.",
    "website": "http://www.holidayislandholdings.com",
    "zipcode": "72630"
  },
  "ILAL": {
    "city": "San Diego",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "International Land Alliance, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "INTERNATIONAL LAND ALLIANCE INC",
    "state": "CA",
    "summary": "International Land Alliance, Inc. operates as a residential land development company primarily in the Baja California Norte region of Mexico. It purchases properties; subdivides the properties into residential and commercial building lots; and finances and sells the lots to homebuyers, retirees, investors, and commercial developers. International Land Alliance, Inc. was incorporated in 2013 and is headquartered in San Diego, California.",
    "website": "http://ila.company",
    "zipcode": "92101"
  },
  "INDT": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Real Estate - Development",
    "long_name": "INDUS Realty Trust, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "INDUS Realty Trust, Inc.",
    "state": "NY",
    "summary": "INDUS Realty Trust, Inc. is a real estate business principally engaged in developing, acquiring, managing and leasing industrial/warehouse properties. INDUS owns 41 buildings totaling approximately 4.6 million square feet (4.2 million of which is industrial/warehouse space) in Connecticut, Pennsylvania, North Carolina and Florida in addition to over 3,400 acres of undeveloped land.",
    "website": "http://indusrt.com",
    "zipcode": "10022"
  },
  "IVCO": {
    "city": "Newport Beach",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Investco Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "INVESTCO CORPORATION",
    "state": "CA",
    "summary": "Investco Corporation does not have significant operations. The company was formerly known as U S West Homes Inc and changed its name to Investco Corporation in March 2003. Investco Corporation is based in Newport Beach, California.",
    "website": null,
    "zipcode": "92660"
  },
  "KANP": {
    "city": "Chicago",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Kaanapali Land, LLC",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "KAANAPALI LAND LLC",
    "state": "IL",
    "summary": "Kaanapali Land, LLC engages in the property and agriculture businesses in the state of Hawaii. The company's Agriculture segment is involved in farming, harvesting, and milling operations relating to coffee orchards on behalf of the land owners. This segment also cultivates, harvests, and sells bananas, citrus fruits, and alfalfa, as well as engages in ranching operations. The company sells milled green coffee under the Mauigrown Coffee brand. Its Property segment primarily develops land for sale, as well as negotiates the bulk sale of undeveloped land. The company was incorporated in 2002 and is based in Chicago, Illinois. Kaanapali Land, LLC is a subsidiary of Pacific Trail Holdings, LLC.",
    "website": null,
    "zipcode": "60611"
  },
  "LSEA": {
    "city": "Newport Beach",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Real Estate - Development",
    "long_name": "Landsea Homes Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "Landsea Homes Corporation",
    "state": "CA",
    "summary": "Landsea Homes Incorporated, together with its subsidiaries, engages in the acquisition, development, and building of lots, homes, and condominiums in California, Arizona, New York, and New Jersey. It operates in three segments: Arizona, California, and Metro New York. The company designs, constructions, markets, and sells suburban and urban single-family detached and attached homes. It offers a range of properties, including entry-level and first-time move-up homes. The company was founded in 2017 and is headquartered in Newport Beach, California",
    "website": "http://landseahomes.com",
    "zipcode": "92660"
  },
  "MTPP": {
    "city": "Mount Juliet",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Mountain Top Properties, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "MOUNTAIN TOP PROPERTIES INC",
    "state": "TN",
    "summary": "Lab Holdings, Inc., formerly Baby Bee Bright Corporation, is the developer, manufacturer and marketer of innovative prenatal educational systems and related products servicing the rapidly expanding expectant mother/prenatal market. The company has researched and developed an award winning, patented, audio directional technology as the delivery system for the prenatal educator. The company is based in Mount Juliet, Tennessee.",
    "website": null,
    "zipcode": "37122"
  },
  "NHVP": {
    "city": "Philadelphia",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Northeast Development Corp., Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "NORTHEAST DEVELOPMENT CORP",
    "state": "PA",
    "summary": "Northeast Development Corporation provides general contracting, construction management, and design-build services to private clients and public agencies throughout the northeast United States. Its construction business involves building and commercial development; and civil works projects. The company was incorporated in 2004 and is based in Philadelphia, Pennsylvania.",
    "website": null,
    "zipcode": "19102"
  },
  "OMAGQ": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Omagine, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "OMAGINE INC",
    "state": "NY",
    "summary": "Omagine, Inc., through its subsidiaries, focuses on the entertainment, hospitality, and real-estate development opportunities primarily in the Middle East and North Africa. The company focuses on the design, development, and construction of mixed-use tourism and residential real-estate development projects. Omagine, Inc. was incorporated in 2004 and is based in New York, New York. On March 10, 2020, Omagine, Inc., along with its affiliate, filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the Southern District of New York.",
    "website": "http://www.omagine.com",
    "zipcode": "10016"
  },
  "PPCQ": {
    "city": "Poway",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Premier Pacific Construction, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "PREMIER PACIFIC CONSTRUCTION",
    "state": "CA",
    "summary": "Premier Pacific Construction, Inc., a construction company, provides general contracting and construction services to residential and commercial clients in California. It also offers pre-sale renovation and upgrade services to real estate brokers and homeowners in San Diego County. The company was founded in 2000 and is based in Poway, California.",
    "website": "http://www.premierpacific.net",
    "zipcode": "92064"
  },
  "RGSG": {
    "city": "Sheridan",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Resources Global Services Group",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "RESOURCES GLOBAL SERVICES GROUP",
    "state": "WY",
    "summary": "Resources Global Services Group focuses on the property investment and development, distribution of goods and services, and hospitality and services businesses. The company is based in Sheridan, Wyoming.",
    "website": "http://www.resourcesglobalservices.com",
    "zipcode": "82801"
  },
  "TAUX": {
    "city": "New Orleans",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Terre aux Boeufs Land Co., Inc.",
    "market": "us_market",
    "market_cap": null,
    "sector": "Real Estate",
    "short_name": "TERRE AUX BOEUFS LD CO",
    "state": "LA",
    "summary": "Terre aux Boeufs Land Co., Inc. engages in the land development activities. The company is based in New Orleans, Louisiana.",
    "website": null,
    "zipcode": "70130"
  },
  "UCASU": {
    "city": "Atlanta",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "UC Asset, LP",
    "market": "us_market",
    "market_cap": null,
    "sector": "Real Estate",
    "short_name": "UC ASSET LIMITED PARTNERSHIP CO",
    "state": "GA",
    "summary": "UC Asset, LP, a limited partnership, invests in real estate for development and redevelopment in the Atlanta and Dallas areas. Its investments primarily consist of ownership interests in residential properties for redevelopment in the Atlanta metropolitan area and land for development in the Dallas metropolitan area. UCF Asset LLC serves as the general partner of the company. The company was founded in 2016 and is based in Atlanta, Georgia.",
    "website": null,
    "zipcode": "30341"
  },
  "XTRM": {
    "city": "Corona",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Extreme Biodiesel, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "EXTREME BIODIESEL INC",
    "state": "CA",
    "summary": "Extreme Biodiesel, Inc. engages in the development, marketing, and commercialization of bio-diesel fuel, home bio-diesel processors, and related products. The company is based in Corona, California.",
    "website": "http://www.extremebiodiesel.com",
    "zipcode": "92880"
  }
}
