{
    "04M.F": {
        "short_name": "REALOGY HOLDINGS  DL-,01",
        "long_name": "Realogy Holdings Corp.",
        "summary": "Realogy Holdings Corp., through its subsidiaries, provides residential real estate services. It operates through three segments: Realogy Franchise Group, and Realogy Brokerage Group. The Realogy Franchise Group segment franchises its residential real estate brokerages under the Century 21, Coldwell Banker, Coldwell Banker Commercial, Corcoran, ERA, Sotheby's International Realty, and Better Homes and Gardens Real Estate brand names. This segment also offers lead generation and relocation services. As of December 31, 2020, this segment's real estate franchise systems and proprietary brands had approximately 20,100 offices and 320,700 independent sales agents worldwide. The Realogy Brokerage Group segment owns and operates a full-service residential real estate brokerage business under the Coldwell Banker, Corcoran, and Sotheby's International Realty brand names to assist home buyers and sellers in the listing, marketing, selling, and finding homes. As of December 31, 2020, this segment owned and operated 670 brokerage offices with approximately 53,100 independent sales agents. The Realogy Title Group segment provides title, escrow, and settlement services to real estate companies, corporations, and financial institutions. This segment also serves as an underwriter of title insurance policies in connection with residential and commercial real estate transactions. Realogy Holdings Corp. was incorporated in 2006 and is headquartered in Madison, New Jersey.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NJ",
        "city": "Madison",
        "zipcode": "07940",
        "website": "http://www.realogy.com",
        "full_time_employees": 9235
    },
    "04M.MU": {
        "short_name": "REALOGY HOLDINGS  DL-,01",
        "long_name": "Realogy Holdings Corp.",
        "summary": "Realogy Holdings Corp., through its subsidiaries, provides residential real estate services. It operates through three segments: Realogy Franchise Group, and Realogy Brokerage Group. The Realogy Franchise Group segment franchises its residential real estate brokerages under the Century 21, Coldwell Banker, Coldwell Banker Commercial, Corcoran, ERA, Sotheby's International Realty, and Better Homes and Gardens Real Estate brand names. This segment also offers lead generation and relocation services. As of December 31, 2020, this segment's real estate franchise systems and proprietary brands had approximately 20,100 offices and 320,700 independent sales agents worldwide. The Realogy Brokerage Group segment owns and operates a full-service residential real estate brokerage business under the Coldwell Banker, Corcoran, and Sotheby's International Realty brand names to assist home buyers and sellers in the listing, marketing, selling, and finding homes. As of December 31, 2020, this segment owned and operated 670 brokerage offices with approximately 53,100 independent sales agents. The Realogy Title Group segment provides title, escrow, and settlement services to real estate companies, corporations, and financial institutions. This segment also serves as an underwriter of title insurance policies in connection with residential and commercial real estate transactions. Realogy Holdings Corp. was incorporated in 2006 and is headquartered in Madison, New Jersey.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "United States",
        "state": "NJ",
        "city": "Madison",
        "zipcode": "07940",
        "website": "http://www.realogy.com",
        "full_time_employees": 9235
    },
    "13K.F": {
        "short_name": "KENNEDY-WILSON  DL-,0001",
        "long_name": "Kennedy-Wilson Holdings, Inc.",
        "summary": "Kennedy-Wilson Holdings, Inc., together with its subsidiaries, operates as a real estate investment company. The company owns, operates, and invests in real estate both on its own and through its investment management platform. It focuses on multifamily and office properties located in the Western United States, the United Kingdom, Ireland, Spain, Italy, and Japan. As of December 31, 2020, the company had ownership interests in 10,350 multifamily units, 8.6 million square feet of commercial space, and one hotel. It is also involved in the development, redevelopment, and entitlement of real estate properties. Kennedy-Wilson Holdings, Inc. was founded in 1977 and is headquartered in Beverly Hills, California.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Beverly Hills",
        "zipcode": "90212",
        "website": "http://www.kennedywilson.com",
        "full_time_employees": 202
    },
    "26R.F": {
        "short_name": "RMR GROUP INC.CL.A DL-,01",
        "long_name": "The RMR Group Inc.",
        "summary": "The RMR Group Inc., through its subsidiary, The RMR Group LLC, provides business and property management services in the United States. It provides management services to its four publicly traded real estate investment trusts (REITs) and three real estate operating companies. As of September 30, 2020, it had approximately 2,100 properties in 47 states under management, which are primarily owned by the Managed Equity REITs. It also provides investment advisory services. The company was formerly known as REIT Management & Research Inc. and changed its name to The RMR Group Inc. in September 2015. The RMR Group Inc. was founded in 1986 and is headquartered in Newton, Massachusetts.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MA",
        "city": "Newton",
        "zipcode": "02458-1634",
        "website": "http://www.rmrgroup.com",
        "full_time_employees": 600
    },
    "ABCP": {
        "short_name": "AMBASE CORP",
        "long_name": "AmBase Corporation",
        "summary": "AmBase Corporation does not have significant operations. Previously, it invested in a real estate development property in New York, New York; and owned, operated, and managed a commercial office building. AmBase Corporation was incorporated in 1975 and is headquartered in Coral Springs, Florida.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Coral Springs",
        "zipcode": "33065",
        "website": null,
        "full_time_employees": 4
    },
    "ACAN": {
        "short_name": "AMERICANN INC",
        "long_name": "AmeriCann, Inc.",
        "summary": "AmeriCann, Inc. operates as a specialized cannabis company in the United States. It intends to design, develop, lease, and operate cultivation, processing, and manufacturing facilities for licensed cannabis businesses in the United States. The company was formerly known as Nevada Health Scan, Inc. and changed its name to AmeriCann, Inc. in 2014. AmeriCann, Inc. was founded in 2010 and is based in Denver, Colorado.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Denver",
        "zipcode": "80202",
        "website": "http://www.americann.co",
        "full_time_employees": 3
    },
    "AGTK": {
        "short_name": "AGRITEK HLDGS INC",
        "long_name": "Agritek Holdings, Inc.",
        "summary": "Agritek Holdings, Inc. distributes hemp and cannabis products under the Hemp Pops, MD Vapes, Rehab Rx, Higher Society, and California Premiums brands in the United States. Its products include human ingestible, such as tinctures, capsules, and gummies; CBD edibles; topicals; and pet products. The company also offers business services, including operational and compliance consulting, funding and financing, dispensary and retail, commercial production and equipment build out, multichannel supply chain, and consumer product, as well as branding, marketing, and sales solutions. In addition, it is involved in the acquisition and leasing of real estate properties, such as cultivation space and related facilities to licensed marijuana growers and dispensary owners. Agritek Holdings, Inc. distributes its products through e-commerce websites comprising RehabRx.com and Hemppops.com; third-party e-commerce websites; and various brick and mortar retailers. The company was formerly known as MediSwipe Inc. and changed its name to Agritek Holdings, Inc. in April 2014. Agritek Holdings, Inc. was incorporated in 1997 and is headquartered in Miami, Florida.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Miami",
        "zipcode": "33131",
        "website": "http://www.agritekholdings.com",
        "full_time_employees": 2
    },
    "AOXY": {
        "short_name": "ADVANCED OXYGEN TECHNOLOGIES",
        "long_name": "Advanced Oxygen Technologies, Inc.",
        "summary": "Advanced Oxygen Technologies, Inc., through its subsidiary, Anton Nielsen Vojens, ApS, owns and leases a commercial real estate property in Vojens, Denmark. Its property is land only, as well as a 750 square meters parcel that is used as a fuel station. The company was formerly known as Aquanautic Corporation. The company was incorporated in 1981 and is based in Randolph, Vermont.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "VT",
        "city": "Randolph",
        "zipcode": "05060",
        "website": "http://www.aoxy-ca.com",
        "full_time_employees": 2
    },
    "AQQSQ": {
        "short_name": "AMERICAN SPECTRUM REALTY INC",
        "long_name": "American Spectrum Realty, Inc.",
        "summary": "American Spectrum Realty, Inc. is liquidating. The firm through its subsidiaries, engages in the ownership, management, and operation of income-producing properties in the United States. As of December 31, 2008, it owned and operated 29 properties, which consisted of 23 office buildings, 5 industrial properties, and 1 retail property. The company was founded in 2000 and is based in Houston, Texas. On March 16, 2015, American Spectrum Realty Inc. filed a voluntary petition for reorganization under Chapter 11 in the US Bankruptcy Court for the Southern District of Texas. The plan was later approved as Chapter 11 liquidation on July 8, 2016.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77057",
        "website": null,
        "full_time_employees": 165
    },
    "ASPZ": {
        "short_name": "ASIA PROPERTIES INC",
        "long_name": "Asia Properties, Inc.",
        "summary": "Asia Properties, Inc. intends to acquire and seek opportunities to invest in real estate. The company was founded in 1998 and is based in Bellingham, Washington.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WA",
        "city": "Bellingham",
        "zipcode": "98225",
        "website": "http://www.aspz-usa.com",
        "full_time_employees": 1
    },
    "AXR": {
        "short_name": "AMREP Corporation",
        "long_name": "AMREP Corporation",
        "summary": "AMREP Corporation, through its subsidiaries, primarily engages in the real estate business. The company sells developed and undeveloped lots to homebuilders, commercial and industrial property developers, and others. As of July 1, 2020, it owned approximately 18,000 acres in Rio Rancho, New Mexico. The company owns tracts of land in Colorado, including 1 property of approximately 160 acres planned for approximately 410 homes. It also owns subsurface oil, gas, and mineral interests covering an area of approximately 55,000 surface acres of land located in Rio Rancho. The company was founded in 1961 and is headquartered in Plymouth Meeting, Pennsylvania.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Plymouth Meeting",
        "zipcode": "19462",
        "website": "http://www.amrepcorp.com",
        "full_time_employees": 15
    },
    "AZLCZ": {
        "short_name": "AZTEC LD & CATTLE LTD",
        "long_name": "Aztec Land and Cattle Company, Limited",
        "summary": "Aztec Land and Cattle Company, Limited provides cattle ranching services. The company was founded in 1884 and is based in Phoenix, Arizona.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85037",
        "website": "http://www.azteclandco.com",
        "full_time_employees": null
    },
    "BRST": {
        "short_name": "BROAD STREET REALTY INC",
        "long_name": "Broad Street Realty, Inc.",
        "summary": "Broad Street Realty, Inc., an integrated real estate company, owns, develops, operates, and redevelops grocery-anchored shopping centers and street retail-based properties in the Mid-Atlantic and Denver, Colorado. The company provides commercial real estate brokerage services for owned and third-party offices, and industrial and retail operators and tenants. It also offers coordination, tenant improvements, and building services; real estate management and engineering services to property owners; strategic advisory services; asset management services; and construction services. As of December 31, 2020, the company owned 11 retail properties, including 10 located in the Mid-Atlantic region and 1 located in Colorado. Broad Street Realty, Inc. is headquartered in Bethesda, Maryland.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MD",
        "city": "Bethesda",
        "zipcode": "20814",
        "website": "http://www.broadstreetrealty.com",
        "full_time_employees": 43
    },
    "BVERS": {
        "short_name": "BEAVER COAL",
        "long_name": "Beaver Coal Company, Limited",
        "summary": "Beaver Coal Company, Limited owns surface and mineral properties located in West Virginia, the United States. The company is based in Beckley, West Virginia.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WV",
        "city": "Beckley",
        "zipcode": "25801",
        "website": "http://www.beavercoal.com",
        "full_time_employees": null
    },
    "C1BR34.SA": {
        "short_name": "CBRE GROUP IDRN",
        "long_name": "CBRE Group, Inc.",
        "summary": "CBRE Group, Inc. operates as a commercial real estate services and investment company worldwide. It operates through Advisory Services, Global Workplace Solutions, and Real Estate Investments segments. The Advisory Services segment provides strategic advice and execution to owners, investors, and occupiers of real estate in connection with leasing; property sales and mortgage services under the CBRE Capital Markets brand; property and project management services, including construction management, marketing, building engineering, accounting, and financial services for owners of and investors in office, industrial, and retail properties; and valuation services that include market value appraisals, litigation support, discounted cash flow analyses, and feasibility studies, as well as consulting services, such as property condition reports, hotel advisory, and environmental consulting. The Global Workplace Solutions segment offers facilities management, project management, and transaction management services. The Real Estate Investments segment provides investment management services under the CBRE Global Investors brand to pension funds, insurance companies, sovereign wealth funds, foundations, endowments, and other institutional investors; development services under the Trammell Crow Company brand primarily to users of and investors in commercial real estate; and flexible-space solutions under the CBRE Hana brand, which includes office suites, conference rooms and event space, and communal co-working space for institutional property owners. It also develops residential-led and mixed-use sites in London under the Telford Homes brand. The company was founded in 1906 and is headquartered in Dallas, Texas.",
        "currency": "BRL",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75201",
        "website": "http://www.cbre.com",
        "full_time_employees": 100000
    },
    "C1GP34.SA": {
        "short_name": "COSTAR GROUPDRN",
        "long_name": "CoStar Group, Inc.",
        "summary": "CoStar Group, Inc. provides information, analytics, and online marketplace services to the commercial real estate, hospitality, residential, and related professionals industries in the United States, Canada, Europe, the Asia Pacific, and Latin America. It offers CoStar Property Professional that provides inventory of office, industrial, retail, and multifamily, and student housing properties and land; CoStar COMPS Professional, which covers comparable commercial real estate sales information; CoStar Market Analytics to view and report on aggregated market and submarket trends; and CoStar Tenant, an online business-to-business prospecting and analytical tool that provides tenant information. The company also provides CoStar Lease Comps, a tool to capture, manage, and maintain lease data; CoStar Lease Analysis, a workflow tool; CoStar Public Record, a searchable database of commercially-zoned parcels; CoStar Real Estate Manager, a real estate and asset management, and lease accounting software; and CoStar Risk Analytics and CoStar Investment Analysis that provides market research, consulting and analysis, portfolio and debt analysis, and management and reporting services, as well as STAR Report that offers benchmarking and analytics services. In addition, it offers apartment marketing sites, such as Apartments.com, ApartmentFinder.com, ForRent.com, ApartmentHomeLiving.com, Apartamentos.com, AFTER55.com, CorporateHousing.com, ForRentUniversity.com, Westside Rentals, and Off Campus Partners; LoopNet Premium Lister; LoopNet Diamond, Platinum, and Gold Ads; LandsofAmerica, LandAndFarm, and LandWatch for rural land for-sale; BizBuySell.com, BizQuest.com, and FindaFranchise.com for operating businesses and franchises for-sale; Ten-X, an online auction platform for commercial real estate; and HomeSnap, an online and mobile software platform. The company was founded in 1987 and is headquartered in Washington, the District of Columbia.",
        "currency": "BRL",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "DC",
        "city": "Washington",
        "zipcode": "20005",
        "website": "http://www.costargroup.com",
        "full_time_employees": 4700
    },
    "CBRE": {
        "short_name": "CBRE Group Inc",
        "long_name": "CBRE Group, Inc.",
        "summary": "CBRE Group, Inc. operates as a commercial real estate services and investment company worldwide. It operates through Advisory Services, Global Workplace Solutions, and Real Estate Investments segments. The Advisory Services segment provides strategic advice and execution to owners, investors, and occupiers of real estate in connection with leasing; property sales and mortgage services under the CBRE Capital Markets brand; property and project management services, including construction management, marketing, building engineering, accounting, and financial services for owners of and investors in office, industrial, and retail properties; and valuation services that include market value appraisals, litigation support, discounted cash flow analyses, and feasibility studies, as well as consulting services, such as property condition reports, hotel advisory, and environmental consulting. The Global Workplace Solutions segment offers facilities management, project management, and transaction management services. The Real Estate Investments segment provides investment management services under the CBRE Global Investors brand to pension funds, insurance companies, sovereign wealth funds, foundations, endowments, and other institutional investors; development services under the Trammell Crow Company brand primarily to users of and investors in commercial real estate; and flexible-space solutions under the CBRE Hana brand, which includes office suites, conference rooms and event space, and communal co-working space for institutional property owners. It also develops residential-led and mixed-use sites in London under the Telford Homes brand. The company was founded in 1906 and is headquartered in Dallas, Texas.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75201",
        "website": "http://www.cbre.com",
        "full_time_employees": 100000
    },
    "CPTP": {
        "short_name": "CAPITAL PROPERTIES INC",
        "long_name": "Capital Properties, Inc.",
        "summary": "Capital Properties, Inc., together with its subsidiaries, engages in leasing land in downtown Providence, Rhode Island under long-term ground leases. It owns approximately 18 acres in the Capital Center consisting of 13 individual parcels; owns and leases Parcel 20, an undeveloped parcel of land adjacent to the Capital Center for public parking purposes on a short-term basis; and leases 23 outdoor advertising locations containing 44 billboard faces along interstate and primary highways in Rhode Island and Massachusetts. The company was formerly known as Providence and Worcester Company and changed its name to Capital Properties, Inc. in 1984. Capital Properties, Inc. was founded in 1977 and is based in Providence, Rhode Island.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "RI",
        "city": "Providence",
        "zipcode": "02903",
        "website": "http://capitalproperties.com",
        "full_time_employees": 3
    },
    "CRSS": {
        "short_name": "CROSSROADS SYSTEMS INC",
        "long_name": "Crossroads Systems, Inc.",
        "summary": "Crossroads Systems, Inc., a holding company, focuses on investing in businesses that promote economic vitality and community development. The company, through its subsidiary, Capital Plus Financial, a certified community development financial institution and certified B-Corp, supports Hispanic homeownership with a long term and fixed rate single family mortgage product. Crossroads Systems, Inc. was founded in 1996 and is based in Dallas, Texas.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75205",
        "website": "http://www.crossroads.com",
        "full_time_employees": null
    },
    "CSGP": {
        "short_name": "CoStar Group, Inc.",
        "long_name": "CoStar Group, Inc.",
        "summary": "CoStar Group, Inc. provides information, analytics, and online marketplace services to the commercial real estate, hospitality, residential, and related professionals industries in the United States, Canada, Europe, the Asia Pacific, and Latin America. It offers CoStar Property Professional that provides inventory of office, industrial, retail, and multifamily, and student housing properties and land; CoStar COMPS Professional, which covers comparable commercial real estate sales information; CoStar Market Analytics to view and report on aggregated market and submarket trends; and CoStar Tenant, an online business-to-business prospecting and analytical tool that provides tenant information. The company also provides CoStar Lease Comps, a tool to capture, manage, and maintain lease data; CoStar Lease Analysis, a workflow tool; CoStar Public Record, a searchable database of commercially-zoned parcels; CoStar Real Estate Manager, a real estate and asset management, and lease accounting software; and CoStar Risk Analytics and CoStar Investment Analysis that provides market research, consulting and analysis, portfolio and debt analysis, and management and reporting services, as well as STAR Report that offers benchmarking and analytics services. In addition, it offers apartment marketing sites, such as Apartments.com, ApartmentFinder.com, ForRent.com, ApartmentHomeLiving.com, Apartamentos.com, AFTER55.com, CorporateHousing.com, ForRentUniversity.com, Westside Rentals, and Off Campus Partners; LoopNet Premium Lister; LoopNet Diamond, Platinum, and Gold Ads; LandsofAmerica, LandAndFarm, and LandWatch for rural land for-sale; BizBuySell.com, BizQuest.com, and FindaFranchise.com for operating businesses and franchises for-sale; Ten-X, an online auction platform for commercial real estate; and HomeSnap, an online and mobile software platform. The company was founded in 1987 and is headquartered in Washington, the District of Columbia.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "DC",
        "city": "Washington",
        "zipcode": "20005",
        "website": "http://www.costargroup.com",
        "full_time_employees": 4700
    },
    "CSR-PC": {
        "short_name": "D/B/A Centerspace 6.625% Series",
        "long_name": "Investors Real Estate Trust",
        "summary": "IRET is a real estate company focused on the ownership, management, acquisition, redevelopment, and development of apartment communities. As of September 30, 2020, we owned interests in 67 apartment communities consisting of 11,910 apartment homes. IRET's common shares and Series C preferred shares are publicly traded on the New York Stock Exchange (NYSE symbols: \"IRET\" and \"IRET PC,\" respectively).",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "ND",
        "city": "Minot",
        "zipcode": "58702",
        "website": "http://www.centerspacehomes.com",
        "full_time_employees": 340
    },
    "CSR": {
        "short_name": "D/B/A Centerspace",
        "long_name": "Investors Real Estate Trust",
        "summary": "IRET is a real estate company focused on the ownership, management, acquisition, redevelopment, and development of apartment communities. As of September 30, 2020, we owned interests in 67 apartment communities consisting of 11,910 apartment homes. IRET's common shares and Series C preferred shares are publicly traded on the New York Stock Exchange (NYSE symbols: \"IRET\" and \"IRET PC,\" respectively).",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "ND",
        "city": "Minot",
        "zipcode": "58702",
        "website": "http://www.centerspacehomes.com",
        "full_time_employees": 340
    },
    "CWK": {
        "short_name": "Cushman & Wakefield plc",
        "long_name": "Cushman & Wakefield plc",
        "summary": "Cushman & Wakefield plc, together with its subsidiaries, provides commercial real estate services under the Cushman & Wakefield brand in the United States, Australia, the United Kingdom, and internationally. The company operates through Americas; Europe, Middle East, and Africa; and Asia Pacific segments. It offers integrated facilities management, project and development, portfolio administration, transaction management, and strategic consulting services; property management services, including client accounting, engineering and operations, lease compliance administration, project and development, and sustainability services; and self-performed facilities services, which include janitorial, maintenance, critical environment management, landscaping, and office services. The company also provides owner representation and tenant representation leasing services; capital market services, such as investment sales and equity, and debt and structured financing for real estate purchase and sales transactions; and appraisal management, investment management, valuation advisory, portfolio advisory, diligence advisory, dispute analysis and litigation support, financial reporting, and property and/or portfolio valuation services on real estate debt and equity decisions. Cushman & Wakefield has a strategic partnership with Vanke Service. It serves real estate owners and occupiers, such as tenants, investors, and multi-national corporations. Cushman & Wakefield plc was founded in 1784 and is headquartered in Chicago, Illinois.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Chicago",
        "zipcode": "60606",
        "website": "http://www.cushmanwakefield.com",
        "full_time_employees": 50000
    },
    "DLMI": {
        "short_name": "DIAMOND LAKE MINERALS INC",
        "long_name": "Diamond Lake Minerals, Inc.",
        "summary": "Diamond Lake Minerals, Inc. engages in land development business. It owns approximately 200 acres of land developed for resale as residential lots located in Billings, Montana. The company is based in Mukilteo, Washington.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WA",
        "city": "Mukilteo",
        "zipcode": "98275",
        "website": "http://diamondlakeminerals.com",
        "full_time_employees": null
    },
    "DPWW": {
        "short_name": "DIEGO PELLICER WORLDWIDE INC",
        "long_name": "Diego Pellicer Worldwide, Inc.",
        "summary": "Diego Pellicer Worldwide, Inc., a real estate and a consumer retail development company, acquires and leases real estate properties to licensed cannabis operators in the United States. It provides growing space, processing space, recreational and medical retail sales space, and related facilities to licensed marijuana growers, processors, dispensary, and recreational store operators. The company also operates marijuana retail stores. Diego Pellicer Worldwide, Inc. was founded in 2013 and is based in Reno, Nevada.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Reno",
        "zipcode": "89519",
        "website": "http://www.diego-pellicer.com",
        "full_time_employees": null
    },
    "EXPI.MX": {
        "short_name": "EXP WORLD HOLDINGS  INC",
        "long_name": "eXp World Holdings, Inc.",
        "summary": "eXp World Holdings, Inc. provides cloud-based real estate brokerage services for residential homeowners and homebuyers in the United States, Canada, the United Kingdom, Australia, South Africa, Portugal, France, Mexico, and India. The company facilitates buyers to search real-time property listings and sellers to list their properties through its various platforms; and provides buyers and sellers with access to a network of professionals, consumer-centric agents, and brokers. It is also involved in building 3D virtual worlds for work, education, and events; and focused on agent website and consumer real estate portal technology. In addition, the company operates SUCCESS print magazine, SUCCESS.com portal, SUCCESS newsletters, podcasts, digital training courses, and affiliated social media accounts across platforms. Further, it provides marketing, training, and other support services to its brokers and agents through proprietary technology enabled services, as well as technology and support services contracted to third parties. The company was formerly known as eXp Realty International Corporation and changed its name to eXp World Holdings, Inc. in May 2016. eXp World Holdings, Inc. was incorporated in 2008 and is based in Bellingham, Washington.",
        "currency": "MXN",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "WA",
        "city": "Bellingham",
        "zipcode": "98226",
        "website": "http://expworldholdings.com",
        "full_time_employees": 900
    },
    "EXPI": {
        "short_name": "eXp World Holdings, Inc.",
        "long_name": "eXp World Holdings, Inc.",
        "summary": "eXp World Holdings, Inc. provides cloud-based real estate brokerage services for residential homeowners and homebuyers in the United States, Canada, the United Kingdom, Australia, South Africa, Portugal, France, Mexico, and India. The company facilitates buyers to search real-time property listings and sellers to list their properties through its various platforms; and provides buyers and sellers with access to a network of professionals, consumer-centric agents, and brokers. It is also involved in building 3D virtual worlds for work, education, and events; and focused on agent website and consumer real estate portal technology. In addition, the company operates SUCCESS print magazine, SUCCESS.com portal, SUCCESS newsletters, podcasts, digital training courses, and affiliated social media accounts across platforms. Further, it provides marketing, training, and other support services to its brokers and agents through proprietary technology enabled services, as well as technology and support services contracted to third parties. The company was formerly known as eXp Realty International Corporation and changed its name to eXp World Holdings, Inc. in May 2016. eXp World Holdings, Inc. was incorporated in 2008 and is based in Bellingham, Washington.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "state": "WA",
        "city": "Bellingham",
        "zipcode": "98226",
        "website": "http://expworldholdings.com",
        "full_time_employees": 900
    },
    "FGNV": {
        "short_name": "FORGE INNOVATION DEV CORP",
        "long_name": "Forge Innovation Development Corp.",
        "summary": "Forge Innovation Development Corp., a development stage company, focuses on commercial and residential land development business in the United States. The company intends to invest in development projects; purchase and sell real estate properties; and provide property management services. It is also involved in online retail business. The company was formerly known as You-Go enterprises, LLC and changed its name to Forge Innovation Development Corp. in November 2016. Forge Innovation Development Corp. was incorporated in 2016 and is based in Jurupa Valley, California.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Jurupa Valley",
        "zipcode": "92509",
        "website": "http://www.forgecorpusa.com",
        "full_time_employees": 3
    },
    "FRPH": {
        "short_name": "FRP Holdings, Inc.",
        "long_name": "FRP Holdings, Inc.",
        "summary": "FRP Holdings, Inc. operates as a real-estate investment and development company in the United States. The company operates through four segments: Asset Management, Mining Royalty Lands, Development, and Stabilized Joint Venture. The Asset Management segment owns, leases, and manages commercial properties. The Mining Royalty Lands segment owns various properties comprising approximately 15,000 acres under lease for mining rents or royalties primarily in Florida, Georgia, and Virginia. This segment also owns an additional 160 acres of investment property in Brooksville, Florida. The Development segment owns and monitors the use of parcels of land that are in various stages of development. The Stabilized Joint Venture segment owns, leases, and manages a 305-unit residential apartment building with approximately 18,000 square feet of first floor retail space. FRP Holdings, Inc. was founded in 1986 and is based in Jacksonville, Florida.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Jacksonville",
        "zipcode": "32202",
        "website": "http://www.frpholdings.com",
        "full_time_employees": 13
    },
    "FTHM": {
        "short_name": "Fathom Holdings Inc.",
        "long_name": "Fathom Holdings Inc.",
        "summary": "Fathom Holdings Inc. provides cloud-based real estate brokerage services in the South, Atlantic, Southwest, and Western parts of the United States. The company offers access to various properties for sale or lease through its Website, www.FathomRealty.com to buyers, sellers, landlords, and tenants. It also operates intelliAgent, a real estate technology platform that is designed to provide a suite of brokerage and agent level tools, technology, business processes, business intelligence and reporting, training, customer relationship management, social media marketing, marketing repository, and marketing services, as well as marketplace for add-on services and third-party technology. Fathom Holdings Inc. was founded in 2010 and is headquartered in Cary, North Carolina.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "NC",
        "city": "Cary",
        "zipcode": "27518",
        "website": "http://www.fathomrealty.com",
        "full_time_employees": 38
    },
    "FUTL": {
        "short_name": "FUTURELAND CORP",
        "long_name": "FutureLand, Corp.",
        "summary": "FutureLand, Corp., through its subsidiary, FutureLand Properties, operates as an agricultural land lease company. It serves the industrial hemp, legal medical marijuana, and recreational cannabis markets. The company is based in Saint Petersburg, Florida.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Saint Petersburg",
        "zipcode": "33716",
        "website": null,
        "full_time_employees": 3
    },
    "GBR": {
        "short_name": "New Concept Energy, Inc",
        "long_name": "New Concept Energy, Inc.",
        "summary": "New Concept Energy, Inc. engages in real estate rental business. It owns approximately 190 acres of land located in Parkersburg West Virginia. The company was formerly known as CabelTel International Corporation and changed its name to New Concept Energy, Inc. in May 2008. The company was founded in 1978 and is based in Dallas, Texas. New Concept Energy, Inc. is a subsidiary of Arcadian Energy, Inc.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75234",
        "website": "http://www.newconceptenergy.com",
        "full_time_employees": 2
    },
    "GORL": {
        "short_name": "GORDON I REALTY CORP",
        "long_name": "Gordon (I.) Corp.",
        "summary": "Gordon (I.) Corp. operates as a commercial and residential real estate investment and management company. The company is based in Rochester, New York.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Rochester",
        "zipcode": "14614",
        "website": "http://igordon.com",
        "full_time_employees": null
    },
    "GSP.F": {
        "short_name": "COMSTOCK MINING  DL-,01",
        "long_name": "Comstock Mining Inc.",
        "summary": "Comstock Mining Inc. engages in the exploration, development, and production of mineral properties in Nevada. The company explores for gold, silver, lithium, nickel, cobalt, and mercury ores. It operates in two segments, Mining and Real Estate. The Mining segment owns and controls approximately 9,358 acres of mining claims and parcels, including approximately 2,396 acres of patented claims and surface parcels; and approximately 6,962 acres of unpatented mining claims in the Comstock and Silver City districts. It primarily focuses on exploring and developing properties in the Dayton resource areas; and Occidental and Gold Hill gold and silver mineral properties. The Real Estate segment comprises land and real estate rental properties, as well as the Gold Hill Hotel and Daney Ranch properties. Comstock Mining Inc. has collaboration agreements with Oro Industries Inc. and Mercury Clean Up, LLC for the manufacture and deployment of mercury remediation systems with proprietary mechanical, hydro, electro-chemical, and oxidation processes to reclaim and remediate mercury from soils, waste, and tailings. The company was formerly known as GoldSpring, Inc. and changed its name to Comstock Mining Inc. in July 2010. Comstock Mining Inc. was incorporated in 1999 and is headquartered in Virginia City, Nevada.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NV",
        "city": "Virginia City",
        "zipcode": "89440",
        "website": "http://www.comstockmining.com",
        "full_time_employees": 9
    },
    "GYRO": {
        "short_name": "Gyrodyne , LLC",
        "long_name": "Gyrodyne, LLC",
        "summary": "Gyrodyne, LLC. owns, leases and manages diverse commercial properties. The firm is distinguished by its service-oriented philosophy toward property ownership and management. Gyrodyne has grown from a largely Long Island player during the past into a diversified East Coast presence with an emphasis on medical office product.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Saint James",
        "zipcode": "11780",
        "website": "http://www.gyrodyne.com",
        "full_time_employees": 6
    },
    "JLL": {
        "short_name": "Jones Lang LaSalle Incorporated",
        "long_name": "Jones Lang LaSalle Incorporated",
        "summary": "Jones Lang LaSalle Incorporated, a professional services company, provides real estate and investment management services in America's, Europe, the Middle East, Africa, and the Asia Pacific. The company offers a range of real estate services, including agency leasing and tenant representation services; and capital market services, such as debt placement, loan sales, equity placement, loan servicing, funds advisory, merger and acquisition, corporate advisory, and investment sales and acquisitions services. It also provides on-site management services for office, industrial, retail, multifamily residential, and specialty properties; integrated facilities management services; designing, building, management, and consulting services to tenants of leased space, owners in self-occupied buildings, and owners of real estate investments; and advisory, consulting, and valuation services. In addition, the company provides investment management services to institutional and retail investors, including high-net-worth individuals. It offers its services to real estate owners, occupiers, investors, and developers for various property types, including cultural, educational, government, healthcare, laboratory, hotel, hospitality, and sports facilities; industrial and warehouse, office, and residential properties; retail and shopping malls; critical environment, data, transportation, and sort and fulfillment centers; infrastructure projects; and military housings. The company was formerly known as LaSalle Partners Incorporated and changed its name to Jones Lang LaSalle Incorporated in March 1999. Jones Lang LaSalle Incorporated was incorporated in 1997 and is headquartered in Chicago, Illinois.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Chicago",
        "zipcode": "60601",
        "website": "http://www.us.jll.com",
        "full_time_employees": 91000
    },
    "KW": {
        "short_name": "Kennedy-Wilson Holdings Inc.",
        "long_name": "Kennedy-Wilson Holdings, Inc.",
        "summary": "Kennedy-Wilson Holdings, Inc., together with its subsidiaries, operates as a real estate investment company. The company owns, operates, and invests in real estate both on its own and through its investment management platform. It focuses on multifamily and office properties located in the Western United States, the United Kingdom, Ireland, Spain, Italy, and Japan. As of December 31, 2020, the company had ownership interests in 10,350 multifamily units, 8.6 million square feet of commercial space, and one hotel. It is also involved in the development, redevelopment, and entitlement of real estate properties. Kennedy-Wilson Holdings, Inc. was founded in 1977 and is headquartered in Beverly Hills, California.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Beverly Hills",
        "zipcode": "90212",
        "website": "http://www.kennedywilson.com",
        "full_time_employees": 202
    },
    "LMRK": {
        "short_name": "Landmark Infrastructure Partner",
        "long_name": "Landmark Infrastructure Partners LP",
        "summary": "Landmark Infrastructure Partners LP acquires, owns, develops, and manages a portfolio of real property interests and infrastructure assets in the United States. The company leases its real property interests and infrastructure assets to companies operating in the wireless communication, digital infrastructure, outdoor advertising, and renewable power generation industries. Its real property interests primarily include long-term and perpetual easements, tenant lease assignments, fee simple properties, and infrastructure assets. The company also owns various interests in receivables associated with related assets. Landmark Infrastructure Partners GP LLC serves as the general partner of the company. Landmark Infrastructure Partners LP was incorporated in 2014 and is based in El Segundo, California.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "El Segundo",
        "zipcode": "90245",
        "website": "http://www.landmarkmlp.com",
        "full_time_employees": null
    },
    "LODE": {
        "short_name": "Comstock Mining, Inc.",
        "long_name": "Comstock Mining Inc.",
        "summary": "Comstock Mining Inc. engages in the exploration, development, and production of mineral properties in Nevada. The company explores for gold, silver, lithium, nickel, cobalt, and mercury ores. It operates in two segments, Mining and Real Estate. The Mining segment owns and controls approximately 9,358 acres of mining claims and parcels, including approximately 2,396 acres of patented claims and surface parcels; and approximately 6,962 acres of unpatented mining claims in the Comstock and Silver City districts. It primarily focuses on exploring and developing properties in the Dayton resource areas; and Occidental and Gold Hill gold and silver mineral properties. The Real Estate segment comprises land and real estate rental properties, as well as the Gold Hill Hotel and Daney Ranch properties. Comstock Mining Inc. has collaboration agreements with Oro Industries Inc. and Mercury Clean Up, LLC for the manufacture and deployment of mercury remediation systems with proprietary mechanical, hydro, electro-chemical, and oxidation processes to reclaim and remediate mercury from soils, waste, and tailings. The company was formerly known as GoldSpring, Inc. and changed its name to Comstock Mining Inc. in July 2010. Comstock Mining Inc. was incorporated in 1999 and is headquartered in Virginia City, Nevada.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Virginia City",
        "zipcode": "89440",
        "website": "http://www.comstockmining.com",
        "full_time_employees": 9
    },
    "M6M.F": {
        "short_name": "MARCUS+MILLICHAP DL-,0001",
        "long_name": "Marcus & Millichap, Inc.",
        "summary": "Marcus & Millichap, Inc., an investment brokerage company, provides real estate investment brokerage and financing services to sellers and buyers of commercial real estate in the United States and Canada. The company offers commercial real estate investment sales, financing, research, and advisory services for multifamily, retail, office, industrial, single-tenant net lease, seniors housing, self-storage, hospitality, medical office, and manufactured housing. It also operates as a financial intermediary that provides commercial real estate capital markets solutions, including senior debt, mezzanine debt, joint venture, and preferred equity, as well as loan sales and consultative/due diligence services to commercial real estate owners, developers, investors, and capital providers. In addition, the company provides various ancillary services, including research, advisory, and consulting services to developers, lenders, owners, real estate investment trusts, high net worth individuals, pension fund advisors, and other institutions. Marcus & Millichap, Inc. was founded in 1971 and is headquartered in Calabasas, California.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Calabasas",
        "zipcode": "91302",
        "website": "http://www.marcusmillichap.com",
        "full_time_employees": 764
    },
    "MAYS": {
        "short_name": "J. W. Mays, Inc.",
        "long_name": "J.W. Mays, Inc.",
        "summary": "J.W. Mays, Inc. owns, operates, and leases commercial real estate properties in the United States. Its properties are located in Brooklyn, Jamaica, Fishkill, Levittown, and Massapequa of New York, as well as Circleville of Ohio. The company was founded in 1924 and is based in Brooklyn, New York.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Brooklyn",
        "zipcode": "11201-5805",
        "website": "http://www.jwmays.com",
        "full_time_employees": 29
    },
    "MCAP": {
        "short_name": "MANGO CAPITAL INC",
        "long_name": "Mango Capital, Inc.",
        "summary": "Mango Capital, Inc. operates as a real estate holding company specializes in acquiring undervalued land and real estate properties in the United States. Mango Capital, Inc. was formerly known as MangoSoft, Inc. and changed its name to Mango Capital, Inc. in January 2011. The company was founded in 1995 and is based in Far Hills, New Jersey.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Far Hills",
        "zipcode": "07931",
        "website": "http://mangocapitalinc.com",
        "full_time_employees": 7
    },
    "MEDH": {
        "short_name": "MEDX HOLDINGS INC",
        "long_name": "MedX Holdings, Inc.",
        "summary": "MedX Holdings, Inc., a development stage company, engages in the research and development of Wearable Technology Heat. It also acquires various medical businesses through its Collaborative Profit concept. The company was formerly known as Cantor Group Inc. and changed its name to MedX Holdings, Inc. in February 2016. MedX Holdings, Inc. was founded in 2006 and is based in Cheyenne, Wyoming.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WY",
        "city": "Cheyenne",
        "zipcode": "82001",
        "website": "http://www.medxpharmaceuticals.com",
        "full_time_employees": 1
    },
    "MGAG": {
        "short_name": "MORTGAGE OIL CORP",
        "long_name": "Mortgage Oil Corp.",
        "summary": "Mortgage Oil Corp. invests in companies owning multi-family residential apartment complexes and industrial real estate in the United States. The company is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Angeles",
        "zipcode": "90017",
        "website": null,
        "full_time_employees": null
    },
    "MHPC": {
        "short_name": "MANUFACTURED HOUSING PROPERTIES",
        "long_name": "Manufactured Housing Properties Inc.",
        "summary": "Manufactured Housing Properties Inc. acquires, owns, and operates manufactured housing communities. It owns and operates nineteen manufactured housing communities containing approximately 1,235 developed sites and a total of 407 company-owned manufactured homes located in Georgia, North Carolina, South Carolina, and Tennessee. The company was founded in 2016 and is based in Pineville, North Carolina.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NC",
        "city": "Pineville",
        "zipcode": "28134",
        "website": "http://mhproperties.com",
        "full_time_employees": 21
    },
    "MLP": {
        "short_name": "Maui Land & Pineapple Company, ",
        "long_name": "Maui Land & Pineapple Company, Inc.",
        "summary": "Maui Land & Pineapple Company, Inc., together with its subsidiaries, develops, manages, and sells residential, resort, commercial, agricultural, and industrial real estate properties in the United States. The company operates through Real Estate, Leasing, and Resort Amenities segments. The Real Estate segment is involved in the land planning and entitlement, development, and sale of its landholdings on Maui. This segment also provides licensed general brokerage services for properties in the Kapalua Resort and surrounding areas. The Leasing segment leases residential, resort, commercial, agricultural, and industrial land and properties; and licenses its registered trademarks and trade names, as well as provides stewardship and conservation services. This segment also operates reservoirs and well systems that provide potable and non-potable water to West and Upcountry Maui areas. The Resort Amenities segment manages the operations of the Kapalua Club, a private, non-equity club program providing its members special programs, access, and other privileges at certain amenities at the Kapalua Resort. It owns approximately 23,000 acres of land on the island of Maui, Hawaii. Maui Land & Pineapple Company, Inc. was founded in 1909 and is based in Lahaina, Hawaii.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "HI",
        "city": "Lahaina",
        "zipcode": "96761",
        "website": "http://www.mauiland.com",
        "full_time_employees": 17
    },
    "MMI": {
        "short_name": "Marcus & Millichap, Inc.",
        "long_name": "Marcus & Millichap, Inc.",
        "summary": "Marcus & Millichap, Inc., an investment brokerage company, provides real estate investment brokerage and financing services to sellers and buyers of commercial real estate in the United States and Canada. The company offers commercial real estate investment sales, financing, research, and advisory services for multifamily, retail, office, industrial, single-tenant net lease, seniors housing, self-storage, hospitality, medical office, and manufactured housing. It also operates as a financial intermediary that provides commercial real estate capital markets solutions, including senior debt, mezzanine debt, joint venture, and preferred equity, as well as loan sales and consultative/due diligence services to commercial real estate owners, developers, investors, and capital providers. In addition, the company provides various ancillary services, including research, advisory, and consulting services to developers, lenders, owners, real estate investment trusts, high net worth individuals, pension fund advisors, and other institutions. Marcus & Millichap, Inc. was founded in 1971 and is headquartered in Calabasas, California.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Calabasas",
        "zipcode": "91302",
        "website": "http://www.marcusmillichap.com",
        "full_time_employees": 764
    },
    "MSPC": {
        "short_name": "METROSPACES INC",
        "long_name": "Metrospaces, Inc.",
        "summary": "Metrospaces, Inc. is a real estate investment firm. The firm formerly operated in designing, building, developing, managing, and selling condominiums. The firm seeks to invest in Latin America. Metrospaces, Inc. is based in Miami Florida.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Brooklyn",
        "zipcode": "11213",
        "website": "http://www.metrospaces.com",
        "full_time_employees": 3
    },
    "MSTO": {
        "short_name": "MASTERBEAT CORP",
        "long_name": "Masterbeat Corporation",
        "summary": "AudioStreet, Inc. operates as an online music community for independent artists in the United States and internationally. It offers a package that allows a band to create their presence on the Web and gain fans. The company offers MP3 download, event listings, photo galleries, message boards, merchandise storefront, music downloads, and music hosting services, as well as enables users to stream their songs and sell MP3s as digital downloads. It also provides advertising services, such as header banner and side banner advertising services to artists, fans, and music-related organizations. The company was founded in 2003 and is based in Scottsdale, Arizona.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Scottsdale",
        "zipcode": "85251",
        "website": "http://www.masterbeat.com",
        "full_time_employees": null
    },
    "NMB.F": {
        "short_name": "NEWMARK GRP CL.A DL-,01",
        "long_name": "Newmark Group, Inc.",
        "summary": "Newmark Group, Inc. provides commercial real estate services in the United States and internationally. The company's investor/owner services and products include capital markets, such as investment, debt and structured finance, and loan sales; agency leasing, property management, and valuation and advisory; and commercial real estate due diligence consulting and advisory services, as well as government sponsored enterprise lending, loan servicing, mortgage broking, and equity-raising services. Its occupier services and products comprise tenant representation; real estate management technology systems; workplace and occupancy strategy; global corporate consulting; project management; and lease administration and facilities management services. The company provides its services to commercial real estate tenants, investors, owners, occupiers, and developers. As of December 31, 2020, it operated approximately 480 offices on six continents. The company was formerly known as Newmark Knight Frank and changed its name to Newmark Group, Inc. in October 2017. Newmark Group, Inc. was founded in 1929 and is based in New York, New York.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10017",
        "website": "http://www.ngkf.com",
        "full_time_employees": 4000
    },
    "NMRK": {
        "short_name": "Newmark Group, Inc.",
        "long_name": "Newmark Group, Inc.",
        "summary": "Newmark Group, Inc. provides commercial real estate services in the United States and internationally. The company's investor/owner services and products include capital markets, such as investment, debt and structured finance, and loan sales; agency leasing, property management, and valuation and advisory; and commercial real estate due diligence consulting and advisory services, as well as government sponsored enterprise lending, loan servicing, mortgage broking, and equity-raising services. Its occupier services and products comprise tenant representation; real estate management technology systems; workplace and occupancy strategy; global corporate consulting; project management; and lease administration and facilities management services. The company provides its services to commercial real estate tenants, investors, owners, occupiers, and developers. As of December 31, 2020, it operated approximately 480 offices on six continents. The company was formerly known as Newmark Knight Frank and changed its name to Newmark Group, Inc. in October 2017. Newmark Group, Inc. was founded in 1929 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10017",
        "website": "http://www.ngkf.com",
        "full_time_employees": 4000
    },
    "OPEN": {
        "short_name": "Opendoor Technologies Inc",
        "long_name": "Opendoor Technologies Inc.",
        "summary": "Opendoor Technologies Inc. operates a digital platform for residential real estate in the United States. Its platform enables consumers to buy and sell a home online. The company was founded in 2014 and is headquartered in San Francisco, California.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94104",
        "website": "http://www.opendoor.com",
        "full_time_employees": 1048
    },
    "OPEN1.MX": {
        "short_name": "OPENDOOR TECHNOLOGIES INC",
        "long_name": "Opendoor Technologies Inc.",
        "summary": "Opendoor Technologies Inc. operates a digital platform for residential real estate in the United States. Its platform enables consumers to buy and sell a home online. The company was founded in 2014 and is headquartered in San Francisco, California.",
        "currency": "MXN",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94104",
        "website": "http://www.opendoor.com",
        "full_time_employees": 1048
    },
    "PGAI": {
        "short_name": "PGI INC",
        "long_name": "PGI Incorporated",
        "summary": "PGI Incorporated engages in the marketing and selling of real estate properties. Its land inventory includes 6 single family lots; and an approximate 7 acre parcel and other parcels of real estate consisting of easements in Citrus County, Florida, as well as owns 12 parcels of real estate covering approximately 60 acres located in Charlotte County, Florida. The company was incorporated in 1958 and is based in St. Louis, Missouri.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MO",
        "city": "Saint Louis",
        "zipcode": "63105",
        "website": "http://www.pgiincorporated.com",
        "full_time_employees": null
    },
    "PRRE": {
        "short_name": "PRAETORIAN PROPERTY INC",
        "long_name": "Praetorian Property, Inc.",
        "summary": "Praetorian Property, Inc. engages in acquiring, rehabilitating, and selling or leasing distressed properties in the United States. Its property portfolio comprises single family, multi-family, and commercial properties. The company was formerly known as Cannabis-Rx Inc. and changed its name to Praetorian Property, Inc. in September 2015. Praetorian Property, Inc. was incorporated in 2011 and is based in Scottsdale, Arizona. Praetorian Property, Inc. is a subsidiary of Miramar Investors Inc.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Scottsdale",
        "zipcode": "85258",
        "website": null,
        "full_time_employees": 2
    },
    "R6G.F": {
        "short_name": "REDFIN CORP.  DL-,001",
        "long_name": "Redfin Corporation",
        "summary": "Redfin Corporation operates as a residential real estate brokerage company in the United States and Canada. The company operates an online real estate marketplace and provides real estate services, including assisting individuals in the purchase or sell of home. It also provides title and settlement services; originates and sells mortgages; and buys and sells homes. The company was formerly known as Appliance Computing Inc. and changed its name to Redfin Corporation in May 2006. Redfin Corporation was incorporated in 2002 and is headquartered in Seattle, Washington.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "WA",
        "city": "Seattle",
        "zipcode": "98101",
        "website": "http://www.redfin.com",
        "full_time_employees": 4185
    },
    "RDCO": {
        "short_name": "REDEFY CORP",
        "long_name": "Redefy Corporation",
        "summary": "Redefy Corporation operates as a technology and data-enabled residential real estate brokerage company in the United States. It offers a range of real estate services to buy and sell residential real estate. The company was founded in 2011 and is based in Aurora, Colorado. As of March 3, 2020, Redefy Corporation operates as a subsidiary of Home Captain Inc.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Aurora",
        "zipcode": "80014",
        "website": "http://www.redefy.com",
        "full_time_employees": null
    },
    "RDFN": {
        "short_name": "Redfin Corporation",
        "long_name": "Redfin Corporation",
        "summary": "Redfin Corporation operates as a residential real estate brokerage company in the United States and Canada. The company operates an online real estate marketplace and provides real estate services, including assisting individuals in the purchase or sell of home. It also provides title and settlement services; originates and sells mortgages; and buys and sells homes. The company was formerly known as Appliance Computing Inc. and changed its name to Redfin Corporation in May 2006. Redfin Corporation was incorporated in 2002 and is headquartered in Seattle, Washington.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "WA",
        "city": "Seattle",
        "zipcode": "98101",
        "website": "http://www.redfin.com",
        "full_time_employees": 4185
    },
    "REAC": {
        "short_name": "REAC GROUP INC",
        "long_name": "REAC Group, Inc.",
        "summary": "REAC Group, Inc., through its subsidiaries, provides transportation, logistics, and warehouse distribution services for perishable and other cargo. It offers refrigerated long haul, regional, and dedicated deliveries for industries that include floral, produce, plants, dairy, poultry, and meats, as well as offers dry cargo, office space, trucking, and ocean freight services. The company is based in Pittsburgh, Pennsylvania.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Pittsburgh",
        "zipcode": "15237",
        "website": "http://reacgroupinc.com",
        "full_time_employees": null
    },
    "RF6.F": {
        "short_name": "CBRE GROUP INC. A  DL-,01",
        "long_name": "CBRE Group, Inc.",
        "summary": "CBRE Group, Inc. operates as a commercial real estate services and investment company worldwide. It operates through Advisory Services, Global Workplace Solutions, and Real Estate Investments segments. The Advisory Services segment provides strategic advice and execution to owners, investors, and occupiers of real estate in connection with leasing; property sales and mortgage services under the CBRE Capital Markets brand; property and project management services, including construction management, marketing, building engineering, accounting, and financial services for owners of and investors in office, industrial, and retail properties; and valuation services that include market value appraisals, litigation support, discounted cash flow analyses, and feasibility studies, as well as consulting services, such as property condition reports, hotel advisory, and environmental consulting. The Global Workplace Solutions segment offers facilities management, project management, and transaction management services. The Real Estate Investments segment provides investment management services under the CBRE Global Investors brand to pension funds, insurance companies, sovereign wealth funds, foundations, endowments, and other institutional investors; development services under the Trammell Crow Company brand primarily to users of and investors in commercial real estate; and flexible-space solutions under the CBRE Hana brand, which includes office suites, conference rooms and event space, and communal co-working space for institutional property owners. It also develops residential-led and mixed-use sites in London under the Telford Homes brand. The company was founded in 1906 and is headquartered in Dallas, Texas.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75201",
        "website": "http://www.cbre.com",
        "full_time_employees": 100000
    },
    "RLG.F": {
        "short_name": "COSTAR GROUP INC.  DL-,01",
        "long_name": "CoStar Group, Inc.",
        "summary": "CoStar Group, Inc. provides information, analytics, and online marketplace services to the commercial real estate, hospitality, residential, and related professionals industries in the United States, Canada, Europe, the Asia Pacific, and Latin America. It offers CoStar Property Professional that provides inventory of office, industrial, retail, and multifamily, and student housing properties and land; CoStar COMPS Professional, which covers comparable commercial real estate sales information; CoStar Market Analytics to view and report on aggregated market and submarket trends; and CoStar Tenant, an online business-to-business prospecting and analytical tool that provides tenant information. The company also provides CoStar Lease Comps, a tool to capture, manage, and maintain lease data; CoStar Lease Analysis, a workflow tool; CoStar Public Record, a searchable database of commercially-zoned parcels; CoStar Real Estate Manager, a real estate and asset management, and lease accounting software; and CoStar Risk Analytics and CoStar Investment Analysis that provides market research, consulting and analysis, portfolio and debt analysis, and management and reporting services, as well as STAR Report that offers benchmarking and analytics services. In addition, it offers apartment marketing sites, such as Apartments.com, ApartmentFinder.com, ForRent.com, ApartmentHomeLiving.com, Apartamentos.com, AFTER55.com, CorporateHousing.com, ForRentUniversity.com, Westside Rentals, and Off Campus Partners; LoopNet Premium Lister; LoopNet Diamond, Platinum, and Gold Ads; LandsofAmerica, LandAndFarm, and LandWatch for rural land for-sale; BizBuySell.com, BizQuest.com, and FindaFranchise.com for operating businesses and franchises for-sale; Ten-X, an online auction platform for commercial real estate; and HomeSnap, an online and mobile software platform. The company was founded in 1987 and is headquartered in Washington, the District of Columbia.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "DC",
        "city": "Washington",
        "zipcode": "20005",
        "website": "http://www.costargroup.com",
        "full_time_employees": 4700
    },
    "RLGY": {
        "short_name": "Realogy Holdings Corp.",
        "long_name": "Realogy Holdings Corp.",
        "summary": "Realogy Holdings Corp., through its subsidiaries, provides residential real estate services. It operates through three segments: Realogy Franchise Group, and Realogy Brokerage Group. The Realogy Franchise Group segment franchises its residential real estate brokerages under the Century 21, Coldwell Banker, Coldwell Banker Commercial, Corcoran, ERA, Sotheby's International Realty, and Better Homes and Gardens Real Estate brand names. This segment also offers lead generation and relocation services. As of December 31, 2020, this segment's real estate franchise systems and proprietary brands had approximately 20,100 offices and 320,700 independent sales agents worldwide. The Realogy Brokerage Group segment owns and operates a full-service residential real estate brokerage business under the Coldwell Banker, Corcoran, and Sotheby's International Realty brand names to assist home buyers and sellers in the listing, marketing, selling, and finding homes. As of December 31, 2020, this segment owned and operated 670 brokerage offices with approximately 53,100 independent sales agents. The Realogy Title Group segment provides title, escrow, and settlement services to real estate companies, corporations, and financial institutions. This segment also serves as an underwriter of title insurance policies in connection with residential and commercial real estate transactions. Realogy Holdings Corp. was incorporated in 2006 and is headquartered in Madison, New Jersey.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Madison",
        "zipcode": "07940",
        "website": "http://www.realogy.com",
        "full_time_employees": 9235
    },
    "RMAX": {
        "short_name": "RE/MAX Holdings, Inc.",
        "long_name": "RE/MAX Holdings, Inc.",
        "summary": "RE/MAX Holdings, Inc. operates as a franchisor of real estate and mortgage brokerage services in the United States, Canada, and internationally. It operates through three segments: Real Estate, Mortgage, and Marketing Funds. The company offers its real estate franchise services under the RE/MAX brand; and mortgage brokerage services to real estate brokers, real estate professionals, mortgage professionals, and other investors under the Motto Mortgage brand. It also provides real estate technology and marketing tools, including booj Platform, which integrates a suite of digital products that enables agents, brokers, and teams to establish and manage client relationships; First mobile app; and on-demand access to industry information and advanced training in various areas, such as distressed and luxury properties, senior clients, buyer agency, and other real estate specialty. The company was founded in 1973 and is headquartered in Denver, Colorado.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Denver",
        "zipcode": "80237",
        "website": "http://www.remax.com",
        "full_time_employees": 545
    },
    "RMR": {
        "short_name": "The RMR Group Inc.",
        "long_name": "The RMR Group Inc.",
        "summary": "The RMR Group Inc., through its subsidiary, The RMR Group LLC, provides business and property management services in the United States. It provides management services to its four publicly traded real estate investment trusts (REITs) and three real estate operating companies. As of September 30, 2020, it had approximately 2,100 properties in 47 states under management, which are primarily owned by the Managed Equity REITs. It also provides investment advisory services. The company was formerly known as REIT Management & Research Inc. and changed its name to The RMR Group Inc. in September 2015. The RMR Group Inc. was founded in 1986 and is headquartered in Newton, Massachusetts.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "MA",
        "city": "Newton",
        "zipcode": "02458-1634",
        "website": "http://www.rmrgroup.com",
        "full_time_employees": 600
    },
    "SDAD": {
        "short_name": "S H RES & DEV CORP",
        "long_name": "SH Resources & Development Corp.",
        "summary": "SH Resources & Development Corp. operates in the specialty finance industry. The company is based in Beverly Hills, California.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Beverly Hills",
        "zipcode": "90210",
        "website": null,
        "full_time_employees": null
    },
    "STHC": {
        "short_name": "SOUTHCORP CAPITAL INC",
        "long_name": "SouthCorp Capital, Inc.",
        "summary": "SouthCorp Capital, Inc. focuses on acquiring, renovating, and reselling single-family and mutli-family properties in the United States. It also focuses on acquiring commercial and industrial properties. The company was founded in 2014 and is based in Beverly Hills, California.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Beverly Hills",
        "zipcode": "90212",
        "website": null,
        "full_time_employees": null
    },
    "TAYO": {
        "short_name": "TAYLOR CONSULTING INC.",
        "long_name": "Taylor Consulting, Inc.",
        "summary": "Taylor Consulting, Inc. invests in, acquires, and operates real estate properties in the United States. It operates through two segments, Real Estate Investing and Real Estate Brokerage Services. The company operates a self-storage facility in Merkel, Texas; and holds properties for resale located in Nolan and Taylor Counties, Texas. It also operates as a real estate broker. The company was founded in 2012 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77027",
        "website": null,
        "full_time_employees": null
    },
    "TCI": {
        "short_name": "Transcontinental Realty Investo",
        "long_name": "Transcontinental Realty Investors, Inc.",
        "summary": "Transcontinental Realty Investors, Inc., a Dallas-based real estate investment company, holds a diverse portfolio of equity real estate located across the U.S., including apartments, office buildings, shopping centers, and developed and undeveloped land. The Company invests in real estate through direct ownership, leases and partnerships and invests in mortgage loans on real estate.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75234",
        "website": "http://www.transconrealty-invest.com",
        "full_time_employees": null
    },
    "TPRP": {
        "short_name": "TOWER PROPERTIES COMPANY",
        "long_name": "Tower Properties Company",
        "summary": "Tower Properties Company engages in owning, developing, leasing, and managing real property. It owns office buildings, apartment complexes, a warehouse/office facility, and land held for future sale or development. The company's property portfolio is primarily located in located in Douglas and Johnson counties in Kansas, and Clay and St. Louis counties in Missouri. Tower Properties Company is based in Kansas City, Missouri.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MO",
        "city": "Kansas City",
        "zipcode": "64106",
        "website": "http://www.towerproperties.com",
        "full_time_employees": 51
    },
    "UBYH": {
        "short_name": "UBUYHOLDINGS INC",
        "long_name": "UBuyHoldings, Inc.",
        "summary": "UBuyHoldings, Inc., formerly E-Pawn.Com, Inc., operated as an applications service provider, as of November 30, 2000. It developed software for networking and providing e-commerce platforms for the sale of products and services through the Internet.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Coral Springs",
        "zipcode": "33065",
        "website": null,
        "full_time_employees": null
    },
    "USNL": {
        "short_name": "US NATIONAL TELECOM INC FLA",
        "long_name": "U.S. National Telecom, Inc.",
        "summary": "U.S. National Telecom, Inc. does not have significant operations. It focuses on various acquisitions in the real estate market through a combination of capital raises. The company was formerly known as Yi Wan Group, Inc. and changed its name to U.S. National Telecom, Inc. in September 2007. U.S. National Telecom was founded in 1999 and is based in Miami, Florida.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Miami",
        "zipcode": "33131",
        "website": "http://www.usnationaltelecom.com",
        "full_time_employees": 1
    },
    "VTNA": {
        "short_name": "VETANOVA INC",
        "long_name": "VetaNova Inc.",
        "summary": "VetaNova Inc. engages in the process of identifying properties to purchase, rehabilitate, and lease to tenants. The company is based in Denver, Colorado. As of June 19, 2020, VetaNova Inc. operates as a subsidiary of VitaNova Partners, LLC.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Denver",
        "zipcode": "80206",
        "website": "http://vtanva.com",
        "full_time_employees": null
    },
    "WCHS": {
        "short_name": "WINCHESTER HLDG GROUP",
        "long_name": "Winchester Holding Group",
        "summary": "Winchester Holding Group, a development stage company, focuses on acquiring and operating rental real estate properties. It intends to acquire single and multi-family real estate and real estate related-assets in the greater Chicago metropolitan area, including Northern Indiana. The company was founded in 2011 and is based in Chicago, Illinois.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Chicago",
        "zipcode": "60643",
        "website": null,
        "full_time_employees": 2
    },
    "XMEX": {
        "short_name": "XEMEX GROUP INC",
        "long_name": "Xemex Group, Inc.",
        "summary": "Xemex Group, Inc., an integrated real estate services company, develops, owns, manages, and operates residential and commercial development properties. The company focuses primarily on commercial real estate ventures. It offers services in the areas of deal origination, development and construction management, condo conversions, and joint ventures. The company also provides property management services, such as the operation, control, and oversight of real estate. In addition, it offers asset management services, including deploying, operating, maintaining, upgrading, and disposing of assets. Xemex Group, Inc. was formerly known as Envirokare Tech, Inc. and changed its name to Xemex Group, Inc. in July 2010. The company was founded in 1998 and is based in Brooklyn, New York.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Brooklyn",
        "zipcode": "11217",
        "website": "http://www.xemexgroup.com",
        "full_time_employees": 2
    },
    "XXFPL": {
        "short_name": "FFP PARTNERS",
        "long_name": "FFP Partners, L.P.",
        "summary": "FFP Partners, L.P. operates as a limited partnership firm. Its sole general partner is FFP Real Estate Trust whose real properties are owned, and its rental activities are conducted, by FFP Properties, its operating subsidiary. The company owns a 60% partnership interest in FFP Properties and serves as its sole general partner. FFP Partners was founded in 1986.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Fort Worth",
        "zipcode": "76117",
        "website": null,
        "full_time_employees": 2
    }
}