{
    "BRER": {
        "short_name": "BRESLER & REINER INC",
        "long_name": "Bresler & Reiner, Inc.",
        "summary": "Bresler & Reiner, Inc. acquires, develops, and owns commercial, residential, and hospitality real estate in the United States. The company was incorporated in 1970 and is based in Rockville, Maryland. It has operations in the Philadelphia, Pennsylvania; Wilmington, Delaware; Delaware and Maryland Eastern Shore; Baltimore, Maryland; Washington, D.C.; Houston, Texas; and the Tampa and Orlando, Florida.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MD",
        "city": "Rockville",
        "zipcode": "20852",
        "website": "http://www.breslerandreiner.com",
        "market_cap": 3834050
    },
    "BTLN": {
        "short_name": "BRIGHTLANE CORP",
        "long_name": "Brightlane Corp.",
        "summary": "Brightlane Corp. focuses on acquiring, renovating, managing, and leasing low priced single-family homes primarily in the United States. Brightlane Corp. is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77056",
        "website": "http://brightlanecorp.com",
        "market_cap": 2421248
    },
    "CBYI": {
        "short_name": "CAL-BAY INTERNATIONAL",
        "long_name": "Cal Bay International, Inc.",
        "summary": "Cal Bay International, Inc. engages in the acquisition, development, management, sale, and rental of commercial or residential properties in the United States. It also provides consulting services to individuals and/or businesses. The company was formerly known as Cal-Bay Controls, Inc. and changed its name to Cal Bay International, Inc. in March 2001. Cal Bay International, Inc. was founded in 1998 and is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89128",
        "website": null,
        "market_cap": 5448
    },
    "CHCI": {
        "short_name": "Comstock Holding Companies, Inc",
        "long_name": "Comstock Holding Companies, Inc.",
        "summary": "Comstock Holding Companies, Inc. develops, operates, and manages properties in the greater Washington, D.C. metropolitan area. The company operates through two segments, Asset Management and Real Estate Services. The Asset Management segment provides management services to a range of real estate owners and businesses that include various commercial real estate uses, including apartments, hotels, office buildings, commercial garages, leased lands, retail stores, mixed-use developments, and urban transit-oriented developments. The Real Estate Services segment provides a range of real estate services in the areas of strategic corporate planning, capital markets, brokerage services, and environmental and design-based services in the Mid-Atlantic Region. Its environmental services group offers consulting and engineering services, environmental studies, remediation services and site-specific solutions for projects. The company was formerly known as Comstock Homebuilding Companies, Inc. and changed its name to Comstock Holding Companies, Inc. in June 2012. Comstock Holding Companies, Inc. was founded in 1985 and is headquartered in Reston, Virginia.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Reston",
        "zipcode": "20190",
        "website": "http://www.comstockcompanies.com",
        "market_cap": 50795216
    },
    "CHO1.F": {
        "short_name": "COMSTOCK HLDG COS A DL-01",
        "long_name": "Comstock Holding Companies, Inc.",
        "summary": "Comstock Holding Companies, Inc. develops, operates, and manages properties in the greater Washington, D.C. metropolitan area. The company operates through two segments, Asset Management and Real Estate Services. The Asset Management segment provides management services to a range of real estate owners and businesses that include various commercial real estate uses, including apartments, hotels, office buildings, commercial garages, leased lands, retail stores, mixed-use developments, and urban transit-oriented developments. The Real Estate Services segment provides a range of real estate services in the areas of strategic corporate planning, capital markets, brokerage services, and environmental and design-based services in the Mid-Atlantic Region. Its environmental services group offers consulting and engineering services, environmental studies, remediation services and site-specific solutions for projects. The company was formerly known as Comstock Homebuilding Companies, Inc. and changed its name to Comstock Holding Companies, Inc. in June 2012. Comstock Holding Companies, Inc. was founded in 1985 and is headquartered in Reston, Virginia.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "VA",
        "city": "Reston",
        "zipcode": "20190",
        "website": "http://www.comstockcompanies.com",
        "market_cap": 49139028
    },
    "CWNR": {
        "short_name": "CROSSWIND RENEWABLE ENERGY CORP",
        "long_name": "Community Redevelopment Inc.",
        "summary": "Community Redevelopment Inc. operates as a developer of mixed use commercial and multifamily residential communities in the continental United States. The company was formerly known as Crosswind Renewable Energy Corp. and changed its name to Community Redevelopment Inc. in June 2020. Community Redevelopment Inc. was incorporated in 2010 and is based in Aventura, Florida.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Aventura",
        "zipcode": "33180",
        "website": "http://comredev.com",
        "market_cap": 42922604
    },
    "ECDP": {
        "short_name": "ECO DEPOT INC",
        "long_name": "Eco Depot Inc.",
        "summary": "Eco Depot Inc., a development stage company, focuses on the distribution of environmental friendly and green energy products, building and construction materials, and home products worldwide. The company is also involved in the development, manufacture, and distribution of LED lighting systems and related products for use in offices, supermarkets, schools, factories, municipal streets, healthcare organizations, retail stores, and gas stations. Its LED lighting products include indoor T-bar flat LED light products, high-bay lighting systems, road/highway LED light products, and area security LED light products. The company markets its LED products through a network of distributors and in-house sales representatives in North America. Eco Depot Inc. was founded in 2004 and is headquartered in Pensacola, Florida.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Pensacola",
        "zipcode": "32501",
        "website": "http://www.ecodepot.co",
        "market_cap": 105185
    },
    "FTPM": {
        "short_name": "420 PPTY MGMT INC",
        "long_name": "420 Property Management, Inc.",
        "summary": "420 Property Management, Inc. engages in real estate development and property management activities in the cannabis and hemp industry. The company acquires strategically zoned, high traffic commercial corridors, and prime agricultural properties for the cannabis, hemp, and legal marijuana industries. It also manages and leases a portfolio of agricultural, retail, commercial, and industrial properties in California; and acquires, develops, manages construction, markets, and leases retail, commercial and agricultural revenue-producing properties for the cannabis, hemp, and legal marijuana industry use. In addition, the company provides machinery, tools, and infrastructure for cannabis, hemp, and marijuana industries. The company was formerly known as Digagogo Ventures Corp. and changed its name to 420 Property Management, Inc. in October 2015. 420 Property Management, Inc. is based in Carlsbad, California.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Carlsbad",
        "zipcode": "92008",
        "website": "http://420prop.com",
        "market_cap": 557500
    },
    "GDVTZ": {
        "short_name": "GOULD INVESTORS L P",
        "long_name": "Gould Investors L.P.",
        "summary": "Gould Investors L.P. owns and operates a portfolio of real estate assets in the United States. Its real estate assets include office and professional buildings, apartment buildings, shopping centers, mixed-use properties, cooperative and condominium apartments, industrial facilities, and single tenant retail properties. The company has investments in publicly traded and private entities in related fields. It also provides various services that include locating and evaluating potential acquisitions, market area analyses and feasibility studies, renovation, leasing and/or repositioning of commercial and residential properties, property management, property and apartment sales, and formulating acquisition and disposition strategies. Gould Investors L.P. was incorporated in 1985 and is based in Great Neck, New York. The company has properties in Connecticut, District of Columbia, Florida, Iowa, Maryland, Massachusetts, New York, North Carolina, Pennsylvania, and Texas.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Great Neck",
        "zipcode": "11021",
        "website": "http://www.gouldlp.com",
        "market_cap": 485760000
    },
    "HGPI": {
        "short_name": "HORIZON GROUP PROPERTIES INC",
        "long_name": "Horizon Group Properties, Inc.",
        "summary": "Horizon Group Properties, Inc. is a publicly owned real estate investment trust. The firm engages in the ownership, operation, and development of shopping centers in the United States. It operates through a subsidiary, Horizon Group Properties LP. Horizon Group Properties was founded in 1998 and is based in Rosemont, Illinois with additional offices in Muskegon, Michigan and Chicago, Illinois. Horizon Group Properties Inc. (OTCPK: HGPI) operates independently of Prime Retail Inc. as of June 17, 1998.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Rosemont",
        "zipcode": "60018",
        "website": "http://www.horizongroup.com",
        "market_cap": 11723888
    },
    "HHC": {
        "short_name": "Howard Hughes Corporation (The)",
        "long_name": "The Howard Hughes Corporation",
        "summary": "The Howard Hughes Corporation owns, manages, and develops commercial, residential, and hospitality operating properties in the United States. It operates through four segments: Operating Assets; Master Planned Communities (MPCs); Seaport District; and Strategic Developments. As of December 31, 2020, the Operating Assets segment owned 15 retail, 33 office, 12 multi-family, 3 hospitality, and 13 other operating assets and investments primarily located in The Woodlands, Texas; Chicago, Illinois; Columbia, Maryland; Las Vegas, Nevada; and Honolulu, Hawaii. The MPCs segment develops and sells detached and attached single family homes, and range from entry-level to luxury homes to residential homebuilders and developers; and sells or leases land for commercial development, including land parcels designated for retail, office, hospitality, and residential projects. The Seaport District segment is involved in the landlord operations, managed businesses, and events and sponsorships. The Strategic Development segment invests in residential condominium and commercial property projects. This segment consists of 18 development or redevelopment projects. The Howard Hughes Corporation was founded in 2010 and is headquartered in Dallas, Texas.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75240",
        "website": "http://www.howardhughes.com",
        "market_cap": 5864713728
    },
    "HHE.F": {
        "short_name": "HOWARD HUGHES CORP.DL-,01",
        "long_name": "The Howard Hughes Corporation",
        "summary": "The Howard Hughes Corporation owns, manages, and develops commercial, residential, and hospitality operating properties in the United States. It operates through four segments: Operating Assets; Master Planned Communities (MPCs); Seaport District; and Strategic Developments. As of December 31, 2020, the Operating Assets segment owned 15 retail, 33 office, 12 multi-family, 3 hospitality, and 13 other operating assets and investments primarily located in The Woodlands, Texas; Chicago, Illinois; Columbia, Maryland; Las Vegas, Nevada; and Honolulu, Hawaii. The MPCs segment develops and sells detached and attached single family homes, and range from entry-level to luxury homes to residential homebuilders and developers; and sells or leases land for commercial development, including land parcels designated for retail, office, hospitality, and residential projects. The Seaport District segment is involved in the landlord operations, managed businesses, and events and sponsorships. The Strategic Development segment invests in residential condominium and commercial property projects. This segment consists of 18 development or redevelopment projects. The Howard Hughes Corporation was founded in 2010 and is headquartered in Dallas, Texas.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75240",
        "website": "http://www.howardhughes.com",
        "market_cap": 4885261824
    },
    "HOOB": {
        "short_name": "HOLOBEAM INC",
        "long_name": "Holobeam, Inc.",
        "summary": "Holobeam, Inc. engages in the rental and development of real estate properties in New Jersey. As of September 30, 2006, it leased two buildings for retail use. The company was founded in 1967 and is headquartered in Ho-Ho-Kus, New Jersey.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Ho-Ho-Kus",
        "zipcode": "07423",
        "website": null,
        "market_cap": 2762328
    },
    "IDVV": {
        "short_name": "INTERNATIONAL ENDEAVORS CORP",
        "long_name": "International Endeavors Corp",
        "summary": "International Endeavors Corp creates, manufactures, and markets technology for the cannabis industry. It focuses on building patented technology that supports the rapid deployment of agricultural infrastructure and the equipment needed for the medical marijuana and legal cannabis industry. The company was founded in 2014 and is based in Temecula, California.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Temecula",
        "zipcode": "92590",
        "website": "http://www.internationalendeavorscorp.com",
        "market_cap": 684549
    },
    "JOE.F": {
        "short_name": "ST JOE CO.  DL 100",
        "long_name": "The St. Joe Company",
        "summary": "The St. Joe Company, together with its subsidiaries, operates as a real estate development, asset management, and operating company in Northwest Florida, the United States. It operates through three segments: Residential, Hospitality, and Commercial. The Residential segment plans and develops residential communities of various sizes for homebuilders or retail consumers. It primarily sells developed homesites and parcels of entitled undeveloped land. The Hospitality segment owns and operates a private membership club, golf courses, beach clubs, retail outlets, marinas, and other entertainment assets. This segment also engages in the hotel, food and beverage, and gulf-front vacation rental operations, as well as provides management services. The Commercial segment engages in leasing of commercial property, multi-family, a senior living community, and other assets. This segment also plans, develops, entitles, manages, and sells commercial land holdings for retail, office, hotel, assisted-living, multi-family, and industrial uses; and grows and sells pulpwood, saw timber, and other forest products. The company owns 171,000 acres of land in Northwest Florida. The St. Joe Company was founded in 1936 and is based in Panama City Beach, Florida.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "FL",
        "city": "Panama City Beach",
        "zipcode": "32407",
        "website": "http://www.joe.com",
        "market_cap": 2378518528
    },
    "JOE": {
        "short_name": "St. Joe Company (The)",
        "long_name": "The St. Joe Company",
        "summary": "The St. Joe Company, together with its subsidiaries, operates as a real estate development, asset management, and operating company in Northwest Florida, the United States. It operates through three segments: Residential, Hospitality, and Commercial. The Residential segment plans and develops residential communities of various sizes for homebuilders or retail consumers. It primarily sells developed homesites and parcels of entitled undeveloped land. The Hospitality segment owns and operates a private membership club, golf courses, beach clubs, retail outlets, marinas, and other entertainment assets. This segment also engages in the hotel, food and beverage, and gulf-front vacation rental operations, as well as provides management services. The Commercial segment engages in leasing of commercial property, multi-family, a senior living community, and other assets. This segment also plans, develops, entitles, manages, and sells commercial land holdings for retail, office, hotel, assisted-living, multi-family, and industrial uses; and grows and sells pulpwood, saw timber, and other forest products. The company owns 171,000 acres of land in Northwest Florida. The St. Joe Company was founded in 1936 and is based in Panama City Beach, Florida.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Panama City Beach",
        "zipcode": "32407",
        "website": "http://www.joe.com",
        "market_cap": 2696229632
    },
    "LAACZ": {
        "short_name": "LAACO LTD",
        "long_name": "LAACO, Ltd.",
        "summary": "LAACO, Ltd. is a California limited acquires, develops, builds, and manages self-storage facilities in the southwestern United States. It offers storage spaces for rent, on a month-to-month basis for personal and business uses. The company also owns land, buildings, and marina facilities, which include the Los Angeles Athletic Club (LAAC), a membership club consisting of athletic facilities, food and beverage operations, and a 72-room hotel; and California Yacht Club, a membership club consisting of sports facilities, food and beverage operations, and a 350-slip marina. In addition, it has interests in three parking facilities located adjacent to the LAAC building. As of December 31, 2013, the company had direct and indirect equity interests in 48 self-storage facilities under Storage West trade name in Southern California, Arizona, Nevada, and Texas. LAACO, Ltd. was founded in 1986 and is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Angeles",
        "zipcode": "90014",
        "website": "http://www.storagewest.com",
        "market_cap": 494500000
    },
    "MNPP": {
        "short_name": "MERCHANTS NATIONAL PROPERTIES I",
        "long_name": "Merchants' National Properties, Inc.",
        "summary": "Merchants' National Properties, Inc. owns, manages, develops, and leases various commercial real estate properties in the United States. Its asset portfolio includes shopping centers, office buildings, and other commercial real estate properties. The company also invests in various real estate ventures. It holds interests in 67 properties in 17 states across the continental United States. The company was incorporated in 1928 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10017",
        "website": "http://www.marxrealty.com",
        "market_cap": 142387920
    },
    "NEN": {
        "short_name": "New England Realty Associates L",
        "long_name": "New England Realty Associates Limited Partnership",
        "summary": "New England Realty Associates Limited Partnership engages in acquiring, developing, holding for investment, operating, and selling real estate properties in the United States. It owns and operates various residential apartments, condominium units, and commercial properties located in Massachusetts and New Hampshire. As of February 1, 2021, the company owned 2,892 residential apartment units in 25 residential and mixed-use complexes, and 19 condominium units in a residential condominium complex located primarily in the metropolitan Boston area of Massachusetts. It also owned a commercial shopping center in Framingham, Massachusetts; one commercial building in Newton and one in Brookline, Massachusetts; commercial space in mixed-use buildings in Boston, Brockton and Newton, and Massachusetts; and 40% to 50% ownership interest in seven residential and mixed use complexes with a total of 688 residential units, one commercial unit, and a 50 car parking lot. NewReal, Inc. serves as the general partner of the company. New England Realty Associates Limited Partnership was incorporated in 1977 and is headquartered in Allston, Massachusetts.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "state": "MA",
        "city": "Allston",
        "zipcode": "02134",
        "website": "http://www.thehamiltoncompany.com",
        "market_cap": 233407536
    },
    "NIHK": {
        "short_name": "VIDEO RIVER NETWORKS INC",
        "long_name": "Video River Networks, Inc.",
        "summary": "Video River Networks, Inc., a technology holding company, operates and manages a portfolio of electric vehicles, artificial intelligence, machine learning, and robotics asset businesses and operations in North America. The company's target portfolio businesses and assets include operations that design, manufacture, install, and sell power controls, battery and wireless technologies, residential utility meters and remotes, and mission-critical devices. It also holds interests in companies, which designs and builds all-electric SOLO, Tofino all-electric sport coupe products, electric components, drivetrains, and zero-emissions vehicles. The company was formerly known as Nighthawk Systems, Inc. and changed its name to Video River Networks, Inc. in March 2011. Video River Networks, Inc. is based in Torrance, California.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Torrance",
        "zipcode": "90501",
        "website": null,
        "market_cap": 8540256
    },
    "PCLI": {
        "short_name": "PROTOCALL TECHNOLOGIES INC",
        "long_name": "Protocall Technologies Inc.",
        "summary": "Protocall Technologies Inc. develops and commercializes an electronic sell-through platform that enables retailers to produce DVD movie, consumer software, and video game products in retail packaging at their stores and Website distribution centers. It offers TitleMatch DVD On-Demand, which offers retailers a virtual inventory of digital media products, which can be produced on-demand, thereby eliminating the cost of physical inventories. The company also uses its solutions to provide outsourced fulfillment services to Web retailers whereby digital media product orders are electronically routed to the company for on-demand production and shipment to the retailer's customer. Protocall Technologies Inc. was founded in 1992 and is based in Panama City Beach, Florida.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Panama City Beach",
        "zipcode": "32407",
        "website": null,
        "market_cap": 182084
    },
    "PLFF": {
        "short_name": "ORPHEUM PROPERTY INC",
        "long_name": "Orpheum Property, Inc.",
        "summary": "Orpheum Property, Inc. engages in the development and renovation of commercial property. It also leases space. The company was founded in 1994 and is based in New Orleans, Louisiana.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "LA",
        "city": "New Orleans",
        "zipcode": "70170",
        "website": null,
        "market_cap": 14327014
    },
    "STRS": {
        "short_name": "Stratus Properties Inc.",
        "long_name": "Stratus Properties Inc.",
        "summary": "Stratus Properties Inc., a real estate company, engages in the acquisition, entitlement, development, management, and sale of commercial, and multi-and single-family residential real estate properties primarily in Texas. The company operates in four segments: Real Estate Operations, Leasing Operations, Hotel, and Entertainment. Its leasing operations cover lease of space at retail and mixed-use properties; and residences in multi-family apartment complexes. The company also operates hotel under the W Austin hotel name that includes 251 luxury rooms and suites; restaurant and bars; a full-service spa; fitness center; pool and outdoor terraces; and meeting and banquet spaces. In addition, it operates entertainment space that includes 2,750-seats live music, entertainment venue, and production studio; and hosts concerts and private events. Stratus Properties Inc. was incorporated in 1992 and is headquartered in Austin, Texas.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Austin",
        "zipcode": "78701-3955",
        "website": "http://www.stratusproperties.com",
        "market_cap": 285566784
    },
    "TPHS": {
        "short_name": "Trinity Place Holdings Inc.",
        "long_name": "Trinity Place Holdings Inc.",
        "summary": "Trinity Place Holdings Inc. operates as a real estate holding, investment, development, and asset management company in the United States. The company's principal asset is located at 77 Greenwich Street in Lower Manhattan. It also owns a property occupied by a retail tenant in Paramus, New Jersey. The company also controls various intellectual property assets focused on the consumer sector, including FilenesBasement.com, its rights to the Stanley Blacker brand, as well as the intellectual property associated with the running of the Brides event and An Educated Consumer. Trinity Place Holdings Inc. was founded in 1959 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10173",
        "website": "http://tphs.com",
        "market_cap": 67162392
    },
    "VINO": {
        "short_name": "Gaucho Group Holdings, Inc.",
        "long_name": "Gaucho Group Holdings, Inc.",
        "summary": "Gaucho Group Holdings, Inc., through its subsidiaries, invests in, develops, and operates real estate projects in Argentina. The company also owns and operates Algodon Mansion, a luxury boutique hotel in Buenos Aires; and Algodon Wine Estates, a winery and golf resort with tennis courts, dining, and hotel amenities in Mendoza, as well as subdivides property for residential development. In addition, it distributes and sells high-end luxury fashion products and accessories through an e-commerce platform. The company was formerly known as Algodon Group, Inc. and changed its name to Gaucho Group Holdings, Inc. in March 2019. Gaucho Group Holdings, Inc. was incorporated in 1999 and is based in Miami Beach, Florida.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Miami Beach",
        "zipcode": "33139",
        "website": "http://www.gauchoholdings.com",
        "market_cap": 27959342
    },
    "YRIV": {
        "short_name": "YANGTZE RIVER PORT & LOGISTICS ",
        "long_name": "Yangtze River Port and Logistics Limited",
        "summary": "Yangtze River Port and Logistics Limited, through its subsidiary, Wuhan Yangtze River Newport Logistics Co., Ltd., primarily engages in the real estate and infrastructural development business in the People's Republic of China. It operates Wuhan Yangtze River Newport Logistics Center, a port logistics center located in Wuhan Newport Yangluo Port, Hubei Province of China. The company was formerly known as Yangtze River Development Limited and changed its name to Yangtze River Port and Logistics Limited in February 2018. Yangtze River Port and Logistics Limited is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10038",
        "website": "http://www.yerr.com.cn",
        "market_cap": 11669384
    },
    "ZDPY": {
        "short_name": "ZONED PROPERTIES INC",
        "long_name": "Zoned Properties, Inc.",
        "summary": "Zoned Properties, Inc., a real estate development firm, owns, develops, and leases a portfolio of commercial properties in the United States. It primarily provides specialized real estate and sustainability services for clients in the regulated cannabis industry; and advisory services related to commercial properties. The company was formerly known as Vanguard Minerals Corporation and changed its name to Zoned Properties Inc. in October 2013. Zoned Properties Inc. was incorporated in 2003 and is headquartered in Scottsdale, Arizona.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Scottsdale",
        "zipcode": "85260",
        "website": "http://www.zonedproperties.com",
        "market_cap": 7527730
    }
}