{
    "HBAN.MX": {
        "short_name": "HUNTINGTON BANCSHARES INC",
        "long_name": "Huntington Bancshares Incorporated",
        "summary": "Huntington Bancshares Incorporated operates as a holding company for The Huntington National Bank that provides commercial, small business, consumer, and mortgage banking services. The company operates through four business segments: Consumer and Business Banking, Commercial Banking, Vehicle Finance, and Regional Banking and The Huntington Private Client Group (RBHPCG). The Consumer and Business Banking segment offers financial products and services, such as checking accounts, savings accounts, money market accounts, certificates of deposit, consumer loans, mortgage loans, credit cards, and small business loans, as well as investment products. It also provides insurance, interest rate risk protection, foreign exchange, and treasury management services, as well as online, mobile, and telephone banking services. The Commercial Banking segment offers banking solutions and asset finance services; corporate risk management services; institutional sales, trading, and underwriting services; institutional corporate banking services; treasury management services; and other financing solutions, as well as lends real estate developers, REITs, and other customers. The Vehicle Finance segment provides financing to consumers for the purchase of automobiles, light-duty trucks, recreational vehicles, and marine craft at franchised and other select dealerships, as well as to franchised dealerships for the acquisition of new and used inventory. The RBHPCG segment provides deposits, lending, banking, wealth management, investment and portfolio management, fiduciary administration, trust, retirement plan, and institutional and mutual fund custody services. As of January 23, 2020, the company operated through 868 full-service branches, including 12 private client group offices, and 1,448 automated teller machines located in 7 Midwestern states. Huntington Bancshares Incorporated was founded in 1866 and is headquartered in Columbus, Ohio.",
        "currency": "MXN",
        "sector": "Financial",
        "industry": "Regional - Midwest Banks",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Columbus"
    },
    "SIVB.MX": {
        "short_name": "SVB FINANCIAL GROUP",
        "long_name": "SVB Financial Group",
        "summary": "SVB Financial Group, a diversified financial services company, provides various banking and financial products and services. The company operates through four segments: Global Commercial Bank, SVB Private Bank, SVB Capital, and SVB Leerink. The Global Commercial Bank segment offers deposit products, such as business and analysis checking, money market, multi-currency, in-country bank, and sweep accounts, as well as merchant, remote capture, lockbox, electronic deposit capture, and fraud control services; credit products and services comprising term loans, equipment loans, asset-based loans, revolving lines of credit, accounts-receivable-based lines of credit, capital call lines of credit, and credit cards; and payment and cash management products and services, including wire transfer and automated clearing house payment, bill pay, debit and credit cards, account analysis, and disbursement, as well as online and mobile banking services. This segment also provides foreign exchange services; export, import, and standby letter of credit; investment services and solutions; investment advisory services; vineyard development loans; and debt fund investment services. The SVB Private Bank segment offers private banking services, such as mortgages, home equity and capital call lines of credit, restricted stock purchase loans, and other secured and unsecured lending products, as well as cash and wealth management services. The SVB Capital segment provides venture capital investment services that manage funds on behalf of third party limited partner investors. The SVB Leerink segment engages in equity and convertible capital markets, mergers and acquisitions, equity research and sales, trading, and investment banking services. It operates through 30 offices in the United States; and offices in Canada, the United Kingdom, Israel, Germany, Denmark, India, Hong Kong, and China. SVB Financial Group was founded in 1983 and is headquartered in Santa Clara, California.",
        "currency": "MXN",
        "sector": "Financial",
        "industry": "Regional - Midwest Banks",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Santa Clara"
    }
}