{
    "PCPZ": {
        "short_name": "LEEWARD GROUP HLDGS INC",
        "long_name": "Leeward Group Holdings Inc.",
        "summary": "Leeward Group Holdings Inc. provides retail insurance agency and risk consulting services in the United States. The company sells various categories of insurance products to commercial, professional, and individual customers, which include property insurance relating to physical damage to property; casualty insurance relating to legal liabilities, workers' compensation, and commercial and private passenger automobile coverages; and fidelity and surety bonds. It also sells and services group and individual life, accident, disability, health, hospitalization, medical, and dental insurance products. In addition, the company provides specialty products and services to associations, industries, and businesses, which comprise umbrella insurance policies for limited service franchise hotels and motels; personal umbrella insurance for lawyers; and mobile phone insurance program for telecommunications companies, which offers coverage for the loss, theft, or accidental damage of cell phones. Further, it creates and administers risk management services, such as reinsurance brokerage. The company distributes its products through retail agencies and insurance producers, as well as insurance programs through non-affiliated insurance agencies and associations. Leeward Group Holdings Inc. is headquartered in Pennington, New Jersey.",
        "currency": "USD",
        "sector": "Services",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Pennington"
    },
    "PERL": {
        "short_name": "PERLA GROUP INTERN",
        "long_name": "Perla Group International, Inc.",
        "summary": "Perla Group International, Inc. provides aviation, telecom, armored vehicles, and K-9 products and services in the burgeoning military, police, and security sectors in the United States and internationally. It offers satellite and telecoms products, including satellite antennas, RF components, I-Direct, military products, and Viasat networks; auto deploy antennas, communication on the move, and VOIP products; power generators; asset tracking products; and network design, implementation, and consultancy services, as well as distributes Sumeru microwave antenna's. The company also provides armored 4x4, VIP, APC, and cash in transit vehicles, as well as buses and ATVs; night vision products comprising monoculars, binoculars, goggles, riflescopes, weapon scopes, day/night systems, thermal multi-purpose systems, thermal imaging systems and cameras, and flashlights; and spare parts consisting of bullet proof glass and screens, heavy duty brake discs and pads, gun ports, run flat tires, strobe light kits, intercom systems, heavy duty jacks, sealed battery systems, and VHF-UHF radio equipment. In addition, it offers a host of aviation services, including passenger jet, cargo aircraft, helicopter, and passenger aircraft chartering; involves in the sale and lease of cargo and passenger aircraft; provides scheduled maintenance, re-fueling, and engineering services; manufactures AK1-3 helicopters; operates a trailer/landing pad/re-fueling station; and offers internationally accredited courses in the training of pilots for private pilot license and commercial pilot license on the AK-3 and Mi-2 helicopters through a college. Further, the company provides k-9 services, such as supply of law enforcement and detection dogs in Australia; training seminars; and tactical, anti terrorism, and security training services. The company is headquartered in Ft. Lauderdale, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Ft. Lauderdale"
    },
    "PTSS": {
        "short_name": "PEARTRACK SECURITY SYSTEMS  INC",
        "long_name": "Enigma-Bulwark, Limited",
        "summary": "Enigma-Bulwark, Limited operates as an integrated security and risk management company that delivers security solutions to government, corporations, and individuals worldwide. It operates in two markets, Remote/Mobile Asset Tracking and Environmental Transportation and Products. The company develops and commercializes proprietary battery system through global positioning system tracking and management technologies. It offers PearLoxx secure locking technology that has a built-in GPS tracking system that enables a shipping container to be sealed securely and tracked using the same device; and PearTrack TeleAsset, a remote asset management, GPS tracking, and monitoring system that enable organizations to manage their remote assets. The company also focuses on development of an environmental car rental operation; and development of ecologically friendly product, Ecologic Shine, a device and system for near-waterless car washing. The company was formerly known as Peartrack Security Systems, Inc. and changed its name to Enigma-Bulwark, Limited in October 2019. Enigma-Bulwark, Limited is headquartered in Santa Monica, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Santa Monica"
    },
    "PTY.F": {
        "short_name": "BRINKS CO.  DL 1",
        "long_name": "The Brink's Company",
        "summary": "The Brink's Company provides secure transportation, cash management, and other security-related services in North America, Latin America, Europe, and internationally. The company offers armored vehicle transportation of valuables; automated teller machine (ATM) management services, such as cash replenishment, replenishment forecasting, cash optimization, ATM remote monitoring, service call dispatching, transaction processing, installation, and first and second line maintenance services; network infrastructure; and cash-in-transit services. It also provides transportation services for diamonds, jewelry, precious metals, securities, bank notes, currency, high-tech devices, electronics, and pharmaceuticals; vault outsourcing and money processing services; and services related to deploying and servicing intelligent safes and safe control devices, as well as cashier balancing, counterfeit detection, account consolidation, electronic reporting, check imaging, and reconciliation services. In addition, the company offers technology applications, including online cash tracking, cash inventory management, and other web-based tools. Further, it provides bill payment acceptance and processing services; prepaid cards and corporate debit cards; and security system design and installation services that include alarms, motion detectors, closed-circuit televisions, and digital video recorders, as well as access control systems comprising card and biometric readers, electronic locks, and turnstiles. Additionally, the company offers monitoring services; and security and guarding services to protect airports, offices, warehouses, stores, and public venues. It serves banks and financial institutions, retailers, government agencies, mints, jewelers, and other commercial operations. The company was formerly known as The Pittston Company and changed its name to The Brink's Company in May 2003. The Brink's Company was founded in 1859 and is headquartered in Richmond, Virginia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Richmond"
    },
    "PWLK": {
        "short_name": "POWERLOCK",
        "long_name": "Powerlock International Corp.",
        "summary": "Task Management Inc., formerly known as Integra Computer Corporation, provides sales management and training services. The company is based in Burbank, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Burbank"
    },
    "REZI.MX": {
        "short_name": "RESIDEO TECHNOLOGIES INC",
        "long_name": "Resideo Technologies, Inc.",
        "summary": "Resideo Technologies, Inc. develops, manufactures, and sells comfort, residential thermal, and security solutions to the commercial and residential end markets in the United States, Europe, and internationally. The company operates in two segments, Products & Solutions, and ADI Global Distribution. It offers temperature and humidity control, thermal and combustion solutions, and water and air solutions; and security panels, sensors, peripherals, wires and cables, communication devices, video cameras, awareness solutions, cloud infrastructure, installation and maintenance tools, and related software products under the Honeywell Home brand. In addition, the company distributes security products comprising video, intrusion, and access control products; and smart home, fire, power, audio, ProAV, networking, communication, wire and cable, enterprise connectivity, and structured wiring products to contractors that service non-residential and residential end-users. It sells its products through a network of distributors, original equipment manufacturers, and service providers, as well as retail and online channels. Resideo Technologies, Inc. was incorporated in 2018 and is headquartered in Austin, Texas.",
        "currency": "MXN",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Austin"
    },
    "REZI": {
        "short_name": "Resideo Technologies, Inc.",
        "long_name": "Resideo Technologies, Inc.",
        "summary": "Resideo Technologies, Inc. develops, manufactures, and sells comfort, residential thermal, and security solutions to the commercial and residential end markets in the United States, Europe, and internationally. The company operates in two segments, Products & Solutions, and ADI Global Distribution. It offers temperature and humidity control, thermal and combustion solutions, and water and air solutions; and security panels, sensors, peripherals, wires and cables, communication devices, video cameras, awareness solutions, cloud infrastructure, installation and maintenance tools, and related software products under the Honeywell Home brand. In addition, the company distributes security products comprising video, intrusion, and access control products; and smart home, fire, power, audio, ProAV, networking, communication, wire and cable, enterprise connectivity, and structured wiring products to contractors that service non-residential and residential end-users. It sells its products through a network of distributors, original equipment manufacturers, and service providers, as well as retail and online channels. Resideo Technologies, Inc. was incorporated in 2018 and is headquartered in Austin, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Austin"
    },
    "RSKIA": {
        "short_name": "RISK GEORGE INDUSTRIES INC",
        "long_name": "George Risk Industries, Inc.",
        "summary": "George Risk Industries, Inc. designs, manufactures, and sells various electronic components worldwide. The company offers computer keyboards, push button switches, burglar alarm components and systems, pool alarms, thermostats, EZ duct wire covers, and water sensors, as well as door and window contact switches, environmental products, wire and cable installation tools, and proximity switches. Its products are used for residential, commercial, industrial, and government installations. The company sells its products to security alarm distributors, alarm installers, original equipment manufacturers, and distributors of off-the-shelf keyboards of proprietary design. George Risk Industries, Inc. was founded in 1965 and is headquartered in Kimball, Nebraska.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Kimball"
    },
    "SCTY": {
        "short_name": "MONITRONICS INTERNATIONAL",
        "long_name": "Monitronics International, Inc.",
        "summary": "Monitronics International, Inc., doing business as Brinks Home Security, provides security alarm monitoring and related services to residential and commercial customers in the United States, Canada, and Puerto Rico. It provides monitoring services for alarm signals arising from burglaries, fires, medical alerts, and other events through security systems at customers' premises. The company also offers home automation and life safety services, such as remote activation and control of security systems; support for video monitoring, flood sensors, and automated garage door and door lock capabilities; and thermostat integration services. In addition, it provides hands-free two-way interactive voice communication between its monitoring center and customers; customer and technical support related services to home monitoring systems and home automation services; and do-it-yourself and professional installation security solutions. It serves its customers through a network of authorized dealers. The company was founded in 1994 and is based in Farmers Branch, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Farmers Branch"
    },
    "SITS": {
        "short_name": "SOUTHERN ITS INTERNATIONAL INC",
        "long_name": "Southern ITS International, Inc.",
        "summary": "Southern ITS International, Inc. engages in the turnkey integration of electronic security systems for transportation, gaming, and other secure operation industries in government and private sectors primarily in the United States. The company's integration solutions include surveillance, access control, network infrastructure, data communications, and fire and burglar alarm systems. It provides Greeniosk, a payment to sales technology solution that offers a transaction record from payment-to-sales, which combines with seeds-to-sales software and hardware. The company also offers phone and data solutions, such as cable infrastructure, networking, and IT tools and services, as well as various certification services. In addition, it provides data and security system integration services comprising system specification, design, cable infrastructure installation, system installation, system training, and technical support services; and casino system integration solutions, such as system design, and project and facilities management services. Southern ITS International, Inc. is headquartered in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Las Vegas"
    },
    "SKVY": {
        "short_name": "SENTRY TECHNOLOGY CORP",
        "long_name": "Sentry Technology Corp.",
        "summary": "Sentry Technology Corp. designs, manufactures, markets, and services closed circuit television (CCTV), library patron self service, and radio frequency identification (RFID) solutions, as well as EAS security systems. It offers SentryVision SmartTrack, a traveling video system that transmit images from a PTZ camera mounted on a carriage that travels along a rail mounted to the ceiling of any facility; VideoRailway, a traveling camera technology; security and information services through inventory management, self-service, and book detection systems to school, public, and academic libraries; and OperationalVideo, a browser based video application to assist retailers with real time management of security, merchandising audits, and employee procedure compliance. The company also offers EAS security systems, including electromagnetic and RF systems for reducing theft in bookstores; and designs, installs, and maintains CCTV systems for retailers, transportation and distribution, and commercial and industrial companies. It serves retailers, transportation and distribution hubs, couriers and public transportation facilities, libraries, and data centers through dealers in North America, Europe, Latin America, the Middle East, Asia, and Africa. The company was founded in 1996 and is based in Ronkonkoma, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Ronkonkoma"
    },
    "USN.F": {
        "short_name": "UNIV. SEC. INSTR.  DL-,01",
        "long_name": "Universal Security Instruments, Inc.",
        "summary": "Universal Security Instruments, Inc., together with its subsidiary, designs, markets, and distributes safety and security products for use in homes and businesses in the United States and internationally. It offers a line of safety alarms, including units powered by replaceable batteries, sealed batteries, and battery backup alarms; and smoke alarms, which include hearing impaired and heat alarms, as well as carbon monoxide alarms, door chimes, ventilation products, ground fault circuit interrupters, and other electrical devices. The company provides its products to wholesale distributors; chain, discount, and television retailers; home center stores; catalog and mail order companies; electrical and lighting distributors, and manufactured housing companies; and other distributors. It also sells its products through independent sales organizations and sales representatives, as well as through its own sales catalogs and brochures, and Website. The company was founded in 1969 and is headquartered in Owings Mills, Maryland.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Owings Mills"
    },
    "UUU": {
        "short_name": "Universal Security Instruments,",
        "long_name": "Universal Security Instruments, Inc.",
        "summary": "Universal Security Instruments, Inc., together with its subsidiary, designs, markets, and distributes safety and security products for use in homes and businesses in the United States and internationally. It offers a line of safety alarms, including units powered by replaceable batteries, sealed batteries, and battery backup alarms; and smoke alarms, which include hearing impaired and heat alarms, as well as carbon monoxide alarms, door chimes, ventilation products, ground fault circuit interrupters, and other electrical devices. The company provides its products to wholesale distributors; chain, discount, and television retailers; home center stores; catalog and mail order companies; electrical and lighting distributors, and manufactured housing companies; and other distributors. It also sells its products through independent sales organizations and sales representatives, as well as through its own sales catalogs and brochures, and Website. The company was founded in 1969 and is headquartered in Owings Mills, Maryland.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "city": "Owings Mills"
    },
    "VRME": {
        "short_name": "VerifyMe, Inc.",
        "long_name": "VerifyMe, Inc.",
        "summary": "VerifyMe, Inc. provides technology solutions for brand protection and supply chain functions in the United States. The company's brand protection and supply chain functions include counterfeit prevention, authentication, serialization, consumer engagement, and track and trace features for labels, packaging, and products. It provides RainbowSecure technology that combines an invisible ink with a proprietary tuned laser to enable counterfeit products to be exposed; VeriPAS technology, which provides brand owners geographical business intelligence on counterfeiting; and VeriPAS Smartphone Authenticator technology, a piece of hardware with a built-in lighting system and software that scans invisible RainbowSecure codes. The company also offers VerifyMe as Authentic technology, a dual-purpose pre-printed label with a visible serialized QR code for consumer scanning purposes, as well as an invisible serialized IR code for inspector scanning, authentication, and tracking purposes; VerifyMe Beeper technology, an authentication tool that is designed for customers who desire instant authentication on items, such as event tickets at an entry gate; and VerifyMe Web that enables customers to effectively tackle counterfeit websites, domains, and e-commerce platforms offering counterfeit products. It has strategic partnerships with INX International Ink Company; and Techind Engineers & Consultants-Impex. The company was formerly known as LaserLock Technologies, Inc. and changed its name to VerifyMe, Inc. in July 2015. VerifyMe, Inc. was incorporated in 1999 and is based in Rochester, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "Rochester"
    },
    "VRRM": {
        "short_name": "Verra Mobility Corporation",
        "long_name": "Verra Mobility Corporation",
        "summary": "Verra Mobility Corporation provides smart mobility technology solutions and services in the United States, Canada, and Europe. It operates through two segments, Government Solutions and Commercial Services. The Government Solutions segment offers automated safety solutions, including services and technologies that enable photo enforcement through road safety camera programs, which detects and process traffic violations related to red light, speed, school bus, and city bus lanes. This segment serves municipalities, counties, school districts, and law enforcement agencies. The Commercial Services segment provides automated toll and violations management, and title and registration solutions to rental car companies, fleet management companies, and other large fleet owners. The company was incorporated in 2016 and is headquartered in Mesa, Arizona.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "Mesa"
    },
    "VSYM": {
        "short_name": "VIEW SYSTEMS INC",
        "long_name": "View Systems, Inc.",
        "summary": "View Systems, Inc. develops, produces, and markets computer software and hardware systems for security and surveillance applications in the United States. The company offers concealed weapons detector, which uses data sensing technology to pinpoint the location, size, and number of concealed weapons under the ViewScan and Secure Scan names; and Viewmaxx digital video systems. It serves federal and state government courthouses, county and municipal buildings, and correctional facilities. The company was formerly known as Beneficial Investment Group, Inc. and changed its name to View Systems, Inc. in September 1998. View Systems, Inc. was incorporated in 1989 and is based in Greenbelt, Maryland.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Greenbelt"
    },
    "VVNT": {
        "short_name": "Vivint Smart Home, Inc.",
        "long_name": "Vivint Smart Home, Inc.",
        "summary": "Vivint Smart Home, Inc., together with its subsidiaries, engages in the sale, installation, servicing, and monitoring of smart home and security systems primarily in the United States and Canada. The company's smart home platform includes cloud-enabled smart home operating systems; Vivint Assist, an AI-driven smart home automation and assistance software; software-enabled smart home devices; and tech-enabled services to educate, manage, and support the smart home. It also offers other devices, including control panel, security cameras and smoke alarms, door and window sensors, door locks, motion and tilt sensors, glass break detectors, key fobs, medical pendants, carbon monoxide detectors, flood sensors, and lamp modules. The company's solutions enable subscribers to interact with various aspects of home with voice or mobile device, including engaging with people at front door, and viewing live and recorded video inside and outside homes; and control thermostats, locks, lights, and garage doors, as well as managing movement of families, friends, and strangers. As of March 31, 2020, its smart home platform had approximately 1.5 million subscribers and managed approximately 20 million in-home devices. It markets its products through direct-to-home, inside sales channels, and retail partnerships programs. The company was founded in 1999 and is headquartered in Provo, Utah.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Provo"
    },
    "WCCP": {
        "short_name": "WEALTHCRAFT CAPITAL INC",
        "long_name": "Wealthcraft Capital, Inc.",
        "summary": "Wealthcraft Capital, Inc. focuses on the investment of capital in private companies that are interested in expanding their business by gaining better access to capital, management consulting, and business development. The company was formerly known as Wealthcraft Systems, Inc. and changed its name to Wealthcraft Capital, Inc. in February 2017. Wealthcraft Capital, Inc. was founded in 2003 and is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Los Angeles"
    }
}