{
    "1MA.DE": {
        "short_name": "MACOM TECHN.SOL.H.DL-,001",
        "long_name": "MACOM Technology Solutions Holdings, Inc.",
        "summary": "MACOM Technology Solutions Holdings, Inc., together with its subsidiaries, designs and manufactures analog semiconductor solutions for use in wireless and wireline applications across the radio frequency (RF), microwave, millimeter wave, and lightwave spectrum in the United States, China, the Asia Pacific, and internationally. The company offers a portfolio of standard and custom devices, including integrated circuits, multi-chip modules, diodes, amplifiers, switches and switch limiters, passive and active components, and subsystems. Its semiconductor products are electronic components that are incorporated in electronic systems, such as wireless basestations, high capacity optical networks, radar, and medical systems and test and measurement. The company serves various markets comprising telecommunication that includes carrier infrastructure, which comprise long-haul/metro, 5G, and fiber-to-the-X/passive optical network; data centres; and industrial and defense, including military and commercial radar, RF jammers, electronic countermeasures, and communication data links, as well as multi-market applications, such as industrial, medical, test and measurement, and scientific applications. It sells its products through direct sales force, applications engineering staff, independent sales representatives, resellers, and distributors. The company was founded in 1950 and is headquartered in Lowell, Massachusetts.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Lowell"
    },
    "1MA.F": {
        "short_name": "MACOM TECHN.SOL.H.DL-,001",
        "long_name": "MACOM Technology Solutions Holdings, Inc.",
        "summary": "MACOM Technology Solutions Holdings, Inc., together with its subsidiaries, designs and manufactures analog semiconductor solutions for use in wireless and wireline applications across the radio frequency (RF), microwave, millimeter wave, and lightwave spectrum in the United States, China, the Asia Pacific, and internationally. The company offers a portfolio of standard and custom devices, including integrated circuits, multi-chip modules, diodes, amplifiers, switches and switch limiters, passive and active components, and subsystems. Its semiconductor products are electronic components that are incorporated in electronic systems, such as wireless basestations, high capacity optical networks, radar, and medical systems and test and measurement. The company serves various markets comprising telecommunication that includes carrier infrastructure, which comprise long-haul/metro, 5G, and fiber-to-the-X/passive optical network; data centres; and industrial and defense, including military and commercial radar, RF jammers, electronic countermeasures, and communication data links, as well as multi-market applications, such as industrial, medical, test and measurement, and scientific applications. It sells its products through direct sales force, applications engineering staff, independent sales representatives, resellers, and distributors. The company was founded in 1950 and is headquartered in Lowell, Massachusetts.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Lowell"
    },
    "1YD.F": {
        "short_name": "BROADCOM INC.  DL-,001",
        "long_name": "Broadcom Inc.",
        "summary": "Broadcom Inc. designs, develops, and supplies semiconductor infrastructure software solutions. It offers semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company's infrastructure software solutions enable customers to plan, develop, automate, manage, and secure applications across mainframe, distributed, mobile, and cloud platforms. It operates through two segments, Semiconductor Solutions and Infrastructure Software. The company was incorporated in 2018 and is based in San Jose, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "San Jose"
    },
    "2EK.F": {
        "short_name": "RESONANT INC.  DL-,001",
        "long_name": "Resonant Inc.",
        "summary": "Resonant Inc., a late-stage development company, designs and develops filters for radio frequency (RF) and front-ends used in the mobile device, automotive, medical, internet-of-things, and related industries in Japan, China, and internationally. It uses Infinite Synthesized Networks technology, a software platform to configure and connect resonators that are building blocks of RF filters. The company develops a series of single-band designs for frequency bands; and multiplexer filter designs for two or more bands to address the carrier aggregation requirements; and XBAR, a technology for mobile and non-mobile applications, including 5G, WiFi, and Ultra-WideBand applications. Resonant Inc. was incorporated in 2012 and is headquartered in Austin, Texas.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Austin"
    },
    "2QO.DE": {
        "short_name": "QORVO INC.DL -,0001",
        "long_name": "Qorvo, Inc.",
        "summary": "Qorvo, Inc. develops and commercializes technologies and products for wireless and wired connectivity worldwide. The company operates in two segments, Mobile Products, and Infrastructure and Defense Products. The company offers integrated modules incorporating switches, power amplifiers, filters and duplexers, antenna tuners, RF power management integrated circuits, multimode/multi-band PAs and transmit modules, antenna-plexers, discrete filters and duplexers, discrete switches, and UWB system solutions, as well as envelope tracking power management solutions, antenna control solutions, and UWB system solutions supporting secure, low power, location, and communication services. It also provides integrated solutions that include switch-LNA modules, variable gain amplifiers, and integrated PA Doherty modules for massive multiple-input/multiple-output systems; RF products and compound semiconductor foundry services to defense primes and other global defense and aerospace customers; Wi-Fi customer premises equipment, including power amplifiers, switches, low noise amplifiers, and bulk acoustic wave filters; system-on-a-chip hardware, firmware, and application software for smart home applications; automotive RF connectivity products and metal oxide semiconductor based UWB chip and module system solutions; and power application controllers and programmable analog power ICs. The company sells its products directly to original equipment manufacturers and original design manufacturers, as well as through a network of sales representative firms and distributors. Qorvo, Inc. was founded in 1957 and is headquartered in Greensboro, North Carolina.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Greensboro"
    },
    "2QO.F": {
        "short_name": "QORVO INC.DL -,0001",
        "long_name": "Qorvo, Inc.",
        "summary": "Qorvo, Inc. develops and commercializes technologies and products for wireless and wired connectivity worldwide. The company operates in two segments, Mobile Products, and Infrastructure and Defense Products. The company offers integrated modules incorporating switches, power amplifiers, filters and duplexers, antenna tuners, RF power management integrated circuits, multimode/multi-band PAs and transmit modules, antenna-plexers, discrete filters and duplexers, discrete switches, and UWB system solutions, as well as envelope tracking power management solutions, antenna control solutions, and UWB system solutions supporting secure, low power, location, and communication services. It also provides integrated solutions that include switch-LNA modules, variable gain amplifiers, and integrated PA Doherty modules for massive multiple-input/multiple-output systems; RF products and compound semiconductor foundry services to defense primes and other global defense and aerospace customers; Wi-Fi customer premises equipment, including power amplifiers, switches, low noise amplifiers, and bulk acoustic wave filters; system-on-a-chip hardware, firmware, and application software for smart home applications; automotive RF connectivity products and metal oxide semiconductor based UWB chip and module system solutions; and power application controllers and programmable analog power ICs. The company sells its products directly to original equipment manufacturers and original design manufacturers, as well as through a network of sales representative firms and distributors. Qorvo, Inc. was founded in 1957 and is headquartered in Greensboro, North Carolina.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Greensboro"
    },
    "4971.TWO": {
        "short_name": "INTELLIEPI INC (CAYMAN)",
        "long_name": "IntelliEPI Inc. (Cayman)",
        "summary": "IntelliEPI Inc. (Cayman) manufactures and sells epitaxy-based compound semiconductor epitaxy wafers to the electronics and optoelectronics industries worldwide. The company utilizes its proprietary real time in situ growth monitoring technology on molecular beam epitaxy (MBE) systems for the manufacturing of epi-wafers on gallium arsenide (GaAs) and indium phosphide (InP) substrates. Its GaAs based products include pseudo-morpic high electron mobility transistors and MHEMT products; and InP based products comprise hetero-junction bi-polar transistors, HEMT, RTT, and RTD. The company also provides Sb based products, such as type II SLS photodetectors, GaAsSb-base InP HBT, and epi-ready GaSb substrates; and mismatched Epi products comprising III-V on Si, III-V on Ge, and high in content InGaAs on Si. In addition, it offers opto-electronics, including avalanche photo diodes, lasers, high-speed high-frequency surface-emitting lasers, optical receivers, quantum well infrared photodetectors, modulators, and quantum cascade lasers, as well as infrared light detectors. The company was incorporated in 2011 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "United States",
        "city": "Texas"
    },
    "4NO.F": {
        "short_name": "NEOPHOTONICS CORP. DL-,01",
        "long_name": "NeoPhotonics Corporation",
        "summary": "NeoPhotonics Corporation develops, manufactures, and sells optoelectronic products that transmit and receive high speed digital optical signals for cloud and hyperscale data center internet content provider and telecom networks worldwide. It offers high speed products, including transmitter, receiver, and switching products for 400G and optical transmission applications over distances of 2 to 2,000 kilometers; ultra-narrow linewidth tunable lasers that generate ultra-pure wavelength or color for coherent transmission; and integrated coherent receivers (ICRs) that decode the phase and polarization encoded coherent optical signals. The company also provides pluggable coherent transceivers that combine ultra-narrow linewidth laser with coherent receiver and performance coherent modulator; and 100G products for data center applications. In addition, it offers multi-cast switching solutions for 100G and above coherent systems; and network products and solutions, such as arrayed wavelength gratings, multiplexers, and filters used in dense wavelength division multiplexing systems. The company sells its products to network equipment manufacturers through a direct sales force in North America, Europe, and Asia. The company was formerly known as NanoGram Corporation and changed its name to NeoPhotonics Corporation in 2002. NeoPhotonics Corporation was founded in 1996 and is headquartered in San Jose, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "San Jose"
    },
    "6697.T": {
        "short_name": "TECHPOINT INC (JP)",
        "long_name": "Techpoint, Inc.",
        "summary": "Techpoint, Inc., a fabless semiconductor company, designs, markets, and sells mixed-signal integrated circuits for various video applications in the security surveillance and automotive markets. Its integrated circuits enable the transmission of high definition (HD) video content over long cable distances to facilitate the display, storage, or processing of video content. The company's products include HD-TVI transmitters and receivers, HD-SDI receivers, automotive camera processors, and HD LCD controllers. Techpoint, Inc. targets video applications that receive and process HD analog video signals, including surveillance cameras and surveillance digital video recorders, as well as cameras in automobiles. The company sells its products to distributors and original design manufacturers in China, Taiwan, South Korea, and Japan. Techpoint, Inc. was founded in 2012 and is headquartered in San Jose, California.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "United States",
        "city": "San Jose"
    },
    "A1DI34.SA": {
        "short_name": "ANALOG DEVICDRN",
        "long_name": "Analog Devices, Inc.",
        "summary": "Analog Devices, Inc. designs, manufactures, tests, and markets integrated circuits (ICs), software, and subsystems that leverage analog, mixed-signal, and digital signal processing technologies. The company offers data converter products, which translate real-world analog signals into digital data, as well as translates digital data into analog signals; high-performance amplifiers to condition analog signals; and radio frequency and microwave ICs to support cellular infrastructure. It also provides power management and reference products for power management and conversion applications in the automotive, communications, industrial, and high-end consumer markets; and microelectromechanical systems technology solutions, including accelerometers used to sense acceleration, gyroscopes to sense rotation, and inertial measurement units to sense multiple degrees of freedom, as well as isolators. In addition, the company offers digital signal processing and system products for high-speed numeric calculations. The company serves clients in the industrial, automotive, consumer, and communications markets through a direct sales force, third-party distributors, and independent sales representatives in the United States, the rest of North and South America, Europe, Japan, China, and rest of Asia, as well as through its Website. Analog Devices, Inc. was founded in 1965 and is headquartered in Wilmington, Massachusetts.",
        "currency": "BRL",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Norwood"
    },
    "A1MD34.SA": {
        "short_name": "ADVANCED MICDRN",
        "long_name": "Advanced Micro Devices, Inc.",
        "summary": "Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. The company operates in two segments, Computing and Graphics; and Enterprise, Embedded and Semi-Custom. Its products include x86 microprocessors as an accelerated processing unit, chipsets, discrete and integrated graphics processing units (GPUs), data center and professional GPUs, and development services; and server and embedded processors, and semi-custom System-on-Chip (SoC) products, development services, and technology for game consoles. The company provides x86 microprocessors for desktop PCs under the AMD Ryzen, AMD Ryzen PRO, Ryzen, Threadripper, AMD A-Series, AMD FX, AMD Athlon, AMD Athlon PRO, and AMD Pro A-Series processors brands; microprocessors for notebook and 2-in-1s under the AMD Ryzen, AMD A-Series, AMD Athlon, AMD Ryzen PRO, AMD Athlon PRO, and AMD Pro A-Series processors brands; microprocessors for servers under the AMD EPYC and AMD Opteron brands; and chipsets under the AMD trademark. It also offers discrete GPUs for desktop and notebook PCs under the AMD Radeon graphics and AMD Embedded Radeon brands; professional graphics products under the AMD Radeon Pro and AMD FirePro graphics brands; and Radeon Instinct and AMD Instinct accelerators for servers. In addition, the company provides embedded processor solutions under the AMD Opteron, AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series processors brands; and customer-specific solutions based on AMD CPU, GPU, and multi-media technologies, as well as semi-custom SoC products. It serves original equipment manufacturers, public cloud service providers, original design manufacturers, system integrators, independent distributors, online retailers, and add-in-board manufacturers through its direct sales force, independent distributors, and sales representatives. Advanced Micro Devices, Inc. was founded in 1969 and is headquartered in Santa Clara, California.",
        "currency": "BRL",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "A59.SG": {
        "short_name": "Applied Optoelectronics Inc. Re",
        "long_name": "Applied Optoelectronics, Inc.",
        "summary": "Applied Optoelectronics, Inc. designs, manufactures, and sells various fiber-optic networking products worldwide. It offers optical modules, lasers, subassemblies, transmitters and transceivers, and turn-key equipment, as well as headend, node, and distribution equipment. The company sells its products to internet data center operators, cable television and telecom equipment manufacturers, and internet service providers through its direct and indirect sales channels. Applied Optoelectronics, Inc. was incorporated in 1997 and is headquartered in Sugar Land, Texas.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United States",
        "city": "Sugar Land"
    },
    "AAOI": {
        "short_name": "Applied Optoelectronics, Inc.",
        "long_name": "Applied Optoelectronics, Inc.",
        "summary": "Applied Optoelectronics, Inc. designs, manufactures, and sells various fiber-optic networking products worldwide. It offers optical modules, lasers, subassemblies, transmitters and transceivers, and turn-key equipment, as well as headend, node, and distribution equipment. The company sells its products to internet data center operators, cable television and telecom equipment manufacturers, and internet service providers through its direct and indirect sales channels. Applied Optoelectronics, Inc. was incorporated in 1997 and is headquartered in Sugar Land, Texas.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "city": "Sugar Land"
    },
    "ADI.MX": {
        "short_name": "ANALOG DEVICES INC",
        "long_name": "Analog Devices, Inc.",
        "summary": "Analog Devices, Inc. designs, manufactures, tests, and markets integrated circuits (ICs), software, and subsystems that leverage analog, mixed-signal, and digital signal processing technologies. The company offers data converter products, which translate real-world analog signals into digital data, as well as translates digital data into analog signals; high-performance amplifiers to condition analog signals; and radio frequency and microwave ICs to support cellular infrastructure. It also provides power management and reference products for power management and conversion applications in the automotive, communications, industrial, and high-end consumer markets; and microelectromechanical systems technology solutions, including accelerometers used to sense acceleration, gyroscopes to sense rotation, and inertial measurement units to sense multiple degrees of freedom, as well as isolators. In addition, the company offers digital signal processing and system products for high-speed numeric calculations. The company serves clients in the industrial, automotive, consumer, and communications markets through a direct sales force, third-party distributors, and independent sales representatives in the United States, the rest of North and South America, Europe, Japan, China, and rest of Asia, as well as through its Website. Analog Devices, Inc. was founded in 1965 and is headquartered in Wilmington, Massachusetts.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Norwood"
    },
    "ADI": {
        "short_name": "Analog Devices, Inc.",
        "long_name": "Analog Devices, Inc.",
        "summary": "Analog Devices, Inc. designs, manufactures, tests, and markets integrated circuits (ICs), software, and subsystems that leverage analog, mixed-signal, and digital signal processing technologies. The company offers data converter products, which translate real-world analog signals into digital data, as well as translates digital data into analog signals; high-performance amplifiers to condition analog signals; and radio frequency and microwave ICs to support cellular infrastructure. It also provides power management and reference products for power management and conversion applications in the automotive, communications, industrial, and high-end consumer markets; and microelectromechanical systems technology solutions, including accelerometers used to sense acceleration, gyroscopes to sense rotation, and inertial measurement units to sense multiple degrees of freedom, as well as isolators. In addition, the company offers digital signal processing and system products for high-speed numeric calculations. The company serves clients in the industrial, automotive, consumer, and communications markets through a direct sales force, third-party distributors, and independent sales representatives in the United States, the rest of North and South America, Europe, Japan, China, and rest of Asia, as well as through its Website. Analog Devices, Inc. was founded in 1965 and is headquartered in Wilmington, Massachusetts.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Norwood"
    },
    "ADI.VI": {
        "short_name": "ANALOG DEVICES INC",
        "long_name": "Analog Devices, Inc.",
        "summary": "Analog Devices, Inc. designs, manufactures, tests, and markets integrated circuits (ICs), software, and subsystems that leverage analog, mixed-signal, and digital signal processing technologies. The company offers data converter products, which translate real-world analog signals into digital data, as well as translates digital data into analog signals; high-performance amplifiers to condition analog signals; and radio frequency and microwave ICs to support cellular infrastructure. It also provides power management and reference products for power management and conversion applications in the automotive, communications, industrial, and high-end consumer markets; and microelectromechanical systems technology solutions, including accelerometers used to sense acceleration, gyroscopes to sense rotation, and inertial measurement units to sense multiple degrees of freedom, as well as isolators. In addition, the company offers digital signal processing and system products for high-speed numeric calculations. The company serves clients in the industrial, automotive, consumer, and communications markets through a direct sales force, third-party distributors, and independent sales representatives in the United States, the rest of North and South America, Europe, Japan, China, and rest of Asia, as well as through its Website. Analog Devices, Inc. was founded in 1965 and is headquartered in Wilmington, Massachusetts.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "Norwood"
    },
    "ALGM": {
        "short_name": "Allegro MicroSystems, Inc.",
        "long_name": "Allegro MicroSystems, Inc.",
        "summary": "Allegro MicroSystems, Inc. designs, develops, manufactures, and markets sensor ICs and application-specific analog power ICs for motion control and energy-efficient systems in automotive and industrial markets. Its products include magnetic sensor ICs, such as position, speed, and current sensor ICs; Power ICs comprising motor driver ICs, and regulator and LED driver ICs, as well as photonic and 3D sensing components for LiDAR applications. The company sells its products to OEMs and suppliers primarily in the automotive and industrial markets through its direct sales force, distributors, and independent sales representatives. It operates in the Americas, Europe, Japan, Greater China, South Korea, and other Asian markets. The company was founded in 1990 and is headquartered in Manchester, New Hampshire.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Manchester"
    },
    "AMD.BA": {
        "short_name": "ADVANCED MICRO DEV",
        "long_name": "Advanced Micro Devices, Inc.",
        "summary": "Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. The company operates in two segments, Computing and Graphics; and Enterprise, Embedded and Semi-Custom. Its products include x86 microprocessors as an accelerated processing unit, chipsets, discrete and integrated graphics processing units (GPUs), data center and professional GPUs, and development services; and server and embedded processors, and semi-custom System-on-Chip (SoC) products, development services, and technology for game consoles. The company provides x86 microprocessors for desktop PCs under the AMD Ryzen, AMD Ryzen PRO, Ryzen, Threadripper, AMD A-Series, AMD FX, AMD Athlon, AMD Athlon PRO, and AMD Pro A-Series processors brands; microprocessors for notebook and 2-in-1s under the AMD Ryzen, AMD A-Series, AMD Athlon, AMD Ryzen PRO, AMD Athlon PRO, and AMD Pro A-Series processors brands; microprocessors for servers under the AMD EPYC and AMD Opteron brands; and chipsets under the AMD trademark. It also offers discrete GPUs for desktop and notebook PCs under the AMD Radeon graphics and AMD Embedded Radeon brands; professional graphics products under the AMD Radeon Pro and AMD FirePro graphics brands; and Radeon Instinct and AMD Instinct accelerators for servers. In addition, the company provides embedded processor solutions under the AMD Opteron, AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series processors brands; and customer-specific solutions based on AMD CPU, GPU, and multi-media technologies, as well as semi-custom SoC products. It serves original equipment manufacturers, public cloud service providers, original design manufacturers, system integrators, independent distributors, online retailers, and add-in-board manufacturers through its direct sales force, independent distributors, and sales representatives. Advanced Micro Devices, Inc. was founded in 1969 and is headquartered in Santa Clara, California.",
        "currency": "ARS",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "AMD.DE": {
        "short_name": "ADVANCED MIC.DEV.  DL-,01",
        "long_name": "Advanced Micro Devices, Inc.",
        "summary": "Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. The company operates in two segments, Computing and Graphics; and Enterprise, Embedded and Semi-Custom. Its products include x86 microprocessors as an accelerated processing unit, chipsets, discrete and integrated graphics processing units (GPUs), data center and professional GPUs, and development services; and server and embedded processors, and semi-custom System-on-Chip (SoC) products, development services, and technology for game consoles. The company provides x86 microprocessors for desktop PCs under the AMD Ryzen, AMD Ryzen PRO, Ryzen, Threadripper, AMD A-Series, AMD FX, AMD Athlon, AMD Athlon PRO, and AMD Pro A-Series processors brands; microprocessors for notebook and 2-in-1s under the AMD Ryzen, AMD A-Series, AMD Athlon, AMD Ryzen PRO, AMD Athlon PRO, and AMD Pro A-Series processors brands; microprocessors for servers under the AMD EPYC and AMD Opteron brands; and chipsets under the AMD trademark. It also offers discrete GPUs for desktop and notebook PCs under the AMD Radeon graphics and AMD Embedded Radeon brands; professional graphics products under the AMD Radeon Pro and AMD FirePro graphics brands; and Radeon Instinct and AMD Instinct accelerators for servers. In addition, the company provides embedded processor solutions under the AMD Opteron, AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series processors brands; and customer-specific solutions based on AMD CPU, GPU, and multi-media technologies, as well as semi-custom SoC products. It serves original equipment manufacturers, public cloud service providers, original design manufacturers, system integrators, independent distributors, online retailers, and add-in-board manufacturers through its direct sales force, independent distributors, and sales representatives. Advanced Micro Devices, Inc. was founded in 1969 and is headquartered in Santa Clara, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "AMD.F": {
        "short_name": "ADVANCED MIC.DEV.  DL-,01",
        "long_name": "Advanced Micro Devices, Inc.",
        "summary": "Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. The company operates in two segments, Computing and Graphics; and Enterprise, Embedded and Semi-Custom. Its products include x86 microprocessors as an accelerated processing unit, chipsets, discrete and integrated graphics processing units (GPUs), data center and professional GPUs, and development services; and server and embedded processors, and semi-custom System-on-Chip (SoC) products, development services, and technology for game consoles. The company provides x86 microprocessors for desktop PCs under the AMD Ryzen, AMD Ryzen PRO, Ryzen, Threadripper, AMD A-Series, AMD FX, AMD Athlon, AMD Athlon PRO, and AMD Pro A-Series processors brands; microprocessors for notebook and 2-in-1s under the AMD Ryzen, AMD A-Series, AMD Athlon, AMD Ryzen PRO, AMD Athlon PRO, and AMD Pro A-Series processors brands; microprocessors for servers under the AMD EPYC and AMD Opteron brands; and chipsets under the AMD trademark. It also offers discrete GPUs for desktop and notebook PCs under the AMD Radeon graphics and AMD Embedded Radeon brands; professional graphics products under the AMD Radeon Pro and AMD FirePro graphics brands; and Radeon Instinct and AMD Instinct accelerators for servers. In addition, the company provides embedded processor solutions under the AMD Opteron, AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series processors brands; and customer-specific solutions based on AMD CPU, GPU, and multi-media technologies, as well as semi-custom SoC products. It serves original equipment manufacturers, public cloud service providers, original design manufacturers, system integrators, independent distributors, online retailers, and add-in-board manufacturers through its direct sales force, independent distributors, and sales representatives. Advanced Micro Devices, Inc. was founded in 1969 and is headquartered in Santa Clara, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "AMD.MX": {
        "short_name": "ADVANCED MICRO DEVICES INC",
        "long_name": "Advanced Micro Devices, Inc.",
        "summary": "Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. The company operates in two segments, Computing and Graphics; and Enterprise, Embedded and Semi-Custom. Its products include x86 microprocessors as an accelerated processing unit, chipsets, discrete and integrated graphics processing units (GPUs), data center and professional GPUs, and development services; and server and embedded processors, and semi-custom System-on-Chip (SoC) products, development services, and technology for game consoles. The company provides x86 microprocessors for desktop PCs under the AMD Ryzen, AMD Ryzen PRO, Ryzen, Threadripper, AMD A-Series, AMD FX, AMD Athlon, AMD Athlon PRO, and AMD Pro A-Series processors brands; microprocessors for notebook and 2-in-1s under the AMD Ryzen, AMD A-Series, AMD Athlon, AMD Ryzen PRO, AMD Athlon PRO, and AMD Pro A-Series processors brands; microprocessors for servers under the AMD EPYC and AMD Opteron brands; and chipsets under the AMD trademark. It also offers discrete GPUs for desktop and notebook PCs under the AMD Radeon graphics and AMD Embedded Radeon brands; professional graphics products under the AMD Radeon Pro and AMD FirePro graphics brands; and Radeon Instinct and AMD Instinct accelerators for servers. In addition, the company provides embedded processor solutions under the AMD Opteron, AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series processors brands; and customer-specific solutions based on AMD CPU, GPU, and multi-media technologies, as well as semi-custom SoC products. It serves original equipment manufacturers, public cloud service providers, original design manufacturers, system integrators, independent distributors, online retailers, and add-in-board manufacturers through its direct sales force, independent distributors, and sales representatives. Advanced Micro Devices, Inc. was founded in 1969 and is headquartered in Santa Clara, California.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "AMD": {
        "short_name": "Advanced Micro Devices, Inc.",
        "long_name": "Advanced Micro Devices, Inc.",
        "summary": "Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. The company operates in two segments, Computing and Graphics; and Enterprise, Embedded and Semi-Custom. Its products include x86 microprocessors as an accelerated processing unit, chipsets, discrete and integrated graphics processing units (GPUs), data center and professional GPUs, and development services; and server and embedded processors, and semi-custom System-on-Chip (SoC) products, development services, and technology for game consoles. The company provides x86 microprocessors for desktop PCs under the AMD Ryzen, AMD Ryzen PRO, Ryzen, Threadripper, AMD A-Series, AMD FX, AMD Athlon, AMD Athlon PRO, and AMD Pro A-Series processors brands; microprocessors for notebook and 2-in-1s under the AMD Ryzen, AMD A-Series, AMD Athlon, AMD Ryzen PRO, AMD Athlon PRO, and AMD Pro A-Series processors brands; microprocessors for servers under the AMD EPYC and AMD Opteron brands; and chipsets under the AMD trademark. It also offers discrete GPUs for desktop and notebook PCs under the AMD Radeon graphics and AMD Embedded Radeon brands; professional graphics products under the AMD Radeon Pro and AMD FirePro graphics brands; and Radeon Instinct and AMD Instinct accelerators for servers. In addition, the company provides embedded processor solutions under the AMD Opteron, AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series processors brands; and customer-specific solutions based on AMD CPU, GPU, and multi-media technologies, as well as semi-custom SoC products. It serves original equipment manufacturers, public cloud service providers, original design manufacturers, system integrators, independent distributors, online retailers, and add-in-board manufacturers through its direct sales force, independent distributors, and sales representatives. Advanced Micro Devices, Inc. was founded in 1969 and is headquartered in Santa Clara, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "AMD.VI": {
        "short_name": "ADVANCED MICRO DEVICES INC",
        "long_name": "Advanced Micro Devices, Inc.",
        "summary": "Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. The company operates in two segments, Computing and Graphics; and Enterprise, Embedded and Semi-Custom. Its products include x86 microprocessors as an accelerated processing unit, chipsets, discrete and integrated graphics processing units (GPUs), data center and professional GPUs, and development services; and server and embedded processors, and semi-custom System-on-Chip (SoC) products, development services, and technology for game consoles. The company provides x86 microprocessors for desktop PCs under the AMD Ryzen, AMD Ryzen PRO, Ryzen, Threadripper, AMD A-Series, AMD FX, AMD Athlon, AMD Athlon PRO, and AMD Pro A-Series processors brands; microprocessors for notebook and 2-in-1s under the AMD Ryzen, AMD A-Series, AMD Athlon, AMD Ryzen PRO, AMD Athlon PRO, and AMD Pro A-Series processors brands; microprocessors for servers under the AMD EPYC and AMD Opteron brands; and chipsets under the AMD trademark. It also offers discrete GPUs for desktop and notebook PCs under the AMD Radeon graphics and AMD Embedded Radeon brands; professional graphics products under the AMD Radeon Pro and AMD FirePro graphics brands; and Radeon Instinct and AMD Instinct accelerators for servers. In addition, the company provides embedded processor solutions under the AMD Opteron, AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series processors brands; and customer-specific solutions based on AMD CPU, GPU, and multi-media technologies, as well as semi-custom SoC products. It serves original equipment manufacturers, public cloud service providers, original design manufacturers, system integrators, independent distributors, online retailers, and add-in-board manufacturers through its direct sales force, independent distributors, and sales representatives. Advanced Micro Devices, Inc. was founded in 1969 and is headquartered in Santa Clara, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "AMK.F": {
        "short_name": "AMKOR TECHN.  DL-,001",
        "long_name": "Amkor Technology, Inc.",
        "summary": "Amkor Technology, Inc. provides outsourced semiconductor packaging and test services in the United States, Japan, Europe, the Middle East, Africa, and rest of the Asia Pacific. It offers turnkey packaging and test services, including semiconductor wafer bump, wafer probe, wafer back-grind, package design, packaging, and test and drop shipment services. The company also provides flip chip scale package products for use in smartphones, tablets, and other mobile consumer electronic devices; flip chip stacked chip scale packages that are used to stack memory, and as applications processors in mobile devices; and flip chip ball grid array products for various networking, storage, computing, and consumer applications. In addition, it offers wafer-level CSP packages that are used in power management, transceivers, sensors, wireless charging, codecs, and specialty silicon; wafer-level fan-out packages for use in ICs; and silicon wafer integrated fan-out technology, which replaces a laminate substrate with a thinner structure. Further, the company provides lead frame packages that are used in electronic devices for low to medium pin count applications; substrate-based wirebond packages, which are used to connect a die to a substrate; micro-electro-mechanical systems (MEMS) packages that are miniaturized mechanical and electro-mechanical devices; and advanced system-in-package modules, which are used in radio frequency and front end modules, basebands, connectivity, fingerprint sensors, display and touch screen drivers, sensors and MEMS, and NAND memory and solid state drives. It primarily serves integrated device manufacturers, fabless semiconductor companies, original equipment manufacturers, and contract foundries. Amkor Technology, Inc. was founded in 1968 and is headquartered in Tempe, Arizona.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Tempe"
    },
    "AMKR": {
        "short_name": "Amkor Technology, Inc.",
        "long_name": "Amkor Technology, Inc.",
        "summary": "Amkor Technology, Inc. provides outsourced semiconductor packaging and test services in the United States, Japan, Europe, the Middle East, Africa, and rest of the Asia Pacific. It offers turnkey packaging and test services, including semiconductor wafer bump, wafer probe, wafer back-grind, package design, packaging, and test and drop shipment services. The company also provides flip chip scale package products for use in smartphones, tablets, and other mobile consumer electronic devices; flip chip stacked chip scale packages that are used to stack memory, and as applications processors in mobile devices; and flip chip ball grid array products for various networking, storage, computing, and consumer applications. In addition, it offers wafer-level CSP packages that are used in power management, transceivers, sensors, wireless charging, codecs, and specialty silicon; wafer-level fan-out packages for use in ICs; and silicon wafer integrated fan-out technology, which replaces a laminate substrate with a thinner structure. Further, the company provides lead frame packages that are used in electronic devices for low to medium pin count applications; substrate-based wirebond packages, which are used to connect a die to a substrate; micro-electro-mechanical systems (MEMS) packages that are miniaturized mechanical and electro-mechanical devices; and advanced system-in-package modules, which are used in radio frequency and front end modules, basebands, connectivity, fingerprint sensors, display and touch screen drivers, sensors and MEMS, and NAND memory and solid state drives. It primarily serves integrated device manufacturers, fabless semiconductor companies, original equipment manufacturers, and contract foundries. Amkor Technology, Inc. was founded in 1968 and is headquartered in Tempe, Arizona.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Tempe"
    },
    "ANL.DE": {
        "short_name": "ANALOG DEVICES INC.DL-166",
        "long_name": "Analog Devices, Inc.",
        "summary": "Analog Devices, Inc. designs, manufactures, tests, and markets integrated circuits (ICs), software, and subsystems that leverage analog, mixed-signal, and digital signal processing technologies. The company offers data converter products, which translate real-world analog signals into digital data, as well as translates digital data into analog signals; high-performance amplifiers to condition analog signals; and radio frequency and microwave ICs to support cellular infrastructure. It also provides power management and reference products for power management and conversion applications in the automotive, communications, industrial, and high-end consumer markets; and microelectromechanical systems technology solutions, including accelerometers used to sense acceleration, gyroscopes to sense rotation, and inertial measurement units to sense multiple degrees of freedom, as well as isolators. In addition, the company offers digital signal processing and system products for high-speed numeric calculations. The company serves clients in the industrial, automotive, consumer, and communications markets through a direct sales force, third-party distributors, and independent sales representatives in the United States, the rest of North and South America, Europe, Japan, China, and rest of Asia, as well as through its Website. Analog Devices, Inc. was founded in 1965 and is headquartered in Wilmington, Massachusetts.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Norwood"
    },
    "ANL.F": {
        "short_name": "ANALOG DEVICES INC.DL-166",
        "long_name": "Analog Devices, Inc.",
        "summary": "Analog Devices, Inc. designs, manufactures, tests, and markets integrated circuits (ICs), software, and subsystems that leverage analog, mixed-signal, and digital signal processing technologies. The company offers data converter products, which translate real-world analog signals into digital data, as well as translates digital data into analog signals; high-performance amplifiers to condition analog signals; and radio frequency and microwave ICs to support cellular infrastructure. It also provides power management and reference products for power management and conversion applications in the automotive, communications, industrial, and high-end consumer markets; and microelectromechanical systems technology solutions, including accelerometers used to sense acceleration, gyroscopes to sense rotation, and inertial measurement units to sense multiple degrees of freedom, as well as isolators. In addition, the company offers digital signal processing and system products for high-speed numeric calculations. The company serves clients in the industrial, automotive, consumer, and communications markets through a direct sales force, third-party distributors, and independent sales representatives in the United States, the rest of North and South America, Europe, Japan, China, and rest of Asia, as well as through its Website. Analog Devices, Inc. was founded in 1965 and is headquartered in Wilmington, Massachusetts.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Norwood"
    },
    "AOSL": {
        "short_name": "Alpha and Omega Semiconductor L",
        "long_name": "Alpha and Omega Semiconductor Limited",
        "summary": "Alpha and Omega Semiconductor Limited designs, develops, and supplies power semiconductor products for computing, consumer electronics, communication, and industrial applications. The company offers power discrete products, including metal-oxide-semiconductor field-effect transistors (MOSFET), SRFETs, XSFET, electrostatic discharge, protected MOSFETs, high and mid-voltage MOSFETs, and insulated gate bipolar transistors. Its power discrete products are used in smart phone chargers, battery packs, notebooks, desktop and servers, data centers, base stations, graphics card, game boxes, TVs, AC adapters, power supplies, motor control, power tools, e-vehicles, white goods and industrial motor drives, UPS systems, solar inverters, and industrial welding. The company also provides power ICs that deliver power, as well as control and regulate the power management variables, such as the flow of current and level of voltage. Its power ICs are used in flat panel displays, TVs, Notebooks, graphic cards, servers, DVD/Blu-Ray players, set-top boxes, and networking equipment. In addition, the company offers aMOS5 family for quick charger, adapter, PC power, server, industrial power, telecom, and datacenter applications; and Transient Voltage Suppressors for notebooks and mobile devices. Further, it provides EZBuck regulators for chipsets used in TVs, servers, data storage systems, networking, and other compact PC systems; SOA MOSFET for hot swap applications; and XSPairFET buck-boost MOSFET for type-c applications, such as notebook, USB hubs, and power banks. Additionally, the company offers input protection switches and TO-leadless packaging technologies. The company operates in Hong Kong, China, South Korea, the United States, and internationally. Alpha and Omega Semiconductor Limited was incorporated in 2000 and is headquartered in Sunnyvale, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Sunnyvale"
    },
    "AOY.F": {
        "short_name": "ALPHA+OMEGA SEMIC.DL-,002",
        "long_name": "Alpha and Omega Semiconductor Limited",
        "summary": "Alpha and Omega Semiconductor Limited designs, develops, and supplies power semiconductor products for computing, consumer electronics, communication, and industrial applications. The company offers power discrete products, including metal-oxide-semiconductor field-effect transistors (MOSFET), SRFETs, XSFET, electrostatic discharge, protected MOSFETs, high and mid-voltage MOSFETs, and insulated gate bipolar transistors. Its power discrete products are used in smart phone chargers, battery packs, notebooks, desktop and servers, data centers, base stations, graphics card, game boxes, TVs, AC adapters, power supplies, motor control, power tools, e-vehicles, white goods and industrial motor drives, UPS systems, solar inverters, and industrial welding. The company also provides power ICs that deliver power, as well as control and regulate the power management variables, such as the flow of current and level of voltage. Its power ICs are used in flat panel displays, TVs, Notebooks, graphic cards, servers, DVD/Blu-Ray players, set-top boxes, and networking equipment. In addition, the company offers aMOS5 family for quick charger, adapter, PC power, server, industrial power, telecom, and datacenter applications; and Transient Voltage Suppressors for notebooks and mobile devices. Further, it provides EZBuck regulators for chipsets used in TVs, servers, data storage systems, networking, and other compact PC systems; SOA MOSFET for hot swap applications; and XSPairFET buck-boost MOSFET for type-c applications, such as notebook, USB hubs, and power banks. Additionally, the company offers input protection switches and TO-leadless packaging technologies. The company operates in Hong Kong, China, South Korea, the United States, and internationally. Alpha and Omega Semiconductor Limited was incorporated in 2000 and is headquartered in Sunnyvale, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Sunnyvale"
    },
    "AVGO.BA": {
        "short_name": "BROADCOM INC",
        "long_name": "Broadcom Inc.",
        "summary": "Broadcom Inc. designs, develops, and supplies semiconductor infrastructure software solutions. It offers semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company's infrastructure software solutions enable customers to plan, develop, automate, manage, and secure applications across mainframe, distributed, mobile, and cloud platforms. It operates through two segments, Semiconductor Solutions and Infrastructure Software. The company was incorporated in 2018 and is based in San Jose, California.",
        "currency": "ARS",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "city": "San Jose"
    },
    "AVGO": {
        "short_name": "Broadcom Inc.",
        "long_name": "Broadcom Inc.",
        "summary": "Broadcom Inc. designs, develops, and supplies semiconductor infrastructure software solutions. It offers semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company's infrastructure software solutions enable customers to plan, develop, automate, manage, and secure applications across mainframe, distributed, mobile, and cloud platforms. It operates through two segments, Semiconductor Solutions and Infrastructure Software. The company was incorporated in 2018 and is based in San Jose, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "San Jose"
    },
    "AVGO34.SA": {
        "short_name": "BROADCOM INCDRN",
        "long_name": "Broadcom Inc.",
        "summary": "Broadcom Inc. designs, develops, and supplies semiconductor infrastructure software solutions. It offers semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company's infrastructure software solutions enable customers to plan, develop, automate, manage, and secure applications across mainframe, distributed, mobile, and cloud platforms. It operates through two segments, Semiconductor Solutions and Infrastructure Software. The company was incorporated in 2018 and is based in San Jose, California.",
        "currency": "BRL",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "San Jose"
    },
    "AVGOP": {
        "short_name": "Broadcom Inc. - 8.00% Mandatory",
        "long_name": "Broadcom Inc.",
        "summary": "Broadcom Inc. designs, develops, and supplies semiconductor infrastructure software solutions. It offers semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company's infrastructure software solutions enable customers to plan, develop, automate, manage, and secure applications across mainframe, distributed, mobile, and cloud platforms. It operates through two segments, Semiconductor Solutions and Infrastructure Software. The company was incorporated in 2018 and is based in San Jose, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "San Jose"
    },
    "AWM.DE": {
        "short_name": "SKYWORKS SOL.  DL-,25",
        "long_name": "Skyworks Solutions, Inc.",
        "summary": "Skyworks Solutions, Inc., together with its subsidiaries, designs, develops, manufactures, and markets proprietary semiconductor products, including intellectual property in the United States, China, South Korea, Taiwan, Europe, the Middle East, Africa, and rest of Asia-Pacific. Its product portfolio includes amplifiers, antenna tuners, attenuators, circulators/isolators, DC/DC converters, demodulators, detectors, diodes, wireless analog system on chip products, directional couplers, diversity receive modules, filters, front-end modules, hybrids, light emitting diode drivers, low noise amplifiers, mixers, modulators, optocouplers/optoisolators, phase locked loops, phase shifters, power dividers/combiners, receivers, switches, synthesizers, technical ceramics, voltage controlled oscillators/synthesizers, and voltage regulators. The company provides its products for use in the aerospace, automotive, broadband, cellular infrastructure, connected home, entertainment and gaming, industrial, medical, military, smartphone, tablet, and wearable markets. It sells its products through direct sales force, electronic component distributors, and independent sales representatives. The company was founded in 1962 and is headquartered in Irvine, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Irvine"
    },
    "AWM.F": {
        "short_name": "SKYWORKS SOL.  DL-,25",
        "long_name": "Skyworks Solutions, Inc.",
        "summary": "Skyworks Solutions, Inc., together with its subsidiaries, designs, develops, manufactures, and markets proprietary semiconductor products, including intellectual property in the United States, China, South Korea, Taiwan, Europe, the Middle East, Africa, and rest of Asia-Pacific. Its product portfolio includes amplifiers, antenna tuners, attenuators, circulators/isolators, DC/DC converters, demodulators, detectors, diodes, wireless analog system on chip products, directional couplers, diversity receive modules, filters, front-end modules, hybrids, light emitting diode drivers, low noise amplifiers, mixers, modulators, optocouplers/optoisolators, phase locked loops, phase shifters, power dividers/combiners, receivers, switches, synthesizers, technical ceramics, voltage controlled oscillators/synthesizers, and voltage regulators. The company provides its products for use in the aerospace, automotive, broadband, cellular infrastructure, connected home, entertainment and gaming, industrial, medical, military, smartphone, tablet, and wearable markets. It sells its products through direct sales force, electronic component distributors, and independent sales representatives. The company was founded in 1962 and is headquartered in Irvine, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Irvine"
    },
    "BROA.VI": {
        "short_name": "Broadcom Inc.",
        "long_name": "Broadcom Inc.",
        "summary": "Broadcom Inc. designs, develops, and supplies semiconductor infrastructure software solutions. It offers semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company's infrastructure software solutions enable customers to plan, develop, automate, manage, and secure applications across mainframe, distributed, mobile, and cloud platforms. It operates through two segments, Semiconductor Solutions and Infrastructure Software. The company was incorporated in 2018 and is based in San Jose, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "San Jose"
    },
    "CEVA.MX": {
        "short_name": "CEVA INC",
        "long_name": "CEVA, Inc.",
        "summary": "CEVA, Inc. operates as a licensor of wireless connectivity and smart sensing platforms to semiconductor and original equipment manufacturer (OEM) companies worldwide. It designs and licenses various digital signal processors, AI processors, wireless platforms, and complementary software for sensor fusion, image enhancement, computer vision, voice input, and artificial intelligence (AI). The company licenses a family of signal processing intellectual properties (IPs), including DSP-based platforms for 5G baseband processing in mobile and infrastructure; imaging and computer vision for any camera-enabled devices; audio/voice/speech and ultra-low power applications for multiple IoT markets; sensor fusion software and inertial measurement unit solutions for AR/VR, robotics, remote controls, and IoT; AI processors capable of handling the gamut of neural network workload and on-device; IPs for Bluetooth, Wi-Fi 4/5/6, and NB-IoT. Its technologies are licensed to companies, which design, manufacture, market, and sell application-specific integrated circuits and application-specific standard products to wireless, consumer electronics, and automotive companies for incorporation into various end products. The company delivers its DSP cores, platforms, and AI processors in the form of a hardware description language definition; and offers development platforms, software development kits, and software debug tools that facilitate system design, debug, and software development. The company licenses its technology through a direct sales force. The company was formerly known as ParthusCeva, Inc. and changed its name to CEVA, Inc. in December 2003. CEVA, Inc. was incorporated in 1999 and is headquartered in Rockville, Maryland.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Rockville"
    },
    "CEVA": {
        "short_name": "CEVA, Inc.",
        "long_name": "CEVA, Inc.",
        "summary": "CEVA, Inc. operates as a licensor of wireless connectivity and smart sensing platforms to semiconductor and original equipment manufacturer (OEM) companies worldwide. It designs and licenses various digital signal processors, AI processors, wireless platforms, and complementary software for sensor fusion, image enhancement, computer vision, voice input, and artificial intelligence (AI). The company licenses a family of signal processing intellectual properties (IPs), including DSP-based platforms for 5G baseband processing in mobile and infrastructure; imaging and computer vision for any camera-enabled devices; audio/voice/speech and ultra-low power applications for multiple IoT markets; sensor fusion software and inertial measurement unit solutions for AR/VR, robotics, remote controls, and IoT; AI processors capable of handling the gamut of neural network workload and on-device; IPs for Bluetooth, Wi-Fi 4/5/6, and NB-IoT. Its technologies are licensed to companies, which design, manufacture, market, and sell application-specific integrated circuits and application-specific standard products to wireless, consumer electronics, and automotive companies for incorporation into various end products. The company delivers its DSP cores, platforms, and AI processors in the form of a hardware description language definition; and offers development platforms, software development kits, and software debug tools that facilitate system design, debug, and software development. The company licenses its technology through a direct sales force. The company was formerly known as ParthusCeva, Inc. and changed its name to CEVA, Inc. in December 2003. CEVA, Inc. was incorporated in 1999 and is headquartered in Rockville, Maryland.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Rockville"
    },
    "CR6.DE": {
        "short_name": "CREE INC.  DL-,00125",
        "long_name": "Cree, Inc.",
        "summary": "Cree, Inc. provides lighting-class light emitting diode (LED) and semiconductor products for power and radio-frequency (RF) applications in the United States, China, Europe, and internationally. It operates in two segments, Wolfspeed and LED Products. The Wolfspeed segment offers silicon carbide (SiC) materials for RF, power switching, gemstones, and other applications. It also provides SiC power device products, including SiC Schottky diodes, metal oxide semiconductor field effect transistors (MOSFETs), power modules, and gate driver boards for electric vehicles, including charging infrastructure, server power supplies, solar inverters, uninterruptible power supplies, industrial power supplies, and other applications. In addition, this segment offers gallium nitride (GaN) die, high-electron mobility transistors (HEMTs), monolithic microwave integrated circuits (MMICs), and laterally diffused MOSFET (LDMOS) power transistors for telecommunications infrastructure, military, and other commercial applications; and custom die manufacturing services for GaN HEMTs and MMICs. The LED Products segment provides blue and green LED chip products for video screens, gaming displays, function indicator lights and automotive backlights, headlamps, and directional indicators. It also offers XLamp LED components and LED modules for lighting applications; and surface mount and through-hole packaged LED products for video, signage, general illumination, transportation, gaming, and specialty lighting applications. The company was founded in 1987 and is headquartered in Durham, North Carolina.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Durham"
    },
    "CR6.F": {
        "short_name": "CREE INC.  DL-,00125",
        "long_name": "Cree, Inc.",
        "summary": "Cree, Inc. provides lighting-class light emitting diode (LED) and semiconductor products for power and radio-frequency (RF) applications in the United States, China, Europe, and internationally. It operates in two segments, Wolfspeed and LED Products. The Wolfspeed segment offers silicon carbide (SiC) materials for RF, power switching, gemstones, and other applications. It also provides SiC power device products, including SiC Schottky diodes, metal oxide semiconductor field effect transistors (MOSFETs), power modules, and gate driver boards for electric vehicles, including charging infrastructure, server power supplies, solar inverters, uninterruptible power supplies, industrial power supplies, and other applications. In addition, this segment offers gallium nitride (GaN) die, high-electron mobility transistors (HEMTs), monolithic microwave integrated circuits (MMICs), and laterally diffused MOSFET (LDMOS) power transistors for telecommunications infrastructure, military, and other commercial applications; and custom die manufacturing services for GaN HEMTs and MMICs. The LED Products segment provides blue and green LED chip products for video screens, gaming displays, function indicator lights and automotive backlights, headlamps, and directional indicators. It also offers XLamp LED components and LED modules for lighting applications; and surface mount and through-hole packaged LED products for video, signage, general illumination, transportation, gaming, and specialty lighting applications. The company was founded in 1987 and is headquartered in Durham, North Carolina.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Durham"
    },
    "CREE.MX": {
        "short_name": "CREE INC",
        "long_name": "Cree, Inc.",
        "summary": "Cree, Inc. provides lighting-class light emitting diode (LED) and semiconductor products for power and radio-frequency (RF) applications in the United States, China, Europe, and internationally. It operates in two segments, Wolfspeed and LED Products. The Wolfspeed segment offers silicon carbide (SiC) materials for RF, power switching, gemstones, and other applications. It also provides SiC power device products, including SiC Schottky diodes, metal oxide semiconductor field effect transistors (MOSFETs), power modules, and gate driver boards for electric vehicles, including charging infrastructure, server power supplies, solar inverters, uninterruptible power supplies, industrial power supplies, and other applications. In addition, this segment offers gallium nitride (GaN) die, high-electron mobility transistors (HEMTs), monolithic microwave integrated circuits (MMICs), and laterally diffused MOSFET (LDMOS) power transistors for telecommunications infrastructure, military, and other commercial applications; and custom die manufacturing services for GaN HEMTs and MMICs. The LED Products segment provides blue and green LED chip products for video screens, gaming displays, function indicator lights and automotive backlights, headlamps, and directional indicators. It also offers XLamp LED components and LED modules for lighting applications; and surface mount and through-hole packaged LED products for video, signage, general illumination, transportation, gaming, and specialty lighting applications. The company was founded in 1987 and is headquartered in Durham, North Carolina.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Durham"
    },
    "CREE": {
        "short_name": "Cree, Inc.",
        "long_name": "Cree, Inc.",
        "summary": "Cree, Inc. provides lighting-class light emitting diode (LED) and semiconductor products for power and radio-frequency (RF) applications in the United States, China, Europe, and internationally. It operates in two segments, Wolfspeed and LED Products. The Wolfspeed segment offers silicon carbide (SiC) materials for RF, power switching, gemstones, and other applications. It also provides SiC power device products, including SiC Schottky diodes, metal oxide semiconductor field effect transistors (MOSFETs), power modules, and gate driver boards for electric vehicles, including charging infrastructure, server power supplies, solar inverters, uninterruptible power supplies, industrial power supplies, and other applications. In addition, this segment offers gallium nitride (GaN) die, high-electron mobility transistors (HEMTs), monolithic microwave integrated circuits (MMICs), and laterally diffused MOSFET (LDMOS) power transistors for telecommunications infrastructure, military, and other commercial applications; and custom die manufacturing services for GaN HEMTs and MMICs. The LED Products segment provides blue and green LED chip products for video screens, gaming displays, function indicator lights and automotive backlights, headlamps, and directional indicators. It also offers XLamp LED components and LED modules for lighting applications; and surface mount and through-hole packaged LED products for video, signage, general illumination, transportation, gaming, and specialty lighting applications. The company was founded in 1987 and is headquartered in Durham, North Carolina.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Durham"
    },
    "CRU.F": {
        "short_name": "CIRRUS LOGIC INC.",
        "long_name": "Cirrus Logic, Inc.",
        "summary": "Cirrus Logic, Inc., a fabless semiconductor company, develops, manufactures, and markets analog and mixed-signal integrated circuits (ICs) in the United States and internationally. It offers portable products, including codecs-chips that integrate analog-to-digital converters (ADCs) and digital-to-analog converters (DACs) into a single IC; smart codecs, a codec with digital signal processer; boosted amplifiers; micro-electromechanical systems microphones; haptic drivers; digital signal processors; and SoundClear technology, which consists of a portfolio of tools, software, and algorithms that offer enhanced voice quality, voice capture, and audio playback features. The company provides its portable products for use in smartphones, tablets, digital headsets; and wearables. It also offers non-portable and other products comprising codecs, ADCs, DACs, digital interfaces, and amplifiers for use in laptops, home theater systems, and musical instruments; satellite radio systems; and high-precision industrial and energy-related applications, including digital utility meters, power supplies, energy control, energy measurement, and energy exploration applications. The company markets and sells its products through direct sales force, external sales representatives, and distributors. Cirrus Logic, Inc. was founded in 1984 and is headquartered in Austin, Texas",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Austin"
    },
    "CRUS.MX": {
        "short_name": "CIRRUS LOGIC INC",
        "long_name": "Cirrus Logic, Inc.",
        "summary": "Cirrus Logic, Inc., a fabless semiconductor company, develops, manufactures, and markets analog and mixed-signal integrated circuits (ICs) in the United States and internationally. It offers portable products, including codecs-chips that integrate analog-to-digital converters (ADCs) and digital-to-analog converters (DACs) into a single IC; smart codecs, a codec with digital signal processer; boosted amplifiers; micro-electromechanical systems microphones; haptic drivers; digital signal processors; and SoundClear technology, which consists of a portfolio of tools, software, and algorithms that offer enhanced voice quality, voice capture, and audio playback features. The company provides its portable products for use in smartphones, tablets, digital headsets; and wearables. It also offers non-portable and other products comprising codecs, ADCs, DACs, digital interfaces, and amplifiers for use in laptops, home theater systems, and musical instruments; satellite radio systems; and high-precision industrial and energy-related applications, including digital utility meters, power supplies, energy control, energy measurement, and energy exploration applications. The company markets and sells its products through direct sales force, external sales representatives, and distributors. Cirrus Logic, Inc. was founded in 1984 and is headquartered in Austin, Texas",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Austin"
    },
    "CRUS": {
        "short_name": "Cirrus Logic, Inc.",
        "long_name": "Cirrus Logic, Inc.",
        "summary": "Cirrus Logic, Inc., a fabless semiconductor company, develops, manufactures, and markets analog and mixed-signal integrated circuits (ICs) in the United States and internationally. It offers portable products, including codecs-chips that integrate analog-to-digital converters (ADCs) and digital-to-analog converters (DACs) into a single IC; smart codecs, a codec with digital signal processer; boosted amplifiers; micro-electromechanical systems microphones; haptic drivers; digital signal processors; and SoundClear technology, which consists of a portfolio of tools, software, and algorithms that offer enhanced voice quality, voice capture, and audio playback features. The company provides its portable products for use in smartphones, tablets, digital headsets; and wearables. It also offers non-portable and other products comprising codecs, ADCs, DACs, digital interfaces, and amplifiers for use in laptops, home theater systems, and musical instruments; satellite radio systems; and high-precision industrial and energy-related applications, including digital utility meters, power supplies, energy control, energy measurement, and energy exploration applications. The company markets and sells its products through direct sales force, external sales representatives, and distributors. Cirrus Logic, Inc. has collaboration with Elliptic Labs. Cirrus Logic, Inc. was founded in 1984 and is headquartered in Austin, Texas",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Austin"
    },
    "CXCQ": {
        "short_name": "CARDXX INC",
        "long_name": "Cardxx Inc.",
        "summary": "Cardxx Inc. manufactures and sells smart cards, key fobs, and other portable devices using Reaction Assisted Molded Process (RAMP). RAMP is used to securely integrate a mini computer, microcircuit, integrated circuit, radio frequency antennae, or a radio frequency identification element into a small form factor smart card or smart tag. The company also produces multi-media cards, secure digital cards, and key chain fobs. Cardxx Inc. is based in Englewood, Colorado.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Englewood"
    },
    "CYBL": {
        "short_name": "CYBERLUX CORP",
        "long_name": "Cyberlux Corporation",
        "summary": "Cyberlux Corporation designs, develops, and markets portable lighting products for commercial and industrial users in the United States. The company offers BrightEye tactical illumination systems and related products that address the lighting needs of various branches of the military and government organization, including the National Guard, the U. S. Air Force, and the U.S. Army. It serves the Department of Defense/military markets, as well as Homeland Security customers. The company was founded in 2000 and is based in Durham, North Carolina.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Durham"
    },
    "DDQ.F": {
        "short_name": "DIODES INC.  DL -,666",
        "long_name": "Diodes Incorporated",
        "summary": "Diodes Incorporated designs, manufactures, and supplies application-specific standard products in the discrete, logic, and analog and mixed-signal semiconductor markets worldwide. It primarily focuses on low pin count semiconductor devices with one or more active and/or passive components. The company offers discrete semiconductor products, such as MOSFET, TVS, and performance Schottky rectifiers; GPP bridges and retifiers performance Schottky diodes; Zener and performance Zener diodes, including tight tolerance and low operating current type; standard, fast, super-fast, and ultra-fast recovery rectifiers; bridge rectifiers; switching diodes; small signal bipolar and prebiased transistors; other MOSFETs; thyristor surge protection devices; and transient voltage suppressors. It also provides analog products comprising power management devices consisting of AC-DC and DC-DC converters, USB power switches, and low dropout and linear voltage regulators; linear devices, such as operational amplifiers and comparators, current monitors, voltage references, and reset generators; LED lighting drivers; audio amplifiers; and sensor products, including hall-effect sensors and motor drivers. The company offers mixed-signal products, such as high speed mux/demux products, digital switches, interfaces, redelivers, clock ICs, and packet switches; standard logic products comprising low-voltage complementary metalÂ\u0096oxideÂ\u0096semiconductor (CMOS) and high-speed CMOS devices; ultra-low power CMOS logic products and analog switches; multichip products and co-packaged discrete, analog, and mixed-signal silicon in miniature packages; silicon and silicon epitaxial wafers; and crystals and oscillators. It sells its products to the consumer electronics, computing, communications, industrial, and automotive markets through direct sales and marketing personnel, independent sales representatives, and distributors. The company was incorporated in 1959 and is headquartered in Plano, Texas.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Plano"
    },
    "DIOD": {
        "short_name": "Diodes Incorporated",
        "long_name": "Diodes Incorporated",
        "summary": "Diodes Incorporated designs, manufactures, and supplies application-specific standard products in the discrete, logic, and analog and mixed-signal semiconductor markets worldwide. It primarily focuses on low pin count semiconductor devices with one or more active and/or passive components. The company offers discrete semiconductor products, such as MOSFET, TVS, and performance Schottky rectifiers; GPP bridges and retifiers performance Schottky diodes; Zener and performance Zener diodes, including tight tolerance and low operating current type; standard, fast, super-fast, and ultra-fast recovery rectifiers; bridge rectifiers; switching diodes; small signal bipolar and prebiased transistors; other MOSFETs; thyristor surge protection devices; and transient voltage suppressors. It also provides analog products comprising power management devices consisting of AC-DC and DC-DC converters, USB power switches, and low dropout and linear voltage regulators; linear devices, such as operational amplifiers and comparators, current monitors, voltage references, and reset generators; LED lighting drivers; audio amplifiers; and sensor products, including hall-effect sensors and motor drivers. The company offers mixed-signal products, such as high speed mux/demux products, digital switches, interfaces, redelivers, clock ICs, and packet switches; standard logic products comprising low-voltage complementary metalÂ\u0096oxideÂ\u0096semiconductor (CMOS) and high-speed CMOS devices; ultra-low power CMOS logic products and analog switches; multichip products and co-packaged discrete, analog, and mixed-signal silicon in miniature packages; silicon and silicon epitaxial wafers; and crystals and oscillators. It sells its products to the consumer electronics, computing, communications, industrial, and automotive markets through direct sales and marketing personnel, independent sales representatives, and distributors. The company was incorporated in 1959 and is headquartered in Plano, Texas.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Plano"
    },
    "DP3.F": {
        "short_name": "DSP GRP INC.  DL-,001",
        "long_name": "DSP Group, Inc.",
        "summary": "DSP Group, Inc., a fabless semiconductor company, provides wireless chipset solutions. It operates through three segments: Home, Unified Communications, and SmartVoice. The Home segment offers wireless chipset solutions for converged communication at home, including integrated circuits for cordless phones, home gateway devices, integrated circuits addressing home automation applications, and fixed-mobile convergence solutions. The Unified Communications segment offers solution for unified communications products, including office solutions that offer businesses VoIP terminals with converged voice and data applications. The SmartVoice segment offers products for the SmartVoice market that provide voice activation and recognition, voice enhancement, always-on and far-end noise elimination that target mobile phones, mobile headsets, and other devices. The company markets and distributes its products through direct sales and marketing offices; and a network of global distributors to original equipment manufacturers and original design manufacturers. It has operations in the United States, Europe, Israel, Hong Kong, China, Japan, South Korea, Taiwan, India, Switzerland, and internationally. DSP Group, Inc. was incorporated in 1987 and is headquartered in San Jose, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "San Jose"
    },
    "DSPG": {
        "short_name": "DSP Group, Inc.",
        "long_name": "DSP Group, Inc.",
        "summary": "DSP Group, Inc., a fabless semiconductor company, provides wireless chipset solutions. It operates through three segments: Home, Unified Communications, and SmartVoice. The Home segment offers wireless chipset solutions for converged communication at home, including integrated circuits for cordless phones, home gateway devices, integrated circuits addressing home automation applications, and fixed-mobile convergence solutions. The Unified Communications segment offers solution for unified communications products, including office solutions that offer businesses VoIP terminals with converged voice and data applications. The SmartVoice segment offers products for the SmartVoice market that provide voice activation and recognition, voice enhancement, always-on and far-end noise elimination that target mobile phones, mobile headsets, and other devices. The company markets and distributes its products through direct sales and marketing offices; and a network of global distributors to original equipment manufacturers and original design manufacturers. It has operations in the United States, Europe, Israel, Hong Kong, China, Japan, South Korea, Taiwan, India, Switzerland, and internationally. DSP Group, Inc. was incorporated in 1987 and is headquartered in San Jose, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "San Jose"
    },
    "E5N.F": {
        "short_name": "EVERSPIN TECHN. DL -,0001",
        "long_name": "Everspin Technologies, Inc.",
        "summary": "Everspin Technologies, Inc. manufactures and sells magnetoresistive random access memory (MRAM) products in the United States, Hong Kong, Japan, China, Germany, and internationally. It offers Toggle MRAM, spin-transfer torque MRAM, and tunnel magneto resistance sensor products, as well as foundry services for embedded MRAM. The company provides its products for applications, including data center, industrial, medical, automotive, aerospace, and transportation markets. It serves original equipment manufacturers and original design manufacturers through a direct sales channel and a network of representatives and distributors. Everspin Technologies, Inc. was incorporated in 2008 and is headquartered in Chandler, Arizona.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Chandler"
    },
    "EMKR": {
        "short_name": "EMCORE Corporation",
        "long_name": "EMCORE Corporation",
        "summary": "EMCORE Corporation, together with its subsidiaries, provides advanced mixed-signal optics products in the United States, Canada, Asia, Europe, and internationally. The company offers cable television (CATV) products, including forward and return-path analog lasers, receivers, photodetectors, and subassembly components; and analog and digital fiber-optic transmitters, quadrature amplitude modulation transmitters, optical switches, and CATV fiber amplifiers. It also provides high-power gain chips products, photodiode products, and GPON fiber-to-the-premises (FTTP) and data center chip products for the telecommunication markets, as well as lasers, receivers, and photodetector components for wireless, distributed sensing, and light detecting and ranging applications. In addition, the company offers navigation system and inertial sensing products, such as fiber optic gyroscope, quartz MEMS gyroscope, and inertial measurement unit and navigation system primarily for the aerospace and defense markets; and defense optoelectronics, such as optiva platform fiber optic transport systems and erbium doped fiber amplifiers, as well as ruggedized microwave flange-mount transmitters, receivers, and optical delay line products. It serves CATV, wireless, FTTP, long-term evolution, and data center markets; and aerospace and defense and satellite communications markets. The company sells its products through direct sales force, application engineers, third party sales representatives, and distributors. EMCORE Corporation was founded in 1984 and is headquartered in Alhambra, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Alhambra"
    },
    "ER2N.F": {
        "short_name": "EMCORE CORP. NEW",
        "long_name": "EMCORE Corporation",
        "summary": "EMCORE Corporation, together with its subsidiaries, provides advanced mixed-signal optics products in the United States, Canada, Asia, Europe, and internationally. The company offers cable television (CATV) products, including forward and return-path analog lasers, receivers, photodetectors, and subassembly components; and analog and digital fiber-optic transmitters, quadrature amplitude modulation transmitters, optical switches, and CATV fiber amplifiers. It also provides high-power gain chips products, photodiode products, and GPON fiber-to-the-premises (FTTP) and data center chip products for the telecommunication markets, as well as lasers, receivers, and photodetector components for wireless, distributed sensing, and light detecting and ranging applications. In addition, the company offers navigation system and inertial sensing products, such as fiber optic gyroscope, quartz MEMS gyroscope, and inertial measurement unit and navigation system primarily for the aerospace and defense markets; and defense optoelectronics, such as optiva platform fiber optic transport systems and erbium doped fiber amplifiers, as well as ruggedized microwave flange-mount transmitters, receivers, and optical delay line products. It serves CATV, wireless, FTTP, long-term evolution, and data center markets; and aerospace and defense and satellite communications markets. The company sells its products through direct sales force, application engineers, third party sales representatives, and distributors. EMCORE Corporation was founded in 1984 and is headquartered in Alhambra, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Alhambra"
    },
    "FMF.F": {
        "short_name": "FORMFACTOR INC.  DL-,001",
        "long_name": "FormFactor, Inc.",
        "summary": "FormFactor, Inc. designs, manufactures, and sells probe cards, analytical probes, probe stations, metrology systems, thermal systems, and cryogenic systems to semiconductor companies and scientific institutions. It operates in two segments, Probe Cards and Systems. The company offers probe cards to test various semiconductor device types, including systems on a chip products, mobile application processors, microprocessors, microcontrollers, and graphic processors, as well as radio frequency, analog, mixed signal, image sensor, electro-optical, dynamic random access memory, NAND flash memory, and NOR flash memory devices; and analytical probes, which are used for a range of applications, including device characterization, electrical simulation model development, failure analysis, and prototype design debugging for universities, research institutions, semiconductor integrated device manufacturers, semiconductor foundries, and fabless semiconductor companies. It also provides probing systems for semiconductor design engineers to capture and analyse accurate data; surface metrology systems for the development, production, and quality control of semiconductor products; thermal subsystems consisting of thermal chucks and other test systems used in probe stations; and precision cryogenic instruments. In addition, the company offers on-site probe card maintenance and service training, seminars, and telephone support services. The company markets and sells its products through direct sales force, manufacturers' representatives, and distributors in the United States, Taiwan, South Korea, China, Japan, Europe, the Asia-Pacific, and internationally. FormFactor, Inc. was incorporated in 1993 and is headquartered in Livermore, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Livermore"
    },
    "FORM": {
        "short_name": "FormFactor, Inc.",
        "long_name": "FormFactor, Inc.",
        "summary": "FormFactor, Inc. designs, manufactures, and sells probe cards, analytical probes, probe stations, metrology systems, thermal systems, and cryogenic systems to semiconductor companies and scientific institutions. It operates in two segments, Probe Cards and Systems. The company offers probe cards to test various semiconductor device types, including systems on a chip products, mobile application processors, microprocessors, microcontrollers, and graphic processors, as well as radio frequency, analog, mixed signal, image sensor, electro-optical, dynamic random access memory, NAND flash memory, and NOR flash memory devices; and analytical probes, which are used for a range of applications, including device characterization, electrical simulation model development, failure analysis, and prototype design debugging for universities, research institutions, semiconductor integrated device manufacturers, semiconductor foundries, and fabless semiconductor companies. It also provides probing systems for semiconductor design engineers to capture and analyse accurate data; surface metrology systems for the development, production, and quality control of semiconductor products; thermal subsystems consisting of thermal chucks and other test systems used in probe stations; and precision cryogenic instruments. In addition, the company offers on-site probe card maintenance and service training, seminars, and telephone support services. The company markets and sells its products through direct sales force, manufacturers' representatives, and distributors in the United States, Taiwan, South Korea, China, Japan, Europe, the Asia-Pacific, and internationally. FormFactor, Inc. was incorporated in 1993 and is headquartered in Livermore, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Livermore"
    },
    "GSIT": {
        "short_name": "GSI Technology, Inc.",
        "long_name": "GSI Technology, Inc.",
        "summary": "GSI Technology, Inc., a fabless semiconductor company, designs, develops, and markets semiconductor memory solutions to networking, industrial, medical, aerospace, and military customers in the United States, China, Singapore, Germany, the Netherlands, and internationally. It offers static random access memory (SRAM) products, such as SyncBurst for microprocessor cache and other applications; No Bus Turnaround SRAMs to address the needs of networking and telecom applications; SigmaQuad and SigmaDDR products for density and random transaction rate requirements of networking and telecom applications; and radiation-hardened and radiation-tolerant SRAMs for aerospace and military applications, such as networking satellites and missiles. Its products are used in a range of networking and telecommunications equipment, including core routers, multi-service access routers, universal gateways, enterprise edge routers, service provider edge routers, optical edge routers, fast Ethernet switches, wireless base stations, and network access equipment; military and aerospace applications, such as radar and guidance systems and satellites; professional audio applications comprising sound mixing systems; test and measurement applications, consisting of high-speed testers; and automotive applications such as smart cruise control; and medical applications, including ultrasound and CAT scan equipment. The company markets its products through a network of independent sales representatives and distributors. GSI Technology, Inc. was founded in 1995 and is headquartered in Sunnyvale, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Sunnyvale"
    },
    "INCO.BR": {
        "short_name": "INTEL CORP",
        "long_name": "Intel Corporation",
        "summary": "Intel Corporation designs, manufactures, and sells essential technologies for the cloud, smart, and connected devices for retail, industrial, and consumer uses worldwide. The company operates through DCG, IOTG, Mobileye, NSG, PSG, CCG, and All Other segments. It offers platform products, such as central processing units and chipsets, and system-on-chip and multichip packages; and non-platform or adjacent products comprising accelerators, boards and systems, connectivity products, and memory and storage products. The company also provides Internet of Things products, including high-performance compute solutions for targeted verticals and embedded applications; and computer vision and machine learning-based sensing, data analysis, localization, mapping, and driving policy technology. It serves original equipment manufacturers, original design manufacturers, and cloud service providers. Intel Corporation has a strategic partnership with MILA to develop and apply advances in artificial intelligence methods for enhancing the search in the space of drugs. The company was founded in 1968 and is headquartered in Santa Clara, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "BRU",
        "market": "be_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "INL.DE": {
        "short_name": "INTEL CORP.  DL-,001",
        "long_name": "Intel Corporation",
        "summary": "Intel Corporation designs, manufactures, and sells essential technologies for the cloud, smart, and connected devices for retail, industrial, and consumer uses worldwide. The company operates through DCG, IOTG, Mobileye, NSG, PSG, CCG, and All Other segments. It offers platform products, such as central processing units and chipsets, and system-on-chip and multichip packages; and non-platform or adjacent products comprising accelerators, boards and systems, connectivity products, and memory and storage products. The company also provides Internet of Things products, including high-performance compute solutions for targeted verticals and embedded applications; and computer vision and machine learning-based sensing, data analysis, localization, mapping, and driving policy technology. It serves original equipment manufacturers, original design manufacturers, and cloud service providers. Intel Corporation has a strategic partnership with MILA to develop and apply advances in artificial intelligence methods for enhancing the search in the space of drugs. The company was founded in 1968 and is headquartered in Santa Clara, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "INL.F": {
        "short_name": "INTEL CORP.  DL-,001",
        "long_name": "Intel Corporation",
        "summary": "Intel Corporation designs, manufactures, and sells essential technologies for the cloud, smart, and connected devices for retail, industrial, and consumer uses worldwide. The company operates through DCG, IOTG, Mobileye, NSG, PSG, CCG, and All Other segments. It offers platform products, such as central processing units and chipsets, and system-on-chip and multichip packages; and non-platform or adjacent products comprising accelerators, boards and systems, connectivity products, and memory and storage products. The company also provides Internet of Things products, including high-performance compute solutions for targeted verticals and embedded applications; and computer vision and machine learning-based sensing, data analysis, localization, mapping, and driving policy technology. It serves original equipment manufacturers, original design manufacturers, and cloud service providers. Intel Corporation has a strategic partnership with MILA to develop and apply advances in artificial intelligence methods for enhancing the search in the space of drugs. The company was founded in 1968 and is headquartered in Santa Clara, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "INTC.BA": {
        "short_name": "INTEL CORP",
        "long_name": "Intel Corporation",
        "summary": "Intel Corporation designs, manufactures, and sells essential technologies for the cloud, smart, and connected devices for retail, industrial, and consumer uses worldwide. The company operates through DCG, IOTG, Mobileye, NSG, PSG, CCG, and All Other segments. It offers platform products, such as central processing units and chipsets, and system-on-chip and multichip packages; and non-platform or adjacent products comprising accelerators, boards and systems, connectivity products, and memory and storage products. The company also provides Internet of Things products, including high-performance compute solutions for targeted verticals and embedded applications; and computer vision and machine learning-based sensing, data analysis, localization, mapping, and driving policy technology. It serves original equipment manufacturers, original design manufacturers, and cloud service providers. Intel Corporation has a strategic partnership with MILA to develop and apply advances in artificial intelligence methods for enhancing the search in the space of drugs. The company was founded in 1968 and is headquartered in Santa Clara, California.",
        "currency": "ARS",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "INTC.MX": {
        "short_name": "INTEL CORP",
        "long_name": "Intel Corporation",
        "summary": "Intel Corporation designs, manufactures, and sells essential technologies for the cloud, smart, and connected devices for retail, industrial, and consumer uses worldwide. The company operates through DCG, IOTG, Mobileye, NSG, PSG, CCG, and All Other segments. It offers platform products, such as central processing units and chipsets, and system-on-chip and multichip packages; and non-platform or adjacent products comprising accelerators, boards and systems, connectivity products, and memory and storage products. The company also provides Internet of Things products, including high-performance compute solutions for targeted verticals and embedded applications; and computer vision and machine learning-based sensing, data analysis, localization, mapping, and driving policy technology. It serves original equipment manufacturers, original design manufacturers, and cloud service providers. Intel Corporation has a strategic partnership with MILA to develop and apply advances in artificial intelligence methods for enhancing the search in the space of drugs. The company was founded in 1968 and is headquartered in Santa Clara, California.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "INTC": {
        "short_name": "Intel Corporation",
        "long_name": "Intel Corporation",
        "summary": "Intel Corporation designs, manufactures, and sells essential technologies for the cloud, smart, and connected devices for retail, industrial, and consumer uses worldwide. The company operates through DCG, IOTG, Mobileye, NSG, PSG, CCG, and All Other segments. It offers platform products, such as central processing units and chipsets, and system-on-chip and multichip packages; and non-platform or adjacent products comprising accelerators, boards and systems, connectivity products, and memory and storage products. The company also provides Internet of Things products, including high-performance compute solutions for targeted verticals and embedded applications; and computer vision and machine learning-based sensing, data analysis, localization, mapping, and driving policy technology. It serves original equipment manufacturers, original design manufacturers, and cloud service providers. Intel Corporation has a strategic partnership with MILA to develop and apply advances in artificial intelligence methods for enhancing the search in the space of drugs. The company was founded in 1968 and is headquartered in Santa Clara, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "INTC.SN": {
        "short_name": "INTEL CORP",
        "long_name": "Intel Corporation",
        "summary": "Intel Corporation designs, manufactures, and sells essential technologies for the cloud, smart, and connected devices for retail, industrial, and consumer uses worldwide. The company operates through DCG, IOTG, Mobileye, NSG, PSG, CCG, and All Other segments. It offers platform products, such as central processing units and chipsets, and system-on-chip and multichip packages; and non-platform or adjacent products comprising accelerators, boards and systems, connectivity products, and memory and storage products. The company also provides Internet of Things products, including high-performance compute solutions for targeted verticals and embedded applications; and computer vision and machine learning-based sensing, data analysis, localization, mapping, and driving policy technology. It serves original equipment manufacturers, original design manufacturers, and cloud service providers. Intel Corporation has a strategic partnership with MILA to develop and apply advances in artificial intelligence methods for enhancing the search in the space of drugs. The company was founded in 1968 and is headquartered in Santa Clara, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "INTC.VI": {
        "short_name": "INTEL CORP",
        "long_name": "Intel Corporation",
        "summary": "Intel Corporation designs, manufactures, and sells essential technologies for the cloud, smart, and connected devices for retail, industrial, and consumer uses worldwide. The company operates through DCG, IOTG, Mobileye, NSG, PSG, CCG, and All Other segments. It offers platform products, such as central processing units and chipsets, and system-on-chip and multichip packages; and non-platform or adjacent products comprising accelerators, boards and systems, connectivity products, and memory and storage products. The company also provides Internet of Things products, including high-performance compute solutions for targeted verticals and embedded applications; and computer vision and machine learning-based sensing, data analysis, localization, mapping, and driving policy technology. It serves original equipment manufacturers, original design manufacturers, and cloud service providers. Intel Corporation has a strategic partnership with MILA to develop and apply advances in artificial intelligence methods for enhancing the search in the space of drugs. The company was founded in 1968 and is headquartered in Santa Clara, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "INTT": {
        "short_name": "inTest Corporation",
        "long_name": "inTEST Corporation",
        "summary": "inTEST Corporation supplies test and process solutions for use in manufacturing and testing in automotive, defense/aerospace, energy, industrial, medical, semiconductor, and telecommunications markets worldwide. The company operates in two segments, Thermal Products (Thermal) and Electromechanical Semiconductor Products (EMS). The Thermal segment offers ThermoStream products that are used in the semi market as a stand-alone temperature management tool, or in various electronic test applications; Thermal Chambers; Thermal Platforms; Thermonics temperature conditioning products that provide tempered gas or fluid to enable customers to maintain desired thermal conditions within their tool or process; and EKOHEAT and EASYHEAT induction heating systems for annealing, bonding, brazing, curing, forging, heat treating, melting, shrink-fitting, soldering, and testing. The EMS segment provides in2, Cobal, and LS series manipulators that hold various test heads and enable an operator to reposition a test head for alternate use with various probers or handlers on a test floor; and docking hardware products, which protect the interface contacts and ensure proper repeatable and precise alignment between the test head's interface board and the prober's probing assembly or the handler's test socket. This segment also offers tester interfaces that provide electrical connections between the tester and the wafer prober or integrated circuit (IC) handler to carry the electrical signals between the tester and the probe card on the prober or the test socket on the handler. Its products are used in production testing of wafers and specialized packaged ICs in back-end testing by semiconductor manufacturers. The company markets and sells its products to semiconductor manufacturers, semiconductor test subcontractors, third-party foundries, test and assembly providers, and original equipment manufacturers. The company was incorporated in 1981 and is headquartered in Mount Laurel, New Jersey.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "city": "Mount Laurel"
    },
    "ITCJ": {
        "short_name": "INFINITE TECHNOLOGY CORP(DELAWA",
        "long_name": "Infinite Technology Corp.",
        "summary": "Infinite Technology Corporation is a technology firm that offers application specific integrated circuit, digital signal processor, and System-on-Chip design services, technologies, and product solutions. The company develops intellectual property (IP) for designing digital signal processor cores and related integrated circuit system designs. In addition, it performs ASIC and SoC design services for semiconductor firms including TI, Burr-Brown, Intel, and Nippon Precision Circuits. The company caters to the semiconductor, system-on-chip (SoC), medical devices, and fiber optics industries. Infinite Technology Corporation was founded in 1991 and is based in Irving, Texas.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Irving"
    },
    "ITLC34.SA": {
        "short_name": "INTEL       DRN",
        "long_name": "Intel Corporation",
        "summary": "Intel Corporation designs, manufactures, and sells essential technologies for the cloud, smart, and connected devices for retail, industrial, and consumer uses worldwide. The company operates through DCG, IOTG, Mobileye, NSG, PSG, CCG, and All Other segments. It offers platform products, such as central processing units and chipsets, and system-on-chip and multichip packages; and non-platform or adjacent products comprising accelerators, boards and systems, connectivity products, and memory and storage products. The company also provides Internet of Things products, including high-performance compute solutions for targeted verticals and embedded applications; and computer vision and machine learning-based sensing, data analysis, localization, mapping, and driving policy technology. It serves original equipment manufacturers, original design manufacturers, and cloud service providers. Intel Corporation has a strategic partnership with MILA to develop and apply advances in artificial intelligence methods for enhancing the search in the space of drugs. The company was founded in 1968 and is headquartered in Santa Clara, California.",
        "currency": "BRL",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "JMX.F": {
        "short_name": "MAXLINEAR INC.  DL-,01",
        "long_name": "MaxLinear, Inc.",
        "summary": "MaxLinear, Inc. provides radiofrequency (RF), high-performance analog, and mixed-signal communications systems-on-chip solutions (SoCs) for the connected home, wired and wireless infrastructure, and industrial and multi-market applications worldwide. Its products integrate various portions of a high-speed communication system, including radiofrequency (RF), high-performance analog, mixed-signal, digital signal processing, security engines, data compression, networking layers, and power management. The company offers broadband radio transceiver front ends, data converters, embedded systems and software architecture, and architecture and system design for highly integrated end-to-end communication platform solutions. Its products are used in various electronic devices, such as cable data over cable service interface specifications (DOCSIS), fiber and DSL broadband modems and gateways; Wi-Fi and wireline routers for home networking; radio transceivers and modems for 4G/5G base-station and backhaul infrastructure; and fiber-optic modules for data center, metro, and long-haul transport networks, as well as power management and interface products. It serves electronics distributors, module makers, original equipment manufacturers (OEMs), and original design manufacturers (ODMs) through a direct sales force, third-party sales representatives, and a network of distributors. MaxLinear, Inc. has a collaboration with Facebook Connectivity to integrate silicon technologies and radio processing algorithms into Evenstar radio units. The company was founded in 2003 and is headquartered in Carlsbad, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Carlsbad"
    },
    "LA5.F": {
        "short_name": "SILICON LABS INC.DL-,0001",
        "long_name": "Silicon Laboratories Inc.",
        "summary": "Silicon Laboratories Inc., a fabless semiconductor company, provides mixed-signal integrated circuits (ICs) in the United States, China, and internationally. The company offers microcontrollers and wireless products, including 8-bit mixed-signal and ultra-low-power 32-bit microcontrollers (MCU); wireless MCU connectivity solutions; single and multi-protocol system-on-chip (SoC) devices and modules; wireless protocols, MCUs, and SoCs; in-house protocol stacks; Micrium, a real-time operating system that helps simplify software development for IoT developers.It also provides sensor products comprising optical, relative humidity/temperature, and hall effect magnetic sensors; timing devices; multi-channel isolators, isolated drivers, isolated power converters, and mixed-signal devices; broadcast products, which include single-chip hybrid TV tuners and digital video demodulators, as well as AM/FM, HD radio, and DAB/DAB+ receivers; and hybrid software defined radio tuners, data receivers, and digital radio coprocessors. In addition, the company offers ProSLIC, a subscriber line interface circuits for voice over IP; ISOmodem embedded modems; and Power over Ethernet power source equipment and powered device ICs. It primarily markets its products to Internet of Things, Internet infrastructure, industrial automation, consumer, and automotive markets through direct sales force, as well as through a network of independent sales representatives and distributors. Silicon Laboratories Inc. was founded in 1996 and is headquartered in Austin, Texas.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Austin"
    },
    "LASR": {
        "short_name": "nLIGHT, Inc.",
        "long_name": "nLIGHT, Inc.",
        "summary": "nLIGHT, Inc. designs, develops, manufactures, and sells semiconductor and fiber lasers for industrial, microfabrication, and aerospace and defense applications. The company operates in two segments, Laser Products and Advanced Development. It offers semiconductor laser chips, optical fiber in-house, and electrical-optical components. The company also provides fiber amplifiers and beam combination and control systems for use in high-energy laser systems in directed energy applications. It sells its products through direct sales force in the United States, China, South Korea, and Finland, as well as through various independent sales representatives and distributors in Asia, Europe, and South America. The company was formerly known as nLight Photonics Corporation and changed its name to nLIGHT, Inc. in January 2016. nLIGHT, Inc. was founded in 2000 and is headquartered in Vancouver, Washington.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Vancouver"
    },
    "LSCC": {
        "short_name": "Lattice Semiconductor Corporati",
        "long_name": "Lattice Semiconductor Corporation",
        "summary": "Lattice Semiconductor Corporation, together with its subsidiaries, develops and sells semiconductor products in Asia, Europe, and the Americas. The company offers field programmable gate arrays that consist of four product families, including the Certus-NX and ECP, MachXO, iCE40, and CrossLink. It also provides video connectivity application specific standard products. In addition, the company licenses its technology portfolio through standard IP and IP core licensing, patent monetization, and IP services. It sells its products directly to end customers, and indirectly through a network of independent manufacturers' representatives and independent distributors. The company primarily serves original equipment manufacturers in the communications and computing, consumer, and industrial and automotive end markets. Lattice Semiconductor Corporation was incorporated in 1983 and is headquartered in Hillsboro, Oregon.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Hillsboro"
    },
    "LTT.F": {
        "short_name": "LATTICE SEMICOND.  DL-,01",
        "long_name": "Lattice Semiconductor Corporation",
        "summary": "Lattice Semiconductor Corporation, together with its subsidiaries, develops and sells semiconductor products in Asia, Europe, and the Americas. The company offers field programmable gate arrays that consist of four product families, including the Certus-NX and ECP, MachXO, iCE40, and CrossLink. It also provides video connectivity application specific standard products. In addition, the company licenses its technology portfolio through standard IP and IP core licensing, patent monetization, and IP services. It sells its products directly to end customers, and indirectly through a network of independent manufacturers' representatives and independent distributors. The company primarily serves original equipment manufacturers in the communications and computing, consumer, and industrial and automotive end markets. Lattice Semiconductor Corporation was incorporated in 1983 and is headquartered in Hillsboro, Oregon.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Hillsboro"
    },
    "M1CH34.SA": {
        "short_name": "MICROCHIP TEDRN",
        "long_name": "Microchip Technology Incorporated",
        "summary": "Microchip Technology Incorporated develops, manufactures, and sells semiconductor products for various embedded control applications in the Americas, Europe, and Asia. The company offers general purpose and specialized 8-bit, 16-bit, and 32-bit microcontrollers; 32-bit embedded microprocessors; and microcontrollers for automotive, industrial, aerospace, office communication, and computing applications. It also provides development tools that enable system designers to program microcontroller products for specific applications; field-programmable gate array (FPGA) products; and analog, power, interface, mixed signal, and timing products comprising power management, linear, mixed-signal, high-voltage, thermal management, discrete diodes and metal oxide semiconductor field effect transistors (MOSFETS), radio frequency (RF), drivers, safety, security, timing, USB, Ethernet, wireless, and other interface products. In addition, the company offers memory products consisting of serial electrically erasable programmable read-only memory, serial flash memories, parallel flash memories, serial static random access memories, and serial electrically erasable random access memories for the production of very small footprint devices; and licenses its SuperFlash embedded flash and Smartbits one time programmable NVM technologies to foundries, integrated device manufacturers, and design partners for use in the manufacture of microcontroller products, gate array, RF, analog, and neuromorphic compute products that require embedded non-volatile memory, as well as provides engineering services. Further, it offers wafer foundry and assembly, and test subcontracting manufacturing services; and timing systems products, application specific integrated circuits, aerospace products. Microchip Technology Incorporated was founded in 1989 and is headquartered in Chandler, Arizona.",
        "currency": "BRL",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Chandler"
    },
    "M1XI34.SA": {
        "short_name": "MAXIM INTEGRDRN",
        "long_name": "Maxim Integrated Products, Inc.",
        "summary": "Maxim Integrated Products, Inc. designs, develops, manufactures, and markets a range of linear and mixed-signal integrated circuits in the United States, China, rest of Asia, Europe, and internationally. The company also provides various high-frequency process technologies and capabilities used in custom designs. It serves automotive, communications and data center, consumer, and industrial markets. The company markets its products through a direct-sales and applications organization, as well as through its own and other unaffiliated distribution channels. Maxim Integrated Products, Inc. was founded in 1983 and is headquartered in San Jose, California.",
        "currency": "BRL",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "San Jose"
    },
    "MCHP.MX": {
        "short_name": "MICROCHIP TECHNOLOGY",
        "long_name": "Microchip Technology Incorporated",
        "summary": "Microchip Technology Incorporated develops, manufactures, and sells semiconductor products for various embedded control applications in the Americas, Europe, and Asia. The company offers general purpose and specialized 8-bit, 16-bit, and 32-bit microcontrollers; 32-bit embedded microprocessors; and microcontrollers for automotive, industrial, aerospace, office communication, and computing applications. It also provides development tools that enable system designers to program microcontroller products for specific applications; field-programmable gate array (FPGA) products; and analog, power, interface, mixed signal, and timing products comprising power management, linear, mixed-signal, high-voltage, thermal management, discrete diodes and metal oxide semiconductor field effect transistors (MOSFETS), radio frequency (RF), drivers, safety, security, timing, USB, Ethernet, wireless, and other interface products. In addition, the company offers memory products consisting of serial electrically erasable programmable read-only memory, serial flash memories, parallel flash memories, serial static random access memories, and serial electrically erasable random access memories for the production of very small footprint devices; and licenses its SuperFlash embedded flash and Smartbits one time programmable NVM technologies to foundries, integrated device manufacturers, and design partners for use in the manufacture of microcontroller products, gate array, RF, analog, and neuromorphic compute products that require embedded non-volatile memory, as well as provides engineering services. Further, it offers wafer foundry and assembly, and test subcontracting manufacturing services; and timing systems products, application specific integrated circuits, aerospace products. Microchip Technology Incorporated was founded in 1989 and is headquartered in Chandler, Arizona.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Chandler"
    },
    "MCHP": {
        "short_name": "Microchip Technology Incorporat",
        "long_name": "Microchip Technology Incorporated",
        "summary": "Microchip Technology Incorporated develops, manufactures, and sells semiconductor products for various embedded control applications in the Americas, Europe, and Asia. The company offers general purpose and specialized 8-bit, 16-bit, and 32-bit microcontrollers; 32-bit embedded microprocessors; and microcontrollers for automotive, industrial, aerospace, office communication, and computing applications. It also provides development tools that enable system designers to program microcontroller products for specific applications; field-programmable gate array (FPGA) products; and analog, power, interface, mixed signal, and timing products comprising power management, linear, mixed-signal, high-voltage, thermal management, discrete diodes and metal oxide semiconductor field effect transistors (MOSFETS), radio frequency (RF), drivers, safety, security, timing, USB, Ethernet, wireless, and other interface products. In addition, the company offers memory products consisting of serial electrically erasable programmable read-only memory, serial flash memories, parallel flash memories, serial static random access memories, and serial electrically erasable random access memories for the production of very small footprint devices; and licenses its SuperFlash embedded flash and Smartbits one time programmable NVM technologies to foundries, integrated device manufacturers, and design partners for use in the manufacture of microcontroller products, gate array, RF, analog, and neuromorphic compute products that require embedded non-volatile memory, as well as provides engineering services. Further, it offers wafer foundry and assembly, and test subcontracting manufacturing services; and timing systems products, application specific integrated circuits, aerospace products. Microchip Technology Incorporated was founded in 1989 and is headquartered in Chandler, Arizona.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Chandler"
    },
    "MCHP.VI": {
        "short_name": "MICROCHIP TECHNOLOGY INC",
        "long_name": "Microchip Technology Incorporated",
        "summary": "Microchip Technology Incorporated develops, manufactures, and sells semiconductor products for various embedded control applications in the Americas, Europe, and Asia. The company offers general purpose and specialized 8-bit, 16-bit, and 32-bit microcontrollers; 32-bit embedded microprocessors; and microcontrollers for automotive, industrial, aerospace, office communication, and computing applications. It also provides development tools that enable system designers to program microcontroller products for specific applications; field-programmable gate array (FPGA) products; and analog, power, interface, mixed signal, and timing products comprising power management, linear, mixed-signal, high-voltage, thermal management, discrete diodes and metal oxide semiconductor field effect transistors (MOSFETS), radio frequency (RF), drivers, safety, security, timing, USB, Ethernet, wireless, and other interface products. In addition, the company offers memory products consisting of serial electrically erasable programmable read-only memory, serial flash memories, parallel flash memories, serial static random access memories, and serial electrically erasable random access memories for the production of very small footprint devices; and licenses its SuperFlash embedded flash and Smartbits one time programmable NVM technologies to foundries, integrated device manufacturers, and design partners for use in the manufacture of microcontroller products, gate array, RF, analog, and neuromorphic compute products that require embedded non-volatile memory, as well as provides engineering services. Further, it offers wafer foundry and assembly, and test subcontracting manufacturing services; and timing systems products, application specific integrated circuits, aerospace products. Microchip Technology Incorporated was founded in 1989 and is headquartered in Chandler, Arizona.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "Chandler"
    },
    "MCP.F": {
        "short_name": "MICROCHIP TECH.  DL-,001",
        "long_name": "Microchip Technology Incorporated",
        "summary": "Microchip Technology Incorporated develops, manufactures, and sells semiconductor products for various embedded control applications in the Americas, Europe, and Asia. The company offers general purpose and specialized 8-bit, 16-bit, and 32-bit microcontrollers; 32-bit embedded microprocessors; and microcontrollers for automotive, industrial, aerospace, office communication, and computing applications. It also provides development tools that enable system designers to program microcontroller products for specific applications; field-programmable gate array (FPGA) products; and analog, power, interface, mixed signal, and timing products comprising power management, linear, mixed-signal, high-voltage, thermal management, discrete diodes and metal oxide semiconductor field effect transistors (MOSFETS), radio frequency (RF), drivers, safety, security, timing, USB, Ethernet, wireless, and other interface products. In addition, the company offers memory products consisting of serial electrically erasable programmable read-only memory, serial flash memories, parallel flash memories, serial static random access memories, and serial electrically erasable random access memories for the production of very small footprint devices; and licenses its SuperFlash embedded flash and Smartbits one time programmable NVM technologies to foundries, integrated device manufacturers, and design partners for use in the manufacture of microcontroller products, gate array, RF, analog, and neuromorphic compute products that require embedded non-volatile memory, as well as provides engineering services. Further, it offers wafer foundry and assembly, and test subcontracting manufacturing services; and timing systems products, application specific integrated circuits, aerospace products. Microchip Technology Incorporated was founded in 1989 and is headquartered in Chandler, Arizona.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Chandler"
    },
    "MHIP.F": {
        "short_name": "MOSYS INC.  DL-,01",
        "long_name": "MoSys, Inc.",
        "summary": "MoSys, Inc., together with its subsidiaries, operates as a semiconductor company in North America, Japan, Taiwan, and internationally. The company develops and sells integrated circuits (ICs) for high-speed cloud networking, communications, security appliance, video, monitor and test, and computing markets. It offers bandwidth engine ICs and programmable hyperspeed engine IC products under the Accelerator Engine name; quad partition rate SRAM memory devices; non-memory, high-speed serialization-deserialization interface, and physical layer devices; and virtual accelerator engines, such as graph memory engines and accelerator IPs. The company also serves data centers and other equipment providers, as well as their subsystem and component vendors; and original equipment manufacturers through direct sales personnel, sales representatives, and distributors. MoSys, Inc. was incorporated in 1991 and is headquartered in San Jose, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "San Jose"
    },
    "MOSY": {
        "short_name": "MoSys, Inc.",
        "long_name": "MoSys, Inc.",
        "summary": "MoSys, Inc., together with its subsidiaries, operates as a semiconductor company in North America, Japan, Taiwan, and internationally. The company develops and sells integrated circuits (ICs) for high-speed cloud networking, communications, security appliance, video, monitor and test, and computing markets. It offers bandwidth engine ICs and programmable hyperspeed engine IC products under the Accelerator Engine name; quad partition rate SRAM memory devices; non-memory, high-speed serialization-deserialization interface, and physical layer devices; and virtual accelerator engines, such as graph memory engines and accelerator IPs. The company also serves data centers and other equipment providers, as well as their subsystem and component vendors; and original equipment manufacturers through direct sales personnel, sales representatives, and distributors. MoSys, Inc. was incorporated in 1991 and is headquartered in San Jose, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "San Jose"
    },
    "MPWR.MX": {
        "short_name": "MONOLITHIC POWER SYSTEM INC",
        "long_name": "Monolithic Power Systems, Inc.",
        "summary": "Monolithic Power Systems, Inc. designs, develops, and markets integrated power semiconductor solutions and power delivery architectures for computing and storage, automotive, industrial, communications, and consumer applications markets. It offers direct current (DC) to DC integrated circuits (ICs) that are used to convert and control voltages of various electronic systems, such as portable electronic devices, wireless LAN access points, computers and notebooks, monitors, infotainment applications, and medical equipment. The company also provides lighting control ICs for backlighting that are used in systems, which provide the light source for LCD panels in notebook computers, monitors, car navigation systems, and televisions, as well as for general illumination products. The company sells its products through third-party distributors, and value-added resellers, as well as directly to original equipment manufacturers, original design manufacturers, electronic manufacturing service providers, and other end customers in China, Taiwan, Europe, South Korea, Southeast Asia, Japan, the United States, and internationally. Monolithic Power Systems, Inc. was incorporated in 1997 and is headquartered in Kirkland, Washington.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Kirkland"
    },
    "MPWR": {
        "short_name": "Monolithic Power Systems, Inc.",
        "long_name": "Monolithic Power Systems, Inc.",
        "summary": "Monolithic Power Systems, Inc. designs, develops, and markets integrated power semiconductor solutions and power delivery architectures for computing and storage, automotive, industrial, communications, and consumer applications markets. It offers direct current (DC) to DC integrated circuits (ICs) that are used to convert and control voltages of various electronic systems, such as portable electronic devices, wireless LAN access points, computers and notebooks, monitors, infotainment applications, and medical equipment. The company also provides lighting control ICs for backlighting that are used in systems, which provide the light source for LCD panels in notebook computers, monitors, car navigation systems, and televisions, as well as for general illumination products. The company sells its products through third-party distributors, and value-added resellers, as well as directly to original equipment manufacturers, original design manufacturers, electronic manufacturing service providers, and other end customers in China, Taiwan, Europe, South Korea, Southeast Asia, Japan, the United States, and internationally. Monolithic Power Systems, Inc. was incorporated in 1997 and is headquartered in Kirkland, Washington.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Kirkland"
    },
    "MRAM": {
        "short_name": "Everspin Technologies, Inc.",
        "long_name": "Everspin Technologies, Inc.",
        "summary": "Everspin Technologies, Inc. manufactures and sells magnetoresistive random access memory (MRAM) products in the United States, Hong Kong, Japan, China, Germany, and internationally. It offers Toggle MRAM, spin-transfer torque MRAM, and tunnel magneto resistance sensor products, as well as foundry services for embedded MRAM. The company provides its products for applications, including data center, industrial, medical, automotive, aerospace, and transportation markets. It serves original equipment manufacturers and original design manufacturers through a direct sales channel and a network of representatives and distributors. Everspin Technologies, Inc. was incorporated in 2008 and is headquartered in Chandler, Arizona.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "city": "Chandler"
    },
    "MRVL": {
        "short_name": "Marvell Technology, Inc.",
        "long_name": "Marvell Technology, Inc.",
        "summary": "Marvell Technology, Inc., together with its subsidiaries, designs, develops, and sells analog, mixed-signal, digital signal processing, and embedded and standalone integrated circuits. It offers a portfolio of Ethernet solutions, including controllers, network adapters, physical transceivers, and switches; single or multiple core processors; application specific integrated circuits; and printer SoC products and application processors. The company also provides a range of storage products comprising storage controllers for hard disk drives (HDD) and solid-state drives that support various host system interfaces consisting of serial attached SCSI (SAS), serial advanced technology attachment (SATA), peripheral component interconnect express, non-volatile memory express (NVMe), and NVMe over fabrics; and fiber channel products, including host bus adapters, and controllers for server and storage system connectivity. It has operations in the United States, China, Malaysia, the Philippines, Thailand, Singapore, India, Israel, Japan, South Korea, Taiwan, and Vietnam. Marvell Technology, Inc. is headquartered in Wilmington, Delaware.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Wilmington"
    },
    "MRVL1.MX": {
        "short_name": "MARVELL TECHNOLOGY INC",
        "long_name": "Marvell Technology, Inc.",
        "summary": "Marvell Technology, Inc., together with its subsidiaries, designs, develops, and sells analog, mixed-signal, digital signal processing, and embedded and standalone integrated circuits. It offers a portfolio of Ethernet solutions, including controllers, network adapters, physical transceivers, and switches; single or multiple core processors; application specific integrated circuits; and printer SoC products and application processors. The company also provides a range of storage products comprising storage controllers for hard disk drives (HDD) and solid-state drives that support various host system interfaces consisting of serial attached SCSI (SAS), serial advanced technology attachment (SATA), peripheral component interconnect express, non-volatile memory express (NVMe), and NVMe over fabrics; and fiber channel products, including host bus adapters, and controllers for server and storage system connectivity. It has operations in the United States, China, Malaysia, the Philippines, Thailand, Singapore, India, Israel, Japan, South Korea, Taiwan, and Vietnam. Marvell Technology, Inc. is headquartered in Wilmington, Delaware.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Wilmington"
    },
    "MTE.F": {
        "short_name": "MICRON TECHN. INC. DL-,10",
        "long_name": "Micron Technology, Inc.",
        "summary": "Micron Technology, Inc. designs, manufactures, and sells memory and storage products worldwide. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Storage Business Unit, and Embedded Business Unit. It offers memory and storage technologies, including DRAM, NAND, NOR, and 3D XPoint memory under the Micron and Crucial brands, as well as through private labels. The company provides memory products for the cloud server, enterprise, client, graphics, and networking markets, as well as for smartphone and other mobile-device markets; SSDs and component-level solutions for the enterprise and cloud, client, and consumer storage markets; other discrete storage products in component and wafer forms for the removable storage markets, as well as 3D XPoint memory products; and memory and storage products for the automotive, industrial, and consumer markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Boise"
    },
    "MTNX": {
        "short_name": "MELTRONIX INC",
        "long_name": "Meltronix, Inc.",
        "summary": "MeltroniX, Inc. provides advanced electronic manufacturing Services, products, design, and testing to high growth industries and applications, including Internet equipment, wireless/telecommunication, medical, satellites and military systems, and broadband communication and other electronic systems manufacturers. The company provides design, assembly, and test services based on advanced electronic manufacturing technologies, including BGA, flip chip, and multi chip modules. Its Advanced Integrated Circuit (IC) Packaging Products include multi layer ceramic packages and substrates, including pin grid arrays, leaded chip carriers, ceramic quad flat packs, and ceramic substrates along with FLIP Chip, Surface Mount, and BGA modules. MeltroniX's Multichip Modules consist of multiple ICs mounted directly onto a high-density substrate. The company is based in San Diego, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "San Diego"
    },
    "MTSI": {
        "short_name": "MACOM Technology Solutions Hold",
        "long_name": "MACOM Technology Solutions Holdings, Inc.",
        "summary": "MACOM Technology Solutions Holdings, Inc., together with its subsidiaries, designs and manufactures analog semiconductor solutions for use in wireless and wireline applications across the radio frequency (RF), microwave, millimeter wave, and lightwave spectrum in the United States, China, the Asia Pacific, and internationally. The company offers a portfolio of standard and custom devices, including integrated circuits, multi-chip modules, diodes, amplifiers, switches and switch limiters, passive and active components, and subsystems. Its semiconductor products are electronic components that are incorporated in electronic systems, such as wireless basestations, high capacity optical networks, radar, and medical systems and test and measurement. The company serves various markets comprising telecommunication that includes carrier infrastructure, which comprise long-haul/metro, 5G, and fiber-to-the-X/passive optical network; data centres; and industrial and defense, including military and commercial radar, RF jammers, electronic countermeasures, and communication data links, as well as multi-market applications, such as industrial, medical, test and measurement, and scientific applications. It sells its products through direct sales force, applications engineering staff, independent sales representatives, resellers, and distributors. The company was founded in 1950 and is headquartered in Lowell, Massachusetts.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Lowell"
    },
    "MU.MI": {
        "short_name": "MICRON TECHNOLOGY",
        "long_name": "Micron Technology, Inc.",
        "summary": "Micron Technology, Inc. designs, manufactures, and sells memory and storage products worldwide. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Storage Business Unit, and Embedded Business Unit. It offers memory and storage technologies, including DRAM, NAND, NOR, and 3D XPoint memory under the Micron and Crucial brands, as well as through private labels. The company provides memory products for the cloud server, enterprise, client, graphics, and networking markets, as well as for smartphone and other mobile-device markets; SSDs and component-level solutions for the enterprise and cloud, client, and consumer storage markets; other discrete storage products in component and wafer forms for the removable storage markets, as well as 3D XPoint memory products; and memory and storage products for the automotive, industrial, and consumer markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "MIL",
        "market": "it_market",
        "country": "United States",
        "city": "Boise"
    },
    "MU.MX": {
        "short_name": "MICRON TECHNOLOGY INC",
        "long_name": "Micron Technology, Inc.",
        "summary": "Micron Technology, Inc. designs, manufactures, and sells memory and storage products worldwide. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Storage Business Unit, and Embedded Business Unit. It offers memory and storage technologies, including DRAM, NAND, NOR, and 3D XPoint memory under the Micron and Crucial brands, as well as through private labels. The company provides memory products for the cloud server, enterprise, client, graphics, and networking markets, as well as for smartphone and other mobile-device markets; SSDs and component-level solutions for the enterprise and cloud, client, and consumer storage markets; other discrete storage products in component and wafer forms for the removable storage markets, as well as 3D XPoint memory products; and memory and storage products for the automotive, industrial, and consumer markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Boise"
    },
    "MU": {
        "short_name": "Micron Technology, Inc.",
        "long_name": "Micron Technology, Inc.",
        "summary": "Micron Technology, Inc. designs, manufactures, and sells memory and storage products worldwide. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Storage Business Unit, and Embedded Business Unit. It offers memory and storage technologies, including DRAM, NAND, NOR, and 3D XPoint memory under the Micron and Crucial brands, as well as through private labels. The company provides memory products for the cloud server, enterprise, client, graphics, and networking markets, as well as for smartphone and other mobile-device markets; SSDs and component-level solutions for the enterprise and cloud, client, and consumer storage markets; other discrete storage products in component and wafer forms for the removable storage markets, as well as 3D XPoint memory products; and memory and storage products for the automotive, industrial, and consumer markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Boise"
    },
    "MU.VI": {
        "short_name": "MICRON TECHNOLOGY INC",
        "long_name": "Micron Technology, Inc.",
        "summary": "Micron Technology, Inc. designs, manufactures, and sells memory and storage products worldwide. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Storage Business Unit, and Embedded Business Unit. It offers memory and storage technologies, including DRAM, NAND, NOR, and 3D XPoint memory under the Micron and Crucial brands, as well as through private labels. The company provides memory products for the cloud server, enterprise, client, graphics, and networking markets, as well as for smartphone and other mobile-device markets; SSDs and component-level solutions for the enterprise and cloud, client, and consumer storage markets; other discrete storage products in component and wafer forms for the removable storage markets, as well as 3D XPoint memory products; and memory and storage products for the automotive, industrial, and consumer markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "Boise"
    },
    "MUTC34.SA": {
        "short_name": "MICRON TECHNDRN",
        "long_name": "Micron Technology, Inc.",
        "summary": "Micron Technology, Inc. designs, manufactures, and sells memory and storage products worldwide. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Storage Business Unit, and Embedded Business Unit. It offers memory and storage technologies, including DRAM, NAND, NOR, and 3D XPoint memory under the Micron and Crucial brands, as well as through private labels. The company provides memory products for the cloud server, enterprise, client, graphics, and networking markets, as well as for smartphone and other mobile-device markets; SSDs and component-level solutions for the enterprise and cloud, client, and consumer storage markets; other discrete storage products in component and wafer forms for the removable storage markets, as well as 3D XPoint memory products; and memory and storage products for the automotive, industrial, and consumer markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.",
        "currency": "BRL",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Boise"
    },
    "MXI.DE": {
        "short_name": "MAXIM INTEGR.PRODS DL-001",
        "long_name": "Maxim Integrated Products, Inc.",
        "summary": "Maxim Integrated Products, Inc. designs, develops, manufactures, and markets a range of linear and mixed-signal integrated circuits in the United States, China, rest of Asia, Europe, and internationally. The company also provides various high-frequency process technologies and capabilities used in custom designs. It serves automotive, communications and data center, consumer, and industrial markets. The company markets its products through a direct-sales and applications organization, as well as through its own and other unaffiliated distribution channels. Maxim Integrated Products, Inc. was founded in 1983 and is headquartered in San Jose, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "San Jose"
    },
    "MXI.F": {
        "short_name": "MAXIM INTEGR.PRODS DL-001",
        "long_name": "Maxim Integrated Products, Inc.",
        "summary": "Maxim Integrated Products, Inc. designs, develops, manufactures, and markets a range of linear and mixed-signal integrated circuits in the United States, China, rest of Asia, Europe, and internationally. The company also provides various high-frequency process technologies and capabilities used in custom designs. It serves automotive, communications and data center, consumer, and industrial markets. The company markets its products through a direct-sales and applications organization, as well as through its own and other unaffiliated distribution channels. Maxim Integrated Products, Inc. was founded in 1983 and is headquartered in San Jose, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "San Jose"
    },
    "MXIM": {
        "short_name": "Maxim Integrated Products, Inc.",
        "long_name": "Maxim Integrated Products, Inc.",
        "summary": "Maxim Integrated Products, Inc. designs, develops, manufactures, and markets a range of linear and mixed-signal integrated circuits in the United States, China, rest of Asia, Europe, and internationally. The company also provides various high-frequency process technologies and capabilities used in custom designs. It serves automotive, communications and data center, consumer, and industrial markets. The company markets its products through a direct-sales and applications organization, as well as through its own and other unaffiliated distribution channels. Maxim Integrated Products, Inc. was founded in 1983 and is headquartered in San Jose, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "San Jose"
    },
    "MXIM.VI": {
        "short_name": "MAXIM INTEGRATED PRODUCTS",
        "long_name": "Maxim Integrated Products, Inc.",
        "summary": "Maxim Integrated Products, Inc. designs, develops, manufactures, and markets a range of linear and mixed-signal integrated circuits in the United States, China, rest of Asia, Europe, and internationally. The company also provides various high-frequency process technologies and capabilities used in custom designs. It serves automotive, communications and data center, consumer, and industrial markets. The company markets its products through a direct-sales and applications organization, as well as through its own and other unaffiliated distribution channels. Maxim Integrated Products, Inc. was founded in 1983 and is headquartered in San Jose, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "San Jose"
    },
    "MXL": {
        "short_name": "MaxLinear, Inc.",
        "long_name": "MaxLinear, Inc.",
        "summary": "MaxLinear, Inc. provides radiofrequency (RF), high-performance analog, and mixed-signal communications systems-on-chip solutions (SoCs) for the connected home, wired and wireless infrastructure, and industrial and multi-market applications worldwide. Its products integrate various portions of a high-speed communication system, including radiofrequency (RF), high-performance analog, mixed-signal, digital signal processing, security engines, data compression, networking layers, and power management. The company offers broadband radio transceiver front ends, data converters, embedded systems and software architecture, and architecture and system design for highly integrated end-to-end communication platform solutions. Its products are used in various electronic devices, such as cable data over cable service interface specifications (DOCSIS), fiber and DSL broadband modems and gateways; Wi-Fi and wireline routers for home networking; radio transceivers and modems for 4G/5G base-station and backhaul infrastructure; and fiber-optic modules for data center, metro, and long-haul transport networks, as well as power management and interface products. It serves electronics distributors, module makers, original equipment manufacturers (OEMs), and original design manufacturers (ODMs) through a direct sales force, third-party sales representatives, and a network of distributors. MaxLinear, Inc. has a collaboration with Facebook Connectivity to integrate silicon technologies and radio processing algorithms into Evenstar radio units. The company was founded in 2003 and is headquartered in Carlsbad, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Carlsbad"
    },
    "NLST": {
        "short_name": "NETLIST INC",
        "long_name": "Netlist, Inc.",
        "summary": "Netlist, Inc. designs, manufactures, and sells modular memory subsystems for the server, high-performance computing, and communications markets worldwide. It offers HybriDIMM, a storage class memory product, which unifies dynamic random access memory (DRAM) and NAND flash in a plug-and-play module delivering terabyte storage capacities operating at nanosecond memory speeds. The company also provides nonvolatile (NV) memory products, such as NVvault DDR4 NVDIMM that provides data acceleration and protection in a joint electron device engineering council standard DDR4 interface; and specialty DIMMs and embedded flash products for use in data center and industrial applications. It resells solid state drive (SSD), NAND flash, DRAM products, and other component products to storage customers, appliance customers, system builders, and cloud and datacenter customers; and sells component inventory to distributors and other users of memory integrated circuits. The company markets and sells its products primarily to original equipment manufacturers through a direct sales force and a network of independent sales representatives. Netlist, Inc. was incorporated in 2000 and is headquartered in Irvine, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Irvine"
    },
    "NMGC": {
        "short_name": "NEOMAGIC",
        "long_name": "NeoMagic Corporation",
        "summary": "NeoMagic Corporation designs and delivers semiconductors and software solutions for video, television, imaging, graphic, and audio devices. It offers microcontrollers; horizon digital picture frame and digital mobile TV solutions; and SOC processors, such as application processors and Neomobile TV solutions. The company, through its MercadoMagico.com division, operates an e-Commerce platform that allows user to buy and sell products from one another or buy premium electronic products. It sells its applications processors under the MiMagic brand name. The company was founded in 1993 and is based in Milpitas, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Milpitas"
    },
    "NNM.F": {
        "short_name": "ONTO INNOVATION",
        "long_name": "Onto Innovation Inc.",
        "summary": "Onto Innovation Inc. engages in the design, development, manufacture, and support of process control tools that performs macro defect inspection and metrology, lithography systems, and process control analytical software worldwide. It offers process and yield management solutions, and device packaging and test facilities through standalone systems for macro-defect inspection, packaging lithography, probe card test and analysis, and transparent and opaque thin film measurements; and process control software portfolio that includes solutions for standalone tools, groups of tools, or factory-wide suites. The company also provides spare parts and software licensing services. Its products are used by semiconductor wafer and advanced packaging device manufacturers; silicon wafer; light emitting diode; vertical-cavity surface-emitting laser; micro-electromechanical system; CMOS image sensor; power device; RF filter; data storage; and various industrial and scientific applications. The company was formerly known as Rudolph Technologies, Inc. Onto Innovation Inc. was founded in 1940 and is headquartered in Wilmington, Massachusetts.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Wilmington"
    },
    "NPTN": {
        "short_name": "NeoPhotonics Corporation",
        "long_name": "NeoPhotonics Corporation",
        "summary": "NeoPhotonics Corporation develops, manufactures, and sells optoelectronic products that transmit and receive high speed digital optical signals for cloud and hyperscale data center internet content provider and telecom networks worldwide. It offers high speed products, including transmitter, receiver, and switching products for 400G and optical transmission applications over distances of 2 to 2,000 kilometers; ultra-narrow linewidth tunable lasers that generate ultra-pure wavelength or color for coherent transmission; and integrated coherent receivers (ICRs) that decode the phase and polarization encoded coherent optical signals. The company also provides pluggable coherent transceivers that combine ultra-narrow linewidth laser with coherent receiver and performance coherent modulator; and 100G products for data center applications. In addition, it offers multi-cast switching solutions for 100G and above coherent systems; and network products and solutions, such as arrayed wavelength gratings, multiplexers, and filters used in dense wavelength division multiplexing systems. The company sells its products to network equipment manufacturers through a direct sales force in North America, Europe, and Asia. The company was formerly known as NanoGram Corporation and changed its name to NeoPhotonics Corporation in 2002. NeoPhotonics Corporation was founded in 1996 and is headquartered in San Jose, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "San Jose"
    },
    "NQG.F": {
        "short_name": "MONOLITHIC POWER  DL-,001",
        "long_name": "Monolithic Power Systems, Inc.",
        "summary": "Monolithic Power Systems, Inc. designs, develops, and markets integrated power semiconductor solutions and power delivery architectures for computing and storage, automotive, industrial, communications, and consumer applications markets. It offers direct current (DC) to DC integrated circuits (ICs) that are used to convert and control voltages of various electronic systems, such as portable electronic devices, wireless LAN access points, computers and notebooks, monitors, infotainment applications, and medical equipment. The company also provides lighting control ICs for backlighting that are used in systems, which provide the light source for LCD panels in notebook computers, monitors, car navigation systems, and televisions, as well as for general illumination products. The company sells its products through third-party distributors, and value-added resellers, as well as directly to original equipment manufacturers, original design manufacturers, electronic manufacturing service providers, and other end customers in China, Taiwan, Europe, South Korea, Southeast Asia, Japan, the United States, and internationally. Monolithic Power Systems, Inc. was incorporated in 1997 and is headquartered in Kirkland, Washington.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Kirkland"
    },
    "NVD.DE": {
        "short_name": "NVIDIA CORP.  DL-,001",
        "long_name": "NVIDIA Corporation",
        "summary": "NVIDIA Corporation operates as a visual computing company worldwide. It operates in two segments, Graphics and Compute & Networking. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise design; GRID software for cloud-based visual and virtual computing; and automotive platforms for infotainment systems. The Compute & Networking segment offers Data Center platforms and systems for AI, HPC, and accelerated computing; Mellanox networking and interconnect solutions; automotive AI Cockpit, autonomous driving development agreements, and autonomous vehicle solutions; and Jetson for robotics and other embedded platforms. The company's products are used in gaming, professional visualization, datacenter, and automotive markets. NVIDIA Corporation sells its products to original equipment manufacturers, original device manufacturers, system builders, add-in board manufacturers, retailers/distributors, Internet and cloud service providers, automotive manufacturers and tier-1 automotive suppliers, mapping companies, start-ups, and other ecosystem participants. NVIDIA Corporation was founded in 1993 and is headquartered in Santa Clara, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "NVD.F": {
        "short_name": "NVIDIA CORP.  DL-,001",
        "long_name": "NVIDIA Corporation",
        "summary": "NVIDIA Corporation operates as a visual computing company worldwide. It operates in two segments, Graphics and Compute & Networking. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise design; GRID software for cloud-based visual and virtual computing; and automotive platforms for infotainment systems. The Compute & Networking segment offers Data Center platforms and systems for AI, HPC, and accelerated computing; Mellanox networking and interconnect solutions; automotive AI Cockpit, autonomous driving development agreements, and autonomous vehicle solutions; and Jetson for robotics and other embedded platforms. The company's products are used in gaming, professional visualization, datacenter, and automotive markets. NVIDIA Corporation sells its products to original equipment manufacturers, original device manufacturers, system builders, add-in board manufacturers, retailers/distributors, Internet and cloud service providers, automotive manufacturers and tier-1 automotive suppliers, mapping companies, start-ups, and other ecosystem participants. NVIDIA Corporation was founded in 1993 and is headquartered in Santa Clara, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "NVDA.BA": {
        "short_name": "NVIDIA CORP",
        "long_name": "NVIDIA Corporation",
        "summary": "NVIDIA Corporation operates as a visual computing company worldwide. It operates in two segments, Graphics and Compute & Networking. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise design; GRID software for cloud-based visual and virtual computing; and automotive platforms for infotainment systems. The Compute & Networking segment offers Data Center platforms and systems for AI, HPC, and accelerated computing; Mellanox networking and interconnect solutions; automotive AI Cockpit, autonomous driving development agreements, and autonomous vehicle solutions; and Jetson for robotics and other embedded platforms. The company's products are used in gaming, professional visualization, datacenter, and automotive markets. NVIDIA Corporation sells its products to original equipment manufacturers, original device manufacturers, system builders, add-in board manufacturers, retailers/distributors, Internet and cloud service providers, automotive manufacturers and tier-1 automotive suppliers, mapping companies, start-ups, and other ecosystem participants. NVIDIA Corporation was founded in 1993 and is headquartered in Santa Clara, California.",
        "currency": "ARS",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "NVDA.MX": {
        "short_name": "NVIDIA CORP",
        "long_name": "NVIDIA Corporation",
        "summary": "NVIDIA Corporation operates as a visual computing company worldwide. It operates in two segments, Graphics and Compute & Networking. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise design; GRID software for cloud-based visual and virtual computing; and automotive platforms for infotainment systems. The Compute & Networking segment offers Data Center platforms and systems for AI, HPC, and accelerated computing; Mellanox networking and interconnect solutions; automotive AI Cockpit, autonomous driving development agreements, and autonomous vehicle solutions; and Jetson for robotics and other embedded platforms. The company's products are used in gaming, professional visualization, datacenter, and automotive markets. NVIDIA Corporation sells its products to original equipment manufacturers, original device manufacturers, system builders, add-in board manufacturers, retailers/distributors, Internet and cloud service providers, automotive manufacturers and tier-1 automotive suppliers, mapping companies, start-ups, and other ecosystem participants. NVIDIA Corporation was founded in 1993 and is headquartered in Santa Clara, California.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "NVDA": {
        "short_name": "NVIDIA Corporation",
        "long_name": "NVIDIA Corporation",
        "summary": "NVIDIA Corporation operates as a visual computing company worldwide. It operates in two segments, Graphics and Compute & Networking. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise design; GRID software for cloud-based visual and virtual computing; and automotive platforms for infotainment systems. The Compute & Networking segment offers Data Center platforms and systems for AI, HPC, and accelerated computing; Mellanox networking and interconnect solutions; automotive AI Cockpit, autonomous driving development agreements, and autonomous vehicle solutions; and Jetson for robotics and other embedded platforms. The company's products are used in gaming, professional visualization, datacenter, and automotive markets. NVIDIA Corporation sells its products to original equipment manufacturers, original device manufacturers, system builders, add-in board manufacturers, retailers/distributors, Internet and cloud service providers, automotive manufacturers and tier-1 automotive suppliers, mapping companies, start-ups, and other ecosystem participants. NVIDIA Corporation was founded in 1993 and is headquartered in Santa Clara, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "NVDA.VI": {
        "short_name": "NVIDIA CORP",
        "long_name": "NVIDIA Corporation",
        "summary": "NVIDIA Corporation operates as a visual computing company worldwide. It operates in two segments, Graphics and Compute & Networking. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise design; GRID software for cloud-based visual and virtual computing; and automotive platforms for infotainment systems. The Compute & Networking segment offers Data Center platforms and systems for AI, HPC, and accelerated computing; Mellanox networking and interconnect solutions; automotive AI Cockpit, autonomous driving development agreements, and autonomous vehicle solutions; and Jetson for robotics and other embedded platforms. The company's products are used in gaming, professional visualization, datacenter, and automotive markets. NVIDIA Corporation sells its products to original equipment manufacturers, original device manufacturers, system builders, add-in board manufacturers, retailers/distributors, Internet and cloud service providers, automotive manufacturers and tier-1 automotive suppliers, mapping companies, start-ups, and other ecosystem participants. NVIDIA Corporation was founded in 1993 and is headquartered in Santa Clara, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "NVDC34.SA": {
        "short_name": "NVIDIA CORP DRN",
        "long_name": "NVIDIA Corporation",
        "summary": "NVIDIA Corporation operates as a visual computing company worldwide. It operates in two segments, Graphics and Compute & Networking. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise design; GRID software for cloud-based visual and virtual computing; and automotive platforms for infotainment systems. The Compute & Networking segment offers Data Center platforms and systems for AI, HPC, and accelerated computing; Mellanox networking and interconnect solutions; automotive AI Cockpit, autonomous driving development agreements, and autonomous vehicle solutions; and Jetson for robotics and other embedded platforms. The company's products are used in gaming, professional visualization, datacenter, and automotive markets. NVIDIA Corporation sells its products to original equipment manufacturers, original device manufacturers, system builders, add-in board manufacturers, retailers/distributors, Internet and cloud service providers, automotive manufacturers and tier-1 automotive suppliers, mapping companies, start-ups, and other ecosystem participants. NVIDIA Corporation was founded in 1993 and is headquartered in Santa Clara, California.",
        "currency": "BRL",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "NVEC": {
        "short_name": "NVE Corporation",
        "long_name": "NVE Corporation",
        "summary": "NVE Corporation develops and sells devices that use spintronics, a nanotechnology that relies on electron spin to acquire, store, and transmit information in the United States and internationally. The company manufactures spintronic products, including sensors and couplers for use in acquiring and transmitting data. Its products comprise standard sensors to detect the presence of a magnetic or metallic material to determine position or speed primarily for the factory automation market; and custom and medical sensors for medical devices to replace electromechanical magnetic switches. The company also offers spintronic couplers for industrial Internet of Things market. In addition, it engages in the research and development, and licensing of spintronic magnetoresistive random access memory technology. NVE Corporation was founded in 1989 and is headquartered in Eden Prairie, Minnesota.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "Eden Prairie"
    },
    "NVK.F": {
        "short_name": "NVE CORP. NEW  DL-,01",
        "long_name": "NVE Corporation",
        "summary": "NVE Corporation develops and sells devices that use spintronics, a nanotechnology that relies on electron spin to acquire, store, and transmit information in the United States and internationally. The company manufactures spintronic products, including sensors and couplers for use in acquiring and transmitting data. Its products comprise standard sensors to detect the presence of a magnetic or metallic material to determine position or speed primarily for the factory automation market; and custom and medical sensors for medical devices to replace electromechanical magnetic switches. The company also offers spintronic couplers for industrial Internet of Things market. In addition, it engages in the research and development, and licensing of spintronic magnetoresistive random access memory technology. NVE Corporation was founded in 1989 and is headquartered in Eden Prairie, Minnesota.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Eden Prairie"
    },
    "ODII": {
        "short_name": "ODYSSEY SEMICONDUCTOR TECH INC",
        "long_name": "Odyssey Semiconductor Technologies, Inc.",
        "summary": "Odyssey Semiconductor Technologies, Inc., a semiconductor device company, develops high-voltage power switching components and systems based on proprietary gallium nitride processing technology. The company was incorporated in 2019 and is based in Ithaca, New York.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Ithaca"
    },
    "ON.MX": {
        "short_name": "ON SEMICONDUCTOR CORP",
        "long_name": "ON Semiconductor Corporation",
        "summary": "ON Semiconductor Corporation, together with its subsidiaries, manufactures and sells semiconductor components for various electronic devices worldwide. The company operates in three segments: Power Solutions Group (PSG), Advanced Solutions Group (ASG), and Intelligent Sensing Group (ISG). The PSG segment offers analog, discrete, module, and integrated semiconductor products for various applications, such as power switching, power conversion, signal conditioning, circuit protection, signal amplification, and voltage regulation functions. The ASG segment designs and develops analog, mixed-signal, logic, ASSPs and ASICs, Wi-Fi, and power solutions. It also provides trusted foundry and design services for government customers; and manufacturing services. The ISG segment offers complementary metal oxide semiconductors image sensors; proximity sensors; image signal processors; single photon detectors, including SiPM and SPAD arrays; radars; and actuator drivers for autofocus and image stabilization for a range of customers in automotive, industrial, medical, aerospace/defense, communications, networking, wireless, consumer, and computing markets. The company serves original equipment manufacturers, distributors, and electronic manufacturing service providers. ON Semiconductor Corporation was incorporated in 1992 and is headquartered in Phoenix, Arizona.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Phoenix"
    },
    "ON": {
        "short_name": "ON Semiconductor Corporation",
        "long_name": "ON Semiconductor Corporation",
        "summary": "ON Semiconductor Corporation, together with its subsidiaries, manufactures and sells semiconductor components for various electronic devices worldwide. The company operates in three segments: Power Solutions Group (PSG), Advanced Solutions Group (ASG), and Intelligent Sensing Group (ISG). The PSG segment offers analog, discrete, module, and integrated semiconductor products for various applications, such as power switching, power conversion, signal conditioning, circuit protection, signal amplification, and voltage regulation functions. The ASG segment designs and develops analog, mixed-signal, logic, ASSPs and ASICs, Wi-Fi, and power solutions. It also provides trusted foundry and design services for government customers; and manufacturing services. The ISG segment offers complementary metal oxide semiconductors image sensors; proximity sensors; image signal processors; single photon detectors, including SiPM and SPAD arrays; radars; and actuator drivers for autofocus and image stabilization for a range of customers in automotive, industrial, medical, aerospace/defense, communications, networking, wireless, consumer, and computing markets. The company serves original equipment manufacturers, distributors, and electronic manufacturing service providers. ON Semiconductor Corporation was incorporated in 1992 and is headquartered in Phoenix, Arizona.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Phoenix"
    },
    "ONTO": {
        "short_name": "Onto Innovation Inc.",
        "long_name": "Onto Innovation Inc.",
        "summary": "Onto Innovation Inc. engages in the design, development, manufacture, and support of process control tools that performs macro defect inspection and metrology, lithography systems, and process control analytical software worldwide. It offers process and yield management solutions, and device packaging and test facilities through standalone systems for macro-defect inspection, packaging lithography, probe card test and analysis, and transparent and opaque thin film measurements; and process control software portfolio that includes solutions for standalone tools, groups of tools, or factory-wide suites. The company also provides spare parts and software licensing services. Its products are used by semiconductor wafer and advanced packaging device manufacturers; silicon wafer; light emitting diode; vertical-cavity surface-emitting laser; micro-electromechanical system; CMOS image sensor; power device; RF filter; data storage; and various industrial and scientific applications. The company was formerly known as Rudolph Technologies, Inc. Onto Innovation Inc. was founded in 1940 and is headquartered in Wilmington, Massachusetts.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Wilmington"
    },
    "POWI": {
        "short_name": "Power Integrations, Inc.",
        "long_name": "Power Integrations, Inc.",
        "summary": "Power Integrations, Inc. designs, develops, manufactures, and markets analog and mixed-signal integrated circuits (ICs), and other electronic components and circuitry used in high-voltage power conversion worldwide. The company offers a range of alternating current to direct current power conversion products that address power supply ranging from less than one watt of output to approximately 500 watts of output for mobile-device chargers, consumer appliances, utility meters, LCD monitors, main and standby power supplies for desktop computers and TVs, LED lighting, and other consumer and industrial applications. It also provides high-voltage diodes; and high-voltage gate-driver products under the SCALE and SCALE-2 product-family names. In addition, the company offers motor-driver ICs for use in refrigerator compressors, ceiling fans, and air purifiers, as well as pumps, fans, and blowers used in consumer appliances, such as dishwashers and laundry machines. It serves communications, computer, consumer, and industrial markets. The company sells its products to original equipment manufacturers and merchant power supply manufacturers through sales personnel, as well as a network of independent sales representatives and distributors. Power Integrations, Inc. was founded in 1988 and is headquartered in San Jose, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "San Jose"
    },
    "PRKR": {
        "short_name": "PARKERVISION INC",
        "long_name": "ParkerVision, Inc.",
        "summary": "ParkerVision, Inc. develops and markets radio frequency technologies and integrated circuits for use in wireless communication products. The company was incorporated in 1989 and is headquartered in Jacksonville, Florida.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Jacksonville"
    },
    "PSFT": {
        "short_name": "POWERSAFE TECHNOLOGY",
        "long_name": "Powersafe Technology Corp.",
        "summary": "Powersafe Technology Corp., through subsidiary, Amplification Technologies, Inc., develops and sells multichannel discrete amplification photon detector (DAPD) technology solution for low-level signal detection. The company's products include discrete amplification photon detectors, thermoelectrically cooled DAPD, near infrared discrete amplification photon detectors, near infrared DAPD thermoelectrically cooled, DAPD room temperature modules, DAPD stabilized temperature modules, DAPD device evaluation modules, and thermoelectrically cooled DAPD device evaluation modules. Its DAPD technology is used in PET scanners, medical imaging, fluorescence detection, high energy physics, spectroscopy, biological sensors, ladar and lidar, homeland security, confocal microscopy, and night vision applications. The company was founded in 2000 and is based in Brooklyn, New York.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Brooklyn"
    },
    "PVJA.F": {
        "short_name": "CEVA INC.  DL-,001",
        "long_name": "CEVA, Inc.",
        "summary": "CEVA, Inc. operates as a licensor of wireless connectivity and smart sensing platforms to semiconductor and original equipment manufacturer (OEM) companies worldwide. It designs and licenses various digital signal processors, AI processors, wireless platforms, and complementary software for sensor fusion, image enhancement, computer vision, voice input, and artificial intelligence (AI). The company licenses a family of signal processing intellectual properties (IPs), including DSP-based platforms for 5G baseband processing in mobile and infrastructure; imaging and computer vision for any camera-enabled devices; audio/voice/speech and ultra-low power applications for multiple IoT markets; sensor fusion software and inertial measurement unit solutions for AR/VR, robotics, remote controls, and IoT; AI processors capable of handling the gamut of neural network workload and on-device; IPs for Bluetooth, Wi-Fi 4/5/6, and NB-IoT. Its technologies are licensed to companies, which design, manufacture, market, and sell application-specific integrated circuits and application-specific standard products to wireless, consumer electronics, and automotive companies for incorporation into various end products. The company delivers its DSP cores, platforms, and AI processors in the form of a hardware description language definition; and offers development platforms, software development kits, and software debug tools that facilitate system design, debug, and software development. The company licenses its technology through a direct sales force. The company was formerly known as ParthusCeva, Inc. and changed its name to CEVA, Inc. in December 2003. CEVA, Inc. was incorporated in 1999 and is headquartered in Rockville, Maryland.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Rockville"
    },
    "PWI.F": {
        "short_name": "POWER INTEGRATIONS DL-001",
        "long_name": "Power Integrations, Inc.",
        "summary": "Power Integrations, Inc. designs, develops, manufactures, and markets analog and mixed-signal integrated circuits (ICs), and other electronic components and circuitry used in high-voltage power conversion worldwide. The company offers a range of alternating current to direct current power conversion products that address power supply ranging from less than one watt of output to approximately 500 watts of output for mobile-device chargers, consumer appliances, utility meters, LCD monitors, main and standby power supplies for desktop computers and TVs, LED lighting, and other consumer and industrial applications. It also provides high-voltage diodes; and high-voltage gate-driver products under the SCALE and SCALE-2 product-family names. In addition, the company offers motor-driver ICs for use in refrigerator compressors, ceiling fans, and air purifiers, as well as pumps, fans, and blowers used in consumer appliances, such as dishwashers and laundry machines. It serves communications, computer, consumer, and industrial markets. The company sells its products to original equipment manufacturers and merchant power supply manufacturers through sales personnel, as well as a network of independent sales representatives and distributors. Power Integrations, Inc. was founded in 1988 and is headquartered in San Jose, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "San Jose"
    },
    "PXLW": {
        "short_name": "Pixelworks, Inc.",
        "long_name": "Pixelworks, Inc.",
        "summary": "Pixelworks, Inc. develops and markets semiconductor and software solutions. The company provides video display processor products comprises image processor ICs, such as embedded microprocessors, digital signal processing technology, and software that control the operations and signal processing within high-end display systems; video co-processor ICs that work with an image processor to post-process video signals to enhance the performance or feature set of the overall video solution; and transcoder ICs, such as embedded microprocessors, digital signal processing technology, and software that control the operations and signal processing for converting bitrates, resolutions, and codecs. As of December 31, 2020, it had an intellectual property portfolio of 338 patents related to the visual display of digital image data. The company's products are used in smartphones, tablets, and projectors. It serves in Japan, China, the United States, Taiwan, Europe, and Korea through a direct sales force, as well as distributors and manufacturers' representatives. The company was incorporated in 1997 and is based in San Jose, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "city": "San Jose"
    },
    "PXLX.F": {
        "short_name": "PIXELWORKS INC.NEW DL-,01",
        "long_name": "Pixelworks, Inc.",
        "summary": "Pixelworks, Inc. develops and markets semiconductor and software solutions. The company provides video display processor products comprises image processor ICs, such as embedded microprocessors, digital signal processing technology, and software that control the operations and signal processing within high-end display systems; video co-processor ICs that work with an image processor to post-process video signals to enhance the performance or feature set of the overall video solution; and transcoder ICs, such as embedded microprocessors, digital signal processing technology, and software that control the operations and signal processing for converting bitrates, resolutions, and codecs. As of December 31, 2020, it had an intellectual property portfolio of 338 patents related to the visual display of digital image data. The company's products are used in smartphones, tablets, and projectors. It serves in Japan, China, the United States, Taiwan, Europe, and Korea through a direct sales force, as well as distributors and manufacturers' representatives. The company was incorporated in 1997 and is based in San Jose, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "San Jose"
    },
    "Q1RV34.SA": {
        "short_name": "QORVO INC   DRN",
        "long_name": "Qorvo, Inc.",
        "summary": "Qorvo, Inc. develops and commercializes technologies and products for wireless and wired connectivity worldwide. The company operates in two segments, Mobile Products, and Infrastructure and Defense Products. The company offers integrated modules incorporating switches, power amplifiers, filters and duplexers, antenna tuners, RF power management integrated circuits, multimode/multi-band PAs and transmit modules, antenna-plexers, discrete filters and duplexers, discrete switches, and UWB system solutions, as well as envelope tracking power management solutions, antenna control solutions, and UWB system solutions supporting secure, low power, location, and communication services. It also provides integrated solutions that include switch-LNA modules, variable gain amplifiers, and integrated PA Doherty modules for massive multiple-input/multiple-output systems; RF products and compound semiconductor foundry services to defense primes and other global defense and aerospace customers; Wi-Fi customer premises equipment, including power amplifiers, switches, low noise amplifiers, and bulk acoustic wave filters; system-on-a-chip hardware, firmware, and application software for smart home applications; automotive RF connectivity products and metal oxide semiconductor based UWB chip and module system solutions; and power application controllers and programmable analog power ICs. The company sells its products directly to original equipment manufacturers and original design manufacturers, as well as through a network of sales representative firms and distributors. Qorvo, Inc. was founded in 1957 and is headquartered in Greensboro, North Carolina.",
        "currency": "BRL",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Greensboro"
    },
    "QCI.DE": {
        "short_name": "QUALCOMM INC.  DL-,0001",
        "long_name": "QUALCOMM Incorporated",
        "summary": "QUALCOMM Incorporated engages in the development and commercialization of foundational technologies and products are used in mobile devices and other wireless products, including network equipment, broadband gateway equipment, consumer electronic devices, and other connected devices worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software based on 3G/4G/5G and other technologies for use in wireless voice and data communications, networking, application processing, multimedia, and global positioning system products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, CDMA TDD, LTE, and/or 5G standards and their derivatives. The QSI segment invests in early-stage companies in various industries, including artificial intelligence, automotive, digital healthcare, enterprise, IoT, mobile and networking and investment for supporting the design and introduction of new products and services for voice and data communications, and new industry segments. The company also provides development, and other services and related products to the United States government agencies and their contractors. QUALCOMM Incorporated was founded in 1985 and is headquartered in San Diego, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "San Diego"
    },
    "QCI.F": {
        "short_name": "QUALCOMM INC.  DL-,0001",
        "long_name": "QUALCOMM Incorporated",
        "summary": "QUALCOMM Incorporated engages in the development and commercialization of foundational technologies and products are used in mobile devices and other wireless products, including network equipment, broadband gateway equipment, consumer electronic devices, and other connected devices worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software based on 3G/4G/5G and other technologies for use in wireless voice and data communications, networking, application processing, multimedia, and global positioning system products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, CDMA TDD, LTE, and/or 5G standards and their derivatives. The QSI segment invests in early-stage companies in various industries, including artificial intelligence, automotive, digital healthcare, enterprise, IoT, mobile and networking and investment for supporting the design and introduction of new products and services for voice and data communications, and new industry segments. The company also provides development, and other services and related products to the United States government agencies and their contractors. QUALCOMM Incorporated was founded in 1985 and is headquartered in San Diego, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "San Diego"
    },
    "QCOM.BA": {
        "short_name": "QUALCOMM INC",
        "long_name": "QUALCOMM Incorporated",
        "summary": "QUALCOMM Incorporated engages in the development and commercialization of foundational technologies and products are used in mobile devices and other wireless products, including network equipment, broadband gateway equipment, consumer electronic devices, and other connected devices worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software based on 3G/4G/5G and other technologies for use in wireless voice and data communications, networking, application processing, multimedia, and global positioning system products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, CDMA TDD, LTE, and/or 5G standards and their derivatives. The QSI segment invests in early-stage companies in various industries, including artificial intelligence, automotive, digital healthcare, enterprise, IoT, mobile and networking and investment for supporting the design and introduction of new products and services for voice and data communications, and new industry segments. The company also provides development, and other services and related products to the United States government agencies and their contractors. QUALCOMM Incorporated was founded in 1985 and is headquartered in San Diego, California.",
        "currency": "ARS",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "city": "San Diego"
    },
    "QCOM.MX": {
        "short_name": "QUALCOMM INC",
        "long_name": "QUALCOMM Incorporated",
        "summary": "QUALCOMM Incorporated engages in the development and commercialization of foundational technologies and products are used in mobile devices and other wireless products, including network equipment, broadband gateway equipment, consumer electronic devices, and other connected devices worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software based on 3G/4G/5G and other technologies for use in wireless voice and data communications, networking, application processing, multimedia, and global positioning system products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, CDMA TDD, LTE, and/or 5G standards and their derivatives. The QSI segment invests in early-stage companies in various industries, including artificial intelligence, automotive, digital healthcare, enterprise, IoT, mobile and networking and investment for supporting the design and introduction of new products and services for voice and data communications, and new industry segments. The company also provides development, and other services and related products to the United States government agencies and their contractors. QUALCOMM Incorporated was founded in 1985 and is headquartered in San Diego, California.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "San Diego"
    },
    "QCOM": {
        "short_name": "QUALCOMM Incorporated",
        "long_name": "QUALCOMM Incorporated",
        "summary": "QUALCOMM Incorporated engages in the development and commercialization of foundational technologies and products are used in mobile devices and other wireless products, including network equipment, broadband gateway equipment, consumer electronic devices, and other connected devices worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software based on 3G/4G/5G and other technologies for use in wireless voice and data communications, networking, application processing, multimedia, and global positioning system products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, CDMA TDD, LTE, and/or 5G standards and their derivatives. The QSI segment invests in early-stage companies in various industries, including artificial intelligence, automotive, digital healthcare, enterprise, IoT, mobile and networking and investment for supporting the design and introduction of new products and services for voice and data communications, and new industry segments. The company also provides development, and other services and related products to the United States government agencies and their contractors. QUALCOMM Incorporated was founded in 1985 and is headquartered in San Diego, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "San Diego"
    },
    "QCOM.SN": {
        "short_name": "QUALCOMM INC",
        "long_name": "QUALCOMM Incorporated",
        "summary": "QUALCOMM Incorporated engages in the development and commercialization of foundational technologies and products are used in mobile devices and other wireless products, including network equipment, broadband gateway equipment, consumer electronic devices, and other connected devices worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software based on 3G/4G/5G and other technologies for use in wireless voice and data communications, networking, application processing, multimedia, and global positioning system products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, CDMA TDD, LTE, and/or 5G standards and their derivatives. The QSI segment invests in early-stage companies in various industries, including artificial intelligence, automotive, digital healthcare, enterprise, IoT, mobile and networking and investment for supporting the design and introduction of new products and services for voice and data communications, and new industry segments. The company also provides development, and other services and related products to the United States government agencies and their contractors. QUALCOMM Incorporated was founded in 1985 and is headquartered in San Diego, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "United States",
        "city": "San Diego"
    },
    "QCOM.VI": {
        "short_name": "QUALCOMM INC",
        "long_name": "QUALCOMM Incorporated",
        "summary": "QUALCOMM Incorporated engages in the development and commercialization of foundational technologies and products are used in mobile devices and other wireless products, including network equipment, broadband gateway equipment, consumer electronic devices, and other connected devices worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software based on 3G/4G/5G and other technologies for use in wireless voice and data communications, networking, application processing, multimedia, and global positioning system products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, CDMA TDD, LTE, and/or 5G standards and their derivatives. The QSI segment invests in early-stage companies in various industries, including artificial intelligence, automotive, digital healthcare, enterprise, IoT, mobile and networking and investment for supporting the design and introduction of new products and services for voice and data communications, and new industry segments. The company also provides development, and other services and related products to the United States government agencies and their contractors. QUALCOMM Incorporated was founded in 1985 and is headquartered in San Diego, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "San Diego"
    },
    "QCOM34.SA": {
        "short_name": "QUALCOMM    DRN",
        "long_name": "QUALCOMM Incorporated",
        "summary": "QUALCOMM Incorporated engages in the development and commercialization of foundational technologies and products are used in mobile devices and other wireless products, including network equipment, broadband gateway equipment, consumer electronic devices, and other connected devices worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software based on 3G/4G/5G and other technologies for use in wireless voice and data communications, networking, application processing, multimedia, and global positioning system products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, CDMA TDD, LTE, and/or 5G standards and their derivatives. The QSI segment invests in early-stage companies in various industries, including artificial intelligence, automotive, digital healthcare, enterprise, IoT, mobile and networking and investment for supporting the design and introduction of new products and services for voice and data communications, and new industry segments. The company also provides development, and other services and related products to the United States government agencies and their contractors. QUALCOMM Incorporated was founded in 1985 and is headquartered in San Diego, California.",
        "currency": "BRL",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "San Diego"
    },
    "QKL1.F": {
        "short_name": "QUICKLOGIC CORP.  DL-,001",
        "long_name": "QuickLogic Corporation",
        "summary": "QuickLogic Corporation, a semiconductor company, develops semiconductor platforms and intellectual property solutions for smartphones, wearable, hearable, tablets, and the Internet-of-Things devices. It also provides flexible sensor processing solutions, ultra-low power display bridges, ultra-low power field programmable gate arrays (FPGAs); and analytics toolkit, an end-to-end software suite that offers processes for developing pattern matching sensor algorithms using machine learning technology, as well as programming hardware and design software solutions. The company's products include pASIC 3, QuickRAM, QuickPCI, EOS, QuickAI, SensiML Analytics Studio, ArcticLink III, PolarPro 3, PolarPro II, PolarPro, and Eclipse II, as well as silicon platforms, IP cores, software drivers, firmware, and application software. It delivers its solutions through ultra-low power customer programmable System on Chip (SoC) semiconductor solutions, embedded software, and algorithm solutions for always-on voice and sensor processing, and enhanced visual experiences. In addition, the company licenses FPGA technology for use in other semiconductor companies SoCs. It markets and sells its products to original equipment manufacturers and original design manufacturers through a network of sales managers and distributors in North America, Europe, and the Asia Pacific. QuickLogic Corporation was founded in 1988 and is headquartered in San Jose, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "San Jose"
    },
    "QRVO": {
        "short_name": "Qorvo, Inc.",
        "long_name": "Qorvo, Inc.",
        "summary": "Qorvo, Inc. develops and commercializes technologies and products for wireless and wired connectivity worldwide. The company operates in two segments, Mobile Products, and Infrastructure and Defense Products. The company offers integrated modules incorporating switches, power amplifiers, filters and duplexers, antenna tuners, RF power management integrated circuits, multimode/multi-band PAs and transmit modules, antenna-plexers, discrete filters and duplexers, discrete switches, and UWB system solutions, as well as envelope tracking power management solutions, antenna control solutions, and UWB system solutions supporting secure, low power, location, and communication services. It also provides integrated solutions that include switch-LNA modules, variable gain amplifiers, and integrated PA Doherty modules for massive multiple-input/multiple-output systems; RF products and compound semiconductor foundry services to defense primes and other global defense and aerospace customers; Wi-Fi customer premises equipment, including power amplifiers, switches, low noise amplifiers, and bulk acoustic wave filters; system-on-a-chip hardware, firmware, and application software for smart home applications; automotive RF connectivity products and metal oxide semiconductor based UWB chip and module system solutions; and power application controllers and programmable analog power ICs. The company sells its products directly to original equipment manufacturers and original design manufacturers, as well as through a network of sales representative firms and distributors. Qorvo, Inc. was founded in 1957 and is headquartered in Greensboro, North Carolina.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Greensboro"
    },
    "QUIK": {
        "short_name": "QuickLogic Corporation",
        "long_name": "QuickLogic Corporation",
        "summary": "QuickLogic Corporation, a semiconductor company, develops semiconductor platforms and intellectual property solutions for smartphones, wearable, hearable, tablets, and the Internet-of-Things devices. It also provides flexible sensor processing solutions, ultra-low power display bridges, ultra-low power field programmable gate arrays (FPGAs); and analytics toolkit, an end-to-end software suite that offers processes for developing pattern matching sensor algorithms using machine learning technology, as well as programming hardware and design software solutions. The company's products include pASIC 3, QuickRAM, QuickPCI, EOS, QuickAI, SensiML Analytics Studio, ArcticLink III, PolarPro 3, PolarPro II, PolarPro, and Eclipse II, as well as silicon platforms, IP cores, software drivers, firmware, and application software. It delivers its solutions through ultra-low power customer programmable System on Chip (SoC) semiconductor solutions, embedded software, and algorithm solutions for always-on voice and sensor processing, and enhanced visual experiences. In addition, the company licenses FPGA technology for use in other semiconductor companies SoCs. It markets and sells its products to original equipment manufacturers and original design manufacturers through a network of sales managers and distributors in North America, Europe, and the Asia Pacific. QuickLogic Corporation was founded in 1988 and is headquartered in San Jose, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "San Jose"
    },
    "RESN": {
        "short_name": "Resonant Inc.",
        "long_name": "Resonant Inc.",
        "summary": "Resonant Inc., a late-stage development company, designs and develops filters for radio frequency (RF) and front-ends used in the mobile device, automotive, medical, internet-of-things, and related industries in Japan, China, and internationally. It uses Infinite Synthesized Networks technology, a software platform to configure and connect resonators that are building blocks of RF filters. The company develops a series of single-band designs for frequency bands; and multiplexer filter designs for two or more bands to address the carrier aggregation requirements; and XBAR, a technology for mobile and non-mobile applications, including 5G, WiFi, and Ultra-WideBand applications. Resonant Inc. was incorporated in 2012 and is headquartered in Austin, Texas.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Austin"
    },
    "RMB.DE": {
        "short_name": "RAMBUS INC.(DEL.) DL-,001",
        "long_name": "Rambus Inc.",
        "summary": "Rambus Inc. provides semiconductor products in the United States, Taiwan, South Korea, Japan, Europe, Canada, Singapore, Asia, and internationally. The company offers DDR memory interface chips to module manufacturers and OEMs; physical interface and companion digital controller IPs for SoC designers; and portfolio of patents that covers memory architecture, high-speed serial links, and security products. It also provides technology licenses to support the implementation and adoption of technology in their products or services; and a range of services, which include know-how and technology transfer, product design and development, system integration, and other services. The company markets its products and services through its direct sales force and distributors. Rambus Inc. was incorporated in 1990 and is headquartered in San Jose, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "San Jose"
    },
    "RMB.F": {
        "short_name": "RAMBUS INC.(DEL.) DL-,001",
        "long_name": "Rambus Inc.",
        "summary": "Rambus Inc. provides semiconductor products in the United States, Taiwan, South Korea, Japan, Europe, Canada, Singapore, Asia, and internationally. The company offers DDR memory interface chips to module manufacturers and OEMs; physical interface and companion digital controller IPs for SoC designers; and portfolio of patents that covers memory architecture, high-speed serial links, and security products. It also provides technology licenses to support the implementation and adoption of technology in their products or services; and a range of services, which include know-how and technology transfer, product design and development, system integration, and other services. The company markets its products and services through its direct sales force and distributors. Rambus Inc. was incorporated in 1990 and is headquartered in San Jose, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "San Jose"
    },
    "RMBS": {
        "short_name": "Rambus, Inc.",
        "long_name": "Rambus Inc.",
        "summary": "Rambus Inc. provides semiconductor products in the United States, Taiwan, South Korea, Japan, Europe, Canada, Singapore, Asia, and internationally. The company offers DDR memory interface chips to module manufacturers and OEMs; physical interface and companion digital controller IPs for SoC designers; and portfolio of patents that covers memory architecture, high-speed serial links, and security products. It also provides technology licenses to support the implementation and adoption of technology in their products or services; and a range of services, which include know-how and technology transfer, product design and development, system integration, and other services. The company markets its products and services through its direct sales force and distributors. Rambus Inc. was incorporated in 1990 and is headquartered in San Jose, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "San Jose"
    },
    "S1SL34.SA": {
        "short_name": "SKYWORKS SOLDRN",
        "long_name": "Skyworks Solutions, Inc.",
        "summary": "Skyworks Solutions, Inc., together with its subsidiaries, designs, develops, manufactures, and markets proprietary semiconductor products, including intellectual property in the United States, China, South Korea, Taiwan, Europe, the Middle East, Africa, and rest of Asia-Pacific. Its product portfolio includes amplifiers, antenna tuners, attenuators, circulators/isolators, DC/DC converters, demodulators, detectors, diodes, wireless analog system on chip products, directional couplers, diversity receive modules, filters, front-end modules, hybrids, light emitting diode drivers, low noise amplifiers, mixers, modulators, optocouplers/optoisolators, phase locked loops, phase shifters, power dividers/combiners, receivers, switches, synthesizers, technical ceramics, voltage controlled oscillators/synthesizers, and voltage regulators. The company provides its products for use in the aerospace, automotive, broadband, cellular infrastructure, connected home, entertainment and gaming, industrial, medical, military, smartphone, tablet, and wearable markets. It sells its products through direct sales force, electronic component distributors, and independent sales representatives. The company was founded in 1962 and is headquartered in Irvine, California.",
        "currency": "BRL",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Irvine"
    },
    "SGH": {
        "short_name": "SMART Global Holdings, Inc.",
        "long_name": "SMART Global Holdings, Inc.",
        "summary": "SMART Global Holdings, Inc. designs and manufactures electronic products focused in memory and computing technology areas. It offers dynamic random access memory (DRAM) modules for desktops, notebooks, and servers; and embedded and removable flash memory products; and flash component products, such as embedded multimedia controllers, and embedded and removal products in USB, CompactFlash and SD/microSD card configurations. The company also provides supply chain services, including procurement, logistics, inventory management, temporary warehousing, programming, kitting, and packaging. In addition, it offers specialty compute and storage system solutions to customers various verticals, including financial services, energy, government, social media, and education end markets; and offers hardware and software products, including solutions based on the Open Compute Project. Further it provides servers, software, integrated turn-key clusters, enterprise-grade storage, and bare metal HPC in hardware or cloud-based solutions through Penguin Computing On-Demand; Open Compute Tundra Extreme Scale products; turn-key storage solutions based upon its Frostbyte storage platform; and rackmount servers and GPU accelerated computing platforms. The company sells its products directly to original equipment manufacturers, enterprise, government and other end customers through direct sales force, e-commerce, customer service representatives, on-site field application engineers, independent sales representatives, distributors, integrators, and resellers. The company was formerly known as Saleen Holdings, Inc. and changed its name to SMART Global Holdings, Inc. in August 2014. SMART Global Holdings, Inc. was founded in 1988 and is headquartered in Newark, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Newark"
    },
    "SITM": {
        "short_name": "SiTime Corporation",
        "long_name": "SiTime Corporation",
        "summary": "SiTime Corporation provides silicon timing systems in Taiwan, Hong Kong, the United States, and internationally. It provides resonators and clock integrated circuits, and various types of oscillators. The company's solutions are used in various markets, including enterprise and telecommunications infrastructure, automotive, industrial, Internet of Things, mobile, and aerospace and defense. It offers its products through distributors and resellers. The company was incorporated in 2003 and is headquartered in Santa Clara, California. SiTime Corporation was formerly a subsidiary of MegaChips Corporation.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "SJN.F": {
        "short_name": "SYNAPTICS INC.  DL 0,001",
        "long_name": "Synaptics Incorporated",
        "summary": "Synaptics Incorporated develops, markets, and sells intuitive human interface solutions for electronic devices and products worldwide. The company offers ClearPad, which enables users to interact directly with the display on mobile smartphones, tablets, and automobiles; ClearView products that provide advanced image processing and low power technology for displays on electronic devices, including smartphones and tablets; TouchView products, which integrate touch and display technologies to deliver performance and simplified design; and Natural ID, a fingerprint ID product that is used in automobiles, notebook personal computers (PCs), PC peripherals, and other applications. It also provides TouchPad, a touch-sensitive pad that senses the position and movement of one or more fingers on its surface; SecurePad that integrates fingerprint sensor directly into the TouchPad area; ClickPad that offers a clickable mechanical design to the TouchPad solution; ForcePad, a thinner version of its ClickPad; AudioSmart personal voice and audio solutions; VideoSmart single-chip 4K UHD media processors for TVs, set-top boxes, and over-the-top streaming devices; and ImagingSmart solutions. In addition, the company offers TouchPad with a pointing stick in a single notebook computer enabling users to select their interface of choice; TouchStyk, a self-contained pointing stick module; and TouchButtons, which provides capacitive buttons and scrolling controls, as well as display interface products. The company sells its products through direct sales, outside sales representatives, distributors, and resellers. It serves mobile and PC original equipment manufacturers; Internet of Things manufacturers; and consumer electronics manufacturers. The company was founded in 1986 and is headquartered in San Jose, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "San Jose"
    },
    "SKYT": {
        "short_name": "SkyWater Technology, Inc.",
        "long_name": "SkyWater Technology, Inc.",
        "summary": "SkyWater Technology, Inc. manufactures integrated circuits. The company provides technology services for various microelectronics comprising integrated circuits (ICs); and related micro- and nanotechnology applications. It serves customers developing and manufacturing ICs in various markets, including aerospace and defense, automotive, computing and cloud, consumer, industrial, and medical. The company was incorporated in 2017 and is headquartered in Bloomington, Minnesota.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Bloomington"
    },
    "SLAB.MX": {
        "short_name": "SILICON LABORATORIES",
        "long_name": "Silicon Laboratories Inc.",
        "summary": "Silicon Laboratories Inc., a fabless semiconductor company, provides mixed-signal integrated circuits (ICs) in the United States, China, and internationally. The company offers microcontrollers and wireless products, including 8-bit mixed-signal and ultra-low-power 32-bit microcontrollers (MCU); wireless MCU connectivity solutions; single and multi-protocol system-on-chip (SoC) devices and modules; wireless protocols, MCUs, and SoCs; in-house protocol stacks; Micrium, a real-time operating system that helps simplify software development for IoT developers.It also provides sensor products comprising optical, relative humidity/temperature, and hall effect magnetic sensors; timing devices; multi-channel isolators, isolated drivers, isolated power converters, and mixed-signal devices; broadcast products, which include single-chip hybrid TV tuners and digital video demodulators, as well as AM/FM, HD radio, and DAB/DAB+ receivers; and hybrid software defined radio tuners, data receivers, and digital radio coprocessors. In addition, the company offers ProSLIC, a subscriber line interface circuits for voice over IP; ISOmodem embedded modems; and Power over Ethernet power source equipment and powered device ICs. It primarily markets its products to Internet of Things, Internet infrastructure, industrial automation, consumer, and automotive markets through direct sales force, as well as through a network of independent sales representatives and distributors. Silicon Laboratories Inc. was founded in 1996 and is headquartered in Austin, Texas.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Austin"
    },
    "SLAB": {
        "short_name": "Silicon Laboratories, Inc.",
        "long_name": "Silicon Laboratories Inc.",
        "summary": "Silicon Laboratories Inc., a fabless semiconductor company, provides mixed-signal integrated circuits (ICs) in the United States, China, and internationally. The company offers microcontrollers and wireless products, including 8-bit mixed-signal and ultra-low-power 32-bit microcontrollers (MCU); wireless MCU connectivity solutions; single and multi-protocol system-on-chip (SoC) devices and modules; wireless protocols, MCUs, and SoCs; in-house protocol stacks; Micrium, a real-time operating system that helps simplify software development for IoT developers.It also provides sensor products comprising optical, relative humidity/temperature, and hall effect magnetic sensors; timing devices; multi-channel isolators, isolated drivers, isolated power converters, and mixed-signal devices; broadcast products, which include single-chip hybrid TV tuners and digital video demodulators, as well as AM/FM, HD radio, and DAB/DAB+ receivers; and hybrid software defined radio tuners, data receivers, and digital radio coprocessors. In addition, the company offers ProSLIC, a subscriber line interface circuits for voice over IP; ISOmodem embedded modems; and Power over Ethernet power source equipment and powered device ICs. It primarily markets its products to Internet of Things, Internet infrastructure, industrial automation, consumer, and automotive markets through direct sales force, as well as through a network of independent sales representatives and distributors. Silicon Laboratories Inc. was founded in 1996 and is headquartered in Austin, Texas.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Austin"
    },
    "SM2.F": {
        "short_name": "SEMTECH CORP.  DL-,01",
        "long_name": "Semtech Corporation",
        "summary": "Semtech Corporation designs, develops, manufactures, and markets analog and mixed-signal semiconductor products and advanced algorithms. The company provides signal integrity products, including a portfolio of optical data communications and video transport products used in various infrastructure, and industrial applications; a portfolio of integrated circuits for data centers, enterprise networks, passive optical networks, wireless base station optical transceivers, and high-speed interface applications; and video products for broadcast applications, as well as video-over-IP technology for professional audio video applications. It also offers protection products, such as filter and termination devices that are integrated with the transient voltage suppressor devices, which protect electronic systems from voltage spikes; and wireless and sensing products comprising a portfolio of specialized radio frequency products used in various industrial, medical, and communications applications, as well as specialized sensing products used in industrial and consumer applications. In addition, the company provides power products consisting of switching voltage regulators, combination switching and linear regulators, smart regulators, isolated switches, and wireless charging that control, alter, regulate, and condition the power within electronic systems. It serves original equipment manufacturers and their suppliers in the enterprise computing, communications, and consumer and industrial end-markets. The company sells its products directly, as well as through independent sales representative firms and independent distributors in the United States, Europe, and Asia. Semtech Corporation was incorporated in 1960 and is headquartered in Camarillo, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Camarillo"
    },
    "SMTC": {
        "short_name": "Semtech Corporation",
        "long_name": "Semtech Corporation",
        "summary": "Semtech Corporation designs, develops, manufactures, and markets analog and mixed-signal semiconductor products and advanced algorithms. The company provides signal integrity products, including a portfolio of optical data communications and video transport products used in various infrastructure, and industrial applications; a portfolio of integrated circuits for data centers, enterprise networks, passive optical networks, wireless base station optical transceivers, and high-speed interface applications; and video products for broadcast applications, as well as video-over-IP technology for professional audio video applications. It also offers protection products, such as filter and termination devices that are integrated with the transient voltage suppressor devices, which protect electronic systems from voltage spikes; and wireless and sensing products comprising a portfolio of specialized radio frequency products used in various industrial, medical, and communications applications, as well as specialized sensing products used in industrial and consumer applications. In addition, the company provides power products consisting of switching voltage regulators, combination switching and linear regulators, smart regulators, isolated switches, and wireless charging that control, alter, regulate, and condition the power within electronic systems. It serves original equipment manufacturers and their suppliers in the enterprise computing, communications, and consumer and industrial end-markets. The company sells its products directly, as well as through independent sales representative firms and independent distributors in the United States, Europe, and Asia. Semtech Corporation was incorporated in 1960 and is headquartered in Camarillo, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Camarillo"
    },
    "STRB": {
        "short_name": "STRASBAUGH",
        "long_name": "Strasbaugh",
        "summary": "Strasbaugh manufactures and sells CMP and grinding equipment for use in the production of semiconductor devices. Its CMP and wafer grinding systems are used to manufacture a range of mobile devices, including MEMS, LEDs, RF/power devices, thin film heads, and ICs. The company also provides remanufactured equipment. Its machines are used to make nanotechnology for the Internet of Things, mobile computing platforms, LED lighting, and an array of semiconductor devices. The company supplies its equipment through direct and representative sales and service offices located in the United States, China, France, Germany, Italy, Japan, Korea, Taiwan, and the United Kingdom. Strasbaugh was founded in 1948 and is headquartered in San Luis Obispo, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "San Luis Obispo"
    },
    "SUE1.F": {
        "short_name": "SUMMIT WIRELESS  DL-,0001",
        "long_name": "Summit Wireless Technologies, Inc.",
        "summary": "Summit Wireless Technologies, Inc., a technology company, develops, manufactures, and sells modules and integrated circuits for home entertainment and wireless audio market in the United States, Europe, and the Asia Pacific. It offers TX modules for integration into televisions, audio-visual receivers, media hubs, and USB or HDMI dongles; and speaker systems. The company sells its products directly to original equipment manufacturers. The company was formerly known as Summit Semiconductor, Inc. and changed its name to Summit Wireless Technologies, Inc. in September 2018. Summit Semiconductor, Inc. was incorporated in 2010 and is headquartered in San Jose, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "San Jose"
    },
    "SWKS.MX": {
        "short_name": "SKYWORKS SOLUTIONS INC",
        "long_name": "Skyworks Solutions, Inc.",
        "summary": "Skyworks Solutions, Inc., together with its subsidiaries, designs, develops, manufactures, and markets proprietary semiconductor products, including intellectual property in the United States, China, South Korea, Taiwan, Europe, the Middle East, Africa, and rest of Asia-Pacific. Its product portfolio includes amplifiers, antenna tuners, attenuators, circulators/isolators, DC/DC converters, demodulators, detectors, diodes, wireless analog system on chip products, directional couplers, diversity receive modules, filters, front-end modules, hybrids, light emitting diode drivers, low noise amplifiers, mixers, modulators, optocouplers/optoisolators, phase locked loops, phase shifters, power dividers/combiners, receivers, switches, synthesizers, technical ceramics, voltage controlled oscillators/synthesizers, and voltage regulators. The company provides its products for use in the aerospace, automotive, broadband, cellular infrastructure, connected home, entertainment and gaming, industrial, medical, military, smartphone, tablet, and wearable markets. It sells its products through direct sales force, electronic component distributors, and independent sales representatives. The company was founded in 1962 and is headquartered in Irvine, California.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Irvine"
    },
    "SWKS": {
        "short_name": "Skyworks Solutions, Inc.",
        "long_name": "Skyworks Solutions, Inc.",
        "summary": "Skyworks Solutions, Inc., together with its subsidiaries, designs, develops, manufactures, and markets proprietary semiconductor products, including intellectual property in the United States, China, South Korea, Taiwan, Europe, the Middle East, Africa, and rest of Asia-Pacific. Its product portfolio includes amplifiers, antenna tuners, attenuators, circulators/isolators, DC/DC converters, demodulators, detectors, diodes, wireless analog system on chip products, directional couplers, diversity receive modules, filters, front-end modules, hybrids, light emitting diode drivers, low noise amplifiers, mixers, modulators, optocouplers/optoisolators, phase locked loops, phase shifters, power dividers/combiners, receivers, switches, synthesizers, technical ceramics, voltage controlled oscillators/synthesizers, and voltage regulators. The company provides its products for use in the aerospace, automotive, broadband, cellular infrastructure, connected home, entertainment and gaming, industrial, medical, military, smartphone, tablet, and wearable markets. It sells its products through direct sales force, electronic component distributors, and independent sales representatives. The company was founded in 1962 and is headquartered in Irvine, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Irvine"
    },
    "SWKS.VI": {
        "short_name": "SKYWORKS SOLUTIONS INC",
        "long_name": "Skyworks Solutions, Inc.",
        "summary": "Skyworks Solutions, Inc., together with its subsidiaries, designs, develops, manufactures, and markets proprietary semiconductor products, including intellectual property in the United States, China, South Korea, Taiwan, Europe, the Middle East, Africa, and rest of Asia-Pacific. Its product portfolio includes amplifiers, antenna tuners, attenuators, circulators/isolators, DC/DC converters, demodulators, detectors, diodes, wireless analog system on chip products, directional couplers, diversity receive modules, filters, front-end modules, hybrids, light emitting diode drivers, low noise amplifiers, mixers, modulators, optocouplers/optoisolators, phase locked loops, phase shifters, power dividers/combiners, receivers, switches, synthesizers, technical ceramics, voltage controlled oscillators/synthesizers, and voltage regulators. The company provides its products for use in the aerospace, automotive, broadband, cellular infrastructure, connected home, entertainment and gaming, industrial, medical, military, smartphone, tablet, and wearable markets. It sells its products through direct sales force, electronic component distributors, and independent sales representatives. The company was founded in 1962 and is headquartered in Irvine, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "Irvine"
    },
    "SYNA": {
        "short_name": "Synaptics Incorporated",
        "long_name": "Synaptics Incorporated",
        "summary": "Synaptics Incorporated develops, markets, and sells intuitive human interface solutions for electronic devices and products worldwide. The company offers ClearPad, which enables users to interact directly with the display on mobile smartphones, tablets, and automobiles; ClearView products that provide advanced image processing and low power technology for displays on electronic devices, including smartphones and tablets; TouchView products, which integrate touch and display technologies to deliver performance and simplified design; and Natural ID, a fingerprint ID product that is used in automobiles, notebook personal computers (PCs), PC peripherals, and other applications. It also provides TouchPad, a touch-sensitive pad that senses the position and movement of one or more fingers on its surface; SecurePad that integrates fingerprint sensor directly into the TouchPad area; ClickPad that offers a clickable mechanical design to the TouchPad solution; ForcePad, a thinner version of its ClickPad; AudioSmart personal voice and audio solutions; VideoSmart single-chip 4K UHD media processors for TVs, set-top boxes, and over-the-top streaming devices; and ImagingSmart solutions. In addition, the company offers TouchPad with a pointing stick in a single notebook computer enabling users to select their interface of choice; TouchStyk, a self-contained pointing stick module; and TouchButtons, which provides capacitive buttons and scrolling controls, as well as display interface products. The company sells its products through direct sales, outside sales representatives, distributors, and resellers. It serves mobile and PC original equipment manufacturers; Internet of Things manufacturers; and consumer electronics manufacturers. The company was founded in 1986 and is headquartered in San Jose, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "San Jose"
    },
    "TEXA34.SA": {
        "short_name": "TEXAS INC   DRN",
        "long_name": "Texas Instruments Incorporated",
        "summary": "Texas Instruments Incorporated designs, manufactures, and sells semiconductors to electronics designers and manufacturers worldwide. It operates in two segments, Analog and Embedded Processing. The Analog segment offers power products to manage power requirements in various levels using battery management solutions, DC/DC switching regulators, AC/DC and isolated controllers and converters, power switches, linear regulators, voltage supervisors, voltage references, and lighting products. This segment also provides signal chain products that sense, condition, and measure signals to allow information to be transferred or converted for further processing and control for use in end markets, including amplifiers, data converters, interface products, motor drives, clocks, and sensing products.; and high volume products comprising integrated analog and standard products, which are primarily for sale into personal electronics, industrial, and automotive markets. The Embedded Processing segment offers connected microcontrollers, such as microcontrollers, microcontrollers with integrated wireless capabilities, and stand-alone wireless connectivity solutions that are used in electronic equipment; digital signal processors for mathematical computations; and applications processors for specific computing activity. This segment offers products for use in various markets, such as industrial, automotive, Personal electronics, communications equipment, enterprise systems, and calculators and other. The company also provides DLP products primarily for use in projectors to create high-definition images; calculators; and application-specific integrated circuits. Texas Instruments Incorporated markets and sells its semiconductor products through direct sales and distributors, as well as through its website. The company was founded in 1930 and is headquartered in Dallas, Texas.",
        "currency": "BRL",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Dallas"
    },
    "TII.DE": {
        "short_name": "TEXAS INSTR.  DL 1",
        "long_name": "Texas Instruments Incorporated",
        "summary": "Texas Instruments Incorporated designs, manufactures, and sells semiconductors to electronics designers and manufacturers worldwide. It operates in two segments, Analog and Embedded Processing. The Analog segment offers power products to manage power requirements in various levels using battery management solutions, DC/DC switching regulators, AC/DC and isolated controllers and converters, power switches, linear regulators, voltage supervisors, voltage references, and lighting products. This segment also provides signal chain products that sense, condition, and measure signals to allow information to be transferred or converted for further processing and control for use in end markets, including amplifiers, data converters, interface products, motor drives, clocks, and sensing products.; and high volume products comprising integrated analog and standard products, which are primarily for sale into personal electronics, industrial, and automotive markets. The Embedded Processing segment offers connected microcontrollers, such as microcontrollers, microcontrollers with integrated wireless capabilities, and stand-alone wireless connectivity solutions that are used in electronic equipment; digital signal processors for mathematical computations; and applications processors for specific computing activity. This segment offers products for use in various markets, such as industrial, automotive, Personal electronics, communications equipment, enterprise systems, and calculators and other. The company also provides DLP products primarily for use in projectors to create high-definition images; calculators; and application-specific integrated circuits. Texas Instruments Incorporated markets and sells its semiconductor products through direct sales and distributors, as well as through its website. The company was founded in 1930 and is headquartered in Dallas, Texas.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Dallas"
    },
    "TII.F": {
        "short_name": "TEXAS INSTR.  DL 1",
        "long_name": "Texas Instruments Incorporated",
        "summary": "Texas Instruments Incorporated designs, manufactures, and sells semiconductors to electronics designers and manufacturers worldwide. It operates in two segments, Analog and Embedded Processing. The Analog segment offers power products to manage power requirements in various levels using battery management solutions, DC/DC switching regulators, AC/DC and isolated controllers and converters, power switches, linear regulators, voltage supervisors, voltage references, and lighting products. This segment also provides signal chain products that sense, condition, and measure signals to allow information to be transferred or converted for further processing and control for use in end markets, including amplifiers, data converters, interface products, motor drives, clocks, and sensing products.; and high volume products comprising integrated analog and standard products, which are primarily for sale into personal electronics, industrial, and automotive markets. The Embedded Processing segment offers connected microcontrollers, such as microcontrollers, microcontrollers with integrated wireless capabilities, and stand-alone wireless connectivity solutions that are used in electronic equipment; digital signal processors for mathematical computations; and applications processors for specific computing activity. This segment offers products for use in various markets, such as industrial, automotive, Personal electronics, communications equipment, enterprise systems, and calculators and other. The company also provides DLP products primarily for use in projectors to create high-definition images; calculators; and application-specific integrated circuits. Texas Instruments Incorporated markets and sells its semiconductor products through direct sales and distributors, as well as through its website. The company was founded in 1930 and is headquartered in Dallas, Texas.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Dallas"
    },
    "TXCCQ": {
        "short_name": "TRANSWITCH CORP",
        "long_name": "TranSwitch Corporation",
        "summary": "TranSwitch Corporation, together with its subsidiaries, designs, develops, and supplies integrated circuit and intellectual property solutions that provide functionality for voice, data, and video communications equipment for the customer premises and network infrastructure markets. The company provides integrated multi-core network processor system-on-a-chip (SoC) solutions for fixed, 3G and 4G mobile, VoIP, and multimedia applications. It offers converged network infrastructure products, including infrastructure VoIP processors for wire-line and wireless carrier equipment; access VoIP processors; and EoS/EoPDH mappers and framers for carriers to transport data traffic over SONET, SDH, and PDH networks. The company also offers broadband customer premises equipment, such as connectivity solutions comprising HDMI, DisplayPort, MHL, HDP, Ethernet IP cores, and MHDP transceivers for consumer electronics, home network equipment, and industrial and automotive applications; and multi-service SoCs for customer premises equipment that support telephone voice, fax, and routing functionality over broadband access networks. TranSwitch Corporation sells its products to public network system original equipment manufacturers (OEMs), WAN and LAN equipment OEMs, Internet-oriented OEMs, and communications test and performance measurement equipment OEMs; and government, universities, and private laboratories. The company offers its products directly in North America, Taiwan, China, Japan, Korea, and Europe, as well as through a network of distributors in North America, Asia, and Europe. TranSwitch Corporation was founded in 1988 and is headquartered in Shelton, Connecticut. On November 21, 2013, TranSwitch Corporation filed a voluntary petition for liquidation under Chapter 7 in the U.S. Bankruptcy Court for the District of Connecticut.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Shelton"
    },
    "TXN.BA": {
        "short_name": "TEXAS INSTRUMENTS",
        "long_name": "Texas Instruments Incorporated",
        "summary": "Texas Instruments Incorporated designs, manufactures, and sells semiconductors to electronics designers and manufacturers worldwide. It operates in two segments, Analog and Embedded Processing. The Analog segment offers power products to manage power requirements in various levels using battery management solutions, DC/DC switching regulators, AC/DC and isolated controllers and converters, power switches, linear regulators, voltage supervisors, voltage references, and lighting products. This segment also provides signal chain products that sense, condition, and measure signals to allow information to be transferred or converted for further processing and control for use in end markets, including amplifiers, data converters, interface products, motor drives, clocks, and sensing products.; and high volume products comprising integrated analog and standard products, which are primarily for sale into personal electronics, industrial, and automotive markets. The Embedded Processing segment offers connected microcontrollers, such as microcontrollers, microcontrollers with integrated wireless capabilities, and stand-alone wireless connectivity solutions that are used in electronic equipment; digital signal processors for mathematical computations; and applications processors for specific computing activity. This segment offers products for use in various markets, such as industrial, automotive, Personal electronics, communications equipment, enterprise systems, and calculators and other. The company also provides DLP products primarily for use in projectors to create high-definition images; calculators; and application-specific integrated circuits. Texas Instruments Incorporated markets and sells its semiconductor products through direct sales and distributors, as well as through its website. The company was founded in 1930 and is headquartered in Dallas, Texas.",
        "currency": "ARS",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "city": "Dallas"
    },
    "TXN.MX": {
        "short_name": "TEXAS INSTRUMENTS INC",
        "long_name": "Texas Instruments Incorporated",
        "summary": "Texas Instruments Incorporated designs, manufactures, and sells semiconductors to electronics designers and manufacturers worldwide. It operates in two segments, Analog and Embedded Processing. The Analog segment offers power products to manage power requirements in various levels using battery management solutions, DC/DC switching regulators, AC/DC and isolated controllers and converters, power switches, linear regulators, voltage supervisors, voltage references, and lighting products. This segment also provides signal chain products that sense, condition, and measure signals to allow information to be transferred or converted for further processing and control for use in end markets, including amplifiers, data converters, interface products, motor drives, clocks, and sensing products.; and high volume products comprising integrated analog and standard products, which are primarily for sale into personal electronics, industrial, and automotive markets. The Embedded Processing segment offers connected microcontrollers, such as microcontrollers, microcontrollers with integrated wireless capabilities, and stand-alone wireless connectivity solutions that are used in electronic equipment; digital signal processors for mathematical computations; and applications processors for specific computing activity. This segment offers products for use in various markets, such as industrial, automotive, Personal electronics, communications equipment, enterprise systems, and calculators and other. The company also provides DLP products primarily for use in projectors to create high-definition images; calculators; and application-specific integrated circuits. Texas Instruments Incorporated markets and sells its semiconductor products through direct sales and distributors, as well as through its website. The company was founded in 1930 and is headquartered in Dallas, Texas.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Dallas"
    },
    "TXN": {
        "short_name": "Texas Instruments Incorporated",
        "long_name": "Texas Instruments Incorporated",
        "summary": "Texas Instruments Incorporated designs, manufactures, and sells semiconductors to electronics designers and manufacturers worldwide. It operates in two segments, Analog and Embedded Processing. The Analog segment offers power products to manage power requirements in various levels using battery management solutions, DC/DC switching regulators, AC/DC and isolated controllers and converters, power switches, linear regulators, voltage supervisors, voltage references, and lighting products. This segment also provides signal chain products that sense, condition, and measure signals to allow information to be transferred or converted for further processing and control for use in end markets, including amplifiers, data converters, interface products, motor drives, clocks, and sensing products.; and high volume products comprising integrated analog and standard products, which are primarily for sale into personal electronics, industrial, and automotive markets. The Embedded Processing segment offers connected microcontrollers, such as microcontrollers, microcontrollers with integrated wireless capabilities, and stand-alone wireless connectivity solutions that are used in electronic equipment; digital signal processors for mathematical computations; and applications processors for specific computing activity. This segment offers products for use in various markets, such as industrial, automotive, Personal electronics, communications equipment, enterprise systems, and calculators and other. The company also provides DLP products primarily for use in projectors to create high-definition images; calculators; and application-specific integrated circuits. Texas Instruments Incorporated markets and sells its semiconductor products through direct sales and distributors, as well as through its website. The company was founded in 1930 and is headquartered in Dallas, Texas.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Dallas"
    },
    "TXN.SN": {
        "short_name": "TEXAS INSTRUMENTS",
        "long_name": "Texas Instruments Incorporated",
        "summary": "Texas Instruments Incorporated designs, manufactures, and sells semiconductors to electronics designers and manufacturers worldwide. It operates in two segments, Analog and Embedded Processing. The Analog segment offers power products to manage power requirements in various levels using battery management solutions, DC/DC switching regulators, AC/DC and isolated controllers and converters, power switches, linear regulators, voltage supervisors, voltage references, and lighting products. This segment also provides signal chain products that sense, condition, and measure signals to allow information to be transferred or converted for further processing and control for use in end markets, including amplifiers, data converters, interface products, motor drives, clocks, and sensing products.; and high volume products comprising integrated analog and standard products, which are primarily for sale into personal electronics, industrial, and automotive markets. The Embedded Processing segment offers connected microcontrollers, such as microcontrollers, microcontrollers with integrated wireless capabilities, and stand-alone wireless connectivity solutions that are used in electronic equipment; digital signal processors for mathematical computations; and applications processors for specific computing activity. This segment offers products for use in various markets, such as industrial, automotive, Personal electronics, communications equipment, enterprise systems, and calculators and other. The company also provides DLP products primarily for use in projectors to create high-definition images; calculators; and application-specific integrated circuits. Texas Instruments Incorporated markets and sells its semiconductor products through direct sales and distributors, as well as through its website. The company was founded in 1930 and is headquartered in Dallas, Texas.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "United States",
        "city": "Dallas"
    },
    "TXN.VI": {
        "short_name": "TEXAS INSTRUMENTS INC",
        "long_name": "Texas Instruments Incorporated",
        "summary": "Texas Instruments Incorporated designs, manufactures, and sells semiconductors to electronics designers and manufacturers worldwide. It operates in two segments, Analog and Embedded Processing. The Analog segment offers power products to manage power requirements in various levels using battery management solutions, DC/DC switching regulators, AC/DC and isolated controllers and converters, power switches, linear regulators, voltage supervisors, voltage references, and lighting products. This segment also provides signal chain products that sense, condition, and measure signals to allow information to be transferred or converted for further processing and control for use in end markets, including amplifiers, data converters, interface products, motor drives, clocks, and sensing products.; and high volume products comprising integrated analog and standard products, which are primarily for sale into personal electronics, industrial, and automotive markets. The Embedded Processing segment offers connected microcontrollers, such as microcontrollers, microcontrollers with integrated wireless capabilities, and stand-alone wireless connectivity solutions that are used in electronic equipment; digital signal processors for mathematical computations; and applications processors for specific computing activity. This segment offers products for use in various markets, such as industrial, automotive, Personal electronics, communications equipment, enterprise systems, and calculators and other. The company also provides DLP products primarily for use in projectors to create high-definition images; calculators; and application-specific integrated circuits. Texas Instruments Incorporated markets and sells its semiconductor products through direct sales and distributors, as well as through its website. The company was founded in 1930 and is headquartered in Dallas, Texas.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "Dallas"
    },
    "VHY.F": {
        "short_name": "VISHAY INTERTECH.  DL-,10",
        "long_name": "Vishay Intertechnology, Inc.",
        "summary": "Vishay Intertechnology, Inc. manufactures and supplies discrete semiconductors and passive electronic components in Asia, Europe, and the Americas. The company operates through six segments: Metal Oxide Semiconductor Field Effect Transistors (MOSFETs), Diodes, Optoelectronic Components, Resistors, Inductors, and Capacitors. It offers semiconductor components, such as low- and medium-voltage TrenchFET MOSFETs, high-voltage planar MOSFETs, high voltage super junction MOSFETs, power integrated circuits, and integrated function power devices; rectifiers, small signal diodes, protection diodes, thyristors or silicon-controlled rectifiers, and power modules; and standard and customer specific optoelectronic components, such as infrared (IR) emitters and detectors, IR remote control receivers, optocouplers, solid-state relays, optical sensors, light-emitting diodes, 7-segment displays, and IR data transceiver modules. The company also provides passive components, including resistors, inductors, and capacitors. Its semiconductor components are used for power control, power conversion, power management, signal switching, signal routing, signal blocking, signal amplification, two-way data transfer, one-way remote control, and circuit isolation functions; and passive components are used to restrict current flow, suppress voltage increases, store and discharge energy, control alternating current and voltage, filter out unwanted electrical signals, and other functions. The company serves industrial, computing, automotive, consumer, telecommunications, power supplies, military and aerospace, and medical end markets. Vishay Intertechnology, Inc. was incorporated in 1962 and is headquartered in Malvern, Pennsylvania.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Malvern"
    },
    "VSH": {
        "short_name": "Vishay Intertechnology, Inc.",
        "long_name": "Vishay Intertechnology, Inc.",
        "summary": "Vishay Intertechnology, Inc. manufactures and supplies discrete semiconductors and passive electronic components in Asia, Europe, and the Americas. The company operates through six segments: Metal Oxide Semiconductor Field Effect Transistors (MOSFETs), Diodes, Optoelectronic Components, Resistors, Inductors, and Capacitors. It offers semiconductor components, such as low- and medium-voltage TrenchFET MOSFETs, high-voltage planar MOSFETs, high voltage super junction MOSFETs, power integrated circuits, and integrated function power devices; rectifiers, small signal diodes, protection diodes, thyristors or silicon-controlled rectifiers, and power modules; and standard and customer specific optoelectronic components, such as infrared (IR) emitters and detectors, IR remote control receivers, optocouplers, solid-state relays, optical sensors, light-emitting diodes, 7-segment displays, and IR data transceiver modules. The company also provides passive components, including resistors, inductors, and capacitors. Its semiconductor components are used for power control, power conversion, power management, signal switching, signal routing, signal blocking, signal amplification, two-way data transfer, one-way remote control, and circuit isolation functions; and passive components are used to restrict current flow, suppress voltage increases, store and discharge energy, control alternating current and voltage, filter out unwanted electrical signals, and other functions. The company serves industrial, computing, automotive, consumer, telecommunications, power supplies, military and aerospace, and medical end markets. Vishay Intertechnology, Inc. was incorporated in 1962 and is headquartered in Malvern, Pennsylvania.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Malvern"
    },
    "WISA": {
        "short_name": "Summit Wireless Technologies, I",
        "long_name": "Summit Wireless Technologies, Inc.",
        "summary": "Summit Wireless Technologies, Inc., a technology company, develops, manufactures, and sells modules and integrated circuits for home entertainment and wireless audio market in the United States, Europe, and the Asia Pacific. It offers TX modules for integration into televisions, audio-visual receivers, media hubs, and USB or HDMI dongles; and speaker systems. The company sells its products directly to original equipment manufacturers. The company was formerly known as Summit Semiconductor, Inc. and changed its name to Summit Wireless Technologies, Inc. in September 2018. Summit Semiconductor, Inc. was incorporated in 2010 and is headquartered in San Jose, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "San Jose"
    },
    "X1LN34.SA": {
        "short_name": "XILINX INC  DRN",
        "long_name": "Xilinx, Inc.",
        "summary": "Xilinx, Inc. designs and develops programmable devices and associated technologies worldwide. The company offers integrated circuits (ICs) in the form of programmable logic devices (PLDs), such as programmable system on chips, and three dimensional ICs; adaptive compute acceleration platform; software design tools to program the PLDs; software development environments and embedded platforms; targeted reference designs; printed circuit boards; and intellectual property (IP) core licenses covering Ethernet, memory controllers, Interlaken, and peripheral component interconnect express interfaces, as well as domain-specific IP in the areas of embedded, digital signal processing and connectivity, and market-specific IP cores. It also offers development boards; development kits, including hardware, design tools, IP, and reference designs that are designed to streamline and accelerate the development of domain-specific and market-specific applications; and configuration products comprising one-time programmable and in-system programmable storage devices to configure field programmable gate arrays. In addition, it provides design, customer training, field engineering, and technical support services. The company offers its products to electronic equipment manufacturers in sub- markets, such as data center, wireless, wireline, aerospace and defense, test and measurement, industrial, scientific and medical, automotive, audio, video and broadcast, and consumer. It sells its products through a network of independent distributors; and through direct sales to original equipment manufacturers and electronic manufacturing service providers, as well as independent sales representatives. The company has a collaboration with Kameleon Security to develop cybersecurity solution for servers, cloud computing, and data centers. Xilinx, Inc. was founded in 1984 and is headquartered in San Jose, California.",
        "currency": "BRL",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "San Jose"
    },
    "XIX.F": {
        "short_name": "XILINX INC.  DL-,01",
        "long_name": "Xilinx, Inc.",
        "summary": "Xilinx, Inc. designs and develops programmable devices and associated technologies worldwide. The company offers integrated circuits (ICs) in the form of programmable logic devices (PLDs), such as programmable system on chips, and three dimensional ICs; adaptive compute acceleration platform; software design tools to program the PLDs; software development environments and embedded platforms; targeted reference designs; printed circuit boards; and intellectual property (IP) core licenses covering Ethernet, memory controllers, Interlaken, and peripheral component interconnect express interfaces, as well as domain-specific IP in the areas of embedded, digital signal processing and connectivity, and market-specific IP cores. It also offers development boards; development kits, including hardware, design tools, IP, and reference designs that are designed to streamline and accelerate the development of domain-specific and market-specific applications; and configuration products comprising one-time programmable and in-system programmable storage devices to configure field programmable gate arrays. In addition, it provides design, customer training, field engineering, and technical support services. The company offers its products to electronic equipment manufacturers in sub- markets, such as data center, wireless, wireline, aerospace and defense, test and measurement, industrial, scientific and medical, automotive, audio, video and broadcast, and consumer. It sells its products through a network of independent distributors; and through direct sales to original equipment manufacturers and electronic manufacturing service providers, as well as independent sales representatives. The company has a collaboration with Kameleon Security to develop cybersecurity solution for servers, cloud computing, and data centers. Xilinx, Inc. was founded in 1984 and is headquartered in San Jose, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "San Jose"
    },
    "XLNX.MX": {
        "short_name": "XILINX INC",
        "long_name": "Xilinx, Inc.",
        "summary": "Xilinx, Inc. designs and develops programmable devices and associated technologies worldwide. The company offers integrated circuits (ICs) in the form of programmable logic devices (PLDs), such as programmable system on chips, and three dimensional ICs; adaptive compute acceleration platform; software design tools to program the PLDs; software development environments and embedded platforms; targeted reference designs; printed circuit boards; and intellectual property (IP) core licenses covering Ethernet, memory controllers, Interlaken, and peripheral component interconnect express interfaces, as well as domain-specific IP in the areas of embedded, digital signal processing and connectivity, and market-specific IP cores. It also offers development boards; development kits, including hardware, design tools, IP, and reference designs that are designed to streamline and accelerate the development of domain-specific and market-specific applications; and configuration products comprising one-time programmable and in-system programmable storage devices to configure field programmable gate arrays. In addition, it provides design, customer training, field engineering, and technical support services. The company offers its products to electronic equipment manufacturers in sub- markets, such as data center, wireless, wireline, aerospace and defense, test and measurement, industrial, scientific and medical, automotive, audio, video and broadcast, and consumer. It sells its products through a network of independent distributors; and through direct sales to original equipment manufacturers and electronic manufacturing service providers, as well as independent sales representatives. The company has a collaboration with Kameleon Security to develop cybersecurity solution for servers, cloud computing, and data centers. Xilinx, Inc. was founded in 1984 and is headquartered in San Jose, California.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "San Jose"
    },
    "XLNX": {
        "short_name": "Xilinx, Inc.",
        "long_name": "Xilinx, Inc.",
        "summary": "Xilinx, Inc. designs and develops programmable devices and associated technologies worldwide. The company offers integrated circuits (ICs) in the form of programmable logic devices (PLDs), such as programmable system on chips, and three dimensional ICs; adaptive compute acceleration platform; software design tools to program the PLDs; software development environments and embedded platforms; targeted reference designs; printed circuit boards; and intellectual property (IP) core licenses covering Ethernet, memory controllers, Interlaken, and peripheral component interconnect express interfaces, as well as domain-specific IP in the areas of embedded, digital signal processing and connectivity, and market-specific IP cores. It also offers development boards; development kits, including hardware, design tools, IP, and reference designs that are designed to streamline and accelerate the development of domain-specific and market-specific applications; and configuration products comprising one-time programmable and in-system programmable storage devices to configure field programmable gate arrays. In addition, it provides design, customer training, field engineering, and technical support services. The company offers its products to electronic equipment manufacturers in sub- markets, such as data center, wireless, wireline, aerospace and defense, test and measurement, industrial, scientific and medical, automotive, audio, video and broadcast, and consumer. It sells its products through a network of independent distributors; and through direct sales to original equipment manufacturers and electronic manufacturing service providers, as well as independent sales representatives. The company has a collaboration with Kameleon Security to develop cybersecurity solution for servers, cloud computing, and data centers. Xilinx, Inc. was founded in 1984 and is headquartered in San Jose, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "San Jose"
    },
    "XLNX.VI": {
        "short_name": "XILINX INC",
        "long_name": "Xilinx, Inc.",
        "summary": "Xilinx, Inc. designs and develops programmable devices and associated technologies worldwide. The company offers integrated circuits (ICs) in the form of programmable logic devices (PLDs), such as programmable system on chips, and three dimensional ICs; adaptive compute acceleration platform; software design tools to program the PLDs; software development environments and embedded platforms; targeted reference designs; printed circuit boards; and intellectual property (IP) core licenses covering Ethernet, memory controllers, Interlaken, and peripheral component interconnect express interfaces, as well as domain-specific IP in the areas of embedded, digital signal processing and connectivity, and market-specific IP cores. It also offers development boards; development kits, including hardware, design tools, IP, and reference designs that are designed to streamline and accelerate the development of domain-specific and market-specific applications; and configuration products comprising one-time programmable and in-system programmable storage devices to configure field programmable gate arrays. In addition, it provides design, customer training, field engineering, and technical support services. The company offers its products to electronic equipment manufacturers in sub- markets, such as data center, wireless, wireline, aerospace and defense, test and measurement, industrial, scientific and medical, automotive, audio, video and broadcast, and consumer. It sells its products through a network of independent distributors; and through direct sales to original equipment manufacturers and electronic manufacturing service providers, as well as independent sales representatives. The company has a collaboration with Kameleon Security to develop cybersecurity solution for servers, cloud computing, and data centers. Xilinx, Inc. was founded in 1984 and is headquartered in San Jose, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "San Jose"
    },
    "XS4.DE": {
        "short_name": "ON SEMICOND.  DL-,01",
        "long_name": "ON Semiconductor Corporation",
        "summary": "ON Semiconductor Corporation, together with its subsidiaries, manufactures and sells semiconductor components for various electronic devices worldwide. The company operates in three segments: Power Solutions Group (PSG), Advanced Solutions Group (ASG), and Intelligent Sensing Group (ISG). The PSG segment offers analog, discrete, module, and integrated semiconductor products for various applications, such as power switching, power conversion, signal conditioning, circuit protection, signal amplification, and voltage regulation functions. The ASG segment designs and develops analog, mixed-signal, logic, ASSPs and ASICs, Wi-Fi, and power solutions. It also provides trusted foundry and design services for government customers; and manufacturing services. The ISG segment offers complementary metal oxide semiconductors image sensors; proximity sensors; image signal processors; single photon detectors, including SiPM and SPAD arrays; radars; and actuator drivers for autofocus and image stabilization for a range of customers in automotive, industrial, medical, aerospace/defense, communications, networking, wireless, consumer, and computing markets. The company serves original equipment manufacturers, distributors, and electronic manufacturing service providers. ON Semiconductor Corporation was incorporated in 1992 and is headquartered in Phoenix, Arizona.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Phoenix"
    },
    "XS4.F": {
        "short_name": "ON SEMICOND.  DL-,01",
        "long_name": "ON Semiconductor Corporation",
        "summary": "ON Semiconductor Corporation, together with its subsidiaries, manufactures and sells semiconductor components for various electronic devices worldwide. The company operates in three segments: Power Solutions Group (PSG), Advanced Solutions Group (ASG), and Intelligent Sensing Group (ISG). The PSG segment offers analog, discrete, module, and integrated semiconductor products for various applications, such as power switching, power conversion, signal conditioning, circuit protection, signal amplification, and voltage regulation functions. The ASG segment designs and develops analog, mixed-signal, logic, ASSPs and ASICs, Wi-Fi, and power solutions. It also provides trusted foundry and design services for government customers; and manufacturing services. The ISG segment offers complementary metal oxide semiconductors image sensors; proximity sensors; image signal processors; single photon detectors, including SiPM and SPAD arrays; radars; and actuator drivers for autofocus and image stabilization for a range of customers in automotive, industrial, medical, aerospace/defense, communications, networking, wireless, consumer, and computing markets. The company serves original equipment manufacturers, distributors, and electronic manufacturing service providers. ON Semiconductor Corporation was incorporated in 1992 and is headquartered in Phoenix, Arizona.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Phoenix"
    }
}