{
    "44C1.F": {
        "short_name": "CIVEO CORP.  DL -,01",
        "long_name": "Civeo Corporation",
        "summary": "Civeo Corporation provides hospitality services to the natural resource industry in Canada, Australia, and the United States. The company develops lodges and villages; and mobile accommodations, including modular, skid-mounted accommodation, and central facilities that provide long-term and temporary work force accommodations. It also offers food, housekeeping, and maintenance services, as well as laundry, facility management and maintenance, water and wastewater treatment, power generation, communication systems, security, and logistics services; and camp management services. In addition, the company provides development activities for workforce accommodation facilities, including site selection, permitting, engineering and design, manufacturing management, and site construction services, as well as catering and managed services. It owns and operates 28 lodges and villages with approximately 30,000 rooms; and a fleet of mobile accommodation assets. The company serves oil, mining, engineering, and oilfield and mining service companies. Civeo Corporation is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://civeo.com",
        "market_cap": "Micro Cap"
    },
    "7BV.F": {
        "short_name": "BRIGHTVIEW HLDGS  DL-,01",
        "long_name": "BrightView Holdings, Inc.",
        "summary": "BrightView Holdings, Inc., through its subsidiaries, provides commercial landscaping services in the United States. It operates through two segments, Maintenance Services and Development Services. The Maintenance Services segment delivers a suite of recurring commercial landscaping services, including mowing, gardening, mulching and snow removal, water management, irrigation maintenance, tree care, golf course maintenance, and specialty turf maintenance. Its customers' properties include corporate and commercial properties, homeowners associations, public parks, hotels and resorts, hospitals and other healthcare facilities, educational institutions, restaurants and retail, and golf courses. This segment's customer base includes approximately 13,000 office parks and corporate campuses, 8,000 residential communities, and 450 educational institutions. The Development Services segment offers landscape architecture and development services for new facilities and redesign projects. Its services include project design and management services, landscape architecture and installation, irrigation installation, tree moving and installation, pool and water features, sports field, and other services. BrightView Holdings, Inc. also operates as official field consultant to various league baseball. The company was founded in 1939 and is headquartered in Blue Bell, Pennsylvania.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "Blue Bell",
        "zipcode": "19422",
        "website": "http://www.brightview.com",
        "market_cap": "Small Cap"
    },
    "AB4.F": {
        "short_name": "ABM INDS INC.  DL-,01",
        "long_name": "ABM Industries Incorporated",
        "summary": "ABM Industries Incorporated provides integrated facility solutions in the United States and internationally. The company operates through Business & Industry, Technology & Manufacturing, Education, Aviation, and Technical Solutions segments. It provides janitorial, facilities engineering, parking, custodial, landscaping and ground, and mechanical and electrical services; and vehicle maintenance and other services to rental car providers. The company was founded in 1909 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10006",
        "website": "http://www.abm.com",
        "market_cap": "Mid Cap"
    },
    "ABM": {
        "short_name": "ABM Industries Incorporated",
        "long_name": "ABM Industries Incorporated",
        "summary": "ABM Industries Incorporated provides integrated facility solutions in the United States and internationally. The company operates through Business & Industry, Technology & Manufacturing, Education, Aviation, and Technical Solutions segments. It provides janitorial, facilities engineering, parking, custodial, landscaping and ground, and mechanical and electrical services; and vehicle maintenance and other services to rental car providers. The company was founded in 1909 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10006",
        "website": "http://www.abm.com",
        "market_cap": "Mid Cap"
    },
    "ACTG": {
        "short_name": "Acacia Research Corporation",
        "long_name": "Acacia Research Corporation",
        "summary": "Acacia Research Corporation, together with its subsidiaries, intends to acquire undervalued businesses primarily in technology, life sciences, industrial, and financial services segments in the United States. The company also invests in intellectual property and related absolute return assets, as well as engages in the licensing and enforcement of patented technologies. Acacia Research Corporation was incorporated in 1993 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10017",
        "website": "http://www.acaciaresearch.com",
        "market_cap": "Micro Cap"
    },
    "AGFY": {
        "short_name": "Agrify Corporation",
        "long_name": "Agrify Corporation",
        "summary": "Agrify Corporation develops precision hardware and software grow solutions for the indoor agriculture marketplace primarily in the United States. It offers vertical farming units, integrated grow racks, and LED grow lights; and non-proprietary products designed, engineered, and manufactured by third parties, such as air cleaning systems and pesticide-free surface protection products. The company also provides associated services comprising consulting, engineering, and construction. The company was formerly known as Agrinamics, Inc. and changed its name to Agrify Corporation in September 2019. Agrify Corporation was incorporated in 2016 and is based in Burlington, Massachusetts.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "MA",
        "city": "Burlington",
        "zipcode": "01803",
        "website": "http://www.agrify.com",
        "market_cap": "Micro Cap"
    },
    "ALJJ": {
        "short_name": "ALJ Regional Holdings, Inc.",
        "long_name": "ALJ Regional Holdings, Inc.",
        "summary": "ALJ Regional Holdings, Inc. provides call center, back-office, staffing, and toll collection services to government and commercial clients in the healthcare, utility, consumer goods, toll, and transportation industries in the United States. It operates through three segments: Faneuil, Carpets, and Phoenix. The Faneuil segment offers customer contact centers, fulfillment operations, and information technology services, as well as manual and electronic toll collection, violation processing, and medical device tracking services. This segment also provides customer relationship management; billing, payment, and claims processing; data entry; document management; operational expertise; workforce and support analytics; quality assurance; and system support and maintenance services. The Carpets segment engages in the retail of floor coverings, including carpets, hardwood, laminates, tiles, ceramic, porcelain, natural stone, vinyl planks and tiles, and area rugs, as well as specialty flooring comprising bamboo, leather, cork, and large format tiles to home builders, and commercial and retail customers. This segment also offers countertop and surrounds, such as granite, solid surface, quartz, and piedrafina primarily for bathrooms and kitchens; kitchen, bathroom, and garage cabinets; closet and closet organizers; and window coverings comprising blinds, shutters, and shades, as well as stone and solid surface fabrication services. The Phoenix segment manufactures book components; educational materials and related products; heavily illustrated books; and specialty commercial products. This segment also provides label, printing, and packaging solutions for the beauty, fragrance, and cosmetic and consumer-packaged goods markets. The company was formerly known as YouthStream Media Networks, Inc. and changed its name to ALJ Regional Holdings, Inc. in October 2006. ALJ Regional Holdings, Inc. was founded in 1995 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10016",
        "website": "http://www.aljregionalholdings.com",
        "market_cap": "Micro Cap"
    },
    "ALSI": {
        "short_name": "ATLAS RESOURCES INTERNATIONAL I",
        "long_name": "Atlas Resources International, Inc.",
        "summary": "Atlas Resources International, Inc. did not have any significant operations, as of June 30, 2003. The company, through its subsidiary, GlobeFruits, Inc., intends to ship frozen concentrate orange juice directly to China. Atlas Resources International Inc. was founded in 1994 and is based in Palm City, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Palm City",
        "zipcode": "34991",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "ANMP": {
        "short_name": "ANACOMP INC",
        "long_name": "Anacomp, Inc.",
        "summary": "Anacomp, Inc. operates as a document and records management company that offers business process and strategic consulting solutions to federal agencies and commercial customers. It offers WorkSmart, an assessment and consulting engagement tool that develops and implements actionable plans for agency compliance with M-12-18; records information and data governance solutions; official records digitization solutions; and automated document classification and data extraction solutions. The company's Big Documents solutions offers the ability to unlock the data across current and archived records and document sets. It offers solutions for government, mortgage service, human resources, healthcare, and accounts payable sectors worldwide. The company was founded in 1968 and is headquartered in Chantilly, Virginia with regional offices in the United States.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Chantilly",
        "zipcode": "20151",
        "website": "http://www.anacomp.com",
        "market_cap": "Nano Cap"
    },
    "APRO": {
        "short_name": "ALLEGIANT PROF BUS SVCS INC",
        "long_name": "Allegiant Professional Business Services, Inc.",
        "summary": "Allegiant Professional Business Services, Inc. provides temporary staffing and professional employer organization services in the United States. The company offers human resource management tools and related financial service, including payroll and payroll taxes, employee benefits, workers' compensation coverage, workplace safety programs, compliance with federal and state employment laws, labor and workplace regulatory, and related administrative services. The company was formerly known as FocusViews, Inc. and changed its name to Allegiant Professional Business Services, Inc. in December 2007. Allegiant Professional Business Services, Inc. was incorporated in 2006 and is headquartered in Marlton, New Jersey.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Marlton",
        "zipcode": "08053",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "ARC": {
        "short_name": "ARC Document Solutions, Inc.",
        "long_name": "ARC Document Solutions, Inc.",
        "summary": "ARC Document Solutions, Inc., a reprographics company, provides document solutions. It offers managed print services, an onsite service that places, manages, and optimizes print and imaging equipment in customers' offices, job sites, and other facilities; construction document and information management services, which consists of professional services to manage and distribute documents and information primarily related to construction projects and related project-based businesses; and archive and information management services, such as software and professional services to facilitate the capture, management, access, and retrieval of documents and information. The company also resells printing, imaging, and related equipment primarily to architectural, engineering, and construction firms, as well as provides ancillary services, such as equipment service and maintenance; and offers specialized color printing comprising color printing, finishing and assembly of graphic materials for regional and national retailers, franchises, marketing departments, theme parks, and cultural institutions. In addition, it develops and offers Web-based document management applications, such as SKYSITE, Abacus, and ARC Print that facilitates project collaboration, manage print networks, track equipment fleets, create and maintain project document archives, and other document and content management tasks. Further, the company operates 148 offsite service centers that provides its customers with project-related printing of construction documents. It serves senior management teams, IT and procurement departments, project architects, engineers, general contractors, facilities managers, and marketing managers, as well as retail, technology, educational, hospitality, and public utilities. The company was formerly known as American Reprographics Company and changed its name to ARC Document Solutions, Inc. in 2012. The company was founded in 1960 is headquartered in San Ramon, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Ramon",
        "zipcode": "94583",
        "website": "http://www.e-arc.com",
        "market_cap": "Micro Cap"
    },
    "AWAW": {
        "short_name": "WHITE FOX VENTURES INC",
        "long_name": "White Fox Ventures, Inc.",
        "summary": "White Fox Ventures, Inc. focuses on designing, marketing, and distributing electronic cigarettes worldwide. It also intends to offer vaporizers, liquid nicotine, and related accessories. The company focuses on distributing its products through wholesale and retail distribution channels, including convenience stores, retail chains, wholesale trade, pharmacies, gas stations, hotels, industrial consumers, clubs, casinos, and duty free stores; and breathecig.com Website and other online sales platforms. White Fox Ventures, Inc. is based in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10016",
        "website": "http://www.breathecig.com",
        "market_cap": "Nano Cap"
    },
    "AWWC": {
        "short_name": "ACCESS WORLDWIDE COMMUNICATIONS",
        "long_name": "Access Worldwide Communications, Inc.",
        "summary": "Access Worldwide Communications, Inc. provides business process outsourcing and marketing solutions. The company offers a range of sales, backoffice, IT, and communication services. It provides inbound/outbound teleservices that include customer service, technical support, sales acquisition and processing, third party verification, dealer locators, coupons/product samples, product recalls, customer acquisition, customer retention, product awareness, win-back campaigns, market research/surveys, lead generation, membership drives, and preferred customer offers. The company also offers B-to-B services, such as customer care, customer acquisition, customer retention, win-back campaigns, and market research services; and agent recruiting/training services. It serves telecommunications providers, insurance companies, financial institutions, and consumer products companies; and credit card, retail/catalog, entertainment, healthcare, public utilities, and media/publishing markets worldwide. The company was formerly known as CulturalAccessWorldwide, Inc. and changed its name to Access Worldwide Communications, Inc. in November 1998. Access Worldwide Communications, Inc. was founded in 1983 and is headquartered in Boca Raton, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Boca Raton",
        "zipcode": "33431",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "AZG2.F": {
        "short_name": "ACACIA RESEARCH CORP.",
        "long_name": "Acacia Research Corporation",
        "summary": "Acacia Research Corporation, together with its subsidiaries, intends to acquire undervalued businesses primarily in technology, life sciences, industrial, and financial services segments in the United States. The company also invests in intellectual property and related absolute return assets, as well as engages in the licensing and enforcement of patented technologies. Acacia Research Corporation was incorporated in 1993 and is based in New York, New York.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10017",
        "website": "http://www.acaciaresearch.com",
        "market_cap": "Micro Cap"
    },
    "AZIL": {
        "short_name": "AZIEL CORPORATION",
        "long_name": "Aziel Corporation",
        "summary": "US Tungsten Corp., an exploration stage company, focuses on the acquisition and exploration of mineral properties in the United States. It holds an option to acquire 3 unpatented mineral claims and own a 100% interest in 195 mineral claims located in Calvert, Montana. The company was formerly known as Stealth Resources Inc. and changed its name in August 2012 to US Tungsten Corp. to reflect its business direction. US Tungsten Corp. was founded in 2007 and is based in Henderson, Nevada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Henderson",
        "zipcode": "89052",
        "website": "http://www.azielcorporation.com",
        "market_cap": "Nano Cap"
    },
    "BK1.F": {
        "short_name": "ARC DOCUMENT SOL. DL-,001",
        "long_name": "ARC Document Solutions, Inc.",
        "summary": "ARC Document Solutions, Inc., a reprographics company, provides document solutions. It offers managed print services, an onsite service that places, manages, and optimizes print and imaging equipment in customers' offices, job sites, and other facilities; construction document and information management services, which consists of professional services to manage and distribute documents and information primarily related to construction projects and related project-based businesses; and archive and information management services, such as software and professional services to facilitate the capture, management, access, and retrieval of documents and information. The company also resells printing, imaging, and related equipment primarily to architectural, engineering, and construction firms, as well as provides ancillary services, such as equipment service and maintenance; and offers specialized color printing comprising color printing, finishing and assembly of graphic materials for regional and national retailers, franchises, marketing departments, theme parks, and cultural institutions. In addition, it develops and offers Web-based document management applications, such as SKYSITE, Abacus, and ARC Print that facilitates project collaboration, manage print networks, track equipment fleets, create and maintain project document archives, and other document and content management tasks. Further, the company operates 148 offsite service centers that provides its customers with project-related printing of construction documents. It serves senior management teams, IT and procurement departments, project architects, engineers, general contractors, facilities managers, and marketing managers, as well as retail, technology, educational, hospitality, and public utilities. The company was formerly known as American Reprographics Company and changed its name to ARC Document Solutions, Inc. in 2012. The company was founded in 1960 is headquartered in San Ramon, California.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "San Ramon",
        "zipcode": "94583",
        "website": "http://www.e-arc.com",
        "market_cap": "Micro Cap"
    },
    "BRMT": {
        "short_name": "BARE METAL STANDARD INC",
        "long_name": "Bare Metal Standard, Inc.",
        "summary": "Bare Metal Standard, Inc. engages in the finding and developing of distressed real estate properties in eastern and central Europe. The company is based in Boise, Idaho.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "ID",
        "city": "Boise",
        "zipcode": "83709",
        "website": "http://www.as-capital.com",
        "market_cap": "Nano Cap"
    },
    "BRYN": {
        "short_name": "BRYN RESOURCES INC",
        "long_name": "Bryn Resources Inc.",
        "summary": "BRYN Resources Inc. provides corporate, capital, and communication services for small businesses worldwide. The company operates VybeOffice, an online tool that allows you to manage company online from a single portal. It also offers stock issuance, transfer, custodial, and registrar services. The company was incorporated in 1995 and is based in Niagara Falls, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Niagara Falls",
        "zipcode": "14301",
        "website": "http://www.brynresources.com",
        "market_cap": "Nano Cap"
    },
    "BSGC": {
        "short_name": "BIGSTRING CORPORATION",
        "long_name": "BigString Corporation",
        "summary": "BigString Corporation, through its subsidiary, develops development of email related software solutions. The company provides a web-based and POP3/IMAP server email service solution that allows the user to edit, recall, cancel, and erase the email, as well as insert or delete attachments, even after the email has been sent out and opened. It also offers email and email hosting packages, as well as streaming audio and video technologies into messaging, email, and social network applications. BigString Corporation serves the Internet users who utilize Internet as their source for email and messaging services. The company was formerly known as Recall Mail Corporation and changed its name to BigString Corporation in July 2005. BigString Corporation was incorporated in 2003 and is based in Red Bank, New Jersey.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Red Bank",
        "zipcode": "07701",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "BV": {
        "short_name": "BrightView Holdings, Inc.",
        "long_name": "BrightView Holdings, Inc.",
        "summary": "BrightView Holdings, Inc., through its subsidiaries, provides commercial landscaping services in the United States. It operates through two segments, Maintenance Services and Development Services. The Maintenance Services segment delivers a suite of recurring commercial landscaping services, including mowing, gardening, mulching and snow removal, water management, irrigation maintenance, tree care, golf course maintenance, and specialty turf maintenance. Its customers' properties include corporate and commercial properties, homeowners associations, public parks, hotels and resorts, hospitals and other healthcare facilities, educational institutions, restaurants and retail, and golf courses. This segment's customer base includes approximately 13,000 office parks and corporate campuses, 8,000 residential communities, and 450 educational institutions. The Development Services segment offers landscape architecture and development services for new facilities and redesign projects. Its services include project design and management services, landscape architecture and installation, irrigation installation, tree moving and installation, pool and water features, sports field, and other services. BrightView Holdings, Inc. also operates as official field consultant to various league baseball. The company was founded in 1939 and is headquartered in Blue Bell, Pennsylvania.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Blue Bell",
        "zipcode": "19422",
        "website": "http://www.brightview.com",
        "market_cap": "Small Cap"
    },
    "BWVI": {
        "short_name": "BLUE WATER VENTURES INTL INC",
        "long_name": "Blue Water Ventures International, Inc.",
        "summary": "Blue Water Ventures International, Inc. conducts archaeologically sensitive recoveries of cargo and artifacts/treasures from various shipwrecks on the basis of research and diligence specific to various projects. It focuses on shallow water search and recovery projects. The company also targets merchant ships within and outside the United States territorial waters. Blue Water Ventures International, Inc. was formerly known as Blue Water Ventures of Key West, Inc. and changed its name to Blue Water Ventures International, Inc. in July 2012. Blue Water Ventures International, Inc. was incorporated in 2006 and is based in Green Cove Springs, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Green Cove Springs",
        "zipcode": "32043",
        "website": "http://www.bwvint.com",
        "market_cap": "Nano Cap"
    },
    "C1PR34.SA": {
        "short_name": "COPART INC  DRN",
        "long_name": "Copart, Inc.",
        "summary": "Copart, Inc. provides online auctions and vehicle remarketing services in the United States, Canada, the United Kingdom, Brazil, the Republic of Ireland, Germany, Finland, the United Arab Emirates, Oman, Bahrain, and Spain. It offers a range of services for processing and selling vehicles over the internet through its virtual bidding third generation internet auction-style sales technology to vehicle sellers, insurance companies, banks and finance companies, charities, and fleet operators and dealers, as well as individuals. The company's services include online seller access, salvage estimation, estimating, end-of-life vehicle processing, virtual insured exchange, transportation, vehicle inspection stations, on-demand reporting, title processing and procurement, loan payoff, flexible vehicle processing programs, buy it now, member network, sales process, and dealer services. Its services also comprise services to sell vehicles through CashForCars.com; U-Pull-It service that allows buyer to remove valuable parts and sell the remaining parts and car body; copart 360, an online technology for posting vehicle images; membership tiers for those registering to buy vehicles through Copart.com; and virtual queue to secure a place in line while visiting one of its locations. The company sells its products principally to licensed vehicle dismantlers, rebuilders, repair licensees, used vehicle dealers, and exporters, as well as to the general public. Copart, Inc. has a strategic partnership with CHAMPtitles, LLC to introduce an automated digital platform for car sellers, including insurance companies for mail-oriented vehicle title processing. The company was founded in 1982 and is headquartered in Dallas, Texas.",
        "currency": "BRL",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75254",
        "website": "http://www.copart.com",
        "market_cap": "Large Cap"
    },
    "C1TA34.SA": {
        "short_name": "CINTAS CORP DRN",
        "long_name": "Cintas Corporation",
        "summary": "Cintas Corporation provides corporate identity uniforms and related business services primarily in North America, Latin America, Europe, and Asia. It operates through Uniform Rental and Facility Services and First Aid and Safety Services segments. The company rents and services uniforms and other garments, including flame resistant clothing, mats, mops and shop towels, and other ancillary items; and provides restroom cleaning services and supplies, and carpet and tile cleaning services, as well as sells uniforms. It also offers first aid and safety services, and fire protection products and services. The company provides its products and services through its distribution network and local delivery routes, or local representatives to small service and manufacturing companies, as well as major corporations. Cintas Corporation was founded in 1968 and is headquartered in Cincinnati, Ohio.",
        "currency": "BRL",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "OH",
        "city": "Cincinnati",
        "zipcode": "45262",
        "website": "http://www.cintas.com",
        "market_cap": "Large Cap"
    },
    "CASS": {
        "short_name": "Cass Information Systems, Inc",
        "long_name": "Cass Information Systems, Inc.",
        "summary": "Cass Information Systems, Inc. provides payment and information processing services to manufacturing, distribution, and retail enterprises in the United States. It operates through two segments, Information Services and Banking Services. The company's services include freight invoice rating, payment processing, auditing, and the generation of accounting and transportation information. It also processes and pays facility-related invoices, such as electricity, gas, waste, and telecommunications expenses; and provides telecommunications expense management solutions. In addition, the company, through its banking subsidiary, Cass Commercial Bank, provides a range of banking products and services, such as checking, savings, and time deposit accounts; commercial, industrial, and real estate loans; and cash management services to privately-owned businesses and faith-related ministries. Further, it provides B2B payment platform for clients that require an agile fintech partner. It operates through its banking facility near downtown St. Louis, Missouri; operating branch in the Bridgeton, Missouri; and additional leased facilities in Fenton, Missouri and Colorado Springs, Colorado. The company was formerly known as Cass Commercial Corporation and changed its name to Cass Information Systems, Inc. in January 2001. Cass Information Systems, Inc. was founded in 1906 and is headquartered in St. Louis, Missouri.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "MO",
        "city": "Saint Louis",
        "zipcode": "63131",
        "website": "http://www.cassinfo.com",
        "market_cap": "Small Cap"
    },
    "CBMJ": {
        "short_name": "CONSERVATIVE BRODAST MEDIA & JO",
        "long_name": "Conservative Broadcast Media & Journalism Inc.",
        "summary": "Canna Consumer Goods, Inc., doing business as Canna Broadcast Media, operates as a cannabis broadcasting company. The company provides access to mainstream media, branding, consulting, and facilities management solutions to licensed processors and marketers of cannabis infused goods. It offers LoudMouth News, a syndicated terrestrial radio program that focuses on the news relating to the marijuana industry. The company is based in West Palm Beach, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Powder Springs",
        "zipcode": "30127",
        "website": "http://www.cannabroadcastmedia.com",
        "market_cap": "Nano Cap"
    },
    "CBZ": {
        "short_name": "CBIZ, Inc.",
        "long_name": "CBIZ, Inc.",
        "summary": "CBIZ, Inc. provides financial, insurance, and advisory services in the United States and Canada. The company operates through three segments: Financial Services, Benefits and Insurance Services, and National Practices. The Financial Services segment offers accounting and tax, government healthcare consulting, financial advisory, valuation, and risk and advisory services. The Benefits and Insurance Services provides group health benefits consulting, payroll, property and casualty, and retirement plan services. The National Practices segment offers managed networking and hardware, and health care consulting services. It primarily serves small and medium-sized businesses, as well as individuals, governmental entities, and not-for-profit enterprises. The company was founded in 1987 and is headquartered in Cleveland, Ohio.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Cleveland",
        "zipcode": "44131",
        "website": "http://www.cbiz.com",
        "market_cap": "Small Cap"
    },
    "CC3.F": {
        "short_name": "CASS INFORM.  DL-,50",
        "long_name": "Cass Information Systems, Inc.",
        "summary": "Cass Information Systems, Inc. provides payment and information processing services to manufacturing, distribution, and retail enterprises in the United States. It operates through two segments, Information Services and Banking Services. The company's services include freight invoice rating, payment processing, auditing, and the generation of accounting and transportation information. It also processes and pays facility-related invoices, such as electricity, gas, waste, and telecommunications expenses; and provides telecommunications expense management solutions. In addition, the company, through its banking subsidiary, Cass Commercial Bank, provides a range of banking products and services, such as checking, savings, and time deposit accounts; commercial, industrial, and real estate loans; and cash management services to privately-owned businesses and faith-related ministries. Further, it provides B2B payment platform for clients that require an agile fintech partner. It operates through its banking facility near downtown St. Louis, Missouri; operating branch in the Bridgeton, Missouri; and additional leased facilities in Fenton, Missouri and Colorado Springs, Colorado. The company was formerly known as Cass Commercial Corporation and changed its name to Cass Information Systems, Inc. in January 2001. Cass Information Systems, Inc. was founded in 1906 and is headquartered in St. Louis, Missouri.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MO",
        "city": "Saint Louis",
        "zipcode": "63131",
        "website": "http://www.cassinfo.com",
        "market_cap": "Small Cap"
    },
    "CERGF": {
        "short_name": "CERES GLOBAL AG CORP",
        "long_name": "Ceres Global Ag Corp.",
        "summary": "Ceres Global Ag Corp. procures and provides agricultural commodities and value-added products, industrial products, fertilizers, energy products, and supply chain logistics services worldwide. The company operates through three segments: Grain, Supply Chain Services, and Seed and Processing. It engages in the procurement, storage, handling, trading, and merchandising of commodity and specialty grains and oilseeds, such as oats, barley, rye, hard red spring wheat, durum wheat, canola, and pulses through twelve grain storage and handling facilities in Minnesota, Manitoba, Saskatchewan, and Ontario. The company also provides logistics, storage, and transloading services for commodities and industrial products. In addition, it is involved in the soybean crush, specialty crops blending, birdfeed production, and seed distribution businesses. The company was incorporated in 2007 and is headquartered in Golden Valley, Minnesota.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MN",
        "city": "Golden Valley",
        "zipcode": "55416",
        "website": "http://ceresglobalagcorp.com",
        "market_cap": "Micro Cap"
    },
    "CESF": {
        "short_name": "CE SOFTWARE INC",
        "long_name": "CE Software, Inc.",
        "summary": "CE Software, Inc. develops computer software products that enhance communications, connectivity, and productivity for businesses and home-based personal computer users for both Windows and Macintosh operating systems. Its products include both personal and group productivity tools. The QuicKeys products represent personal productivity. The products QuickMail, QuickConference, and InOut Tracker represent group productivity. The primary products are QuicKeys, a utility that automates time-consuming and repetitive tasks with customized hot keys or toolbars, and QuickMail, an all-in-one business e-mail solution for the Internet and for internal office use. The company's products are marketed through independent distributors in the United States, through numerous independent dealers and distributors in other countries, directly to large corporate accounts under site licensing agreements, and directly to end-users through electronic distribution and direct marketing campaigns.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "IA",
        "city": "West Des Moines",
        "zipcode": "50265",
        "website": "http://www.cesoft.com",
        "market_cap": "Nano Cap"
    },
    "CFCC": {
        "short_name": "CORFACTS INC",
        "long_name": "Corfacts, Inc.",
        "summary": "Corfacts, Inc., through its wholly owned subsidiary, Metro Marketing, Inc., provides traditional outgoing call services and customized marketing programs in the United States. It provides inbound and outbound telemarketing services to chiropractors, publishing, financial services, telecommunications, and utilities industries. The company was organized in 1983 and is headquartered in Howell, New Jersey.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Howell",
        "zipcode": "07731",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "CGRW": {
        "short_name": "CANNAGROW HOLDINGS INC",
        "long_name": "CannaGrow Holdings, Inc",
        "summary": "CannaGrow Holdings, Inc. develops, designs, and builds grow facilities for legal cannabis industry in the State of Colorado. It offers design, permitting, development and construction, site management, staffing, research, and other professional services. The company was formerly known as BizAuctions, Inc. and changed its name to CannaGrow Holdings, Inc. in November 2014. CannaGrow Holdings, Inc. is based in Greenwood Village, Colorado.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Greenwood Village",
        "zipcode": "80111",
        "website": "http://www.cannagrowholdings.com",
        "market_cap": "Nano Cap"
    },
    "CIT.F": {
        "short_name": "CINTAS CORP.",
        "long_name": "Cintas Corporation",
        "summary": "Cintas Corporation provides corporate identity uniforms and related business services primarily in North America, Latin America, Europe, and Asia. It operates through Uniform Rental and Facility Services and First Aid and Safety Services segments. The company rents and services uniforms and other garments, including flame resistant clothing, mats, mops and shop towels, and other ancillary items; and provides restroom cleaning services and supplies, and carpet and tile cleaning services, as well as sells uniforms. It also offers first aid and safety services, and fire protection products and services. The company provides its products and services through its distribution network and local delivery routes, or local representatives to small service and manufacturing companies, as well as major corporations. Cintas Corporation was founded in 1968 and is headquartered in Cincinnati, Ohio.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OH",
        "city": "Cincinnati",
        "zipcode": "45262",
        "website": "http://www.cintas.com",
        "market_cap": "Large Cap"
    },
    "CLRYF": {
        "short_name": "CLAROCITY CORPORATION",
        "long_name": "Clarocity Corporation",
        "summary": "Clarocity Corporation designs and develops real estate valuation and report products. The company develops software for residential housing appraisal research in the metropolitan areas throughout the United States, as well as a suite of realtor powered valuation products. It also provides alternative valuation and appraisal fulfillment services. The company was formerly known as Zaio Corporation and changed its name to Clarocity Corporation in October 2016. Clarocity Corporation is headquartered in Carlsbad, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Carlsbad",
        "zipcode": "92010",
        "website": "http://www.clarocityvs.com",
        "market_cap": "Nano Cap"
    },
    "CMIT": {
        "short_name": "CMARK INTERNATIONAL INC",
        "long_name": "CMARK International, Inc.",
        "summary": "CMARK International, Inc. provides various facility and logistic support services for government and commercial institutions. It offers construction and design services for envelope facility, as well as provides facility interior products support services, such as installation, design, and project management. The company also offers a product line of furnishings, and fixtures and equipment to institutions, including private label products. In addition, it provides logistic support, food and beverage, and retail products, as well as offers maintenance services. The company was formerly known as Commercial Marketing Corporation and changed its name to CMARK International, Inc. in 2005. CMARK International, Inc. was founded in 2000 and is headquartered in Columbia, South Carolina.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "SC",
        "city": "Columbia",
        "zipcode": "29223",
        "website": "http://www.cmark.org",
        "market_cap": "Nano Cap"
    },
    "CO6.F": {
        "short_name": "COPART INC.",
        "long_name": "Copart, Inc.",
        "summary": "Copart, Inc. provides online auctions and vehicle remarketing services in the United States, Canada, the United Kingdom, Brazil, the Republic of Ireland, Germany, Finland, the United Arab Emirates, Oman, Bahrain, and Spain. It offers a range of services for processing and selling vehicles over the internet through its virtual bidding third generation internet auction-style sales technology to vehicle sellers, insurance companies, banks and finance companies, charities, and fleet operators and dealers, as well as individuals. The company's services include online seller access, salvage estimation, estimating, end-of-life vehicle processing, virtual insured exchange, transportation, vehicle inspection stations, on-demand reporting, title processing and procurement, loan payoff, flexible vehicle processing programs, buy it now, member network, sales process, and dealer services. Its services also comprise services to sell vehicles through CashForCars.com; U-Pull-It service that allows buyer to remove valuable parts and sell the remaining parts and car body; copart 360, an online technology for posting vehicle images; membership tiers for those registering to buy vehicles through Copart.com; and virtual queue to secure a place in line while visiting one of its locations. The company sells its products principally to licensed vehicle dismantlers, rebuilders, repair licensees, used vehicle dealers, and exporters, as well as to the general public. Copart, Inc. has a strategic partnership with CHAMPtitles, LLC to introduce an automated digital platform for car sellers, including insurance companies for mail-oriented vehicle title processing. The company was founded in 1982 and is headquartered in Dallas, Texas.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75254",
        "website": "http://www.copart.com",
        "market_cap": "Large Cap"
    },
    "CPRT.MX": {
        "short_name": "COPART INC",
        "long_name": "Copart, Inc.",
        "summary": "Copart, Inc. provides online auctions and vehicle remarketing services in the United States, Canada, the United Kingdom, Brazil, the Republic of Ireland, Germany, Finland, the United Arab Emirates, Oman, Bahrain, and Spain. It offers a range of services for processing and selling vehicles over the internet through its virtual bidding third generation internet auction-style sales technology to vehicle sellers, insurance companies, banks and finance companies, charities, and fleet operators and dealers, as well as individuals. The company's services include online seller access, salvage estimation, estimating, end-of-life vehicle processing, virtual insured exchange, transportation, vehicle inspection stations, on-demand reporting, title processing and procurement, loan payoff, flexible vehicle processing programs, buy it now, member network, sales process, and dealer services. Its services also comprise services to sell vehicles through CashForCars.com; U-Pull-It service that allows buyer to remove valuable parts and sell the remaining parts and car body; copart 360, an online technology for posting vehicle images; membership tiers for those registering to buy vehicles through Copart.com; and virtual queue to secure a place in line while visiting one of its locations. The company sells its products principally to licensed vehicle dismantlers, rebuilders, repair licensees, used vehicle dealers, and exporters, as well as to the general public. Copart, Inc. has a strategic partnership with CHAMPtitles, LLC to introduce an automated digital platform for car sellers, including insurance companies for mail-oriented vehicle title processing. The company was founded in 1982 and is headquartered in Dallas, Texas.",
        "currency": "MXN",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75254",
        "website": "http://www.copart.com",
        "market_cap": "Large Cap"
    },
    "CPRT": {
        "short_name": "Copart, Inc.",
        "long_name": "Copart, Inc.",
        "summary": "Copart, Inc. provides online auctions and vehicle remarketing services in the United States, Canada, the United Kingdom, Brazil, the Republic of Ireland, Germany, Finland, the United Arab Emirates, Oman, Bahrain, and Spain. It offers a range of services for processing and selling vehicles over the internet through its virtual bidding third generation internet auction-style sales technology to vehicle sellers, insurance companies, banks and finance companies, charities, and fleet operators and dealers, as well as individuals. The company's services include online seller access, salvage estimation, estimating, end-of-life vehicle processing, virtual insured exchange, transportation, vehicle inspection stations, on-demand reporting, title processing and procurement, loan payoff, flexible vehicle processing programs, buy it now, member network, sales process, and dealer services. Its services also comprise services to sell vehicles through CashForCars.com; U-Pull-It service that allows buyer to remove valuable parts and sell the remaining parts and car body; copart 360, an online technology for posting vehicle images; membership tiers for those registering to buy vehicles through Copart.com; and virtual queue to secure a place in line while visiting one of its locations. The company sells its products principally to licensed vehicle dismantlers, rebuilders, repair licensees, used vehicle dealers, and exporters, as well as to the general public. Copart, Inc. has a strategic partnership with CHAMPtitles, LLC to introduce an automated digital platform for car sellers, including insurance companies for mail-oriented vehicle title processing. The company was founded in 1982 and is headquartered in Dallas, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75254",
        "website": "http://www.copart.com",
        "market_cap": "Large Cap"
    },
    "CRP.TO": {
        "short_name": "CERES GLOBAL AG CORP.",
        "long_name": "Ceres Global Ag Corp.",
        "summary": "Ceres Global Ag Corp. procures and provides agricultural commodities and value-added products, industrial products, fertilizers, energy products, and supply chain logistics services worldwide. The company operates through three segments: Grain, Supply Chain Services, and Seed and Processing. It engages in the procurement, storage, handling, trading, and merchandising of commodity and specialty grains and oilseeds, such as oats, barley, rye, hard red spring wheat, durum wheat, canola, and pulses through twelve grain storage and handling facilities in Minnesota, Manitoba, Saskatchewan, and Ontario. The company also provides logistics, storage, and transloading services for commodities and industrial products. In addition, it is involved in the soybean crush, specialty crops blending, birdfeed production, and seed distribution businesses. The company was incorporated in 2007 and is headquartered in Golden Valley, Minnesota.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "United States",
        "state": "MN",
        "city": "Golden Valley",
        "zipcode": "55416",
        "website": "http://ceresglobalagcorp.com",
        "market_cap": "Micro Cap"
    },
    "CTAS.MX": {
        "short_name": "CINTAS CORP",
        "long_name": "Cintas Corporation",
        "summary": "Cintas Corporation provides corporate identity uniforms and related business services primarily in North America, Latin America, Europe, and Asia. It operates through Uniform Rental and Facility Services and First Aid and Safety Services segments. The company rents and services uniforms and other garments, including flame resistant clothing, mats, mops and shop towels, and other ancillary items; and provides restroom cleaning services and supplies, and carpet and tile cleaning services, as well as sells uniforms. It also offers first aid and safety services, and fire protection products and services. The company provides its products and services through its distribution network and local delivery routes, or local representatives to small service and manufacturing companies, as well as major corporations. Cintas Corporation was founded in 1968 and is headquartered in Cincinnati, Ohio.",
        "currency": "MXN",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "OH",
        "city": "Cincinnati",
        "zipcode": "45262",
        "website": "http://www.cintas.com",
        "market_cap": "Large Cap"
    },
    "CTAS": {
        "short_name": "Cintas Corporation",
        "long_name": "Cintas Corporation",
        "summary": "Cintas Corporation provides corporate identity uniforms and related business services primarily in North America, Latin America, Europe, and Asia. It operates through Uniform Rental and Facility Services and First Aid and Safety Services segments. The company rents and services uniforms and other garments, including flame resistant clothing, mats, mops and shop towels, and other ancillary items; and provides restroom cleaning services and supplies, and carpet and tile cleaning services, as well as sells uniforms. It also offers first aid and safety services, and fire protection products and services. The company provides its products and services through its distribution network and local delivery routes, or local representatives to small service and manufacturing companies, as well as major corporations. Cintas Corporation was founded in 1968 and is headquartered in Cincinnati, Ohio.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Cincinnati",
        "zipcode": "45262",
        "website": "http://www.cintas.com",
        "market_cap": "Large Cap"
    },
    "CTAS.VI": {
        "short_name": "CINTAS CORP",
        "long_name": "Cintas Corporation",
        "summary": "Cintas Corporation provides corporate identity uniforms and related business services primarily in North America, Latin America, Europe, and Asia. It operates through Uniform Rental and Facility Services and First Aid and Safety Services segments. The company rents and services uniforms and other garments, including flame resistant clothing, mats, mops and shop towels, and other ancillary items; and provides restroom cleaning services and supplies, and carpet and tile cleaning services, as well as sells uniforms. It also offers first aid and safety services, and fire protection products and services. The company provides its products and services through its distribution network and local delivery routes, or local representatives to small service and manufacturing companies, as well as major corporations. Cintas Corporation was founded in 1968 and is headquartered in Cincinnati, Ohio.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "OH",
        "city": "Cincinnati",
        "zipcode": "45262",
        "website": "http://www.cintas.com",
        "market_cap": "Large Cap"
    },
    "CVCS": {
        "short_name": "CHARTER CORPORATE SVCS INC",
        "long_name": "Charter Corporate Services, Inc.",
        "summary": "Charter Corporate Services, Inc., a development stage company, provides document formatting and electronic filing services to companies and others who are required to file reports with the Securities and Exchange Commission. Charter Corporate Services, Inc. was incorporated as Montrose Funding, Inc. in 2002 and changed its name to Charter Corporate Services, Inc. in August 2008. The company is based in Glendale, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Glendale",
        "zipcode": "91206",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "CVEO": {
        "short_name": "Civeo Corporation (Canada)",
        "long_name": "Civeo Corporation",
        "summary": "Civeo Corporation provides hospitality services to the natural resource industry in Canada, Australia, and the United States. The company develops lodges and villages; and mobile accommodations, including modular, skid-mounted accommodation, and central facilities that provide long-term and temporary work force accommodations. It also offers food, housekeeping, and maintenance services, as well as laundry, facility management and maintenance, water and wastewater treatment, power generation, communication systems, security, and logistics services; and camp management services. In addition, the company provides development activities for workforce accommodation facilities, including site selection, permitting, engineering and design, manufacturing management, and site construction services, as well as catering and managed services. It owns and operates 28 lodges and villages with approximately 30,000 rooms; and a fleet of mobile accommodation assets. The company serves oil, mining, engineering, and oilfield and mining service companies. Civeo Corporation is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://civeo.com",
        "market_cap": "Micro Cap"
    },
    "CWPS": {
        "short_name": "CONWEST PARTNERSHIP PART UNITS",
        "long_name": "Conwest Associates, LP",
        "summary": "Conwest Associates, LP collects and distributes royalty payments. The company is based in Westlake Village, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Westlake Village",
        "zipcode": "91362",
        "website": null,
        "market_cap": null
    },
    "DIL1.F": {
        "short_name": "VIAD CORP. NEW  DL 1,50",
        "long_name": "Viad Corp.",
        "summary": "Viad Corp operates as an experiential services company in the United States, Canada, the United Kingdom, continental Europe, the United Arab Emirates, and Iceland. It operates through three segments: GES North America, GES EMEA, and Pursuit. The company offers event accommodation solutions, including researching and selection of local hotels, negotiating and contracting, room block management, group reservation management, rate integrity and monitoring, marketing, on-site, and post-event reporting; and registration and data analytics comprising registration and ticketing, lead management, reporting and analytics, web-based enterprise-wide application, and software-as-a-service model or partial and fully managed options. It also provides event management tools, such as online ordering capabilities, sponsorship management solutions, content management systems, and live event tracking; and audio-visual, including video production, lighting design, digital studio, entertainment and talent coordination, projection mapping, and computer rental and support services. In addition, the company offers a collection of experiences in recreational attractions, unique hotels and lodges, food and beverage, retail, sightseeing, and ground transportation services. It serves event organizers and corporate brand marketers. Viad Corp was founded in 1926 and is headquartered in Phoenix, Arizona.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85004-4565",
        "website": "http://www.viad.com",
        "market_cap": "Small Cap"
    },
    "DLHC": {
        "short_name": "DLH Holdings Corp.",
        "long_name": "DLH Holdings Corp.",
        "summary": "DLH Holdings Corp. provides healthcare and social services in the United States. It offers defense and veterans' health solutions, including case management, physical and behavioral health examinations, and medical administration and logistics services. The company also provides a range of human services and solutions, which consists of monitoring and evaluation, electronic medical records migration, data collection and management, and nutritional and social health assessments; and IT system architecture design, migration plan, and ongoing maintenance services. In addition, it offers public health and life sciences services, such as clinical trials, epidemiology studies, and disease prevention; and health promotion to underserved and hard to reach at-risk communities through development of strategic communication campaigns, research on emerging trends, health informatics analyses, and application of best practices. The company offers its services to government agencies and other government clients. The company was formerly known as TeamStaff, Inc. and changed its name to DLH Holdings Corp. in June 2012. DLH Holdings Corp. was incorporated in 1969 and is headquartered in Atlanta, Georgia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30305",
        "website": "http://www.dlhcorp.com",
        "market_cap": "Micro Cap"
    },
    "DLLN.F": {
        "short_name": "DONNELLEY NEW  DL 1,25",
        "long_name": "R. R. Donnelley & Sons Company",
        "summary": "R.R. Donnelley & Sons Company, an integrated communications provider, enables organizations to create, manage, deliver, and optimize their multichannel marketing and business communications. Its Business Services segment offers commercial printing products and branded materials, including manuals, publications, brochures, business cards, flyers, post cards, posters, and promotional items; and packaging solutions comprising rigid boxes and in-box print materials for clients in the consumer electronics, healthcare and life sciences, cosmetics, and consumer packaged goods industries. It also provides customer billings, financial statements, healthcare communications, and insurance document statement printing services; and distribution, shipping, healthcare, durable goods, promotional, and consumer product goods packaging labels. In addition, this segment offers workflow design, assembly, configuration, kitting, and fulfillment services for clients in the consumer electronics, telecommunications, life sciences, cosmetics, education, and industrial industries. Further, it provides invoices, order, and business forms that support the private and public sectors; and outsourcing services, such as creative services, research and analytics, financial management, and other services for legal providers, insurance, telecommunications, utilities, retail, and financial services companies. The company's Marketing Solutions segment offers direct marketing, such as audience segmentation, creative development, program testing, print production, postal optimization, and performance analytics for large-scale personalized direct mail programs; and in-store marketing, digital print, kitting, fulfillment, digital, and creative solutions and list services. It operates in the United States, Asia, Europe, and internationally. The company was founded in 1864 and is headquartered in Chicago, Illinois.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "IL",
        "city": "Chicago",
        "zipcode": "60601",
        "website": "http://www.rrd.com",
        "market_cap": "Small Cap"
    },
    "DSS": {
        "short_name": "Document Security Systems, Inc.",
        "long_name": "Document Security Systems, Inc.",
        "summary": "Document Security Systems, Inc. manufactures, markets, and sells packaging and security printing solutions. It operates through four segments: Direct Marketing/Online Sales Group, Premier Packaging, Digital Group, and IP Technology. The company offers printed materials, such as folding cartons and paperboard packaging, security paper, vital records, prescription paper, birth certificates, receipts, identification materials, entertainment tickets, secure coupons, and parts tracking forms; custom packaging services; and manufactures, markets, and sells mailers, photo sleeves, sophisticated custom folding cartons, and complex 3-dimensional direct mail solutions. It also provides AuthentiGuard, a brand authentication application that integrates counterfeit deterrent technologies with proprietary digital data security-based solutions; manages, licenses, and acquires intellectual property assets for monetizing these assets through investments in the development and commercialization of patented technologies, licensing, strategic partnerships, and commercial litigation. In addition, the company invests and acquires companies in the biohealth and biomedical fields; develops open-air defense initiatives, which curb transmission of air-borne infectious diseases, such as tuberculosis and influenza; develops and acquires assets and investments in the securities trading and funds management arena. Further, it operates HWHGIG and HWH Marketplace, which are direct selling platforms that offers health, wealth, and happiness products; and markets and distributes health and wellness products under the Elevate brand; and develops blockchain security technologies for tracking and tracing solutions for supply chain logistics and cyber securities. Additionally, the company engages in the development of utility-scale solar farms, and secure living solutions. Document Security Systems, Inc. was incorporated in 1984 and is headquartered in Victor, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Victor",
        "zipcode": "14564",
        "website": "http://www.dsssecure.com",
        "market_cap": "Micro Cap"
    },
    "DTSL": {
        "short_name": "DELIVERY TECHNOLOGY SOLUTIONS I",
        "long_name": "Delivery Technology Solutions, Inc.",
        "summary": "Delivery Technology Solutions, Inc. offers research, development, and marketing of proprietary software for use by the food service industry, primarily in call centers and online ordering for food catering and delivery. The company supplies call center services, and online Web ordering services for its clients, as well as display all relevant information for the agent to handle the call. It provides a turnkey delivery platform to the service industry, which is designed on a customer relationship management (CRM) system and a service integrated technology between customers, call center, and the personal industry provider of choice. The company's solution automatically routes the order electronically to the store nearest the customer's location; and in-house call center offers a suite of services, including inbound-outbound call services and tracking, call recording, and live monitoring. Its call center system is integrated with point of sale (POS) terminals on site at the client stores to provide single order real-time tracking, store delivery staff availability alerts, custom event triggers, and store communication at customer threshold times, as well as management notification through a process of escalation. The company was founded in 2010 and is based in Boca Raton, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Boca Raton",
        "zipcode": "33487",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "DYNA": {
        "short_name": "DYNASTAR HLDGS INC",
        "long_name": "Dynastar Holdings, Inc.",
        "summary": "Dynastar Holdings, Inc. focuses on acquisition of direct selling companies providing services to commercial and residential consumers in the deregulated electricity and natural gas services sector. The company was founded in 2010 and is based in Louisville, Kentucky.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "KY",
        "city": "Louisville",
        "zipcode": "40222",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "EOSC": {
        "short_name": "ELECTRO OPTICAL SYSTEMS CORP",
        "long_name": "Electro Optical Systems Corp.",
        "summary": "Electro Optical Systems Corp. engages in the design, development, testing, and production of fingerprint biometric systems that can be used to secure access to computer based information systems, as well as provide access control in a number of other applications, as of September 30, 1998.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MA",
        "city": "Maynard",
        "zipcode": "01754",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "EVSV": {
        "short_name": "ENVIRO SERV INC",
        "long_name": "Enviro-Serv, Inc.",
        "summary": "Enviro-Serv, Inc. provides property maintenance services in the United States. It offers lawn/landscape maintenance and pest control services. The company was formerly known as Transfer Technology International Corp. and changed its name to Enviro-Serv, Inc. in March 2013 to reflect its new strategic corporate direction. Enviro-Serv, Inc. is based in Tampa, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Tampa",
        "zipcode": "33637",
        "website": "http://www.enviro-serv.com",
        "market_cap": "Nano Cap"
    },
    "FIFG": {
        "short_name": "FIRST FOODS GROUP INC",
        "long_name": "First Foods Group, Inc.",
        "summary": "First Foods Group, Inc. provides funding options and management services for supplement brands and menu concepts in the United States. The company focuses on new brands and concepts, including the wholesaling of various health-related products; and developing specialty chocolate product line. It also participates in the merchant cash advances. The company was formerly known as Litera Group, Inc. and changed its name to First Foods Group, Inc. in February 2017. First Foods Group, Inc. was incorporated in 2015 and is headquartered in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89169-6014",
        "website": "http://www.firstfoodsgroup.com",
        "market_cap": "Nano Cap"
    },
    "FRPC": {
        "short_name": "FIRST REPUBLIC CORP OF AMERICA",
        "long_name": "First Republic Corp. of America",
        "summary": "The First Republic Corporation Of America engages in the real estate, hotel, seafood, and textile businesses. The company owns various loft buildings, office buildings, industrial buildings, shopping centers, and residential and other properties, situated along the east coast of the United States. It owns and operates a hotel and convention center located in Liverpool, New York, which it operates under a Holiday Inn franchise agreement. The company also owns a seafood operation in Cape Canaveral, Florida that harvests scallops and sells other imported and domestic seafood products. The Hanora Spinning division of the company operates a yarn spinning plant in Woonsocket, Rhode Island.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10001",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "G1PI34.SA": {
        "short_name": "GLOBAL PAYMEDRN",
        "long_name": "Global Payments Inc.",
        "summary": "Global Payments Inc. provides payment technology and software solutions for card, electronic, check, and digital-based payments in the Americas, Europe, and the Asia-Pacific. The company operates through three segments: Merchant Solutions, Issuer Solutions, and Business and Consumer Solutions. The Merchant Solutions segment offers authorization services, settlement and funding services, customer support and help-desk functions, chargeback resolution, terminal rental, sales and deployment, payment security services, consolidated billing and statements, and on-line reporting services. This segment also provides an array of enterprise software solutions that streamline business operations of its customers in various vertical markets; and value-added services, such as point-of-sale solutions, and analytic and engagement tools, as well as payroll and human capital management services. The Issuer Solutions segment offers solutions that enable financial institutions and retailers to manage their card portfolios through a platform; and commercial payments and ePayables solutions for businesses and governments. The Business and Consumer Solutions segment provides general-purpose reloadable prepaid debit and payroll cards, demand deposit accounts, and other financial service solutions to the underbanked and other consumers, and businesses under the Netspend brand. It markets its products and services through direct sales force, trade associations, agent and enterprise software providers, referral arrangements with value-added resellers, and independent sales organizations. The company was founded in 1967 and is headquartered in Atlanta, Georgia.",
        "currency": "BRL",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30326",
        "website": "http://www.globalpaymentsinc.com",
        "market_cap": "Large Cap"
    },
    "GEGI": {
        "short_name": "GENESIS ELECTRONICS GROUP INC",
        "long_name": "Genesis Electronics Group, Inc.",
        "summary": "Genesis Electronics Group, Inc., through its subsidiaries, engages in the development of solar and alternative energy applications for consumer devices, such as mobile phones device. The company focuses on developing the SunBlazer, a solar-powered charger designed specifically for the Apple iPhones. It also owns mining rights to 13 gold mining claims the Osceola Mining District located in Nevada. The company was formerly known as Pricester.com, Inc. and changed its name to Genesis Electronics Group, Inc. in February 2009. Genesis Electronics Group, Inc. was founded in 2001 and is headquartered in Red Bank, New Jersey.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Red Bank",
        "zipcode": "07701",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "GFGU": {
        "short_name": "GETFUGU INC",
        "long_name": "GetFugu, Inc.",
        "summary": "GetFugu, Inc. develops mobile search tools and mobile e-commerce platform. The company's application tools allow consumers to retrieve content and eliminate the need to type Website addresses or search terms into the mobile devices' Internet browser. It offers agnostic mobile search platform. The company was formerly known as Madero, Inc. and changed its name to GetFugu, Inc. in March 2009. GetFugu, Inc. was founded in 2007 and is based in West Hollywood, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "West Hollywood",
        "zipcode": "90069",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "GGII": {
        "short_name": "GREEN GLOBE INTERNATIONAL INC",
        "long_name": "Green Globe International, Inc.",
        "summary": "Green Globe International, Inc., through its subsidiary, Green Globe, Ltd. owns rights to the Green Globe brand for the independent certification of sustainable travel, tourism, and related green businesses. The company was formerly known as GTREX, Inc. Green Globe International, Inc. was incorporated in 1999 and is based in Murrieta, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Murrieta",
        "zipcode": "92563",
        "website": "http://pathwaytosustainability.org/green-globe-international-inc/",
        "market_cap": "Micro Cap"
    },
    "GLO.DE": {
        "short_name": "GLOBAL PAYMENTS INC.",
        "long_name": "Global Payments Inc.",
        "summary": "Global Payments Inc. provides payment technology and software solutions for card, electronic, check, and digital-based payments in the Americas, Europe, and the Asia-Pacific. The company operates through three segments: Merchant Solutions, Issuer Solutions, and Business and Consumer Solutions. The Merchant Solutions segment offers authorization services, settlement and funding services, customer support and help-desk functions, chargeback resolution, terminal rental, sales and deployment, payment security services, consolidated billing and statements, and on-line reporting services. This segment also provides an array of enterprise software solutions that streamline business operations of its customers in various vertical markets; and value-added services, such as point-of-sale solutions, and analytic and engagement tools, as well as payroll and human capital management services. The Issuer Solutions segment offers solutions that enable financial institutions and retailers to manage their card portfolios through a platform; and commercial payments and ePayables solutions for businesses and governments. The Business and Consumer Solutions segment provides general-purpose reloadable prepaid debit and payroll cards, demand deposit accounts, and other financial service solutions to the underbanked and other consumers, and businesses under the Netspend brand. It markets its products and services through direct sales force, trade associations, agent and enterprise software providers, referral arrangements with value-added resellers, and independent sales organizations. The company was founded in 1967 and is headquartered in Atlanta, Georgia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30326",
        "website": "http://www.globalpaymentsinc.com",
        "market_cap": "Large Cap"
    },
    "GLO.F": {
        "short_name": "GLOBAL PAYMENTS INC.",
        "long_name": "Global Payments Inc.",
        "summary": "Global Payments Inc. provides payment technology and software solutions for card, electronic, check, and digital-based payments in the Americas, Europe, and the Asia-Pacific. The company operates through three segments: Merchant Solutions, Issuer Solutions, and Business and Consumer Solutions. The Merchant Solutions segment offers authorization services, settlement and funding services, customer support and help-desk functions, chargeback resolution, terminal rental, sales and deployment, payment security services, consolidated billing and statements, and on-line reporting services. This segment also provides an array of enterprise software solutions that streamline business operations of its customers in various vertical markets; and value-added services, such as point-of-sale solutions, and analytic and engagement tools, as well as payroll and human capital management services. The Issuer Solutions segment offers solutions that enable financial institutions and retailers to manage their card portfolios through a platform; and commercial payments and ePayables solutions for businesses and governments. The Business and Consumer Solutions segment provides general-purpose reloadable prepaid debit and payroll cards, demand deposit accounts, and other financial service solutions to the underbanked and other consumers, and businesses under the Netspend brand. It markets its products and services through direct sales force, trade associations, agent and enterprise software providers, referral arrangements with value-added resellers, and independent sales organizations. The company was founded in 1967 and is headquartered in Atlanta, Georgia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30326",
        "website": "http://www.globalpaymentsinc.com",
        "market_cap": "Large Cap"
    },
    "GPN.MX": {
        "short_name": "GLOBAL PAYMENTS INC",
        "long_name": "Global Payments Inc.",
        "summary": "Global Payments Inc. provides payment technology and software solutions for card, electronic, check, and digital-based payments in the Americas, Europe, and the Asia-Pacific. The company operates through three segments: Merchant Solutions, Issuer Solutions, and Business and Consumer Solutions. The Merchant Solutions segment offers authorization services, settlement and funding services, customer support and help-desk functions, chargeback resolution, terminal rental, sales and deployment, payment security services, consolidated billing and statements, and on-line reporting services. This segment also provides an array of enterprise software solutions that streamline business operations of its customers in various vertical markets; and value-added services, such as point-of-sale solutions, and analytic and engagement tools, as well as payroll and human capital management services. The Issuer Solutions segment offers solutions that enable financial institutions and retailers to manage their card portfolios through a platform; and commercial payments and ePayables solutions for businesses and governments. The Business and Consumer Solutions segment provides general-purpose reloadable prepaid debit and payroll cards, demand deposit accounts, and other financial service solutions to the underbanked and other consumers, and businesses under the Netspend brand. It markets its products and services through direct sales force, trade associations, agent and enterprise software providers, referral arrangements with value-added resellers, and independent sales organizations. The company was founded in 1967 and is headquartered in Atlanta, Georgia.",
        "currency": "MXN",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30326",
        "website": "http://www.globalpaymentsinc.com",
        "market_cap": "Large Cap"
    },
    "GPN": {
        "short_name": "Global Payments Inc.",
        "long_name": "Global Payments Inc.",
        "summary": "Global Payments Inc. provides payment technology and software solutions for card, electronic, check, and digital-based payments in the Americas, Europe, and the Asia-Pacific. The company operates through three segments: Merchant Solutions, Issuer Solutions, and Business and Consumer Solutions. The Merchant Solutions segment offers authorization services, settlement and funding services, customer support and help-desk functions, chargeback resolution, terminal rental, sales and deployment, payment security services, consolidated billing and statements, and on-line reporting services. This segment also provides an array of enterprise software solutions that streamline business operations of its customers in various vertical markets; and value-added services, such as point-of-sale solutions, and analytic and engagement tools, as well as payroll and human capital management services. The Issuer Solutions segment offers solutions that enable financial institutions and retailers to manage their card portfolios through a platform; and commercial payments and ePayables solutions for businesses and governments. The Business and Consumer Solutions segment provides general-purpose reloadable prepaid debit and payroll cards, demand deposit accounts, and other financial service solutions to the underbanked and other consumers, and businesses under the Netspend brand. It markets its products and services through direct sales force, trade associations, agent and enterprise software providers, referral arrangements with value-added resellers, and independent sales organizations. The company was founded in 1967 and is headquartered in Atlanta, Georgia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30326",
        "website": "http://www.globalpaymentsinc.com",
        "market_cap": "Large Cap"
    },
    "GPOX": {
        "short_name": "GPO PLUS INC",
        "long_name": "GPO Plus, Inc.",
        "summary": "GPO Plus, Inc. organizes, promotes, and operates industry-specific group purchase organizations in the United States. It operates as a group purchasing organization for the healthcare and hemp industries, as well as offers professional services. The company is headquartered in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89120",
        "website": "http://www.gpoplus.com",
        "market_cap": "Nano Cap"
    },
    "HHGI": {
        "short_name": "HAWAIIAN HOSPITALITY GROUP INC",
        "long_name": "Hawaiian Hospitality Group, Inc.",
        "summary": "Hawaiian Hospitality Group, Inc. focuses on commercializing under-utilized waterfront properties in the Hawaiian Islands, Hawaii. The company specializes in identifying, designing, and operating public and private sites suitable for environmental and commercial revitalization. It also owns and operates the Loulu Palm Estate on a mile long private beach located on the North Shore of Oahu, Hawaii. The company is based in Haleiwa, Hawaii.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "HI",
        "city": "Haleiwa",
        "zipcode": "96712",
        "website": "http://www.hawaiianhospitalitygroup.com",
        "market_cap": "Nano Cap"
    },
    "HITD": {
        "short_name": "HOUSTON INTERWEB DESIGN INC",
        "long_name": "Houston InterWeb Design, Inc.",
        "summary": "Houston Interweb Design, Inc. provides Internet strategy consulting and Internet-based solutions to international companies and startup businesses in the United States. It helps its clients define Internet strategies; and designs, architects, develops, and implements solutions to execute those strategies. These solutions focus on large-scale and complex business-to-consumer (B2C) and business-to-business (B2B) electronic commerce, digital customer relationship management, supply chain optimization, electronic markets, and Internet portals. The company offers custom Web sites, encompassing graphics and layouts, including SiteBlazer.com, which allows companies to build, customized and updateable Web sites; and SITEBLAZER network, a B2B and B2C Web guide/search engine. It also provides interactive databases, which enable customers to self-manage their Web sites internally, such as PoliticalNet.Com and PoliticalTeam.com, which are one-stop political campaign sites that provide politicians, organizations, and political groups, a range of Internet, as well as brick and mortar products; and ListenToChina.com, which is an MP3 music site. In addition, the company develops an online auction system, which allows traditional sealed bids or bids that can be viewed online. It has partnership with Erealty.com, Houston Chronicle, Politicsonline.com, and Electorales.com. The company was founded in 1996 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77056",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "IAA": {
        "short_name": "IAA, Inc.",
        "long_name": "IAA, Inc.",
        "summary": "IAA, Inc. provides auction solutions for total loss, damaged, and low-value vehicles. The company's platform facilitates the marketing and sale of total loss, damaged, and low-value vehicles for a spectrum of sellers. Its solutions provide buyers with the vehicles need to, among other things, fulfill vehicle rebuild requirements, replacement part inventory, or scrap demand. The company serves a buyer base and spectrum of sellers, including insurance companies, dealerships, fleet lease and rental car companies, and charitable organizations. The company has approximately 200 facilities in the United States, Canada, and the United Kingdom. IAA, Inc. was founded in 1982 and is headquartered in Westchester, Illinois.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Westchester",
        "zipcode": "60154",
        "website": "http://www.iaai.com",
        "market_cap": "Mid Cap"
    },
    "IJJP": {
        "short_name": "IJJ CORP",
        "long_name": "IJJ Corporation",
        "summary": "IJJ Corporation provides consulting and management services to public and private companies, professional individuals, and service contractors. It offers financial support services, subscription service programs, and management consulting services. The company was formerly known as Sun & Surf, Inc. and changed its name to IJJ Corporation in February 2004. IJJ Corporation was founded in 2003 and is headquartered in Silver Spring, Maryland.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MD",
        "city": "Silver Spring",
        "zipcode": "20905",
        "website": "http://www.ijjc.com",
        "market_cap": "Nano Cap"
    },
    "INCC": {
        "short_name": "INTERNATIONAL CONSOLIDATED CO I",
        "long_name": "International Consolidated Companies, Inc.",
        "summary": "International Consolidated Companies, Inc. acquires and grows businesses that provide services and technologies to assist medical marijuana growers and patients with production and delivery systems. It also offers technology and consulting services to medical cannabis growers, activists, and industry professionals; and logistical and technological services to the medical marijuana industry. International Consolidated Companies, Inc. was formerly known as Sign Media Systems, Inc. and changed its name to International Consolidated Companies, Inc. in September 2007. The company was founded in 2002 and is based in Sarasota, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Sarasota",
        "zipcode": "34243",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "JCDS": {
        "short_name": "JC DATA SOLUTIONS INC",
        "long_name": "JC Data Solutions Inc.",
        "summary": "JC Data Solutions Inc. provides funds and document distribution solutions for oil and gas companies. It offers Payment Manager that disburses funds and payee notification of disbursements and provide paper checks, as well as provide various royalty and working interest payees with online access to statements, K-1s, 1099s, and copies of JIB statements. The company is based in Hurst, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Hurst",
        "zipcode": "76054",
        "website": "http://jcdatasolutions.com",
        "market_cap": "Nano Cap"
    },
    "K2R.F": {
        "short_name": "STARTEK INC.  DL-,01",
        "long_name": "StarTek, Inc.",
        "summary": "StarTek, Inc., a business process outsourcing company, provides omni-channel customer experience, digital transformation, and technology services in various markets. The company primarily offers customer engagement, omnichannel engagement, social media, customer intelligence analytics, work from home, back office, and receivables management services under the Startek and Aegis brands. It also offers Startek cloud, a hybrid omni-cloud platform integrated with AI capabilities. The company serves telecommunications, e-commerce and consumer, media and cable, financial and business services, travel and hospitality, healthcare and education, technology, and energy and utility industries in the Americas, the Middle East, Malaysia, India, Sri Lanka, Argentina, Peru, and internationally. StarTek, Inc. was founded in 1987 and is based in Greenwood Village, Colorado.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CO",
        "city": "Greenwood Village",
        "zipcode": "80111",
        "website": "http://www.startek.com",
        "market_cap": "Small Cap"
    },
    "KODK": {
        "short_name": "Eastman Kodak Company",
        "long_name": "Eastman Kodak Company",
        "summary": "Eastman Kodak Company provides hardware, software, consumables, and services to customers in the commercial print, packaging, publishing, manufacturing, entertainment and commercial films, and consumer products markets worldwide. The company operates in four segments: Traditional Printing, Digital Printing, Advanced Materials and Chemicals, and Brand. The Traditional Printing segment offers digital offset plate and computer-to-plate imaging solutions to commercial industries, including commercial print, direct mail, book publishing, newspapers and magazines, and packaging. The Digital Printing segment offers electrophotographic printing solutions, such as DIGIMASTER and NEXFINITY printers; prosper products, including the PROSPER press systems and PROSPER components; versamark products; and Software comprising PRINERGY workflow production software. The Advanced Materials and Chemicals segment engages in industrial film and chemicals, motion picture, and advanced materials and functional printing businesses; and kodak services for business. This segment also comprises the Kodak Research Laboratories, which conducts research, develops new product or new business opportunities, and files patent applications for its inventions and innovations, as well as manages licensing of its intellectual property to third parties. The Brand segment engages in the licensing of Kodak brand to third parties. Additionally, it engages in the operation of Eastman Business Park, a technology center and industrial complex. The company sells its products and services through direct sales, third party resellers, and distributors. Eastman Kodak Company was founded in 1880 and is headquartered in Rochester, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Rochester",
        "zipcode": "14650",
        "website": "http://www.kodak.com",
        "market_cap": "Small Cap"
    },
    "KODN.F": {
        "short_name": "EASTMAN KODAK NEW DL 2,50",
        "long_name": "Eastman Kodak Company",
        "summary": "Eastman Kodak Company provides hardware, software, consumables, and services to customers in the commercial print, packaging, publishing, manufacturing, entertainment and commercial films, and consumer products markets worldwide. The company operates in four segments: Traditional Printing, Digital Printing, Advanced Materials and Chemicals, and Brand. The Traditional Printing segment offers digital offset plate and computer-to-plate imaging solutions to commercial industries, including commercial print, direct mail, book publishing, newspapers and magazines, and packaging. The Digital Printing segment offers electrophotographic printing solutions, such as DIGIMASTER and NEXFINITY printers; prosper products, including the PROSPER press systems and PROSPER components; versamark products; and Software comprising PRINERGY workflow production software. The Advanced Materials and Chemicals segment engages in industrial film and chemicals, motion picture, and advanced materials and functional printing businesses; and kodak services for business. This segment also comprises the Kodak Research Laboratories, which conducts research, develops new product or new business opportunities, and files patent applications for its inventions and innovations, as well as manages licensing of its intellectual property to third parties. The Brand segment engages in the licensing of Kodak brand to third parties. Additionally, it engages in the operation of Eastman Business Park, a technology center and industrial complex. The company sells its products and services through direct sales, third party resellers, and distributors. Eastman Kodak Company was founded in 1880 and is headquartered in Rochester, New York.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "Rochester",
        "zipcode": "14650",
        "website": "http://www.kodak.com",
        "market_cap": "Small Cap"
    },
    "KOSK": {
        "short_name": "ONE STEP VENDING CORP",
        "long_name": "One Step Vending Corp.",
        "summary": "One Step Vending Corp., through its subsidiaries, develops, manufactures, and services micro market kiosks for corporations and businesses to provide packaged snacks and beverages along with customer loyalty solutions in the United States. It also offers Earn IQ, a marketing solution for small to medium sized businesses desiring to capitalize on brand recognition and strengthen brand loyalty. The company was formerly known as Rewards Nexus Inc. and changed its name to One Step Vending Corp. in March 2015. One Step Vending Corp. was founded in 2004 and is headquartered in Harrison, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Harrison",
        "zipcode": "10528",
        "website": "http://www.onestepvending.com",
        "market_cap": "Nano Cap"
    },
    "LMTI": {
        "short_name": "LASER MASTER INTL",
        "long_name": "Laser Master International, Inc.",
        "summary": "Laser Master International, Inc. engages in printing, marketing, and selling gift wrap, gift bag, and related general packaging materials in the United States. It sells its products to distributors and retail stores, as well as to mass merchants and national dollar stores through its direct sales force and resellers. The company was founded in 1981 and is based in Harrison, New Jersey.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Harrison",
        "zipcode": "07029",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "MMS": {
        "short_name": "Maximus, Inc.",
        "long_name": "Maximus, Inc.",
        "summary": "Maximus, Inc. provides business process services (BPS) to government health and human services programs worldwide. It operates through three segments: U.S. Services, U.S. Federal Services, and Outside the U.S. The U.S. Services segment offers various BPS solutions, such as program administration, appeals and assessments, and related consulting works for U.S. state and local government programs, including the Affordable Care Act, Medicaid, the Children's Health Insurance Program, Temporary Assistance to Needy Families, child support programs, Preadmission Screening and Resident Reviews, and Independent Developmental Disability assessments. This segment also provides program eligibility support and enrollment; centralized multilingual customer contact centers, multichannel, and digital self-service options for enrollment; application assistance and independent health plan choice counseling; beneficiary outreach, education, eligibility, enrollment, and redeterminations; person-centered independent disability, long-term sick, and other health assessments; and specialized consulting services. The U.S. Federal Services segment offers centralized citizen engagement centers and support services; document and record management; case management, citizen support, and consumer education; independent medical reviews and worker's compensation benefit appeals; Medicare and Medicaid appeals; and federal marketplace eligibility appeals. This segment also provides modernization of systems and information technology infrastructure; infrastructure operations and support services; software development, operations, and management services; and data analytics services. The Outside the U.S. segment offers BPS solutions for governments and commercial clients outside the United States, including health and disability assessments, program administration for employment services, and other job seeker-related services. The company was founded in 1975 and is headquartered in Reston, Virginia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Reston",
        "zipcode": "20190",
        "website": "http://www.maximus.com",
        "market_cap": "Mid Cap"
    },
    "MMTRS": {
        "short_name": "MILLS MUSIC TRUST",
        "long_name": "Mills Music Trust",
        "summary": "Mills Music Trust holds the right to receive payment of a deferred contingent purchase price obligation relating to music and lyric copyright catalogue payable by EMI Mills Music Inc. primarily in the United States. EMI Mills Music Inc. operates as an owner of the copyrighted materials contained in the catalogue. The payments of the contingent portion are based on royalty income generated by the catalogue. Mills Music Trust was founded in 1964 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10018",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "MMY.F": {
        "short_name": "MAXIMUS INC.",
        "long_name": "Maximus, Inc.",
        "summary": "Maximus, Inc. provides business process services (BPS) to government health and human services programs worldwide. It operates through three segments: U.S. Services, U.S. Federal Services, and Outside the U.S. The U.S. Services segment offers various BPS solutions, such as program administration, appeals and assessments, and related consulting works for U.S. state and local government programs, including the Affordable Care Act, Medicaid, the Children's Health Insurance Program, Temporary Assistance to Needy Families, child support programs, Preadmission Screening and Resident Reviews, and Independent Developmental Disability assessments. This segment also provides program eligibility support and enrollment; centralized multilingual customer contact centers, multichannel, and digital self-service options for enrollment; application assistance and independent health plan choice counseling; beneficiary outreach, education, eligibility, enrollment, and redeterminations; person-centered independent disability, long-term sick, and other health assessments; and specialized consulting services. The U.S. Federal Services segment offers centralized citizen engagement centers and support services; document and record management; case management, citizen support, and consumer education; independent medical reviews and worker's compensation benefit appeals; Medicare and Medicaid appeals; and federal marketplace eligibility appeals. This segment also provides modernization of systems and information technology infrastructure; infrastructure operations and support services; software development, operations, and management services; and data analytics services. The Outside the U.S. segment offers BPS solutions for governments and commercial clients outside the United States, including health and disability assessments, program administration for employment services, and other job seeker-related services. The company was founded in 1975 and is headquartered in Reston, Virginia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "VA",
        "city": "Reston",
        "zipcode": "20190",
        "website": "http://www.maximus.com",
        "market_cap": "Mid Cap"
    },
    "NOHO": {
        "short_name": "NOVATION HLDGS INC",
        "long_name": "Dragon Life Science Holdings Group, Inc.",
        "summary": "Dragon Life Science Holdings Group, Inc. operates as regional Internet service provider. The company offers Internet access, emails, and related services in the United States. It also provides administrative services; and focuses on teaching children Spanish through learning centers and various after school enrichment programs. The company was founded in 1998 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10005",
        "website": "http://www.dglsholdings.com",
        "market_cap": "Nano Cap"
    },
    "NSYC": {
        "short_name": "NATIONAL STOCK YARDS CO",
        "long_name": "National Stock Yards Co.",
        "summary": "National Stock Yards Company engages in the auction of livestock. The company is based in Naperville, Illinois.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Naperville",
        "zipcode": "60540",
        "website": null,
        "market_cap": null
    },
    "OGNT": {
        "short_name": "ORGANA TECHNOLOGIES GROUP INC",
        "long_name": "Organa Technologies Group, Inc.",
        "summary": "Organa Technologies Group, Inc., through its subsidiaries, provides technology-based solutions and consulting, computer hardware and software solutions, Internet-based retail sales, and other ancillary services. The company provides Internet Web hosting and voice over Internet protocol services; Web design services, hardware and software installation and training, and other Internet related consulting services; hardware and software computer system solutions and services; and on-line payment processing through ACH and other banking solutions. It also offers online product registration of replica weapons, and authentication through G2G online product registration of replica memorabilia, as well as enables Internet purchasing of swords and weapon memorabilia. The company was formerly known as Integrity Messenger Corporation and changed its name to Organa Technologies Group, Inc. in April, 2006. Organa Technologies Group, Inc. was founded in 2002 and is based in Melbourne, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Melbourne",
        "zipcode": "32935",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "OMEX": {
        "short_name": "Odyssey Marine Exploration, Inc",
        "long_name": "Odyssey Marine Exploration, Inc.",
        "summary": "Odyssey Marine Exploration, Inc., together with its subsidiaries, engages in the deep-ocean exploration activities worldwide. The company provides specialized mineral exploration, project development, and marine services to clients. It offers research, scientific, resource assessment, marine operations planning, management execution, project planning, and project management services. Odyssey Marine Exploration, Inc. was founded in 1986 and is headquartered in Tampa, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Tampa",
        "zipcode": "33609",
        "website": "http://www.odysseymarine.com",
        "market_cap": "Micro Cap"
    },
    "OPUS": {
        "short_name": "OPUS MAGNUM AMERIS INC",
        "long_name": "Opus Magnum Ameris Inc",
        "summary": "TeleServices Internet Group, Inc. did not engage in any business activity as of February 19, 2002. The company was formed for the purpose of seeking potential business opportunities in the form of a business combination with an existing business.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Great Neck",
        "zipcode": "11021",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "OYM1.F": {
        "short_name": "ODYSSEY MAR.EXPL. DL-0001",
        "long_name": "Odyssey Marine Exploration, Inc.",
        "summary": "Odyssey Marine Exploration, Inc., together with its subsidiaries, engages in the deep-ocean exploration activities worldwide. The company provides specialized mineral exploration, project development, and marine services to clients. It offers research, scientific, resource assessment, marine operations planning, management execution, project planning, and project management services. Odyssey Marine Exploration, Inc. was founded in 1986 and is headquartered in Tampa, Florida.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "FL",
        "city": "Tampa",
        "zipcode": "33609",
        "website": "http://www.odysseymarine.com",
        "market_cap": "Micro Cap"
    },
    "PAE": {
        "short_name": "PAE Incorporated",
        "long_name": "PAE Incorporated",
        "summary": "PAE Incorporated provides operational solutions and outsourced services for the United States government, other allied governments, international organizations, and companies. The company operates through two segments, Global Mission Services and National Security Solutions. The Global Mission Services segment engages in logistics and stability operations, including lifecycle logistics operations, humanitarian, and stability operations; infrastructure management, such as mission operations support, space development and operations, and test and training ranges; and force readiness comprising the maintenance and repair of military and civilian vehicle fleets and aircraft. The National Security Solutions segment offers counter-threat solutions, such as training support and counter-terrorism solutions; information optimization services, including business process outsourcing services to government agencies, such as citizenship processing and litigation services, and systems support; and intelligence solutions comprising intelligence analysis, mission support, program management, engineering, and training solutions. PAE Incorporated was founded in 1955 and is headquartered in Falls Church, Virginia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Falls Church",
        "zipcode": "22043-2408",
        "website": "http://www.pae.com",
        "market_cap": "Small Cap"
    },
    "PAYS": {
        "short_name": "Paysign, Inc.",
        "long_name": "PaySign, Inc.",
        "summary": "PaySign, Inc. provides prepaid card products and processing services under the PaySign brand for corporate, consumer, and government applications. The company offers various services, including transaction processing, cardholder enrollment, value loading, cardholder account management, reporting, and customer service through PaySign, a proprietary card-processing platform. It also develops prepaid card solutions for corporate incentive and rewards, consumer rebates, donor compensation, clinical trials, healthcare reimbursement payments, and pharmaceutical payment assistance; and payroll or general purpose reloadable cards, as well as gift or incentive cards. In addition, the company offers Co-Pay Assistance Program, a pharmaceutical payment card product; and Per Diem/Corporate Expense Payments that allows businesses, and nonÂ\u0096profits and government agencies the ability to control employee spending while reducing administration costs by eliminating the need for traditional expense reports. Further, it provides Buy and Bill programs for patients to purchase directly from physician's office or through an infusion center for physician administered therapies; payment solution for source plasma collection centers; and PaySign Premier, a demand deposit account debit card, as well as customer service center and PaySign Communications Suite services. Its principal target markets for processing services comprise prepaid card issuers, retail and private-label issuers, small third-party processors, and small and mid-size financial institutions in the United States and internationally. The company was formerly known as 3PEA International, Inc. and changed its name to PaySign, Inc. in April 2019. PaySign, Inc. is based in Henderson, Nevada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Henderson",
        "zipcode": "89052",
        "website": "http://www.paysign.com",
        "market_cap": "Micro Cap"
    },
    "PCOA": {
        "short_name": "PENDRELL CORPORATION",
        "long_name": "Pendrell Corporation",
        "summary": "Pendrell Corporation invests in, acquires, and develops businesses with technologies that are protected by intellectual property (IP) rights in the United States. It manages three IP licensing programs comprising memory and storage technologies, digital media, and digital cinema. The company's digital media program is supported by patents and patent applications to protect against unauthorized duplication and use of digital content during the transfer of the digital content. It grants digital media licenses to manufacturers, distributors, and providers of consumer products. The company's memory and storage technologies are used in electronic devices, including licensees of flash memory component suppliers, solid state disk manufacturers, and device vendors. Its digital cinema program is supported by DRM Patents and patent applications designed to protect against unauthorized creation, duplication and use of digital cinema content that is distributed to movie theaters worldwide. Its digital cinema licensees include distributors and exhibitors of digital content, such as motion picture producers, motion picture distributors, and equipment vendors. The company was formerly known as ICO Global Communications (Holdings) Limited and changed its name to Pendrell Corporation in July 2011. Pendrell Corporation was founded in 1995 and is headquartered in Kirkland, Washington.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WA",
        "city": "Kirkland",
        "zipcode": "98033",
        "website": "http://www.pendrell.com",
        "market_cap": "Micro Cap"
    },
    "PF3.F": {
        "short_name": "PERFORMANT FINAN.DL-,0001",
        "long_name": "Performant Financial Corporation",
        "summary": "Performant Financial Corporation provides technology-enabled audit, recovery, outsource customer, and related analytics services in the United States. The company offers recovery services to the clients in Federal guaranteed student loan program and private institutions; identifies and tracks defaulted borrowers across its clients' portfolios of student loans; rehabilitates and recovers past due student loans; provides tax recovery services to federal, state and municipal agencies; recovers government debt for various federal agencies; and offers audit and recovery services to identify improper healthcare payments for public and private healthcare clients. It also identifies improper payments resulting from incorrect coding, procedures that were not medically necessary, incomplete documentation, and claims submitted based on outdated fee schedules; and provides default aversion and/or first party call center services. In addition, the company offers Performant Insight that provides various services, such as post- and pre-payment audit of healthcare claims, detection of fraud, waste and abuse of healthcare claims, coordination of benefits, and pharmacy fraud detection services. The company was formerly known as DCS Holdings, Inc. and changed its name to Performant Financial Corporation in 2005. Performant Financial Corporation was founded in 1976 and is headquartered in Livermore, California.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Livermore",
        "zipcode": "94551",
        "website": "http://performantcorp.com",
        "market_cap": "Micro Cap"
    },
    "PFMT": {
        "short_name": "Performant Financial Corporatio",
        "long_name": "Performant Financial Corporation",
        "summary": "Performant Financial Corporation provides technology-enabled audit, recovery, outsource customer, and related analytics services in the United States. The company offers recovery services to the clients in Federal guaranteed student loan program and private institutions; identifies and tracks defaulted borrowers across its clients' portfolios of student loans; rehabilitates and recovers past due student loans; provides tax recovery services to federal, state and municipal agencies; recovers government debt for various federal agencies; and offers audit and recovery services to identify improper healthcare payments for public and private healthcare clients. It also identifies improper payments resulting from incorrect coding, procedures that were not medically necessary, incomplete documentation, and claims submitted based on outdated fee schedules; and provides default aversion and/or first party call center services. In addition, the company offers Performant Insight that provides various services, such as post- and pre-payment audit of healthcare claims, detection of fraud, waste and abuse of healthcare claims, coordination of benefits, and pharmacy fraud detection services. The company was formerly known as DCS Holdings, Inc. and changed its name to Performant Financial Corporation in 2005. Performant Financial Corporation was founded in 1976 and is headquartered in Livermore, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Livermore",
        "zipcode": "94551",
        "website": "http://performantcorp.com",
        "market_cap": "Micro Cap"
    },
    "PFSW": {
        "short_name": "PFSweb, Inc.",
        "long_name": "PFSweb, Inc.",
        "summary": "PFSweb, Inc., together with its subsidiaries, provides omni-channel commerce solutions in the United States, Belgium, Bulgaria, the United Kingdom, Canada, and India. It operates in two segments, PFS Operations and LiveArea Professional Services. The PFS Operations segment offers order to cash service, which provides distributed order orchestration and payment processing; order fulfillment services; contact center services that are focused on providing essential services, such as order entry, returns authorization, product inquiry, and order tracking, as well as iCommerce Agent, a customizable web-based application for accessing required customer information. The LiveArea Professional Services offers NXT Intelligence, a collection of purpose-built solutions, which allow clients to assess opportunities across technology, innovation, and brand experience areas; service design, a business transformation service; product innovation services; and connected commerce services. This segment also provides performance marketing services, including search engine optimization, data analytics, conversion rate optimization, digital marketing, paid media, and email marketing; and orchestrated services that evaluate the right digital transformation strategies, mitigate workloads, manage infrastructure and backup, and secure data and applications. It serves clients in various industries, such as fashion apparel and accessories, fragrance and beauty products, health, luxury goods, cosmetics, consumer packaged goods, home furnishings and housewares, coins and collectibles, jewelry, consumer electronics, quick-serve restaurants, telecommunications, computer and office products, technology manufacturing, and other industries. PFSweb, Inc. was founded in 1994 and is headquartered in Allen, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Allen",
        "zipcode": "75013",
        "website": "http://www.pfsweb.com",
        "market_cap": "Micro Cap"
    },
    "PFW1.F": {
        "short_name": "PFSWEB INC. NEW  DL-,01",
        "long_name": "PFSweb, Inc.",
        "summary": "PFSweb, Inc., together with its subsidiaries, provides omni-channel commerce solutions in the United States, Belgium, Bulgaria, the United Kingdom, Canada, and India. It operates in two segments, PFS Operations and LiveArea Professional Services. The PFS Operations segment offers order to cash service, which provides distributed order orchestration and payment processing; order fulfillment services; contact center services that are focused on providing essential services, such as order entry, returns authorization, product inquiry, and order tracking, as well as iCommerce Agent, a customizable web-based application for accessing required customer information. The LiveArea Professional Services offers NXT Intelligence, a collection of purpose-built solutions, which allow clients to assess opportunities across technology, innovation, and brand experience areas; service design, a business transformation service; product innovation services; and connected commerce services. This segment also provides performance marketing services, including search engine optimization, data analytics, conversion rate optimization, digital marketing, paid media, and email marketing; and orchestrated services that evaluate the right digital transformation strategies, mitigate workloads, manage infrastructure and backup, and secure data and applications. It serves clients in various industries, such as fashion apparel and accessories, fragrance and beauty products, health, luxury goods, cosmetics, consumer packaged goods, home furnishings and housewares, coins and collectibles, jewelry, consumer electronics, quick-serve restaurants, telecommunications, computer and office products, technology manufacturing, and other industries. PFSweb, Inc. was founded in 1994 and is headquartered in Allen, Texas.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Allen",
        "zipcode": "75013",
        "website": "http://www.pfsweb.com",
        "market_cap": "Micro Cap"
    },
    "PGLO": {
        "short_name": "PAN GLOBAL CORP",
        "long_name": "Pan Global Corp.",
        "summary": "Pan Global Corp. does not have significant operations. It intends to effect a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or other similar business combination with one or more operating businesses or assets. The company was incorporated in 2010 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Carson City",
        "zipcode": "10036",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "PGSC": {
        "short_name": "PROGRESSIVE GREEN SOLUTIONS INC",
        "long_name": "Progressive Green Solutions, Inc.",
        "summary": "Progressive Green Solutions, Inc., through its subsidiary, Green Remanufacturing Solutions LLC, operates as a full service returns management solution provider. It specializes in reverse logistics, remanufacturing, repair and recovery, engineering/quality assurance, warehousing and fulfillment, secondary market sales, and e-commerce for retailers and manufacturers of major appliances, small appliances, floor care products, air-conditioning/filtration products, power tools, and outdoor power equipment products. The company is also involved in the production and sale of crushed stone and aggregates to the New York City metro area. Progressive Green Solutions, Inc. is based in Yaphank, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Yaphank",
        "zipcode": "11980",
        "website": "http://www.pgscus.com",
        "market_cap": "Nano Cap"
    },
    "PIFR": {
        "short_name": "PREMIER INFORMATION MANAGEME",
        "long_name": "Premier information Management, Inc.",
        "summary": "Premier Information Management, Inc. provides business outsourced processing services to insurance underwriters and brokers in North America and internationally. It implements process solutions to procure and manage medical information necessary for insurance carriers, brokers, and agents to evaluate risks associated with life underwriting and claims requirements. The company is based in Phoenix, Arizona.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85044",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "PPMT": {
        "short_name": "PROFIT PLANNERS MGMT INC",
        "long_name": "Profit Planners Management, Inc.",
        "summary": "Profit Planners Management, Inc. provides management, tax, and financial and accounting advisory services primarily through consulting agreements in New York and Florida. The company offers management, staffing, payroll, human resources, billing, and tax services to its clients; short-term engagements of an outside management services to help companies complete certain transactions or restructurings; and monthly accounting, payroll, tax, and billing services to businesses that do not have those departments. It also provides a range of insurance and insurance related products, such as life insurance and annuities, as well as sells insurance products and services directly to individuals and companies. In addition, the company offers budgeting, and asset allocation and control advisory services to professional athletes, entertainers, and other high earning individuals; and strategic and financial consulting services for companies to raise capital in the debt and equity markets. It serves small and midsized companies. The company was founded in 2009 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10018",
        "website": "http://www.profitplannersmgt.com",
        "market_cap": "Nano Cap"
    },
    "PRMK": {
        "short_name": "PROCONCEPT MARKETING GROUP INC",
        "long_name": "ProConcept Marketing Group, Inc.",
        "summary": "ProConcept Marketing Group, Inc. engages in strategic marketing and business management activities in the United States and Canada. It provides proprietary engagement marketing strategies, talent procurement, and management consulting to international corporations, which operates in various industries, including sports, cosmetics, beverages, wine and spirits, apparel, real estate development, retail products, and manufacturing. The company supplies cosmetics, water filtration units, and alcohol and non alcohol products to the commercial and non-commercial markets, such as hotels, bars, restaurants, health and beauty stores mass, and boutique locations. It also owns Cave Village, which holds 1078 acres on the south coast of the Caribbean paradise of Jamaica; South Beach on the south coast of Jamaica; The Village at Jackson Heights, a boutique planned unit development of bungalow villas; and a full-service resort in the Turks and Caicos Islands. In addition, the company gives access to celebrity endorsers and athletes for corporations to help brand identity, as well as provides management consulting services. ProConcept Marketing Group, Inc. markets its products through independent sales representatives and distributors. The company is based in Spencerville, Indiana.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "IN",
        "city": "Spencerville",
        "zipcode": "46788",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "PSCR": {
        "short_name": "PROTO SCRIPT PHARMACEUTICAL COR",
        "long_name": "Proto Script Pharmaceutical Corp.",
        "summary": "Proto Script Pharmaceutical Corp. engages in the repair and rental of power wheelchairs and scooters. The company serves federal, state, and private insurance providers. Proto Script Pharmaceutical Corp. was founded in 2001 and is headquartered in Rancho Cucamonga, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Rancho Cucamonga",
        "zipcode": "91730",
        "website": "http://www.psphomecare.com",
        "market_cap": "Nano Cap"
    },
    "PVNO": {
        "short_name": "PROVISION OPERATIONS SYSTEMS IN",
        "long_name": "ProVision Operation Systems, Inc.",
        "summary": "ProVision Operation Systems, Inc. serves as a holding company for various development stage companies. Its subsidiaries provide continuing education and support via various seminars, workshops, and subjects focusing on real estate acquisition, business development, stock investing, personal development, and wealth building strategies. The company was founded in 1997 and is headquartered in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89107",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "PZA.F": {
        "short_name": "SP PLUS CORP.  DL 1",
        "long_name": "SP Plus Corporation",
        "summary": "SP Plus Corporation provides parking management, ground transportation, baggage, and other ancillary services in North America. The company operates through Commercial, Aviation, and Other segments. It provides on-site parking management, event logistics, baggage handling, remote airline check-in, security, and municipal meter revenue collection and enforcement services. The company also offers shuttle bus vehicles and drivers; ground transportation services; delivery of delayed luggage and baggage handling services; wheelchair assist services; baggage repair and replacement services; on-street parking meter collection and other forms of parking enforcement services; and valet services. In addition, it provides facility maintenance services, including power sweeping and washing, painting and general repairs, and cleaning and seasonal services; security services comprising training and hiring of security officers and patrol, as well as customized services and technology; and an online and mobile app consumer platform through parking.com website. Further, the company provides multi-platform marketing services, including SP+ branded websites that offer clients a platform for marketing their facilities, mobile apps, search marketing, email marketing, and social media campaigns. The company offers its services primarily under the SP+, Sphere, and Bags brands. It serves private and public owners, municipalities and governments, managers and developers of office buildings, residential properties, commercial properties, shopping centers and other retail properties, sports and special event complexes, hotels and resorts, healthcare facilities and medical centers, airlines, and cruise lines. The company was formerly known as Standard Parking Corporation and changed its name to SP Plus Corporation in December 2013. SP Plus Corporation was founded in 1929 and is based in Chicago, Illinois.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "IL",
        "city": "Chicago",
        "zipcode": "60601-7702",
        "website": "http://www.spplus.com",
        "market_cap": "Small Cap"
    },
    "QGU.F": {
        "short_name": "QUAD GRAPHICS INC. CL. A",
        "long_name": "Quad/Graphics, Inc.",
        "summary": "Quad/Graphics, Inc. provides marketing solutions worldwide. The company operates in United States Print and Related Services, and International segments. It offers printing services, such as retail inserts, publications, catalogs, special interest publications, journals, direct mail, directories, in-store marketing and promotion, packaging, newspapers, custom print products, and other commercial and specialty printed products; and paper procurement services. The company also provides marketing and other services, including consumer insights, audience targeting, personalization, media planning and placement, process optimization, campaign planning and creation, pre-media production, videography, photography, digital and print execution, and logistics, as well as manufactures ink. It serves blue chip companies that operate in various industries; and businesses and consumers comprising retailers, publishers, and direct marketers. The company was founded in 1971 and is headquartered in Sussex, Wisconsin.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "WI",
        "city": "Sussex",
        "zipcode": "53089-3995",
        "website": "http://www.quad.com",
        "market_cap": "Micro Cap"
    },
    "QUAD": {
        "short_name": "Quad Graphics, Inc",
        "long_name": "Quad/Graphics, Inc.",
        "summary": "Quad/Graphics, Inc. provides marketing solutions worldwide. The company operates in United States Print and Related Services, and International segments. It offers printing services, such as retail inserts, publications, catalogs, special interest publications, journals, direct mail, directories, in-store marketing and promotion, packaging, newspapers, custom print products, and other commercial and specialty printed products; and paper procurement services. The company also provides marketing and other services, including consumer insights, audience targeting, personalization, media planning and placement, process optimization, campaign planning and creation, pre-media production, videography, photography, digital and print execution, and logistics, as well as manufactures ink. It serves blue chip companies that operate in various industries; and businesses and consumers comprising retailers, publishers, and direct marketers. The company was founded in 1971 and is headquartered in Sussex, Wisconsin.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "WI",
        "city": "Sussex",
        "zipcode": "53089-3995",
        "website": "http://www.quad.com",
        "market_cap": "Micro Cap"
    },
    "REPO": {
        "short_name": "NATIONAL ASSET RECOVERY CORP",
        "long_name": "National Asset Recovery Corp.",
        "summary": "National Asset Recovery Corp. does not have significant operations. The company intends to evaluate various business opportunities. Previously, it operated as a forwarding company for the repossession of motor vehicles, luxury assets, and heavy equipment. The company was formerly known as Nasus Consulting, Inc. and changed its name to National Asset Recovery Corp. in October 2010. National Asset Recovery Corp. was founded in 2000 and is based in Lake Mary, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Lake Mary",
        "zipcode": "32746",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "RIHT": {
        "short_name": "RIGHTSCORP INC",
        "long_name": "Rightscorp, Inc.",
        "summary": "Rightscorp, Inc. operates as a technology company that has a patent-pending proprietary method for collecting payments from illegal downloaders of copyrighted content through notifications sent to their Internet service providers (ISP's). The company's technology system monitors peer-to-peer file sharing networks and sends through email to ISP's notifications of copyright infringement by the ISPs' customers with date, time, copyright title, and other specific technology identifiers worldwide. It primarily serves copyright holders. The company was founded in 2010 and is headquartered in Santa Monica, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Monica",
        "zipcode": "90405",
        "website": "http://www.rightscorp.com",
        "market_cap": "Nano Cap"
    },
    "RRD": {
        "short_name": "R.R. Donnelley & Sons Company",
        "long_name": "R. R. Donnelley & Sons Company",
        "summary": "R.R. Donnelley & Sons Company, an integrated communications provider, enables organizations to create, manage, deliver, and optimize their multichannel marketing and business communications. Its Business Services segment offers commercial printing products and branded materials, including manuals, publications, brochures, business cards, flyers, post cards, posters, and promotional items; and packaging solutions comprising rigid boxes and in-box print materials for clients in the consumer electronics, healthcare and life sciences, cosmetics, and consumer packaged goods industries. It also provides customer billings, financial statements, healthcare communications, and insurance document statement printing services; and distribution, shipping, healthcare, durable goods, promotional, and consumer product goods packaging labels. In addition, this segment offers workflow design, assembly, configuration, kitting, and fulfillment services for clients in the consumer electronics, telecommunications, life sciences, cosmetics, education, and industrial industries. Further, it provides invoices, order, and business forms that support the private and public sectors; and outsourcing services, such as creative services, research and analytics, financial management, and other services for legal providers, insurance, telecommunications, utilities, retail, and financial services companies. The company's Marketing Solutions segment offers direct marketing, such as audience segmentation, creative development, program testing, print production, postal optimization, and performance analytics for large-scale personalized direct mail programs; and in-store marketing, digital print, kitting, fulfillment, digital, and creative solutions and list services. It operates in the United States, Asia, Europe, and internationally. The company was founded in 1864 and is headquartered in Chicago, Illinois.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Chicago",
        "zipcode": "60601",
        "website": "http://www.rrd.com",
        "market_cap": "Small Cap"
    },
    "SFIN": {
        "short_name": "SAFETEX INTERNATIONAL INC",
        "long_name": "Safetek International, Inc.",
        "summary": "Safetek International, Inc., through its subsidiaries, manufactures and distributes organic green cleaning products for families, pets, and employees in the United States. The company's offers household products, such as laundry detergents, cleaners, diapers, etc.; and personal care items that comprise hair care products, cosmetics, and toothpastes. It also provides Bio+Green Crystals that are nutraceutical, hypoallergenic, and cleaning products for people suffering from allergies, sensitive skin, asthma, and other respiratory conditions; BioDfence, a range of formulated topical skin protectant products for athletes; Handsan that is a nutraceutical sanitizer product for children and pets; eco-friendly cleaners that reduces carbon footprint in the supply chain; and EcoSafe cleaning and non-PVC food film products. Safetek International, Inc. is based in Boca Raton, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Boca Raton",
        "zipcode": "33487",
        "website": "http://www.SafetekInternational.com",
        "market_cap": "Nano Cap"
    },
    "SFRX": {
        "short_name": "SEAFARER EXPLORATION CORP",
        "long_name": "Seafarer Exploration Corp.",
        "summary": "Seafarer Exploration Corp. intends to engage in the archaeological research, archaeologically-sensitive exploration, and recovery and conservation of historic shipwrecks. It also focuses on the archival research and translation of historical documents from archives and repositories worldwide. The company was incorporated in 2003 and is headquartered in Tampa, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Tampa",
        "zipcode": "33618",
        "website": "http://seafarerexplorationcorp.com",
        "market_cap": "Nano Cap"
    },
    "SGRP": {
        "short_name": "SPAR Group, Inc.",
        "long_name": "SPAR Group, Inc.",
        "summary": "SPAR Group, Inc., together with its subsidiaries, provides merchandising and marketing services worldwide. The company offers syndicated services, such as implementing category and product resets; maintaining planogram integrity and compliant; replenishment and rotation of products on shelves; implementing new item cut-ins that are approved for distribution; setting endcap displays and promotional items in prominent sales positions; ensuring product shelf tags and accurate pricing are in place; point of purchase and signage installation; managing product inventory details including low and out-of-stocks, returns, and reordering; compliance and price audits. It also provides dedicated services, including syndicated services, as well as new store set-up, store remodel, and fixture installation services for a specific retailer or manufacturer. In addition, the company offers project services comprising specific in-store services initiated by retailers and manufacturers, such as new store openings, new product launches, special seasonal or promotional merchandising, focused product support, product recalls, and in-store product demonstration and sampling, as well as performs kiosk product replenishment, inventory control, new store sets and existing store resets, re-merchandising, remodels and category implementation, and under annual or stand-alone project contracts or agreements. Further, it provides retail new store openings and remodeling, assembly, in-store event staffing, retail compliance and price audit, and other marketing services. The company serves mass merchandisers; pharmacies; grocery, office supply, dollar, automotive, convenience, specialty, electronic, and home improvement stores; and other retail outlets. SPAR Group, Inc. was founded in 1967 and is headquartered in Auburn Hills, Michigan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "MI",
        "city": "Auburn Hills",
        "zipcode": "48326",
        "website": "http://www.sparinc.com",
        "market_cap": "Nano Cap"
    },
    "SP": {
        "short_name": "SP Plus Corporation",
        "long_name": "SP Plus Corporation",
        "summary": "SP Plus Corporation provides parking management, ground transportation, baggage, and other ancillary services in North America. The company operates through Commercial, Aviation, and Other segments. It provides on-site parking management, event logistics, baggage handling, remote airline check-in, security, and municipal meter revenue collection and enforcement services. The company also offers shuttle bus vehicles and drivers; ground transportation services; delivery of delayed luggage and baggage handling services; wheelchair assist services; baggage repair and replacement services; on-street parking meter collection and other forms of parking enforcement services; and valet services. In addition, it provides facility maintenance services, including power sweeping and washing, painting and general repairs, and cleaning and seasonal services; security services comprising training and hiring of security officers and patrol, as well as customized services and technology; and an online and mobile app consumer platform through parking.com website. Further, the company provides multi-platform marketing services, including SP+ branded websites that offer clients a platform for marketing their facilities, mobile apps, search marketing, email marketing, and social media campaigns. The company offers its services primarily under the SP+, Sphere, and Bags brands. It serves private and public owners, municipalities and governments, managers and developers of office buildings, residential properties, commercial properties, shopping centers and other retail properties, sports and special event complexes, hotels and resorts, healthcare facilities and medical centers, airlines, and cruise lines. The company was formerly known as Standard Parking Corporation and changed its name to SP Plus Corporation in December 2013. SP Plus Corporation was founded in 1929 and is based in Chicago, Illinois.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Chicago",
        "zipcode": "60601-7702",
        "website": "http://www.spplus.com",
        "market_cap": "Small Cap"
    },
    "SRT": {
        "short_name": "StarTek, Inc.",
        "long_name": "StarTek, Inc.",
        "summary": "StarTek, Inc., a business process outsourcing company, provides omni-channel customer experience, digital transformation, and technology services in various markets. The company primarily offers customer engagement, omnichannel engagement, social media, customer intelligence analytics, work from home, back office, and receivables management services under the Startek and Aegis brands. It also offers Startek cloud, a hybrid omni-cloud platform integrated with AI capabilities. The company serves telecommunications, e-commerce and consumer, media and cable, financial and business services, travel and hospitality, healthcare and education, technology, and energy and utility industries in the Americas, the Middle East, Malaysia, India, Sri Lanka, Argentina, Peru, and internationally. StarTek, Inc. was founded in 1987 and is based in Greenwood Village, Colorado.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Greenwood Village",
        "zipcode": "80111",
        "website": "http://www.startek.com",
        "market_cap": "Small Cap"
    },
    "SSRC": {
        "short_name": "SENTISEARCH INC",
        "long_name": "Sentisearch, Inc.",
        "summary": "SentiSearch, Inc., a development stage company, holds a license to develop, manufacture, have made, import, use, sell, distribute, rent, or lease products and services in the areas of insect chemosensation and olfaction. It also has patent applications relating to nucleic acids and proteins of insect or odorant receptor genes and their uses. The company was founded in 2000 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10065",
        "website": "http://www.sentisearch.com",
        "market_cap": "Nano Cap"
    },
    "SVAD": {
        "short_name": "SILVERTON ADVENTURES INC",
        "long_name": "Silverton Adventures, Inc.",
        "summary": "Silverton Adventures, Inc. provides printing and mailing services to companies in the United States. Its print and mail services include business cards, carbonless forms, catalog/booklets, flyers, posters, graphic designs, automated presorts, brochures, copying, envelopes, letterheads, postcards, presentation folders, and inserts and addresses. The company also operates as a marketing, production, and distribution company that focuses on the production, acquisition, sale, and distribution of family oriented, inspirational, and children's DVDs and programs; and licensing media content to the television broadcast markets, as well as to the educational, school, and public library markets in the United States and internationally. The company was formerly known as Mor Travel, Inc. and changed its name to Silverton Adventures, Inc. in December 2007. Silverton Adventures, Inc. was incorporated in 2006 and is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89118",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "T9C.F": {
        "short_name": "TEAM INC.  DL-,30",
        "long_name": "Team, Inc.",
        "summary": "Team, Inc., together with its subsidiaries, provides asset performance assurance and optimization solutions in the United States, Canada, Europe, and internationally. It operates through three segments: Inspection and Heat Treating (IHT), Mechanical Services (MS), and Quest Integrity. The IHT segment offers non-destructive evaluation and testing, radiographic testing, ultrasonic testing, magnetic particle inspection, liquid penetrant inspection, positive material identification, electromagnetic testing, alternating current field measurement, and eddy current testing services. This segment also provides long-range guided ultrasonic testing, phased array ultrasonic testing, terminals and storage inspection and management program, rope access, mechanical and pipeline integrity, and field heat treating services. The MS segment offers engineered composite repair, emissions control/compliance, hot tapping, valve insertion, field machining, bolted joint integrity, vapor barrier plug and weld testing, and valve management services, as well as leak repair services for pipes, valves, and flanges, as well as other parts of piping systems, pipelines, and related assets. The Quest Integrity segment provides furnace tube inspection system-enabled, in-line inspection, pipeline integrity management, engineering and condition assessment, and robotics and inspection services. The company serves refining, power, renewables, nuclear, liquefied natural gas, chemical, petrochemical, pulp and paper, automotive, mining, valves, terminals and storage, pipeline, offshore oil and gas, and aerospace and defense industries, as well as amusement parks, bridges, ports, construction and buildings, roads, dams, and railways. Team, Inc. was founded in 1973 and is headquartered in Sugar Land, Texas.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Sugar Land",
        "zipcode": "77478",
        "website": "http://www.teaminc.com",
        "market_cap": "Micro Cap"
    },
    "TEKI": {
        "short_name": "TEK DIGITEL CORP",
        "long_name": "Tek Digitel Corp.",
        "summary": "Tek Digitel Corp. develops equipment that converts analog voice data to a digital format suitable for network transmission using standard Internet Protocols (IP). Its equipment, known as gateway, consists of proprietary computer hardware and software that connects a standard telephone to the Internet or other digital network. The company's Voice over IP (VoIP) technology allows users to transmit all of their voice and fax communications using the Internet, instead of the conventional telephone network. Tek Digitel Corp. focuses on developing customer premise equipment located at the home or office. It targets its products to telecommunications companies that base their telecommunications structure on the Internet by offering Internet connectivity and VoIP as their primary solutions. The company's VoIP gateway devices and V-ServerÂ® product line offers services, including local and long-distance voice connectivity; voice features, such as voice mail, unified messaging, and fax transmission, as well as basic Internet data access for multiple users at a single site. The V-Server products are designed for use with a variety of Internet access services, including Integrated Services Digital Networks, Wireless telephones, Digital Subscriber Loops, and Cable modem delivery. The company has also developed personal computer client and server-based provision/management tools to allow the gateway devices to be configured and managed to support the interconnection of users across public Internet or private corporate intranets. The company was formerly known as ATC Group L.L.C. and changed its name to Tek Digitel Corp. in July, 1998. The company is based in Germantown, Maryland.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MD",
        "city": "Germantown",
        "zipcode": "20874",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "TFZI": {
        "short_name": "FIGHT ZONE INC",
        "long_name": "The Fight Zone, Inc.",
        "summary": "The Fight Zone, Inc. develops and markets global positioning system (GPS) stereo camera products for applications in insurance, emergency management, and first response markets. The company was formerly known as GeoScopix, Inc. and changed its name to The Fight Zone, Inc. in October 2006. The company was founded in 1995 and is based in Addison, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Addison",
        "zipcode": "75001",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "TISI": {
        "short_name": "Team, Inc.",
        "long_name": "Team, Inc.",
        "summary": "Team, Inc., together with its subsidiaries, provides asset performance assurance and optimization solutions in the United States, Canada, Europe, and internationally. It operates through three segments: Inspection and Heat Treating (IHT), Mechanical Services (MS), and Quest Integrity. The IHT segment offers non-destructive evaluation and testing, radiographic testing, ultrasonic testing, magnetic particle inspection, liquid penetrant inspection, positive material identification, electromagnetic testing, alternating current field measurement, and eddy current testing services. This segment also provides long-range guided ultrasonic testing, phased array ultrasonic testing, terminals and storage inspection and management program, rope access, mechanical and pipeline integrity, and field heat treating services. The MS segment offers engineered composite repair, emissions control/compliance, hot tapping, valve insertion, field machining, bolted joint integrity, vapor barrier plug and weld testing, and valve management services, as well as leak repair services for pipes, valves, and flanges, as well as other parts of piping systems, pipelines, and related assets. The Quest Integrity segment provides furnace tube inspection system-enabled, in-line inspection, pipeline integrity management, engineering and condition assessment, and robotics and inspection services. The company serves refining, power, renewables, nuclear, liquefied natural gas, chemical, petrochemical, pulp and paper, automotive, mining, valves, terminals and storage, pipeline, offshore oil and gas, and aerospace and defense industries, as well as amusement parks, bridges, ports, construction and buildings, roads, dams, and railways. Team, Inc. was founded in 1973 and is headquartered in Sugar Land, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Sugar Land",
        "zipcode": "77478",
        "website": "http://www.teaminc.com",
        "market_cap": "Micro Cap"
    },
    "TS8A.F": {
        "short_name": "DLH HOLDINGS CORP.DL-,001",
        "long_name": "DLH Holdings Corp.",
        "summary": "DLH Holdings Corp. provides healthcare and social services in the United States. It offers defense and veterans' health solutions, including case management, physical and behavioral health examinations, and medical administration and logistics services. The company also provides a range of human services and solutions, which consists of monitoring and evaluation, electronic medical records migration, data collection and management, and nutritional and social health assessments; and IT system architecture design, migration plan, and ongoing maintenance services. In addition, it offers public health and life sciences services, such as clinical trials, epidemiology studies, and disease prevention; and health promotion to underserved and hard to reach at-risk communities through development of strategic communication campaigns, research on emerging trends, health informatics analyses, and application of best practices. The company offers its services to government agencies and other government clients. The company was formerly known as TeamStaff, Inc. and changed its name to DLH Holdings Corp. in June 2012. DLH Holdings Corp. was incorporated in 1969 and is headquartered in Atlanta, Georgia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30305",
        "website": "http://www.dlhcorp.com",
        "market_cap": "Micro Cap"
    },
    "U1N.F": {
        "short_name": "UNIFIRST CORP.  DL-,10",
        "long_name": "UniFirst Corporation",
        "summary": "UniFirst Corporation provides workplace uniforms and protective work wear clothing in the United States, Europe, and Canada. The company operates through U.S. and Canadian Rental and Cleaning, Manufacturing, Specialty Garments Rental and Cleaning, and First Aid segments. It designs, manufactures, personalizes, rents, cleans, delivers, and sells a range of uniforms and protective clothing, including shirts, pants, jackets, coveralls, lab coats, smocks, and aprons; and specialized protective wear, such as flame resistant and high visibility garments. The company also rents and sells industrial wiping products, floor mats, facility service products, and dry and wet mops; restroom and cleaning supplies comprising air fresheners, paper products, gloves, masks, sanitizers, and hand soaps; and other textile products. In addition, it provides first aid cabinet services and other safety supplies; decontaminates and cleans work clothes, and other items that is exposed to radioactive materials; and services special cleanroom protective wear and facilities. Further, it offers a range of garment service options, including full-service rental programs in which garments are cleaned and serviced; lease programs in which garments are cleaned and maintained by individual employees; and purchase programs to buy garments and related items directly. The company serves automobile service centers and dealers, delivery services, food and general merchandise retailers, food processors and service operations, light manufacturers, maintenance facilities, restaurants, service companies, soft and durable goods wholesalers, transportation companies, healthcare providers, government agencies, research and development laboratories, high technology companies, and utilities operating nuclear reactors, as well as others who require employee clothing for image, identification, protection, or utility purposes. UniFirst Corporation was founded in 1936 and is headquartered in Wilmington, Massachusetts.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MA",
        "city": "Wilmington",
        "zipcode": "01887",
        "website": "http://www.unifirst.com",
        "market_cap": "Mid Cap"
    },
    "UNDR": {
        "short_name": "UNDERSEA RECOVERY CORP",
        "long_name": "UnderSea Recovery Corporation",
        "summary": "UnderSea Recovery Corporation explores, locates, recovers, and sells shipwrecks, artifacts, and other cultural resources and objects of historical and archaeological interests. It researches and plans shipwreck salvages sites, discusses with various governments and professional consultants concerning potential shipwreck salvage sites, and develops technologies and forms capital. The company also provides engages in the sales and public exhibition of recovered items; and sales of intellectual property rights, including documentaries, television specials, merchandise, books, and educational programs. It explores and recovers products from 15th to 19th centuries in oceans and large lakes worldwide. UnderSea Recovery Corporation was formerly known as Legal Access Technologies, Inc. and changed its name to UnderSea Recovery Corporation in July 2010. The company is based in Atlanta, Georgia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30342",
        "website": "http://www.undersearecovery.com",
        "market_cap": "Nano Cap"
    },
    "UNF": {
        "short_name": "Unifirst Corporation",
        "long_name": "UniFirst Corporation",
        "summary": "UniFirst Corporation provides workplace uniforms and protective work wear clothing in the United States, Europe, and Canada. The company operates through U.S. and Canadian Rental and Cleaning, Manufacturing, Specialty Garments Rental and Cleaning, and First Aid segments. It designs, manufactures, personalizes, rents, cleans, delivers, and sells a range of uniforms and protective clothing, including shirts, pants, jackets, coveralls, lab coats, smocks, and aprons; and specialized protective wear, such as flame resistant and high visibility garments. The company also rents and sells industrial wiping products, floor mats, facility service products, and dry and wet mops; restroom and cleaning supplies comprising air fresheners, paper products, gloves, masks, sanitizers, and hand soaps; and other textile products. In addition, it provides first aid cabinet services and other safety supplies; decontaminates and cleans work clothes, and other items that is exposed to radioactive materials; and services special cleanroom protective wear and facilities. Further, it offers a range of garment service options, including full-service rental programs in which garments are cleaned and serviced; lease programs in which garments are cleaned and maintained by individual employees; and purchase programs to buy garments and related items directly. The company serves automobile service centers and dealers, delivery services, food and general merchandise retailers, food processors and service operations, light manufacturers, maintenance facilities, restaurants, service companies, soft and durable goods wholesalers, transportation companies, healthcare providers, government agencies, research and development laboratories, high technology companies, and utilities operating nuclear reactors, as well as others who require employee clothing for image, identification, protection, or utility purposes. UniFirst Corporation was founded in 1936 and is headquartered in Wilmington, Massachusetts.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MA",
        "city": "Wilmington",
        "zipcode": "01887",
        "website": "http://www.unifirst.com",
        "market_cap": "Mid Cap"
    },
    "VOYT": {
        "short_name": "VOYANT INTL CORPORATION",
        "long_name": "Voyant International Corp.",
        "summary": "Voyant International Corp., through its subsidiaries, designs and delivers software technology to accelerate and manage large data transfers over IP networks. Its primary product families include RocketStream data transfer technology, which provides file transfer acceleration, automation, and security functions for market verticals, such as oil and gas, mining, entertainment, legal, financial services, military, and medical; and RocketConnect, a software-based product designed to accelerate data traversing between a telephone switching center and consumer's premises or mobile devices. The company also intends to provide an array of network-based products and services while airborne, including Internet access, email, PDA access, and advertising and multimedia content. In addition, it is developing remotely configurable, broadband radios that operate in the white space portion of the spectrum between VHF and UHF television stations. The company was formerly known as Zeros & Ones, Inc. and changed its name to Voyant International Corp. in April 2007. Voyant International Corp. is based in Hollywood, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Hollywood",
        "zipcode": "90046",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "VVI": {
        "short_name": "Viad Corp",
        "long_name": "Viad Corp.",
        "summary": "Viad Corp operates as an experiential services company in the United States, Canada, the United Kingdom, continental Europe, the United Arab Emirates, and Iceland. It operates through three segments: GES North America, GES EMEA, and Pursuit. The company offers event accommodation solutions, including researching and selection of local hotels, negotiating and contracting, room block management, group reservation management, rate integrity and monitoring, marketing, on-site, and post-event reporting; and registration and data analytics comprising registration and ticketing, lead management, reporting and analytics, web-based enterprise-wide application, and software-as-a-service model or partial and fully managed options. It also provides event management tools, such as online ordering capabilities, sponsorship management solutions, content management systems, and live event tracking; and audio-visual, including video production, lighting design, digital studio, entertainment and talent coordination, projection mapping, and computer rental and support services. In addition, the company offers a collection of experiences in recreational attractions, unique hotels and lodges, food and beverage, retail, sightseeing, and ground transportation services. It serves event organizers and corporate brand marketers. Viad Corp was founded in 1926 and is headquartered in Phoenix, Arizona.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85004-4565",
        "website": "http://www.viad.com",
        "market_cap": "Small Cap"
    },
    "WHLM": {
        "short_name": "Wilhelmina International, Inc.",
        "long_name": "Wilhelmina International, Inc.",
        "summary": "Wilhelmina International, Inc. primarily engages in the fashion model management business. It specializes in the representation and management of models, entertainers, athletes, and other talent to various clients, including retailers, designers, advertising agencies, print and electronic media and catalog companies. The company offers fashion modeling talent and social media influencer services to clients, such as advertising agencies, branded consumer goods companies, fashion designers, Internet sites, retailers, department stores, product catalogs, and magazine publications. It is also involved in the licensing of the Wilhelmina name to third-parties, such as fashion model agencies; television syndication royalties and production series contracts; and celebrity management activities. The company has operations in Los Angeles, Miami, Chicago, and London, as well as a network of licensees in various local markets in the United States and internationally. Wilhelmina International, Inc. was founded in 1967 and is headquartered in Dallas, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75201",
        "website": "http://www.wilhelmina.com",
        "market_cap": "Nano Cap"
    },
    "XC4.F": {
        "short_name": "CBIZ INC.  DL-,01",
        "long_name": "CBIZ, Inc.",
        "summary": "CBIZ, Inc. provides financial, insurance, and advisory services in the United States and Canada. The company operates through three segments: Financial Services, Benefits and Insurance Services, and National Practices. The Financial Services segment offers accounting and tax, government healthcare consulting, financial advisory, valuation, and risk and advisory services. The Benefits and Insurance Services provides group health benefits consulting, payroll, property and casualty, and retirement plan services. The National Practices segment offers managed networking and hardware, and health care consulting services. It primarily serves small and medium-sized businesses, as well as individuals, governmental entities, and not-for-profit enterprises. The company was founded in 1987 and is headquartered in Cleveland, Ohio.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OH",
        "city": "Cleveland",
        "zipcode": "44131",
        "website": "http://www.cbiz.com",
        "market_cap": "Small Cap"
    },
    "XCPL": {
        "short_name": "XCPCNL BUSINESS SERVICES CORP",
        "long_name": "XCPCNL Business Services Corporation",
        "summary": "Vital Products, Inc. operates as a business-to-business supplier of compatible printer ribbons. It also offers remanufactured and compatible laser and inkjet cartridges. The company was incorporated in 2005 and is headquartered in Laguna Woods, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Laguna Woods",
        "zipcode": "92637",
        "website": "http://www.vitalproductsinc.com",
        "market_cap": "Nano Cap"
    },
    "ZHDM": {
        "short_name": "ZHONG HUI DAO MING COPPER HLDG ",
        "long_name": "Zhong Hui Dao Ming Copper Holding Ltd.",
        "summary": "Zhong Hui Dao Ming Copper Holding Ltd. provides various financial services in China and internationally. It offers financial advisory, investment and financing, private investment management, and other financial services to the financial service industry. The company is based in Carson City, Nevada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Carson City",
        "zipcode": "89703",
        "website": null,
        "market_cap": null
    },
    "ZUUS": {
        "short_name": "ZEUUS INC",
        "long_name": "Zeuus, Inc.",
        "summary": "Zeuus, Inc. operates as a data centric company. It is involved in building and operating of data centers; development of data content and Web applications; and cyber security and green energy businesses. The company was incorporated in 2016 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10001",
        "website": "http://zeuus.com",
        "market_cap": "Small Cap"
    }
}