{
    "RSGA.MX": {
        "short_name": "REPUBLIC SERVICES INC",
        "long_name": "Republic Services, Inc.",
        "summary": "Republic Services, Inc., together with its subsidiaries, provides non-hazardous solid waste collection, transfer, disposal, recycling, and environmental services in the United States. The company serves small-container, large-container, and municipal and residential customers. The company's collection services include curbside collection of waste for transport to transfer stations, landfills, or recycling processing centers; supply of waste containers; and renting of compactors. It is also involved in the processing and sale of old corrugated containers, old newsprint, aluminum, glass, and other materials; temporary waste and recycling collection services; and provision of landfill services. As of December 31, 2019, the company operated through 340 collection operations, 212 transfer stations, 189 active landfills, 79 recycling processing centers, and 15 salt water disposal wells, as well as 7 treatment, recovery, and disposal facilities in 41 states and Puerto Rico. It also operated 75 landfill gas-to-energy and renewable energy projects and had 130 closed landfills. The company was founded in 1996 and is headquartered in Phoenix, Arizona.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Waste Management",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Phoenix"
    },
    "SCPJ": {
        "short_name": "SCOPE INDUSTRIES",
        "long_name": "Scope Industries",
        "summary": "Scope Industries offers waste material recycling services in the United States. It operates plants for the collection and processing of bakery waste materials into a food supplement for animals. The company sells this food supplement to poultry farms, dairies, feed lots, and pet food manufacturers. Scope Industries also owns and operates a plant in Vernon, California, where certain bakery waste material is processed and converted into edible breadcrumbs for human consumption. The company's customers include prepackaged and restaurant supply food processors. Scope Industries was organized in 1938 and its principal executive offices are located in Santa Monica, California. Scope Industries sold all of the outstanding shares of its wholly owned subsidiary, Scope Beauty Enterprises, Inc., doing business as Marinello Schools of Beauty, to B & H Education, Inc. in March 2004.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Santa Monica"
    },
    "SENR": {
        "short_name": "STRATEGIC ENVIROMENTAL & ENERGY",
        "long_name": "Strategic Environmental & Energy Resources, Inc.",
        "summary": "Strategic Environmental & Energy Resources, Inc. provides environmental, clean-technologies, and related services in the United States and internationally. The company operates through three segments: Industrial Cleaning, Environmental Solutions, and Solid Waste. It offers general industrial cleaning and waste management services to various industry sectors. The company also designs and sells H2SPlus and OdorFilter dry scrubber system solutions for management of hydrogen sulfide in biogas, landfill gas, and petroleum processing operations; and develops waste destruction technology using pyrolytic heating process combined with non-thermal plasma assisted oxidation. In addition, it develops renewable natural gas projects; and chemical absorbents and catalysts that enhance the capability of biogas produced from landfill, wastewater treatment, and agricultural digester operations. The company serves companies primarily in the oil and gas refineries, landfills, medical waste destruction operations, agricultural companies, and food and beverage companies, as well as other commercial and industrial customers. Strategic Environmental & Energy Resources, Inc. is headquartered in Broomfield, Colorado. Strategic Environmental & Energy Resources, Inc. is a subsidiary of New Stratus Energy Inc.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Broomfield"
    },
    "SMED": {
        "short_name": "Sharps Compliance Corp.",
        "long_name": "Sharps Compliance Corp.",
        "summary": "Sharps Compliance Corp. provides medical, pharmaceutical, and hazardous waste management services in the United States. It offers Sharps Recovery System for the containment, transportation, treatment, and tracking of medical waste generated outside the hospital and health care facility settings; TakeAway Recovery System to treat used needles, syringes, and other used healthcare products; Route-Based Pickup Service, a medical and hazardous waste pick-up services; and MedSafe, a solution for the safe collection, transportation, and disposal of unwanted and expired ultimate-user medications. The company also provides TakeAway Medication Recovery System that facilitates the proper disposal of unused medications; Black Pail Program for Rx, a solution with minimal segregation for the disposal of various pharmaceuticals; Inhaler Disposal to collect, transport, and destroy used pharmaceutical inhalers; Hazardous Drug Spill Control Kit for the cleanup of chemotherapy and other HD spills; TakeAway Recycle System for the collection and recycling of single-use medical devices from surgical centers and other healthcare facilities; ComplianceTRAC, a Web-based compliance and training program; and Universal Waste Shipback Systems to collect, transport, and recycle light bulbs, batteries, and other mercury containing devices. In addition, it offers other solutions, such as TakeAway Environmental Return System, SharpsTracer, Sharps Secure, Needle Disposal System, Complete Needle Collection and Disposal System, Pitch-It IV Poles, Asset Return System, and Spill Kit Recovery System, as well as Sharps MWMS, a medical waste management system. The company serves customers in home health care, retail clinics and immunizing pharmacies, pharmaceutical manufacturers, professional offices, assisted living and long-term care facilities, and government agencies, as well as distributors. Sharps Compliance Corp. was founded in 1992 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "SRCL": {
        "short_name": "Stericycle, Inc.",
        "long_name": "Stericycle, Inc.",
        "summary": "Stericycle, Inc., together with its subsidiaries, provides regulated and compliance solutions to the healthcare, retail, and commercial businesses in the United States, Europe, and internationally. It operates through three segments: North America RWCS; International RWCS; and Domestic Communication and Related Services. It collects and processes regulated and specialized waste for disposal services; and collects personal and confidential information for secure destruction, recall/return, and communication services. The company's services also include medical waste disposal, pharmaceutical waste disposal, hazardous waste management, sustainability solutions for expired or unused inventory, secure information destruction of documents and e-media, and compliance services; and regulated recall and returns management communication, logistics, and data management services for expired, withdrawn, or recalled products. In addition, it offers compliance programs under the Steri-Safe, Clinical Services, First Practice Management, SeguriMed, and EnviroAssure brand names. The company serves healthcare businesses, including hospitals, physician and dental practices, outpatient clinics, long-term care facilities, etc.; retailers and manufacturers; financial and professional service providers; governmental entities; and other businesses. Stericycle, Inc. was founded in 1989 and is headquartered in Bannockburn, Illinois.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Bannockburn"
    },
    "SUNC": {
        "short_name": "SUNCAST SOLAR ENERGY INC",
        "long_name": "Suncast Solar Energy, Inc.",
        "summary": "Suncast Solar Energy, Inc., through its subsidiary, Environmental Testing Laboratories, Inc., provides environmental testing services in the northeast United States. The company's services include resource conservation recovery act and hazardous waste characterization, toxic characteristic leaching procedure analyses, underground storage tank analytical assessment, landfill/ground water monitoring, and pesticide and herbicide testing in soil and groundwater services. Its services also comprise national pollution discharge elimination system effluent characteristics analysis, PCB (polychlorinated biphenyls) and PCB congener analysis, HUD lead abatement testing, fingerprint categorization, petroleum analyses, client specific deliverables, and electronic data deliverables. The company was formerly known as Paradise Music & Entertainment, Inc. and changed its name to Suncast Solar Energy, Inc. in December 2011. Suncast Solar Energy, Inc. was founded in 1984 and is based in Denver, Colorado.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Denver"
    },
    "TEXC": {
        "short_name": "TEXCOM INC",
        "long_name": "TexCom, Inc.",
        "summary": "Texcom, Inc. provides environmental services to the oil and gas industry in the U.S. Gulf Region. It disposes non-hazardous oilfield wastes and naturally occurring radioactive materials generated from the exploration and production of oil and natural gas. The company was founded in 2003 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "TRTI": {
        "short_name": "TRANSTECH INDUSTRIES",
        "long_name": "Transtech Industries, Inc.",
        "summary": "Transtech Industries, Inc., through its subsidiaries, generates electricity utilizing methane gas and provides environmental services. It supervises and performs landfill monitoring and closure procedures; manages methane gas recovery operations; and provides a range of construction, remedial, and maintenance services at landfills, commercial, and industrial sites. The company also provides clay or synthetic, erosion control, and vegetation landfill caps services; and methane control services, such as turnkey methane recovery systems, electrical generating, flaring, well installation, and migration testing and monitoring. In addition, it offers water treatment services, such as collection systems and pre-treatment facilities; ground water services, including well installation, monitoring, and chain of custody; and surface water services that include downshoots, gabions, berms, and retention basins. Further, the company provides electrical instrumentation, property maintenance, land clearing, earth moving, excavation, and equipment rental services; use of recyclable materials as substitutes for conventional fill and drainage layers; and turnkey contaminated soil abatement programs. Transtech Industries, Inc. was formerly known as Scientific, Inc. The company was incorporated in 1965 and is based in Sewell, New Jersey.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Sewell"
    },
    "UVSS": {
        "short_name": "UNIVERSAL SYSTEM INC WASHINGTON",
        "long_name": "Universal Systems, Inc.",
        "summary": "Universal Systems, Inc. provides turn-key water treatment services to the oil industry. The company specializes in slop oil and coal bed methane produced water. Its services include slop oil separation into oil; BTEX separation from liquid; conversion of heavy metal ions to metal oxides for easy disposal; separation of coal bed methane water into stream quality water and solids; production and fracturing of water clean up for safe disposal; silica removal for boiler steam stimulation of the oil field; and separation of suspended solids from water for reuse. Universal Systems, Inc. was incorporated in 1997 and is based in Baker City, Oregon.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Baker City"
    },
    "UWS.F": {
        "short_name": "WASTE MANAGEMENT (DEL.)",
        "long_name": "Waste Management, Inc.",
        "summary": "Waste Management, Inc., through its subsidiaries, provides waste management environmental services to residential, commercial, industrial, and municipal customers in North America. It offers collection services, including picking up and transporting waste and recyclable materials from where it was generated to a transfer station, material recovery facility (MRF), or disposal site; and owns, develops, and operates landfill gas-to-energy facilities in the United States, as well as owns and operates transfer stations. As of December 31, 2019, the company owned or operated 244 solid waste landfills; 5 secure hazardous waste landfills; 103 MRFs; and 302 transfer stations. It also provides materials processing and commodities recycling services; recycling brokerage services, such as managing the marketing of recyclable materials for third parties; and other strategic business solutions. In addition, the company offers construction and remediation services; services related with the disposal of fly ash, and residue generated from the combustion of coal and other fuel stocks; in-plant services comprising full-service waste management solutions and consulting services; and specialized disposal services for oil and gas exploration and production operations. Further, it offers fluorescent bulb and universal waste mail-back services through LampTracker program; portable restroom services under the Port-o-Let name; and street and parking lot sweeping services, as well as holds interests in oil and gas producing properties. The company was formerly known as USA Waste Services, Inc. and changed its name to Waste Management, Inc. in 1998. Waste Management, Inc. was incorporated in 1987 and is based in Houston, Texas.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Houston"
    },
    "VVIT": {
        "short_name": "VISTA INTERNATIONAL TECHNOLOGIE",
        "long_name": "Vista International Technologies, Inc.",
        "summary": "Vista International Technologies, Inc. engages in developing, commercializing, and operating renewable energy and waste-to-energy technologies and projects. The company utilizes and offers its Thermal Gasifier technology, a horizontal multi-stage gasification system that converts residential, industrial, and commercial waste, biomass, waste tires, and other solid hydrocarbon-based material into clean thermal and electrical energy. It is also involved in the processing, storage, and transportation of scrap tires. In addition, the company produces tire shreds for landfill for use as leachate material and as sanitary landfill cover, as well as for gas wells; and tire derived fuel for use as fuel for cement kilns, paper mills, or other heat intensive processes. Further, it produces a steel wire product as a byproduct of the tire shredding process. The company's customers include generators and tire transporters. Vista International Technologies, Inc. is headquartered in Commerce City, Colorado.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Commerce City"
    },
    "WA3.F": {
        "short_name": "CASELLA WASTE SYS A DL-01",
        "long_name": "Casella Waste Systems, Inc.",
        "summary": "Casella Waste Systems, Inc., together with its subsidiaries, operates as a vertically-integrated solid waste services company in the northeastern United States. The company operates through Eastern Region, Western Region, Recycling, and Other segments. It offers resource management services primarily in the areas of solid waste collection and disposal, transfer, recycling, and organics services to residential, commercial, municipal, and industrial customers. The company provides a range of non-hazardous solid waste services, including collections, transfer stations, material recovery facilities, and disposal facilities. It also markets recyclable metals, aluminum, plastics, and paper and corrugated cardboard that are processed at its facilities, as well as recyclables purchased from third parties. In addition, the company is involved in commodity brokerage operations. As of January 31, 2020, it owned and/or operated 43 solid waste collection operations, 58 transfer stations, 20 recycling facilities, 8 Subtitle D landfills, 4 landfill gas-to-energy facilities, and 1 landfill permitted to accept construction and demolition materials. The company was founded in 1975 and is headquartered in Rutland, Vermont.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Rutland"
    },
    "WCN": {
        "short_name": "Waste Connections, Inc.",
        "long_name": "Waste Connections, Inc.",
        "summary": "Waste Connections, Inc. provides waste collection, transfer, disposal, and recycling services in the United States and Canada. The company operates through six segments: Southern, Western, Eastern, Canada, Central, and Exploration and Production (E&P). It offers collection services to residential, commercial, municipal, industrial, and E&P customers; landfill disposal services; and recycling services for various recyclable materials, including compost, cardboard, mixed paper, plastic containers, glass bottles, and ferrous and aluminum metals. The company also owns and operates transfer stations that receive compact and/or load waste to be transported to landfills or treatment facilities through truck, rail, or barge; and intermodal services for the rail haul movement of cargo and solid waste containers in the Pacific Northwest through a network of intermodal facilities. In addition, it provides E&P waste treatment, recovery, and disposal services for waste resulting from oil and natural gas exploration and production activity, such as drilling fluids, drill cuttings, completion fluids, and flowback water; production wastes and produced water during a well's operating life; contaminated soils that require treatment during site reclamation; and substances, which require clean-up after a spill, reserve pit clean-up, or pipeline rupture. Further, the company offers container and chassis sales and leasing services to its customers. As of December 31, 2019, it owned or operated a network of 300 solid waste collection operations; 124 transfer stations; 60 municipal solid waste (MSW) landfills; 12 E&P waste landfills; 14 non-MSW landfills; 66 recycling operations; 4 intermodal operations; 23 E&P liquid waste injection wells; and 19 E&P waste treatment and oil recovery facilities. It also operated an additional 51 transfer stations, 10 MSW landfills, and 2 intermodal operations. Waste Connections, Inc. was founded in 1997 and is based in Vaughan, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": null
    },
    "WCN.TO": {
        "short_name": "WASTE CONNECTIONS INC",
        "long_name": "Waste Connections, Inc.",
        "summary": "Waste Connections, Inc. provides waste collection, transfer, disposal, and recycling services in the United States and Canada. The company operates through six segments: Southern, Western, Eastern, Canada, Central, and Exploration and Production (E&P). It offers collection services to residential, commercial, municipal, industrial, and E&P customers; landfill disposal services; and recycling services for various recyclable materials, including compost, cardboard, mixed paper, plastic containers, glass bottles, and ferrous and aluminum metals. The company also owns and operates transfer stations that receive compact and/or load waste to be transported to landfills or treatment facilities through truck, rail, or barge; and intermodal services for the rail haul movement of cargo and solid waste containers in the Pacific Northwest through a network of intermodal facilities. In addition, it provides E&P waste treatment, recovery, and disposal services for waste resulting from oil and natural gas exploration and production activity, such as drilling fluids, drill cuttings, completion fluids, and flowback water; production wastes and produced water during a well's operating life; contaminated soils that require treatment during site reclamation; and substances, which require clean-up after a spill, reserve pit clean-up, or pipeline rupture. Further, the company offers container and chassis sales and leasing services to its customers. As of December 31, 2019, it owned or operated a network of 300 solid waste collection operations; 124 transfer stations; 60 municipal solid waste (MSW) landfills; 12 E&P waste landfills; 14 non-MSW landfills; 66 recycling operations; 4 intermodal operations; 23 E&P liquid waste injection wells; and 19 E&P waste treatment and oil recovery facilities. It also operated an additional 51 transfer stations, 10 MSW landfills, and 2 intermodal operations. Waste Connections, Inc. was founded in 1997 and is based in Vaughan, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "United States",
        "city": null
    },
    "WM": {
        "short_name": "Waste Management, Inc.",
        "long_name": "Waste Management, Inc.",
        "summary": "Waste Management, Inc., through its subsidiaries, provides waste management environmental services to residential, commercial, industrial, and municipal customers in North America. It offers collection services, including picking up and transporting waste and recyclable materials from where it was generated to a transfer station, material recovery facility (MRF), or disposal site; and owns, develops, and operates landfill gas-to-energy facilities in the United States, as well as owns and operates transfer stations. As of December 31, 2019, the company owned or operated 244 solid waste landfills; 5 secure hazardous waste landfills; 103 MRFs; and 302 transfer stations. It also provides materials processing and commodities recycling services; recycling brokerage services, such as managing the marketing of recyclable materials for third parties; and other strategic business solutions. In addition, the company offers construction and remediation services; services related with the disposal of fly ash, and residue generated from the combustion of coal and other fuel stocks; in-plant services comprising full-service waste management solutions and consulting services; and specialized disposal services for oil and gas exploration and production operations. Further, it offers fluorescent bulb and universal waste mail-back services through LampTracker program; portable restroom services under the Port-o-Let name; and street and parking lot sweeping services, as well as holds interests in oil and gas producing properties. The company was formerly known as USA Waste Services, Inc. and changed its name to Waste Management, Inc. in 1998. Waste Management, Inc. was incorporated in 1987 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "ZSC.SG": {
        "short_name": "Sharps Compliance Corp. Registe",
        "long_name": "Sharps Compliance Corp.",
        "summary": "Sharps Compliance Corp. provides medical, pharmaceutical, and hazardous waste management services in the United States. It offers Sharps Recovery System for the containment, transportation, treatment, and tracking of medical waste generated outside the hospital and health care facility settings; TakeAway Recovery System to treat used needles, syringes, and other used healthcare products; Route-Based Pickup Service, a medical and hazardous waste pick-up services; and MedSafe, a solution for the safe collection, transportation, and disposal of unwanted and expired ultimate-user medications. The company also provides TakeAway Medication Recovery System that facilitates the proper disposal of unused medications; Black Pail Program for Rx, a solution with minimal segregation for the disposal of various pharmaceuticals; Inhaler Disposal to collect, transport, and destroy used pharmaceutical inhalers; Hazardous Drug Spill Control Kit for the cleanup of chemotherapy and other HD spills; TakeAway Recycle System for the collection and recycling of single-use medical devices from surgical centers and other healthcare facilities; ComplianceTRAC, a Web-based compliance and training program; and Universal Waste Shipback Systems to collect, transport, and recycle light bulbs, batteries, and other mercury containing devices. In addition, it offers other solutions, such as TakeAway Environmental Return System, SharpsTracer, Sharps Secure, Needle Disposal System, Complete Needle Collection and Disposal System, Pitch-It IV Poles, Asset Return System, and Spill Kit Recovery System, as well as Sharps MWMS, a medical waste management system. The company serves customers in home health care, retail clinics and immunizing pharmacies, pharmaceutical manufacturers, professional offices, assisted living and long-term care facilities, and government agencies, as well as distributors. Sharps Compliance Corp. was founded in 1992 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United States",
        "city": "Houston"
    }
}