{
    "1CV.SG": {
        "short_name": "Civmec Ltd. Registered Shares o",
        "long_name": "Civmec Limited",
        "summary": "Civmec Limited, an investment holding company, provides construction and engineering services to the oil and gas, metals and minerals, infrastructure, and marine and defense. It undertakes fabrication projects, such as structural steel, plate works, tanks, vessels, materials handling equipment, subsea and offshore structures, and pipe spooling services. The company also offers modularization services; shipbuilding services; site civil works, including earthworks, reinforcing steel works, formworks, concrete placement, backfill and compaction to final handover, and underground services; and reinforced concrete products comprising prestressed beams, parapets, structural foundations, caissons, floor slabs and retaining walls, suspended slab sections, purpose-built facilities, breakwater systems, fascia and noise wall panels, conventional reinforced girders, transfloor panels, tunnel segments, and bridge beams. In addition, the company undertakes structural, mechanical, piping, and electrical instrumentation projects consisting of structural assembly and erection, mechanical installations and alignments, piping installation and pre-commissioning support, site welding, tanks, and equipment; and provides electrical and instrumentation solutions, such as electrical infrastructure works, including substations, switch rooms, switchyards, and site reticulation, as well as electrical maintenance services. Further, it offers industrial insulation services, including sheet metal and light gauge fabrication, fireproofing, surface treatment, site installation, and processing and forming technology; integrated supply chain solutions to the onshore and offshore drilling industry; maintenance; access solutions, such as scaffolds, fabricated platforms, rope access, and tension netting systems; and executes refractory projects. Civmec Limited was founded in 2009 and is headquartered in Perth, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Australia",
        "city": "Perth"
    },
    "1IP.F": {
        "short_name": "IPH LTD",
        "long_name": "IPH Limited",
        "summary": "IPH Limited, together with its subsidiaries, provides intellectual property (IP) services and products worldwide. The company operates in three segments: Intellectual Property Services Australia & New Zealand, Intellectual Property Services Asia, and Adjacent Businesses. It offers IP services related to the provision of filing, prosecution, enforcement, and management of patents, designs, trademarks, and other IP; and develops and provides IP data and analytics software under the subscription license model. The company is also provides patent attorney and lawyers services. It serves Fortune Global 500 companies, multinationals, public sector research organizations, SMEs, and professional services firms. IPH Limited was founded in 1887 and is based in Sydney, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "1Q0.F": {
        "short_name": "QANTM INTELL. PROP. O.N.",
        "long_name": "QANTM Intellectual Property Limited",
        "summary": "QANTM Intellectual Property Limited provides intellectual property services for start-up technology businesses, multinationals, public research institutions, and universities in Australia, New Zealand and Asia. The company also offers services related to patents, designs, and trademarks, as well as DCC, a litigation service in patent and trademark protection. QANTM Intellectual Property Limited was founded in 1877 and is based in Melbourne, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "24X.F": {
        "short_name": "LIVEHIRE LIMITED O.N.",
        "long_name": "LiveHire Limited",
        "summary": "LiveHire Limited provides online talent acquisition software solutions to enterprises in Australia. It operates LiveHire, a talent acquisition and engagement platform for recruitment process, such as sourcing, engaging, hiring, analyzing, and integrating, as well as for internal mobility and outplacement. The company was founded in 2011 and is based in Melbourne, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "2BE.AX": {
        "short_name": "TUBI FPO",
        "long_name": "Tubi Limited",
        "summary": "Tubi Limited, together with its subsidiaries, manufactures and sells high density polyethylene (HDPE) pipes in Australia, the United States, and New Zealand. Its products include mobile modular extrusions, HDPEs, large bore reeling, stringing, HDPE 40bars, and corrugated pipes. The company's products are used in irrigation, mining, shale gas and LNG, water infrastructure, pipe relining, and power sectors. Tubi Limited was founded in 1972 and is based in Paddington, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Paddington"
    },
    "2RF.F": {
        "short_name": "REDFLOW LTD",
        "long_name": "RedFlow Limited",
        "summary": "RedFlow Limited develops, manufactures, and sells zinc-bromine flowing electrolyte battery modules (ZBMs) worldwide. The company offers ZBM2, an energy storage system with 10 kilowatt-hours (kWh) capacity; and ZCell, a home and office energy storage system with 10kWh of sustainable energy storage. Its batteries are used in telecommunications, commercial and industrial, grid-scale, and residential applications. RedFlow Limited was founded in 2005 and is headquartered in Brisbane, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Brisbane"
    },
    "3DA.AX": {
        "short_name": "AMAEROINT FPO",
        "long_name": "Amaero International Ltd",
        "summary": "Amaero International Ltd manufactures various large format complex components in metal using laser based additive manufacturing processes. It also provides research and development, contract manufacturing, tooling specialists, equipment sales and consumables, and training and maintenance services. It serves the aviation defence and space sectors, as well as the tool and die industries. Amaero International Ltd has a strategic partnership agreement with the University of Adelaide to develop additive manufacturing in South Australia. The company was founded in 2013 and is headquartered in Notting Hill, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Notting Hill"
    },
    "3MF.AX": {
        "short_name": "3DMETALFL FPO",
        "long_name": "3D Metalforge Limited",
        "summary": "3D Metalforge Limited provides metal additive manufacturing solutions worldwide. It offers in-house metal printing services, including design and engineering, material advisory, diagnostics and testing, printing, and post-production services. The company was founded in 2012 and is based in West Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "West Perth"
    },
    "3NR.F": {
        "short_name": "NRW HOLDINGS LTD",
        "long_name": "NRW Holdings Limited",
        "summary": "NRW Holdings Limited, through its subsidiaries, provides civil and mining contracting, urban development, and drilling and blasting services in Australia. It operates through four business segments: Civil, Mining, Drill and Blast, and Mining Technologies. The Civil segment delivers private and public civil infrastructure, mine development, bulk earthworks, and commercial and residential subdivision projects. Its civil construction projects include roads, bridges, tailings storage facilities, rail formations, ports, water infrastructure, and concrete installations. The Mining segment engages in the mine management, contract mining, load and haul, dragline, and coal handling preparation plant operations; maintenance activities; and fabrication of water and service vehicles. The Drill and Blast segment offers integrated and end to end production drill and blast services to the mining and civil construction sectors. The Mining Technologies segment provides materials handling, facility maintenance, and shutdown services; supplies mining technologies. The company also provides heat treatment services, as well as mining equipment solutions. NRW Holdings Limited was founded in 1994 and is based in Perth, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Perth"
    },
    "4MH.F": {
        "short_name": "VYSARN LTD",
        "long_name": "Vysarn Limited",
        "summary": "Vysarn Limited, through its subsidiary, Pentium Hydro Pty Ltd, engages in the hydrogeological and dewatering drilling business in Australia. The company was formerly known as MHM Metals Limited and changed its name to Vysarn Limited in December 2017. Vysarn Limited was incorporated in 2007 and is based in West Perth, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "West Perth"
    },
    "4SU.F": {
        "short_name": "SAUNDERS INTL LTD",
        "long_name": "Saunders International Limited",
        "summary": "Saunders International Limited engages in the design, construction, and maintenance of steel bulk liquid storage facilities, tanks, and road and rail bridges in Australia. The company also manufactures precast concrete products for transport infrastructure projects; and provides a range of specialized services for the maintenance of commercial, industrial, and marine infrastructure and assets. In addition, it engages in the engineering, procurement, and construction of fuel and chemical storage terminals, bridges and marine structures, precast concrete, concrete foundation works for heavy industry, foundation systems, jetty and wharves construction, building and construction management, water reservoirs, and pumping stations, as well as coal bins, hoppers, and associated steel works. Further, the company provides various asset services comprising refinery and industrial services, shutdowns and refurbishment, furnace and boiler maintenance, pressure welding, air heater overhauls and upgrades, general base line maintenance, pumps and steam valve overhaul, high performance coatings and linings, abrasive blasting and protective coatings, and structural strengthening services, as well as services for fabrication, genera, structural, piping, and pressure equipment. Saunders International Limited was founded in 1951 and is based in Rhodes, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Rhodes"
    },
    "59Y.F": {
        "short_name": "ACROW FORMW.+CONSTR.S.LTD",
        "long_name": "Acrow Formwork and Construction Services Limited",
        "summary": "Acrow Formwork and Construction Services Limited operates as a formwork and scaffolding company in Australia. It is involved in the rental of formwork equipment, including wall forming panel systems; soffit forming systems, including Acrowform aluminium panels; GASS table forms; super cuplok; and conventional systems; and scaffold equipment comprising cuplok scaffolding, super cuplok scaffolding, surelock scaffolding, and Acrowskaf scaffolding products. It offers hire and sales solutions to residential, commercial, civil, and industrial customers. The company was formerly known as NMG Corporation Limited and changed its name to Acrow Formwork and Construction Services Limited. The company was founded in 1936 and is based in Sydney, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "5GJ.SI": {
        "short_name": "AusGroup",
        "long_name": "AusGroup Limited",
        "summary": "AusGroup Limited, an investment holding company, provides a range of integrated service solutions to the energy, resources, industrial, utilities, and port and marine sectors in Australia and South East Asia. The company's Projects segment provides construction services, including structural, mechanical, and piping; painting, insulation, and fireproofing; and engineering, procurement, and construction services. Its Access Services segment offers scaffolding, engineering and design, labor supply and stock control, logistics, transportation, and rope services. The company's Fabrication and Manufacturing segment provides turnkey solutions to the oil and gas sector, including exploration, construction, commissioning, operation, maintenance and repair, and decommissioning in various phases of the asset lifecycle. Its Maintenance Services segment offers preventative and breakdown maintenance services, as well as shut down services and sustaining capital works. The company's Port & Marine Services segment offers logistics and marine transportation support services to the oil and gas industry, as well as general marine and defense sectors. AusGroup Limited was founded in 1988 and is headquartered in West Perth, Australia.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Australia",
        "city": "West Perth"
    },
    "8MP.F": {
        "short_name": "MONADELPHOUS GROUP LTD.",
        "long_name": "Monadelphous Group Limited",
        "summary": "Monadelphous Group Limited, an engineering group, provides construction, maintenance, and industrial services to the resources, energy, and infrastructure sectors in Australia, New Zealand, Chile, Mongolia, and internationally. It operates through Engineering Construction, and Maintenance and Industrial Services divisions. the company offers fabrication, modularisation, offsite pre-assembly, procurement, and installation of structural steel, tankage, mechanical and process equipment, piping, demolition, and remediation works; multi-disciplined construction services; plant commissioning; electrical and instrumentation services; engineering, procurement, and construction services; and front-end scoping, shutdown planning, management, and execution services. It also provides water and waste water asset construction and maintenance; irrigation services; construction of transmission pipelines and facilities; operation and maintenance of power and water assets; heavy lift and specialist transport; access solutions; dewatering services; corrosion management services; specialist coatings; and rail track and rolling stock maintenance services, as well as turnkey design and construction, heavy lift and crane, and civil and electrical disciplines services. Monadelphous Group Limited was founded in 1972 and is headquartered in Perth, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Perth"
    },
    "A3D.AX": {
        "short_name": "AURORALABS FPO",
        "long_name": "Aurora Labs Limited",
        "summary": "Aurora Labs Limited engages in the design, development, and commercialization of 3D metal printers, powders, and digital parts and its related intellectual property. The company produces the S-Titanium Pro; and develops industrial grade, high speed, and large format 3D metal printers, as well as powder manufacturing and control software used for industrial manufacturing. It also develops certification processes for parts to be used in marine, oil and gas and renewables applications, and others. The company operates in Australia, Europe, Canada, South America, the United States, and East Asia. Aurora Labs Limited was incorporated in 2014 and is based in Canning Vale, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Canning Vale"
    },
    "ACF.AX": {
        "short_name": "ACROW FPO",
        "long_name": "Acrow Formwork and Construction Services Limited",
        "summary": "Acrow Formwork and Construction Services Limited operates as a formwork and scaffolding company in Australia. It is involved in the rental of formwork equipment, including wall forming panel systems; soffit forming systems, including Acrowform aluminium panels; GASS table forms; super cuplok; and conventional systems; and scaffold equipment comprising cuplok scaffolding, super cuplok scaffolding, surelock scaffolding, and Acrowskaf scaffolding products. It offers hire and sales solutions to residential, commercial, civil, and industrial customers. The company was formerly known as NMG Corporation Limited and changed its name to Acrow Formwork and Construction Services Limited. The company was founded in 1936 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "AD1.AX": {
        "short_name": "AD1 HOLD FPO",
        "long_name": "AD1 Holdings Limited",
        "summary": "AD1 Holdings Limited provides software services and technology platforms. The company provides an online platform that links employers and job candidates directly to live job opportunities on employer websites in Australia. It also offers utilities software and managed services. The company was formerly known as ApplyDirect Limited and changed its name to AD1 Holdings Limited in December 2019. AD1 Holdings Limited was incorporated in 2006 and is based in Hawthorn, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Hawthorn"
    },
    "AEI.AX": {
        "short_name": "AERIS ENV FPO",
        "long_name": "Aeris Environmental Ltd",
        "summary": "Aeris Environmental Ltd engages in the research, development, and commercialization of proprietary technologies in Australia and internationally. It provides HVAC/R hygiene and remediation technology; and energy efficiency services. The company also offers indoor surface clean and treatment solutions; heavy duty cleaning, treatments, and odour control technologies for the HVAC/R, remediation and restoration, and facilities maintenance industries; bioactive filter treatment and pan tablets; corrosion protection solutions; duct treatment to prevent colonization by mould and bacteria; and hood coating for commercial kitchen range hoods. In addition, it provides ice machine/dairy and beverages cleaners and sanitizers; and cooling tower cleaners. The company is headquartered in Rosebery, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Rosebery"
    },
    "AL3.AX": {
        "short_name": "AML3D FPO",
        "long_name": "AML3D Limited",
        "summary": "AML3D Limited provides contract manufacturing services to the aerospace, marine, defense, oil and gas, mining, and general manufacturing sectors in Australia, Singapore, Japan, and Europe. It produces metal components and structures through automated wire-fed 3D printing technology. AML3D Limited was founded in 2014 and is headquartered in Edinburgh, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Edinburgh"
    },
    "ALQ.AX": {
        "short_name": "ALS FPO",
        "long_name": "ALS Limited",
        "summary": "ALS Limited provides analytical testing services in Australia, Asia/Pacific, Europe, the Middle East, North Africa, and internationally. The company operates through three segments: Commodities, Life Sciences, and Industrial. The Commodities segment offers assaying and testing services for the mining and mineral exploration companies in geochemistry, metallurgy, inspection, and coal quality areas. Its testing and consulting services cover the resource life cycle, including exploration, feasibility, optimization, production, design, development, trade, and rehabilitation. This segment also provides coal sampling, analysis and certification, formation evaluation, and related analytical testing services. The Life Sciences segment offers analytical testing and sampling, and remote monitoring services for the environmental, food, pharmaceutical, and consumer products markets; and microbiological, physical, and chemical testing services. This segment also provides analytical testing data to assist consulting and engineering firms, industries, and governments. The Industrial segment offers diagnostic testing and engineering solutions for the energy, resources, transportation, and infrastructure sectors. This segment serves asset owners, operators, constructors, and equipment manufacturers in the power, petrochemical, mining, minerals processing, water, infrastructure, and transportation industries. The company was formerly known as Campbell Brothers Limited and changed its name to ALS Limited in August 2012. ALS Limited was founded in 1863 and is headquartered in Brisbane, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Brisbane"
    },
    "ALX.AX": {
        "short_name": "ATLSRTERIA FPOSFORUS",
        "long_name": "Atlas Arteria Limited",
        "summary": "Atlas Arteria Limited owns, develops, and operates toll roads. It holds a 13.4% interest in 22-kilometer toll road investors partnership II (TRIP II), the concessionaire for Dulles Greenway toll road located in Virginia, the United States. The company was formerly known as Macquarie Atlas Roads Limited and changed its name to Atlas Arteria Limited in May 2018. Atlas Arteria Limited was incorporated in 2009 and is based in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Infrastructure Operations",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "ANG.AX": {
        "short_name": "AUSTIN ENG FPO",
        "long_name": "Austin Engineering Limited",
        "summary": "Austin Engineering Limited, together with its subsidiaries, manufactures, repairs, overhauls, and supplies mining attachment products, and other associated products and services for the industrial and resources-related business sectors. It offers off-highway dump truck bodies, buckets, water tanks, tyre handlers, and other ancillary equipment. The company also provides on and off site repair and maintenance, condition monitoring, engineering, product improvements, heavy equipment lifting and transport, specialized fabrication, blasting and painting, line boring and machining, and CNC profile cutting and pressing services. It serves miners, mining contractors, and original equipment manufacturers in Asia-Pacific, North America, and South America. The company was founded in 1982 and is headquartered in Milton, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Milton"
    },
    "AQZ.AX": {
        "short_name": "AAVIATION FPO",
        "long_name": "Alliance Aviation Services Limited",
        "summary": "Alliance Aviation Services Limited provides aviation services to tourism, resources, mining, education, government, corporate, and sporting sectors in Australia and internationally. The company also offers specialized aviation services, including aircraft wet leasing, airport management, aircraft trading, parts sales, engine leasing, and engineering to other airlines and clients. As of June 30, 2020, it operated a fleet of 24 Fokker F100 and 13 Fokker 70LR jet aircraft; and 5 Fokker 50 turboprops. The company was founded in 2002 and is based in Brisbane, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Airlines",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Brisbane"
    },
    "ARA.AX": {
        "short_name": "ARIADNE FPO",
        "long_name": "Ariadne Australia Limited",
        "summary": "Ariadne Australia Limited operates as an investment company in Australia and New Zealand. It operates through Investments and Property segments. The company invests in securities, as well as provides financial services. It also owns and operates Orams Marine village located in Auckland, New Zealand. The company was incorporated in 1983 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Infrastructure Operations",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "ASB.AX": {
        "short_name": "AUSTAL LTD FPO",
        "long_name": "Austal Limited",
        "summary": "Austal Limited designs, manufactures, constructs, and supports defense and commercial vessels in North America, Europe, Australia, Asia, South and Central America, the Middle East, and Africa. The company designs, constructs, and supports passenger ferries, vehicle and passenger ferries, and offshore and windfarm vessels; naval and other defense vessels; and patrol boats for government law enforcement and border protection agencies. It also develops and integrates advanced vessel control and information management systems, including MARINELINK, an integrated monitoring, alarm, and control system for vessel systems; MARINELINK-Smart vessel management system that provides vessel support service; and MARINELINK-Fleet, an off-the-shelf system, which offers shore-sourced ship position, schedule, and weather data, as well as motion control interceptors. In addition, the company provides life capability management and vessel support services, such as crew training and instruction, vessel servicing, repair and maintenance, integrated logistics support, vessel sustainment, and information management systems support to naval, government, and commercial operators; and refit services and management of annual dockings. Austal Limited was founded in 1988 and is headquartered in Henderson, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Henderson"
    },
    "ASH.AX": {
        "short_name": "ASHLEYSERV FPO",
        "long_name": "Ashley Services Group Limited",
        "summary": "Ashley Services Group Limited provides labor hire, recruitment, and training services in Australia. It operates through two segments, Labor Hire and Training. The company offers white-collar recruitment services, including permanent, temporary, and contract placements through multi-specialist providers under the Blackadder brand name; and labor hire and workforce solutions under the Action Workforce and Concept Engineering brands. It also provides nationally accredited qualifications training and assessment services under the Ashley Institute of Training, Integracom, Australian Institute of Vocational Development, National Institute of Training, Tracmin, and Qualitas Education brands. The company was founded in 1968 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "AUTLF": {
        "short_name": "AUSTAL LIMITED",
        "long_name": "Austal Limited",
        "summary": "Austal Limited designs, manufactures, constructs, and supports defense and commercial vessels in North America, Europe, Australia, Asia, South and Central America, the Middle East, and Africa. The company designs, constructs, and supports passenger ferries, vehicle and passenger ferries, and offshore and windfarm vessels; naval and other defense vessels; and patrol boats for government law enforcement and border protection agencies. It also develops and integrates advanced vessel control and information management systems, including MARINELINK, an integrated monitoring, alarm, and control system for vessel systems; MARINELINK-Smart vessel management system that provides vessel support service; and MARINELINK-Fleet, an off-the-shelf system, which offers shore-sourced ship position, schedule, and weather data, as well as motion control interceptors. In addition, the company provides life capability management and vessel support services, such as crew training and instruction, vessel servicing, repair and maintenance, integrated logistics support, vessel sustainment, and information management systems support to naval, government, and commercial operators; and refit services and management of annual dockings. Austal Limited was founded in 1988 and is headquartered in Henderson, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Henderson"
    },
    "AVA.AX": {
        "short_name": "AVA RISK FPO",
        "long_name": "Ava Risk Group Limited",
        "summary": "Ava Risk Group Limited provides risk management services and technologies worldwide. The company operates through Perimeter Security, Access Control Solutions, and International Valuable Logistics segments. It manufactures and sells fiber optic intrusion detection and location systems that are used to detect and locate perimeter intrusion; for data network tapping and tampering, and oil and gas pipeline third party interference detection; and for other applications, including health, safety, and traffic monitoring. The company also provides smart card readers and card systems, biometric solutions, and electric locking and access control products. In addition, it offers international logistics services comprising armored vehicle collection and delivery, storage, commercial and chartered air and sea freight, and customs brokerage services for high-risk valuables, precious metals, and currency. Further, the company provides consultancy services in the areas of risk and vulnerability assessments; incident, emergency, and crisis management; designing, integration, and installation for CCTV, electronic intrusion detection and location, electronic, biometric, smart card, and mechanical access control systems; and cyber security and risk management solutions. Additionally, its consultancy services comprise business continuity planning, cash management strategies and day to day management plans, vendor and service provider assessments, technical tender management with site supervision, specialized security training and skills workshops, distribution and loss prevention plans, and secure transportation management. The company serves architects, commercial and industrial customers, military, and governments. The company has a strategic alliance with CMTE Development Ltd. The company was formerly known as Future Fibre Technologies Limited and changed its name to Ava Risk Group Limited in May 2018. Ava Risk Group Limited was founded in 1994 and is based in Mulgrave, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Mulgrave"
    },
    "AZJ.AX": {
        "short_name": "AURIZON FPO",
        "long_name": "Aurizon Holdings Limited",
        "summary": "Aurizon Holdings Limited, through its subsidiaries, operates as a rail freight operator in Australia. It operates through Network, Coal, Bulk, and Other segments. The company transports various commodities, including mining, agricultural, industrial, and retail products; and retail goods and groceries across small and big towns, and cities, as well as coal and iron ore. It also operates and manages the Central Queensland Coal Network that consists of 2,670 kilometers of track network; and provides various specialist services, such as rail design, engineering, construction, management, and maintenance, as well as supply chain solutions. In addition, the company transports bulk rail freight services for miners, primary producers, and the manufacturing industry. Further, it is involved in the general freight business. The company was formerly known as QR National Limited and changed its name to Aurizon Holdings Limited in December 2012. Aurizon Holdings Limited was incorporated in 2010 and is headquartered in Fortitude Valley, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Fortitude Valley"
    },
    "BI6.F": {
        "short_name": "BINGO INDUSTRIES LTD",
        "long_name": "Bingo Industries Limited",
        "summary": "Bingo Industries Limited, together with its subsidiaries, provides waste management solutions for domestic and commercial businesses in Australia. It operates through three segments: Collections, Post Collections, and Other. It collects and transports building, demolition, industrial, and commercial waste from customers to post collection facilities; and provides bins on hire. The company also diverts waste from landfill by sorting and processing mixed waste received from customers to be reused, recycled, or sent to other facilities for further processing; and manufactures and supplies bins. It operates through a network of 10 facilities in New South Wales (NSW) and 4 facilities in Victoria; and truck fleet of approximately 330 trucks in NSW and Victoria. Bingo Industries Limited was incorporated in 2017 and is headquartered in Auburn, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Auburn"
    },
    "BIN.AX": {
        "short_name": "BINGO IND FPO",
        "long_name": "Bingo Industries Limited",
        "summary": "Bingo Industries Limited, together with its subsidiaries, provides waste management solutions for domestic and commercial businesses in Australia. It operates through three segments: Collections, Post Collections, and Other. It collects and transports building, demolition, industrial, and commercial waste from customers to post collection facilities; and provides bins on hire. The company also diverts waste from landfill by sorting and processing mixed waste received from customers to be reused, recycled, or sent to other facilities for further processing; and manufactures and supplies bins. It operates through a network of 10 facilities in New South Wales (NSW) and 4 facilities in Victoria; and truck fleet of approximately 330 trucks in NSW and Victoria. Bingo Industries Limited was incorporated in 2017 and is headquartered in Auburn, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Auburn"
    },
    "BMBLF": {
        "short_name": "BRAMBLES LTD",
        "long_name": "Brambles Limited",
        "summary": "Brambles Limited operates as a supply-chain logistics company. The company operates through CHEP North America and Latin America; CHEP Europe, Middle East, Africa and India; and CHEP Australia, New Zealand and Asia, excluding India segments. It engages in the pooling of unit-load equipment and associated services, focusing on the outsourced management of pallets, crates, and containers. The company serves customers in the fast-moving consumer goods, fresh produce, beverage, retail, and general manufacturing industries in the Americas, Europe, Australia, and internationally. Brambles Limited was founded in 1875 and is based in Sydney, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "BOL.AX": {
        "short_name": "BOOM FPO",
        "long_name": "Boom Logistics Limited",
        "summary": "Boom Logistics Limited provides lifting solutions and specialized labor services to mining and resources, wind, energy and utilities, infrastructure and construction, industrial maintenance, and telecommunication sectors in Australia. The company operates in two segments, Lifting Solutions and Labour Hire. It offers mobile and crawler cranes for wet and dry hire with short term or long term hire facilities; travel towers and access equipment, and associated services; and project management services. The company also provides special hydraulic mobile cranes and low profile prime movers; access equipment, including boom lifts, knuckle booms, elevated work platforms, and travel towers. In addition, it offers heavy haulage vehicles to transport heavy and large equipment, as well as managed lifting solutions and engineering services. Further, the company provides skilled labors for a wide range of trades, such as electricians, boiler makers, mechanics, traditional crane and travel tower operators, riggers, and truck drivers. Its fleet comprises approximately 250 cranes and 100 travel towers. The company was formerly known as The Australian Crane Company and changed its name to Boom Logistics Limited in October 2003. Boom Logistics Limited was incorporated in 2000 and is based in Southbank, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Southbank"
    },
    "BPP.AX": {
        "short_name": "BABYLONPU FPO",
        "long_name": "Babylon Pump & Power Limited",
        "summary": "Babylon Pump & Power Limited focuses on rental of specialty diesel driven pumping and power generation equipment in Australia. The company offers positive displacement pumps, multistage pumps, dewatering and fluid management, liquid and air filtrations, and compressed air dryers. It also offers rebuild and maintenance services for diesel engines and components. The company was formerly known as IM Medical Limited and changed its name to Babylon Pump & Power Limited in December 2017. Babylon Pump & Power Limited was incorporated in 1990 and is headquartered in Forrestfield, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Forrestfield"
    },
    "BSA.AX": {
        "short_name": "BSA AUST FPO",
        "long_name": "BSA Limited",
        "summary": "BSA Limited, together with its subsidiaries, operates as a technical services contracting company in Australia. It operates through BSA Communications & Utility Infrastructure, and BSA Advanced Property Solutions segments. The BSA Communications & Utility Infrastructure segment engages in the delivery of bundled services over fixed line multi-technology networks; and installation of subscription television and smart meters to the telecommunications, subscription television and utility industries. The BSA Advanced Property Solutions segment designs, installs, maintains, and optimizes building services for all hard assets in commercial and industrial buildings and properties, including fire detection and suppression, mechanical services, heating, ventilation, air conditioning, refrigeration, electrical, and building management systems. BSA Limited was incorporated in 1999 and is based in Macquarie Park, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Macquarie Park"
    },
    "BXB.AX": {
        "short_name": "BRAMB LTD FPO",
        "long_name": "Brambles Limited",
        "summary": "Brambles Limited operates as a supply-chain logistics company. The company operates through CHEP North America and Latin America; CHEP Europe, Middle East, Africa and India; and CHEP Australia, New Zealand and Asia, excluding India segments. It engages in the pooling of unit-load equipment and associated services, focusing on the outsourced management of pallets, crates, and containers. The company serves customers in the fast-moving consumer goods, fresh produce, beverage, retail, and general manufacturing industries in the Americas, Europe, Australia, and internationally. Brambles Limited was founded in 1875 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "BXBLY": {
        "short_name": "BRAMBLES LTD",
        "long_name": "Brambles Limited",
        "summary": "Brambles Limited operates as a supply-chain logistics company. The company operates through CHEP North America and Latin America; CHEP Europe, Middle East, Africa and India; and CHEP Australia, New Zealand and Asia, excluding India segments. It engages in the pooling of unit-load equipment and associated services, focusing on the outsourced management of pallets, crates, and containers. The company serves customers in the fast-moving consumer goods, fresh produce, beverage, retail, and general manufacturing industries in the Americas, Europe, Australia, and internationally. Brambles Limited was founded in 1875 and is based in Sydney, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "CDD.AX": {
        "short_name": "CARDNO FPO",
        "long_name": "Cardno Limited",
        "summary": "Cardno Limited, a professional infrastructure and environmental services company, engages in the development and improvement of physical and social infrastructure for communities worldwide. The company's Asia Pacific Engineering and Environmental segment provides services in civil, structural, water, environmental, coastal, bridge, geotechnical, subsurface utility, traffic, and transport engineering, as well as environmental science, surveying, landscape architecture, planning, and asset management. Its Americas Engineering and Environmental segment offers environmental, water, transportation, energy and resources, land, buildings, and management services to private and public sector clients. The company's International Development segment designs and implements large-scale sustainable solutions for development assistance agencies and private clients. The company's Other segment engages in the engineering and consulting operations in Latin America. It serves defense, energy, government, industrial, international development, land management, mining and resources, property and buildings, transportation, utilities, and water sectors. Cardno Limited was founded in 1945 and is headquartered in Fortitude Valley, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Fortitude Valley"
    },
    "CIM.AX": {
        "short_name": "CIMIC FPO",
        "long_name": "CIMIC Group Limited",
        "summary": "CIMIC Group Limited provides construction, mining, mineral processing, engineering, and operation and maintenance services to the infrastructure, resource, and property markets. The company operates through Construction, Public Private Partnerships, Mining & Mineral Processing, Engineering, Services, and Commercial & Residential segments. It constructs various infrastructure projects, including roads, railways, tunnels, airports, buildings, social infrastructures, water, and energy and resources facilities. The company also offers design and construction of mine infrastructure, construction, operation and maintenance of processing facilities, topsoil stripping, drill and blast, excavation, processing, rehabilitation, and mine closure services. It has operations in Australia, Asia, the Middle East, the Americas, and Africa. The company was formerly known as Leighton Holdings Limited and changed its name to CIMIC Group Limited in April 2015. The company was founded in 1899 and is based in North Sydney, Australia. CIMIC Group Limited is a subsidiary of HOCHTIEF Australia Holdings Limited.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "North Sydney"
    },
    "CL8.AX": {
        "short_name": "CARLYHOLD FPO",
        "long_name": "Carly Holdings Limited",
        "summary": "Carly Holdings Limited, an online technology company, provides car subscription services for individuals and businesses in Australia and New Zealand. It operates Carly.co, a car subscription offering; and DriveMyCar.com.au, a peer-to-peer car rental service. The company was formerly known as Collaborate Corporation Limited and changed its name to Carly Holdings Limited in December 2020. Carly Holdings Limited was incorporated in 1994 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "CLH.AX": {
        "short_name": "COLL HOUSE FPO",
        "long_name": "Collection House Limited",
        "summary": "Collection House Limited provides debt collection services in Australia, New Zealand, and the Philippines. The company operates in two segments, Purchased Debt Ledgers and Collection Services. It offers debt collections services to clients in the Australasian financial services, insurance, public utility, credit, and government enterprise markets; and debt purchasing services for banking, finance, telecommunications, and energy sectors. The company also provides receivables management, repayment arrangement management, asset location recovery and sale, hardship management, legal and insolvency, credit management training, finance brokerage, and business process outsourcing services. Collection House Limited was incorporated in 1992 and is headquartered in Newstead, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Newstead"
    },
    "CLT.AX": {
        "short_name": "CELLNET FPO",
        "long_name": "Cellnet Group Limited",
        "summary": "Cellnet Group Limited engages in the distribution, warehousing, and logistics businesses primarily in Australia and New Zealand. The company sources and distributes brands of lifestyle technology products, including mobile phones, gaming, tablets, and notebooks/hybrid accessories through retail and business channels; and fulfillment services to the mobile telecommunications and retail industries. Cellnet Group Limited was founded in 1992 and is based in Brisbane, Australia. Cellnet Group Limited is a subsidiary of Wentronic Holding GmbH.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Brisbane"
    },
    "CLX.AX": {
        "short_name": "CTI LOGIST FPO",
        "long_name": "CTI Logistics Limited",
        "summary": "CTI Logistics Limited provides transport and logistics services in Australia. It operates through three segments: Transport, Logistics, and Property. The company offers transport services, such as courier, parcel distribution, taxi truck, fleet management, heavy haulage, line haul, and freight forwarding services. It also provides warehousing and distribution services, including contracted distribution center, overflow warehousing, temperature controlled storage, pick and pack, bulk product storage, external laydown area storage, stock control management, and quarantine inspection and processing services. In addition, the company offers temperature controlled storage, warehousing, and distribution services for wine, and food and health products; and logistical support services to the minerals and energy sector. Further, it provides security systems and services comprising electronic alarms, CCTVs, and access control systems for residential and commercial premises; and records management services consisting of document and archive storage, core sample storage, data and media storage, imaging and scanning, scheduled pickup and deliveries, and document destruction, as well as provides online access to reports and file activities. Additionally, the company offers shredding and recycling services; and wrapping services, including cleaning of plant and equipment, fumigation and spraying services, and sealed quarantine wrapping. The company is also involved in the rental of owner-occupied and investment properties. CTI Logistics Limited was founded in 1974 and is based in West Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "West Perth"
    },
    "COLDF": {
        "short_name": "CARDNO LIMITED",
        "long_name": "Cardno Limited",
        "summary": "Cardno Limited, a professional infrastructure and environmental services company, engages in the development and improvement of physical and social infrastructure for communities worldwide. The company's Asia Pacific Engineering and Environmental segment provides services in civil, structural, water, environmental, coastal, bridge, geotechnical, subsurface utility, traffic, and transport engineering, as well as environmental science, surveying, landscape architecture, planning, and asset management. Its Americas Engineering and Environmental segment offers environmental, water, transportation, energy and resources, land, buildings, and management services to private and public sector clients. The company's International Development segment designs and implements large-scale sustainable solutions for development assistance agencies and private clients. The company's Other segment engages in the engineering and consulting operations in Latin America. It serves defense, energy, government, industrial, international development, land management, mining and resources, property and buildings, transportation, utilities, and water sectors. Cardno Limited was founded in 1945 and is headquartered in Fortitude Valley, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Fortitude Valley"
    },
    "CP4.F": {
        "short_name": "ALS LTD",
        "long_name": "ALS Limited",
        "summary": "ALS Limited provides analytical testing services in Australia, Asia/Pacific, Europe, the Middle East, North Africa, and internationally. The company operates through three segments: Commodities, Life Sciences, and Industrial. The Commodities segment offers assaying and testing services for the mining and mineral exploration companies in geochemistry, metallurgy, inspection, and coal quality areas. Its testing and consulting services cover the resource life cycle, including exploration, feasibility, optimization, production, design, development, trade, and rehabilitation. This segment also provides coal sampling, analysis and certification, formation evaluation, and related analytical testing services. The Life Sciences segment offers analytical testing and sampling, and remote monitoring services for the environmental, food, pharmaceutical, and consumer products markets; and microbiological, physical, and chemical testing services. This segment also provides analytical testing data to assist consulting and engineering firms, industries, and governments. The Industrial segment offers diagnostic testing and engineering solutions for the energy, resources, transportation, and infrastructure sectors. This segment serves asset owners, operators, constructors, and equipment manufacturers in the power, petrochemical, mining, minerals processing, water, infrastructure, and transportation industries. The company was formerly known as Campbell Brothers Limited and changed its name to ALS Limited in August 2012. ALS Limited was founded in 1863 and is headquartered in Brisbane, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Brisbane"
    },
    "CRW.AX": {
        "short_name": "CASHREWARD FPO",
        "long_name": "Cashrewards Limited",
        "summary": "Cashrewards Limited, a cashback ecosystem, enables members to browse brands and cashback offers, and receive cashback on transactions by shopping online or in-store with participating merchant partners. The company operates Cashrewards app and Website, which enables members to browse, search, and click-through to merchant partners websites to make purchases and earn cashback; and Cashrewards Assistant, an Internet browser extension that alerts members of offers. It also provides debit or credit card-linked offers; and operates Partner Rewards Engine, a platform that enables Cashrewards to integrate with third-party partners. The company was founded in 2014 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "CUP.AX": {
        "short_name": "COUNTPLUS FPO",
        "long_name": "CountPlus Limited",
        "summary": "CountPlus Limited, together with its subsidiaries, provides accounting, business advisory, and financial planning services in Australia. The company operates through Accounting, Financial Planning, Financial Services, and Other segments. It offers tax, assurance, audit, and corporate advisory services; financial planning; loans commission, and leasing commission services; and information technology, legal, conference, and insurance services. The company was founded in 2006 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "CVL.AX": {
        "short_name": "CIVMEC CDI 1:1",
        "long_name": "Civmec Limited",
        "summary": "Civmec Limited, an investment holding company, provides construction and engineering services to the oil and gas, metals and minerals, infrastructure, and marine and defense. It undertakes fabrication projects, such as structural steel, plate works, tanks, vessels, materials handling equipment, subsea and offshore structures, and pipe spooling services. The company also offers modularization services; shipbuilding services; site civil works, including earthworks, reinforcing steel works, formworks, concrete placement, backfill and compaction to final handover, and underground services; and reinforced concrete products comprising prestressed beams, parapets, structural foundations, caissons, floor slabs and retaining walls, suspended slab sections, purpose-built facilities, breakwater systems, fascia and noise wall panels, conventional reinforced girders, transfloor panels, tunnel segments, and bridge beams. In addition, the company undertakes structural, mechanical, piping, and electrical instrumentation projects consisting of structural assembly and erection, mechanical installations and alignments, piping installation and pre-commissioning support, site welding, tanks, and equipment; and provides electrical and instrumentation solutions, such as electrical infrastructure works, including substations, switch rooms, switchyards, and site reticulation, as well as electrical maintenance services. Further, it offers industrial insulation services, including sheet metal and light gauge fabrication, fireproofing, surface treatment, site installation, and processing and forming technology; integrated supply chain solutions to the onshore and offshore drilling industry; maintenance; access solutions, such as scaffolds, fabricated platforms, rope access, and tension netting systems; and executes refractory projects. Civmec Limited was founded in 2009 and is headquartered in Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Perth"
    },
    "CWY.AX": {
        "short_name": "CLEANAWAY FPO",
        "long_name": "Cleanaway Waste Management Limited",
        "summary": "Cleanaway Waste Management Limited provides waste management, industrial, and environmental services in Australia. It operates through three segments: Solid Waste Services, Industrial & Waste Services, and Liquid Waste & Health Services. The company offers commercial and industrial, municipal, and residential collection services for various types of solid waste streams, including general waste, recyclables, construction, and demolition waste, as well as medical and washroom services. It is also involved in the ownership and management of waste transfer stations, resource recovery and recycling facilities, secure product destruction, quarantine treatment operations, and landfills; sale of recovered paper, cardboard, metals, and plastics; and collection, treatment, processing, and recycling of liquid and hazardous waste, including industrial waste, grease trap waste, oily waters, and used mineral and cooking oils in packaged and bulk forms. In addition, the company offers industrial solutions comprising industrial cleaning, vacuum tanker loading, site remediation, sludge management, parts washing, concrete remediation, CCTV, corrosion protection, and emergency response services. Further, it refines and recycles used mineral oils to produce fuel oils and base oils; generates and sells electricity produced utilizing landfill gas; and provides health and biohazardous waste, organic waste, e-waste recycling, industrial construction and cleaning, and equipment cleaning services, as well as spill kits. The company was formerly known as Transpacific Industries Group Ltd. and changed its name to Cleanaway Waste Management Limited in February 2016. Cleanaway Waste Management Limited was incorporated in 2002 and is headquartered in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "CYG.AX": {
        "short_name": "COVENTRY FPO",
        "long_name": "Coventry Group Ltd",
        "summary": "Coventry Group Ltd primarily distributes industrial products in Australia and New Zealand. It operates through Trade Distribution and Fluids Systems segments. The Trade Distribution segment imports, distributes, and markets industrial fasteners, stainless steel fasteners and hardware, construction fasteners, specialized fastener products and systems, and associated industrial tools and consumables. It also imports, distributes, and markets hardware, components, and finished products to the commercial cabinet making, joinery, and shop fitting industries. The Fluids Systems segment designs and installs lubrication systems; distributes hoses, connectors, fittings, and hydraulic hose assemblies; designs and supplies service truck components; installs fire suppression systems; designs and distributes fluid handling systems, as well as sells pneumatic components, and hydraulic associated products and consumables; and services and repairs rock hammers. Coventry Group Ltd was incorporated in 1936 and is headquartered in Thomastown, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Thomastown"
    },
    "DBI.AX": {
        "short_name": "DALRYMPLE STAPLED",
        "long_name": "Dalrymple Bay Infrastructure Limited",
        "summary": "Dalrymple Bay Infrastructure Limited operates metallurgical coal export terminal in Australia. It also provides port infrastructure and services. The company was incorporated in 2020 and is based in Brisbane, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Brisbane"
    },
    "DCG.AX": {
        "short_name": "DECMIL GRP FPO",
        "long_name": "Decmil Group Limited",
        "summary": "Decmil Group Limited, together with its subsidiaries, provides design, engineering, and construction works for infrastructure, resources, and renewable energy sectors primarily in Australia and New Zealand. The company operates through three segments: Construction and Engineering, Accommodation, and Other. It offers services for government infrastructure projects, such as accommodation, immigration facilities, corrections facilities, office buildings, defense facilities, schools, administration buildings, and storage facilities; road and bridge civil engineering projects; and passenger and freight rail projects, as well as designs and constructs fuel infrastructure facilities. The company also provides construction of remote non-process infrastructure, including industrial buildings, processing plants, workshops, and storage facilities; and coal seam gas and LNG wellhead installation with associated pipelines and facilities. In addition, it offers civil works on brown and greenfield projects, including site preparation, excavation and bulk earthworks in regional and remote areas. Decmil Group Limited was founded in 1978 and is based in Osborne Park, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Osborne Park"
    },
    "DDB.AX": {
        "short_name": "DDBLAST FPO",
        "long_name": "Dynamic Drill and Blast Holdings Limited",
        "summary": "Dynamic Drill and Blast Holdings Limited provides drilling and blasting services for mining and construction sectors in Western Australia. It offers drilling and blasting services to break rock for excavation; and ancillary services, such as blast hole, wall control, depressurization, and probe drilling, as well as mining and quarrying blasting, controlled blasting, and vibration and overpressure monitoring services. The company also provides equipment and labor hiring services. It operates a fleet of 13 drilling rigs. Dynamic Drill and Blast Holdings Limited was incorporated in 2020 and is headquartered in Wangara, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Wangara"
    },
    "DDT.AX": {
        "short_name": "DATADOT FPO",
        "long_name": "DataDot Technology Limited",
        "summary": "DataDot Technology Limited, together with its subsidiaries, provides asset identification, management, protection, and authentication products and solutions to governments, police, insurance companies, and blue-chip customer base within the automotive industry in Australasia, the Americas, Africa, and Europe. The company operates in two segments, DataDotDNA and DataTraceID. It manufactures and distributes asset identification systems, including DataDotDNA polymer and metallic microdots; asset registers, which are databases that record asset identification data and are accessible by law enforcement agencies and insurance investigators; and security DataTraceID authentication solutions. The company also provides theft deterrence solutions, such as ToolMate that protects tools, as well as deters thieves using the microdot identification technology; and PartMate, which protects stock by combining microdots with encoded serial numbers and a hidden tracer that can be viewed with a black-light. In addition, it offers authentication solutions for liability reduction, warranty claims, counterfeit detection, track and trace, grey market/diversion, supply chain management, enhanced packaging, retail loss prevention, credentials/ID cards, and document security. Additionally, the company offers DataDotDNA National Register, a law enforcement resource center that allows customers to verify the original owner of assets protected by DataDotDNA. It also operates as a re-seller of PadJack's range of network security products. The company sells its products through a network of distributors. DataDot Technology Limited was incorporated in 2000 and is based in Brookvale, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Brookvale"
    },
    "DEM.AX": {
        "short_name": "DEMEM LTD FPO",
        "long_name": "De.mem Limited",
        "summary": "De.mem Limited designs, builds, owns, and operates de-centralized water and waste water treatment systems for its customers in industrial, municipal, and residential sectors in Singapore, Australia, and Germany. The company offers disinfection systems, such as chlorination and ultraviolet systems; biological treatments that include aerobic and anaerobic treatments; chemical dosing systems and chemical treatments; membrane based water treatment systems, including microfiltration, ultrafiltration, hollow fiber nano filtration, reverse osmosis, membrane bioreactors, and hollow fire forward osmosis; and other specialized treatment processes, such as dissolved air filtration, media filtration, and ion exchange. It also provides programmable logic controller and automation tools; and sludge management services. In addition, the company offers potable water supply, sewage treatment, industrial waste water, recycling, desalination, and process water solutions. Further, it provides operation and maintenance of water or waste water treatment systems; consulting, engineering, and optimization services; and technical advisory services. The company serves mining, infrastructure, electronics, chemicals, oil and gas, and food and beverage industries. De.mem Limited was founded in 2013 and is based in South Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "DM2.F": {
        "short_name": "DE.MEM LTD O.N.",
        "long_name": "De.mem Limited",
        "summary": "De.mem Limited designs, builds, owns, and operates de-centralized water and waste water treatment systems for its customers in industrial, municipal, and residential sectors in Singapore, Australia, and Germany. The company offers disinfection systems, such as chlorination and ultraviolet systems; biological treatments that include aerobic and anaerobic treatments; chemical dosing systems and chemical treatments; membrane based water treatment systems, including microfiltration, ultrafiltration, hollow fiber nano filtration, reverse osmosis, membrane bioreactors, and hollow fire forward osmosis; and other specialized treatment processes, such as dissolved air filtration, media filtration, and ion exchange. It also provides programmable logic controller and automation tools; and sludge management services. In addition, the company offers potable water supply, sewage treatment, industrial waste water, recycling, desalination, and process water solutions. Further, it provides operation and maintenance of water or waste water treatment systems; consulting, engineering, and optimization services; and technical advisory services. The company serves mining, infrastructure, electronics, chemicals, oil and gas, and food and beverage industries. De.mem Limited was founded in 2013 and is based in South Melbourne, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "DNE.F": {
        "short_name": "DOWNER EDI",
        "long_name": "Downer EDI Limited",
        "summary": "Downer EDI Limited operates as an integrated services provider in Australia, New Zealand, the Asia-Pacific, South America, and Southern Africa. Its Transport segment provides road network management; routine road maintenance; asset management systems; spray sealing; asphalt laying; and manufacture and supply of bitumen-based products and asphalt products. This segment also engages in the design and construction of light and heavy rail networks, signaling works, track and station works, and bridges; and provides rail safety technology, fleet maintenance, and overhaul services. The company's Utilities segment plans, designs, constructs, operates, maintains, manages, and decommissions power and gas network assets; provides water and wastewater treatment, and network construction and rehabilitation services; and designs, constructs, and maintains renewable assets in the wind, solar, and power system storage sectors. This segment also offers technology and communications solutions, including design, civil construction, network construction, operation, and maintenance services for fiber, copper, and radio networks. Its Facilities segment offers outsourced facility, catering and laundry, technical and engineering, and maintenance and asset management services, as well as refrigeration solutions, as well as building and construction solutions across various sectors. The company's Engineering, Construction and Maintenance segment provides design, engineering, construction, shutdown, turnaround and outage delivery, and operations maintenance and ongoing management services for various projects; and designs and manufactures mineral process equipment. Its Mining segment provides resource definition, exploration drilling, and mine feasibility studies; open cut and underground mining services; and drilling, explosives manufacture and supply; blasting and crushing; asset management; tire management; and mine closure and rehabilitation services. The company is headquartered in Sydney, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "DOW.AX": {
        "short_name": "DOWNER EDI FPO",
        "long_name": "Downer EDI Limited",
        "summary": "Downer EDI Limited operates as an integrated services provider in Australia, New Zealand, the Asia-Pacific, South America, and Southern Africa. Its Transport segment provides road network management; routine road maintenance; asset management systems; spray sealing; asphalt laying; and manufacture and supply of bitumen-based products and asphalt products. This segment also engages in the design and construction of light and heavy rail networks, signaling works, track and station works, and bridges; and provides rail safety technology, fleet maintenance, and overhaul services. The company's Utilities segment plans, designs, constructs, operates, maintains, manages, and decommissions power and gas network assets; provides water and wastewater treatment, and network construction and rehabilitation services; and designs, constructs, and maintains renewable assets in the wind, solar, and power system storage sectors. This segment also offers technology and communications solutions, including design, civil construction, network construction, operation, and maintenance services for fiber, copper, and radio networks. Its Facilities segment offers outsourced facility, catering and laundry, technical and engineering, and maintenance and asset management services, as well as refrigeration solutions, as well as building and construction solutions across various sectors. The company's Engineering, Construction and Maintenance segment provides design, engineering, construction, shutdown, turnaround and outage delivery, and operations maintenance and ongoing management services for various projects; and designs and manufactures mineral process equipment. Its Mining segment provides resource definition, exploration drilling, and mine feasibility studies; open cut and underground mining services; and drilling, explosives manufacture and supply; blasting and crushing; asset management; tire management; and mine closure and rehabilitation services. The company is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "DTI.AX": {
        "short_name": "DTI GROUP FPO",
        "long_name": "DTI Group Limited",
        "summary": "DTI Group Limited, together with its subsidiaries, develops, manufactures, and supplies integrated surveillance and passenger communication systems, and fleet management solutions worldwide. Its surveillance solutions comprising hardware systems that incorporate videos, audios, GPS tracking, communications, and recording technology, as well as support through sophisticated device and data management software providing fleet-wide, CCTV, and vehicle management solutions. The company's passenger communication solutions include hardware systems, which incorporate real time passenger information through graphical and high brightness displays, public address and hearing aid loop communications, passenger emergency communications, and driver awareness systems incorporating live viewing of passengers, and infotainment systems, as well as support through a device and content management software to provide a comprehensive, fleet-wide, and passenger information management solutions. It also offers managed services, such as back-end control room communications and infrastructure comprising wide-area urban surveillance, driver development and risk mitigation, video management, vehicle data analysis and monitoring, schedule adherence analysis, IT infrastructure, help desk, technical support and monitoring, and first line maintenance services. The company's products are used in law enforcement, depot, passenger and heavy haul rail, mining, taxi, bus and coach, tram and LRV solution, and level applications. It serves transit agencies, transit vehicle manufacturers, and transit operators. DTI Group Limited was founded in 1995 and is headquartered in Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Perth"
    },
    "DUR.AX": {
        "short_name": "DURATEC FPO",
        "long_name": "Duratec Limited",
        "summary": "Duratec Limited engages in the provision of assessment, protection, remediation, and refurbishment services to a range of assets, primarily steel and concrete infrastructure in Australia. It operates through Defence, Mining & Industrial, and Buildings & Facades segments. The Defence segment delivers capital facilities infrastructure and estate works program projects. The Mining & Industrial segment offers preventative maintenance programmes. The Buildings & Facades segment provides faÃ§ade condition assessment and restoration completion services. The company offers asset protection, building refurbishment, infrastructure upgrades, recladding, durability engineering, specialist access systems, construction, and spatial integration services. It serves defence, mining, oil and gas, transport, marine, energy, building and faÃ§ade, heritage, property, industrial, and water infrastructure industries. The company was founded in 2010 and is headquartered in Wangara, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Wangara"
    },
    "DZ2.F": {
        "short_name": "FBR LTD.",
        "long_name": "FBR Limited",
        "summary": "FBR Limited designs, develops, and commercializes robotic machines in Australia. It engages in developing the Hadrian X, a construction robot which builds the walls of a structure from 3D computer-aided design model and dynamic stabilisation technology which reacts to wind, vibration, and other environmental factors to enable precise positioning of objects over large distances outside. The company was formerly known as Fastbrick Robotics Limited and changed its name to FBR Limited. The company was incorporated in 1999 and is based in High Wycombe, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "High Wycombe"
    },
    "DZ5.F": {
        "short_name": "CARDNO LTD.",
        "long_name": "Cardno Limited",
        "summary": "Cardno Limited, a professional infrastructure and environmental services company, engages in the development and improvement of physical and social infrastructure for communities worldwide. The company's Asia Pacific Engineering and Environmental segment provides services in civil, structural, water, environmental, coastal, bridge, geotechnical, subsurface utility, traffic, and transport engineering, as well as environmental science, surveying, landscape architecture, planning, and asset management. Its Americas Engineering and Environmental segment offers environmental, water, transportation, energy and resources, land, buildings, and management services to private and public sector clients. The company's International Development segment designs and implements large-scale sustainable solutions for development assistance agencies and private clients. The company's Other segment engages in the engineering and consulting operations in Latin America. It serves defense, energy, government, industrial, international development, land management, mining and resources, property and buildings, transportation, utilities, and water sectors. Cardno Limited was founded in 1945 and is headquartered in Fortitude Valley, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Fortitude Valley"
    },
    "E3A.F": {
        "short_name": "EMECO HOLDINGS LTD",
        "long_name": "Emeco Holdings Limited",
        "summary": "Emeco Holdings Limited provides heavy earthmoving equipment and mining service solutions in Australia. The company rents trucks, excavators, dozers, loaders, and graders. It is also involved in the maintenance and remanufacturing of various components of heavy earthmoving equipment. Emeco Holdings Limited was founded in 1972 and is headquartered in Perth, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Perth"
    },
    "EAX.AX": {
        "short_name": "ENERGY ACT FPO",
        "long_name": "Energy Action Limited",
        "summary": "Energy Action Limited, together with its subsidiaries, provides electricity and gas procurement, managed, and retail billing services in Australia. The company operates Australian Energy Exchange for electricity and gas procurement service through online, real time, and reverse auction platform for business customers. It also provides Energy Metrics, an independent manager services platform that offers energy consumption monitoring and costing, energy emissions monitoring, contract administration, detailed technical reporting, desktop energy efficiency review, and additional reporting and monitoring services. In addition, the company offers retail services, including embedded networks and retailer onboarding, meter reading, billing, standing data management, receivables management, and performance reporting for embedded network operators, as well as advisory services. It serves commercial, industrial, and small and medium sized business customers. Energy Action Limited was founded in 2000 and is headquartered in Parramatta, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Parramatta"
    },
    "ECL.AX": {
        "short_name": "EXCELSIOR FPO",
        "long_name": "Excelsior Capital Limited",
        "summary": "Excelsior Capital Limited designs and distributes electrical components and cables for resource and infrastructure applications in Australia. It offers power and communication cables/assemblies and computer cabling, along with plugs and high voltage couplers. The company also manages investment portfolio. It sells its products to the mining, construction, petrochemical, and IT industries. The company also exports its products to Indonesia, Papua New Guinea, the United States, and China. The company was formerly known as CMI Limited and changed its name to Excelsior Capital Limited in November 2018. The company was founded in 1991 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "ECT.AX": {
        "short_name": "ENVIRON FPO",
        "long_name": "Environmental Clean Technologies Limited",
        "summary": "Environmental Clean Technologies Limited invests in, researches, develops, and commercializes technologies in the environmental and energy industries in Australia. Its technologies include Coldry, a method to dewater brown coal and transform this resource into a black coal equivalent; and HydroMOR, a process for producing iron product from low-rank coal with brown coal and iron oxide bearing material, such as mill scale, nickel tailings, and high or low-grade iron ore. The company also offers catalytic de-polymerization technology that enables the production of automotive diesel from a range of hydrocarbon-based inputs, including various waste and hydrocarbon streams, such as waste timber, end-of-life plastics, and low-rank coal; and catalytic organic hydrogen generation technology for producing hydrogen from lignite. It also provides equity lending facility loans. Environmental Clean Technologies Limited was founded in 1985 and is based in South Yarra, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "South Yarra"
    },
    "ECX.AX": {
        "short_name": "ECLIPX FPO",
        "long_name": "Eclipx Group Limited",
        "summary": "Eclipx Group Limited provides vehicle fleet leasing, fleet management, and diversified financial services in Australia and New Zealand. The company operates through Australia Commercial, Novated, and New Zealand Commercial segments. It offers vehicle fleet leasing and management, commercial equipment finance and leasing, novated leasing, and consumer motor vehicle finance solutions. The company provides a suite of diversified financial services under the FleetPartners, FleetPlus, FleetChoice, and AutoSelect brands. Eclipx Group Limited was founded in 1987 and is headquartered in St Leonards, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "St Leonards"
    },
    "EDE.AX": {
        "short_name": "EDEN INNOV FPO",
        "long_name": "Eden Innovations Ltd",
        "summary": "Eden Innovations Ltd provides various clean technology solutions. The company develops, manufactures, and sells EdenCrete, a carbon nanotube enriched admixture for concrete; and OptiBlend, a retrofit dual fuel technology for diesel generator sets. It is also involved in pyrolysis process, a technology to produce carbon nanotube and carbon nanofibre, and hydrogen from natural gas. In addition, the company provides Hythane, a blend of hydrogen and natural gas; and EdenPlast, a CNT enriched polypropylene tape made by conventional extrusion process. Eden Innovations Ltd was incorporated in 2004 and is based in Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Perth"
    },
    "EDEYF": {
        "short_name": "EDEN INNOVATIONS LTD",
        "long_name": "Eden Innovations Ltd",
        "summary": "Eden Innovations Ltd provides various clean technology solutions. The company develops, manufactures, and sells EdenCrete, a carbon nanotube enriched admixture for concrete; and OptiBlend, a retrofit dual fuel technology for diesel generator sets. It is also involved in pyrolysis process, a technology to produce carbon nanotube and carbon nanofibre, and hydrogen from natural gas. In addition, the company provides Hythane, a blend of hydrogen and natural gas; and EdenPlast, a CNT enriched polypropylene tape made by conventional extrusion process. Eden Innovations Ltd was incorporated in 2004 and is based in Perth, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Perth"
    },
    "EGL.AX": {
        "short_name": "ENVN GROUP FPO",
        "long_name": "The Environmental Group Limited",
        "summary": "The Environmental Group Limited engages in the design, application, and servicing of gas and vapor emission control systems, and inlet and exhaust systems for gas turbines in Australia and internationally. Its products include gas turbine inlet filtration systems (filter houses), inlet cooling/fogging systems, acoustical components, expansion joints, and complete exhaust systems with guillotine and diverter dampers; and a range of air pollution control equipment and services for the removal of pollutants from industrial gas and air streams. The company also provides engineering, and water treatment services to various industries; and installation, commissioning, service, and maintenance of steam boilers, inert gas generators, hot water boilers, valves, thermal oil heaters, economizers, and burners. The Environmental Group Limited was incorporated in 1923 and is headquartered in Notting Hill, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Notting Hill"
    },
    "EGN.AX": {
        "short_name": "ENGENCO FPO",
        "long_name": "Engenco Limited",
        "summary": "Engenco Limited, together with its subsidiaries, provides engineering services and products in Australasia, Europe, and the United States. The company's Gemco Rail segment engages in the remanufacture and repair of locomotives, wagons, bearings, and other rail products for rail operators and maintainers. This segment offers wheel-set, bogie, and in-field wagon maintenance services; and manufactures new and refurbished wagons, bogie component parts, customized remote controlled ballast car discharge gates, and rail maintenance equipment and spares. Its Convair segment manufactures pneumatic road tankers and mobile silos for the carriage and storage of construction materials, grains, and other dry bulk materials; and offers maintenance, repair, and overhaul services, as well as sells ancillary equipment and spare parts. The company's Drivetrain segment offers engine and powertrain maintenance, repair, and overhaul; power generation design and construction; and technical support, professional engineering, and training services, as well as fluid connectors, new components, and parts to mining, oil and gas, rail, transport, defense, marine, construction, materials handling, automotive, agriculture, and power generation industries. Its Momentum Rail segment provides personnel and project management services, such as professional recruitment; and training and workforce solutions comprising management and provision of track construction, and maintenance projects to freight rail and mining rail infrastructure managers. The company's CERT segment provides rail training, rail incident investigation training, security (transit guard) training, first aid training, and company induction and course design services; issues certificates of competency; and manages apprenticeship and trainee schemes for various infrastructure and rail clients. Engenco Limited was founded in 1989 and is headquartered in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "EGY.AX": {
        "short_name": "ENERGYTECH FPO",
        "long_name": "Energy Technologies Limited",
        "summary": "Energy Technologies Limited manufactures and sells specialist industrial cables. It offers low voltage insulated copper cables. The company was formerly known as Dulhunty Power Limited and changed its name to Energy Technologies Limited in October 2011. Energy Technologies Limited was incorporated in 1983 and is based in Brookvale, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Brookvale"
    },
    "EHL.AX": {
        "short_name": "EMECO HLDG FPO",
        "long_name": "Emeco Holdings Limited",
        "summary": "Emeco Holdings Limited provides heavy earthmoving equipment and mining service solutions in Australia. The company rents trucks, excavators, dozers, loaders, and graders. It is also involved in the maintenance and remanufacturing of various components of heavy earthmoving equipment. Emeco Holdings Limited was founded in 1972 and is headquartered in Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Perth"
    },
    "EOHDF": {
        "short_name": "EMECO HOLDINGS LIMITED",
        "long_name": "Emeco Holdings Limited",
        "summary": "Emeco Holdings Limited provides heavy earthmoving equipment and mining service solutions in Australia. The company rents trucks, excavators, dozers, loaders, and graders. It is also involved in the maintenance and remanufacturing of various components of heavy earthmoving equipment. Emeco Holdings Limited was founded in 1972 and is headquartered in Perth, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Perth"
    },
    "EOS.AX": {
        "short_name": "ELEC OPTIC FPO",
        "long_name": "Electro Optic Systems Holdings Limited",
        "summary": "Electro Optic Systems Holdings Limited engages in the development, manufacture, and sale of telescopes and dome enclosures, laser satellite tracking systems, microwave communications, and electro-optic fire control systems. It operates through Defense, Space, and Communication segments. The Defense segment develops, manufactures, and markets fire control, surveillance, and weapon systems to military customers. It also provides sensors; and fire control software products. The Space segment designs, manufactures, delivers, and operates sensors and systems for space domain awareness and space control. Its products include space debris management systems, defense missiles, optical communications systems, and space products, such as observatories, telescopes, and laser products and electronics. The Communication segment offers optical, microwave, and on-the-move radio, and satellite systems. It operates in Australia, the United States, Singapore, the Middle East, Germany, and internationally. Electro Optic Systems Holdings Limited was founded in 1983 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "EVZ.AX": {
        "short_name": "EVZ LTD FPO",
        "long_name": "EVZ Limited",
        "summary": "EVZ Limited operates in the engineering and energy services sectors in Australia and Asia. It operates through Engineering, Energy, and Water segments. The Engineering segment designs, manufactures, and installs silos, cooling towers, pipe spooling, and pressure vessels, as well as large steel tanks for use in the water, petrochemical, and chemical industries; and fabricates structural steel. This segment also engages in the installation and provision of ongoing support and maintenance for its products. The Energy segment designs and installs constant load power stations, base and back-up power generation equipment, communications equipment, marine installations, and sustainable/clean energy solutions, as well as offers mobile generation capabilities. It also engages in the service, maintenance, and hiring of various generators and associated equipment. The Water segment is involved in the design and installation of syphonic roof drainage systems to various buildings, including airports, shopping centers, and sporting venues; supply and installation of fiberglass panel tanks and prefabricated hydraulic systems. The company also provides design, construction, on-site installation, maintenance, and shutdown of engineering services to the mining, wood chip, petrochemical, aluminum, glass, cement, defense, and agriculture industries. EVZ Limited was incorporated in 1984 and is based in Docklands, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Docklands"
    },
    "FBR.AX": {
        "short_name": "FASTBRICK FPO",
        "long_name": "FBR Limited",
        "summary": "FBR Limited designs, develops, and commercializes robotic machines in Australia. It engages in developing the Hadrian X, a construction robot which builds the walls of a structure from 3D computer-aided design model and dynamic stabilisation technology which reacts to wind, vibration, and other environmental factors to enable precise positioning of objects over large distances outside. The company was formerly known as Fastbrick Robotics Limited and changed its name to FBR Limited. The company was incorporated in 1999 and is based in High Wycombe, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "High Wycombe"
    },
    "FBRKF": {
        "short_name": "FBR LTD",
        "long_name": "FBR Limited",
        "summary": "FBR Limited designs, develops, and commercializes robotic machines in Australia. It engages in developing the Hadrian X, a construction robot which builds the walls of a structure from 3D computer-aided design model and dynamic stabilisation technology which reacts to wind, vibration, and other environmental factors to enable precise positioning of objects over large distances outside. The company was formerly known as Fastbrick Robotics Limited and changed its name to FBR Limited. The company was incorporated in 1999 and is based in High Wycombe, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "High Wycombe"
    },
    "FLN.AX": {
        "short_name": "FREELANCER FPO",
        "long_name": "Freelancer Limited",
        "summary": "Freelancer Limited operates a freelancing and crowdsourcing marketplace in Australia. It operates through two segments, Online Marketplace and Online Payment Services. Through its marketplace employers can hire freelancers to do work in areas, such as software development, writing, data entry and design, engineering, sciences, sales and marketing, and accounting and legal services. It connects employers and freelancers from approximately 247 countries, regions, and territories. The company also provides escrow payment services. Freelancer Limited was founded in 2009 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "FLNCF": {
        "short_name": "FREELANCER LTD",
        "long_name": "Freelancer Limited",
        "summary": "Freelancer Limited operates a freelancing and crowdsourcing marketplace in Australia. It operates through two segments, Online Marketplace and Online Payment Services. Through its marketplace employers can hire freelancers to do work in areas, such as software development, writing, data entry and design, engineering, sciences, sales and marketing, and accounting and legal services. It connects employers and freelancers from approximately 247 countries, regions, and territories. The company also provides escrow payment services. Freelancer Limited was founded in 2009 and is based in Sydney, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "FWD.AX": {
        "short_name": "FLEETWOOD FPO",
        "long_name": "Fleetwood Limited",
        "summary": "Fleetwood Corporation Limited engages in the design, manufacture, and sale of manufactured modular accommodation in Australia and New Zealand. It operates through three segments: RV Solutions, Building Solutions, and Accommodation Solutions. The company also engages in the operation of accommodation villages; and manufacture and distribution of recreational vehicle parts and accessories, as well as the provision of associated services. It offers modular accommodation solutions for resources, education, affordable housing, mining, and corrections sectors; and provides caravan plumbing and electrical services, as well as supplies related parts. Fleetwood Corporation Limited was founded in 1964 and is based in East Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "East Perth"
    },
    "GC3.F": {
        "short_name": "NOVONIX LTD.",
        "long_name": "Novonix Limited",
        "summary": "Novonix Limited develops and supplies battery materials, equipment, and services to the lithium-ion battery market in North America. The company operates through three segments: Graphite Exploration and Mining, Battery Technology, and Battery Materials. The Graphite Exploration and Mining segment explores for graphite in Australia. The Battery Technology segment develops battery cell testing equipment and batteries, and consulting services. The Battery Materials segment develops and manufactures battery anode materials. The company is also involved in the investment and battery testing activities. Novonix Limited has strategic alliance with Harper International Corporation to develop specialized furnace technology that would enhance Novonix's synthetic graphite manufacturing process. Novonix has partnership with Emera Technologies to develop and manufacture energy storage systems for community microgrids. The company was formerly known as Graphitecorp Limited and changed its name to Novonix Limited in July 2017. Novonix Limited was founded in 2012 and is based in Brisbane, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Brisbane"
    },
    "GNG.AX": {
        "short_name": "GR ENGIN FPO",
        "long_name": "GR Engineering Services Limited",
        "summary": "GR Engineering Services Limited operates as an engineering, consulting, and contracting company that provides engineering design, procurement, and construction services to the mining and mineral processing industries in Australia and internationally. The company operates through two segments, Mineral Processing, and Oil and Gas. It provides project management services, including project studies, engineering and procurement, construction and commissioning, asset management plans and system development, operations and technical support, and infrastructure development services. The company's services include the design and construction of minerals processing facilities and related infrastructure for greenfield or brownfield projects, such as plant modifications, and upgrades and expansions; plant evaluation and condition reports; plant operations, and maintenance support and optimization; and plant relocation, refurbishment, and recommissioning, as well as engages in the provision of owners representatives and teams for project management and delivery, and asset management services. Its services also comprise engineering and process design consulting services; and feasibility studies comprising scoping, pre-feasibility, and definitive level studies, as well as study work and services that include front end engineering design, operations and process optimization, due diligence reviews, asset management system development and monitoring, risk evaluation and hazard/operability studies, technology evaluation and trade-off studies, and refurbishment assessments. In addition, the company offers operations, maintenance, and advisory services to the oil and gas sector. GR Engineering Services Limited was founded in 1986 and is headquartered in Ascot, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Ascot"
    },
    "GNP.AX": {
        "short_name": "GENUSPLUS FPO",
        "long_name": "GenusPlus Group Limited",
        "summary": "GenusPlus Group Limited provides infrastructure services in Australia. The company's services cover power and telecommunications transmission and distribution; underground network installation services, which range from optic fiber for telecommunications to underground power and civil works; switchyards, substation, communications, and renewable energy; design, construction, commissioning, fault works, and maintenance; high voltage (HV) testing, commissioning, and engineering services, including HV cable jointing, HV testing, protection relay testing, fault location, and high voltage maintenance; electrical and instrumentation services; and construction and maintenance. It also provides integrated engineering and training, and related support services. The company provides its services for customers in the infrastructure, utilities, mining and resources, government and private, telecommunications, power distribution and generation, commercial, industrial, civil, and oil and gas sectors. GenusPlus Group Limited was incorporated in 2017 and is headquartered in Belmont, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Belmont"
    },
    "GO2.AX": {
        "short_name": "GO2PEOPLE FPO",
        "long_name": "The GO2 People Limited",
        "summary": "The GO2 People Limited provides recruitment and building services in Australia. Its Recruitment division offers staffing solutions for various sectors, including infrastructure, construction, mining/resources, electrical/energy, waste management, and warehousing/logistics. It also offers training and education service to its clients which includes accredited and non-accredited workplace training and education courses. The GO2 People Limited was founded in 2011 and is based in Rivervale, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Rivervale"
    },
    "GUD.AX": {
        "short_name": "G.U.D. FPO",
        "long_name": "GUD Holdings Limited",
        "summary": "GUD Holdings Limited, through its subsidiaries, engages in the manufacture and importation, distribution, and sale of automotive products, pumps, pool and spa systems, and water pressure systems in Australia, New Zealand, France, and Spain. It operates through Automotive and Davey segments. The company offers automotive and heavy-duty filters for cars, trucks, and agricultural and mining equipment; and fuel pumps and associated products for the automotive after-market. It also provides pumps and pressure systems for household and farm water; water transfer pumps; swimming pool products; spa bath controllers; and pumps and water purification equipment. GUD Holdings Limited was incorporated in 1958 and is based in Altona North, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Altona North"
    },
    "HIL.AX": {
        "short_name": "HILLS FPO",
        "long_name": "Hills Limited",
        "summary": "Hills Limited supplies technology solutions to the health, security, surveillance, and IT markets in Australia and New Zealand. The company operates through Hills Health Solutions and Hills Distribution. It offers security products, such as CCTV and surveillance products, analogue HD cameras, bundle kits, encoders and decoders, IP cameras, lighting, monitors, networking and transmission, recorders, video analytics, and video management software; access control and intrusion products, including access control peripherals and systems, alarm accessories, alarms and intrusion, asset management, batteries and power supplies, cable fire and security, detectors, home integrated systems, intercom systems, locking, security connectors, structured cabling, and wireless security; and fire panels and detectors, fire panel accessories, fire modules, fire speakers strobes, fie miscellaneous, fire suppressions, and fire extinguishers and blankets. The company also provides firewall and cybersecurity, switches, routers, IOT, WIFI, fixed wireless, and computers and display products; and nurse call and patient engagement solutions. The company was formerly known as Hills Holding Limited and changed its name to Hills Limited in December 2013. Hills Limited was founded in 1945 and is headquartered in Lidcombe, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Lidcombe"
    },
    "HIQ.F": {
        "short_name": "HILLS LTD",
        "long_name": "Hills Limited",
        "summary": "Hills Limited supplies technology solutions to the health, security, surveillance, and IT markets in Australia and New Zealand. The company operates through Hills Health Solutions and Hills Distribution. It offers security products, such as CCTV and surveillance products, analogue HD cameras, bundle kits, encoders and decoders, IP cameras, lighting, monitors, networking and transmission, recorders, video analytics, and video management software; access control and intrusion products, including access control peripherals and systems, alarm accessories, alarms and intrusion, asset management, batteries and power supplies, cable fire and security, detectors, home integrated systems, intercom systems, locking, security connectors, structured cabling, and wireless security; and fire panels and detectors, fire panel accessories, fire modules, fire speakers strobes, fie miscellaneous, fire suppressions, and fire extinguishers and blankets. The company also provides firewall and cybersecurity, switches, routers, IOT, WIFI, fixed wireless, and computers and display products; and nurse call and patient engagement solutions. The company was formerly known as Hills Holding Limited and changed its name to Hills Limited in December 2013. Hills Limited was founded in 1945 and is headquartered in Lidcombe, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Lidcombe"
    },
    "HIT.AX": {
        "short_name": "HITECH GRP FPO",
        "long_name": "HiTech Group Australia Limited",
        "summary": "HiTech Group Australia Limited provides recruitment services for permanent and contract staff to the information and communications technology (ICT) industry in public and private sectors in Australia. Its permanent recruitment services comprise the search and selection of candidates for full time employment; and ICT contracting services include the provision of ICT professionals for temporary and other non-permanent staffing needs of clients for specific projects in digital transformation, system development, infrastructure architecture and cloud integration, operation, and supports and project management. The company also offers personnel services to other sectors, such as administration and office support, sales and marketing, and finance. It serves technology companies, banking/financial services companies, and federal and state government departments and agencies. HiTech Group Australia Limited was founded in 1993 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "HNG.AX": {
        "short_name": "HGL LTD FPO",
        "long_name": "HGL Limited",
        "summary": "HGL Limited imports and distributes branded products for in Australia and internationally. It operates through Retail Marketing, Building Product, and Personal Care, and Healthcare segments. The Retail Marketing segment provides standard and customized shelving and display solutions to brand owners and retailers. The Building Product segment distributes architectural lightings for the commercial markets. The Personal Care segment distributes cosmetics and skincare products through salon, spa, and retail markets. The Healthcare segment rents and distributes medical equipment into hospitals, aged care facilities, and the retail market. It offers architectural lighting products under the TAL, Sammode, Luceplan, LTS, Hubbell, KIM, IILUS, and Intralux brands. The company was formerly known as Hancock & Gore Ltd and changed its name to HGL Limited in June 2002. HGL Limited was founded in 1867 and is headquartered in Macquarie Park, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Seven Hills"
    },
    "IDG.F": {
        "short_name": "IMDEX LTD",
        "long_name": "Imdex Limited",
        "summary": "Imdex Limited, together with its subsidiaries, provides mining equipment, technology, and services for the minerals industry in the Asia-Pacific, Africa, Europe, the Americas, and internationally. It offers drilling fluids, equipment, technologies, and software used to optimize drilling programs, as well as solutions for the horizontal directional drilling, water-well, and civil construction sectors under the AMC and REFLEX brands. The company also provides software, mining technology, drilling optimization, downhole navigation, structural geology, in-field geoanalysis, and driller operable geophysics solutions. It primarily serves drilling contractors and resource companies. The company was formerly known as Pilbara Gold NL and changed its name to Imdex Limited in July 1985. Imdex Limited was incorporated in 1980 and is headquartered in Balcatta, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Balcatta"
    },
    "IGN.AX": {
        "short_name": "IGNITE FPO",
        "long_name": "Ignite Limited",
        "summary": "Ignite Limited, together with its subsidiaries, provides specialist recruitment, on-demand information technology, and people services in Australia and New Zealand. The company offers permanent and contingent labour recruitment, and payroll services; and outsourced recruitment and human resource consulting services. It is also involved in the provision of pre-qualified information technology resources to deliver on demand solutions. The company provides its services under the Ignite and Lloyd Morgan brand names. It serves accounting, finance, architecture, construction, engineering, property, business support, human resources, legal, information management, IT, digital, and sales and marketing industries. The company was formerly known as Clarius Group Limited. Ignite Limited was founded in 1984 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "IMD.AX": {
        "short_name": "IMDEX FPO",
        "long_name": "Imdex Limited",
        "summary": "Imdex Limited, together with its subsidiaries, provides mining equipment, technology, and services for the minerals industry in the Asia-Pacific, Africa, Europe, the Americas, and internationally. It offers drilling fluids, equipment, technologies, and software used to optimize drilling programs, as well as solutions for the horizontal directional drilling, water-well, and civil construction sectors under the AMC and REFLEX brands. The company also provides software, mining technology, drilling optimization, downhole navigation, structural geology, in-field geoanalysis, and driller operable geophysics solutions. It primarily serves drilling contractors and resource companies. The company was formerly known as Pilbara Gold NL and changed its name to Imdex Limited in July 1985. Imdex Limited was incorporated in 1980 and is headquartered in Balcatta, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Balcatta"
    },
    "IMDXF": {
        "short_name": "IMDEX LTD",
        "long_name": "Imdex Limited",
        "summary": "Imdex Limited, together with its subsidiaries, provides mining equipment, technology, and services for the minerals industry in the Asia-Pacific, Africa, Europe, the Americas, and internationally. It offers drilling fluids, equipment, technologies, and software used to optimize drilling programs, as well as solutions for the horizontal directional drilling, water-well, and civil construction sectors under the AMC and REFLEX brands. The company also provides software, mining technology, drilling optimization, downhole navigation, structural geology, in-field geoanalysis, and driller operable geophysics solutions. It primarily serves drilling contractors and resource companies. The company was formerly known as Pilbara Gold NL and changed its name to Imdex Limited in July 1985. Imdex Limited was incorporated in 1980 and is headquartered in Balcatta, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Balcatta"
    },
    "IPH.AX": {
        "short_name": "IPHLIMITED FPO",
        "long_name": "IPH Limited",
        "summary": "IPH Limited, together with its subsidiaries, provides intellectual property (IP) services and products worldwide. The company operates in three segments: Intellectual Property Services Australia & New Zealand, Intellectual Property Services Asia, and Adjacent Businesses. It offers IP services related to the provision of filing, prosecution, enforcement, and management of patents, designs, trademarks, and other IP; and develops and provides IP data and analytics software under the subscription license model. The company is also provides patent attorney and lawyers services. It serves Fortune Global 500 companies, multinationals, public sector research organizations, SMEs, and professional services firms. IPH Limited was founded in 1887 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "IPTK": {
        "short_name": "AS-IP TECH INC",
        "long_name": "AS-IP Tech, Inc.",
        "summary": "AS-IP Tech, Inc. develops technologies for the business aviation and commercial airline industry. The company offers BizjetMobile and fflya technologies that delivers inflight connectivity. AS-IP Tech, Inc. markets its BizjetMobile product under the CrewX, CHiiMP, and BizjetInternet brands. It operates in the Asia Pacific, the America's, Europe, and the Middle East The company was formerly known as ASI Entertainment, Inc. and changed its name to AS-IP Tech, Inc. in July 2014. AS-IP Tech, Inc. was founded in 1986 and is based in Research, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Research"
    },
    "ITG.AX": {
        "short_name": "INTEGA GRP FPO",
        "long_name": "Intega Group Limited",
        "summary": "Intega Group Limited provides engineering services primarily in Australia, New Zealand, the United States, the United Kingdom, and Canada. It operates through Asia Pacific and Americas segments. The company offers testing services for construction materials, including soil, aggregates, and concrete; subsurface utility engineering services, such as mapping the location and condition of subsurface utilities to reduce the occurrence of interference and conflict with existing infrastructure; and environmental testing services comprising testing soils, asbestos, groundwater quality, construction noise, dust, and vibration levels. It also provides geotechnical engineering services, such as temporary works design, bored pile supervision, geotechnical investigation, site classification, and pavement design services; geomechanical testing services for infrastructure, mining, and tunneling projects; owners' representative services; and quality assurance services. The company was founded in 1968 and is based in Newstead, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Newstead"
    },
    "JLG.AX": {
        "short_name": "JOHNS LYNG FPO",
        "long_name": "Johns Lyng Group Limited",
        "summary": "Johns Lyng Group Limited provides integrated building services in Australia. The company operates through Insurance Building and Restoration Services, Commercial Building Services, Commercial Construction, and Other segments. It provides building fabric repair, contents restoration, hazardous waste removal, and strata management services; and residential and commercial flooring, emergency household repairs, shop-fitting, HVAC mechanical, and pre-sale property staging services. The company also undertakes commercial construction projects in the education, aged care, retail, community, hospitality, and residential sectors. It offers it services under the Makesafe Builders, Restorx Services, Express Builders, Insurance Builders, Aztech, Hazrem, Regional Builders, Steamatic, Strata Services, Bright & Duggan, Trump Floorcoverings, Global Home Response, Air Control, Shopfit Services, Dressed for Sale, Commercial Builders, Global 360, and Local 360 brands to insurance brokers, insurance companies, loss adjusters, commercial enterprises, local and state governments, and retail customers, as well as body corporates/owners' corporations. The company was founded in 1953 and is headquartered in Doncaster, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Doncaster"
    },
    "KOV.AX": {
        "short_name": "KORVEST FPO",
        "long_name": "Korvest Ltd",
        "summary": "Korvest Ltd, together with its subsidiaries, manufacturers and supplies cable and pipe support systems, galvanising services, and access systems for large mobile equipment in Australia. It operates in two segments, Industrial Products and Production. The Industrial Products segment manufactures electrical and cable support systems, and steel fabrication and access systems. This segment also sells, hires, and repairs high torque tools, such as hydraulic torque wrenches, pneumatic continuous torque wrenches, electronic continuous torque wrenches, huck tools, and power rigs. It conducts its business under the EzyStrut, Power Step and Titan Technologies names. The Production segment provides hot dip galvanising services. It serves infrastructure, commercial, utilities, mining, food processing, oil and gas, power stations, health, and industrial sectors. The company was founded in 1970 and is based in Kilburn, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Kilburn"
    },
    "KPG.AX": {
        "short_name": "KELLYPRTNR FPO",
        "long_name": "Kelly Partners Group Holdings Limited",
        "summary": "Kelly Partners Group Holdings Limited provides chartered accounting and other professional services to private businesses and clients, owners, families, and high net worth individuals in Australia. The company operates in two segments, Accounting and Other Services. It offers audits; business, and personal and investment structures; cloud accounting; corporate and management; estate planning and management; family law assistance; accounting; immigration support; outsourced CFO; payroll; philanthropic; strata accounting and tax; ATO investigation and dispute; and taxation advice and compliance services. The company also provides tax services, including ATO audits, disclosures, and investigations and tax disputes; capital inflows and outflows; mergers and acquisitions; funds management and managed; investment trusts; structuring, negotiation, and tax legal advices; international tax for inbound and outbound investment; cross-border transactions; tax structuring; trust structures and joint ventures; and solutions, succession planning, and family offices. In addition, it provides private wealth investment; property; finance services; and insurance services. Further, the company offers estate services that include assessment and ongoing performance reviews of investment managers; administrative functions, such as bookkeeping, bill paying, and mail management; financial oversight of illiquid financial assets; monthly report of family/estate activities; critical document management; daily management of liquid financial assets; facilitation of estate planning; family governance structures, education, and intergenerational planning; and philanthropy advisory. Additionally, it provides corporate secretarial, corporate advisory, and all other non-accounting services. The company was founded in 2006 and is headquartered in North Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "North Sydney"
    },
    "KSC.AX": {
        "short_name": "K & S CORP FPO",
        "long_name": "K&S Corporation Limited",
        "summary": "K&S Corporation Limited provides transportation and logistics, contract management, warehousing and distribution, and fuel distribution services primarily in Australia and New Zealand. The company operates through three segments: Australian Transport, Fuels, and New Zealand Transport. It provides road, rail, and coastal sea forwarding for full and break bulk loads, including export packing, wharf lodgement, and the delivery of integrated supply chain and system solutions; support services to offshore exploration and drilling projects; and dry and liquid bulk transportation services to mining, sugar, cement, and fertilizer industries. The company also offers line haul and logistical support, and warehousing and distribution services, as well as equipment and personnel. In addition, it offers facility management services to various companies; distribution chain management services for various importers; general, full load, and part load freight services, as well as project services; and heavy haulage services. Further, the company transports dangerous goods, fuel, gas, lubricants, bulk liquids, chemicals, and explosives by road, rail, and sea; and aviation refueling services and aviation fuel supply solutions to airports and bulk fuel customers. The company was formerly known as Scott Corporation Limited and changed its name to K&S Corporation Limited in December 1998. K&S Corporation Limited was founded in 1945 and is headquartered in Truganina, Australia. K&S Corporation Limited is a subsidiary of AA Scott Pty Ltd.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Truganina"
    },
    "KTG.AX": {
        "short_name": "KTIG FPO",
        "long_name": "K-TIG Limited",
        "summary": "K-TIG Limited, a technology company, develops and manufactures welding technology known as Keyhole TIG in Australia. Its technology offers precision process for various applications and suits to corrosion resistant materials, exotic materials, and carbon steels. The company's technology handles longitudinal and circumferential welds on pipes, spooling, vessels, tanks, and other materials in a single pass. It serves vessel, tank, tube and pipe, oil and gas, nuclear, water treatment, defence, and other industries. The company also exports its technology to more than 20 countries. K-TIG Limited was incorporated in 2012 is based in Adelaide, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Adelaide"
    },
    "LAU.AX": {
        "short_name": "LINDSAY AU FPO",
        "long_name": "Lindsay Australia Limited",
        "summary": "Lindsay Australia Limited, together with its subsidiaries, provides integrated transport, logistics, and rural supply services to the food processing, food service, fresh produce, rural, agriculture, and horticultural industries in Australia. It operates through Transport and Rural segments. The Transport segment is involved in the cartage of general and refrigerated products, and ancillary sales, as well as warehouse and distribution activities. The Rural segment sells and distributes a range of agricultural supply products. Lindsay Australia Limited was incorporated in 1993 and is based in Acacia Ridge, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Acacia Ridge"
    },
    "LBL.AX": {
        "short_name": "LASERBOND FPO",
        "long_name": "LaserBond Limited",
        "summary": "LaserBond Limited, a surface engineering company, engages in the development and application of materials, technologies, and methodologies to enhance operating performance and wear life of capital-intensive machinery components. The company provides drilling tools; and laser cladding, thermal spray, welding, machining, heat treatment, metallurgy laboratory, surface coating, and remanufacturing services. It also licenses its surface engineering technologies. The company serves mining, drilling, mineral processing, power generation, transport and marine, plant and machinery, manufacturing, fluid handling, and agriculture sectors. LaserBond Limited was founded in 1992 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "LGTHF": {
        "short_name": "CIMIC GROUP LTD",
        "long_name": "CIMIC Group Limited",
        "summary": "CIMIC Group Limited provides construction, mining, mineral processing, engineering, and operation and maintenance services to the infrastructure, resource, and property markets. The company operates through Construction, Public Private Partnerships, Mining & Mineral Processing, Engineering, Services, and Commercial & Residential segments. It constructs various infrastructure projects, including roads, railways, tunnels, airports, buildings, social infrastructures, water, and energy and resources facilities. The company also offers design and construction of mine infrastructure, construction, operation and maintenance of processing facilities, topsoil stripping, drill and blast, excavation, processing, rehabilitation, and mine closure services. It has operations in Australia, Asia, the Middle East, the Americas, and Africa. The company was formerly known as Leighton Holdings Limited and changed its name to CIMIC Group Limited in April 2015. The company was founded in 1899 and is based in North Sydney, Australia. CIMIC Group Limited is a subsidiary of HOCHTIEF Australia Holdings Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "North Sydney"
    },
    "LTH.F": {
        "short_name": "CIMIC GROUP",
        "long_name": "CIMIC Group Limited",
        "summary": "CIMIC Group Limited provides construction, mining, mineral processing, engineering, and operation and maintenance services to the infrastructure, resource, and property markets. The company operates through Construction, Public Private Partnerships, Mining & Mineral Processing, Engineering, Services, and Commercial & Residential segments. It constructs various infrastructure projects, including roads, railways, tunnels, airports, buildings, social infrastructures, water, and energy and resources facilities. The company also offers design and construction of mine infrastructure, construction, operation and maintenance of processing facilities, topsoil stripping, drill and blast, excavation, processing, rehabilitation, and mine closure services. It has operations in Australia, Asia, the Middle East, the Americas, and Africa. The company was formerly known as Leighton Holdings Limited and changed its name to CIMIC Group Limited in April 2015. The company was founded in 1899 and is based in North Sydney, Australia. CIMIC Group Limited is a subsidiary of HOCHTIEF Australia Holdings Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "North Sydney"
    },
    "LVH.AX": {
        "short_name": "LIVEHIRE FPO",
        "long_name": "LiveHire Limited",
        "summary": "LiveHire Limited provides online talent acquisition software solutions to enterprises in Australia. It operates LiveHire, a talent acquisition and engagement platform for recruitment process, such as sourcing, engaging, hiring, analyzing, and integrating, as well as for internal mobility and outplacement. The company was founded in 2011 and is based in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "LWU.F": {
        "short_name": "COLLECTION HOUSE LTD",
        "long_name": "Collection House Limited",
        "summary": "Collection House Limited provides debt collection services in Australia, New Zealand, and the Philippines. The company operates in two segments, Purchased Debt Ledgers and Collection Services. It offers debt collections services to clients in the Australasian financial services, insurance, public utility, credit, and government enterprise markets; and debt purchasing services for banking, finance, telecommunications, and energy sectors. The company also provides receivables management, repayment arrangement management, asset location recovery and sale, hardship management, legal and insolvency, credit management training, finance brokerage, and business process outsourcing services. Collection House Limited was incorporated in 1992 and is headquartered in Newstead, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Newstead"
    },
    "LX6.F": {
        "short_name": "AUSTAL LTD",
        "long_name": "Austal Limited",
        "summary": "Austal Limited designs, manufactures, constructs, and supports defense and commercial vessels in North America, Europe, Australia, Asia, South and Central America, the Middle East, and Africa. The company designs, constructs, and supports passenger ferries, vehicle and passenger ferries, and offshore and windfarm vessels; naval and other defense vessels; and patrol boats for government law enforcement and border protection agencies. It also develops and integrates advanced vessel control and information management systems, including MARINELINK, an integrated monitoring, alarm, and control system for vessel systems; MARINELINK-Smart vessel management system that provides vessel support service; and MARINELINK-Fleet, an off-the-shelf system, which offers shore-sourced ship position, schedule, and weather data, as well as motion control interceptors. In addition, the company provides life capability management and vessel support services, such as crew training and instruction, vessel servicing, repair and maintenance, integrated logistics support, vessel sustainment, and information management systems support to naval, government, and commercial operators; and refit services and management of annual dockings. Austal Limited was founded in 1988 and is headquartered in Henderson, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Henderson"
    },
    "LYL.AX": {
        "short_name": "LYCOPODIUM FPO",
        "long_name": "Lycopodium Limited",
        "summary": "Lycopodium Limited provides engineering consultancy services in the resources, infrastructure and industrial processes sectors. It operates through four segments: Mineral, Process Industries, Project Services-Africa, and Others. The company provides engineering, project development, and related services to junior exploration companies and multinational producers; design, engineering, and project management solutions to the manufacturing and renewable energy facilities in Australia and South East Asia; and engineering, asset management, architecture, and project delivery services to private and public clients in Australia. It also offers metallurgical consultancy services to the mineral processing community, primarily in the field of comminution, hydrometallurgy, and mineral processing design; and drafting services to offshore entities. Lycopodium Limited was founded in 1992 and is based in East Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "East Perth"
    },
    "M8S.AX": {
        "short_name": "M8SUSTAIN FPO",
        "long_name": "M8 Sustainable Limited",
        "summary": "M8 Sustainable Limited provides waste management services to domestic, industrial, and local government clients in Australia. It operates through three segments: Waste Management, Operations and Maintenance, and Landfill Operations. The company offers waste recycling and resource recovery services. It also operates and maintains household waste treatment facilities; and construction and demolition, and commercial and industrial waste recycling facilities, as well as develops a landfill facility at Gingin located to the north of Perth. The company was incorporated in 2017 and is based in Maddington, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Maddington"
    },
    "MA2.F": {
        "short_name": "MACMAHON HLDGS LTD",
        "long_name": "Macmahon Holdings Limited",
        "summary": "Macmahon Holdings Limited provides mining and consulting services to mining companies in Australia, Southeast Asia, and South Africa. It offers surface mining services, including mine planning and analysis, drill and blast, bulk and selective mining, crushing and screening, fixed plant maintenance, water management, and equipment operation and maintenance. The company also provides underground mining services, such as mine development and production, raise drilling, cablebolting, shotcreting, remote shaft lining, production drilling, and shaft sinking. In addition, it offers civil and rehabilitation services comprising topsoil and overburden stripping, bulk earthworks, road design and construction, and train loading facilities; water infrastructure, including dams, creek diversions, flood levies, and drainage structures; and revegetation, as well as rehabilitation monitoring and maintenance. Further, the company provides equipment maintenance and management support services; and performance enhancement services comprising operator coaching and training, and cultural change programs for employees, as well as advisory and assistance services with mine planning, maintenance, and employee engagement. Macmahon Holdings Limited was founded in 1963 and is headquartered in Perth, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Perth"
    },
    "MAD.AX": {
        "short_name": "MADERGROUP FPO",
        "long_name": "Mader Group Limited",
        "summary": "Mader Group Limited, a contracting company, provides specialized contract labor for maintenance and support of mobile and fixed plant equipment in the resources sector in Australia and internationally. It offers auto and HV electricians, drill support team, clean team, rapid response teams, rostered support, shutdown teams, specialized tool hire, training and mentoring, and diggers support teams, as well as labor for component exchange, boilermaker and line boring, field support, fixed plant support, trade upgrade program, rail maintenance, and workshops. The company was founded in 2005 and is headquartered in Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Perth"
    },
    "MAH.AX": {
        "short_name": "MACMAHON FPO",
        "long_name": "Macmahon Holdings Limited",
        "summary": "Macmahon Holdings Limited provides mining and consulting services to mining companies in Australia, Southeast Asia, and South Africa. It offers surface mining services, including mine planning and analysis, drill and blast, bulk and selective mining, crushing and screening, fixed plant maintenance, water management, and equipment operation and maintenance. The company also provides underground mining services, such as mine development and production, raise drilling, cablebolting, shotcreting, remote shaft lining, production drilling, and shaft sinking. In addition, it offers civil and rehabilitation services comprising topsoil and overburden stripping, bulk earthworks, road design and construction, and train loading facilities; water infrastructure, including dams, creek diversions, flood levies, and drainage structures; and revegetation, as well as rehabilitation monitoring and maintenance. Further, the company provides equipment maintenance and management support services; and performance enhancement services comprising operator coaching and training, and cultural change programs for employees, as well as advisory and assistance services with mine planning, maintenance, and employee engagement. Macmahon Holdings Limited was founded in 1963 and is headquartered in Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Perth"
    },
    "MAQAF": {
        "short_name": "ATLAS ARTERIA",
        "long_name": "Atlas Arteria Limited",
        "summary": "Atlas Arteria Limited owns, develops, and operates toll roads. It holds a 13.4% interest in 22-kilometer toll road investors partnership II (TRIP II), the concessionaire for Dulles Greenway toll road located in Virginia, the United States. The company was formerly known as Macquarie Atlas Roads Limited and changed its name to Atlas Arteria Limited in May 2018. Atlas Arteria Limited was incorporated in 2009 and is based in Melbourne, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Infrastructure Operations",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "MCE.AX": {
        "short_name": "MATRIX CE FPO",
        "long_name": "Matrix Composites & Engineering Ltd",
        "summary": "Matrix Composites & Engineering Ltd, together with its subsidiaries, designs, manufactures, sells, and engineers composite and material technology solutions to the oil and gas, civil and infrastructure, resources, defense, and transportation industries in Australia and internationally. It offers conventional riser buoyancy systems; Nautilus riser protection; Riser sealing mandrel; Matrix Longitudinal Groove System (LGS) VIV and Drag Reduction; and Matrix LGS VIV suppression, as well as buoyancy system testing services, such as hyperbaric, buoyancy verification tank, mechanical, laboratory, and material testing. The company also provides well construction products, such as Max-R, a range of low friction composite drilling and completions centralizers. In addition, it offers distributed buoyancy clamping systems, IsoBlox buoyancy building block systems, mid water arch buoyancy, permanent subsurface mooring buoyancy, pipeline buckle mitigation buoyancy, steel catenary riser buoyancy, and production riser buoyancy systems; buoyancy balls, cuboids, and tablets; and pipeline installation buoyancy products. Further, the company provides Paragon epoxy resin systems; Kinetica dropped object protection cell systems; energy absorption systems; and Matrix LGS free span remediation solutions. Additionally, it offers Cetrafoam molded pipe cryogenic insulation products; Xirtherm C140 composite cryogenic thermal break blocks; and composite pipe reinforcement systems. The company was founded in 1980 and is headquartered in Henderson, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Henderson"
    },
    "MCHHF": {
        "short_name": "MACMAHON HLDGS",
        "long_name": "Macmahon Holdings Limited",
        "summary": "Macmahon Holdings Limited provides mining and consulting services to mining companies in Australia, Southeast Asia, and South Africa. It offers surface mining services, including mine planning and analysis, drill and blast, bulk and selective mining, crushing and screening, fixed plant maintenance, water management, and equipment operation and maintenance. The company also provides underground mining services, such as mine development and production, raise drilling, cablebolting, shotcreting, remote shaft lining, production drilling, and shaft sinking. In addition, it offers civil and rehabilitation services comprising topsoil and overburden stripping, bulk earthworks, road design and construction, and train loading facilities; water infrastructure, including dams, creek diversions, flood levies, and drainage structures; and revegetation, as well as rehabilitation monitoring and maintenance. Further, the company provides equipment maintenance and management support services; and performance enhancement services comprising operator coaching and training, and cultural change programs for employees, as well as advisory and assistance services with mine planning, maintenance, and employee engagement. Macmahon Holdings Limited was founded in 1963 and is headquartered in Perth, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Perth"
    },
    "MGH.AX": {
        "short_name": "MAAS GROUP FPO",
        "long_name": "MAAS Group Holdings Limited",
        "summary": "MAAS Group Holdings Limited, together with subsidiaries, offers construction materials, equipment, and services for civil, infrastructure, and mining end markets in Australia and internationally. The company operates through four segments: Real Estate; Civil and Construction; Tunnelling and Underground Services; and Construction Materials. The Construction Materials segment supplies quarry, and mobile crushing and screening for quarries, civil works and mining. The Civil and Construction segment engages in the provision of plant and equipment to construction and infrastructure projects; civil, electrical, communications, and mining infrastructure construction business; construction of roads, dams, and mining infrastructure. The Real Estate segment engages in the development of residential, industrial, and commercial projects. The Tunnelling and Underground Services segment engages in the manufacture and sale of equipment and attachments for underground and civil markets; and underground mobile equipment hiring business. MAAS Group Holdings Limited was founded in 2002 and is headquartered in Dubbo, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Dubbo"
    },
    "MMS.AX": {
        "short_name": "MCMILLAN FPO",
        "long_name": "McMillan Shakespeare Limited",
        "summary": "McMillan Shakespeare Limited provides salary packaging, novated leasing, disability plan management, asset management, and related financial products and services in Australia, the United Kingdom, and New Zealand. It operates through three segments: Group Remuneration Services, Asset Management, and Retail Financial Services. The Group Remuneration Services segment offers employee benefits administration services for salary packaging and ancillary services, including novated leasing asset and finance procurement, motor vehicle administration, and other services. The Asset Management segment provides financing and ancillary management services related with motor vehicles, commercial vehicles, and equipment. The Retail Financial Services segment offers retail brokerage services; and engages in the aggregation of finance originations and extended warranty cover. The company also provides fleet management and software development services. It serves federal and state governments, health groups, not-for-profit organizations, and private corporations. The company was founded in 1988 and is headquartered in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "MND.AX": {
        "short_name": "MONADEL FPO",
        "long_name": "Monadelphous Group Limited",
        "summary": "Monadelphous Group Limited, an engineering group, provides construction, maintenance, and industrial services to the resources, energy, and infrastructure sectors in Australia, New Zealand, Chile, Mongolia, and internationally. It operates through Engineering Construction, and Maintenance and Industrial Services divisions. the company offers fabrication, modularisation, offsite pre-assembly, procurement, and installation of structural steel, tankage, mechanical and process equipment, piping, demolition, and remediation works; multi-disciplined construction services; plant commissioning; electrical and instrumentation services; engineering, procurement, and construction services; and front-end scoping, shutdown planning, management, and execution services. It also provides water and waste water asset construction and maintenance; irrigation services; construction of transmission pipelines and facilities; operation and maintenance of power and water assets; heavy lift and specialist transport; access solutions; dewatering services; corrosion management services; specialist coatings; and rail track and rolling stock maintenance services, as well as turnkey design and construction, heavy lift and crane, and civil and electrical disciplines services. Monadelphous Group Limited was founded in 1972 and is headquartered in Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Perth"
    },
    "MNS.AX": {
        "short_name": "MAGNIS FPO",
        "long_name": "Magnis Energy Technologies Limited",
        "summary": "Magnis Energy Technologies Limited explores for and develops mineral properties in Australia and East Africa. It primarily explores for natural flake graphite used in batteries for storing electrical energy. The company holds a 100% interest in the Nachu graphite project located in southeast Tanzania. It also engages in the lithium-ion Battery investments. The company was formerly known as Magnis Resources Limited and changed its name to Magnis Energy Technologies Limited in November 2018. Magnis Energy Technologies Limited was incorporated in 2005 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "MOPHY": {
        "short_name": "MONADELPHOUS GROUP",
        "long_name": "Monadelphous Group Limited",
        "summary": "Monadelphous Group Limited, an engineering group, provides construction, maintenance, and industrial services to the resources, energy, and infrastructure sectors in Australia, New Zealand, Chile, Mongolia, and internationally. It operates through Engineering Construction, and Maintenance and Industrial Services divisions. the company offers fabrication, modularisation, offsite pre-assembly, procurement, and installation of structural steel, tankage, mechanical and process equipment, piping, demolition, and remediation works; multi-disciplined construction services; plant commissioning; electrical and instrumentation services; engineering, procurement, and construction services; and front-end scoping, shutdown planning, management, and execution services. It also provides water and waste water asset construction and maintenance; irrigation services; construction of transmission pipelines and facilities; operation and maintenance of power and water assets; heavy lift and specialist transport; access solutions; dewatering services; corrosion management services; specialist coatings; and rail track and rolling stock maintenance services, as well as turnkey design and construction, heavy lift and crane, and civil and electrical disciplines services. Monadelphous Group Limited was founded in 1972 and is headquartered in Perth, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Perth"
    },
    "MRM.AX": {
        "short_name": "MMAOFFSHOR FPO",
        "long_name": "MMA Offshore Limited",
        "summary": "MMA Offshore Limited provides marine logistics and marine services to the offshore oil and gas industry in Australia and internationally. The company offers offshore services, including offtake support; supply operations support; construction support; seismic and survey support; tug and barge operations; anchor handling and towing; and accommodation support services. It also provides subsea services, such as dive and ROV, and installation support, as well as inspection, maintenance, and repair services; onshore services comprising engineering and technical management, new build and vessel modification, and marine manning services; and project logistics services, as well as operates onshore facilities. It owns and operates a fleet of approximately 30 offshore vessels. The company was formerly known as Mermaid Marine Australia Limited and changed its name to MMA Offshore Limited in December 2014. MMA Offshore Limited was founded in 1989 and is based in Welshpool, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Welshpool"
    },
    "MSG.AX": {
        "short_name": "MCSSERVICE FPO",
        "long_name": "MCS Services Limited",
        "summary": "MCS Services Limited, together with its subsidiaries, provides guard security and related services in Australia. It offers uniformed unarmed guards at retail shopping centers, government offices, health facilities, commercial properties, sports stadia, and events in the Perth metropolitan area and Western Australia. The company also provides covert security, mobile patrol, and response vehicle services. In addition, it engages in supplying, installing, and commissioning of security alarms, CCTV, biometric, and access control systems to the commercial, industrial, and domestic sectors. The company was founded in 2005 and is headquartered in Joondalup, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Joondalup"
    },
    "MSI.AX": {
        "short_name": "MULTISTACK FPO",
        "long_name": "Multistack International Limited",
        "summary": "Multistack International Limited markets and distributes industrial air conditioning equipment primarily in Australia. The company sells and services Multistack water-cooled and air-cooled water chillers for use in commercial air-conditioning and process cooling applications. It also markets and distributes organic rankine cycle engines; oil-free turbo expanders; and distributes heat exchangers, as well as provides technical and after sales support services. Multistack International Limited is headquartered in Moorabbin, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Moorabbin"
    },
    "MXI.AX": {
        "short_name": "MAXITRANS FPO",
        "long_name": "MaxiTRANS Industries Limited",
        "summary": "MaxiTRANS Industries Limited, together with its subsidiaries, designs, manufactures, sells, services, and repairs transport equipment and related components and spare parts in Australia and New Zealand. It manufactures trailer brands, and urethane foam and body panels; supplies and distributes parts; provides service and repair support; and sells and finances new and used trailing equipment. The company's products include tautliners, semi-trailers, skels, refrigerated and dry freight vans, semi-tippers, side-tippers, truck bodies and dog tippers, moving floors, multi-loaders, and dollies. It is also involved in the retail and wholesale of trailer and truck parts. The company sells its products under the Freighter, Maxi-CUBE, Hamelex White, Lusty EMS, Trout River, AZMEB, Peki, and MaxiPARTS brand names. It serves agriculture, general and refrigerated freight, infrastructure, manufacturing, mining and waste management industries. The company was founded in 1946 and is headquartered in Derrimut, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Derrimut"
    },
    "NMN.F": {
        "short_name": "MCMILLAN SHAKESPEARE LTD",
        "long_name": "McMillan Shakespeare Limited",
        "summary": "McMillan Shakespeare Limited provides salary packaging, novated leasing, disability plan management, asset management, and related financial products and services in Australia, the United Kingdom, and New Zealand. It operates through three segments: Group Remuneration Services, Asset Management, and Retail Financial Services. The Group Remuneration Services segment offers employee benefits administration services for salary packaging and ancillary services, including novated leasing asset and finance procurement, motor vehicle administration, and other services. The Asset Management segment provides financing and ancillary management services related with motor vehicles, commercial vehicles, and equipment. The Retail Financial Services segment offers retail brokerage services; and engages in the aggregation of finance originations and extended warranty cover. The company also provides fleet management and software development services. It serves federal and state governments, health groups, not-for-profit organizations, and private corporations. The company was founded in 1988 and is headquartered in Melbourne, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "NVNXF": {
        "short_name": "NOVONIX LIMITED",
        "long_name": "Novonix Limited",
        "summary": "Novonix Limited develops and supplies battery materials, equipment, and services to the lithium-ion battery market in North America. The company operates through three segments: Graphite Exploration and Mining, Battery Technology, and Battery Materials. The Graphite Exploration and Mining segment explores for graphite in Australia. The Battery Technology segment develops battery cell testing equipment and batteries, and consulting services. The Battery Materials segment develops and manufactures battery anode materials. The company is also involved in the investment and battery testing activities. Novonix Limited has strategic alliance with Harper International Corporation to develop specialized furnace technology that would enhance Novonix's synthetic graphite manufacturing process. Novonix has partnership with Emera Technologies to develop and manufacture energy storage systems for community microgrids. The company was formerly known as Graphitecorp Limited and changed its name to Novonix Limited in July 2017. Novonix Limited was founded in 2012 and is based in Brisbane, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Brisbane"
    },
    "NVX.AX": {
        "short_name": "NOVONIX FPO",
        "long_name": "Novonix Limited",
        "summary": "Novonix Limited develops and supplies battery materials, equipment, and services to the lithium-ion battery market in North America. The company operates through three segments: Graphite Exploration and Mining, Battery Technology, and Battery Materials. The Graphite Exploration and Mining segment explores for graphite in Australia. The Battery Technology segment develops battery cell testing equipment and batteries, and consulting services. The Battery Materials segment develops and manufactures battery anode materials. The company is also involved in the investment and battery testing activities. Novonix Limited has strategic alliance with Harper International Corporation to develop specialized furnace technology that would enhance Novonix's synthetic graphite manufacturing process. Novonix has partnership with Emera Technologies to develop and manufacture energy storage systems for community microgrids. The company was formerly known as Graphitecorp Limited and changed its name to Novonix Limited in July 2017. Novonix Limited was founded in 2012 and is based in Brisbane, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Brisbane"
    },
    "NWH.AX": {
        "short_name": "NRWHOLDLTD FPO",
        "long_name": "NRW Holdings Limited",
        "summary": "NRW Holdings Limited, through its subsidiaries, provides civil and mining contracting, urban development, and drilling and blasting services in Australia. It operates through four business segments: Civil, Mining, Drill and Blast, and Mining Technologies. The Civil segment delivers private and public civil infrastructure, mine development, bulk earthworks, and commercial and residential subdivision projects. Its civil construction projects include roads, bridges, tailings storage facilities, rail formations, ports, water infrastructure, and concrete installations. The Mining segment engages in the mine management, contract mining, load and haul, dragline, and coal handling preparation plant operations; maintenance activities; and fabrication of water and service vehicles. The Drill and Blast segment offers integrated and end to end production drill and blast services to the mining and civil construction sectors. The Mining Technologies segment provides materials handling, facility maintenance, and shutdown services; supplies mining technologies. The company also provides heat treatment services, as well as mining equipment solutions. NRW Holdings Limited was founded in 1994 and is based in Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Perth"
    },
    "OEC.AX": {
        "short_name": "ORBITAL FPO",
        "long_name": "Orbital Corporation Limited",
        "summary": "Orbital Corporation Limited engages in the design, manufacture, and sale of unmanned aerial vehicle (UAV) propulsion systems and flight critical components in Australia and the United States. It also focuses on the manufacture, assembly, and delivery of engines and propulsion systems for unmanned aerial vehicles. The company was formerly known as Orbital Engine Corporation Limited and changed its name to Orbital Corporation Limited in October 2004. Orbital Corporation Limited was incorporated in 1988 and is headquartered in Balcatta, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Balcatta"
    },
    "OLH.AX": {
        "short_name": "OLDFIELD H FPO",
        "long_name": "Oldfields Holdings Limited",
        "summary": "Oldfields Holdings Limited manufactures, markets, and imports scaffolding and painting accessories in Australia. The company operates through Consumer Products and Scaffolding segments. The Consumer Products segment imports, manufactures, and distributes paint brushes, paint rollers, painter's tools, garden sheds and outdoor storage systems. The Scaffolding segment manufactures and distributes scaffolding and related equipment, as well as engages in hiring scaffold and access solutions to the building maintenance and construction industries. Oldfields Holdings Limited was founded in 1916 and is headquartered in Campbelltown, Australia. Oldfields Holdings Limited operates as a subsidiary of Eqm Holdings Unit Trust.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Campbelltown"
    },
    "OREA.F": {
        "short_name": "ORBITAL CORP.LTD.",
        "long_name": "Orbital Corporation Limited",
        "summary": "Orbital Corporation Limited engages in the design, manufacture, and sale of unmanned aerial vehicle (UAV) propulsion systems and flight critical components in Australia and the United States. It also focuses on the manufacture, assembly, and delivery of engines and propulsion systems for unmanned aerial vehicles. The company was formerly known as Orbital Engine Corporation Limited and changed its name to Orbital Corporation Limited in October 2004. Orbital Corporation Limited was incorporated in 1988 and is headquartered in Balcatta, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Balcatta"
    },
    "OVT.AX": {
        "short_name": "OVATO FPO",
        "long_name": "Ovato Limited",
        "summary": "Ovato Limited provides marketing, digital premedia, commercial printing, letterbox delivery, and magazine distribution services in Australia and New Zealand. The company prints and distributes catalogues, magazines, books, brochures and flyers, stationery, newspapers, directories, packaging, and point of sale products. It is also involved in the production activities, which include photography and video, advertising production system, post production, and pre-media; and agency activities, such as communications, strategy, creative direction and design, and digital and technology solutions. The company was formerly known as PMP Limited and changed its name to Ovato Limited in February 2019. Ovato Limited was incorporated in 1990 and is headquartered in Pyrmont, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Pyrmont"
    },
    "P9D.SI": {
        "short_name": "Civmec",
        "long_name": "Civmec Limited",
        "summary": "Civmec Limited, an investment holding company, provides construction and engineering services to the oil and gas, metals and minerals, infrastructure, and marine and defense. It undertakes fabrication projects, such as structural steel, plate works, tanks, vessels, materials handling equipment, subsea and offshore structures, and pipe spooling services. The company also offers modularization services; shipbuilding services; site civil works, including earthworks, reinforcing steel works, formworks, concrete placement, backfill and compaction to final handover, and underground services; and reinforced concrete products comprising prestressed beams, parapets, structural foundations, caissons, floor slabs and retaining walls, suspended slab sections, purpose-built facilities, breakwater systems, fascia and noise wall panels, conventional reinforced girders, transfloor panels, tunnel segments, and bridge beams. In addition, the company undertakes structural, mechanical, piping, and electrical instrumentation projects consisting of structural assembly and erection, mechanical installations and alignments, piping installation and pre-commissioning support, site welding, tanks, and equipment; and provides electrical and instrumentation solutions, such as electrical infrastructure works, including substations, switch rooms, switchyards, and site reticulation, as well as electrical maintenance services. Further, it offers industrial insulation services, including sheet metal and light gauge fabrication, fireproofing, surface treatment, site installation, and processing and forming technology; integrated supply chain solutions to the onshore and offshore drilling industry; maintenance; access solutions, such as scaffolds, fabricated platforms, rope access, and tension netting systems; and executes refractory projects. Civmec Limited was founded in 2009 and is headquartered in Perth, Australia.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Australia",
        "city": "Perth"
    },
    "PG1.AX": {
        "short_name": "PEARGLOBAL FPO",
        "long_name": "Pearl Global Limited",
        "summary": "Pearl Global Limited, a clean conversion technology company, converts tires into secondary products. It converts tires into fuel oil, steel, carbon char, and energy. The company is based in Stapylton, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Stapylton"
    },
    "PKD.AX": {
        "short_name": "PARKD LTD FPO",
        "long_name": "PARKD Limited",
        "summary": "PARKD Limited, a construction technology company, constructs and supplies modular car parking systems for single and multi-level arrangements in Australia. The company was incorporated in 2016 and is based in Osborne Park, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Osborne Park"
    },
    "PPE.AX": {
        "short_name": "PEOPLEINFR FPO",
        "long_name": "People Infrastructure Ltd",
        "summary": "People Infrastructure Ltd, a workforce management company, provides contracted staffing and human resources outsourcing services in Australia and New Zealand. The company offers recruiting, on-boarding, rostering, timesheet management, pay rolling, and workplace health and safety management services. It serves community service, childcare, infrastructure, construction, industrial, landscaping, food processing, mining, and hospitality sectors. The company was founded in 1996 and is based in Albion, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Albion"
    },
    "PPK.AX": {
        "short_name": "PPK GROUP FPO",
        "long_name": "PPK Group Limited",
        "summary": "PPK Group Limited, together with its subsidiaries, engages in designing, manufacturing, distributing, hiring, servicing, and supporting underground coal mining equipment in Australia. The company offers alternators, electrical equipment, drilling and bolting equipment, mining consumables, and other underground diesel vehicles under CoalTram names. It is also involved in the manufacture of boron nitride nanotubes. The company was formerly known as Plaspak Group Limited. PPK Group Limited was founded in 1979 and is headquartered in Brisbane, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Brisbane"
    },
    "PTB.AX": {
        "short_name": "PTB GROUP FPO",
        "long_name": "PTB Group Limited",
        "summary": "PTB Group Limited, together with its subsidiaries, engages in the aviation business in Australia, Papua New Guinea, New Zealand, the Pacific Islands, North America, South America, Asia, Africa, and Europe. It operates through four segments: PTB, PT USA, PT Leasing, and IAP. The company repairs and overhauls Pratt & Whitney PT6A/PT6T, Honeywell TPE331/T53, Bell Drivetrain, and GE M601 and H series turbine engines; provides engine maintenance contracts; and trades in aircraft airframes, turbine engines, and related parts. It also leases, rents, hires, and finances aircraft and turbine engines. The company was formerly known as Pacific Turbine Brisbane Limited and changed its name to PTB Group Limited in December 2006. PTB Group Limited was founded in 2001 and is based in Pinkenba, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Pinkenba"
    },
    "QABSY": {
        "short_name": "QANTAS AIRWAYS",
        "long_name": "Qantas Airways Limited",
        "summary": "Qantas Airways Limited provides passenger and freight air transportation services in Australia and internationally. The company also offers air cargo and express freight services; and customer loyalty programs. As of June 30, 2020, it operated a fleet of 314 aircraft under the Qantas and Jetstar brands. The company was founded in 1920 and is headquartered in Mascot, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Airlines",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Mascot"
    },
    "QAN.AX": {
        "short_name": "QANTAS FPO",
        "long_name": "Qantas Airways Limited",
        "summary": "Qantas Airways Limited provides passenger and freight air transportation services in Australia and internationally. The company also offers air cargo and express freight services; and customer loyalty programs. As of June 30, 2020, it operated a fleet of 314 aircraft under the Qantas and Jetstar brands. The company was founded in 1920 and is headquartered in Mascot, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Airlines",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Mascot"
    },
    "QAN.F": {
        "short_name": "QANTAS AIRWAYS",
        "long_name": "Qantas Airways Limited",
        "summary": "Qantas Airways Limited provides passenger and freight air transportation services in Australia and internationally. The company also offers air cargo and express freight services; and customer loyalty programs. As of June 30, 2020, it operated a fleet of 314 aircraft under the Qantas and Jetstar brands. The company was founded in 1920 and is headquartered in Mascot, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Airlines",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Mascot"
    },
    "QCKSF": {
        "short_name": "QUICKSTEP HOLDINGS LTD",
        "long_name": "Quickstep Holdings Limited",
        "summary": "Quickstep Holdings Limited manufactures advanced composites for the aerospace, defense, automotive, and other advanced sectors in Australia, the United States, and internationally. It produces aerospace-grade advanced composites .Quickstep Holdings Limited was founded in 2001 and is based in Bankstown, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Bankstown"
    },
    "QHL.AX": {
        "short_name": "QUICKSTEP FPO",
        "long_name": "Quickstep Holdings Limited",
        "summary": "Quickstep Holdings Limited manufactures advanced composites for the aerospace, defense, automotive, and other advanced sectors in Australia, the United States, and internationally. It produces aerospace-grade advanced composites .Quickstep Holdings Limited was founded in 2001 and is based in Bankstown, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Bankstown"
    },
    "QIP.AX": {
        "short_name": "QANTMIP FPO",
        "long_name": "QANTM Intellectual Property Limited",
        "summary": "QANTM Intellectual Property Limited provides intellectual property services for start-up technology businesses, multinationals, public research institutions, and universities in Australia, New Zealand and Asia. The company also offers services related to patents, designs, and trademarks, as well as DCC, a litigation service in patent and trademark protection. QANTM Intellectual Property Limited was founded in 1877 and is based in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "QRL.F": {
        "short_name": "AURIZON HLDGS LTD",
        "long_name": "Aurizon Holdings Limited",
        "summary": "Aurizon Holdings Limited, through its subsidiaries, operates as a rail freight operator in Australia. It operates through Network, Coal, Bulk, and Other segments. The company transports various commodities, including mining, agricultural, industrial, and retail products; and retail goods and groceries across small and big towns, and cities, as well as coal and iron ore. It also operates and manages the Central Queensland Coal Network that consists of 2,670 kilometers of track network; and provides various specialist services, such as rail design, engineering, construction, management, and maintenance, as well as supply chain solutions. In addition, the company transports bulk rail freight services for miners, primary producers, and the manufacturing industry. Further, it is involved in the general freight business. The company was formerly known as QR National Limited and changed its name to Aurizon Holdings Limited in December 2012. Aurizon Holdings Limited was incorporated in 2010 and is headquartered in Fortitude Valley, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Fortitude Valley"
    },
    "QRNNF": {
        "short_name": "AURIZON HOLDINGS LIMITED",
        "long_name": "Aurizon Holdings Limited",
        "summary": "Aurizon Holdings Limited, through its subsidiaries, operates as a rail freight operator in Australia. It operates through Network, Coal, Bulk, and Other segments. The company transports various commodities, including mining, agricultural, industrial, and retail products; and retail goods and groceries across small and big towns, and cities, as well as coal and iron ore. It also operates and manages the Central Queensland Coal Network that consists of 2,670 kilometers of track network; and provides various specialist services, such as rail design, engineering, construction, management, and maintenance, as well as supply chain solutions. In addition, the company transports bulk rail freight services for miners, primary producers, and the manufacturing industry. Further, it is involved in the general freight business. The company was formerly known as QR National Limited and changed its name to Aurizon Holdings Limited in December 2012. Aurizon Holdings Limited was incorporated in 2010 and is headquartered in Fortitude Valley, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Fortitude Valley"
    },
    "QUB.AX": {
        "short_name": "QUBE FPO",
        "long_name": "Qube Holdings Limited",
        "summary": "Qube Holdings Limited, together with its subsidiaries, provides integrated import and export logistics services in Australia. The company's Operating Division offers services relating to the import and export of primarily containerized cargo. This division provides various services, including physical and documentary processes, and tasks of the import/export supply chain, such as road and rail transport of containers to and from ports, operation of container parks, customs and quarantine services, warehousing, intermodal terminals, international freight forwarding, and bulk rail haulage for rural commodities. It also offers a range of logistics services relating to the import and export of primarily non-containerized freight with a focus on automotive, bulk, and break bulk products; and an integrated logistics solution for the automotive industry covering a range of activities comprising stevedoring, processing, and delivery. In addition, this division provides stevedoring and related logistics services for the oil and gas industry, forestry products, and project and general cargo; and handles a range of commodities that include iron ore, copper, nickel concentrate, and mineral sands. The company's Infrastructure & Property Division owns a 243 hectare parcel of land in the Moorebank logistics park project; a multi-user facility for the stevedoring industry; and a property at Minto in Sydney. It also owns interest in the Quattro Grain Trust, and a 50% interest in TQ Holdings Pty Limited. The company also offers container stevedoring services in Australia. The company was formerly known as Qube Logistics Holdings Limited and changed its name to Qube Holdings Limited in November 2012. Qube Holdings Limited was incorporated in 2011 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "QUBSF": {
        "short_name": "QANTAS AIRWAYS",
        "long_name": "Qantas Airways Limited",
        "summary": "Qantas Airways Limited provides passenger and freight air transportation services in Australia and internationally. The company also offers air cargo and express freight services; and customer loyalty programs. As of June 30, 2020, it operated a fleet of 314 aircraft under the Qantas and Jetstar brands. The company was founded in 1920 and is headquartered in Mascot, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Airlines",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Mascot"
    },
    "R1H.F": {
        "short_name": "BRAMBLES LTD",
        "long_name": "Brambles Limited",
        "summary": "Brambles Limited operates as a supply-chain logistics company. The company operates through CHEP North America and Latin America; CHEP Europe, Middle East, Africa and India; and CHEP Australia, New Zealand and Asia, excluding India segments. It engages in the pooling of unit-load equipment and associated services, focusing on the outsourced management of pallets, crates, and containers. The company serves customers in the fast-moving consumer goods, fresh produce, beverage, retail, and general manufacturing industries in the Americas, Europe, Australia, and internationally. Brambles Limited was founded in 1875 and is based in Sydney, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "R4L.F": {
        "short_name": "REGIONAL EXPRESS HLDGS",
        "long_name": "Regional Express Holdings Limited",
        "summary": "Regional Express Holdings Limited engages in the air transportation of passengers and freight. The company operates through Regular Public Transport and Charter segments. It provides aeromedical transport services; fly in/fly out charter services; airfreight charter services; and corporate jet charter services. The company also offers training programs to students and other airlines; and airline cadet pilot training for global carriers. As of September 30, 2020, it operated a fleet of 60 Saab 340 aircraft on approximately 1,500 weekly flights to 59 destinations throughout all states in Australia. The company was formerly known as Australiawide Airlines Limited and changed its name to Regional Express Holdings Limited in 2005. Regional Express Holdings Limited was founded in 1953 and is based in Mascot, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Airlines",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Mascot"
    },
    "R9E.F": {
        "short_name": "EDEN INNOVATIONS LTD.",
        "long_name": "Eden Innovations Ltd",
        "summary": "Eden Innovations Ltd provides various clean technology solutions. The company develops, manufactures, and sells EdenCrete, a carbon nanotube enriched admixture for concrete; and OptiBlend, a retrofit dual fuel technology for diesel generator sets. It is also involved in pyrolysis process, a technology to produce carbon nanotube and carbon nanofibre, and hydrogen from natural gas. In addition, the company provides Hythane, a blend of hydrogen and natural gas; and EdenPlast, a CNT enriched polypropylene tape made by conventional extrusion process. Eden Innovations Ltd was incorporated in 2004 and is based in Perth, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Perth"
    },
    "RBR.AX": {
        "short_name": "RBR GROUP FPO",
        "long_name": "RBR Group Limited",
        "summary": "RBR Group Limited, through its subsidiaries, provides training, and local and expatriate staffing solutions. The company also offers labor, training, and professional services in Mozambique. In addition, it provides range of international qualifications and training services, as well as bespoke training programs; delivers technical, commercial, and community training programs; operates mobile training facilities; and labor broking services. Further, the company offers business development services, including market orientation, beach head strategies, contracting and business development support, and local business mentoring; corporate administration services, such as business participation, licensing of activities, registration of commercial representatives, drafting of contracts, and compliance needs analysis and corrective action implementation; and consulting and other business services. It serves oil and gas, resources/mining, construction, and logistics industries. The company was formerly known as Rubicon Resources Limited and changed its name to RBR Group Limited in November 2015. RBR Group Limited was incorporated in 2005 and is headquartered in Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Perth"
    },
    "RCH.F": {
        "short_name": "ROTO-GRO INTERN. LTD O.N.",
        "long_name": "Roto-Gro International Limited",
        "summary": "Roto-Gro International Limited, an agricultural company, produces and sells hydroponic rotational garden systems for the cultivation of cannabis and fresh produce in North America, Europe, and Australia. It also provides advanced automated nutrient delivery and water management systems, including fertigation, nutrient lifecycle planning, facility design and setup, and management solutions, as well as iGrow software that offers dynamic real time analysis of each grow room's environment and nutrient management optimization. It has collaboration with Gibio Inc. and Freshero Pty Ltd for perishable foods. The company was incorporated in 2015 and is based in South Melbourne, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "RDF.AX": {
        "short_name": "REDFLEX FPO",
        "long_name": "Redflex Holdings Limited",
        "summary": "Redflex Holdings Limited, together with its subsidiaries, develops and implements intelligent traffic management products and services in the Americas, Australia, Saudi Arabia, United Arab Emirates, Ireland, the United Kingdom, New Zealand, and Asia. The company's solutions include Alcyon, a cloud-based case management and photo enforcement processing solution; TruVision, a traffic and speed enforcement laser; Alcyon IQ, a system monitoring, data matching, and alerting solution; Radarcam, a speed detection and enforcement device; Halo, an enforcement solution that delivers a diverse range of Intelligent Transport Systems applications; and Halo Distributed, a vehicle detection point to point system for accurate automatic number plate recognition applications, traffic monitoring, and enforcement. It also provides Deployable 250, a solution that utilises dual radar technology to capture incident and enforcement rates; Halo Edge, a video analytics platform for enforcement across a wide array of environments and offence types; and Red X, a lane management solution, which alerts drivers to speed changes and land closures. Redflex Holdings Limited was founded in 1995 and is headquartered in South Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "RDG.AX": {
        "short_name": "RESDEV FPO",
        "long_name": "Resource Development Group Limited",
        "summary": "Resource Development Group Limited provides contracting, remedial, and construction services to the resource, infrastructure, energy, government, utilities, and defense sectors in Australia. The company offers whole of project life-cycle services, including multi-disciplinary construction services, such as civil, SMPT, E&I, and non-process building works; ancillary maintenance services; EPCM, PMC, or integrated team project delivery solutions; EPC project delivery solutions; design and construct package delivery solutions; and optimizing services, including debottlenecking existing operations. It also provides materials handling solutions, such as mobile crushing and screening, modular crushing and screening, project management, and maintenance and field service; and develops residential buildings. The company was incorporated in 2011 and is headquartered in Perth, Australia. Resource Development Group Limited is a subsidiary of Mineral Resources Limited.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Perth"
    },
    "REFXF": {
        "short_name": "REDFLOW LTD",
        "long_name": "RedFlow Limited",
        "summary": "RedFlow Limited develops, manufactures, and sells zinc-bromine flowing electrolyte battery modules (ZBMs) worldwide. The company offers ZBM2, an energy storage system with 10 kilowatt-hours (kWh) capacity; and ZCell, a home and office energy storage system with 10kWh of sustainable energy storage. Its batteries are used in telecommunications, commercial and industrial, grid-scale, and residential applications. RedFlow Limited was founded in 2005 and is headquartered in Brisbane, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Brisbane"
    },
    "REH.AX": {
        "short_name": "REECE FPO",
        "long_name": "Reece Limited",
        "summary": "Reece Limited supplies plumbing, bathroom, heating, ventilation, air-conditioning, waterworks, and refrigeration products in Australia, the United States, and New Zealand. It serves customers in the trade, retail, and commercial markets. The company was formerly known as Reece Australia Limited and changed its name to Reece Limited in November 2015. Reece Limited was founded in 1920 and is based in Burwood, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Burwood"
    },
    "REX.AX": {
        "short_name": "REG EX HLD FPO",
        "long_name": "Regional Express Holdings Limited",
        "summary": "Regional Express Holdings Limited engages in the air transportation of passengers and freight. The company operates through Regular Public Transport and Charter segments. It provides aeromedical transport services; fly in/fly out charter services; airfreight charter services; and corporate jet charter services. The company also offers training programs to students and other airlines; and airline cadet pilot training for global carriers. As of September 30, 2020, it operated a fleet of 60 Saab 340 aircraft on approximately 1,500 weekly flights to 59 destinations throughout all states in Australia. The company was formerly known as Australiawide Airlines Limited and changed its name to Regional Express Holdings Limited in 2005. Regional Express Holdings Limited was founded in 1953 and is based in Mascot, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Airlines",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Mascot"
    },
    "RFT.AX": {
        "short_name": "RECTIFIER FPO",
        "long_name": "Rectifier Technologies Limited",
        "summary": "Rectifier Technologies Limited designs and manufactures power rectifiers in Australia, Asia, North America, South America, Europe, and Oceania. It offers electronic components; rectifiers, controllers, accessories, and systems for the power generation, distribution, and defense industries; and power supplies for the transport and telecommunications industries. The company also provides electric vehicle and battery charges, and power supplies; and electronic and specialized magnetic components. Rectifier Technologies Limited was incorporated in 1992 and is based in Burwood, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Burwood"
    },
    "RFX.AX": {
        "short_name": "REDFLOW FPO",
        "long_name": "RedFlow Limited",
        "summary": "RedFlow Limited develops, manufactures, and sells zinc-bromine flowing electrolyte battery modules (ZBMs) worldwide. The company offers ZBM2, an energy storage system with 10 kilowatt-hours (kWh) capacity; and ZCell, a home and office energy storage system with 10kWh of sustainable energy storage. Its batteries are used in telecommunications, commercial and industrial, grid-scale, and residential applications. RedFlow Limited was founded in 2005 and is headquartered in Brisbane, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Brisbane"
    },
    "RGI.AX": {
        "short_name": "ROTOGRO FPO",
        "long_name": "Roto-Gro International Limited",
        "summary": "Roto-Gro International Limited, an agricultural company, produces and sells hydroponic rotational garden systems for the cultivation of cannabis and fresh produce in North America, Europe, and Australia. It also provides advanced automated nutrient delivery and water management systems, including fertigation, nutrient lifecycle planning, facility design and setup, and management solutions, as well as iGrow software that offers dynamic real time analysis of each grow room's environment and nutrient management optimization. It has collaboration with Gibio Inc. and Freshero Pty Ltd for perishable foods. The company was incorporated in 2015 and is based in South Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "RR7.SG": {
        "short_name": "Thorn Group Ltd. Registered Sha",
        "long_name": "Thorn Group Limited",
        "summary": "Thorn Group Limited, a diversified financial services company, provides alternate consumer and commercial leasing products, and consumer and commercial financing solutions. It is involved in the leasing of household products to consumers; and provision of commercial asset finance to small and medium size enterprises under the Radio Rentals name. Thorn Group Limited was founded in 1937 and is based in Chullora, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Australia",
        "city": "Chullora"
    },
    "RZA.F": {
        "short_name": "AUSTIN ENGINEERING LTD.",
        "long_name": "Austin Engineering Limited",
        "summary": "Austin Engineering Limited, together with its subsidiaries, manufactures, repairs, overhauls, and supplies mining attachment products, and other associated products and services for the industrial and resources-related business sectors. It offers off-highway dump truck bodies, buckets, water tanks, tyre handlers, and other ancillary equipment. The company also provides on and off site repair and maintenance, condition monitoring, engineering, product improvements, heavy equipment lifting and transport, specialized fabrication, blasting and painting, line boring and machining, and CNC profile cutting and pressing services. It serves miners, mining contractors, and original equipment manufacturers in Asia-Pacific, North America, and South America. The company was founded in 1982 and is headquartered in Milton, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Milton"
    },
    "SCT.AX": {
        "short_name": "SCOUTSEC FPO",
        "long_name": "Scout Security Limited",
        "summary": "Scout Security Limited provides home security systems and services in the United States. The company's products include hub that connects sensors and Scout's integrations; door panel, which monitors the opening and closing of door, houses a loud siren to deter intruders, and equipped with an RFID reader so one can arm and disarm system without a phone; and motion sensor that monitors room with one sensor for monitoring critical paths through a house; and access sensor, which detects opening and closing of windows, doors, cabinets, and safes. It also offers indoor cameras, video doorbells, keypads, water sensors, glass break sensors, smoke alarm, and door locks, as well as refurbished products; and accessories, such as yard sign, panic button, remote control, siren and zigbee repeater, window sticker, key fobs, and RFID sticker. The company provides monitoring services. It sells its products and services directly through its Website, as well as through Amazon and Zego partners. The company was founded in 2013 and is based in Leederville, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Leederville"
    },
    "SEK.AX": {
        "short_name": "SEEK FPO",
        "long_name": "SEEK Limited",
        "summary": "SEEK Limited, together with its subsidiaries, provides online employment marketplace services in Australia and internationally. It operates through Asia Pacific & Americas and SEEK Investments segments. The company engages in online matching of hirers and candidates with career opportunities and other related services; investing in early stage businesses and technologies, which are in the human capital management market; and the distribution and provision of higher education courses. It also provides online education courses and other offline services. The company was founded in 1997 and is headquartered in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "SGF.AX": {
        "short_name": "SGFLEET FPO",
        "long_name": "SG Fleet Group Limited",
        "summary": "SG Fleet Group Limited provides motor vehicle fleet management, vehicle leasing, short term hire, consumer vehicle finance, and salary packaging services in Australia, New Zealand, and the United Kingdom. The company offers fleet management services, including funding options, maintenance plans, registration renewal, fuel cards and reporting, breakdown and accident assistance, comprehensive insurance, vehicle acquisition and disposal, and other products and services. Its products include Bookingintelligence, a resource management application that enables to manage a pool of resources online; Fleetintelligence 2.0, a reporting and management system that enables access to information on vehicle activity; maintenance; and vehicle acquisition and disposal services. The company also offers commercial vehicle and truck solutions, including multiple leasing options; initial commissioning, sourcing, and acquisition; maintenance, registration, and toll management; asset disposal; and regular reviews. In addition, it provides salary packaging services; sgfleet app to track Novated lease; Logbook and the Logbook App for record keeping requirements of vehicles used for business purposes; vehicle accessories, such as window tinting, in-car communications, vehicle safety kits and security systems, satellite navigation systems, ARB's protection products, plates, in-vehicle entertainment options, and car care protection products; FBT intelligence, a computer based system to make collecting and analyzing information for fringe benefits taxes; and registration management, traffic infringements, and toll management services. The company was founded in 1986 and is based in Pymble, Australia. SG Fleet Group Limited is a subsidiary of Bluefin Investments Limited.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Pymble"
    },
    "SGI.AX": {
        "short_name": "STEALTH FPO",
        "long_name": "Stealth Global Holdings Limited",
        "summary": "Stealth Global Holdings Limited, together with its subsidiaries, supplies and distributes safety, industrial, healthcare, and workplace consumable products to the resources, transportation, industrial, manufacturing, engineering, construction, contracting, and trade retail sectors. It also provides product distribution and contract supply services. The company has operations in Australia, the United Kingdom, Africa, Asia, and Europe. The company was founded in 2014 and is headquartered in Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Perth"
    },
    "SIQ.AX": {
        "short_name": "SMARTGROUP FPO",
        "long_name": "Smartgroup Corporation Ltd",
        "summary": "Smartgroup Corporation Ltd provides employee management services. It operates through Outsourced Administration (OA); Vehicle Services (VS); and Software, Distribution, and Group Services (SDGS) segments. The OA segment offers outsourced salary packaging services, novated leasing, share plan administration, and outsourced payroll services. The VS segment provides end-to-end fleet management services. The SDGS segment offers salary packaging software solutions; markets salary packaging debit cards; and distributes vehicle insurances and workforce management software to the healthcare industry. The company serves community and charity workers in not-for-profit organizations; teachers, administrators, and support personnel in the education industry; nurses, clinicians, and auxiliary staff in the health industry; government sector; and corporate organizations. Smartgroup Corporation Ltd was founded in 1999 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "SIV.AX": {
        "short_name": "SIV CAPITL FPO",
        "long_name": "SIV Capital Limited",
        "summary": "SIV Capital Limited engages in the rental and financing of commercial equipment in Australia, New Zealand, and Canada. It is also involved in finance leasing activities. The company was formerly known as Silver Chef Limited and changed its name to SIV Capital Limited in November 2019. SIV Capital Limited was founded in 1990 and is based in West End, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "West End"
    },
    "SKLTY": {
        "short_name": "SEEK LIMITED",
        "long_name": "SEEK Limited",
        "summary": "SEEK Limited, together with its subsidiaries, provides online employment marketplace services in Australia and internationally. It operates through Asia Pacific & Americas and SEEK Investments segments. The company engages in online matching of hirers and candidates with career opportunities and other related services; investing in early stage businesses and technologies, which are in the human capital management market; and the distribution and provision of higher education courses. It also provides online education courses and other offline services. The company was founded in 1997 and is headquartered in Melbourne, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "SKS.AX": {
        "short_name": "SKS TECH FPO",
        "long_name": "SKS Technologies Group Limited",
        "summary": "SKS Technologies Group Limited designs, distributes, and installs lighting and audiovisual technologies, products, and solutions in Australia, New Zealand, and Asia. It offers audiovisual, communication, architectural lighting, street lighting and columns, horticultural lighting, electrical, energy rebate auditing, lighting controls, floodlighting, electrical cabling, and immersive AV technologies and solutions, as well as installation support services. The company also provides various LED lighting solutions, such as track and spot systems, modular lighting systems, downlights, recessed luminaires, surface mounted systems, pendant luminaries, continuous row systems, table and floor lamps, street and area lighting, up-lighting, high bay, weatherproof luminaires, outdoor lighting, lighting management systems, and accessories. It serves commercial, industrial, infrastructure retail, health, defense, education, residential, glasshouses, research facilities, and horticultural sectors. The company was formerly known as Enevis Limited and changed its name to SKS Technologies Group Limited in December 2020. SKS Technologies Group Limited was incorporated in 1962 is headquartered in West Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "West Melbourne"
    },
    "SLD.F": {
        "short_name": "SEEK LTD",
        "long_name": "SEEK Limited",
        "summary": "SEEK Limited, together with its subsidiaries, provides online employment marketplace services in Australia and internationally. It operates through Asia Pacific & Americas and SEEK Investments segments. The company engages in online matching of hirers and candidates with career opportunities and other related services; investing in early stage businesses and technologies, which are in the human capital management market; and the distribution and provision of higher education courses. It also provides online education courses and other offline services. The company was founded in 1997 and is headquartered in Melbourne, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "SMW.NZ": {
        "short_name": "SMW Group Limited Ordinary Shar",
        "long_name": "SMW Group Limited",
        "summary": "SMW Group Limited provides solutions for mining, rail, and defence sectors in Australia. It provides various field and workshop maintenance services; and designs, engineers, fabricates, and services heavy equipment. The company also engages in rail wagon repairs; and manufactures rail wagon doors, metal rail sleepers, and other components. SMW Group Limited is headquartered in Rockhampton, Australia.",
        "currency": "NZD",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "Australia",
        "city": "Rockhampton"
    },
    "SND.AX": {
        "short_name": "SAUNDERS FPO",
        "long_name": "Saunders International Limited",
        "summary": "Saunders International Limited engages in the design, construction, and maintenance of steel bulk liquid storage facilities, tanks, and road and rail bridges in Australia. The company also manufactures precast concrete products for transport infrastructure projects; and provides a range of specialized services for the maintenance of commercial, industrial, and marine infrastructure and assets. In addition, it engages in the engineering, procurement, and construction of fuel and chemical storage terminals, bridges and marine structures, precast concrete, concrete foundation works for heavy industry, foundation systems, jetty and wharves construction, building and construction management, water reservoirs, and pumping stations, as well as coal bins, hoppers, and associated steel works. Further, the company provides various asset services comprising refinery and industrial services, shutdowns and refurbishment, furnace and boiler maintenance, pressure welding, air heater overhauls and upgrades, general base line maintenance, pumps and steam valve overhaul, high performance coatings and linings, abrasive blasting and protective coatings, and structural strengthening services, as well as services for fabrication, genera, structural, piping, and pressure equipment. Saunders International Limited was founded in 1951 and is based in Rhodes, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Rhodes"
    },
    "SOP.AX": {
        "short_name": "SYNERTEC FPO",
        "long_name": "Synertec Corporation Limited",
        "summary": "Synertec Corporation Limited provides specialist engineering and compliance services in Australia. The company offers services in the areas of project and construction management; process and mechanical engineering; LNG custody transfer system; analyzer systems; automation and control engineering; and functional safety, as well as compliance and validation services. It serves oil and gas, pharmaceutical, water, petrochemical, terminal and defense, and food and dairy industries. The company was formerly known as SML Corporation Limited and changed its name to Synertec Corporation Limited as a result of its acquisition of Synertec Pty Ltd in August 2017. Synertec Corporation is headquartered in Richmond, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Richmond"
    },
    "SP3.AX": {
        "short_name": "SPECTUR FPO",
        "long_name": "Spectur Limited",
        "summary": "Spectur Limited designs, develops, manufactures, and sells remote solar sensing, thinking, and acting platforms, and related products and services in Australia. The company offers 3G/4G solar security, time-lapse, and thermal security camera systems; and camera emergency warning systems, including shark warning system that bridges the crucial time gap between a shark sighting and authorities alerting beach users. It also provides portable hard stand base; and security camera rapid deployment trailer for mobile and temporary applications. In addition, the company offers security cameras for hire. Its products are used in construction and building, government, warehouse and logistics, farming and agriculture, and utility sectors, as well as remote sites. Spectur Limited was incorporated in 2009 and is based in Welshpool, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Welshpool"
    },
    "SREMF": {
        "short_name": "SUNRISE ENERGY METALS LTD",
        "long_name": "Sunrise Energy Metals Limited",
        "summary": "Sunrise Energy Metals Limited, together with its subsidiaries, provides metals recovery and industrial water treatment services primarily in Australia. It operates in two segments, Water and Metals. The Water segment offers Continuous Ionic Filtration, Macroporous Polymer Adsorption, and Graphene Oxide and BIOCLENS resin technologies to filter, separate, purify, and recycle polluted water for drinking, agricultural, recreational, and industrial uses. The Metals segment provides Clean-iX resin technology for the extraction and purification of a range of resources, including base and precious metals, as well as radioactive elements, such as uranium. This segment is also involved in the development of the Sunrise project in New South Wales. The company was formerly known as Clean TeQ Holdings Limited and changed its name to Sunrise Energy Metals Limited in March 2021. Sunrise Energy Metals Limited was founded in 1990 and is based in Notting Hill, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Notting Hill"
    },
    "SRG.AX": {
        "short_name": "SRGGLOBAL FPO",
        "long_name": "SRG Global Limited",
        "summary": "SRG Global Limited provides engineering-led specialist asset, construction, and mining services. The company operates through Construction, Asset Services, and Mining Services segments. The Construction segment supplies integrated products and services to customers involved in the construction of infrastructure, including bridges, dams, office towers, high rise apartments, shopping centers, hotels, car parks, recreational buildings, and hospitals. The Asset Services segment supplies integrated services to customers in various sectors comprising oil and gas, energy, major infrastructure, offshore, mining, power generation, water treatment plants, commissioning, decommissioning, shutdowns, and civil works. The Mining Services segment provides ground solutions, which include production drilling, ground and slope stabilization, design engineering, and monitoring services to mining clients. The company was formerly known as Structural Systems Limited and changed its name to SRG Global Limited in November 2014. SRG Global Limited was founded in 1961 and is headquartered in Subiaco, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Subiaco"
    },
    "SRH.AX": {
        "short_name": "SAFEROADS FPO",
        "long_name": "Saferoads Holdings Limited",
        "summary": "Saferoads Holdings Limited provides road safety products and solutions in Australia. The company offers flexible guide posts and signage products; rubber-based traffic calming products, including separation kerbs and wheel stops; variable messaging sign boards; decorative and standard street, and road light poles, as well as permanent and temporary public solar lighting poles; and permanent and temporary crash cushions, such as bollards and safety barriers. It also rents road safety solutions. The company is headquartered in Pakenham, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Pakenham"
    },
    "SRL.AX": {
        "short_name": "SUNRISE FPO",
        "long_name": "Sunrise Energy Metals Limited",
        "summary": "Sunrise Energy Metals Limited, together with its subsidiaries, provides metals recovery and industrial water treatment services primarily in Australia. It operates in two segments, Water and Metals. The Water segment offers Continuous Ionic Filtration, Macroporous Polymer Adsorption, and Graphene Oxide and BIOCLENS resin technologies to filter, separate, purify, and recycle polluted water for drinking, agricultural, recreational, and industrial uses. The Metals segment provides Clean-iX resin technology for the extraction and purification of a range of resources, including base and precious metals, as well as radioactive elements, such as uranium. This segment is also involved in the development of the Sunrise project in New South Wales. The company was formerly known as Clean TeQ Holdings Limited and changed its name to Sunrise Energy Metals Limited in March 2021. Sunrise Energy Metals Limited was founded in 1990 and is based in Notting Hill, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Notting Hill"
    },
    "SSM.AX": {
        "short_name": "SRVSTREAM FPO",
        "long_name": "Service Stream Limited",
        "summary": "Service Stream Limited accesses, designs, builds, installs, and maintains networks in Australia. It operates through four segments: Fixed Communications, Network Construction, Energy & Water, and Comdain Infrastructure segments. The Fixed Communications segment engages in the provision of a range of operations, maintenance, installation, design, and construction services, including customer connections for owners of fixed-line telecommunication; and service and network assurance; design, construction, and installation of broadband services, as well as projects for asset remediation, augmentation, and relocation. The Network Construction segment offers a range of design, construction, and related services to the owners of fixed-line and wireless telecommunications networks. Its services include site acquisition, engineering, design, and construction of wireless and fixed-line projects. The Energy & Water segment offers a range of specialist metering, new energy, and inspection services to gas, water, and electricity network owners and other customers. Its services meter reading and asset replacement services; engineering, design, and construction services for energy-related products; and specialist inspection, auditing, and compliance services. The Comdain Infrastructure segment offers a range of operations, maintenance, design, and construction services to gas and water network owners and operators. Its services comprise network assurance; asset upgrade and replacement; and engineering, design, and construction services for network assets, as well as specialist electrical and mechanical instrumentation services. The company was incorporated in 1996 and is headquartered in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "STGXF": {
        "short_name": "SMARTGROUP CORPORATION LIMITED",
        "long_name": "Smartgroup Corporation Ltd",
        "summary": "Smartgroup Corporation Ltd provides employee management services. It operates through Outsourced Administration (OA); Vehicle Services (VS); and Software, Distribution, and Group Services (SDGS) segments. The OA segment offers outsourced salary packaging services, novated leasing, share plan administration, and outsourced payroll services. The VS segment provides end-to-end fleet management services. The SDGS segment offers salary packaging software solutions; markets salary packaging debit cards; and distributes vehicle insurances and workforce management software to the healthcare industry. The company serves community and charity workers in not-for-profit organizations; teachers, administrators, and support personnel in the education industry; nurses, clinicians, and auxiliary staff in the health industry; government sector; and corporate organizations. Smartgroup Corporation Ltd was founded in 1999 and is headquartered in Sydney, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "SVW.AX": {
        "short_name": "SEVEN GRP FPO",
        "long_name": "Seven Group Holdings Limited",
        "summary": "Seven Group Holdings Limited engages in the heavy equipment sales and service, equipment hire, media, broadcasting, and energy assets businesses in Australia and internationally. It operates through WesTrac, Coates Hire, AllightSykes, Energy, Media Investments, and Other Investments segments. The company operates as a Caterpillar dealer providing heavy equipment sales and support services in Western Australia, New South Wales, and the Australian Capital Territory. It also provides a range of general and specialist equipment on hire to various markets, including engineering, building construction and maintenance, mining and resources, manufacturing, government, and events. In addition, the company engages in the manufacture, assembly, sale, and support of lighting towers, and FG Wilson power generation and dewatering equipment, as well as distributes Perkins engines. Further, it invests in listed and unlisted media organizations; holds operated and non-operated oil and gas interests; and other investments in properties. Seven Group Holdings Limited was incorporated in 2010 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "SXE.AX": {
        "short_name": "STH X ELEC FPO",
        "long_name": "Southern Cross Electrical Engineering Limited",
        "summary": "Southern Cross Electrical Engineering Limited provides electrical, instrumentation, communication, and maintenance services in Australia. It offers electrical and instrumentation (E&I) construction services, which include installation and commissioning of greenfield and brownfield upgrade projects in metropolitan, remote, and challenging environments. The company also provides fixed plant E&I construction; distribution and transmission line installation; substations, transformer, and switchyard installations; HV, LV control, instrument, and communication cabling and terminations; auditing, rectifications, and completions; constructability reviews; primary and secondary injection protection testing; instrumentation, loop checking, and calibrations; hazardous area installations; instrument air and tubing installation; and procurement and logistics management. In addition, it offers E&I services and maintenance, such as brownfields operational support, programed and breakdown maintenance, planned shutdown management, and sustaining capital project development; and in-house design and construct capability, asset life cycle management, hazardous area auditing and verification, procurement, and inspection and testing services. Further, the company provides communications services, such as integration and installation of communications technologies, such as communication equipment, data cabling, and fiber optics. It serves various markets comprising commercial developments; mining, and oil and gas; public infrastructure and defense; telecommunications and data centers; and industrial, utilities, and energy. The company was founded in 1978 and is headquartered in Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Perth"
    },
    "SYD.AX": {
        "short_name": "SYDAIRPORT STAPLED",
        "long_name": "Sydney Airport Limited",
        "summary": "Sydney Airport Limited owns Sydney Airport. The company provides international and domestic passenger services. It also offers aeronautical services, including access to terminals, infrastructure, apron parking, and airfield and terminal facilities, as well as government mandated security services for airlines; and parking and ground transport services, as well as leases commercial space to tenants whose activities comprise duty free, food and beverage, financial, and advertising services. In addition, the company is involved in the leasing of terminal space, buildings, and other space in the Sydney Airport; and rental of cars. Sydney Airport Limited was founded in 1919 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "SYDDF": {
        "short_name": "SYDNEY AIRPORT CORPORATION LTD",
        "long_name": "Sydney Airport Limited",
        "summary": "Sydney Airport Limited owns Sydney Airport. The company provides international and domestic passenger services. It also offers aeronautical services, including access to terminals, infrastructure, apron parking, and airfield and terminal facilities, as well as government mandated security services for airlines; and parking and ground transport services, as well as leases commercial space to tenants whose activities comprise duty free, food and beverage, financial, and advertising services. In addition, the company is involved in the leasing of terminal space, buildings, and other space in the Sydney Airport; and rental of cars. Sydney Airport Limited was founded in 1919 and is based in Sydney, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "TBUIF": {
        "short_name": "TUBI LTD",
        "long_name": "Tubi Limited",
        "summary": "Tubi Limited, together with its subsidiaries, manufactures and sells high density polyethylene (HDPE) pipes in Australia, the United States, and New Zealand. Its products include mobile modular extrusions, HDPEs, large bore reeling, stringing, HDPE 40bars, and corrugated pipes. The company's products are used in irrigation, mining, shale gas and LNG, water infrastructure, pipe relining, and power sectors. Tubi Limited was founded in 1972 and is based in Paddington, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Paddington"
    },
    "TCL.AX": {
        "short_name": "TRANSURBAN STAPLED",
        "long_name": "Transurban Group",
        "summary": "Transurban Group develops, operates, manages, and maintains toll road networks. It operates 20 toll roads in Sydney, Melbourne, and Brisbane in Australia; the Greater Washington area of Virginia, the United States; and Montreal, Canada. The company is headquartered in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Infrastructure Operations",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "TG9.F": {
        "short_name": "CLEANAWAY WASTE MNGMT",
        "long_name": "Cleanaway Waste Management Limited",
        "summary": "Cleanaway Waste Management Limited provides waste management, industrial, and environmental services in Australia. It operates through three segments: Solid Waste Services, Industrial & Waste Services, and Liquid Waste & Health Services. The company offers commercial and industrial, municipal, and residential collection services for various types of solid waste streams, including general waste, recyclables, construction, and demolition waste, as well as medical and washroom services. It is also involved in the ownership and management of waste transfer stations, resource recovery and recycling facilities, secure product destruction, quarantine treatment operations, and landfills; sale of recovered paper, cardboard, metals, and plastics; and collection, treatment, processing, and recycling of liquid and hazardous waste, including industrial waste, grease trap waste, oily waters, and used mineral and cooking oils in packaged and bulk forms. In addition, the company offers industrial solutions comprising industrial cleaning, vacuum tanker loading, site remediation, sludge management, parts washing, concrete remediation, CCTV, corrosion protection, and emergency response services. Further, it refines and recycles used mineral oils to produce fuel oils and base oils; generates and sells electricity produced utilizing landfill gas; and provides health and biohazardous waste, organic waste, e-waste recycling, industrial construction and cleaning, and equipment cleaning services, as well as spill kits. The company was formerly known as Transpacific Industries Group Ltd. and changed its name to Cleanaway Waste Management Limited in February 2016. Cleanaway Waste Management Limited was incorporated in 2002 and is headquartered in Melbourne, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "TGA.AX": {
        "short_name": "THORN GRP FPO",
        "long_name": "Thorn Group Limited",
        "summary": "Thorn Group Limited, a diversified financial services company, provides alternate consumer and commercial leasing products, and consumer and commercial financing solutions. It is involved in the leasing of household products to consumers; and provision of commercial asset finance to small and medium size enterprises under the Radio Rentals name. Thorn Group Limited was founded in 1937 and is based in Chullora, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Chullora"
    },
    "TPP.AX": {
        "short_name": "TEMPO FPO",
        "long_name": "Tempo Australia Limited",
        "summary": "Tempo Australia Limited provides construction, maintenance, and asset management services to the telecommunications, infrastructure, resources, power, renewable energy, industrial, and commercial sectors in Australia. It operates through Asset Maintenance and Service; and Construction & Electrical Project Work segments. The company offers shutdown services; preventative maintenance services, such as switchboard inspections, thermographic scanning, generator servicing, lightning protection, power factor correction, and UPS maintenance; and compliance services, including RCR testing, emergency exit lighting, appliance test and tagging, failure point analysis, auditing, and certification. It also provides planned and reactive maintenance services comprising emergency breakdown, lighting repairs, automation, minor works/small projects, CTV/MATV, and data and communication; and project services to manage electrical, instrumentation, and communication projects. The company was formerly known as Fermiscan Holdings Limited and changed its name to Tempo Australia Limited in June 2012. Tempo Australia Limited was incorporated in 2000 and is based in West Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "West Perth"
    },
    "TPS.AX": {
        "short_name": "THREAT PRO FPO",
        "long_name": "Threat Protect Australia Limited",
        "summary": "Threat Protect Australia Limited provides security, monitoring, and risk management services for personal and business use in Australia. It operates through Monitoring, Protective Services, and Service segments. The company offers 24-hour monitored home security systems; intruder detection systems, safe@home and safe heaven-duress alarms, and uniformed security guards, as well as alarm and CCTV installation and maintenance services. It also provides high net worth family security solutions, including the development of personal and family safety procedures, ongoing review and assessment to the penetrability of existing residences, evacuation and emergency planning, residential and commercial security systems, phone based duress and location services, customized electronic dashboards, personal safety and travel awareness training services, incident management and response services, close personal protection/personal security drivers, and supplier selection and vetting services. In addition, the company offers business security solutions, such as security risk advisory and security program development services, customer liaison and security personnel, staff safety training services, and protective technology and monitored security systems; security and risk consulting; threat, risk, and vulnerability assessments; and investigation, due diligence, and surveillance and counter surveillance services, as well as technical surveillance counter measures. Further, it provides security personnel solutions, including security officers, close personal protection and concierge personnel, and personal delivery and transport services. The company was founded in 1993 and is based in West Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "West Perth"
    },
    "TRAUF": {
        "short_name": "TRANSURBAN GROUP",
        "long_name": "Transurban Group",
        "summary": "Transurban Group develops, operates, manages, and maintains toll road networks. It operates 20 toll roads in Sydney, Melbourne, and Brisbane in Australia; the Greater Washington area of Virginia, the United States; and Montreal, Canada. The company is headquartered in Melbourne, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Infrastructure Operations",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "TTI.AX": {
        "short_name": "TRAFFIC FPO",
        "long_name": "Traffic Technologies Limited",
        "summary": "Traffic Technologies Limited, together with its subsidiaries, provides traffic solutions in Australia and internationally. The company designs, manufactures, and installs traffic signals, traffic controllers, pedestrian countdown timers, electronic road signs, emergency telephones, road lighting products, and control systems. It also supplies a range of directional and regulatory traffic signs and traffic control products to road traffic authorities, municipal councils, and construction companies. In addition, the company's Traffic SmartCity Technology platform enables the integration of street lights and other traffic management equipment to a central control/management system through remote Internet of Things sensors primarily for the road industry, councils, and power authorities. Further, it offers traffic control products, vests, brackets, cones, and bollards, as well as corporate signage for government and private sectors; sign installation and computer assessment of local government signage; and intelligent transport systems. The company was founded in 2004 and is headquartered in Eltham, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Eltham"
    },
    "TZL.AX": {
        "short_name": "TZ LIMITED FPO",
        "long_name": "TZ Limited",
        "summary": "TZ Limited, together with its subsidiaries, develops intelligent devices and smart device systems that enable the commercialization of hardware and software solutions for the management, control, and monitoring of business assets. It offers smart lockers and cabinet security solutions. The company also provides associated value added services. It operates in Australia, the United States, the United Kingdom, and Singapore. TZ Limited was incorporated in 1996 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "U1P.F": {
        "short_name": "MAGNIS ENERGY TECHNOL.LTD",
        "long_name": "Magnis Energy Technologies Limited",
        "summary": "Magnis Energy Technologies Limited explores for and develops mineral properties in Australia and East Africa. It primarily explores for natural flake graphite used in batteries for storing electrical energy. The company holds a 100% interest in the Nachu graphite project located in southeast Tanzania. It also engages in the lithium-ion Battery investments. The company was formerly known as Magnis Resources Limited and changed its name to Magnis Energy Technologies Limited in November 2018. Magnis Energy Technologies Limited was incorporated in 2005 and is headquartered in Sydney, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "URNXF": {
        "short_name": "MAGNIS ENERGY TECHNOLOGIES LTD",
        "long_name": "Magnis Energy Technologies Limited",
        "summary": "Magnis Energy Technologies Limited explores for and develops mineral properties in Australia and East Africa. It primarily explores for natural flake graphite used in batteries for storing electrical energy. The company holds a 100% interest in the Nachu graphite project located in southeast Tanzania. It also engages in the lithium-ion Battery investments. The company was formerly known as Magnis Resources Limited and changed its name to Magnis Energy Technologies Limited in November 2018. Magnis Energy Technologies Limited was incorporated in 2005 and is headquartered in Sydney, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "UUV.AX": {
        "short_name": "UUV AQUA FPO",
        "long_name": "UUV Aquabotix Limited",
        "summary": "UUV Aquabotix Limited designs, develops, manufactures, and sells underwater drone systems, related technologies, and man-machine teaming solutions for a range of defense applications in Australia and the United States. It provides SwarmDiver product, an unmanned underwater and surface vehicle. The company offers rapid environmental assessment, port security and harbor management, mine countermeasure, and environmental monitoring, as well as distraction, diversion, and disarray solutions. UUV Aquabotix Limited was incorporated in 2016 and is based in Nedlands, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Nedlands"
    },
    "VBC.AX": {
        "short_name": "VERBRECL FPO",
        "long_name": "Verbrec Limited",
        "summary": "Verbrec Limited primarily provides engineering, project delivery, and operations services to hydrocarbons, mining and mineral processing, infrastructure, and defense industries in Australia, New Zealand, Papua New Guinea, and the Pacific Islands. The company offers asset management services, including engineering, asset inspection and integrity, maintenance strategies, and database development and condition monitoring and assessment; and specialist training services. It also provides engineering and project delivery in the areas of controls and automation, data acquisition, industry digitalization, industrial data analytics and advanced algorithms; and low voltage and high voltage electrical systems. In addition, the company offers engineering, design, and procurement services for oil and gas, and chemical facilities; and life-cycle services to various aspects of pipelines comprising conceptual studies, engineering design, EPC delivery, commissioning, operations and maintenance, commercial services, condition assessment, and repairs. The company was formerly known as LogiCamms Limited and changed its name to Verbrec Limited in December 2020. Verbrec Limited was incorporated in 2007 and is headquartered in Brisbane, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Brisbane"
    },
    "VEE.AX": {
        "short_name": "VEEM LTD FPO",
        "long_name": "VEEM Ltd",
        "summary": "VEEM Ltd manufactures and sells propulsion and stabilization systems. It offers propellers, centrifugally cast hollow bars, and gyrostabilizers; and manufactures bespoke products and services to the marine, defense, and mining industries. The company was founded in 1968 and is headquartered in Canning Vale, Australia. VEEM Ltd operates as a subsidiary of Veem Corporation Pty Ltd.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Canning Vale"
    },
    "VMG.AX": {
        "short_name": "VDM GROUP FPO",
        "long_name": "VDM Group Limited",
        "summary": "VDM Group Limited engages in the construction business in Australia. It operates through three divisions: VDM Mining, VDM Trading, and VDM Construction. The VDM Mining division engages in the exploration, development, and operation of mining projects in Africa and Latin America. This division holds a 65% interest in the Cachoeiras do Binga copper exploration project located in the Republic of Angola. The VDM Trading division imports and exports various products, including foods and wines. The VDM Construction division provides engineering, procurement, and construction services. This division constructs residential housings covering high-rise apartments, and affordable and social housing for communities; mining accommodation facilities; modular hotel units; and student accommodation units. VDM Group Limited was founded in 1978 and is based in East Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "East Perth"
    },
    "VRS.AX": {
        "short_name": "VERIS FPO",
        "long_name": "Veris Limited",
        "summary": "Veris Limited provides surveying, professional and advisory, and geospatial services in Australia. The company's Veris Australia segment provides cadastral, civil and construction, and engineering surveying, as well as 3D spatial services, such as lidar, 3D laser scanning, ground penetrating radar, mobile laser scanning, and hydrographic surveys. This segment also provides town planning and urban design services. It serves infrastructure, land and property, resources, and defence markets. Its Aqura Technologies segment offers ICT and communications services to the industrial communications sector. Veris Limited was formerly known as OTOC Limited and changed its name to Veris Limited in November 2016. Veris Limited is headquartered in Osborne Park, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Osborne Park"
    },
    "VYS.AX": {
        "short_name": "VYSARNLTD FPO",
        "long_name": "Vysarn Limited",
        "summary": "Vysarn Limited, through its subsidiary, Pentium Hydro Pty Ltd, engages in the hydrogeological and dewatering drilling business in Australia. The company was formerly known as MHM Metals Limited and changed its name to Vysarn Limited in December 2017. Vysarn Limited was incorporated in 2007 and is based in West Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "West Perth"
    },
    "WAT.AX": {
        "short_name": "WATERCO FPO",
        "long_name": "Waterco Limited",
        "summary": "Waterco Limited engages in the manufacture, wholesale, and export of equipment and accessories in the swimming pool, spa pool, spa bath, rural pump, and water treatment industries in Australia, New Zealand, Asia, North America, and Europe. It also manufactures and sells solar heating systems for swimming pools and pre-heat industrial solar systems. The company's pool and spa products comprise infloor cleaning systems, mineral crystals, swimming pool pumps, filtration systems, pool heating products, chlorine free spa products, controllers and automation products, pool lighting products, sunction and robotic pool cleaners, and commercial products. Its pool and spa products also include pool filter media products, recirculation and maintenance accessories, blowers, values, spa equipment, chemical pool products, sensation and enviropro eco range products, ozone mineral pool products, and test kits. The company's water treatment products include commercial filter media and cooling water filtration products, cartridge and bag filters, centrifugal filters, and fiberglass media filters; and residential pressure pumps, centrifugal filters, water filters, water softeners, and drinking water purifiers. It also provides aquaculture equipment, such as aquabiome mechanical and biological filters, aquaculture heating and pup ranges, bio-mec bead media, multicyclones, and spa airflo blowers. In addition, the company franchises retail outlets for swimming pool equipment and accessories. Further, it engages in formulating, packing, and distributing swimming pool chemicals to independent pool stores and stores in its Swimart franchise network. It operates 68 stores and 9 mobile franchises under the Swimart names, and 15 WaterShoppe stores. Waterco Limited was founded in 1981 and is headquartered in Rydalmere, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Rydalmere"
    },
    "WSI.AX": {
        "short_name": "WESTSTARIN FPO",
        "long_name": "WestStar Industrial Limited",
        "summary": "WestStar Industrial Limited, an industrial services company, provides engineering, construction, and mining services to resource, energy, and infrastructure sectors in Australia. The company operates through Precast Australia, SIMPEC, Alltype Engineering Pty Ltd, and Distinct Development segments. Its services include structural mechanical piping, electrical and instrumentation, non-process infrastructure, pipe plant and structural steel processing, fabrication, civil solutions, asset management, maintenance shutdowns and turnarounds, project management, and multidiscipline turnkey projects. The company also explores for mineral properties; undertakes construction contracting services; provides prefabricated concrete construction services; and develops properties. WestStar Industrial Limited was incorporated in 2006 and is based in Leederville, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Naval Base"
    },
    "WWG.AX": {
        "short_name": "WISEWAYGRP FPO",
        "long_name": "Wiseway Group Limited",
        "summary": "Wiseway Group Limited, together with its subsidiaries, provides logistics and freight forwarding services in Australia. It offers air cargo services, including door to door, airport to airport, import and export shipments, break bulk, personal effects, dangerous goods, scheduled consolidation, time sensitive shipments, documentation handling and processing, special projects, pick-up, and packing and crating services; and sea cargo services ranging from less-than-container loads to full container loads, special equipment, and oversized cargo. The company also provides services for perishables goods; customs clearance services; road transportation services; and warehousing services, such as bonded storage, break bulk and deconsolidation, picking and packing, pallet in/pallet out, long and short term storage, stock control system, order entry/processing, inventory control management, container packing or unpacking, and packaging materials supply. Wiseway Group Limited was founded in 2005 and is headquartered in Bankstown, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Bankstown"
    },
    "XTE.AX": {
        "short_name": "XTEKLTD. FPO",
        "long_name": "XTEK Limited",
        "summary": "XTEK Limited provides homeland security products and services to government, defense, and law enforcement agencies worldwide. The company small arms protective insert plates, helmets, structural/non-structural ballistic armour plates and joiners, lightweight components, and carbon fiber composites; and explosive ordnance disposal (EOD) search/hook and line, detection, RSD/disruption, exploitation, force protection, and robotics equipment. It also provides equipment and consumables for crime scene examination and recovery, forensic document examination, latent fingerprint examination and fingerprint processing, forensic biology, trace evidence analysis, and disaster victim identification, as well as through life support, project delivery, inventory control, repairs, maintenance, and training services. In addition, the company offers small unmanned aerial systems, EOD robots and static earthing systems, portable and baggage X-ray systems, remotely initiated firing systems, and radar systems; and protective security and tactical solutions. XTEK Limited was founded in 1978 and is headquartered in Symonston, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Symonston"
    },
    "YPB.AX": {
        "short_name": "YPB GROUP FPO",
        "long_name": "YPB Group Limited",
        "summary": "YPB Group Limited develops, markets, and sells anti-counterfeiting, product authentication, and consumer engagement solutions to brand owners. It offers digital engagement platform, a cloud-based customer digital engagement and analytics platform that enables brands to form a relationship with customers; manufactures and sells covert forensic products that are used for tracing a product or packaging during or after the manufacturing process, which is detectable using the company's proprietary scanner; and forensic laboratory services for the examination of counterfeit products. The company also provides security consulting services to governments, corporations, and intellectual property owners for the deterrence of counterfeiting, grey markets, product diversions, and fraud activities; and brand protection labelling solutions for sellers, brands, and product owners. It operates in Australia, the Peoples Republic of China, Thailand, and the United States. YPB Group Limited was incorporated in 2004 and is based in Subiaco, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Subiaco"
    }
}