{"EMB.AX": {"short_name": "EMBELTON FPO", "long_name": "Embelton Limited", "summary": "Embelton Limited manufactures and distributes flooring, structural noise and vibration control system, metal fabrication, rubber and cork sheeting, and other industrial products in Australia and internationally. It operates through Merchandising, Commercial, and Manufacturing segments. The company is involved in the distribution and merchandising of flooring and consumer products, such as wooden parquetry flooring; prefinished and natural strip flooring; timber, bamboo, laminate, and hybrid flooring; rubber and sports flooring; adhesives and finishes; other flooring accessories; and compressed cork sheets, blocks, and rolls. It also offers industrial and construction products, including structural noise and vibration isolation systems, spring and rubber anti-vibration mountings, seismic restraints for resiliently mounted equipment, recycled and natural rubber sheets, spandex cork jointing and other jointing media, and tube and pipe bending products. In addition, the company manufactures custom fabricators in steel, stainless steel, copper, aluminum, and nickel alloys for high temperature and general industrial use; vibration control devices; and tube and pipe bending and rolling products. Embelton Limited founded in 1925 and is headquartered in Coburg, Australia.", "currency": "AUD", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Coburg"}, "OLH.AX": {"short_name": "OLDFIELD H FPO", "long_name": "Oldfields Holdings Limited", "summary": "Oldfields Holdings Limited manufactures, markets, and imports scaffolding and painting accessories in Australia. The company operates through Consumer Products and Scaffolding segments. The Consumer Products segment imports, manufactures, and distributes paint brushes, paint rollers, painter's tools, garden sheds and outdoor storage systems. The Scaffolding segment manufactures and distributes scaffolding and related equipment, as well as engages in hiring scaffold and access solutions to the building maintenance and construction industries. Oldfields Holdings Limited was founded in 1916 and is headquartered in Campbelltown, Australia. Oldfields Holdings Limited operates as a subsidiary of Eqm Holdings Unit Trust.", "currency": "AUD", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Campbelltown"}}