{"AYS.AX": {"short_name": "AMAYSIM FPO", "long_name": "amaysim Australia Limited", "summary": "amaysim Australia Limited, together with its subsidiaries, operates as a mobile virtual network operator in Australia. It operates through two segments, Mobile and Energy. The company provides 2G, 3G, and 4G mobile services, including voice and video calls, text messages, data, and multimedia messaging, as well as related information, entertainment, and connectivity services under the amaysim and Vaya brand names. It also supplies electricity and gas. As of August 31, 2020, the company had 830,000 mobile subscribers and 211,000 energy subscribers. amaysim Australia Limited was founded in 2010 and is headquartered in Sydney, Australia.", "currency": "AUD", "sector": "Industrials", "industry": "Conglomerates", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "BRJ.F": {"short_name": "AMAYSIM AUSTRALIA LTD", "long_name": "amaysim Australia Limited", "summary": "amaysim Australia Limited, together with its subsidiaries, operates as a mobile virtual network operator in Australia. It operates through two segments, Mobile and Energy. The company provides 2G, 3G, and 4G mobile services, including voice and video calls, text messages, data, and multimedia messaging, as well as related information, entertainment, and connectivity services under the amaysim and Vaya brand names. It also supplies electricity and gas. As of August 31, 2020, the company had 830,000 mobile subscribers and 211,000 energy subscribers. amaysim Australia Limited was founded in 2010 and is headquartered in Sydney, Australia.", "currency": "EUR", "sector": "Industrials", "industry": "Conglomerates", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Sydney"}, "HNG.AX": {"short_name": "HGL LTD FPO", "long_name": "HGL Limited", "summary": "HGL Limited imports and distributes branded products for in Australia and internationally. It operates through Retail Marketing, Building Product, and Personal Care, and Healthcare segments. The Retail Marketing segment provides standard and customized shelving and display solutions to brand owners and retailers. The Building Product segment distributes architectural lightings for the commercial markets. The Personal Care segment distributes cosmetics and skincare products through salon, spa, and retail markets. The Healthcare segment rents and distributes medical equipment into hospitals, aged care facilities, and the retail market. It offers architectural lighting products under the TAL, Sammode, Luceplan, LTS, Hubbell, KIM, IILUS, and Intralux brands. The company was formerly known as Hancock & Gore Ltd and changed its name to HGL Limited in June 2002. HGL Limited was founded in 1867 and is headquartered in Macquarie Park, Australia.", "currency": "AUD", "sector": "Industrials", "industry": "Conglomerates", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Seven Hills"}, "SVW.AX": {"short_name": "SEVEN GRP FPO", "long_name": "Seven Group Holdings Limited", "summary": "Seven Group Holdings Limited engages in the heavy equipment sales and service, equipment hire, media, broadcasting, and energy assets businesses in Australia and internationally. It operates through WesTrac, Coates Hire, AllightSykes, Energy, Media Investments, and Other Investments segments. The company operates as a Caterpillar dealer providing heavy equipment sales and support services in Western Australia, New South Wales, and the Australian Capital Territory. It also provides a range of general and specialist equipment on hire to various markets, including engineering, building construction and maintenance, mining and resources, manufacturing, government, and events. In addition, the company engages in the manufacture, assembly, sale, and support of lighting towers, and FG Wilson power generation and dewatering equipment, as well as distributes Perkins engines. Further, it invests in listed and unlisted media organizations; holds operated and non-operated oil and gas interests; and other investments in properties. Seven Group Holdings Limited was incorporated in 2010 and is headquartered in Sydney, Australia.", "currency": "AUD", "sector": "Industrials", "industry": "Conglomerates", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}}