{
    "1CV.SG": {
        "short_name": "Civmec Ltd. Registered Shares o",
        "long_name": "Civmec Limited",
        "summary": "Civmec Limited, an investment holding company, provides construction and engineering services to the oil and gas, metals and minerals, infrastructure, and marine and defense. It undertakes fabrication projects, such as structural steel, plate works, tanks, vessels, materials handling equipment, subsea and offshore structures, and pipe spooling services. The company also offers modularization services; shipbuilding services; site civil works, including earthworks, reinforcing steel works, formworks, concrete placement, backfill and compaction to final handover, and underground services; and reinforced concrete products comprising prestressed beams, parapets, structural foundations, caissons, floor slabs and retaining walls, suspended slab sections, purpose-built facilities, breakwater systems, fascia and noise wall panels, conventional reinforced girders, transfloor panels, tunnel segments, and bridge beams. In addition, the company undertakes structural, mechanical, piping, and electrical instrumentation projects consisting of structural assembly and erection, mechanical installations and alignments, piping installation and pre-commissioning support, site welding, tanks, and equipment; and provides electrical and instrumentation solutions, such as electrical infrastructure works, including substations, switch rooms, switchyards, and site reticulation, as well as electrical maintenance services. Further, it offers industrial insulation services, including sheet metal and light gauge fabrication, fireproofing, surface treatment, site installation, and processing and forming technology; integrated supply chain solutions to the onshore and offshore drilling industry; maintenance; access solutions, such as scaffolds, fabricated platforms, rope access, and tension netting systems; and executes refractory projects. Civmec Limited was founded in 2009 and is headquartered in Perth, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6166",
        "website": "http://www.civmec.com.au",
        "market_cap": "Small Cap"
    },
    "3NR.F": {
        "short_name": "NRW HOLDINGS LTD",
        "long_name": "NRW Holdings Limited",
        "summary": "NRW Holdings Limited, through its subsidiaries, provides civil and mining contracting, urban development, and drilling and blasting services in Australia. It operates through four business segments: Civil, Mining, Drill and Blast, and Mining Technologies. The Civil segment delivers private and public civil infrastructure, mine development, bulk earthworks, and commercial and residential subdivision projects. Its civil construction projects include roads, bridges, tailings storage facilities, rail formations, ports, water infrastructure, and concrete installations. The Mining segment engages in the mine management, contract mining, load and haul, dragline, and coal handling preparation plant operations; maintenance activities; and fabrication of water and service vehicles. The Drill and Blast segment offers integrated and end to end production drill and blast services to the mining and civil construction sectors. The Mining Technologies segment provides materials handling, facility maintenance, and shutdown services; supplies mining technologies. The company also provides heat treatment services, as well as mining equipment solutions. NRW Holdings Limited was founded in 1994 and is based in Perth, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6104",
        "website": "http://www.nrw.com.au",
        "market_cap": "Small Cap"
    },
    "4MH.F": {
        "short_name": "VYSARN LTD",
        "long_name": "Vysarn Limited",
        "summary": "Vysarn Limited, through its subsidiary, Pentium Hydro Pty Ltd, engages in the hydrogeological and dewatering drilling business in Australia. The company was formerly known as MHM Metals Limited and changed its name to Vysarn Limited in December 2017. Vysarn Limited was incorporated in 2007 and is based in West Perth, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "VIC",
        "city": "West Perth",
        "zipcode": "6005",
        "website": "http://www.vysarn.com.au",
        "market_cap": "Small Cap"
    },
    "4SU.F": {
        "short_name": "SAUNDERS INTL LTD",
        "long_name": "Saunders International Limited",
        "summary": "Saunders International Limited engages in the design, construction, and maintenance of steel bulk liquid storage facilities, tanks, and road and rail bridges in Australia. The company also manufactures precast concrete products for transport infrastructure projects; and provides a range of specialized services for the maintenance of commercial, industrial, and marine infrastructure and assets. In addition, it engages in the engineering, procurement, and construction of fuel and chemical storage terminals, bridges and marine structures, precast concrete, concrete foundation works for heavy industry, foundation systems, jetty and wharves construction, building and construction management, water reservoirs, and pumping stations, as well as coal bins, hoppers, and associated steel works. Further, the company provides various asset services comprising refinery and industrial services, shutdowns and refurbishment, furnace and boiler maintenance, pressure welding, air heater overhauls and upgrades, general base line maintenance, pumps and steam valve overhaul, high performance coatings and linings, abrasive blasting and protective coatings, and structural strengthening services, as well as services for fabrication, genera, structural, piping, and pressure equipment. Saunders International Limited was founded in 1951 and is based in Rhodes, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Rhodes",
        "zipcode": "2138",
        "website": "http://saundersint.com",
        "market_cap": "Small Cap"
    },
    "59Y.F": {
        "short_name": "ACROW FORMW.+CONSTR.S.LTD",
        "long_name": "Acrow Formwork and Construction Services Limited",
        "summary": "Acrow Formwork and Construction Services Limited operates as a formwork and scaffolding company in Australia. It is involved in the rental of formwork equipment, including wall forming panel systems; soffit forming systems, including Acrowform aluminium panels; GASS table forms; super cuplok; and conventional systems; and scaffold equipment comprising cuplok scaffolding, super cuplok scaffolding, surelock scaffolding, and Acrowskaf scaffolding products. It offers hire and sales solutions to residential, commercial, civil, and industrial customers. The company was formerly known as NMG Corporation Limited and changed its name to Acrow Formwork and Construction Services Limited. The company was founded in 1936 and is based in Sydney, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.acrow.com.au",
        "market_cap": "Small Cap"
    },
    "5GJ.SI": {
        "short_name": "AusGroup",
        "long_name": "AusGroup Limited",
        "summary": "AusGroup Limited, an investment holding company, provides a range of integrated service solutions to the energy, resources, industrial, utilities, and port and marine sectors in Australia and South East Asia. The company's Projects segment provides construction services, including structural, mechanical, and piping; painting, insulation, and fireproofing; and engineering, procurement, and construction services. Its Access Services segment offers scaffolding, engineering and design, labor supply and stock control, logistics, transportation, and rope services. The company's Fabrication and Manufacturing segment provides turnkey solutions to the oil and gas sector, including exploration, construction, commissioning, operation, maintenance and repair, and decommissioning in various phases of the asset lifecycle. Its Maintenance Services segment offers preventative and breakdown maintenance services, as well as shut down services and sustaining capital works. The company's Port & Marine Services segment offers logistics and marine transportation support services to the oil and gas industry, as well as general marine and defense sectors. AusGroup Limited was founded in 1988 and is headquartered in West Perth, Australia.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Australia",
        "state": "WA",
        "city": "West Perth",
        "zipcode": "6005",
        "website": "http://www.ausgroupltd.com",
        "market_cap": "Small Cap"
    },
    "8MP.F": {
        "short_name": "MONADELPHOUS GROUP LTD.",
        "long_name": "Monadelphous Group Limited",
        "summary": "Monadelphous Group Limited, an engineering group, provides construction, maintenance, and industrial services to the resources, energy, and infrastructure sectors in Australia, New Zealand, Chile, Mongolia, and internationally. It operates through Engineering Construction, and Maintenance and Industrial Services divisions. the company offers fabrication, modularisation, offsite pre-assembly, procurement, and installation of structural steel, tankage, mechanical and process equipment, piping, demolition, and remediation works; multi-disciplined construction services; plant commissioning; electrical and instrumentation services; engineering, procurement, and construction services; and front-end scoping, shutdown planning, management, and execution services. It also provides water and waste water asset construction and maintenance; irrigation services; construction of transmission pipelines and facilities; operation and maintenance of power and water assets; heavy lift and specialist transport; access solutions; dewatering services; corrosion management services; specialist coatings; and rail track and rolling stock maintenance services, as well as turnkey design and construction, heavy lift and crane, and civil and electrical disciplines services. Monadelphous Group Limited was founded in 1972 and is headquartered in Perth, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6100",
        "website": "http://www.monadelphous.com.au",
        "market_cap": "Small Cap"
    },
    "ACF.AX": {
        "short_name": "ACROW FPO",
        "long_name": "Acrow Formwork and Construction Services Limited",
        "summary": "Acrow Formwork and Construction Services Limited operates as a formwork and scaffolding company in Australia. It is involved in the rental of formwork equipment, including wall forming panel systems; soffit forming systems, including Acrowform aluminium panels; GASS table forms; super cuplok; and conventional systems; and scaffold equipment comprising cuplok scaffolding, super cuplok scaffolding, surelock scaffolding, and Acrowskaf scaffolding products. It offers hire and sales solutions to residential, commercial, civil, and industrial customers. The company was formerly known as NMG Corporation Limited and changed its name to Acrow Formwork and Construction Services Limited. The company was founded in 1936 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.acrow.com.au",
        "market_cap": "Small Cap"
    },
    "BSA.AX": {
        "short_name": "BSA AUST FPO",
        "long_name": "BSA Limited",
        "summary": "BSA Limited, together with its subsidiaries, operates as a technical services contracting company in Australia. It operates through BSA Communications & Utility Infrastructure, and BSA Advanced Property Solutions segments. The BSA Communications & Utility Infrastructure segment engages in the delivery of bundled services over fixed line multi-technology networks; and installation of subscription television and smart meters to the telecommunications, subscription television and utility industries. The BSA Advanced Property Solutions segment designs, installs, maintains, and optimizes building services for all hard assets in commercial and industrial buildings and properties, including fire detection and suppression, mechanical services, heating, ventilation, air conditioning, refrigeration, electrical, and building management systems. BSA Limited was incorporated in 1999 and is based in Macquarie Park, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Macquarie Park",
        "zipcode": "2113",
        "website": "http://www.bsa.com.au",
        "market_cap": "Small Cap"
    },
    "CDD.AX": {
        "short_name": "CARDNO FPO",
        "long_name": "Cardno Limited",
        "summary": "Cardno Limited, a professional infrastructure and environmental services company, engages in the development and improvement of physical and social infrastructure for communities worldwide. The company's Asia Pacific Engineering and Environmental segment provides services in civil, structural, water, environmental, coastal, bridge, geotechnical, subsurface utility, traffic, and transport engineering, as well as environmental science, surveying, landscape architecture, planning, and asset management. Its Americas Engineering and Environmental segment offers environmental, water, transportation, energy and resources, land, buildings, and management services to private and public sector clients. The company's International Development segment designs and implements large-scale sustainable solutions for development assistance agencies and private clients. The company's Other segment engages in the engineering and consulting operations in Latin America. It serves defense, energy, government, industrial, international development, land management, mining and resources, property and buildings, transportation, utilities, and water sectors. Cardno Limited was founded in 1945 and is headquartered in Fortitude Valley, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Fortitude Valley",
        "zipcode": "4006",
        "website": "http://www.cardno.com",
        "market_cap": "Small Cap"
    },
    "CIM.AX": {
        "short_name": "CIMIC FPO",
        "long_name": "CIMIC Group Limited",
        "summary": "CIMIC Group Limited provides construction, mining, mineral processing, engineering, and operation and maintenance services to the infrastructure, resource, and property markets. The company operates through Construction, Public Private Partnerships, Mining & Mineral Processing, Engineering, Services, and Commercial & Residential segments. It constructs various infrastructure projects, including roads, railways, tunnels, airports, buildings, social infrastructures, water, and energy and resources facilities. The company also offers design and construction of mine infrastructure, construction, operation and maintenance of processing facilities, topsoil stripping, drill and blast, excavation, processing, rehabilitation, and mine closure services. It has operations in Australia, Asia, the Middle East, the Americas, and Africa. The company was formerly known as Leighton Holdings Limited and changed its name to CIMIC Group Limited in April 2015. The company was founded in 1899 and is based in North Sydney, Australia. CIMIC Group Limited is a subsidiary of HOCHTIEF Australia Holdings Limited.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "North Sydney",
        "zipcode": "2060",
        "website": "http://www.cimic.com.au",
        "market_cap": "Mid Cap"
    },
    "COLDF": {
        "short_name": "CARDNO LIMITED",
        "long_name": "Cardno Limited",
        "summary": "Cardno Limited, a professional infrastructure and environmental services company, engages in the development and improvement of physical and social infrastructure for communities worldwide. The company's Asia Pacific Engineering and Environmental segment provides services in civil, structural, water, environmental, coastal, bridge, geotechnical, subsurface utility, traffic, and transport engineering, as well as environmental science, surveying, landscape architecture, planning, and asset management. Its Americas Engineering and Environmental segment offers environmental, water, transportation, energy and resources, land, buildings, and management services to private and public sector clients. The company's International Development segment designs and implements large-scale sustainable solutions for development assistance agencies and private clients. The company's Other segment engages in the engineering and consulting operations in Latin America. It serves defense, energy, government, industrial, international development, land management, mining and resources, property and buildings, transportation, utilities, and water sectors. Cardno Limited was founded in 1945 and is headquartered in Fortitude Valley, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Fortitude Valley",
        "zipcode": "4006",
        "website": "http://www.cardno.com",
        "market_cap": "Small Cap"
    },
    "CVL.AX": {
        "short_name": "CIVMEC CDI 1:1",
        "long_name": "Civmec Limited",
        "summary": "Civmec Limited, an investment holding company, provides construction and engineering services to the oil and gas, metals and minerals, infrastructure, and marine and defense. It undertakes fabrication projects, such as structural steel, plate works, tanks, vessels, materials handling equipment, subsea and offshore structures, and pipe spooling services. The company also offers modularization services; shipbuilding services; site civil works, including earthworks, reinforcing steel works, formworks, concrete placement, backfill and compaction to final handover, and underground services; and reinforced concrete products comprising prestressed beams, parapets, structural foundations, caissons, floor slabs and retaining walls, suspended slab sections, purpose-built facilities, breakwater systems, fascia and noise wall panels, conventional reinforced girders, transfloor panels, tunnel segments, and bridge beams. In addition, the company undertakes structural, mechanical, piping, and electrical instrumentation projects consisting of structural assembly and erection, mechanical installations and alignments, piping installation and pre-commissioning support, site welding, tanks, and equipment; and provides electrical and instrumentation solutions, such as electrical infrastructure works, including substations, switch rooms, switchyards, and site reticulation, as well as electrical maintenance services. Further, it offers industrial insulation services, including sheet metal and light gauge fabrication, fireproofing, surface treatment, site installation, and processing and forming technology; integrated supply chain solutions to the onshore and offshore drilling industry; maintenance; access solutions, such as scaffolds, fabricated platforms, rope access, and tension netting systems; and executes refractory projects. Civmec Limited was founded in 2009 and is headquartered in Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6166",
        "website": "http://www.civmec.com.au",
        "market_cap": "Small Cap"
    },
    "DCG.AX": {
        "short_name": "DECMIL GRP FPO",
        "long_name": "Decmil Group Limited",
        "summary": "Decmil Group Limited, together with its subsidiaries, provides design, engineering, and construction works for infrastructure, resources, and renewable energy sectors primarily in Australia and New Zealand. The company operates through three segments: Construction and Engineering, Accommodation, and Other. It offers services for government infrastructure projects, such as accommodation, immigration facilities, corrections facilities, office buildings, defense facilities, schools, administration buildings, and storage facilities; road and bridge civil engineering projects; and passenger and freight rail projects, as well as designs and constructs fuel infrastructure facilities. The company also provides construction of remote non-process infrastructure, including industrial buildings, processing plants, workshops, and storage facilities; and coal seam gas and LNG wellhead installation with associated pipelines and facilities. In addition, it offers civil works on brown and greenfield projects, including site preparation, excavation and bulk earthworks in regional and remote areas. Decmil Group Limited was founded in 1978 and is based in Osborne Park, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Osborne Park",
        "zipcode": "6017",
        "website": "http://decmil.com",
        "market_cap": "Small Cap"
    },
    "DDB.AX": {
        "short_name": "DDBLAST FPO",
        "long_name": "Dynamic Drill and Blast Holdings Limited",
        "summary": "Dynamic Drill and Blast Holdings Limited provides drilling and blasting services for mining and construction sectors in Western Australia. It offers drilling and blasting services to break rock for excavation; and ancillary services, such as blast hole, wall control, depressurization, and probe drilling, as well as mining and quarrying blasting, controlled blasting, and vibration and overpressure monitoring services. The company also provides equipment and labor hiring services. It operates a fleet of 13 drilling rigs. Dynamic Drill and Blast Holdings Limited was incorporated in 2020 and is headquartered in Wangara, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Wangara",
        "zipcode": "6065",
        "website": "http://www.dynamicdrillandblast.com.au",
        "market_cap": "Small Cap"
    },
    "DNE.F": {
        "short_name": "DOWNER EDI",
        "long_name": "Downer EDI Limited",
        "summary": "Downer EDI Limited operates as an integrated services provider in Australia, New Zealand, the Asia-Pacific, South America, and Southern Africa. Its Transport segment provides road network management; routine road maintenance; asset management systems; spray sealing; asphalt laying; and manufacture and supply of bitumen-based products and asphalt products. This segment also engages in the design and construction of light and heavy rail networks, signaling works, track and station works, and bridges; and provides rail safety technology, fleet maintenance, and overhaul services. The company's Utilities segment plans, designs, constructs, operates, maintains, manages, and decommissions power and gas network assets; provides water and wastewater treatment, and network construction and rehabilitation services; and designs, constructs, and maintains renewable assets in the wind, solar, and power system storage sectors. This segment also offers technology and communications solutions, including design, civil construction, network construction, operation, and maintenance services for fiber, copper, and radio networks. Its Facilities segment offers outsourced facility, catering and laundry, technical and engineering, and maintenance and asset management services, as well as refrigeration solutions, as well as building and construction solutions across various sectors. The company's Engineering, Construction and Maintenance segment provides design, engineering, construction, shutdown, turnaround and outage delivery, and operations maintenance and ongoing management services for various projects; and designs and manufactures mineral process equipment. Its Mining segment provides resource definition, exploration drilling, and mine feasibility studies; open cut and underground mining services; and drilling, explosives manufacture and supply; blasting and crushing; asset management; tire management; and mine closure and rehabilitation services. The company is headquartered in Sydney, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2113",
        "website": "http://www.downergroup.com",
        "market_cap": "Mid Cap"
    },
    "DOW.AX": {
        "short_name": "DOWNER EDI FPO",
        "long_name": "Downer EDI Limited",
        "summary": "Downer EDI Limited operates as an integrated services provider in Australia, New Zealand, the Asia-Pacific, South America, and Southern Africa. Its Transport segment provides road network management; routine road maintenance; asset management systems; spray sealing; asphalt laying; and manufacture and supply of bitumen-based products and asphalt products. This segment also engages in the design and construction of light and heavy rail networks, signaling works, track and station works, and bridges; and provides rail safety technology, fleet maintenance, and overhaul services. The company's Utilities segment plans, designs, constructs, operates, maintains, manages, and decommissions power and gas network assets; provides water and wastewater treatment, and network construction and rehabilitation services; and designs, constructs, and maintains renewable assets in the wind, solar, and power system storage sectors. This segment also offers technology and communications solutions, including design, civil construction, network construction, operation, and maintenance services for fiber, copper, and radio networks. Its Facilities segment offers outsourced facility, catering and laundry, technical and engineering, and maintenance and asset management services, as well as refrigeration solutions, as well as building and construction solutions across various sectors. The company's Engineering, Construction and Maintenance segment provides design, engineering, construction, shutdown, turnaround and outage delivery, and operations maintenance and ongoing management services for various projects; and designs and manufactures mineral process equipment. Its Mining segment provides resource definition, exploration drilling, and mine feasibility studies; open cut and underground mining services; and drilling, explosives manufacture and supply; blasting and crushing; asset management; tire management; and mine closure and rehabilitation services. The company is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2113",
        "website": "http://www.downergroup.com",
        "market_cap": "Mid Cap"
    },
    "DUR.AX": {
        "short_name": "DURATEC FPO",
        "long_name": "Duratec Limited",
        "summary": "Duratec Limited engages in the provision of assessment, protection, remediation, and refurbishment services to a range of assets, primarily steel and concrete infrastructure in Australia. It operates through Defence, Mining & Industrial, and Buildings & Facades segments. The Defence segment delivers capital facilities infrastructure and estate works program projects. The Mining & Industrial segment offers preventative maintenance programmes. The Buildings & Facades segment provides faÃ§ade condition assessment and restoration completion services. The company offers asset protection, building refurbishment, infrastructure upgrades, recladding, durability engineering, specialist access systems, construction, and spatial integration services. It serves defence, mining, oil and gas, transport, marine, energy, building and faÃ§ade, heritage, property, industrial, and water infrastructure industries. The company was founded in 2010 and is headquartered in Wangara, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Wangara",
        "zipcode": "6065",
        "website": "http://www.duratec.com.au",
        "market_cap": "Small Cap"
    },
    "DZ5.F": {
        "short_name": "CARDNO LTD.",
        "long_name": "Cardno Limited",
        "summary": "Cardno Limited, a professional infrastructure and environmental services company, engages in the development and improvement of physical and social infrastructure for communities worldwide. The company's Asia Pacific Engineering and Environmental segment provides services in civil, structural, water, environmental, coastal, bridge, geotechnical, subsurface utility, traffic, and transport engineering, as well as environmental science, surveying, landscape architecture, planning, and asset management. Its Americas Engineering and Environmental segment offers environmental, water, transportation, energy and resources, land, buildings, and management services to private and public sector clients. The company's International Development segment designs and implements large-scale sustainable solutions for development assistance agencies and private clients. The company's Other segment engages in the engineering and consulting operations in Latin America. It serves defense, energy, government, industrial, international development, land management, mining and resources, property and buildings, transportation, utilities, and water sectors. Cardno Limited was founded in 1945 and is headquartered in Fortitude Valley, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Fortitude Valley",
        "zipcode": "4006",
        "website": "http://www.cardno.com",
        "market_cap": "Small Cap"
    },
    "EVZ.AX": {
        "short_name": "EVZ LTD FPO",
        "long_name": "EVZ Limited",
        "summary": "EVZ Limited operates in the engineering and energy services sectors in Australia and Asia. It operates through Engineering, Energy, and Water segments. The Engineering segment designs, manufactures, and installs silos, cooling towers, pipe spooling, and pressure vessels, as well as large steel tanks for use in the water, petrochemical, and chemical industries; and fabricates structural steel. This segment also engages in the installation and provision of ongoing support and maintenance for its products. The Energy segment designs and installs constant load power stations, base and back-up power generation equipment, communications equipment, marine installations, and sustainable/clean energy solutions, as well as offers mobile generation capabilities. It also engages in the service, maintenance, and hiring of various generators and associated equipment. The Water segment is involved in the design and installation of syphonic roof drainage systems to various buildings, including airports, shopping centers, and sporting venues; supply and installation of fiberglass panel tanks and prefabricated hydraulic systems. The company also provides design, construction, on-site installation, maintenance, and shutdown of engineering services to the mining, wood chip, petrochemical, aluminum, glass, cement, defense, and agriculture industries. EVZ Limited was incorporated in 1984 and is based in Docklands, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Docklands",
        "zipcode": "3008",
        "website": "http://www.evz.com.au",
        "market_cap": "Small Cap"
    },
    "FWD.AX": {
        "short_name": "FLEETWOOD FPO",
        "long_name": "Fleetwood Limited",
        "summary": "Fleetwood Corporation Limited engages in the design, manufacture, and sale of manufactured modular accommodation in Australia and New Zealand. It operates through three segments: RV Solutions, Building Solutions, and Accommodation Solutions. The company also engages in the operation of accommodation villages; and manufacture and distribution of recreational vehicle parts and accessories, as well as the provision of associated services. It offers modular accommodation solutions for resources, education, affordable housing, mining, and corrections sectors; and provides caravan plumbing and electrical services, as well as supplies related parts. Fleetwood Corporation Limited was founded in 1964 and is based in East Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "East Perth",
        "zipcode": "6004",
        "website": "http://www.fleetwoodcorporation.com.au",
        "market_cap": "Small Cap"
    },
    "GNG.AX": {
        "short_name": "GR ENGIN FPO",
        "long_name": "GR Engineering Services Limited",
        "summary": "GR Engineering Services Limited operates as an engineering, consulting, and contracting company that provides engineering design, procurement, and construction services to the mining and mineral processing industries in Australia and internationally. The company operates through two segments, Mineral Processing, and Oil and Gas. It provides project management services, including project studies, engineering and procurement, construction and commissioning, asset management plans and system development, operations and technical support, and infrastructure development services. The company's services include the design and construction of minerals processing facilities and related infrastructure for greenfield or brownfield projects, such as plant modifications, and upgrades and expansions; plant evaluation and condition reports; plant operations, and maintenance support and optimization; and plant relocation, refurbishment, and recommissioning, as well as engages in the provision of owners representatives and teams for project management and delivery, and asset management services. Its services also comprise engineering and process design consulting services; and feasibility studies comprising scoping, pre-feasibility, and definitive level studies, as well as study work and services that include front end engineering design, operations and process optimization, due diligence reviews, asset management system development and monitoring, risk evaluation and hazard/operability studies, technology evaluation and trade-off studies, and refurbishment assessments. In addition, the company offers operations, maintenance, and advisory services to the oil and gas sector. GR Engineering Services Limited was founded in 1986 and is headquartered in Ascot, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Ascot",
        "zipcode": "6104",
        "website": "http://www.gres.com.au",
        "market_cap": "Small Cap"
    },
    "GNP.AX": {
        "short_name": "GENUSPLUS FPO",
        "long_name": "GenusPlus Group Limited",
        "summary": "GenusPlus Group Limited provides infrastructure services in Australia. The company's services cover power and telecommunications transmission and distribution; underground network installation services, which range from optic fiber for telecommunications to underground power and civil works; switchyards, substation, communications, and renewable energy; design, construction, commissioning, fault works, and maintenance; high voltage (HV) testing, commissioning, and engineering services, including HV cable jointing, HV testing, protection relay testing, fault location, and high voltage maintenance; electrical and instrumentation services; and construction and maintenance. It also provides integrated engineering and training, and related support services. The company provides its services for customers in the infrastructure, utilities, mining and resources, government and private, telecommunications, power distribution and generation, commercial, industrial, civil, and oil and gas sectors. GenusPlus Group Limited was incorporated in 2017 and is headquartered in Belmont, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Belmont",
        "zipcode": "6104",
        "website": "http://www.genusplusgroup.com.au",
        "market_cap": "Small Cap"
    },
    "ITG.AX": {
        "short_name": "INTEGA GRP FPO",
        "long_name": "Intega Group Limited",
        "summary": "Intega Group Limited provides engineering services primarily in Australia, New Zealand, the United States, the United Kingdom, and Canada. It operates through Asia Pacific and Americas segments. The company offers testing services for construction materials, including soil, aggregates, and concrete; subsurface utility engineering services, such as mapping the location and condition of subsurface utilities to reduce the occurrence of interference and conflict with existing infrastructure; and environmental testing services comprising testing soils, asbestos, groundwater quality, construction noise, dust, and vibration levels. It also provides geotechnical engineering services, such as temporary works design, bored pile supervision, geotechnical investigation, site classification, and pavement design services; geomechanical testing services for infrastructure, mining, and tunneling projects; owners' representative services; and quality assurance services. The company was founded in 1968 and is based in Newstead, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Newstead",
        "zipcode": "4006",
        "website": "http://www.intega.net",
        "market_cap": "Small Cap"
    },
    "JLG.AX": {
        "short_name": "JOHNS LYNG FPO",
        "long_name": "Johns Lyng Group Limited",
        "summary": "Johns Lyng Group Limited provides integrated building services in Australia. The company operates through Insurance Building and Restoration Services, Commercial Building Services, Commercial Construction, and Other segments. It provides building fabric repair, contents restoration, hazardous waste removal, and strata management services; and residential and commercial flooring, emergency household repairs, shop-fitting, HVAC mechanical, and pre-sale property staging services. The company also undertakes commercial construction projects in the education, aged care, retail, community, hospitality, and residential sectors. It offers it services under the Makesafe Builders, Restorx Services, Express Builders, Insurance Builders, Aztech, Hazrem, Regional Builders, Steamatic, Strata Services, Bright & Duggan, Trump Floorcoverings, Global Home Response, Air Control, Shopfit Services, Dressed for Sale, Commercial Builders, Global 360, and Local 360 brands to insurance brokers, insurance companies, loss adjusters, commercial enterprises, local and state governments, and retail customers, as well as body corporates/owners' corporations. The company was founded in 1953 and is headquartered in Doncaster, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Doncaster",
        "zipcode": "3108",
        "website": "http://www.johnslyng.com.au",
        "market_cap": "Small Cap"
    },
    "LGTHF": {
        "short_name": "CIMIC GROUP LTD",
        "long_name": "CIMIC Group Limited",
        "summary": "CIMIC Group Limited provides construction, mining, mineral processing, engineering, and operation and maintenance services to the infrastructure, resource, and property markets. The company operates through Construction, Public Private Partnerships, Mining & Mineral Processing, Engineering, Services, and Commercial & Residential segments. It constructs various infrastructure projects, including roads, railways, tunnels, airports, buildings, social infrastructures, water, and energy and resources facilities. The company also offers design and construction of mine infrastructure, construction, operation and maintenance of processing facilities, topsoil stripping, drill and blast, excavation, processing, rehabilitation, and mine closure services. It has operations in Australia, Asia, the Middle East, the Americas, and Africa. The company was formerly known as Leighton Holdings Limited and changed its name to CIMIC Group Limited in April 2015. The company was founded in 1899 and is based in North Sydney, Australia. CIMIC Group Limited is a subsidiary of HOCHTIEF Australia Holdings Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "NSW",
        "city": "North Sydney",
        "zipcode": "2060",
        "website": "http://www.cimic.com.au",
        "market_cap": "Mid Cap"
    },
    "LTH.F": {
        "short_name": "CIMIC GROUP",
        "long_name": "CIMIC Group Limited",
        "summary": "CIMIC Group Limited provides construction, mining, mineral processing, engineering, and operation and maintenance services to the infrastructure, resource, and property markets. The company operates through Construction, Public Private Partnerships, Mining & Mineral Processing, Engineering, Services, and Commercial & Residential segments. It constructs various infrastructure projects, including roads, railways, tunnels, airports, buildings, social infrastructures, water, and energy and resources facilities. The company also offers design and construction of mine infrastructure, construction, operation and maintenance of processing facilities, topsoil stripping, drill and blast, excavation, processing, rehabilitation, and mine closure services. It has operations in Australia, Asia, the Middle East, the Americas, and Africa. The company was formerly known as Leighton Holdings Limited and changed its name to CIMIC Group Limited in April 2015. The company was founded in 1899 and is based in North Sydney, Australia. CIMIC Group Limited is a subsidiary of HOCHTIEF Australia Holdings Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "NSW",
        "city": "North Sydney",
        "zipcode": "2060",
        "website": "http://www.cimic.com.au",
        "market_cap": "Mid Cap"
    },
    "LYL.AX": {
        "short_name": "LYCOPODIUM FPO",
        "long_name": "Lycopodium Limited",
        "summary": "Lycopodium Limited provides engineering consultancy services in the resources, infrastructure and industrial processes sectors. It operates through four segments: Mineral, Process Industries, Project Services-Africa, and Others. The company provides engineering, project development, and related services to junior exploration companies and multinational producers; design, engineering, and project management solutions to the manufacturing and renewable energy facilities in Australia and South East Asia; and engineering, asset management, architecture, and project delivery services to private and public clients in Australia. It also offers metallurgical consultancy services to the mineral processing community, primarily in the field of comminution, hydrometallurgy, and mineral processing design; and drafting services to offshore entities. Lycopodium Limited was founded in 1992 and is based in East Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "East Perth",
        "zipcode": "6004",
        "website": "http://www.lycopodium.com",
        "market_cap": "Small Cap"
    },
    "MA2.F": {
        "short_name": "MACMAHON HLDGS LTD",
        "long_name": "Macmahon Holdings Limited",
        "summary": "Macmahon Holdings Limited provides mining and consulting services to mining companies in Australia, Southeast Asia, and South Africa. It offers surface mining services, including mine planning and analysis, drill and blast, bulk and selective mining, crushing and screening, fixed plant maintenance, water management, and equipment operation and maintenance. The company also provides underground mining services, such as mine development and production, raise drilling, cablebolting, shotcreting, remote shaft lining, production drilling, and shaft sinking. In addition, it offers civil and rehabilitation services comprising topsoil and overburden stripping, bulk earthworks, road design and construction, and train loading facilities; water infrastructure, including dams, creek diversions, flood levies, and drainage structures; and revegetation, as well as rehabilitation monitoring and maintenance. Further, the company provides equipment maintenance and management support services; and performance enhancement services comprising operator coaching and training, and cultural change programs for employees, as well as advisory and assistance services with mine planning, maintenance, and employee engagement. Macmahon Holdings Limited was founded in 1963 and is headquartered in Perth, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6105",
        "website": "http://www.macmahon.com.au",
        "market_cap": "Small Cap"
    },
    "MAH.AX": {
        "short_name": "MACMAHON FPO",
        "long_name": "Macmahon Holdings Limited",
        "summary": "Macmahon Holdings Limited provides mining and consulting services to mining companies in Australia, Southeast Asia, and South Africa. It offers surface mining services, including mine planning and analysis, drill and blast, bulk and selective mining, crushing and screening, fixed plant maintenance, water management, and equipment operation and maintenance. The company also provides underground mining services, such as mine development and production, raise drilling, cablebolting, shotcreting, remote shaft lining, production drilling, and shaft sinking. In addition, it offers civil and rehabilitation services comprising topsoil and overburden stripping, bulk earthworks, road design and construction, and train loading facilities; water infrastructure, including dams, creek diversions, flood levies, and drainage structures; and revegetation, as well as rehabilitation monitoring and maintenance. Further, the company provides equipment maintenance and management support services; and performance enhancement services comprising operator coaching and training, and cultural change programs for employees, as well as advisory and assistance services with mine planning, maintenance, and employee engagement. Macmahon Holdings Limited was founded in 1963 and is headquartered in Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6105",
        "website": "http://www.macmahon.com.au",
        "market_cap": "Small Cap"
    },
    "MCE.AX": {
        "short_name": "MATRIX CE FPO",
        "long_name": "Matrix Composites & Engineering Ltd",
        "summary": "Matrix Composites & Engineering Ltd, together with its subsidiaries, designs, manufactures, sells, and engineers composite and material technology solutions to the oil and gas, civil and infrastructure, resources, defense, and transportation industries in Australia and internationally. It offers conventional riser buoyancy systems; Nautilus riser protection; Riser sealing mandrel; Matrix Longitudinal Groove System (LGS) VIV and Drag Reduction; and Matrix LGS VIV suppression, as well as buoyancy system testing services, such as hyperbaric, buoyancy verification tank, mechanical, laboratory, and material testing. The company also provides well construction products, such as Max-R, a range of low friction composite drilling and completions centralizers. In addition, it offers distributed buoyancy clamping systems, IsoBlox buoyancy building block systems, mid water arch buoyancy, permanent subsurface mooring buoyancy, pipeline buckle mitigation buoyancy, steel catenary riser buoyancy, and production riser buoyancy systems; buoyancy balls, cuboids, and tablets; and pipeline installation buoyancy products. Further, the company provides Paragon epoxy resin systems; Kinetica dropped object protection cell systems; energy absorption systems; and Matrix LGS free span remediation solutions. Additionally, it offers Cetrafoam molded pipe cryogenic insulation products; Xirtherm C140 composite cryogenic thermal break blocks; and composite pipe reinforcement systems. The company was founded in 1980 and is headquartered in Henderson, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Henderson",
        "zipcode": "6166",
        "website": "http://www.matrixengineered.com",
        "market_cap": "Small Cap"
    },
    "MCHHF": {
        "short_name": "MACMAHON HLDGS",
        "long_name": "Macmahon Holdings Limited",
        "summary": "Macmahon Holdings Limited provides mining and consulting services to mining companies in Australia, Southeast Asia, and South Africa. It offers surface mining services, including mine planning and analysis, drill and blast, bulk and selective mining, crushing and screening, fixed plant maintenance, water management, and equipment operation and maintenance. The company also provides underground mining services, such as mine development and production, raise drilling, cablebolting, shotcreting, remote shaft lining, production drilling, and shaft sinking. In addition, it offers civil and rehabilitation services comprising topsoil and overburden stripping, bulk earthworks, road design and construction, and train loading facilities; water infrastructure, including dams, creek diversions, flood levies, and drainage structures; and revegetation, as well as rehabilitation monitoring and maintenance. Further, the company provides equipment maintenance and management support services; and performance enhancement services comprising operator coaching and training, and cultural change programs for employees, as well as advisory and assistance services with mine planning, maintenance, and employee engagement. Macmahon Holdings Limited was founded in 1963 and is headquartered in Perth, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6105",
        "website": "http://www.macmahon.com.au",
        "market_cap": "Small Cap"
    },
    "MGH.AX": {
        "short_name": "MAAS GROUP FPO",
        "long_name": "MAAS Group Holdings Limited",
        "summary": "MAAS Group Holdings Limited, together with subsidiaries, offers construction materials, equipment, and services for civil, infrastructure, and mining end markets in Australia and internationally. The company operates through four segments: Real Estate; Civil and Construction; Tunnelling and Underground Services; and Construction Materials. The Construction Materials segment supplies quarry, and mobile crushing and screening for quarries, civil works and mining. The Civil and Construction segment engages in the provision of plant and equipment to construction and infrastructure projects; civil, electrical, communications, and mining infrastructure construction business; construction of roads, dams, and mining infrastructure. The Real Estate segment engages in the development of residential, industrial, and commercial projects. The Tunnelling and Underground Services segment engages in the manufacture and sale of equipment and attachments for underground and civil markets; and underground mobile equipment hiring business. MAAS Group Holdings Limited was founded in 2002 and is headquartered in Dubbo, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Dubbo",
        "zipcode": "2830",
        "website": "http://www.maasgroup.com.au",
        "market_cap": "Small Cap"
    },
    "MND.AX": {
        "short_name": "MONADEL FPO",
        "long_name": "Monadelphous Group Limited",
        "summary": "Monadelphous Group Limited, an engineering group, provides construction, maintenance, and industrial services to the resources, energy, and infrastructure sectors in Australia, New Zealand, Chile, Mongolia, and internationally. It operates through Engineering Construction, and Maintenance and Industrial Services divisions. the company offers fabrication, modularisation, offsite pre-assembly, procurement, and installation of structural steel, tankage, mechanical and process equipment, piping, demolition, and remediation works; multi-disciplined construction services; plant commissioning; electrical and instrumentation services; engineering, procurement, and construction services; and front-end scoping, shutdown planning, management, and execution services. It also provides water and waste water asset construction and maintenance; irrigation services; construction of transmission pipelines and facilities; operation and maintenance of power and water assets; heavy lift and specialist transport; access solutions; dewatering services; corrosion management services; specialist coatings; and rail track and rolling stock maintenance services, as well as turnkey design and construction, heavy lift and crane, and civil and electrical disciplines services. Monadelphous Group Limited was founded in 1972 and is headquartered in Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6100",
        "website": "http://www.monadelphous.com.au",
        "market_cap": "Small Cap"
    },
    "MOPHY": {
        "short_name": "MONADELPHOUS GROUP",
        "long_name": "Monadelphous Group Limited",
        "summary": "Monadelphous Group Limited, an engineering group, provides construction, maintenance, and industrial services to the resources, energy, and infrastructure sectors in Australia, New Zealand, Chile, Mongolia, and internationally. It operates through Engineering Construction, and Maintenance and Industrial Services divisions. the company offers fabrication, modularisation, offsite pre-assembly, procurement, and installation of structural steel, tankage, mechanical and process equipment, piping, demolition, and remediation works; multi-disciplined construction services; plant commissioning; electrical and instrumentation services; engineering, procurement, and construction services; and front-end scoping, shutdown planning, management, and execution services. It also provides water and waste water asset construction and maintenance; irrigation services; construction of transmission pipelines and facilities; operation and maintenance of power and water assets; heavy lift and specialist transport; access solutions; dewatering services; corrosion management services; specialist coatings; and rail track and rolling stock maintenance services, as well as turnkey design and construction, heavy lift and crane, and civil and electrical disciplines services. Monadelphous Group Limited was founded in 1972 and is headquartered in Perth, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6100",
        "website": "http://www.monadelphous.com.au",
        "market_cap": "Small Cap"
    },
    "NWH.AX": {
        "short_name": "NRWHOLDLTD FPO",
        "long_name": "NRW Holdings Limited",
        "summary": "NRW Holdings Limited, through its subsidiaries, provides civil and mining contracting, urban development, and drilling and blasting services in Australia. It operates through four business segments: Civil, Mining, Drill and Blast, and Mining Technologies. The Civil segment delivers private and public civil infrastructure, mine development, bulk earthworks, and commercial and residential subdivision projects. Its civil construction projects include roads, bridges, tailings storage facilities, rail formations, ports, water infrastructure, and concrete installations. The Mining segment engages in the mine management, contract mining, load and haul, dragline, and coal handling preparation plant operations; maintenance activities; and fabrication of water and service vehicles. The Drill and Blast segment offers integrated and end to end production drill and blast services to the mining and civil construction sectors. The Mining Technologies segment provides materials handling, facility maintenance, and shutdown services; supplies mining technologies. The company also provides heat treatment services, as well as mining equipment solutions. NRW Holdings Limited was founded in 1994 and is based in Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6104",
        "website": "http://www.nrw.com.au",
        "market_cap": "Small Cap"
    },
    "P9D.SI": {
        "short_name": "Civmec",
        "long_name": "Civmec Limited",
        "summary": "Civmec Limited, an investment holding company, provides construction and engineering services to the oil and gas, metals and minerals, infrastructure, and marine and defense. It undertakes fabrication projects, such as structural steel, plate works, tanks, vessels, materials handling equipment, subsea and offshore structures, and pipe spooling services. The company also offers modularization services; shipbuilding services; site civil works, including earthworks, reinforcing steel works, formworks, concrete placement, backfill and compaction to final handover, and underground services; and reinforced concrete products comprising prestressed beams, parapets, structural foundations, caissons, floor slabs and retaining walls, suspended slab sections, purpose-built facilities, breakwater systems, fascia and noise wall panels, conventional reinforced girders, transfloor panels, tunnel segments, and bridge beams. In addition, the company undertakes structural, mechanical, piping, and electrical instrumentation projects consisting of structural assembly and erection, mechanical installations and alignments, piping installation and pre-commissioning support, site welding, tanks, and equipment; and provides electrical and instrumentation solutions, such as electrical infrastructure works, including substations, switch rooms, switchyards, and site reticulation, as well as electrical maintenance services. Further, it offers industrial insulation services, including sheet metal and light gauge fabrication, fireproofing, surface treatment, site installation, and processing and forming technology; integrated supply chain solutions to the onshore and offshore drilling industry; maintenance; access solutions, such as scaffolds, fabricated platforms, rope access, and tension netting systems; and executes refractory projects. Civmec Limited was founded in 2009 and is headquartered in Perth, Australia.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6166",
        "website": "http://www.civmec.com.au",
        "market_cap": "Small Cap"
    },
    "PKD.AX": {
        "short_name": "PARKD LTD FPO",
        "long_name": "PARKD Limited",
        "summary": "PARKD Limited, a construction technology company, constructs and supplies modular car parking systems for single and multi-level arrangements in Australia. The company was incorporated in 2016 and is based in Osborne Park, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Osborne Park",
        "zipcode": "6017",
        "website": "http://www.parkdgroup.com",
        "market_cap": "Small Cap"
    },
    "RDG.AX": {
        "short_name": "RESDEV FPO",
        "long_name": "Resource Development Group Limited",
        "summary": "Resource Development Group Limited provides contracting, remedial, and construction services to the resource, infrastructure, energy, government, utilities, and defense sectors in Australia. The company offers whole of project life-cycle services, including multi-disciplinary construction services, such as civil, SMPT, E&I, and non-process building works; ancillary maintenance services; EPCM, PMC, or integrated team project delivery solutions; EPC project delivery solutions; design and construct package delivery solutions; and optimizing services, including debottlenecking existing operations. It also provides materials handling solutions, such as mobile crushing and screening, modular crushing and screening, project management, and maintenance and field service; and develops residential buildings. The company was incorporated in 2011 and is headquartered in Perth, Australia. Resource Development Group Limited is a subsidiary of Mineral Resources Limited.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6017",
        "website": "http://www.resdevgroup.com.au",
        "market_cap": "Small Cap"
    },
    "SND.AX": {
        "short_name": "SAUNDERS FPO",
        "long_name": "Saunders International Limited",
        "summary": "Saunders International Limited engages in the design, construction, and maintenance of steel bulk liquid storage facilities, tanks, and road and rail bridges in Australia. The company also manufactures precast concrete products for transport infrastructure projects; and provides a range of specialized services for the maintenance of commercial, industrial, and marine infrastructure and assets. In addition, it engages in the engineering, procurement, and construction of fuel and chemical storage terminals, bridges and marine structures, precast concrete, concrete foundation works for heavy industry, foundation systems, jetty and wharves construction, building and construction management, water reservoirs, and pumping stations, as well as coal bins, hoppers, and associated steel works. Further, the company provides various asset services comprising refinery and industrial services, shutdowns and refurbishment, furnace and boiler maintenance, pressure welding, air heater overhauls and upgrades, general base line maintenance, pumps and steam valve overhaul, high performance coatings and linings, abrasive blasting and protective coatings, and structural strengthening services, as well as services for fabrication, genera, structural, piping, and pressure equipment. Saunders International Limited was founded in 1951 and is based in Rhodes, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Rhodes",
        "zipcode": "2138",
        "website": "http://saundersint.com",
        "market_cap": "Small Cap"
    },
    "SOP.AX": {
        "short_name": "SYNERTEC FPO",
        "long_name": "Synertec Corporation Limited",
        "summary": "Synertec Corporation Limited provides specialist engineering and compliance services in Australia. The company offers services in the areas of project and construction management; process and mechanical engineering; LNG custody transfer system; analyzer systems; automation and control engineering; and functional safety, as well as compliance and validation services. It serves oil and gas, pharmaceutical, water, petrochemical, terminal and defense, and food and dairy industries. The company was formerly known as SML Corporation Limited and changed its name to Synertec Corporation Limited as a result of its acquisition of Synertec Pty Ltd in August 2017. Synertec Corporation is headquartered in Richmond, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Richmond",
        "zipcode": "3121",
        "website": "http://www.synertec.com.au",
        "market_cap": "Small Cap"
    },
    "SRG.AX": {
        "short_name": "SRGGLOBAL FPO",
        "long_name": "SRG Global Limited",
        "summary": "SRG Global Limited provides engineering-led specialist asset, construction, and mining services. The company operates through Construction, Asset Services, and Mining Services segments. The Construction segment supplies integrated products and services to customers involved in the construction of infrastructure, including bridges, dams, office towers, high rise apartments, shopping centers, hotels, car parks, recreational buildings, and hospitals. The Asset Services segment supplies integrated services to customers in various sectors comprising oil and gas, energy, major infrastructure, offshore, mining, power generation, water treatment plants, commissioning, decommissioning, shutdowns, and civil works. The Mining Services segment provides ground solutions, which include production drilling, ground and slope stabilization, design engineering, and monitoring services to mining clients. The company was formerly known as Structural Systems Limited and changed its name to SRG Global Limited in November 2014. SRG Global Limited was founded in 1961 and is headquartered in Subiaco, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Subiaco",
        "zipcode": "6008",
        "website": "http://www.srgglobal.com.au",
        "market_cap": "Small Cap"
    },
    "SSM.AX": {
        "short_name": "SRVSTREAM FPO",
        "long_name": "Service Stream Limited",
        "summary": "Service Stream Limited accesses, designs, builds, installs, and maintains networks in Australia. It operates through four segments: Fixed Communications, Network Construction, Energy & Water, and Comdain Infrastructure segments. The Fixed Communications segment engages in the provision of a range of operations, maintenance, installation, design, and construction services, including customer connections for owners of fixed-line telecommunication; and service and network assurance; design, construction, and installation of broadband services, as well as projects for asset remediation, augmentation, and relocation. The Network Construction segment offers a range of design, construction, and related services to the owners of fixed-line and wireless telecommunications networks. Its services include site acquisition, engineering, design, and construction of wireless and fixed-line projects. The Energy & Water segment offers a range of specialist metering, new energy, and inspection services to gas, water, and electricity network owners and other customers. Its services meter reading and asset replacement services; engineering, design, and construction services for energy-related products; and specialist inspection, auditing, and compliance services. The Comdain Infrastructure segment offers a range of operations, maintenance, design, and construction services to gas and water network owners and operators. Its services comprise network assurance; asset upgrade and replacement; and engineering, design, and construction services for network assets, as well as specialist electrical and mechanical instrumentation services. The company was incorporated in 1996 and is headquartered in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3000",
        "website": "http://www.servicestream.com.au",
        "market_cap": "Small Cap"
    },
    "SXE.AX": {
        "short_name": "STH X ELEC FPO",
        "long_name": "Southern Cross Electrical Engineering Limited",
        "summary": "Southern Cross Electrical Engineering Limited provides electrical, instrumentation, communication, and maintenance services in Australia. It offers electrical and instrumentation (E&I) construction services, which include installation and commissioning of greenfield and brownfield upgrade projects in metropolitan, remote, and challenging environments. The company also provides fixed plant E&I construction; distribution and transmission line installation; substations, transformer, and switchyard installations; HV, LV control, instrument, and communication cabling and terminations; auditing, rectifications, and completions; constructability reviews; primary and secondary injection protection testing; instrumentation, loop checking, and calibrations; hazardous area installations; instrument air and tubing installation; and procurement and logistics management. In addition, it offers E&I services and maintenance, such as brownfields operational support, programed and breakdown maintenance, planned shutdown management, and sustaining capital project development; and in-house design and construct capability, asset life cycle management, hazardous area auditing and verification, procurement, and inspection and testing services. Further, the company provides communications services, such as integration and installation of communications technologies, such as communication equipment, data cabling, and fiber optics. It serves various markets comprising commercial developments; mining, and oil and gas; public infrastructure and defense; telecommunications and data centers; and industrial, utilities, and energy. The company was founded in 1978 and is headquartered in Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6165",
        "website": "http://www.scee.com.au",
        "market_cap": "Small Cap"
    },
    "VBC.AX": {
        "short_name": "VERBRECL FPO",
        "long_name": "Verbrec Limited",
        "summary": "Verbrec Limited primarily provides engineering, project delivery, and operations services to hydrocarbons, mining and mineral processing, infrastructure, and defense industries in Australia, New Zealand, Papua New Guinea, and the Pacific Islands. The company offers asset management services, including engineering, asset inspection and integrity, maintenance strategies, and database development and condition monitoring and assessment; and specialist training services. It also provides engineering and project delivery in the areas of controls and automation, data acquisition, industry digitalization, industrial data analytics and advanced algorithms; and low voltage and high voltage electrical systems. In addition, the company offers engineering, design, and procurement services for oil and gas, and chemical facilities; and life-cycle services to various aspects of pipelines comprising conceptual studies, engineering design, EPC delivery, commissioning, operations and maintenance, commercial services, condition assessment, and repairs. The company was formerly known as LogiCamms Limited and changed its name to Verbrec Limited in December 2020. Verbrec Limited was incorporated in 2007 and is headquartered in Brisbane, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Brisbane",
        "zipcode": "4000",
        "website": "http://www.verbrec.com",
        "market_cap": "Small Cap"
    },
    "VMG.AX": {
        "short_name": "VDM GROUP FPO",
        "long_name": "VDM Group Limited",
        "summary": "VDM Group Limited engages in the construction business in Australia. It operates through three divisions: VDM Mining, VDM Trading, and VDM Construction. The VDM Mining division engages in the exploration, development, and operation of mining projects in Africa and Latin America. This division holds a 65% interest in the Cachoeiras do Binga copper exploration project located in the Republic of Angola. The VDM Trading division imports and exports various products, including foods and wines. The VDM Construction division provides engineering, procurement, and construction services. This division constructs residential housings covering high-rise apartments, and affordable and social housing for communities; mining accommodation facilities; modular hotel units; and student accommodation units. VDM Group Limited was founded in 1978 and is based in East Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "East Perth",
        "zipcode": "6004",
        "website": "http://www.vdmgroup.com.au",
        "market_cap": "Small Cap"
    },
    "VRS.AX": {
        "short_name": "VERIS FPO",
        "long_name": "Veris Limited",
        "summary": "Veris Limited provides surveying, professional and advisory, and geospatial services in Australia. The company's Veris Australia segment provides cadastral, civil and construction, and engineering surveying, as well as 3D spatial services, such as lidar, 3D laser scanning, ground penetrating radar, mobile laser scanning, and hydrographic surveys. This segment also provides town planning and urban design services. It serves infrastructure, land and property, resources, and defence markets. Its Aqura Technologies segment offers ICT and communications services to the industrial communications sector. Veris Limited was formerly known as OTOC Limited and changed its name to Veris Limited in November 2016. Veris Limited is headquartered in Osborne Park, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Osborne Park",
        "zipcode": "6017",
        "website": "http://www.veris.com.au",
        "market_cap": "Small Cap"
    },
    "VYS.AX": {
        "short_name": "VYSARNLTD FPO",
        "long_name": "Vysarn Limited",
        "summary": "Vysarn Limited, through its subsidiary, Pentium Hydro Pty Ltd, engages in the hydrogeological and dewatering drilling business in Australia. The company was formerly known as MHM Metals Limited and changed its name to Vysarn Limited in December 2017. Vysarn Limited was incorporated in 2007 and is based in West Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "West Perth",
        "zipcode": "6005",
        "website": "http://www.vysarn.com.au",
        "market_cap": "Small Cap"
    },
    "WSI.AX": {
        "short_name": "WESTSTARIN FPO",
        "long_name": "WestStar Industrial Limited",
        "summary": "WestStar Industrial Limited, an industrial services company, provides engineering, construction, and mining services to resource, energy, and infrastructure sectors in Australia. The company operates through Precast Australia, SIMPEC, Alltype Engineering Pty Ltd, and Distinct Development segments. Its services include structural mechanical piping, electrical and instrumentation, non-process infrastructure, pipe plant and structural steel processing, fabrication, civil solutions, asset management, maintenance shutdowns and turnarounds, project management, and multidiscipline turnkey projects. The company also explores for mineral properties; undertakes construction contracting services; provides prefabricated concrete construction services; and develops properties. WestStar Industrial Limited was incorporated in 2006 and is based in Leederville, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Naval Base",
        "zipcode": "6035",
        "website": "http://www.weststarindustrial.com.au",
        "market_cap": "Small Cap"
    }
}