{
  "BOL.AX": {
    "city": "Southbank",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Industrial Distribution",
    "long_name": "Boom Logistics Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "BOOM FPO",
    "state": "VIC",
    "summary": "Boom Logistics Limited provides lifting solutions and specialized labor services to mining and resources, wind, energy and utilities, infrastructure and construction, industrial maintenance, and telecommunication sectors in Australia. The company operates in two segments, Lifting Solutions and Labour Hire. It offers mobile and crawler cranes for wet and dry hire with short term or long term hire facilities; travel towers and access equipment, and associated services; and project management services. The company also provides special hydraulic mobile cranes and low profile prime movers; access equipment, including boom lifts, knuckle booms, elevated work platforms, and travel towers. In addition, it offers heavy haulage vehicles to transport heavy and large equipment, as well as managed lifting solutions and engineering services. Further, the company provides skilled labors for a wide range of trades, such as electricians, boiler makers, mechanics, traditional crane and travel tower operators, riggers, and truck drivers. Its fleet comprises approximately 250 cranes and 100 travel towers. The company was formerly known as The Australian Crane Company and changed its name to Boom Logistics Limited in October 2003. Boom Logistics Limited was incorporated in 2000 and is based in Southbank, Australia.",
    "website": "http://www.boomlogistics.com.au",
    "zipcode": "3006"
  },
  "CYG.AX": {
    "city": "Thomastown",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Industrial Distribution",
    "long_name": "Coventry Group Ltd",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "COVENTRY FPO",
    "state": "VIC",
    "summary": "Coventry Group Ltd primarily distributes industrial products in Australia and New Zealand. It operates through Trade Distribution and Fluids Systems segments. The Trade Distribution segment imports, distributes, and markets industrial fasteners, stainless steel fasteners and hardware, construction fasteners, specialized fastener products and systems, and associated industrial tools and consumables. It also imports, distributes, and markets hardware, components, and finished products to the commercial cabinet making, joinery, and shop fitting industries. The Fluids Systems segment designs and installs lubrication systems; distributes hoses, connectors, fittings, and hydraulic hose assemblies; designs and supplies service truck components; installs fire suppression systems; designs and distributes fluid handling systems, as well as sells pneumatic components, and hydraulic associated products and consumables; and services and repairs rock hammers. Coventry Group Ltd was incorporated in 1936 and is headquartered in Thomastown, Australia.",
    "website": "http://www.cgl.com.au",
    "zipcode": "3074"
  },
  "REH.AX": {
    "city": "Burwood",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Industrial Distribution",
    "long_name": "Reece Limited",
    "market": "au_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "REECE FPO",
    "state": "VIC",
    "summary": "Reece Limited supplies plumbing, bathroom, heating, ventilation, air-conditioning, waterworks, and refrigeration products in Australia, the United States, and New Zealand. It serves customers in the trade, retail, and commercial markets. The company was formerly known as Reece Australia Limited and changed its name to Reece Limited in November 2015. Reece Limited was founded in 1920 and is based in Burwood, Australia.",
    "website": "http://www.reecegroup.com.au",
    "zipcode": "3125"
  },
  "SGI.AX": {
    "city": "Perth",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Industrial Distribution",
    "long_name": "Stealth Global Holdings Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "STEALTH FPO",
    "state": "WA",
    "summary": "Stealth Global Holdings Limited, together with its subsidiaries, supplies and distributes safety, industrial, healthcare, and workplace consumable products to the resources, transportation, industrial, manufacturing, engineering, construction, contracting, and trade retail sectors. It also provides product distribution and contract supply services. The company has operations in Australia, the United Kingdom, Africa, Asia, and Europe. The company was founded in 2014 and is headquartered in Perth, Australia.",
    "website": "http://www.stealthgi.com",
    "zipcode": "6021"
  },
  "SRH.AX": {
    "city": "Pakenham",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Industrial Distribution",
    "long_name": "Saferoads Holdings Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SAFEROADS FPO",
    "state": "VIC",
    "summary": "Saferoads Holdings Limited provides road safety products and solutions in Australia. The company offers flexible guide posts and signage products; rubber-based traffic calming products, including separation kerbs and wheel stops; variable messaging sign boards; decorative and standard street, and road light poles, as well as permanent and temporary public solar lighting poles; and permanent and temporary crash cushions, such as bollards and safety barriers. It also rents road safety solutions. The company is headquartered in Pakenham, Australia.",
    "website": "http://www.saferoads.com.au",
    "zipcode": "3810"
  }
}
