{
    "3MF.AX": {
        "short_name": "3DMETALFL FPO",
        "long_name": "3D Metalforge Limited",
        "summary": "3D Metalforge Limited provides metal additive manufacturing solutions worldwide. It offers in-house metal printing services, including design and engineering, material advisory, diagnostics and testing, printing, and post-production services. The company was founded in 2012 and is based in West Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "West Perth",
        "zipcode": "6005",
        "website": "http://www.3dmetalforge.com",
        "market_cap": "Nano Cap"
    },
    "AL3.AX": {
        "short_name": "AML3D FPO",
        "long_name": "AML3D Limited",
        "summary": "AML3D Limited provides contract manufacturing services to the aerospace, marine, defense, oil and gas, mining, and general manufacturing sectors in Australia, Singapore, Japan, and Europe. It produces metal components and structures through automated wire-fed 3D printing technology. AML3D Limited was founded in 2014 and is headquartered in Edinburgh, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "SA",
        "city": "Edinburgh",
        "zipcode": "5111",
        "website": "http://www.aml3d.com",
        "market_cap": "Nano Cap"
    },
    "KOV.AX": {
        "short_name": "KORVEST FPO",
        "long_name": "Korvest Ltd",
        "summary": "Korvest Ltd, together with its subsidiaries, manufacturers and supplies cable and pipe support systems, galvanising services, and access systems for large mobile equipment in Australia. It operates in two segments, Industrial Products and Production. The Industrial Products segment manufactures electrical and cable support systems, and steel fabrication and access systems. This segment also sells, hires, and repairs high torque tools, such as hydraulic torque wrenches, pneumatic continuous torque wrenches, electronic continuous torque wrenches, huck tools, and power rigs. It conducts its business under the EzyStrut, Power Step and Titan Technologies names. The Production segment provides hot dip galvanising services. It serves infrastructure, commercial, utilities, mining, food processing, oil and gas, power stations, health, and industrial sectors. The company was founded in 1970 and is based in Kilburn, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "SA",
        "city": "Kilburn",
        "zipcode": "5084",
        "website": "http://www.korvest.com.au",
        "market_cap": "Nano Cap"
    }
}