{"BPP.AX": {"short_name": "BABYLONPU FPO", "long_name": "Babylon Pump & Power Limited", "summary": "Babylon Pump & Power Limited focuses on rental of specialty diesel driven pumping and power generation equipment in Australia. The company offers positive displacement pumps, multistage pumps, dewatering and fluid management, liquid and air filtrations, and compressed air dryers. It also offers rebuild and maintenance services for diesel engines and components. The company was formerly known as IM Medical Limited and changed its name to Babylon Pump & Power Limited in December 2017. Babylon Pump & Power Limited was incorporated in 1990 and is headquartered in Forrestfield, Australia.", "currency": "AUD", "sector": "Industrials", "industry": "Rental & Leasing Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Forrestfield"}, "CL8.AX": {"short_name": "CARLYHOLD FPO", "long_name": "Carly Holdings Limited", "summary": "Carly Holdings Limited, an online technology company, provides car subscription services for individuals and businesses in Australia and New Zealand. It operates Carly.co, a car subscription offering; and DriveMyCar.com.au, a peer-to-peer car rental service. The company was formerly known as Collaborate Corporation Limited and changed its name to Carly Holdings Limited in December 2020. Carly Holdings Limited was incorporated in 1994 and is based in Sydney, Australia.", "currency": "AUD", "sector": "Industrials", "industry": "Rental & Leasing Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "E3A.F": {"short_name": "EMECO HOLDINGS LTD", "long_name": "Emeco Holdings Limited", "summary": "Emeco Holdings Limited provides heavy earthmoving equipment and mining service solutions in Australia. The company rents trucks, excavators, dozers, loaders, and graders. It is also involved in the maintenance and remanufacturing of various components of heavy earthmoving equipment. Emeco Holdings Limited was founded in 1972 and is headquartered in Perth, Australia.", "currency": "EUR", "sector": "Industrials", "industry": "Rental & Leasing Services", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Perth"}, "ECX.AX": {"short_name": "ECLIPX FPO", "long_name": "Eclipx Group Limited", "summary": "Eclipx Group Limited provides vehicle fleet leasing, fleet management, and diversified financial services in Australia and New Zealand. The company operates through Australia Commercial, Novated, and New Zealand Commercial segments. It offers vehicle fleet leasing and management, commercial equipment finance and leasing, novated leasing, and consumer motor vehicle finance solutions. The company provides a suite of diversified financial services under the FleetPartners, FleetPlus, FleetChoice, and AutoSelect brands. Eclipx Group Limited was founded in 1987 and is headquartered in St Leonards, Australia.", "currency": "AUD", "sector": "Industrials", "industry": "Rental & Leasing Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "St Leonards"}, "EHL.AX": {"short_name": "EMECO HLDG FPO", "long_name": "Emeco Holdings Limited", "summary": "Emeco Holdings Limited provides heavy earthmoving equipment and mining service solutions in Australia. The company rents trucks, excavators, dozers, loaders, and graders. It is also involved in the maintenance and remanufacturing of various components of heavy earthmoving equipment. Emeco Holdings Limited was founded in 1972 and is headquartered in Perth, Australia.", "currency": "AUD", "sector": "Industrials", "industry": "Rental & Leasing Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Perth"}, "SGF.AX": {"short_name": "SGFLEET FPO", "long_name": "SG Fleet Group Limited", "summary": "SG Fleet Group Limited provides motor vehicle fleet management, vehicle leasing, short term hire, consumer vehicle finance, and salary packaging services in Australia, New Zealand, and the United Kingdom. The company offers fleet management services, including funding options, maintenance plans, registration renewal, fuel cards and reporting, breakdown and accident assistance, comprehensive insurance, vehicle acquisition and disposal, and other products and services. Its products include Bookingintelligence, a resource management application that enables to manage a pool of resources online; Fleetintelligence 2.0, a reporting and management system that enables access to information on vehicle activity; maintenance; and vehicle acquisition and disposal services. The company also offers commercial vehicle and truck solutions, including multiple leasing options; initial commissioning, sourcing, and acquisition; maintenance, registration, and toll management; asset disposal; and regular reviews. In addition, it provides salary packaging services; sgfleet app to track Novated lease; Logbook and the Logbook App for record keeping requirements of vehicles used for business purposes; vehicle accessories, such as window tinting, in-car communications, vehicle safety kits and security systems, satellite navigation systems, ARB's protection products, plates, in-vehicle entertainment options, and car care protection products; FBT intelligence, a computer based system to make collecting and analyzing information for fringe benefits taxes; and registration management, traffic infringements, and toll management services. The company was founded in 1986 and is based in Pymble, Australia. SG Fleet Group Limited is a subsidiary of Bluefin Investments Limited.", "currency": "AUD", "sector": "Industrials", "industry": "Rental & Leasing Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Pymble"}, "TGA.AX": {"short_name": "THORN GRP FPO", "long_name": "Thorn Group Limited", "summary": "Thorn Group Limited, a diversified financial services company, provides alternate consumer and commercial leasing products, and consumer and commercial financing solutions. It is involved in the leasing of household products to consumers; and provision of commercial asset finance to small and medium size enterprises under the Radio Rentals name. Thorn Group Limited was founded in 1937 and is based in Chullora, Australia.", "currency": "AUD", "sector": "Industrials", "industry": "Rental & Leasing Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Chullora"}}