{"DFNNF": {"short_name": "DFNN INC", "long_name": "DFNN, Inc.", "summary": "DFNN, Inc. operates as an information technology (IT) solutions provider and systems integrator. The company offers IT solutions and outsourcing services; gaming platform solutions; and financial transactions, software/ middleware development, IT support, platform development, and turnkey implementation services. It also develops and markets application software products, as well as offers internet-based, value-added, and other related consultancy services. In addition, it licenses software for electronic gaming machines, a sportsbetting exchange, and digit and pari-mutuel games; and betting and gaming technologies. Further, the company provides on-line transaction processing and other business process outsource applications catering to financial institutions; and customer support services. It primarily serves financial institutions and gaming companies in the Philippines and Singapore. The company was formerly known as Diversified Financial Network, Inc. and changed its name to DFNN, Inc. in October 2009. DFNN, Inc. was founded in 1999 and is based in Taguig, the Philippines.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Philippines", "city": "Taguig City"}, "SFWJ": {"short_name": "SOFTWARE EFFECTIVE SOLUTIONS CO", "long_name": "Software Effective Solutions Corp.", "summary": "Software Effective Solutions, Inc. provides customer relations management software tools for small and medium-sized organizations, and telecom operators in the Asia Pacific region. It offers workforce management, call centers, resource management customer service, inventory, marketing and sales, and mobile solutions. The company is headquartered in Makati City, the Philippines.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Philippines", "city": "Makati City"}}