{
    "5M71.F": {
        "short_name": "MAGNIT GDR REG.S/1/5RL-01",
        "long_name": "Public Joint Stock Company Magnit",
        "summary": "Public Joint Stock Company Magnit, together with its subsidiaries, engages in the retail and distribution of food and consumer goods under the Magnit name. It operates retail business through convenience stores, cosmetic stores, hypermarkets, supermarkets, drogerie stores, pharmacies, and others. As of September 30, 2020, the company operated 38 distribution centers and 21,154 stores, including 14,699 convenience, 469 supermarkets, and 5,986 drogerie stores in 3,819 cities and towns throughout 7 federal regions of the Russian Federation. It also trades in medicines and medical products; and produces medical devices. The company was founded in 1994 and is headquartered in Krasnodar, Russia.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Discount Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Russia",
        "city": "Krasnodar"
    },
    "ABRD.ME": {
        "short_name": "ABRAU-DURSO PJSC",
        "long_name": "Public Joint Stock Company Abrau-Durso",
        "summary": "Public Joint Stock Company Abrau-Durso produces and sells wine in Russia. The company offers its wine under the Millezims, Alexander II, Brut D'Or Blanc De Blancs, Victor Dravigny, Imperial Domain, Russian Sparkling Wine, Abrau Light, Abrau Wine, and Foliage brand names. It also engages in the culinary school, hotel, spa, restaurant, cafe, event, and confectionery businesses. In addition, the company exports its products. The company was founded in 1870 and is headquartered in Moscow, Russia. Public Joint Stock Company Abrau-Durso is a subsidiary of OOO Aktiv-Media.",
        "currency": "RUB",
        "sector": "Consumer Defensive",
        "industry": "Beverages—Wineries & Distilleries",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Moscow"
    },
    "AQUA.ME": {
        "short_name": "RUSSIAN AQUACULTUR",
        "long_name": "PJSC Russian Aquaculture",
        "summary": "PJSC Russian Aquaculture engages in the farming and distribution of fish and caviar in the Republic of Karelia and Murmansk region, Russia. It cultivates red fish products, such as Atlantic salmon and rainbow trout. The company was formerly known as OJSC Russian Sea Group and changed its name to PJSC Russian Aquaculture in February 2015. PJSC Russian Aquaculture was founded in 1997 and is headquartered in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Moscow"
    },
    "BELU.ME": {
        "short_name": "BELUGA GROUP",
        "long_name": "Beluga Group Public Joint-Stock Company",
        "summary": "Beluga Group Public Joint-Stock Company, together with its subsidiaries, engages in the production, wholesale, and retail of distilled alcohol and food products in Russia and internationally. It operates through three segments: Alcohol, Retail, and Food Production. The company provides vodkas primarily under the Beluga, Myagkov, Belenkaya, Russian Ice, Tsar, White owl, and Arkhangelskaya brands; and brandy primarily under the Bastion, Zolotoy Rezerv, Staraya Gvardia, and Kamenniy Lev brands, as well as bitter under the Doctor August, Beluga Hunting, and Captain's brands. It also offers absinthe, balm, wine, whiskey, gin, calvados, cognac, liquor, tincture, rum, and tequila. The company was formerly known as Public Joint- Stock Company Â\u0091Synergy' and changed its name to Beluga Group Public Joint-Stock Company in June 2017. Beluga Group Public Joint-Stock Company was founded in 1998 and is based in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Consumer Defensive",
        "industry": "Beverages—Wineries & Distilleries",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Moscow"
    },
    "GCHE.ME": {
        "short_name": "CHERKIZOVO GROUP",
        "long_name": "Public Joint Stock Company \"Cherkizovo Group\"",
        "summary": "Public Joint Stock Company Cherkizovo Group, together with its subsidiaries, engages in poultry and pork production, and meat processing activities in Russia and internationally. It operates through five segments: Meat Processing, Pork, Poultry, Grain, and Feed. The company produces a range of processed meat products, including sausages, ham, hot dogs, cutlets, pork meat, etc. It also engages in the breeding, raising, and processing of broilers; sale of chilled and frozen chicken products; and breeding, raising, and sale of live pigs. In addition, the company is involved in the farming of wheat and other crops; production of dairy; sale of non-hatchery eggs; and other services. It offers its products under the Cherkizovo, Pyat Zvezd, Petelinka, Kurinoe Tsarstvo, and Imperia Vkusa brands. Public Joint Stock Company Cherkizovo Group is headquartered in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Moscow"
    },
    "GRQ.SI": {
        "short_name": "$ Don Agro",
        "long_name": "Don Agro International Limited",
        "summary": "Don Agro International Limited, together with its subsidiaries, operates as an agricultural company in the Rostov region in Russia. It operates through two segments, Crops and Livestock. The Crops segment produces and sells agricultural produce, which include winter wheat, sunflower, sorghum, corn, and flax. This segment sells its agricultural produce primarily to international and local grain traders and exporters. The Livestock segment produces and sells raw milk to dairy processing companies. This segment also engages in the sale of livestock. The company is also involved in asset leasing and construction of livestock building activities. Don Agro International Limited was incorporated in 2018 and is headquartered in Millerovo, Russia.",
        "currency": "SGD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Russia",
        "city": "Millerovo"
    },
    "KROT.ME": {
        "short_name": "KRASNYJ OCTYABR",
        "long_name": "Public Joint-Stock Company Krasnyj Octyabr",
        "summary": "Public Joint-Stock Company Krasnyj Octyabr produces and sells confectionery products in Russia. The company was founded in 1867 and is based in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Moscow"
    },
    "MGNT.ME": {
        "short_name": "MAGNIT PJSC",
        "long_name": "Public Joint Stock Company Magnit",
        "summary": "Public Joint Stock Company Magnit, together with its subsidiaries, engages in the retail and distribution of food and consumer goods under the Magnit name. It operates retail business through convenience stores, cosmetic stores, hypermarkets, supermarkets, drogerie stores, pharmacies, and others. As of September 30, 2020, the company operated 38 distribution centers and 21,154 stores, including 14,699 convenience, 469 supermarkets, and 5,986 drogerie stores in 3,819 cities and towns throughout 7 federal regions of the Russian Federation. It also trades in medicines and medical products; and produces medical devices. The company was founded in 1994 and is headquartered in Krasnodar, Russia.",
        "currency": "RUB",
        "sector": "Consumer Defensive",
        "industry": "Discount Stores",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Krasnodar"
    },
    "MGNT.VI": {
        "short_name": "MAGNIT GDR",
        "long_name": "Public Joint Stock Company Magnit",
        "summary": "Public Joint Stock Company Magnit, together with its subsidiaries, engages in the retail and distribution of food and consumer goods under the Magnit name. It operates retail business through convenience stores, cosmetic stores, hypermarkets, supermarkets, drogerie stores, pharmacies, and others. As of September 30, 2020, the company operated 38 distribution centers and 21,154 stores, including 14,699 convenience, 469 supermarkets, and 5,986 drogerie stores in 3,819 cities and towns throughout 7 federal regions of the Russian Federation. It also trades in medicines and medical products; and produces medical devices. The company was founded in 1994 and is headquartered in Krasnodar, Russia.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Discount Stores",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Russia",
        "city": "Krasnodar"
    },
    "RUGR.ME": {
        "short_name": "RUSGRAIN HOLDING",
        "long_name": "Public Joint-Stock Company Rusgrain Holding",
        "summary": "Public Joint-Stock Company Rusgrain Holding cultivates, processes, stores, and trades in agricultural products in Russia and internationally. It offers a range of agricultural products, such as poultry products, dairy products, and cereals. The company also operates poultry farms; processes poultry meat in sausages, smoked meats, delicacies, and semi-finished products; and offers chicken eggs and broiler meat. It operates under the Avdon and Turbaslinsky Broiler brand names. In addition, the company produces and supplies feed to poultry farms. Public Joint-Stock Company Rusgrain Holding was founded in 2004 and is based in Ufa, Russia.",
        "currency": "RUB",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Ufa"
    },
    "SVET.ME": {
        "short_name": "SVETOFOR GROUP PJS",
        "long_name": "JSC Svetofor Group",
        "summary": "JSC Svetofor Group provides educational services for training drivers on various vehicle. The company was formerly known as OOO PDD.TV and changed its name to JSC Svetofor Group in 2017. JSC Svetofor Group was incorporated in 2010 and is based in Saint Petersburg, Russia.",
        "currency": "RUB",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Saint Petersburg"
    }
}