{
    "AQUA.ME": {
        "short_name": "RUSSIAN AQUACULTUR",
        "long_name": "PJSC Russian Aquaculture",
        "summary": "PJSC Russian Aquaculture engages in the farming and distribution of fish and caviar in the Republic of Karelia and Murmansk region, Russia. It cultivates red fish products, such as Atlantic salmon and rainbow trout. The company was formerly known as OJSC Russian Sea Group and changed its name to PJSC Russian Aquaculture in February 2015. PJSC Russian Aquaculture was founded in 1997 and is headquartered in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "121353",
        "website": "http://www.russaquaculture.ru",
        "full_time_employees": null
    },
    "GRQ.SI": {
        "short_name": "$ Don Agro",
        "long_name": "Don Agro International Limited",
        "summary": "Don Agro International Limited, together with its subsidiaries, operates as an agricultural company in the Rostov region in Russia. It operates through two segments, Crops and Livestock. The Crops segment produces and sells agricultural produce, which include winter wheat, sunflower, sorghum, corn, and flax. This segment sells its agricultural produce primarily to international and local grain traders and exporters. The Livestock segment produces and sells raw milk to dairy processing companies. This segment also engages in the sale of livestock. The company is also involved in asset leasing and construction of livestock building activities. Don Agro International Limited was incorporated in 2018 and is headquartered in Millerovo, Russia.",
        "currency": "SGD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Russia",
        "state": null,
        "city": "Millerovo",
        "zipcode": "346130",
        "website": "http://www.donagroint.com",
        "full_time_employees": null
    },
    "RUGR.ME": {
        "short_name": "RUSGRAIN HOLDING",
        "long_name": "Public Joint-Stock Company Rusgrain Holding",
        "summary": "Public Joint-Stock Company Rusgrain Holding cultivates, processes, stores, and trades in agricultural products in Russia and internationally. It offers a range of agricultural products, such as poultry products, dairy products, and cereals. The company also operates poultry farms; processes poultry meat in sausages, smoked meats, delicacies, and semi-finished products; and offers chicken eggs and broiler meat. It operates under the Avdon and Turbaslinsky Broiler brand names. In addition, the company produces and supplies feed to poultry farms. Public Joint-Stock Company Rusgrain Holding was founded in 2004 and is based in Ufa, Russia.",
        "currency": "RUB",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Ufa",
        "zipcode": "450018",
        "website": "http://www.rusgrain.ru",
        "full_time_employees": null
    }
}