{
    "HCITY.MX": {
        "short_name": "HOTELES CITY EXPRESS SAB DE CV",
        "long_name": "Hoteles City Express, S.A.B. de C.V.",
        "summary": "Hoteles City Express, S.A.B. de C.V. operates and franchises a chain of limited-service hotels in Mexico, Costa Rica, Colombia, and Chile. As of December 31, 2020, it operated 154 hotels under the City Express, City Express Plus, City Express Suites, City Express Junior, and City Centro brands. The company also leases commercial space for rent. It primarily serves business travelers. The company was founded in 2002 and is based in Mexico City, Mexico.",
        "currency": "MXN",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Mexico",
        "state": "DF",
        "city": "Mexico City",
        "zipcode": "05348",
        "website": "http://www.cityexpress.com",
        "market_cap": "Micro Cap"
    },
    "HOTEL.MX": {
        "short_name": "GRUPO HOTELERO SANTA FE SAB DE ",
        "long_name": "Grupo Hotelero Santa Fe, S.A.B. de C.V.",
        "summary": "Grupo Hotelero Santa Fe, S.A.B. de C.V. acquires, develops, and operates city and beach hotels in Mexico. It operates in three segments: Urban Services, Resort Services, and Operator and Holding. The company operates a portfolio of hotels under owned brands, such as Krystal Resorts, Krystal Grand, Krystal Beach, and Krystal Urban; and franchises licensed brands, including Hilton, Hyatt, Marriott and Accor, and others, as well as operates third party hotels. It operates hotels in the 4 stars, 5 stars, and Gran Tourism markets. The company has a strategic alliance with AMResorts and private investors to develop the Breathless Tulum Resort & Spa, a tourism category resort. Grupo Hotelero Santa Fe, S.A.B. de C.V. is based in Mexico City, Mexico.",
        "currency": "MXN",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Mexico",
        "state": "DF",
        "city": "Mexico City",
        "zipcode": "05348",
        "website": "http://www.gsf-hotels.com",
        "market_cap": "Micro Cap"
    },
    "POSADASA.MX": {
        "short_name": "GRUPO POSADAS SAB DE CV",
        "long_name": "Grupo Posadas, S.A.B. de C.V.",
        "summary": "Grupo Posadas, S.A.B. de C.V. owns, operates, and manages hotels primarily in Mexico. The company operates hotels primarily under the Live Aqua, Grand Fiesta Americana, Fiesta Americana, The Explorean, Fiesta Inn, One Hotels, and Gamma brand names. It also operates Fiesta Americana Vacation Club that sells vacation club memberships, as well as purchases and sells real estate properties in the tourism industry. As of December 30, 2019, the company operated 184 hotels with approximately 29, 851 rooms. Grupo Posadas, S.A.B. de C.V. was founded in 1967 and is based in Mexico City, Mexico.",
        "currency": "MXN",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Mexico",
        "state": "DF",
        "city": "Mexico City",
        "zipcode": "01210",
        "website": "http://www.posadas.com",
        "market_cap": "Small Cap"
    }
}