{
  "AFRE.TA": {
    "city": "Or Yehuda",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Real Estate - Development",
    "long_name": "Africa Israel Residences Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Real Estate",
    "short_name": "AFRICA ISRAEL RESI",
    "state": null,
    "summary": "Africa Israel Residences Ltd engages in the development and sale of residential units under the Savyonim brand in Israel. The company offers apartments within residential neighborhoods. It is also involved in the online sale of penthouses, garden apartments, and duplexes. The company is headquartered in Or Yehuda, Israel.",
    "website": "http://res.afi-g.com",
    "zipcode": "6037601"
  },
  "ARPT.TA": {
    "city": "Petah Tikva",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Real Estate - Development",
    "long_name": "Airport City Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Real Estate",
    "short_name": "AIRPORT CITY",
    "state": null,
    "summary": "Airport City Ltd., together with its subsidiary, operates as a real estate company in Israel and France. The company engages in the development of residential and commercial real estate projects; and leasing and managing of income-generating properties. It owns approximately 125 income generating and land properties, including central bus stations, offices, shopping centers, business centers, transport centers, residential, and hotel properties, as well as business parks. Airport City Ltd. was incorporated in 1992 and is based in Petach Tikva, Israel.",
    "website": "http://www.nitsba.com",
    "zipcode": "4951407"
  },
  "ASHG.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Real Estate - Development",
    "long_name": "Ashtrom Group Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Real Estate",
    "short_name": "ASHTROM GROUP LTD",
    "state": null,
    "summary": "Ashtrom Group Ltd. operates as a construction and property company in Israel and internationally. It constructs various projects comprising infrastructures and mega-projects, residential and public buildings, hotels, office blocks, retail and industrial facilities, industrial building plants, and groundwork and underground infrastructures, as well as educational, community, and security institutions. The company also produces, markets, and sells concrete and mortar products, white autoclaved blocks, gypsum interlocking blocks, waterproofing and insulation systems, adhesives, coatings, cladding materials, and mined and quarried materials for the building industries and the infrastructures sector. In addition, it operates concession projects, such as public infrastructure, construction, and transport projects; develops land; initiates, builds, and markets housing developments; and initiates, procures, owns, and manages offices and businesses, commerce, industrial and logistics facilities, and hotels, as well as invests in properties. The company was founded in 1963 and is headquartered in Tel Aviv-Yafo, Israel. Ashtrom Group Ltd. is a subsidiary of Unedco United Engineering and Development Company Ltd.",
    "website": "http://www.ashtrom.co.il",
    "zipcode": "6789910"
  },
  "AZRM.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Real Estate - Development",
    "long_name": "Azorim-Investment, Development & Construction Co. Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Real Estate",
    "short_name": "AZORIM INV DEV",
    "state": null,
    "summary": "Azorim-Investment, Development & Construction Co. Ltd designs and constructs apartments in Israel. It constructs residential apartments, including garden apartments, mini penthouses, and penthouses, as well as communities. The company is headquartered in Tel Aviv, Israel.",
    "website": "http://www.azorim.co.il",
    "zipcode": null
  },
  "BYAR.TA": {
    "city": "Jerusalem",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Real Estate - Development",
    "long_name": "B. Yair Building Corporation 1988 Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Real Estate",
    "short_name": "B.YAIR BUILDING CO",
    "state": null,
    "summary": "B. Yair Building Corporation 1988 Ltd, a construction company, develops and builds real estate projects in Israel and internationally. The company initiates and builds apartments, public buildings, and commercial structures. It also invests in commercial and office buildings. B. Yair Building Corporation 1988 Ltd is based in Jerusalem, Israel.",
    "website": "http://www.b-yair.co.il",
    "zipcode": null
  },
  "BYSD.TA": {
    "city": "Haifa",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Real Estate - Development",
    "long_name": "Bayside Land Corporation Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Real Estate",
    "short_name": "BAYSIDE LAND",
    "state": null,
    "summary": "Bayside Land Corporation Ltd operates as a real estate company in Israel. It initiates, plans, constructs, develops, leases, maintains, and manages high-tech, and industrial and commercial parks and centers, offices, logistic centers, and residential neighborhoods. The company was founded in 1928 and is based in Haifa, Israel.",
    "website": "http://www.gav-yam.co.il",
    "zipcode": "31905"
  },
  "DCMA.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Real Estate - Development",
    "long_name": "Decama Capital Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Real Estate",
    "short_name": "DECAMA CAPITAL LTD",
    "state": null,
    "summary": "Decama Capital Ltd, an investment company, invests in real estate and real estate backed debt. The company was formerly known as Gabay Urban Development Ltd. Decama Capital Ltd was founded in 2005 and is based in Tel Aviv, Israel.",
    "website": "http://www.decama.co.il",
    "zipcode": "5126107"
  },
  "DRSL.TA": {
    "city": "Yokne'am",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Real Estate - Development",
    "long_name": "Dorsel (B.A.Z.) Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Real Estate",
    "short_name": "DORSEL (B.A.Z.)",
    "state": null,
    "summary": "Dorsel (B.A.Z.) Ltd engages in the real estate business in Israel. It rents office properties, as well as initiates and develops real estate projects. The company was founded in 1995 and is based in Yokneam, Israel. Dorsel (B.A.Z.) Ltd operates as a subsidiary of Synel M.L.L Payway Ltd.",
    "website": "http://dorsel.co.il",
    "zipcode": "20692"
  },
  "HNMR.TA": {
    "city": "Ness Ziona",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Real Estate - Development",
    "long_name": "Hanan Mor Group - Holdings Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Real Estate",
    "short_name": "HANAN MOR GRP HLDG",
    "state": null,
    "summary": "Hanan Mor Group - Holdings Ltd operates as a real estate development company in Israel and internationally. It initiates, constructs, and develops residential real estate properties; and commercial real estate properties, such as hotels, shopping centers, malls, and offices. The company was founded in 2004 and is based in Ness Ziona, Israel. Hanan Mor Group - Holdings Ltd is a subsidiary of Hanan Mor Group Holdings 2006 Ltd.",
    "website": "http://www.hmg.co.il",
    "zipcode": "74047"
  },
  "HRON.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Real Estate - Development",
    "long_name": "Hiron-Trade Investments & Industrial Buildings Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Real Estate",
    "short_name": "HIRON TRADE INVS",
    "state": null,
    "summary": "Hiron-Trade Investments & Industrial Buildings Ltd engages in the real estate rental activities in Israel. The company acquires plots and assets, as well as constructs commercial centers; and constructs and leases refrigerated houses, bonded warehouses, archives, logistic warehouses, light industry facilities, offices, and commercial sales centers. It also imports and markets trees and wooden products, including plywood for the furniture industry, as well as M.D.F, white and pine, beech, rough, and hard tree wood. The company was founded in 1974 and is based in Tel Aviv, Israel.",
    "website": null,
    "zipcode": "68162"
  },
  "ISCN.TA": {
    "city": "Herzliya",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Real Estate - Development",
    "long_name": "Israel Canada (T.R) Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Real Estate",
    "short_name": "ISRAEL CANADA T.R",
    "state": null,
    "summary": "Pangaea Real-Estate Ltd. is a principal investment firm specializing in investments in real estate. The firm seeks to invest in Europe. Pangaea Real-Estate Ltd. was founded in 2000 and is based in Ramat Gan, Israel.",
    "website": "http://www.israel-canada.co.il",
    "zipcode": "4672553"
  },
  "MSLA.TA": {
    "city": "Kiryat Ono",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Real Estate - Development",
    "long_name": "Maslavi Construction Company Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Real Estate",
    "short_name": "MASLAVI CONSTRUCTI",
    "state": null,
    "summary": "Maslavi Construction Company Ltd operates in the construction and real estate industry in Israel. The company develops, constructs, markets, and sells residential, commercial, industrial, and employment buildings, as well as commercial centers and public institutions; owns and manages rental and commercial properties; and undertakes urban renewal/evacuation construction works. It also maintains and manages office and commercial properties. The company was founded in 1977 and is based in Kiryat Ono, Israel.",
    "website": "http://www.matzlawi.co.il",
    "zipcode": null
  },
  "PRSK.TA": {
    "city": "Rehovot",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Real Estate - Development",
    "long_name": "Prashkovsky Investments and Construction Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Real Estate",
    "short_name": "PRASHKOVSKY INVS",
    "state": null,
    "summary": "Prashkovsky Investments and Construction Ltd. develops, constructs, and sells various projects in Israel. It constructs residential, commercial, industrial, and office spaces. The company is based in Rehovot, Israel.",
    "website": "http://www.prashkovsky.co.il",
    "zipcode": null
  },
  "SRFT.TA": {
    "city": "Rishon LeZion",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Real Estate - Development",
    "long_name": "Zvi Sarfati & Sons Investments & Constructions Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Real Estate",
    "short_name": "ZVI SARFATI & SONS",
    "state": null,
    "summary": "Zvi Sarfati & Sons Investments & Constructions Ltd. operates as a construction company in Israel. It constructs residential and apartment projects, as well as commercial areas and offices. The company is based in Rishon LeZion, Israel.",
    "website": "http://www.zarfati-zvi.com",
    "zipcode": "7526201"
  },
  "VTNA.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Real Estate - Development",
    "long_name": "Vitania Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Real Estate",
    "short_name": "VITANIA LTD",
    "state": null,
    "summary": "Vitania Ltd. acquires, plans, develops, constructs, leases, manages, and markets real estate properties in Israel. Its properties include office, commercial, and residential buildings. The company was founded in 1995 and is based in Tel Aviv, Israel.",
    "website": "http://www.vitania.co.il",
    "zipcode": null
  },
  "ZMH.TA": {
    "city": "Hadera",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Real Estate - Development",
    "long_name": "Z.M.H Hammerman Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Real Estate",
    "short_name": "Z.M.H HAMMERMAN LT",
    "state": null,
    "summary": "Z.M.H Hammerman Ltd operates as a real estate company in Israel. The company develops, constructs, and executes residential projects, as well as high-tech, commercial, office, and industrial building projects. Z.M.H Hammerman Ltd was founded in 1997 and is based in Hadera, Israel.",
    "website": "http://www.zhg.co.il",
    "zipcode": "3811001"
  }
}
