{
    "ADGR.TA": {
        "short_name": "ADGAR INVEST & DEV",
        "long_name": "Adgar Investments and Development Ltd",
        "summary": "Adgar Investments and Development Ltd engages in the real estate activities in Israel, Canada, Poland, and Belgium. The company primarily invests in office properties. It also develops income-producing office assets through land purchases and utilization of land reserves associated to various property holdings. The company is based in Petah Tikva, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Petah Tikva",
        "zipcode": "49511",
        "website": "http://www.adgar.com",
        "market_cap": 1016759296
    },
    "AFPR.TA": {
        "short_name": "AFI PROPERTIES",
        "long_name": "AFI Properties Ltd",
        "summary": "AFI Properties Ltd engages in the initiation, establishment, preparation, and operation of industrial buildings, offices, and commercial premises in Israel and Europe. It is involved in the development and operation of various projects that include shopping malls, logistics parks, office complexes, and residential properties. The company was formerly known as Africa Israel Properties Ltd. and changed its name to AFI Properties Ltd in July 2019. AFI Properties Ltd was founded in 1971 and is based in Yahud, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Yehud",
        "zipcode": null,
        "website": "http://afigroup-global.com/israel-real-estate/income-yielding-properties",
        "market_cap": 5019341312
    },
    "ALHE.TA": {
        "short_name": "ALONY HETZ",
        "long_name": "Alony-Hetz Properties & Investments Ltd",
        "summary": "Alony Hetz Properties and Investments Ltd. publicly owned holding real-estate investment manager. Through its subsidiaries, the firm focuses on income-generating commercial real estate. It primarily invests in Israel, Europe, and North America. The firm also seeks to invest in India and Sweden. Alony Hetz Properties and Investments was founded in 1989 and is based in Ramat Gan, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Ramat-Gan",
        "zipcode": "5250501",
        "website": "http://www.alony-hetz.com",
        "market_cap": 7939826688
    },
    "AMOT.TA": {
        "short_name": "AMOT INVESTMENTS",
        "long_name": "Amot Investment Ltd",
        "summary": "Amot Investments, Ltd. is a real estate investment manager. The firm invests in real estate markets of Israel. Its properties include central bus stations, commercial centers, supermarkets, banks, and other commercial areas. Amot Investments, Ltd. is based in Ramat-gan, Israel. Amot Investments Ltd. operates as a subsidiary of Alony Hetz Properties & Investments Ltd.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Ramat Gan",
        "zipcode": "5250501",
        "website": "http://www.amot.co.il",
        "market_cap": 9005139968
    },
    "ARNA.TA": {
        "short_name": "ARENA STAR GROUP L",
        "long_name": "Arena Star Group Ltd.",
        "summary": "Arena Star Group Ltd. engages in the real estate activities in Israel and Kazakhstan. Its Commercial Centers segment is involved in the development, construction, acquisition, leasing, management, and maintenance of malls and shopping centers. The company's Real Estate Development segment engages in the planning, development, and construction of residential and commercial projects. Its Others segment is involved in the maintenance of land in land rights. The company was formerly known as Israel Financial Levers (IFL) Ltd. and changed its name to Arena Star Group Ltd. in August 2014. Arena Star Group Ltd. was founded in 1992 and is based in Tel Aviv, Israel. Arena Star Group Ltd., operates as a subsidiary of Asian Service Trade Control Rte. Ltd.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": null,
        "website": null,
        "market_cap": 318290560
    },
    "ASGR.TA": {
        "short_name": "ASPEN GROUP LTD",
        "long_name": "Aspen Group Ltd.",
        "summary": "Aspen Group Ltd. operates as a real estate company in Israel, Germany, the Netherlands, and Switzerland. The company owns and manages approximately 347,000 square meters of yielding properties. Its property portfolio comprises offices, malls, commercial properties, light industries, colleges, logistics and distribution centers, and shops. The company was formerly known as Aspen Construction and Development Ltd. and changed its name to Aspen Group Ltd. in July 2009. Aspen Group Ltd. is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "6106054",
        "website": "http://www.e.aspen.co.il",
        "market_cap": 520675296
    },
    "AURA.TA": {
        "short_name": "AURA INVESTMENTS",
        "long_name": "Aura Investments Ltd.",
        "summary": "Aura Investments Ltd. engages in the planning and establishing of real estate projects in Israel. It builds residential projects; and develops urban renewal projects. The company was incorporated in 1992 and is headquartered in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "67023",
        "website": "http://www.auraisrael.co.il",
        "market_cap": 775901440
    },
    "AZRG.TA": {
        "short_name": "AZRIELI GROUP",
        "long_name": "Azrieli Group Ltd",
        "summary": "Azrieli Group Ltd operates in the real estate industry. The company operates through four segments: Retail Centers and Malls in Israel, Leasable Office and Other Space in Israel, Income-Producing Properties segment in the U.S., and Senior Housing segments. It develops, acquires, leases out, manages, and maintains malls and retails centers in Israel; and office buildings and parks for offices and high-tech industry, as well as logistic areas and storage. As of December 31, 2020, the company owned 18 malls and retail centers, and 16 income-producing properties in the office and other space in Israel; and 8 office properties in the United States. The company has four active senior homes in an aboveground built-up area of approximately 105 thousand square meters (sqm), including approximately 1,034 senior housing units and projects under development and construction for approximately 275 residential units in a total area of approximately 31 thousand sqm. It also engages in the e-commerce and hospitality operation; and invests in banking and financial corporations, and investment funds, as well as operates hotel. The company was incorporated in 1983 and is based in Tel Aviv, Israel. Azrieli Group Ltd is a subsidiary of Nadav Investments Inc.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "67021",
        "website": "http://www.azrieligroup.com",
        "market_cap": 29614866432
    },
    "BIG.TA": {
        "short_name": "BIG SHOPPING CENTE",
        "long_name": "BIG Shopping Centers Ltd",
        "summary": "BIG Shopping Centers Ltd invests in, develops, operates, and manages shopping centers and malls primarily in Israel, the United States, and Serbia. The company also develops logistics, offices, and residential projects. It owns and manages 62 shopping centers and malls. The company was founded in 1994 and is headquartered in Herzliya, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Herzliya",
        "zipcode": null,
        "website": "http://www.bigcenters.co.il",
        "market_cap": 7871844864
    },
    "BLSR.TA": {
        "short_name": "BLUE SQUARE REAL",
        "long_name": "Blue Square Real Estate Ltd",
        "summary": "Blue Square Real Estate Ltd develops, owns, leases, manages, and sells real estate properties in Israel. It offers retail, commercial, office, logistic, and residential properties. The company was founded in 2005 and is based in Rosh Ha'ayin, Israel. Blue Square Real Estate Ltd is a subsidiary of Alon Blue Square Israel Ltd.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "6701101",
        "website": null,
        "market_cap": 2751437568
    },
    "BOTI.TA": {
        "short_name": "BONEI HATICHON CIV",
        "long_name": "Bonei Hatichon Civil Engineering & Infrastructures Ltd.",
        "summary": "Bonei Hatichon Civil Engineering & Infrastructures Ltd. operates as a real estate company in Israel. The company develops, markets, and manages residential, commercial, and luxury buildings. It is also involved in locating, promoting, and executing of urban renewal projects. The company was incorporated in 1985 and is based in Holon, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Holon",
        "zipcode": "8122504",
        "website": "http://www.boh.co.il",
        "market_cap": 147545584
    },
    "CTPL1.TA": {
        "short_name": "I.C.P. ISRAEL CITR",
        "long_name": "I.C.P. Israel Citrus Plantations Ltd.",
        "summary": "I.C.P. Israel Citrus Plantations Ltd. engages in agriculture and properties rental businesses in Israel. It operates through two segments, Agriculture and Investment Property. The company delivers various agricultural services, which include planting orchards; and maintenance and processing, including fertilization, irrigation, pest control and spraying, fruit orchard species replacement, harvest management, and orchard management. It is also involved in the development, leasing, and management of land and buildings. The company was incorporated in 1958 and is based in Tel Aviv, Israel. I.C.P. Israel Citrus Plantations Ltd. is a subsidiary of A. Ben-Ezer and Sons Ltd.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "64952",
        "website": null,
        "market_cap": 91976960
    },
    "CTPL5.TA": {
        "short_name": "I.C.P. ISRAEL CITR",
        "long_name": "I.C.P. Israel Citrus Plantations Ltd.",
        "summary": "I.C.P. Israel Citrus Plantations Ltd. engages in agriculture and properties rental businesses in Israel. It operates through two segments, Agriculture and Investment Property. The company delivers various agricultural services, which include planting orchards; and maintenance and processing, including fertilization, irrigation, pest control and spraying, fruit orchard species replacement, harvest management, and orchard management. It is also involved in the development, leasing, and management of land and buildings. The company was incorporated in 1958 and is based in Tel Aviv, Israel. I.C.P. Israel Citrus Plantations Ltd. is a subsidiary of A. Ben-Ezer and Sons Ltd.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "64952",
        "website": null,
        "market_cap": 106064040
    },
    "DIMRI.TA": {
        "short_name": "DIMRI BUILDING",
        "long_name": "Y.H. Dimri Construction & Development Ltd",
        "summary": "Y.H. Dimri Construction & Development Ltd operates as a construction company in Israel, Romania, and the Czech Republic. The company specializes in building residential neighborhoods, projects, and urban renewal. It also plans and constructs commercial, industrial, and hotel projects. The company is based in Netivot, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Netivot",
        "zipcode": null,
        "website": "http://www.dimri.co.il",
        "market_cap": 3736007680
    },
    "EDRL.TA": {
        "short_name": "EDRI-EL ISRAEL ASS",
        "long_name": "Edri-El Israel Assets Ltd.",
        "summary": "Edri-El Israel Assets Ltd. initiates, develops, constructs, leases, manages, and maintains commercial investment properties in Israel. It serves tenants of commercial areas/offices in various industries, including fashion, food, electricity, electronics, finance, health, and transportation industries. The company was formerly known as Edri-El Holdings Ltd. Edri-El Israel Assets Ltd. was founded in 2006 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": null,
        "website": "http://www.edrigroup.co.il",
        "market_cap": 19178370
    },
    "ELCRE.TA": {
        "short_name": "ELECTRA REAL ESTAT",
        "long_name": "Electra Real Estate Ltd.",
        "summary": "Electra Real Estate Ltd. owns and operates commercial real estate properties. It holds and manages over 80 multi-family complexes, and approximately 28,000 residential units in Texas, Florida, Georgia, Tennessee, and North and South Carolina. The company was founded in 1972 and is based in Tel Aviv, Israel. Electra Real Estate Ltd. is a subsidiary of Elco Ltd.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "67891",
        "website": "http://www.elco.co.il",
        "market_cap": 2211316736
    },
    "IES.TA": {
        "short_name": "IES HOLDINGS LTD",
        "long_name": "I.E.S Holdings Ltd",
        "summary": "IES Holdings Ltd. primarily engages in the production and marketing of construction products in Israel and internationally. The company operates through Spare and Investment and Real Estate for Rent; and Other segments. It provides pre-cast concrete products for the construction industry. The company is also involved in the rental and leasing of land; development of real estate properties; and establishment of the airpark in the Ovda military base, as well as the natural gas power station in Palmachim Park. It serves construction companies and commercial tenants. The company was formerly known as I.E.S Saar Ltd. and changed its name to IES Holdings Ltd. in February 2005. IES Holdings Ltd. was founded in 1987 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "65201",
        "website": "http://www.mail.ies.com",
        "market_cap": 1139814528
    },
    "ILDC.TA": {
        "short_name": "ISRAEL LAND DEVEL",
        "long_name": "The Israel Land Development Company Ltd.",
        "summary": "The Israel Land Development Company Ltd., together with its subsidiaries, primarily engages in the real estate business in Israel, Poland, and internationally. The company operates through three segments: Property Rental; Residential Construction Development in Israel; and Residential Construction Development Overseas. It develops, leases, and manages commercial properties and office buildings in Israel; and logistics parks primarily in Poland. The company also develops, constructs, executes, and sells residential construction projects in Israel, Poland, and Romania. In addition, it engages in the development of urban renewal projects; and outdoor advertising businesses. The company was formerly known as Palestine Land Development Company. The Israel Land Development Company Ltd. was founded in 1909 and is based in Bnei Brak, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Bnei Brak",
        "zipcode": "5120261",
        "website": "http://www.ildc.co.il",
        "market_cap": 1332624768
    },
    "KARE.TA": {
        "short_name": "KARDAN REAL ESTATE",
        "long_name": "Kardan Real Estate Enterprise and Development Ltd.",
        "summary": "Kardan Real Estate Enterprise and Development Ltd. develops, builds, manages, and maintains residential projects and income-producing properties in Israel. The company also engages in the engineering planning, development, construction, delivery, and service of residential units, as well as undertakes urban renewal projects. The company was founded in 1988 and is based in Tel Aviv, Israel. Kardan Real Estate Enterprise and Development Ltd. is a subsidiary of Kardan Israel Ltd.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "6492107",
        "website": "http://www.kardan-nadlan.co.il",
        "market_cap": 776377088
    },
    "KRDI.TA": {
        "short_name": "KARDAN ISRAEL LTD",
        "long_name": "Kardan Israel Ltd",
        "summary": "Kardan Israel Ltd., through its subsidiaries, engages in the real estate business in Israel and the United States. It locates, initiates, and develops residential buildings in Israel for sale; demolishes and rebuilds properties for urban renewal; develops, sells, and rents office buildings and commercial areas; and invests in real estate properties. The company also provides contractor services for building residential, commercial, and public properties. In addition, it is involved in the production and broadcast of TV programs for toddlers; and production of video content, audio, apps, and articles on various platforms. The company was incorporated in 1982 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "6492107",
        "website": null,
        "market_cap": 596502720
    },
    "LBTL.TA": {
        "short_name": "A LIBENTAL HOLDING",
        "long_name": "A. Libental Holdings Ltd.",
        "summary": "A. Libental Holdings Ltd. develops, constructs, markets, and sells real estate properties in Israel. It develops residential, office, and industrial buildings; educational institutions; and residential neighborhoods. The company was formerly known as Lumir Holdings Ltd. and changed its name to A. Libental Holdings Ltd. in November 2007. A. Libental Holdings Ltd. was founded in 1956 and is based in Ramat Gan, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Ramat Gan",
        "zipcode": "5252141",
        "website": "http://www.lbt.co.il",
        "market_cap": 163885040
    },
    "LODZ.TA": {
        "short_name": "LODZIA ROTEX INVES",
        "long_name": "Lodzia Rotex Investment Ltd.",
        "summary": "Lodzia Rotex Investment Ltd. develops, leases, and manages real estate properties in Israel and internationally. It serves individuals, as well as small and large businesses. The company was formerly known as Lodzia Rotex Textile Company Ltd. and changed its name to Lodzia Rotex Investment Ltd. in 1996. Lodzia Rotex Investment Ltd. was founded in 1924 and is based in Tel Aviv-Yafo, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "68012",
        "website": null,
        "market_cap": 107862640
    },
    "LVPR.TA": {
        "short_name": "LEVINSTEIN PROPERT",
        "long_name": "Levinstein Properties Ltd",
        "summary": "Levinstein Properties Ltd initiates, builds, markets, and rents real estate properties in Israel. Its properties include towers for offices, buildings, and shopping centers. The company was incorporated in 1986 is based in Tel Aviv, Israel. Levinstein Properties Ltd is a subsidiary of Meshulam Levinstein Contracting & Engineering Ltd.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": null,
        "website": "http://www.levinstein.co.il",
        "market_cap": 1185268096
    },
    "MDTR.TA": {
        "short_name": "MEDITERRANEAN TOWE",
        "long_name": "Mediterranean Towers Ltd.",
        "summary": "Mediterranean Towers Ltd. operates a chain of retirement communities in Israel. The company was founded in 1982 and is headquartered in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Ganei Tikva",
        "zipcode": "5591229",
        "website": "http://www.migdalei.co.il",
        "market_cap": 1467126912
    },
    "MLSR.TA": {
        "short_name": "MELISRON",
        "long_name": "Melisron Ltd.",
        "summary": "Melisron Ltd. operates as a real estate company in Israel. The company enhances, manages, maintains, and rents commercial and office spaces. It also owns and operates shopping malls and commercial centers, and real estate complexes for offices and high-tech industries. Melisron Ltd. was founded in 1987 and is based in Herzliya, Israel. Melisron Ltd. is a subsidiary of Ofer Investments Group.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Herzliya",
        "zipcode": null,
        "website": "http://www.melisron.co.il",
        "market_cap": 10857040896
    },
    "MSHR.TA": {
        "short_name": "MISHOR REAL ESTATE",
        "long_name": "Mishorim Real Estate Investments Ltd",
        "summary": "Mishorim Real Estate Investments Ltd engages in the investment, development, rental, and sale of real estate assets, hotels, and resorts in Canada, Israel, and the United States. Its portfolio also covers commercial and office buildings, and shopping centers. Mishorim Real Estate Investments Ltd was founded in 1990 and is based in Bnei Brak, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Bnei Brak",
        "zipcode": null,
        "website": "http://www.mishorim.com",
        "market_cap": 267016768
    },
    "MVNE.TA": {
        "short_name": "MIVNE REAL ESTATE",
        "long_name": "Mivne Real Estate (K.D) Ltd",
        "summary": "Industrial Buildings Corporation Ltd. engages in the initiation, acquisition, construction, and management of buildings in Israel and internationally. Its property portfolio includes shopping complexes, residences, offices, and hi-tech, as well as industry and logistics. The company was founded in 1961 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "6109002",
        "website": "http://www.mivnegroup.co.il",
        "market_cap": 7537699840
    },
    "NSTR.TA": {
        "short_name": "NORSTAR HLDGS INC",
        "long_name": "Norstar Holdings Inc.",
        "summary": "Norstar Holdings Inc., through its subsidiaries, acquires, develops, rents, and manages real estate properties in the North America, Israel, Brazil, northern Europe, and Central and Eastern Europe. It develops and trades in office and residential buildings. The company was formerly known as Gazit Inc. and changed its name to Norstar Holdings Inc. in May 2011. Norstar Holdings Inc. was founded in 1962 and is based in Ramat Gan, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Ramat Gan",
        "zipcode": "52506",
        "website": null,
        "market_cap": 829705664
    },
    "NTGR.TA": {
        "short_name": "NETANEL GROUP",
        "long_name": "Netanel Group Ltd",
        "summary": "Netanel Group Ltd operates in the construction industry in Israel. It develops, builds, markets, and sells residential projects, as well as invests in real estate. The company was formerly known as Danel Group (1991) Ltd. and changed its name to Netanel Group Ltd in November 2002. Netanel Group Ltd was founded in 1970 and is headquartered in Holon, Israel. Netanel Group Ltd is a subsidiary of Rishan Building & Investments Ltd.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Holon",
        "zipcode": null,
        "website": "http://www.netanel.co.il",
        "market_cap": 344270464
    },
    "OBAS": {
        "short_name": "Optibase Ltd.",
        "long_name": "Optibase Ltd.",
        "summary": "Optibase Ltd., together with its subsidiaries, operates in the fixed-income real estate sector in Luxemburg, Switzerland, Germany, and the United States. It purchases and operates real estate properties intended for leasing and resale primarily for the purpose of commercial, industrial, office space, parking garage, and warehouse use, as well as for residential purposes. The company was formerly known as Optibase Advanced Systems (1990) Ltd. and changed its name to Optibase Ltd. in November 1993. The company was founded in 1990 and is headquartered in Herzliya, Israel. Optibase Ltd. is a subsidiary of The Capri Family Foundation.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Herzliya",
        "zipcode": "4672559",
        "website": "http://www.optibase-holdings.com",
        "market_cap": 64415924
    },
    "OBAS.TA": {
        "short_name": "OPTIBASE LTD",
        "long_name": "Optibase Ltd.",
        "summary": "Optibase Ltd., together with its subsidiaries, operates in the fixed-income real estate sector in Luxemburg, Switzerland, Germany, and the United States. It purchases and operates real estate properties intended for leasing and resale primarily for the purpose of commercial, industrial, office space, parking garage, and warehouse use, as well as for residential purposes. The company was formerly known as Optibase Advanced Systems (1990) Ltd. and changed its name to Optibase Ltd. in November 1993. The company was founded in 1990 and is headquartered in Herzliya, Israel. Optibase Ltd. is a subsidiary of The Capri Family Foundation.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Herzliya",
        "zipcode": "4672559",
        "website": "http://www.optibase-holdings.com",
        "market_cap": 191193472
    },
    "OP4.F": {
        "short_name": "OPTIBASE LTD  IS 1",
        "long_name": "Optibase Ltd.",
        "summary": "Optibase Ltd., together with its subsidiaries, operates in the fixed-income real estate sector in Luxemburg, Switzerland, Germany, and the United States. It purchases and operates real estate properties intended for leasing and resale primarily for the purpose of commercial, industrial, office space, parking garage, and warehouse use, as well as for residential purposes. The company was formerly known as Optibase Advanced Systems (1990) Ltd. and changed its name to Optibase Ltd. in November 1993. The company was founded in 1990 and is headquartered in Herzliya, Israel. Optibase Ltd. is a subsidiary of The Capri Family Foundation.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "state": null,
        "city": "Herzliya",
        "zipcode": "4672559",
        "website": "http://www.optibase-holdings.com",
        "market_cap": 48177624
    },
    "RAVD.TA": {
        "short_name": "RAVAD LTD",
        "long_name": "Ravad Ltd",
        "summary": "Ravad Limited engages in the rental of commercial properties in Germany, Switzerland, and the United Kingdom. It primarily owns and rents various office buildings, as well as involves in agents management business. The company is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "64739",
        "website": null,
        "market_cap": 203391536
    },
    "SMT.TA": {
        "short_name": "SUMMIT R/EST HLDGS",
        "long_name": "Summit Real Estate Holdings Ltd.",
        "summary": "Summit Real Estate Holdings Ltd. is a real estate investment firm specializing in the purchase and operation of office buildings and commercial assets, which are leased to numerous commercial and industrial tenants. Summit Real Estate Holdings Ltd. was founded in 1965 and is headquartered in Haifa, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Haifa",
        "zipcode": null,
        "website": "http://www.smt.co.il",
        "market_cap": 3526294272
    },
    "UNCR.TA": {
        "short_name": "UNET CREDIT FIN",
        "long_name": "Unet Credit Finance Services Ltd",
        "summary": "Unet Credit Finance Services Ltd offers various insurance products and services to families and businesses in Israel. It provides life insurance, loss of work ability insurance, health insurance, long-term care insurance, overseas travel insurance, etc.; motor, home, business and liability, officeholders', and professional liability insurance; and property and property risk insurance. The company also offers non-bank financing; and manages investment portfolios and mutual funds for private customers and companies. In addition, it provides pension consulting, fund transfer, and financial advisory services. The company was formerly known as Speech Modules Holdings Ltd. Unet Credit Finance Services Ltd is headquartered in Holon, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Holon",
        "zipcode": null,
        "website": "http://www.unet.co.il",
        "market_cap": 171780432
    },
    "VILR.TA": {
        "short_name": "VILLAR INTL LTD",
        "long_name": "Villar International Ltd.",
        "summary": "Villar International Ltd. engages in the acquiring and building of industrial and residential real estate properties in Israel and internationally. The company finds and purchases land for industrial buildings and safe housings; and leases offices. It also builds residential projects, including apartment complexes and residential communities; and industrial and office buildings, shopping centers, and logistic centers. In addition, the company provides various construction and advisory services; and archive and storage services for storing various types of media, including papers, magnetic media, and X-rays to banks, health systems, law firms, and government offices. Further, it offers engineering solutions, such as formworks for casting walls, callings, columns, and various auxiliary systems; and static concrete pumps. The company serves high-tech, industrial, and logistics companies, as well as commercial stores, government offices, and public bodies. Villar International Ltd. was founded in 1975 and is based in Caesarea, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Caesarea",
        "zipcode": "3088900",
        "website": "http://www.villar.co.il",
        "market_cap": 2989512960
    }
}