{
  "AED.MI": {
    "city": "Milan",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "REIT - Diversified",
    "long_name": "Aedes SIIQ S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Real Estate",
    "short_name": "AEDES",
    "state": "MI",
    "summary": "Aedes SIIQ (MTA:AED) was founded and at the same time listed on the Electronic Stock Market of Borsa Italiana, following the proportional partial division of Restart (a company founded in 1905 and listed on the Milan Stock Exchange since 1924) on December 28, 2018. Aedes SIIQ has an income and development real estate portfolio to be developed to be put into income in line with the strategy of an SIIQ with destination Commercial (Retail and Office).",
    "website": "http://www.aedes-siiq.com",
    "zipcode": "20144"
  },
  "IGD.MI": {
    "city": "Bologna",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "REIT - Diversified",
    "long_name": "Immobiliare Grande Distribuzione SIIQ S.p.A.",
    "market": "it_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "IGD",
    "state": "BO",
    "summary": "Immobiliare Grande Distribuzione SIIQ S.p.A. is one of the main players in Italy's retail real estate market: it develops and manages shopping centers throughout the country and has a significant presence in Romanian retail distribution. Listed on the Star Segment of the Italian Stock Exchange, IGD was the first SIIQ (Società di Investimento Immobiliare Quotata or real estate investment trust) in Italy. IGD has a real estate portfolio valued at circa 2,322.62 million at 30 June 2020, comprised of, in Italy, 25 hypermarkets and supermarkets, 27 shopping malls and retail parks, 1 plot of land for development, 1 property held for trading and 5 other real estate properties. Following the acquisition of the company Winmark Magazine SA in 2008 14 shopping centers and an office building, found in 13 different Romanian cities, were added to the portfolio. An extensive domestic presence, a solid financial structure, the ability to plan, monitor and manage all phases of a center's life cycle, leadership in the retail real estate sector: these qualities summarize IGD's strong points.",
    "website": "http://www.gruppoigd.it",
    "zipcode": "40127"
  },
  "RST.MI": {
    "city": "Milan",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "REIT - Diversified",
    "long_name": "Restart SIIQ S.p.A.",
    "market": "it_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "RESTART",
    "state": "MI",
    "summary": "Restart SIIQ S.p.A., a real estate investments company, focuses on enhancing real estate assets value underlying special situations, non-performing loans, or unlikely to pay. It also focuses on the provision of specialized real estate services. The company was formerly known as Aedes SIIQ S.p.A. and changed its name to Restart SIIQ S.p.A. in December 2018. Restart SIIQ S.p.A. was founded in 1905 and is based in Milan, Italy. Restart SIIQ S.p.A. is a subsidiary of Augusto S.p.A.",
    "website": "http://www.restart-group.com",
    "zipcode": "20144"
  }
}
