{"CYNK": {"short_name": "CYNK TECHNOLOGY CORPORATION", "long_name": "Cynk Technology Corp.", "summary": "Cynk Technology Corp., a development stage company, focuses on operating a social network. Its social network is based on showing the types of people the user is connected with and associated. The company intends to serve seekers, who want to meet people; mavens, who know a lot of people; and targets, who are people that other people want to meet. The company was formerly known as Introbuzz, Inc. and changed its name to Cynk Technology Corp. in July 2013. Cynk Technology Corp. was founded in 2008 and is based in Belize City, Belize.", "currency": "USD", "sector": "Conglomerates", "industry": "Conglomerates", "exchange": "PNK", "market": "us_market", "country": "Belize", "city": "Belize City"}, "GTSO": {"short_name": "GREEN TECHNOLOGY SOLUTIONS INC", "long_name": "Green Technology Solutions, Inc.", "summary": "Green Technology Solutions, Inc. focuses on providing business support services to the horticultural and medical cannabis markets. It intends to provide payment processing, security, and transport support services; hemp delivery systems; and specialty organic soils and fertilizers, lighting systems, and methods to produce other cannabinoid products. The company was formerly known as Sunrise Energy Resources, Inc. and changed its name to Green Technology Solutions, Inc. in October 2010. Green Technology Solutions, Inc. was incorporated in 1991 and is based in San Jose, California.", "currency": "USD", "sector": "Conglomerates", "industry": "Conglomerates", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "San Jose"}, "MEVA.AT": {"short_name": "MEVACO S.A. (CR)", "long_name": "Mevaco S.A.", "summary": "Mevaco S.A. engages in the metal fabrication and construction works in Greece. It offers sheet metalwork fabrications services, such as cutting and laser cutting, punching, forming, bending, roll forming, welding, painting, and screen printing services for household electric appliances, beverage coolers, central heating boilers, indoor and outdoor advertising, promotion racks and stands, vehicles, electric and electronic boards, telecommunication boards, banking services, etc. The company also provides welded metallic constructions, such as lattice for tunneling, tunneling supports, solar trackers for PV installations, bridges, railings, metallic hangers, and custom structures built to print. In addition, it offers metal welded structures for defense applications; electronic board construction sections; and composite electrochemical constructions, including PV installation shelter houses, toll booths, sound attenuators for industrial applications, metallic equipment for shop chain, railway equipment, electrical and electronic equipment, and indoor and outdoor building claddings, as well as automatic selling machines for gas stations, ticket issuing centers, etc. Mevaco S.A. was founded in 1993 and is based in Aspropyrgos, Greece.", "currency": "EUR", "sector": "Conglomerates", "industry": "Conglomerates", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Aspropyrgos"}, "MLHOP.PA": {"short_name": "PART.INDLES MINI.", "long_name": "Participation Industrielle Miniere Société Anonyme", "summary": "None", "currency": "EUR", "sector": "Conglomerates", "industry": "Conglomerates", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Paris"}, "PGEC": {"short_name": "PRESTIGE CAPITAL CORP", "long_name": "Prestige Capital Corporation", "summary": "Prestige Capital Corporation does not have significant operations. It intends to seek, investigate, and if warranted, acquire an interest in a business opportunity. The company was founded in 1986 and is based in Salt Lake City, Utah.", "currency": "USD", "sector": "Conglomerates", "industry": "Conglomerates", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Salt Lake City"}, "PRLX": {"short_name": "PARALLAX HEALTH SCIENCES INC", "long_name": "Parallax Health Sciences, Inc.", "summary": "Parallax Health Sciences, Inc. builds and expands an integrated digital healthcare network with products and services that provide remote communication, diagnosis, treatment, and monitoring of patients. The company offers remote healthcare products, including patent pending software and mobile apps, and other services, as well as electronic kits and devices from third-party licensed platforms that are designated towards a patient's primary health concern, such as diabetes, blood pressure, cardiovascular, general monitoring, etc.; and audio and video options that interface with the patient's healthcare providers. It also provides prescription medication dosage monitoring services; and behavioral health products comprising REBOOT, a proprietary behavioral health technology for an individual or an organization to transform the cost of treating and managing chronic illnesses that include pulmonary-COPD-asthma, diabetes, and cardiovascular diseases by effecting the modification of behavior in patients being treated for these chronic diseases. In addition, the company offers diagnostics products, which comprise Target System, a proprietary POC diagnostic immunoassay testing platform; and test cartridges for the areas of infectious diseases, cardiac markers, drugs of abuse, and various other medical conditions, as well as VT-1000 desktop analyzers, target antigen detection systems, and other products. Further, it provides SPARKS Mobile, a target system hand-held analyzer; COMPASS for behavioral modification; Fotodigm platform for remote patient monitoring, telehealth, and POC diagnostic testing services; and Intrinsic Code technology for actionable insights to behavior modification. The company was formerly known as Endeavor Power Corporation and changed its name to Parallax Health Sciences, Inc. in January 2014. Parallax Health Sciences, Inc. was founded in 2005 and is headquartered in Santa Monica, California.", "currency": "USD", "sector": "Conglomerates", "industry": "Conglomerates", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Santa Monica"}, "PTPF": {"short_name": "ALL MARKETING SOLUTIONS INC", "long_name": "All Marketing Solutions, Inc.", "summary": "All Marketing Solutions, Inc. provides patent consulting and technology transfer services. It focuses on assisting small business and entrepreneurs that have developed patentable novel products or services but does not have the financial resources to fund their own patent application. The company was formerly known as Patents Professional, Inc. All Marketing Solutions, Inc. was founded in 2008 and is based in Carson City, Nevada.", "currency": "USD", "sector": "Conglomerates", "industry": "Conglomerates", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Carson City"}}