{"BASA": {"short_name": "BASANITE INC", "long_name": "Basanite Inc.", "summary": "Basanite Inc. engages in the basalt fiber reinforced polymer business worldwide. It produces basalt fiber reinforced polymer products that are used as replacements for steel products, which reinforce concrete, such as rebar. The company was formerly known as PayMeOn, Inc. and changed its name to Basanite, Inc. in December 2018. Basanite Inc. was founded in 2006 and is headquartered in Oakland Park, Florida.", "currency": "USD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Oakland Park"}, "BSND": {"short_name": "BOSTON SAND & GRAVEL CO", "long_name": "Boston Sand & Gravel Co.", "summary": "Boston Sand & Gravel Co. provides ready mixed concrete and aggregate products to the construction and landscaping industries in southeastern New England. The company offers ready mix concrete that include specialty mixes for winter concrete, slurry walls, and drilled shafts, as well as sand and aggregate, concrete blocks, and green products. Its products are used in projects ranging from small residential pours to mass pours for commercial and infrastructure projects; and construction projects, including central artery/tunnel project, waste water treatment plants, nuclear power plants, high rise-buildings, and slurry wall construction projects. The company serves customers through sales representatives. Boston Sand & Gravel Co. was founded in 1914 and is based in Boston, Massachusetts.", "currency": "USD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Boston"}, "EXP": {"short_name": "Eagle Materials Inc", "long_name": "Eagle Materials Inc.", "summary": "Eagle Materials Inc., through its subsidiaries, produces and supplies heavy construction materials, light building materials, and materials used for oil and natural gas extraction in the United States. It operates in five segments: Cement, Concrete and Aggregates, Gypsum Wallboard, Recycled Paperboard, and Oil and Gas Proppants. The company engages in the mining of limestone for the manufacture, production, distribution, and sale of Portland cement; grinding and sale of slag; and mining of gypsum for the manufacture and sale of gypsum wallboards used to finish the interior walls and ceilings in residential, commercial, and industrial structures. It is also involved in the manufacture and sale of recycled paperboard for the gypsum wallboard industry and other paperboard converters, as well as provision of containerboard grade and lightweight packaging grade products. In addition, the company engages in the sale of ready-mix concrete; mining, extracting, production, and sale of aggregates, including crushed stones, sand, and gravel; and mining and sale of sand used in hydraulic fracturing, such as frac sand. Its products are used in commercial and residential construction; public construction projects; projects to build, expand, and repair roads and highways; and oil and natural gas extraction. The company was formerly known as Centex Construction Products, Inc. and changed its name to Eagle Materials, Inc. in January 2004. Eagle Materials Inc. was founded in 1963 and is headquartered in Dallas, Texas.", "currency": "USD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Dallas"}, "M1LM34.SA": {"short_name": "MARTIN MARIEDRN", "long_name": "Martin Marietta Materials, Inc.", "summary": "Martin Marietta Materials, Inc., a natural resource-based building materials company, supplies aggregates and heavy building materials to the construction industry in the United States and internationally. It offers crushed stone, sand, and gravel products; ready mixed concrete and asphalt; paving products and services; Portland and specialty cement used in the infrastructure projects, and nonresidential and residential construction markets, as well as in the railroad, agricultural, utility, and environmental industries. The company also manufactures and markets magnesia-based chemical products for the industrial, agricultural, and environmental applications; and dolomitic lime primarily for customers in the steel and mining industries, as well as provides road paving construction services. Its chemical products are used in flame retardants, wastewater treatment, pulp and paper production, and other environmental applications. The company was founded in 1993 and is headquartered in Raleigh, North Carolina.", "currency": "BRL", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "SAO", "market": "br_market", "country": "United States", "city": "Raleigh"}, "MCEM": {"short_name": "MONARCH CEMENT COMPANY", "long_name": "The Monarch Cement Company", "summary": "The Monarch Cement Company manufactures and sells cement products. It principally offers Portland cement and masonry cement. The company also provides ready-mixed concrete, concrete products, and sundry building materials. It primarily serves contractors, ready-mixed concrete plants, concrete products plants, building materials dealers, and governmental agencies. The company sells its products principally in the State of Kansas, the State of Iowa, southeast Nebraska, western Missouri, northwest Arkansas, and northern Oklahoma. The Monarch Cement Company was founded in 1908 and is based in Humboldt, Kansas.", "currency": "USD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Humboldt"}, "MDU": {"short_name": "MDU Resources Group, Inc.", "long_name": "MDU Resources Group, Inc.", "summary": "MDU Resources Group, Inc. engages in regulated energy delivery, and construction materials and services businesses in the United States. The company's Electric segment generates, transmits, and distributes electricity for residential, commercial, industrial, and municipal customers in Montana, North Dakota, South Dakota, and Wyoming. Its Natural Gas Distribution segment distributes natural gas for residential, commercial, and industrial customers in Idaho, Minnesota, Montana, North Dakota, Oregon, South Dakota, Washington, and Wyoming; and offers supply related value-added services. The company's Pipeline segment provides natural gas transportation, underground storage, and gathering services through regulated and nonregulated pipeline systems primarily in the Rocky Mountain and northern Great Plains regions; and cathodic protection and other energy-related services. Its Construction Materials and Contracting segment mines, processes, and sells construction aggregates; produces and sells asphalt mix; and supplies ready-mixed concrete. This segment is also involved in the sale of cement, liquid asphalt, finished concrete products, and other building materials and related contracting services. The company's Construction Services segment designs, constructs, and maintains electrical and communication wiring and infrastructure, fire suppression systems, and mechanical piping and services; and overhead and underground electrical distribution and transmission lines, substations, external lighting, traffic signalization, and gas pipelines, as well as engages in the utility excavation activities. This segment also manufactures and distributes transmission line construction equipment; and constructs and maintains renewable energy projects. It serves manufacturing, commercial, industrial, institutional, and government customers, as well as utilities. The company was founded in 1924 and is headquartered in Bismarck, North Dakota.", "currency": "USD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Bismarck"}, "MLM": {"short_name": "Martin Marietta Materials, Inc.", "long_name": "Martin Marietta Materials, Inc.", "summary": "Martin Marietta Materials, Inc., a natural resource-based building materials company, supplies aggregates and heavy building materials to the construction industry in the United States and internationally. It offers crushed stone, sand, and gravel products; ready mixed concrete and asphalt; paving products and services; Portland and specialty cement used in the infrastructure projects, and nonresidential and residential construction markets, as well as in the railroad, agricultural, utility, and environmental industries. The company also manufactures and markets magnesia-based chemical products for the industrial, agricultural, and environmental applications; and dolomitic lime primarily for customers in the steel and mining industries, as well as provides road paving construction services. Its chemical products are used in flame retardants, wastewater treatment, pulp and paper production, and other environmental applications. The company was founded in 1993 and is headquartered in Raleigh, North Carolina.", "currency": "USD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Raleigh"}, "MLM.MX": {"short_name": "MARTIN MARIETTA MATERIALS INC", "long_name": "Martin Marietta Materials, Inc.", "summary": "Martin Marietta Materials, Inc., a natural resource-based building materials company, supplies aggregates and heavy building materials to the construction industry in the United States and internationally. It offers crushed stone, sand, and gravel products; ready mixed concrete and asphalt; paving products and services; Portland and specialty cement used in the infrastructure projects, and nonresidential and residential construction markets, as well as in the railroad, agricultural, utility, and environmental industries. The company also manufactures and markets magnesia-based chemical products for the industrial, agricultural, and environmental applications; and dolomitic lime primarily for customers in the steel and mining industries, as well as provides road paving construction services. Its chemical products are used in flame retardants, wastewater treatment, pulp and paper production, and other environmental applications. The company was founded in 1993 and is headquartered in Raleigh, North Carolina.", "currency": "MXN", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Raleigh"}, "MMX.F": {"short_name": "MARTIN MAR. MAT.  DL-,01", "long_name": "Martin Marietta Materials, Inc.", "summary": "Martin Marietta Materials, Inc., a natural resource-based building materials company, supplies aggregates and heavy building materials to the construction industry in the United States and internationally. It offers crushed stone, sand, and gravel products; ready mixed concrete and asphalt; paving products and services; Portland and specialty cement used in the infrastructure projects, and nonresidential and residential construction markets, as well as in the railroad, agricultural, utility, and environmental industries. The company also manufactures and markets magnesia-based chemical products for the industrial, agricultural, and environmental applications; and dolomitic lime primarily for customers in the steel and mining industries, as well as provides road paving construction services. Its chemical products are used in flame retardants, wastewater treatment, pulp and paper production, and other environmental applications. The company was founded in 1993 and is headquartered in Raleigh, North Carolina.", "currency": "EUR", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Raleigh"}, "MRE.F": {"short_name": "MDU RESOURCES GRP  DL 1", "long_name": "MDU Resources Group, Inc.", "summary": "MDU Resources Group, Inc. engages in regulated energy delivery, and construction materials and services businesses in the United States. The company's Electric segment generates, transmits, and distributes electricity for residential, commercial, industrial, and municipal customers in Montana, North Dakota, South Dakota, and Wyoming. Its Natural Gas Distribution segment distributes natural gas for residential, commercial, and industrial customers in Idaho, Minnesota, Montana, North Dakota, Oregon, South Dakota, Washington, and Wyoming; and offers supply related value-added services. The company's Pipeline segment provides natural gas transportation, underground storage, and gathering services through regulated and nonregulated pipeline systems primarily in the Rocky Mountain and northern Great Plains regions; and cathodic protection and other energy-related services. Its Construction Materials and Contracting segment mines, processes, and sells construction aggregates; produces and sells asphalt mix; and supplies ready-mixed concrete. This segment is also involved in the sale of cement, liquid asphalt, finished concrete products, and other building materials and related contracting services. The company's Construction Services segment designs, constructs, and maintains electrical and communication wiring and infrastructure, fire suppression systems, and mechanical piping and services; and overhead and underground electrical distribution and transmission lines, substations, external lighting, traffic signalization, and gas pipelines, as well as engages in the utility excavation activities. This segment also manufactures and distributes transmission line construction equipment; and constructs and maintains renewable energy projects. It serves manufacturing, commercial, industrial, institutional, and government customers, as well as utilities. The company was founded in 1924 and is headquartered in Bismarck, North Dakota.", "currency": "EUR", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Bismarck"}, "NYLE": {"short_name": "NYLE INTERNATIONAL CORP", "long_name": "Nyle International Corp.", "summary": "Nyle International Corporation manufactures and sells heat pumps and heaters. The company is based in Brewer, Maine.", "currency": "USD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Brewer"}, "SMID": {"short_name": "Smith-Midland Corporation", "long_name": "Smith-Midland Corporation", "summary": "Smith-Midland Corporation, through its subsidiaries, invents, develops, manufactures, markets, leases, licenses, sells, and installs precast concrete products primarily for use in the construction, highway, utilities, and farming industries. It offers SlenderWall, a lightweight construction panels for the exterior walls of building; Sierra Wall that provides sound and sight barrier for use alongside highways around residential, industrial, and commercial properties; J-J Hooks highway safety barriers for use on roadways to separate lanes of traffic in construction work zone or traffic control purposes; and Easi-Set precast building and Easi-Span expandable precast buildings for use in housing communications operations, traffic control systems, and mechanical and electrical stations. The company also provides Easi-Set utility vaults for house equipment, such as cable, telephone, or traffic signal equipment, and for underground storage, as well as custom-built utility vaults for special needs; SoftSound soundwall panels to absorb highway noise; Beach Prisms, an erosion control modules for seawalls and jetties; and H2Out secondary drainage systems for panelized exterior cladding. In addition, it offers licenses its proprietary products and non-proprietary products in the United States, Canada, Belgium, New Zealand, Australia, Mexico, Trinidad, Spain, and Chile. It markets its products through in-house sales force, independent sales representatives, and direct mail to contractors performing public and private construction contracts, such as the public and private roads and highways, and airports; municipal utilities; and federal, state, and local transportation authorities. Smith-Midland Corporation was founded in 1960 and is based in Midland, Virginia.", "currency": "USD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Midland"}, "SNLP": {"short_name": "SYNTROL CORPORATION", "long_name": "Syntrol Corp.", "summary": "Syntrol Corp., through its subsidiary, Crypto Partners Inc., operates as a solar generating crypto-currency mining company. It is developing a monetization platform that allows it to drive margin expansion by reducing costs, and shifting to crypto-currencies and services. It operates two crypto-currency mining farms. The company is based in Roseville, California.", "currency": "USD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Roseville"}, "SNTE": {"short_name": "SANTE TECHNOLOGY HOLDINGS INC", "long_name": "Sante Technology Holdings Inc.", "summary": "Sante Technology Holdings Inc. produces, sells, and distributes building materials in the United States and internationally. It offers insulated concrete for structural wall systems, insulated panel building systems, roofing materials, pre-fabricated interlocking steel trusses, and standing seam roof panel systems. The company was formerly known as PEI Worldwide Holdings, Inc. and changed its name to Sante Technology Holdings Inc. in May 2020. Sante Technology Holdings Inc. was founded in 1999 and is based in Plano, Texas.", "currency": "USD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Plano"}, "SUM": {"short_name": "Summit Materials, Inc.", "long_name": "Summit Materials, Inc.", "summary": "Summit Materials, Inc., through its subsidiaries, produces and sells construction materials and related downstream products for the public infrastructure, residential and nonresidential, and other markets. It operates through three segments: West, East, and Cement. The company's products include aggregates, cement, ready-mix concrete, asphalt paving mixes, and concrete products, as well as plastics components. It also provides paving and related services primarily comprising asphalt paving services to the private and public infrastructure sectors. In addition, the company operates municipal waste, construction, and demolition debris landfills; and liquid asphalt terminal. It has operations in the United States; and British Columbia, Canada. The company was founded in 2009 and is headquartered in Denver, Colorado.", "currency": "USD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Denver"}, "USCR": {"short_name": "U S Concrete, Inc.", "long_name": "U.S. Concrete, Inc.", "summary": "U.S. Concrete, Inc., through its subsidiaries, produces and sells ready-mixed concrete, aggregates, and concrete-related products and services to the construction industry in the United States, the U.S. Virgin Islands, and Canada. It operates through two segments, Ready-Mixed Concrete and Aggregate Products. The Ready-Mixed Concrete segment engages in the formulation, production, and delivery of ready-mixed concrete to customers' job sites; and the provision of various services that include the formulation of mixtures for specific design uses, on-site and lab-based product quality control, and customized delivery programs. The Aggregate Products segment offers crushed stone, sand, and gravel for use in commercial, industrial, and public works projects. The company's other products include building materials stores, hauling operations, aggregates distribution terminals, a recycled aggregates operation and concrete blocks, as well as products, including ARIDUS Rapid Drying Concrete technology and the Where's My Concrete family of Web and mobile applications. It primarily serves concrete general contractors, governmental agencies, and developers, architects, engineers, and home builders. The company was founded in 1997 and is based in Euless, Texas.", "currency": "USD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Euless"}, "USLM": {"short_name": "United States Lime & Minerals, ", "long_name": "United States Lime & Minerals, Inc.", "summary": "United States Lime & Minerals, Inc. manufactures and supplies lime and limestone products in the United States. It operates through two segments, Lime and Limestone Operations, and Natural Gas Interests. The Lime and Limestone Operations segment extracts limestone from open-pit quarries and an underground mine, and processes it as pulverized limestone, quicklime, hydrated lime, and lime slurry. This segment supplies its products primarily to the construction customers, including highway, road, and building contractors; industrial customers, such as paper and glass manufacturers; environmental customers comprising municipal sanitation and water treatment facilities, and flue gas treatment processes; steel producers; oil and gas services companies; roof shingle manufacturers; and poultry and cattle feed producers. The Natural Gas Interests segment has various royalty interests and non-operating working interests with respect to oil and gas rights on approximately 3,800 acres of land located in Johnson County, Texas in the Barnett Shale Formation. The company was founded in 1948 and is headquartered in Dallas, Texas.", "currency": "USD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Dallas"}, "VMC": {"short_name": "Vulcan Materials Company (Holdi", "long_name": "Vulcan Materials Company", "summary": "Vulcan Materials Company produces and supplies construction materials primarily in the United States. The company operates through four segments: Aggregates, Asphalt, Concrete, and Calcium. The Aggregates segment provides crushed stones, sand and gravel, sand, and other aggregates; and related products and services that are applied in construction and maintenance of highways, streets, and other public works, as well as in the construction of housing and commercial, industrial, and other nonresidential facilities. The Asphalt Mix segment offers asphalt mix in Alabama, Arizona, California, New Mexico, Tennessee, and Texas. The Concrete segment provides ready-mixed concrete in California, Maryland, New Mexico, Texas, Virginia, Washington D.C., and the Bahamas. The Calcium segment mines, produces, and sells calcium products for the animal feed, plastics, and water treatment industries. The company was formerly known as Virginia Holdco, Inc. and changed its name to Vulcan Materials Company. Vulcan Materials Company was founded in 1909 and is headquartered in Birmingham, Alabama.", "currency": "USD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Birmingham"}, "YECO": {"short_name": "YULONG ECO-MATERIALS LIMITED", "long_name": "EV Biologics, Inc.", "summary": "EV Biologics, Inc., a biotechnology company, engages in the commercial development of extracellular vesicles (EVs) as biological modalities for diagnostics and therapeutics. It is involved in developing vaccines, therapeutics, and cures based on its proprietary multifunctional EV platform. The company also focuses on developing human mesenchymal and other stem cell, and cell-derived products to market in the cosmetic and biopharmaceutical spaces. The company was formerly known as Yulong Eco-Materials Limited and changed its name to EV Biologics, Inc. in August 2020. EV Biologics, Inc. was incorporated in 2011 and is headquartered in New York, New York.", "currency": "USD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "New York"}}