{"AABB": {"short_name": "ASIA BROADBAND INC", "long_name": "Asia Broadband, Inc.", "summary": "Asia Broadband, Inc. operates as a digital education media and technology services company. It offers classroom based education services; and content services on Internet broadband network in the People's Republic of China. The company was formerly known as Gemini Marketing, Inc. Asia Broadband, Inc. was incorporated in 1996 and is based in Las Vegas, Nevada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Las Vegas"}, "ABML": {"short_name": "AMERICAN BATTERY METALS CORP NE", "long_name": "American Battery Metals Corporation", "summary": "American Battery Metals Corporation engages in the exploration, mining, extraction, and recycling of battery metals. It owns 647 placer mining claims on approximately 12,940 acres in the Western Nevada Basin, situated in Railroad Valley in Nye County, Nevada; and a 120-acre parcel of private property with water rights, in the town of Currant, NV near Railroad Valley. The company was formerly known as Oroplata Resources, Inc. and changed its name to American Battery Metals Corporation in May 2019. American Battery Metals Corporation was founded in 2011 and is based in Incline Village, Nevada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Incline Village"}, "ACNE": {"short_name": "ALICE CONS MINES INC", "long_name": "Alice Consolidated Mines, Inc.", "summary": "Alice Consolidated Mines, Inc. operates as a mineral exploration company in the United States. It explores for lead and silver deposits. The company is based in Wallace, Idaho.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Wallace"}, "ACRL": {"short_name": "ATACAMA RESOURCES INTERNATIONAL", "long_name": "Atacama Resources International, Inc.", "summary": "Atacama Resources International, Inc. operates as a mining company in the United States and Canada. The company's mining interests includes 42 claims in a 1680 acre mine in Kirkland Lake area of Ontario. It explores for gold, copper, graphite, diamonds, and cobalt. The company also offers Good2Drive, a smartphone app that measures the driver's cognitive ability to drive vehicles. In addition, it offers executive advisory relating to growing microcap companies through the going public process; and consulting services. The company was formerly known as Arrakis Mining Research Inc and changed its name to Atacama Resources International, Inc. in January 2015. Atacama Resources International, Inc. was founded in 2013 and is based in Kenosha, Wisconsin.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Kenosha"}, "AGIN": {"short_name": "AMERICAN GRAPHITE TECHNOLOGIES ", "long_name": "American Graphite Technologies, Inc.", "summary": "American Graphite Technologies, Inc., an exploration stage company, engages in the exploration and development of graphite and graphene mineral properties. It holds a 100% interest in the Lac Rouge graphite property, which consists of 84 mineral claims covering an area of 4,982 hectares of land located near the town of Mont-Laurier in southern Quebec. The company was formerly known as Green & Quality Home Life, Inc. and changed its name to American Graphite Technologies Inc. in July 2012. American Graphite Technologies Inc. was founded in 2010 and is based in Las Vegas, Nevada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Las Vegas"}, "AHUH.F": {"short_name": "SIXTH WAVE INNOVATIONS", "long_name": "Sixth Wave Innovations Inc.", "summary": "Sixth Wave Innovations Inc., a development stage nanotechnology company, focuses on the extraction and detection of target substances at the molecular level using specialized molecularly imprinted polymers. It is in the process of commercializing its Affinity cannabinoid purification system; and IXOS, a line of extraction polymers for the gold mining industry. The company was formerly known as Atom Energy Inc. and changed its name to Sixth Wave Innovations Inc. in August 2019. Sixth Wave Innovations Inc. was incorporated in 2007 and is headquartered in Salt Lake City, Utah.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Salt Lake City"}, "AMLM": {"short_name": "AMERICAN LITHIUM MINERALS INC", "long_name": "American Lithium Minerals, Inc.", "summary": "American Lithium Minerals, Inc., an exploration stage company, engages in the acquisition and exploration of mining properties in the United States. The company primarily focuses on investigating prospective lithium opportunities. It holds an option to acquire a 100% interest in 88 unpatented mining claims in Esmeralda County, Nevada. The company was formerly known as Nugget Resources Inc. and changed its name to American Lithium Minerals, Inc. in March 2009. American Lithium Minerals, Inc. was founded in 2005 and is based in Henderson, Nevada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Henderson"}, "AMNL": {"short_name": "APPLIED MINERALS INC", "long_name": "Applied Minerals, Inc.", "summary": "Applied Minerals, Inc. extracts, processes, and markets halloysite clay and iron oxide. The company owns the Dragon mine property that consists of 38 patented and 6 unpatented mining claims covering an area of 267 acres located in Juab County, Utah. It offers halloysite clay-based line of products for use in various applications, such as molecular sieves and catalysts, flame retardant additives for plastics, binders for ceramics, nucleation and/or reinforcement of polymers, paints and coatings, batteries, controlled release carriers cosmetics, and others under the tradename DRAGONITE. The company also provides natural iron oxide-based products for the pigmentary and technical application markets under the trade name AMIRON. It markets and sells its products directly, as well as through agents and distributors. The company was formerly known as Atlas Mining Company and changed its name to Applied Minerals, Inc. in October 2009. Applied Minerals, Inc. was founded in 1924 is based in Brooklyn, New York.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Brooklyn"}, "ASKE": {"short_name": "ALASKA PACIFIC ENERGY CORP", "long_name": "Alaska Pacific Energy Corp.", "summary": "Alaska Pacific Energy Corp., an exploration stage company, engaged in the acquisition, exploration, and development of resource properties in Canada. The company was founded in 2005 and is based in Carlsbad, California.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Carlsbad"}, "ATURF": {"short_name": "SIXTH WAVE INNOVATIONS INC", "long_name": "Sixth Wave Innovations Inc.", "summary": "Sixth Wave Innovations Inc., a development stage nanotechnology company, focuses on the extraction and detection of target substances at the molecular level using specialized molecularly imprinted polymers. It is in the process of commercializing its Affinity cannabinoid purification system; and IXOS, a line of extraction polymers for the gold mining industry. The company was formerly known as Atom Energy Inc. and changed its name to Sixth Wave Innovations Inc. in August 2019. Sixth Wave Innovations Inc. was incorporated in 2007 and is headquartered in Salt Lake City, Utah.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Salt Lake City"}, "AUMC": {"short_name": "AURYN MINING CORPORATION", "long_name": "AURYN Mining Corporation", "summary": "AURYN Mining Corporation operates as a mining and exploration company. It owns and operates approximately 10,500 hectares of mining claims comprising the Altos de Lipangue mining district. The company is based in Indianapolis, Indiana.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Indianapolis"}, "BEAG": {"short_name": "BLUE EAGLE LITHIUM INC", "long_name": "Blue Eagle Lithium Inc.", "summary": "Blue Eagle Lithium Inc. engages in identifying, evaluating, and developing early-stage lithium exploration opportunities in North America. It holds a 100% working interest in the Railroad Valley project, which covers an area of 5,520 acres located in Railroad Valley, Nevada. The company was formerly known as Wishbone Pet Products Inc. and changed its name to Blue Eagle Lithium Inc. in July 2018. Blue Eagle Lithium Inc. was founded in 2009 and is based in Henderson, Nevada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Henderson"}, "BMIN": {"short_name": "BRITANNIA MNG INC", "long_name": "Britannia Mining Inc.", "summary": "Britannia Mining, Inc., a natural resources development company, engages in the exploration and development of iron ore and gold mining properties. It develops Nthale Iron Ore that covers an area of 650 square kilometers located in Nthale, Malawi; and explores for Yukon Gold project comprising 6 separate claims covering an area of 300 acres located in Yukon, Canada. The company was founded in 1998 and is based in New York, New York.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "New York"}, "BONZ": {"short_name": "BONANZA GOLDFIELDS CORP", "long_name": "Bonanza Goldfields Corp.", "summary": "Bonanza Goldfields Corp. operates as a mining and mineral exploration company. It primarily explores for gold, silver, lead, and zinc. The company's flagship property is the Montezuma Stonewall that comprise patented mining claims of 60 acres located to the south of Goldfield, Nevada. Bonanza Goldfields Corp. was founded in 2008 and is based in Las Vegas, Nevada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Las Vegas"}, "BORK": {"short_name": "BOURQUE INDUSTRIES INC", "long_name": "Bourque Industries, Inc.", "summary": "Bourque Industries, Inc. develops carbon nanotube metal matrix composite materials. The company uses a metal alloying process called Kryron for the uniform dispersion of carbon nanotubes in metal. Its products are used in various industries, including ballistic armor, electrical, aviation, automotive, mining, medical devices, agriculture and heavy equipment, consumer electronics, and others. The company is based in Phoenix, Arizona.Bourque Industries, Inc. develops carbon nanotube metal matrix composite materials. The company uses a metal alloying process called Kryron for the uniform dispersion of carbon nanotubes in metal. Its products are used in various industries, including ballistic armor, electrical, aviation, automotive, mining, medical devices, agriculture and heavy equipment, consumer electronics, and others. The company is based in Phoenix, Arizona.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Phoenix"}, "BR3.F": {"short_name": "NIOCORP DEVELOPMENTS", "long_name": "NioCorp Developments Ltd.", "summary": "NioCorp Developments Ltd. explores for and develops mineral deposits in North America. It owns and develops the Elk Creek niobium/scandium/titanium project located in Southeastern Nebraska. The company was formerly known as Quantum Rare Earth Developments Corp. and changed its name to NioCorp Developments Ltd. in March 2013. NioCorp Developments Ltd. was incorporated in 1987 and is headquartered in Centennial, Colorado.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Centennial"}, "CCMN": {"short_name": "CALLAHAN CONS MINES INC", "long_name": "Callahan Consolidated Mines, Inc.", "summary": "Callahan Consolidated Mines, Inc. provides metal mining services in Idaho, the United States. The company is based in Wallace, Idaho.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Wallace"}, "CCOB": {"short_name": "CENTURY COBALT CORP", "long_name": "Century Cobalt Corp.", "summary": "Century Cobalt Corp. engages in the identification and exploration of mineral properties for the purposes of discovering cobalt assets. It holds an interest in the Idaho Cobalt Belt located to the southwest of Salmon, Idaho. The company was founded in 2008 and is based in Los Angeles, California.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Los Angeles"}, "CHCX": {"short_name": "CTGX MNG INC", "long_name": "CTGX Mining, Inc.", "summary": "CTGX Mining, Inc., through its subsidiary, Sackets Harbor Brewing Company, develops, produces, and markets micro brewed beers. The company offers its products under the brand names of War of 1812 Amber Ale, Railroad Red Ale, Thousand Island Pale Ale, 1812 Amber Ale Light, and Harbor Wheat. It also develops complementary products, such Sackets Harbor Coffee and Sackets Harbor Brewing Co. Root Beer. The company was formerly known as Harbor Brewing Co., Inc. and changed its name to CTGX Mining, Inc. in November 2012. CTGX Mining, Inc. is based in San Francisco, California.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "San Francisco"}, "CHZQ": {"short_name": "CHINA ZHONG QI HLDGS LTD", "long_name": "China Zhong Qi Holdings Limited", "summary": "024 Pharma, Inc. provides healthcare products worldwide. Its products include vitamin and mineral supplements; stress release, joint, heart health, and weight-loss products; and skin care, hair, and anti-aging products. The company was formerly known as B Green Innovations, Inc. and changed its name to 024 Pharma, Inc. in October 2016. 024 Pharma, Inc. was incorporated in 2004 and is based in West Palm Beach, Florida.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "West Palm Beach"}, "CMP": {"short_name": "Compass Minerals Intl Inc", "long_name": "Compass Minerals International, Inc.", "summary": "Compass Minerals International, Inc., produces and sells salt, and specialty plant nutrition and chemical products primarily in the United States, Canada, Brazil, the United Kingdom, and internationally. It operates through three segments: Salt, Plant Nutrition North America, and Plant Nutrition South America. The Salt segment offers sodium chloride and magnesium chloride, including rock salt, mechanically and solar evaporated salt, and brine and flake magnesium chloride products; and purchases potassium chloride and calcium chloride to sell as finished products or to blend with salt to produce specialty products. This segment provides products for use as a deicer for roadways, consumer, and professional use; as an ingredient in chemical production; for water treatment, human, and animal nutrition; and for various other consumer and industrial uses, as well as records management services. The Plant Nutrition North America segment offers sulfate of potash specialty fertilizers in various grades, including agricultural products used in broadcast spreaders, direct application, and liquid fertilizer solutions; turf products used by the turf and ornamental markets, as well as for blends used on golf course greens; organic products under the Protassium+ brand; and micronutrient products under the Wolf Trax brand, as well as specialty plant nutrition solution-based products and chemical solutions. This segment provides its products to distributors and retailers of crop inputs, as well as growers. The Plant Nutrition South America segment offers various specialty plant nutrients and supplements; water and wastewater treatment chemicals for cleaning, decontaminating, and purifying water; and process chemicals for industrial use. The company was formerly known as Salt Holdings Corporation and changed its name to Compass Minerals International, Inc. in December 2003. Compass Minerals International, Inc. was founded in 1993 and is headquartered in Overland Park, Kansas.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Overland Park"}, "CRGP": {"short_name": "CALISSIO RESOURCES GROUP INC", "long_name": "Calissio Resources Group, Inc.", "summary": "Calissio Resources Group, Inc. undertakes the exploration and production of copper resource on its Jovita mining property. It acquires and develops base metals projects in Mexico. The company was formerly known as Amarium Technologies, Inc. and changed its name to Calissio Resources Group, Inc. in October 2014. The company was incorporated in 2000 and is based in Las Vegas, Nevada. As of September 10, 2015, Calissio Resources Group, Inc. operates as a subsidiary of Milagros Del Cobre Mineria S.A. de C.V.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Las Vegas"}, "DLCR": {"short_name": "KIBUSH CAPITAL CORPORATION", "long_name": "Kibush Capital Corporation", "summary": "Kibush Capital Corporation, through its subsidiary, Aqua Mining Limited, operates as a mineral and natural resources exploration company in Papua New Guinea. The company primarily focuses on exploring gold. It is also involved in the timber logging and processing activities. The company was formerly known as David Loren Corporation and changed its name to Kibush Capital Corporation in August 2013. Kibush Capital Corporation was founded in 2005 and is based in Las Vegas, Nevada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Las Vegas"}, "DMDD": {"short_name": "DIAMOND DISCOVERIES INTL", "long_name": "Diamond Discoveries International Corp.", "summary": "Diamond Discoveries International Corp. operates as a mineral exploration company. It focuses on the exploration of diamonds, chromium, and gold; and platinum group elements, such as platinum, palladium, and rhodium on its Caribou Property in Thetford Mines, Quebec. The company was founded in 2000 and is based in New York, New York with an additional office in Thetford Mines, Canada. It also has executive offices in New York, New York; and Burlington, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "New York"}, "EUBG": {"short_name": "ENTREPRENEUR UNIVERSE BRIGHT GR", "long_name": "Entrepreneur Universe Bright Group", "summary": "Entrepreneur Universe Bright Group, a mineral exploration company, focuses on the exploration and production of rare earth elements primarily in South America. It focuses on exploration for tantalum and niobium minerals. The company holds rights to a 778 acre property located in Santa Cruz, Venezuela. Entrepreneur Universe Bright Group was founded in 1999 and is based in North Las Vegas, Nevada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "North Las Vegas"}, "EXMGF": {"short_name": "EXCELSIOR MINING CORP", "long_name": "Excelsior Mining Corp.", "summary": "Excelsior Mining Corp., together with its subsidiaries, engages in the acquisition, exploration, evaluation, and development of mineral properties in the United States and Canada. It holds 100% interests in the Gunnison copper project covering an area of approximately 9,560 acres located in Cochise County, Arizona; and the Johnson Camp Mine located in Arizona. The company was incorporated in 2005 and is headquartered in Phoenix, Arizona.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Phoenix"}, "FCGD": {"short_name": "FIRST COLOMBIA GOLD CORP", "long_name": "First Colombia Gold Corp.", "summary": "First Colombia Gold Corp. engages in the exploration and production of oil and gas properties. The company operates through Energy and Mining divisions. It holds interests in 96 oil wells with a gross acreage of 4,302 acres in the counties of Cumberland, Monroe, Overton, and Clinton. The company is also involved in the precious minerals exploration business. It owns 2 unpatented mining claims in the Skip Silver prospect covering an area of approximately 40 acres in central Montana. The company was formerly known as Amazon Goldsands Ltd. and changed its name to First Colombia Gold Corp. in November 2010. First Colombia Gold Corp. was founded in 1997 and is based in Nashville, Tennessee.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Nashville"}, "FRMA": {"short_name": "FIRMA HOLDINGS CORP", "long_name": "Firma Holdings Corp.", "summary": "Firma Holdings Corp., a diversified holding company, focus on emerging and middle market domestic and international investment opportunities. It is evaluating the acquisition of other interests, joint ventures, and licensing agreements with qualified companies within the consumer and industrial products industries, including qualified CBD products. Previously, the company was engaged in mining, packaging technology, and food manufacturing businesses. The company was formerly known as Tara Minerals Corp. and changed its name to Firma Holdings Corp. in June 2014. Firma Holdings Corp. was founded in 2006 and is based in Henderson, Nevada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Henderson"}, "FUST": {"short_name": "FUSE GROUP HOLDING INC", "long_name": "Fuse Group Holding Inc.", "summary": "Fuse Group Holding Inc. provides consulting service to mining industry clients to find acquisition targets. The company was formerly known as Fuse Enterprises Inc. and changed its name to Fuse Group Holding Inc. in May 2019. The company was founded in 2013 and is headquartered in Arcadia, California. Fuse Group Holding Inc. is a subsidiary of Landbond Home Limited.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Arcadia"}, "GBEI": {"short_name": "GREAT BASIN ENERGIES INC", "long_name": "Great Basin Energies, Inc.", "summary": "Great Basin Energies, Inc. does not have significant operations. Previously, it was involved in the natural resource exploration and real estate activities. The company was incorporated in 1981 and is based in Spokane, Washington.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Spokane"}, "GJST": {"short_name": "GEO JS TECH GROUP CORP", "long_name": "GEO JS Tech Group Corp.", "summary": "GEO JS Tech Group Corp. engages in the exploration of sand, stone, and iron minerals in Mexico and Malaysia. Its principal project includes El Sara property, which is located in the Pacific coastal plain of Baja California, Mexico. The company was founded in 2010 and is based in Houston, Texas.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "GMOLQ": {"short_name": "General Moly, Inc.", "long_name": "General Moly, Inc.", "summary": "General Moly, Inc., together with its subsidiary, Eureka Moly, LLC, engages in the exploration, development, and mining of mineral properties in the United States. The company explores for molybdenum and copper deposits. It primarily has an 80% interest in the Mt. Hope project consisting of 13 patented lode claims and one mill site claim with proven and probable molybdenum reserves totaling approximately 1.4 billion pounds located in Eureka County, Nevada. General Moly, Inc. was incorporated in 1925 and is headquartered in Lakewood, Colorado. On November 18, 2020, General Moly, Inc. filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the District of Colorado.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Lakewood"}, "GSML": {"short_name": "G&S MINERALS INC", "long_name": "G&S Minerals, Inc.", "summary": "G&S Minerals, Inc., doing business as Gold & Silver Minerals, Inc., mines and explores minerals, as well as offers gold and silver investment information services to savvy gold and silver investors for the long term. It also offers information on buying gold through the stock exchange in the form of exchange traded funds. G&S Minerals, Inc. was formerly known as Gold & Silver Minerals, LLC and changed its name to G&S Minerals, Inc. in October, 2006. The company is based in Las Vegas, Nevada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Las Vegas"}, "GTCP": {"short_name": "GEORGETOWN CORP", "long_name": "Georgetown Corporation", "summary": "Georgetown Corporation, an exploration stage company, engages in the acquisition, exploration, and development of mineral properties. The company was formerly known as Yukonic Minerals Corp. and changed its name to Georgetown Corporation in January 2012. Georgetown Corporation was founded in 2010 and is based in Silver Spring, Maryland.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Silver Spring"}, "GYST": {"short_name": "GRAYSTONE CO INC", "long_name": "The Graystone Company, Inc.", "summary": "The Graystone Company, Inc., through its subsidiaries, engages in acquiring and developing mining properties. The company is involved in acquiring and developing gold, silver, precious metals and gems, and other mineral properties with proven and/or probable reserves in Peru. It owns 1,600 hectares of properties. The company holds interests in the Gorilla project covering an area of 400 hectares; the Graystone II project that covers 800 hectares; and the Graystone IV project, which covers 400 hectares located in Loreto, Peru, as well as holds a 40% interest in the Suriname project. It also sells gold, silver, and other precious metals to retail buyers. The company was formerly known as Argentum Capital, Inc. and changed its name to The Graystone Company, Inc. in January 2011. The Graystone Company, Inc. was incorporated in 2010 and is headquartered in Las Vegas, Nevada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Las Vegas"}, "HNTM": {"short_name": "HUNTMOUNTAIN RESOURCES LTD", "long_name": "HuntMountain Resources Ltd.", "summary": "HuntMountain Resources Ltd. engages in the acquisition, exploration, and development of mineral properties. It primarily focuses on gold, silver, and associated base metals. The company primarily holds interests in the La Josefina property and the El Gateado Property, as well as three properties, known as El Overo, El Alazan, and El Tordillo located in Santa Cruz province of Argentina. HuntMountain Resources Ltd. was founded in 1927 and is based in Liberty Lake, Washington.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Liberty Lake"}, "HSCM": {"short_name": "HIGHLAND SURPRISE CONS MNG CO", "long_name": "Highland Surprise Consolidated Mining Co.", "summary": "Highland Surprise Consolidated Mining Company engages in the exploration and mining activities. The company is based in Wallace, Idaho.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Wallace"}, "HTRC": {"short_name": "HUNTER CREEK MINING CO", "long_name": "Hunter Creek Mining Co.", "summary": "Hunter Creek Mining Co. engages in the mineral exploration business. The company explores for gold, silver, and lead deposits. Hunter Creek Mining Co. was founded in 1945 and is based in Portland, Oregon.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Portland"}, "HZNM": {"short_name": "HORIZON MINERALS CORP", "long_name": "Horizon Minerals Corp.", "summary": "Horizon Minerals Corp. engages in the exploration and development of mineral properties in the United States. It primarily focuses on exploring for lithium deposits. The company has interests in the SFE Property, a section of Scotty's Southeast Claims with 312 twenty-acre unpatented mining claims located in Central Nye County, Nevada; the Crystal Basin Claims covering 245 twenty-acre unpatented mining claims situated in Southern Nye County, Nevada; the Cholla Claims with 424 unpatented twenty-acre claims located in eastern San Bernardino County, California; and the North Lobe Claims covering 160 unpatented twenty-acre claims situated in Elko County, northeastern Nevada. It also has interest in 224 claim units totaling 4,480 acres located in Toole County, Utah. The company was formerly known as Safe Dynamics Corp. and changed its name to Horizon Minerals Corp. in March 2013. Horizon Minerals Corp. was founded in 2011 and is headquartered in Las Vegas, Nevada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Las Vegas"}, "LBSR": {"short_name": "LIBERTY STAR URANIUM & METALS C", "long_name": "Liberty Star Uranium & Metals Corp.", "summary": "Liberty Star Uranium & Metals Corp., a mineral resource company, engages in the acquisition and exploration of mineral properties in the United States. The company explores for copper, molybdenum, gold, silver, lead, zinc, manganese, and other metals, including rare earth elements. Its principal property is the Hay Mountain project that comprises 28 mineral exploration permits covering an area of 12,557.77 acres located to the southeast of Tombstone. The company was formerly known as Liberty Star Gold Corp. and changed its name to Liberty Star Uranium & Metals Corp. in April 2007. Liberty Star Uranium & Metals Corp. was founded in 2001 and is headquartered in Tucson, Arizona.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Tucson"}, "LFEX": {"short_name": "LUCKY FRIDAY EXTENSION MINE", "long_name": "Lucky Friday Extn Mining Co.", "summary": "Lucky Friday Extension Mining Co. engages in the exploration of mineral properties. It explores for silver. The company is based in Spokane Valley, Washington.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Spokane Valley"}, "LSMG": {"short_name": "LODE-STAR MINING INC", "long_name": "Lode-Star Mining Inc.", "summary": "Lode-Star Mining Inc. acquires and explores for mineral properties. The company holds interests in the Goldfield Bonanza project, which comprises 31 patented mineral claims covering an area of 460 acres located in the district of Goldfield in the state of Nevada. Lode-Star Mining Inc. was incorporated in 2004 and is based in Reno, Nevada. Lode-Star Mining Inc. is a subsidiary of Lode Star Gold Inc.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Reno"}, "LTUM": {"short_name": "LITHIUM CORPORATION", "long_name": "Lithium Corporation", "summary": "Lithium Corporation, an exploration stage mining company, engages in the identification, acquisition, and exploration of metals and minerals in Nevada and British Columbia. It explores for lithium/boron/potassium, graphite, gold, and silver deposits. The company owns interests in the Fish Lake Valley property that includes 143 claims covering an area of approximately 1,440 acres located in northern Esmeralda County in west central Nevada; and San Emidio property comprising 20 claims, which cover an area of approximately 1,600 acres located in Washoe County in northwestern Nevada. It also hold interests in the BC Sugar Flake Graphite property covering an area 19,816 acres located in the Cherryville area of British Columbia; and Hughes claims located in the six discrete prospect areas of Nevada. The company was formerly known as Utalk Communications Inc. and changed its name to Lithium Corporation in September 2009. Lithium Corporation was founded in 2007 and is headquartered in Elko, Nevada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Elko"}, "MDMN": {"short_name": "MEDINAH MINERALS INC", "long_name": "Medinah Minerals, Inc.", "summary": "Medinah Minerals, Inc., through its subsidiaries, engages in the exploration and development of mineral properties in Chile. It principally holds interest in the Altos de Lipangue claims covering an area of approximately 10,500 hectares located in Chile. The company was formerly known as Medinah Mining, Inc. and changed its name to Medinah Minerals, Inc. in 2008. Medinah Minerals, Inc. was founded in 1989 and is based in Indianapolis, Indiana.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Indianapolis"}, "MIN.TO": {"short_name": "EXCELSIOR MINING CORP", "long_name": "Excelsior Mining Corp.", "summary": "Excelsior Mining Corp., together with its subsidiaries, engages in the acquisition, exploration, evaluation, and development of mineral properties in the United States and Canada. It holds 100% interests in the Gunnison copper project covering an area of approximately 9,560 acres located in Cochise County, Arizona; and the Johnson Camp Mine located in Arizona. The company was incorporated in 2005 and is headquartered in Phoenix, Arizona.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "TOR", "market": "ca_market", "country": "United States", "city": "Phoenix"}, "MP": {"short_name": "MP Materials Corp.", "long_name": "MP Materials Corp.", "summary": "MP Materials Corp. owns and operates integrated rare earth mining and processing facilities. It owns and operates the Mountain Pass facility located in the Western Hemisphere. The company holds the mineral rights to the Mountain Pass mine and surrounding areas, as well as intellectual property rights related to the processing and development of rare earth minerals. It offers neodymium and praseodymium that are rare earth elements, which in combination form neodymium-praseodymium. The company was founded in 2017 and is headquartered in Las Vegas, Nevada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Las Vegas"}, "MTLI": {"short_name": "METALINE CONTACT MINES CO", "long_name": "Metaline Contact Mines", "summary": "Metaline Contact Mines, a royalty-based mineral resources company, engages in the acquisition and leasing of mineral resource properties. The company primarily explores for zinc and gold deposits. It owns interests in the Pend Oreille/Metaline Zinc Mines located in Pend Oreille County, Washington; and the Golden Chest Mine consisting of patented mining claims in Shoshone County, Idaho. The company was founded in 1928 and is based in Murray, Idaho.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Murray"}, "MTRN": {"short_name": "Materion Corporation", "long_name": "Materion Corporation", "summary": "Materion Corporation manufactures and sells advanced engineered materials used in semiconductor, industrial, aerospace and defense, automotive, energy, consumer electronics, and telecom and data center markets in the United States, Asia, Europe, and internationally. The company operates through Performance Alloys and Composites, Advanced Materials, and Precision Coatings segments. The Performance Alloys and Composites segment provides copper and nickel products in plate, rod, bar, tube, strip, wire product forms, as well as other customized shapes; thick precision strip products; beryllium hydroxide; and beryllium products, such as beryllium composites, ceramics, and engineered clad and plated metal systems, as well as aluminum silicon carbide metal matrix. This segment also produces strip metal products with clad inlay and overlay metals consisting of precious and base metals electroplated systems, electron beam welded systems, contour profiled systems, and solder-coated metal systems. The Advanced Materials segment provides advanced chemicals, microelectronics packaging, precious and non-precious metals, and specialty metal products, including vapor deposition targets, frame lid assemblies, clad and precious metal pre-forms, high temperature braze materials, and ultra-fine wires. The Precision Coatings segment produces sputter-coated precision thin film coatings and optical filter materials. It distributes its products through company-owned facilities, and independent distributors and agents. The company has a strategic collaboration with Kairos Power to develop and supply materials for advanced reactor technology. The company was formerly known as Brush Engineered Materials Inc. and changed its name to Materion Corporation in 2011. Materion Corporation was founded in 1931 and is headquartered in Mayfield Heights, Ohio.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Mayfield Heights"}, "MYSN": {"short_name": "MYSON GROUP INC", "long_name": "Myson Group, Inc.", "summary": "Myson Group, Inc. operates in construction, infrastructure, real estate, hospitality, international trade, and mining activities. The company is headquartered in Miami, Florida.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Miami"}, "NB.TO": {"short_name": "NIOCORP DEVELOPMENTS LTD", "long_name": "NioCorp Developments Ltd.", "summary": "NioCorp Developments Ltd. explores for and develops mineral deposits in North America. It owns and develops the Elk Creek niobium/scandium/titanium project located in Southeastern Nebraska. The company was formerly known as Quantum Rare Earth Developments Corp. and changed its name to NioCorp Developments Ltd. in March 2013. NioCorp Developments Ltd. was incorporated in 1987 and is headquartered in Centennial, Colorado.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "TOR", "market": "ca_market", "country": "United States", "city": "Centennial"}, "NGCG": {"short_name": "NEW GENERATION CONSUMER GROUP I", "long_name": "New Generation Consumer Group, Inc.", "summary": "New Generation Consumer Group, Inc., through its subsidiary Monster Marketing Group, Inc., develops, markets, sells, and distributes consumable products to consumers in North America. The company's Michelada division offers Michelada Mix under the Mucho Macho brand name; and VIP Spirits division offers liqueur infused vodka in various flavors under the Excuse brand. It serves clients in quick service, fast food, automobiles, and cellular sectors. The company was formerly known as United Music & Media Group, Inc. and changed its name to New Generation Consumer Group, Inc. in October 2014. New Generation Consumer Group, Inc. was incorporated in 1989 and is headquartered in Los Angeles, California.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Los Angeles"}, "NIOBF": {"short_name": "NIOCORP DEVELOPMENTS LTD", "long_name": "NioCorp Developments Ltd.", "summary": "NioCorp Developments Ltd. explores for and develops mineral deposits in North America. It owns and develops the Elk Creek niobium/scandium/titanium project located in Southeastern Nebraska. The company was formerly known as Quantum Rare Earth Developments Corp. and changed its name to NioCorp Developments Ltd. in March 2013. NioCorp Developments Ltd. was incorporated in 1987 and is headquartered in Centennial, Colorado.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Centennial"}, "NXGM": {"short_name": "NEXGEN MINING INC", "long_name": "NexGen Mining Incorporated", "summary": "NexGen Mining, Inc., a junior mining company, engages in the exploration, mining, and production of precious metals. The company primarily explores for gold, silver, copper, lead, zinc, and other precious and base metals. It holds interests in the Old Dominion mine situated north of Reno, Nevada; the Koegel Hills property that consists of 10 unpatented claims encompassing 200 acres located in Mineral County, Nevada; the Four Mile Basin gold property, which comprises two unpatented claims consisting of 20 acres and is situated in Nye County, Nevada; the Gold Star property located in Mineral County, Nevada; and the Pyramid mine located Nevada, as well as in the Paradise Peak mine. NexGen Mining, Inc. was formerly known as Brilliant Sands Incorporated and changed its name to NexGen Mining, Inc. in January 2018. The company was incorporated in 1888 and is based in Reno, Nevada. NexGen Mining, Inc. is a former subsidiary of 1824455 Alberta Ltd.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Reno"}, "OATN": {"short_name": "O A T INC", "long_name": "O.A.T., Inc.", "summary": "O.A.T., Inc. operates as a natural resource development company. It focuses on seeking exploration opportunities primarily in West Africa. The company was formerly known as Sillenger Exploration Corp. O.A.T., Inc. was founded in 2007 and is based in Cerritos, California.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Cerritos"}, "OMHI": {"short_name": "OM HOLDINGS INTERNATIONAL INC", "long_name": "OM Holdings International, Inc.", "summary": "OM Holdings International, Inc. provides local on-demand economy technology mobile software for iOS and android smart phones. The company also operates OM Marketplace, an app that offers groceries, housewares, and furniture; supplies lumber products, DIY construction materials, and general contractor products; and provides local courier, last mile package delivery, and ocean and air freight transportation services. It primarily operates in British Virgin Islands and Jamaica. The company was formerly known as Portage Resources Inc. OM Holdings International, Inc. is based in Miami, Florida.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Miami"}, "OTMN": {"short_name": "O T MINING CORP", "long_name": "The O.T. Mining Corporation", "summary": "The O.T. Mining Corporation, an exploration stage company, explores for and develops base and precious metal resource properties. The company primarily explores for copper, molybdenum, cobalt, zinc, and lead. It holds interests in the Ruby property comprising 13 patented and 291 unpatented claims covering approximately 9.26 square miles located in Jefferson County, Montana. The company was formerly known as Ruby Resources of Montana Inc. and changed its name to The O.T. Mining Corporation in May 1987. The O.T. Mining Corporation was incorporated in 1980 and is based in Helena, Montana.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Helena"}, "PIHN": {"short_name": "POLARIS INTERNATIONAL INC", "long_name": "Polaris International Holdings Inc.", "summary": "Polaris International Holdings Inc. operates as a mining and mineral exploration company. The company primarily explores for gold deposits. It holds interest in the Montana Project covering an area of 20 acres in the Nine Mile mining district in Montana. The company was formerly known as Modern World Media, Inc. and changed its name to Polaris International Holdings Inc. in September 2007. Polaris International Holdings Inc. was founded in 2001 and is based in Irving, Texas.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Irving"}, "PNGM": {"short_name": "PENGRAM CORP", "long_name": "Pengram Corporation", "summary": "Pengram Corporation, an exploration stage mining company, engages in the acquisition, exploration, and development of natural resource properties, primarily gold. It holds 216 claims covering an area of approximately 4350 acres in 3 properties in Nevada, including the Fish project in Esmeralda County, the CPG project in Mineral County, and the Golden Snow property in Eureka County. The company also has interest in the Clisbako property, which consists of mineral claims covering an area of 8,372 acres in the Cariboo Mining District of British Columbia. Pengram Corporation was founded in 2006 and is based in Bellingham, Washington.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Bellingham"}, "PRCK": {"short_name": "PLACER CREEK MINING CO.", "long_name": "Placer Creek Mining Co.", "summary": "Placer Creek Mining Co. operates as a digital outdoor advertising company in the United States. It offers various solutions from exterior and interior displays to a rail car advertising platform and customized private transit programs. The company was founded in 2011 and is based in Snoqualmie, Washington.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Snoqualmie"}, "PRMO": {"short_name": "PROM RESOURCES INC", "long_name": "Prom Resources, Inc.", "summary": "Prom Resources, Inc. engages in the exploration and extraction of gold ores, corundum, and beryl materials at various mining and exploration perimeters in Madagascar. It sells its extracted material through agreements in place with various third party companies. The company was formerly known as American Benefits Group, Inc. and changed its name to Prom Resources, Inc. in October 2006. Prom Resources, Inc. was incorporated in 1996 and is based in Orlando, Florida.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Orlando"}, "PSGR": {"short_name": "PERSHING RESOURCES CO INC", "long_name": "Pershing Resources Company, Inc.", "summary": "Pershing Resources Company, Inc. operates as a gold and precious metals exploration company primarily in Nevada. The company focuses on the development of its 100% owned New Enterprise project that consists of 167 claims covering an area of approximately 3,450 acres located in Kingman, Arizona. Its other mining properties are in various stages of development located in the Western United States. The company was formerly known as Xenolix, Technologies, Inc. Pershing Resources Company, Inc. was incorporated in 1996 and is based in Reno, Nevada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Reno"}, "PUBC": {"short_name": "PUREBASE CORPORATION", "long_name": "PureBase Corporation", "summary": "Purebase Corporation, an industrial mineral and natural resource company, provides solutions to the agriculture and construction materials markets. It offers PureBase Shade Advantage WP, a natural mineral plant protectant that reduces sunburn damage to plant tissue exposed to UV and infrared radiation; PureBase SulFe Hume Si Advantage that provides minerals while improving the nutrient uptake to plants, and improving soil biology; and PureBase Humate INU Advantage, a soluable iron leonardite with organic matter, carbon, and fulvic acid content. The company was formerly known as Port of Call Online, Inc. and changed its name to Purebase Corporation in January 2015. Purebase Corporation was incorporated in 2010 is headquartered in Ione, California.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Ione"}, "RADR": {"short_name": "RADIUM RESOURCES CORP", "long_name": "Radium Resources Corp.", "summary": "Radium Resources Corp. acquires, explores, and develops diamond projects in kimberlite rich areas in Central and Southern Canada. The company operates properties in the Fort-a-la-Corne and Shear Surround areas of southern Saskatchewan near the Canada-United States border. The company was formerly known as Kimber-X Resources Corporation and changed its name to Radium Resources Corp. in December 2007. The company was founded in 1995 and is based in Wilmington, Delaware.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Wilmington"}, "REEMF": {"short_name": "RARE ELEMENT RESOURCES LTD", "long_name": "Rare Element Resources Ltd.", "summary": "Rare Element Resources Ltd. explores for mineral properties in the United States. It holds a 100% interest in the Bear Lodge property that comprises the Bear Lodge REE project and the Sundance Gold project located in central Crook County, northeast Wyoming. Rare Element Resources Ltd. is headquartered in Littleton, Colorado.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Littleton"}, "RFXRF": {"short_name": "RUNNING FOX RESOURCE CORP", "long_name": "Running Fox Resource Corp.", "summary": "Running Fox Resource Corp. engages in the exploration, development, and exploitation of resource projects in Canada and the United States. The company was incorporated in 1981 and is based in Arvada, Colorado.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Arvada"}, "RJO.F": {"short_name": "SOLITARIO ZINC CORP.DL-01", "long_name": "Solitario Zinc Corp.", "summary": "Solitario Zinc Corp., an exploration stage company, engages in the acquisition, exploration, and development of zinc properties in North and South America. It primarily owns a 39% interest in the Florida Canyon zinc project located in northern Peru; and a 50% interest in the Lik zinc-lead-silver property located in Northwest Alaska. The company also owns the La Promesa gold exploration project; and an 85% interest in the Chambara exploration project located in Peru. The company was formerly known as Solitario Exploration & Royalty Corp. and changed its name to Solitario Zinc Corp. in July 2017. The company was founded in 1984 and is based in Wheat Ridge, Colorado.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Wheat Ridge"}, "RRIF": {"short_name": "RAINFOREST RESOURCES INC", "long_name": "Rainforest Resources Inc.", "summary": "Rainforest Resources Inc. operates in the forestry sector. It also produces carbon credit certificates; and develops and exports natural spring water. The company was formerly known as Amalgamated Gold & Silver Inc. and changed its name to Rainforest Resources Inc. in December 2015. Rainforest Resources Inc. is headquartered in Anna Maria, Florida.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Anna Maria"}, "RUN-H.V": {"short_name": "RUNNING FOX RESOURCE CORP", "long_name": "Running Fox Resource Corp.", "summary": "Running Fox Resource Corp. engages in the exploration, development, and exploitation of resource projects in Canada and the United States. The company was incorporated in 1981 and is based in Arvada, Colorado.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "United States", "city": "Arvada"}, "RVBR": {"short_name": "MARKRAY CORP", "long_name": "Markray Corp.", "summary": "Markray Corp., a development stage mining company, operates a rare earth minerals mine in Russia. It primarily mines for gold, silver, platinum, and iron, as well as transparent iron-oxide pigment. The company was formerly known as R'Vibrant Inc. and changed its name to Markray Corp. in January 2011. Markray Corp. was incorporated in 1998 and is headquartered in North Hollywood, California.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "North Hollywood"}, "SCY.TO": {"short_name": "SCANDIUM INTERNATIONAL MINING C", "long_name": "Scandium International Mining Corp.", "summary": "Scandium International Mining Corp., an exploration stage company, focuses on the exploration, evaluation, and development of specialty metals assets in Australia. The company explores for scandium and rare earth minerals; and other specialty metals comprising nickel, cobalt, boron, manganese, tantalum, titanium, and zirconium. It focuses on developing the Nyngan scandium project located in New South Wales, Australia. The company was formerly known as EMC Metals Corp. and changed its name to Scandium International Mining Corp. in November 2014. Scandium International Mining Corp. was founded in 2006 and is headquartered in Sparks, Nevada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "TOR", "market": "ca_market", "country": "United States", "city": "Sparks"}, "SIVE": {"short_name": "SILVER VERDE MAY MINING CO INC", "long_name": "Silver Verde May Mining Co., Inc.", "summary": "Silver Verde May Mining Co., Inc., an exploration stage company, engages in the acquisition, exploration, and development of mineral properties in the United States. The company focuses on exploring gold, silver, lead, zinc, copper, and other minerals on the properties. It holds interests in 15 mineral exploration properties in the states of Idaho, Utah, and Wyoming. The company was incorporated in 1906 and is based in Wallace, Idaho.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Wallace"}, "SIXW.CN": {"short_name": "SixthWaveInno", "long_name": "Sixth Wave Innovations Inc.", "summary": "Sixth Wave Innovations Inc., a development stage nanotechnology company, focuses on the extraction and detection of target substances at the molecular level using specialized molecularly imprinted polymers. It is in the process of commercializing its Affinity cannabinoid purification system; and IXOS, a line of extraction polymers for the gold mining industry. The company was formerly known as Atom Energy Inc. and changed its name to Sixth Wave Innovations Inc. in August 2019. Sixth Wave Innovations Inc. was incorporated in 2007 and is headquartered in Salt Lake City, Utah.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "CNQ", "market": "ca_market", "country": "United States", "city": "Salt Lake City"}, "SLR.TO": {"short_name": "SOLITARIO ZINC CORP", "long_name": "Solitario Zinc Corp.", "summary": "Solitario Zinc Corp., an exploration stage company, engages in the acquisition, exploration, and development of zinc properties in North and South America. It primarily owns a 39% interest in the Florida Canyon zinc project located in northern Peru; and a 50% interest in the Lik zinc-lead-silver property located in Northwest Alaska. The company also owns the La Promesa gold exploration project; and an 85% interest in the Chambara exploration project located in Peru. The company was formerly known as Solitario Exploration & Royalty Corp. and changed its name to Solitario Zinc Corp. in July 2017. The company was founded in 1984 and is based in Wheat Ridge, Colorado.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "TOR", "market": "ca_market", "country": "United States", "city": "Wheat Ridge"}, "SRCH": {"short_name": "SEARCHLIGHT MINERALS CORPORATIO", "long_name": "Searchlight Minerals Corp.", "summary": "Searchlight Minerals Corp., an exploration stage company, engages in a slag reprocessing project; and the acquisition and exploration of mineral properties in the United States. It holds interests in the Clarkdale slag project, located in Clarkdale, Arizona, which is a reclamation project to recover precious and base metals from the reprocessing of slag produced from the smelting of copper ore mined at the United Verde Copper Mine in Jerome, Arizona. The company was formerly known as Phage Genomics, Inc and changed its name to Searchlight Minerals Corp. in June 2005. Searchlight Minerals Corp. was founded in 1999 and is based in Henderson, Nevada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Henderson"}, "SRSN": {"short_name": "STRATEGIC RESOURCES INTL INC", "long_name": "Strategic Resources International, Inc.", "summary": "Strategic Resources International, Inc. offers mining and mineral services. It provides gold and mineral mining services. The company was formerly known as MBT International, Inc. The company was founded in 1984 and is headquartered in Spokane, Washington.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Spokane"}, "TAMG": {"short_name": "TRANSNATIONAL GROUP INC", "long_name": "Transnational Group, Inc.", "summary": "Transnational Group, Inc., a development stage holding company, focuses on the acquisition and development of opportunities in the financial, consulting, and natural resources sectors. The company has a joint venture with Lanix Exploration, Inc. to acquire the mineral and mining rights to develop one to three target claims located in Anaconda, Butte and Havre, Montana. It also focuses on acquiring and developing transportation systems. The company was formerly known as Transnational Automotive Group, Inc. and changed its name to Transnational Group, Inc. in February 2014. Transnational Group, Inc. was founded in 1999 and is headquartered in Woodland Hills, California.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Woodland Hills"}, "TMBXF": {"short_name": "TOMBSTONE EXPLORATION CORP", "long_name": "Tombstone Exploration Corporation", "summary": "Tombstone Exploration Corporation, through its subsidiary Tombstone Exploration and Mining Corporation, engages in the exploration, development, and production of mineral properties in the United States. The company explores for silver and gold, as well as base minerals, including copper, lead, and zinc. It holds mineral rights in the Tombstone property, which covers an area of approximately 640 acres located in the Tombstone Mining district, Cochise County; and BLM lode claims comprising approximately 400 acres, including the Stardust Mine located in the Eagletail Mining district, Yuma County, Arizona. The company was formerly known as Pure Capital Incorporated and changed its name to Tombstone Exploration Corporation in February 2007. Tombstone Exploration Corporation was founded in 1997 and is based in Scottsdale, Arizona.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Scottsdale"}, "TMRC": {"short_name": "TEXAS MINERAL RESOURCES CORP", "long_name": "Texas Mineral Resources Corp.", "summary": "Texas Mineral Resources Corp. acquires, explores, and develops mineral properties in the United States. It primarily holds interests in the Round Top rare earth-uranium-beryllium project covering 950 acres in Hudspeth County, Texas; and prospecting permits covering 9,345 acres adjacent to the Round Top project. The company was formerly known as Texas Rare Earth Resources Corp. and changed its name to Texas Mineral Resources Corp. in March 2016. Texas Mineral Resources Corp. was incorporated in 1970 and is headquartered in Sierra Blanca, Texas.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Sierra Blanca"}, "TRRI": {"short_name": "TRINITY RES INC", "long_name": "Trinity Resources Inc.", "summary": "Trinity Resources Inc. operates as an exploration and mining development company. The company focuses on gold, silver, and platinum group metal projects in North and South America. It has interests in the Eureka Placer Claim that is located in Eureka Creek, California. The company was formerly known as TruLan Resources Inc. and changed its name to Trinity Resources Inc. in September 2015. Trinity Resources Inc. is headquartered in Henderson, Nevada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Henderson"}, "TVER": {"short_name": "TERRACE VENTURES INC", "long_name": "Terrace Ventures Inc.", "summary": "Terrace Ventures Inc., an exploration stage company, acquires, explores for, and develops mineral properties in the United States. The company was founded in 2001 and is based in Blaine, Washington.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Blaine"}, "UAMY": {"short_name": "United States Antimony Corporat", "long_name": "United States Antimony Corporation", "summary": "United States Antimony Corporation produces and sells antimony, silver, gold, and zeolite products in the United States and Canada. The company's Antimony division offers antimony oxide that is primarily used in conjunction with a halogen to form a synergistic flame retardant system for plastics, rubber, fiberglass, textile goods, paints, coatings, and paper. Its antimony oxide is also used as a color fastener in paints; as a catalyst for the production of polyester resins for fibers and films; as a catalyst for the production of polyethelene pthalate in plastic bottles; as a phosphorescent agent in fluorescent light bulbs; and as an opacifier for porcelains. In addition, this division offers sodium antimonite for use as a fining agent for glass in cathode ray tubes, and as a flame retardant; antimony metal for use in bearings, storage batteries, and ordnance; and precious metals. The company's Zeolite division provides zeolite deposits for soil amendment and fertilizer, water filtration, sewage treatment, nuclear waste and other environmental cleanup, odor control, gas separation, and animal nutrition applications. Its zeolite products also have applications in catalysts, petroleum refining, concrete, solar energy and heat exchange, desiccants, pellet binding, horse and kitty litter, and floor cleaners, as well as carriers for insecticides, pesticides, and herbicides. United States Antimony Corporation was founded in 1968 and is headquartered in Thompson Falls, Montana.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Thompson Falls"}, "UCCP.F": {"short_name": "WESTWATER RES  DL-,001", "long_name": "Westwater Resources, Inc.", "summary": "Westwater Resources, Inc. operates as a diversified energy materials development company. It primarily explores for lithium, graphite, uranium, and Vanadium deposits. The company's principal project is the Coosa graphite project covering an area of approximately 41,965 acres situated in east-central Alabama. It also holds interest in lithium projects, which include Columbus Basin project covers an area of approximately 14,200 acres comprise of 2 blocks of unpatented placer claims located in western Nevada; and the Sal Rica Project covers an area of approximately 13,260 acres situated in the northwestern Utah. It addition, the company holds interests in various uranium projects, including 188,700 acres in the west-central part of the New Mexico; and Texas. The company was formerly known as Uranium Resources, Inc. and changed its name to Westwater Resources, Inc. in August 2017. Westwater Resources, Inc. was founded in 1977 and is based in Centennial, Colorado.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Centennial"}, "UPCO": {"short_name": "UNIVERSAL POTASH CORP", "long_name": "Universal Potash Corp.", "summary": "Universal Potash Corp. operates as a natural resource exploration and development company in the United States. The company is following a business plan that calls for company representatives to research, negotiate, and obtain prospective uranium or potash properties, following which the company intends to enter into joint venture agreements to develop the properties. Its principal mineral property is the Ernestina Potash project that covers 201,216 hectares located in Alberta. The company was formerly known as Utah Uranium Corp. and changed its name to Universal Potash Corp. on July 31, 2008. Universal Potash Corp. was founded in 2001 and is based in Henderson, Nevada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Henderson"}, "VENV": {"short_name": "VENTURE VANADIUM INC", "long_name": "Venture Vanadium Inc.", "summary": "Venture Vanadium Inc. focuses on the evaluation and development of vanadium and rare earth metal exploration properties. Its primary project is the Desgrosbois vanadium-titanium property that consists of 30 mineral claims covering an area of 1,789.80 hectares located in Quebec, Canada. The company was formerly known as Aura Energy Inc. and changed its name to Venture Vanadium Inc. in February 2019. Venture Vanadium Inc. was founded in 2016 and is based in Pittsburgh, Pennsylvania.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Pittsburgh"}, "VRCV": {"short_name": "VARCA VENTURES INC", "long_name": "Varca Ventures, Inc.", "summary": "Varca Ventures, Inc., an exploration stage company, engages in the acquisition and exploration of mineral properties. It owns interest in the Idaho property that comprises 15 patented lode mining claims covering approximately 141.5 acres located in La Plata County, Colorado; and the Mayday property, which consists of 12 patented lode mining claims covering approximately 151 acres in La Plata County, Colorado. The company was founded in 2005 and is headquartered in Sarasota, Florida.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Sarasota"}, "WMTN": {"short_name": "WESTMOUNTAIN GOLD INC", "long_name": "WestMountain Gold, Inc.", "summary": "WestMountain Gold, Inc., an exploration stage mining company, explores gold properties in the United States. It owns 100% interests in the Terra project consisting of 344 mining claims, including 5 unpatented lode mining claims covering an area of 55,040 acres located in Alaska. The company is based in Fort Collins, Colorado.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Fort Collins"}, "WNCP": {"short_name": "WINECO PRODUCTIONS INC", "long_name": "Wineco Productions, Inc.", "summary": "Wineco Productions, Inc. engages in mining, exploring, and recovering precious metals. The company was incorporated in 1997 and is based in Sunrise, Florida.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Sunrise"}, "WWR": {"short_name": "Westwater Resources, Inc.", "long_name": "Westwater Resources, Inc.", "summary": "Westwater Resources, Inc. operates as a diversified energy materials development company. It primarily explores for lithium, graphite, uranium, and Vanadium deposits. The company's principal project is the Coosa graphite project covering an area of approximately 41,965 acres situated in east-central Alabama. It also holds interest in lithium projects, which include Columbus Basin project covers an area of approximately 14,200 acres comprise of 2 blocks of unpatented placer claims located in western Nevada; and the Sal Rica Project covers an area of approximately 13,260 acres situated in the northwestern Utah. It addition, the company holds interests in various uranium projects, including 188,700 acres in the west-central part of the New Mexico; and Texas. The company was formerly known as Uranium Resources, Inc. and changed its name to Westwater Resources, Inc. in August 2017. Westwater Resources, Inc. was founded in 1977 and is based in Centennial, Colorado.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "NCM", "market": "us_market", "country": "United States", "city": "Centennial"}, "XPL": {"short_name": "Solitario Zinc Corp.", "long_name": "Solitario Zinc Corp.", "summary": "Solitario Zinc Corp., an exploration stage company, engages in the acquisition, exploration, and development of zinc properties in North and South America. It primarily owns a 39% interest in the Florida Canyon zinc project located in northern Peru; and a 50% interest in the Lik zinc-lead-silver property located in Northwest Alaska. The company also owns the La Promesa gold exploration project; and an 85% interest in the Chambara exploration project located in Peru. The company was formerly known as Solitario Exploration & Royalty Corp. and changed its name to Solitario Zinc Corp. in July 2017. The company was founded in 1984 and is based in Wheat Ridge, Colorado.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Wheat Ridge"}}