{
    "4OMA.F": {
        "short_name": "VERSO CORP. A  DL -,01",
        "long_name": "Verso Corporation",
        "summary": "Verso Corporation produces and sells coated papers in North America. It operates through two segments, Paper and Pulp. The company offers coated freesheet and coated groundwood, specialty, packaging, inkjet and digital, supercalendered, and uncoated freesheet papers; and bleached and unbleached market kraft pulp to manufacture printing, writing, and tissue products. Its paper products are used primarily in media and marketing applications, including catalogs, magazines, and commercial printing applications, such as high-end advertising brochures, annual reports, and direct-mail advertising; and specialty applications comprising flexible packaging, and label and converting. The company was formerly known as Verso Paper Corp. and changed its name to Verso Corporation in January 2015. Verso Corporation was founded in 2006 and is headquartered in Miamisburg, Ohio.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OH",
        "city": "Miamisburg",
        "zipcode": "45342",
        "website": "http://www.versoco.com",
        "market_cap": "Small Cap"
    },
    "BOTX": {
        "short_name": "BONTEX INC",
        "long_name": "Bontex Inc.",
        "summary": "Bontex Inc. manufactures and supplies specialty composite materials to customers worldwide. It offers cellulose board and light gauge products comprising cellulose fibers for products, such as visors, brims, and size bands for headwear, as well as insoles for footwear products; and treated elastomeric wet web impregnated substrates to resist mold type growth that causes odor in luggage. The company also provides non woven boards; and Strobel products. Its cellulose board and light gauge products are PVC, PU, or special size coated as per custom needs. The company's products are used in hiking/performance, work/safety, sport performance, men's dress, casual men's, casual women's, women's fashion, kids, and luggage/visor board/handbag applications. Bontex Inc. was formerly known as Georgia Bonded Fibers, Inc. and changed its name to Bontex Inc. in 1996. The company was founded in 1946 and is based in Buena Vista, Virginia with research and development, manufacturing, converting, and warehousing facilities primarily in the Asia-Pacific, Europe, Africa, the Middle East, India, and the Americas.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Buena Vista",
        "zipcode": "24416",
        "website": "http://www.bontex.com",
        "market_cap": "Small Cap"
    },
    "BPMI": {
        "short_name": "BADGER PAPER MILLS",
        "long_name": "BPM Inc.",
        "summary": "BPM Inc. manufactures machine glazed papers for confectionery and candy wrap, dairy, meat, poultry, bakery, and food wraps markets. The company offers converted materials; custom web, toll printing, converting, and rewinding services; and post-consumer recycled fine papers for commercial printing, offices, schools, and business applications. It also provides uncoated fine papers; flexible packaging papers; wet waxed papers; and interleaver papers, taffy wraps, overwraps, and confectionery wraps. The company was founded in 1929 and is based in Peshtigo, Wisconsin.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WI",
        "city": "Peshtigo",
        "zipcode": "54157",
        "website": "http://www.bpmpaper.com",
        "market_cap": "Small Cap"
    },
    "CLW": {
        "short_name": "Clearwater Paper Corporation",
        "long_name": "Clearwater Paper Corporation",
        "summary": "Clearwater Paper Corporation produces and sells private label tissue and bleached paperboard products in the United States and internationally. The company operates through two segments, Consumer Products, and Pulp and Paperboard. The Consumer Products segment manufactures and sells a line of at-home tissue products, including bath tissues, paper towels, facial tissues, and napkins; recycled fiber value grade products; and away-from-home products and parent rolls. This segment sells its products to retailers and wholesale distributors, including grocery, drug, mass merchants, and discount stores. The Pulp and Paperboard segment manufactures and markets bleached paperboard, folding cartons, liquid packaging, cups and plates, blister and carded packaging, top sheet and commercial printing grades and softwood pulp products, as well as offers custom sheeting, slitting and cutting of paperboard. It sells its products to packaging converters, folding carton converters, merchants, and commercial printers. Clearwater Paper Corporation was incorporated in 2005 and is headquartered in Spokane, Washington.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "WA",
        "city": "Spokane",
        "zipcode": "99201",
        "website": "http://www.clearwaterpaper.com",
        "market_cap": "Small Cap"
    },
    "G2K1.F": {
        "short_name": "DOMTAR CORP. NEW  DL-,01",
        "long_name": "Domtar Corporation",
        "summary": "Domtar Corporation designs, manufactures, markets, and distributes communication papers, specialty and packaging papers, and absorbent hygiene products in the United States, Canada, Europe, Asia, and internationally. It operates through two segments, Pulp and Paper, and Personal Care. The company provides business papers, including copy and electronic imaging papers used in inkjet and laser printers, photocopiers, and plain-paper fax machines, as well as computer papers, preprinted forms, and digital papers for office and home use. It also offers commercial printing and publishing papers, such as offset papers and opaques used in sheet and roll fed offset presses; publishing papers, which include tradebook and lightweight uncoated papers for publishing textbooks, dictionaries, catalogs, magazines, hard cover novels, and financial documents; and converting papers for envelopes, tablets, business forms, and data processing/computer forms. In addition, the company provides papers for thermal printing, flexible packaging, food packaging, medical packaging, medical gowns and drapes, sandpaper backing, carbonless printing, labels and other coating, and laminating applications; and papers for industrial and specialty applications, such as carrier papers, treated papers, security papers, and specialized printing and converting applications. Further, it offers absorbent hygiene products, including absorbent briefs, protective underwear, underpads, pads, washcloths, and body patches under the Attends, Indasec, IndasSlip, and Reassure brands; and baby diapers, training and youth pants, and bed mats under the Comfees, Chelino, Nene, and Bambino brand names. The company serves merchants, retail outlets, stationers, printers, publishers, converters, and end-users. Domtar Corporation was founded in 1848 and is based in Fort Mill, South Carolina.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "SC",
        "city": "Fort Mill",
        "zipcode": "29715",
        "website": "http://www.domtar.com",
        "market_cap": "Mid Cap"
    },
    "GLN.F": {
        "short_name": "GLATFELTER CORP.  DL-,01",
        "long_name": "Glatfelter Corporation",
        "summary": "Glatfelter Corporation, together with its subsidiaries, manufactures and sells engineered materials worldwide. It operated through two segments, Composite Fibers and Airlaid Materials. The company's Composite Fibers segment offers food and beverage filtration materials for single-serve coffee and tea products; wallcover base materials for wallpaper manufacturers; metallized products that are used in labels, packaging liners, gift wrap, and other consumer product applications; composite laminate, consisting of decorative laminates for use in furniture, household and commercial flooring, and other applications; and specialty engineered products, which are used in electrical energy storage, homecare, hygiene, and other engineered fiber-based applications. Its Advanced Airlaid Materials segment supplies absorbent cellulose-based airlaid nonwoven materials that are used to manufacture consumer products, such as feminine hygiene and other hygiene products, specialty wipes, tabletop, adult incontinence, home care, and other consumer and industrial products. The company markets its products directly, as well as through brokers and agents. The company was formerly known as P. H. Glatfelter Company. Glatfelter Corporation was founded in 1864 and is headquartered in Charlotte, North Carolina.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NC",
        "city": "Charlotte",
        "zipcode": "28209",
        "website": "http://www.glatfelter.com",
        "market_cap": "Small Cap"
    },
    "GLT": {
        "short_name": "Glatfelter Corporation",
        "long_name": "Glatfelter Corporation",
        "summary": "Glatfelter Corporation, together with its subsidiaries, manufactures and sells engineered materials worldwide. It operated through two segments, Composite Fibers and Airlaid Materials. The company's Composite Fibers segment offers food and beverage filtration materials for single-serve coffee and tea products; wallcover base materials for wallpaper manufacturers; metallized products that are used in labels, packaging liners, gift wrap, and other consumer product applications; composite laminate, consisting of decorative laminates for use in furniture, household and commercial flooring, and other applications; and specialty engineered products, which are used in electrical energy storage, homecare, hygiene, and other engineered fiber-based applications. Its Advanced Airlaid Materials segment supplies absorbent cellulose-based airlaid nonwoven materials that are used to manufacture consumer products, such as feminine hygiene and other hygiene products, specialty wipes, tabletop, adult incontinence, home care, and other consumer and industrial products. The company markets its products directly, as well as through brokers and agents. The company was formerly known as P. H. Glatfelter Company. Glatfelter Corporation was founded in 1864 and is headquartered in Charlotte, North Carolina.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NC",
        "city": "Charlotte",
        "zipcode": "28209",
        "website": "http://www.glatfelter.com",
        "market_cap": "Small Cap"
    },
    "MH2.F": {
        "short_name": "SCHWEITZER MAUDUIT DL-,10",
        "long_name": "Schweitzer-Mauduit International, Inc.",
        "summary": "Schweitzer-Mauduit International, Inc., together with its subsidiaries, provides engineered solutions and advanced materials for various industries worldwide. It operates through two segments, Advanced Materials & Structures and Engineered Papers. The Advanced Materials & Structures segment manufactures and sells resin-based rolled goods, such as nets, films, and meltblown materials for filtration, transportation, construction and infrastructure, medical, and industrial end-markets. The Engineered Papers segment provides low ignition propensity cigarette papers that are designed to self-extinguish when not actively being smoked; reconstituted tobacco, and wrapper and binder products use in machine-made cigars; alkaline battery separator papers; and commodity paper grades for printing and writing, flooring laminates, and food service packaging. The company was incorporated in 1995 and is headquartered in Alpharetta, Georgia.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "GA",
        "city": "Alpharetta",
        "zipcode": "30022-8246",
        "website": "http://www.swmintl.com",
        "market_cap": "Small Cap"
    },
    "NP": {
        "short_name": "Neenah, Inc.",
        "long_name": "Neenah, Inc.",
        "summary": "Neenah, Inc., a specialty materials company, produces and sells performance-based technical products, and fine paper and packaging products worldwide. Its Technical Products segment offers filtration media for transportation, water, and other end use applications; saturated and unsaturated crepe, and flat paper tapes; and coated lightweight abrasive papers for automotive, construction, metal, and woodworking industries. It also provides digital transfer media; label and tag products for digital printing; latex saturated and coated, premask, medical packaging, digital transfer, publishing, security, clean room and durable printing, and release papers; and furniture backers. The company's Fine Paper and Packaging segment provides writing, text, cover, and specialty papers; and envelopes used in commercial printing services, corporate identity packages, and advertising collaterals. It also provides packaging products for retail, cosmetics, spirits, and electronics end-use markets; bright papers for direct mails, advertising inserts, scrapbooks, and marketing collaterals; business papers for professionals and small businesses; translucent and art papers; and papers for optical scanning and other specialized applications. The company markets its products under the JET-PRO SofStretch, KIMDURA, PREVAIL, NEENAH, GESSNER, CLASSIC, CLASSIC CREST, ENVIRONMENT, ROYAL SUNDANCE, SOUTHWORTH, TOUCHE, SO...SILK, PLIKE, STARDREAM, CONVERD, ESTATE LABEL, SKIVERTEX, KIVAR, ASTROBRIGHTS, and NEENAH IMAGEMAX brand names through authorized paper distributors, converters, retailers, and specialty businesses, as well as direct to end users. The company was formerly known as Neenah Paper, Inc. and changed its name to Neenah, Inc. in January 2018. Neenah, Inc. was incorporated in 2004 and is headquartered in Alpharetta, Georgia.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Alpharetta",
        "zipcode": "30005",
        "website": "http://www.neenah.com",
        "market_cap": "Small Cap"
    },
    "NQI.F": {
        "short_name": "NEENAH INC.  DL -,01",
        "long_name": "Neenah, Inc.",
        "summary": "Neenah, Inc., a specialty materials company, produces and sells performance-based technical products, and fine paper and packaging products worldwide. Its Technical Products segment offers filtration media for transportation, water, and other end use applications; saturated and unsaturated crepe, and flat paper tapes; and coated lightweight abrasive papers for automotive, construction, metal, and woodworking industries. It also provides digital transfer media; label and tag products for digital printing; latex saturated and coated, premask, medical packaging, digital transfer, publishing, security, clean room and durable printing, and release papers; and furniture backers. The company's Fine Paper and Packaging segment provides writing, text, cover, and specialty papers; and envelopes used in commercial printing services, corporate identity packages, and advertising collaterals. It also provides packaging products for retail, cosmetics, spirits, and electronics end-use markets; bright papers for direct mails, advertising inserts, scrapbooks, and marketing collaterals; business papers for professionals and small businesses; translucent and art papers; and papers for optical scanning and other specialized applications. The company markets its products under the JET-PRO SofStretch, KIMDURA, PREVAIL, NEENAH, GESSNER, CLASSIC, CLASSIC CREST, ENVIRONMENT, ROYAL SUNDANCE, SOUTHWORTH, TOUCHE, SO...SILK, PLIKE, STARDREAM, CONVERD, ESTATE LABEL, SKIVERTEX, KIVAR, ASTROBRIGHTS, and NEENAH IMAGEMAX brand names through authorized paper distributors, converters, retailers, and specialty businesses, as well as direct to end users. The company was formerly known as Neenah Paper, Inc. and changed its name to Neenah, Inc. in January 2018. Neenah, Inc. was incorporated in 2004 and is headquartered in Alpharetta, Georgia.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "GA",
        "city": "Alpharetta",
        "zipcode": "30005",
        "website": "http://www.neenah.com",
        "market_cap": "Small Cap"
    },
    "SGMD": {
        "short_name": "SUGARMADE INC",
        "long_name": "Sugarmade, Inc.",
        "summary": "Sugarmade, Inc. engages in the paper and paper-based product business. The company operates through three segments: Paper and Paper-Based Products, Non-Medical Supplies, and Cannabis Products Delivery Service and Sales. It supplies products to quick service restaurants, as well as imports, distributes, and markets hydroponic supplies to various agricultural sectors. The company also produces and wholesales custom printed and generic supplies, such as double poly paper cups for cold beverage; and disposable, clear, and plastic cold cups, and paper coffee cups, yogurt cups, ice cream cups, cup lids, cup sleeves, edible packaging, food containers, soup containers, plastic spoons, and other related products. In addition, it offers non-medical personal protective equipment and non-medical facial masks. Further, the company operates the cannabis products delivery and sale services under the BudCars name. It also offers its products through www.CarryOutSupplies.com website. Sugarmade, Inc. was founded in 2009 and is based in Monrovia, California.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Monrovia",
        "zipcode": "91016",
        "website": "http://www.sugarmade.com",
        "market_cap": "Small Cap"
    },
    "SWM": {
        "short_name": "Schweitzer-Mauduit Internationa",
        "long_name": "Schweitzer-Mauduit International, Inc.",
        "summary": "Schweitzer-Mauduit International, Inc., together with its subsidiaries, provides engineered solutions and advanced materials for various industries worldwide. It operates through two segments, Advanced Materials & Structures and Engineered Papers. The Advanced Materials & Structures segment manufactures and sells resin-based rolled goods, such as nets, films, and meltblown materials for filtration, transportation, construction and infrastructure, medical, and industrial end-markets. The Engineered Papers segment provides low ignition propensity cigarette papers that are designed to self-extinguish when not actively being smoked; reconstituted tobacco, and wrapper and binder products use in machine-made cigars; alkaline battery separator papers; and commodity paper grades for printing and writing, flooring laminates, and food service packaging. The company was incorporated in 1995 and is headquartered in Alpharetta, Georgia.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Alpharetta",
        "zipcode": "30022-8246",
        "website": "http://www.swmintl.com",
        "market_cap": "Small Cap"
    },
    "UFS": {
        "short_name": "Domtar Corporation (NEW)",
        "long_name": "Domtar Corporation",
        "summary": "Domtar Corporation designs, manufactures, markets, and distributes communication papers, specialty and packaging papers, and absorbent hygiene products in the United States, Canada, Europe, Asia, and internationally. It operates through two segments, Pulp and Paper, and Personal Care. The company provides business papers, including copy and electronic imaging papers used in inkjet and laser printers, photocopiers, and plain-paper fax machines, as well as computer papers, preprinted forms, and digital papers for office and home use. It also offers commercial printing and publishing papers, such as offset papers and opaques used in sheet and roll fed offset presses; publishing papers, which include tradebook and lightweight uncoated papers for publishing textbooks, dictionaries, catalogs, magazines, hard cover novels, and financial documents; and converting papers for envelopes, tablets, business forms, and data processing/computer forms. In addition, the company provides papers for thermal printing, flexible packaging, food packaging, medical packaging, medical gowns and drapes, sandpaper backing, carbonless printing, labels and other coating, and laminating applications; and papers for industrial and specialty applications, such as carrier papers, treated papers, security papers, and specialized printing and converting applications. Further, it offers absorbent hygiene products, including absorbent briefs, protective underwear, underpads, pads, washcloths, and body patches under the Attends, Indasec, IndasSlip, and Reassure brands; and baby diapers, training and youth pants, and bed mats under the Comfees, Chelino, Nene, and Bambino brand names. The company serves merchants, retail outlets, stationers, printers, publishers, converters, and end-users. Domtar Corporation was founded in 1848 and is based in Fort Mill, South Carolina.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "SC",
        "city": "Fort Mill",
        "zipcode": "29715",
        "website": "http://www.domtar.com",
        "market_cap": "Mid Cap"
    },
    "UFS.TO": {
        "short_name": "DOMTAR CORPORATION",
        "long_name": "Domtar Corporation",
        "summary": "Domtar Corporation designs, manufactures, markets, and distributes communication papers, specialty and packaging papers, and absorbent hygiene products in the United States, Canada, Europe, Asia, and internationally. It operates through two segments, Pulp and Paper, and Personal Care. The company provides business papers, including copy and electronic imaging papers used in inkjet and laser printers, photocopiers, and plain-paper fax machines, as well as computer papers, preprinted forms, and digital papers for office and home use. It also offers commercial printing and publishing papers, such as offset papers and opaques used in sheet and roll fed offset presses; publishing papers, which include tradebook and lightweight uncoated papers for publishing textbooks, dictionaries, catalogs, magazines, hard cover novels, and financial documents; and converting papers for envelopes, tablets, business forms, and data processing/computer forms. In addition, the company provides papers for thermal printing, flexible packaging, food packaging, medical packaging, medical gowns and drapes, sandpaper backing, carbonless printing, labels and other coating, and laminating applications; and papers for industrial and specialty applications, such as carrier papers, treated papers, security papers, and specialized printing and converting applications. Further, it offers absorbent hygiene products, including absorbent briefs, protective underwear, underpads, pads, washcloths, and body patches under the Attends, Indasec, IndasSlip, and Reassure brands; and baby diapers, training and youth pants, and bed mats under the Comfees, Chelino, Nene, and Bambino brand names. The company serves merchants, retail outlets, stationers, printers, publishers, converters, and end-users. Domtar Corporation was founded in 1848 and is based in Fort Mill, South Carolina.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "United States",
        "state": "SC",
        "city": "Fort Mill",
        "zipcode": "29715",
        "website": "http://www.domtar.com",
        "market_cap": "Mid Cap"
    },
    "VRS": {
        "short_name": "Verso Corporation",
        "long_name": "Verso Corporation",
        "summary": "Verso Corporation produces and sells coated papers in North America. It operates through two segments, Paper and Pulp. The company offers coated freesheet and coated groundwood, specialty, packaging, inkjet and digital, supercalendered, and uncoated freesheet papers; and bleached and unbleached market kraft pulp to manufacture printing, writing, and tissue products. Its paper products are used primarily in media and marketing applications, including catalogs, magazines, and commercial printing applications, such as high-end advertising brochures, annual reports, and direct-mail advertising; and specialty applications comprising flexible packaging, and label and converting. The company was formerly known as Verso Paper Corp. and changed its name to Verso Corporation in January 2015. Verso Corporation was founded in 2006 and is headquartered in Miamisburg, Ohio.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Miamisburg",
        "zipcode": "45342",
        "website": "http://www.versoco.com",
        "market_cap": "Small Cap"
    },
    "ZCOM": {
        "short_name": "IMPRESO.COM INC",
        "long_name": "Impreso, Inc.",
        "summary": "Impreso, Inc. manufactures and distributes various paper and film products for commercial and home use in the United States and internationally. Its products include engineering rolls, wide format ink jet media, desk top ink jet media, computer paper, jumbo laser rolls, laser cut sheets, thermal fax paper, copy paper, POS, add rolls, ribbons, cleaning cards, and laser and inkjet cartridges, as well as labels, tags, and tickets. The company also produces custom private label bottled water; and operates an online web reference directory. It manufactures and distributes its products under the Alliance label, Impreso label, OEM brands, and other private labels. Impreso, Inc. markets its products to dealers and other resellers. The company was founded in 1976 and is headquartered in Coppell, Texas.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Coppell",
        "zipcode": "75019",
        "website": "http://www.tstimpreso.com",
        "market_cap": "Small Cap"
    }
}