{
    "18G.F": {
        "short_name": "ITACONIX PLC",
        "long_name": "Itaconix plc",
        "summary": "Itaconix plc, together with its subsidiaries, designs, develops, manufactures, and sells bio-based polymers for personal care, home care, and industrial sectors in North America and Europe. The company's home care and industrial products include Itaconix TSI, Itaconix DSP, Itaconix CHT, and Itaconix VELASOFT water soluble polymers; and Itaconix ZINADOR 22L and 35L, which are water soluble odor neutralizers. Its personal care products comprise Itaconix VELAFRESH ZP20 and ZP30 that are water soluble fixating complexes; and Nouryon Amaze SP, a hair styling ingredient. The company was formerly known as Revolymer plc and changed its name to Itaconix plc in February 2017. Itaconix plc was incorporated in 2012 and is headquartered in Stratham, New Hampshire.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NH",
        "city": "Stratham",
        "zipcode": "03885",
        "website": "http://www.itaconix.com",
        "market_cap": 62885252
    },
    "2CU.F": {
        "short_name": "CHEMOURS CO.  DL-,01",
        "long_name": "The Chemours Company",
        "summary": "The Chemours Company provides performance chemicals in North America, the Asia Pacific, Europe, the Middle East, Africa, and Latin America. It operates through four segments: Titanium Technologies, Thermal & Specialized Solutions, Advanced Performance Materials, and Chemical Solutions. The Titanium Technologies segment provides TiO2 pigment under the Ti-Pure and BaiMax brands for delivering whiteness, brightness, opacity, and protection in various of applications. The Thermal & Specialized Solutions segment offers of refrigerants, propellants, blowing agents, and specialty solvents. The Advanced Performance Materials segment provides polymers and advanced materials. Its Chemical Solutions segment offers industrial chemicals used in gold production, industrial, and consumer applications. The company sells its products through direct channels, as well as through a network of resellers and distributors. The Chemours Company was founded in 2014 and is headquartered in Wilmington, Delaware.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "DE",
        "city": "Wilmington",
        "zipcode": "19899",
        "website": "http://www.chemours.com",
        "market_cap": 5085976064
    },
    "3A01.F": {
        "short_name": "AMYRIS BIOTECHN. DL-,0001",
        "long_name": "Amyris, Inc.",
        "summary": "Amyris, Inc., a synthetic biotechnology company, operates in the clean health and beauty markets through its consumer brands and as a supplier of sustainable and natural ingredients in Europe, the United States, Asia, Brazil, and internationally. It manufactures and sells products for the health and wellness, clean beauty, and flavor and fragrance markets. The company operates under the Amyris, Biofene, Biossance, Pipette, Purecane, and No Compromise trademarks. Amyris, Inc. has a collaboration agreement with the Infectious Disease Research Institute to advance a novel ribonucleic acid vaccine platform, including accelerating the development of a COVID-19 vaccine. The company was formerly known as Amyris Biotechnologies, Inc. and changed its name to Amyris, Inc. in June 2010. Amyris, Inc. was incorporated in 2003 and is headquartered in Emeryville, California.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "EmeryVille",
        "zipcode": "94608",
        "website": "http://www.amyris.com",
        "market_cap": 2766760448
    },
    "8LV.F": {
        "short_name": "LIVENT CORP.",
        "long_name": "Livent Corporation",
        "summary": "Livent Corporation manufactures and sells performance lithium compounds primarily used in lithium-based batteries, specialty polymers, and chemical synthesis applications in North America, Latin America, Europe, the Middle East, Africa, and the Asia Pacific. The company offers lithium compounds for use in applications that have specific performance requirements, including battery-grade lithium hydroxide for use in high performance lithium-ion batteries; and butyllithium, which is used in the production of polymers and pharmaceutical products, as well as a range of specialty lithium compounds, including high purity lithium metal, which is used in the production of lightweight materials for aerospace applications and non-rechargeable batteries. It also provides lithium phosphate, pharmaceutical-grade lithium carbonate, high purity lithium chloride, and specialty organics; and lithium carbonate and lithium chloride for use as feedstock in the process of producing performance lithium compounds. The company was incorporated in 2018 and is headquartered in Philadelphia, Pennsylvania.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "Philadelphia",
        "zipcode": "19104",
        "website": "http://www.livent.com",
        "market_cap": 2401430272
    },
    "96S.F": {
        "short_name": "STEPAN CO.  DL 1",
        "long_name": "Stepan Company",
        "summary": "Stepan Company, together with its subsidiaries, produces and sells specialty and intermediate chemicals to other manufacturers for use in various end products in North America, Europe, Latin America, and Asia. The company operates through three segments: Surfactants, Polymers, and Specialty Products. The Surfactants segment offers surfactants that are used as principal ingredients in consumer and industrial cleaning products, including detergents for washing clothes, dishes, carpets, and floors and walls, as well as shampoos and body washes; and other applications, such as fabric softeners, germicidal quaternary compounds, and lubricating ingredients. Its surfactants are also used in various applications, including emulsifiers for spreading agricultural products; and industrial applications comprising latex systems, plastics, and composites. The Polymers segment provides polyurethane polyols that are used in the manufacture of rigid foam for thermal insulation in the construction industry, as well as a base raw material for coatings, adhesives, sealants, and elastomers (CASE); polyester resins, including liquid and powdered products, which are used in CASE applications; and phthalic anhydride that is used in unsaturated polyester resins, alkyd resins, and plasticizers for applications in construction materials, as well as components of automotive, boating, and other consumer products. The Specialty Products segment offers flavors, emulsifiers, and solubilizers for use in the food, flavoring, nutritional supplement, and pharmaceutical applications. Stepan Company was founded in 1932 and is headquartered in Northfield, Illinois.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "IL",
        "city": "Northfield",
        "zipcode": "60093",
        "website": "http://www.stepan.com",
        "market_cap": 2447420416
    },
    "9AX.F": {
        "short_name": "AXALTA COATING SYSTEM.DL1",
        "long_name": "Axalta Coating Systems Ltd.",
        "summary": "Axalta Coating Systems Ltd., through its subsidiaries, manufactures, markets, and distributes high-performance coatings systems in North America, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. It operates through two segments, Performance Coatings and Transportation Coatings. The company offers water and solvent borne products and systems to repair damaged vehicles for independent body shops, multi-shop operators, and original equipment manufacturer (OEM) dealership body shops. It also provides functional and decorative liquid and powder coatings used in various industrial applications, including architectural cladding and fittings, automotive coatings, general industrial, job coaters, electrical insulation coatings, HVAC, appliances, industrial wood, coil, rebar, and oil and gas pipelines; and wood coatings for building product, cabinet, flooring, and furniture markets under the Voltatex, AquaEC, Durapon, Hydropon, UNRIVALED, Tufcote, and Ceranamel for liquid coatings; and Alesta, Nap-Gard, Abcite, and Plascoat brands for powder coatings. In addition, the company develops and supplies electrocoat, primer, basecoat, and clearcoat products for OEMs of light and commercial vehicles; and various coatings systems for various commercial applications, including HDT, bus, and rail under the Imron, Imron Elite, Centari, Rival, Corlar epoxy undercoats, and AquaEC brands; and sells and ships its products to light vehicle OEM customers. It also sells its product under the Audurra, Challenger, Chemophan, ColorNet, Cromax, Cromax Mosaic, Durapon 70, Duxone, Harmonized Coating Technologies, Imron ExcelPro, Lutophen, Nason, Spies Hecker, Standox, Stollaquid, Syntopal, Syrox, and Vermeera brand names. The company was formerly known as Axalta Coating Systems Bermuda Co., Ltd. and changed its name to Axalta Coating Systems Ltd. in August 2014. Axalta Coating Systems Ltd. was founded in 1866 and is headquartered in Philadelphia, Pennsylvania.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "Philadelphia",
        "zipcode": "19103",
        "website": "http://www.axalta.com",
        "market_cap": 6070674944
    },
    "A1LB34.SA": {
        "short_name": "ALBEMARLE CODRN",
        "long_name": "Albemarle Corporation",
        "summary": "Albemarle Corporation develops, manufactures, and markets engineered specialty chemicals worldwide. It operates through three segments: Lithium, Bromine Specialties, and Catalysts. The Lithium segment offers lithium compounds, including lithium carbonate, lithium hydroxide, lithium chloride, and lithium specialties; and reagents, such as butyllithium and lithium aluminum hydride for use in lithium batteries for consumer electronics and electric vehicles, high performance greases, thermoplastic elastomers for car tires, rubber soles, plastic bottles, catalysts for chemical reactions, organic synthesis processes in the areas of steroid chemistry and vitamins, life sciences, pharmaceutical industry, and other markets. It also provides cesium products for the chemical and pharmaceutical industries; zirconium, barium, and titanium products for pyrotechnical applications; technical services for the handling and use of reactive lithium products; and lithium-containing by-products recycling services. The Bromine Specialties segment offers bromine and bromine-based fire safety solutions; specialty chemicals, including elemental bromine, alkyl and inorganic bromides, brominated powdered activated carbon, and other bromine fine chemicals for use in chemical synthesis, oil and gas well drilling and completion fluids, mercury control, water purification, beef and poultry processing, and other industrial applications; and other specialty chemicals, such as tertiary amines, biocides, disinfectants, and sanitizers. The Catalysts segment provides hydroprocessing, isomerization, and akylation catalysts; fluidized catalytic cracking catalysts and additives; and organometallics and curatives. The company serves the energy storage, petroleum refining, consumer electronics, construction, automotive, lubricants, pharmaceuticals, crop protection, and custom chemistry services markets. Albemarle Corporation was founded in 1887 and is headquartered in Charlotte, North Carolina.",
        "currency": "BRL",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "NC",
        "city": "Charlotte",
        "zipcode": "28209",
        "website": "http://www.albemarle.com",
        "market_cap": 99907551232
    },
    "A34.F": {
        "short_name": "TRECORA RES  DL-,10",
        "long_name": "Trecora Resources",
        "summary": "Trecora Resources primarily manufactures and sells various specialty petrochemicals products and specialty waxes in the United States. The company operates through two segments, Specialty Petrochemicals and Specialty Waxes. The Specialty Petrochemicals segment offers hydrocarbons and other petroleum based products, such as isopentane, normal pentane, isohexane, and hexane used in the production of polyethylene, packaging, polypropylene, expandable polystyrene, poly-iso/urethane foams, and crude oil from the Canadian tar sands, as well as in the catalyst support industry. It also owns and operates natural gas pipelines. The Specialty Waxes segment provides specialty polyethylene waxes for use in the paints and inks, adhesives, coatings, and PVC lubricants markets; and specialized synthetic poly alpha olefin waxes for use as toner in printers and as additives for candles. This segment also provides custom processing services. The company was formerly known as Arabian American Development Company and changed its name to Trecora Resources in June 2014. Trecora Resources was founded in 1967 and is based in Sugar Land, Texas.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Sugar Land",
        "zipcode": "77478",
        "website": "http://www.trecora.com",
        "market_cap": 168787808
    },
    "ABLT": {
        "short_name": "AMERICAN BILTRITE INC",
        "long_name": "American Biltrite Inc.",
        "summary": "American Biltrite Inc., together with its subsidiaries, provides tape, jewelry, flooring, and rubber products worldwide. The company produces and offers pressure sensitive tapes, films, and protective sheeting under the American Biltrite and Ideal brands, which are used in various markets, such as automotive and transportation; construction; shoe/footwear; graphic arts, print, and signage; and various other industrial and consumer applications. It also manufactures and distributes commercial flooring primarily for healthcare, educational, and institutional sectors; and performance sheet rubber in North America, as well as designs and supplies fashion jewelry to department stores under the brands of Guess, T Tahari, Robert Rose, Berry, and Jessica McClintock. The company sells its tape products through sales organizations, distributors, and select manufacturers' representatives. American Biltrite Inc. was founded in 1908 and is based in Wellesley Hills, Massachusetts.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MA",
        "city": "Wellesley Hills",
        "zipcode": "02481-2097",
        "website": "http://www.ambilt.com",
        "market_cap": 14117400
    },
    "AHT.F": {
        "short_name": "ASHLAND GLB.HLDGS DL-,01",
        "long_name": "Ashland Global Holdings Inc.",
        "summary": "Ashland Global Holdings Inc. provides specialty chemical solutions worldwide. The company's Specialty Ingredients segment offers products, technologies, and resources for solving formulation and product-performance challenges. It provides solutions using natural, synthetic, and semisynthetic polymers derived from cellulose ethers, vinyl pyrrolidones, acrylic polymers, polyester and polyurethane-based adhesives, and plant and seed extracts. This segment offers its solutions for the pharmaceutical companies; makers of personal care products, food, and beverages; makers of nutraceuticals and supplements; manufacturers of paint, coatings, and construction materials; packaging and converting markets; and oilfield service companies. Its Intermediates and Solvents produces 1,4 butanediol and related derivatives, including n-methylpyrrolidone that are used as chemical intermediates in the production of engineering polymers and polyurethanes, as well as specialty process solvents used in electronics, pharmaceuticals, water filtration membranes, and others. The company was formerly known as Ashland Inc. and changed its name to Ashland Global Holdings Inc. in September 2016. Ashland Global Holdings Inc. was founded in 1924 and is headquartered in Covington, Kentucky.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "KY",
        "city": "Covington",
        "zipcode": "41011",
        "website": "http://www.ashland.com",
        "market_cap": 4722696704
    },
    "AHUH.F": {
        "short_name": "SIXTH WAVE INNOVATIONS",
        "long_name": "Sixth Wave Innovations Inc.",
        "summary": "Sixth Wave Innovations Inc., a development stage nanotechnology company, focuses on the extraction and detection of target substances at the molecular level using specialized molecularly imprinted polymers. It is in the process of commercializing its Affinity cannabinoid purification system; and IXOS, a line of extraction polymers for the gold mining industry. The company was formerly known as Atom Energy Inc. and changed its name to Sixth Wave Innovations Inc. in August 2019. Sixth Wave Innovations Inc. was incorporated in 2007 and is headquartered in Salt Lake City, Utah.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "UT",
        "city": "Salt Lake City",
        "zipcode": "84108",
        "website": "http://sixthwave.com",
        "market_cap": 18096270
    },
    "AJX.AX": {
        "short_name": "ALEXIUM FPO",
        "long_name": "Alexium International Group Limited",
        "summary": "Alexium International Group Limited develops and sells specialty chemicals and solutions in Australia, the United States, and Cyprus. It offers flame retardant (FR) treatments, including Alexiflam FR for use in synthetic and synthetic-blend fabrics; Alexiflam NF for use in cotton and cotton-blends; and Alexicool, a chemical finish for fabrics. Its products are used in defense applications; and consumer applications, such as automotive and transportation, and bedding. The company is based in Greer, South Carolina.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "ASX",
        "market": "au_market",
        "country": "United States",
        "state": "SC",
        "city": "Greer",
        "zipcode": "29650",
        "website": "http://www.alexiuminternational.com",
        "market_cap": 32676750
    },
    "ALB.MX": {
        "short_name": "ALBEMARLE CORP",
        "long_name": "Albemarle Corporation",
        "summary": "Albemarle Corporation develops, manufactures, and markets engineered specialty chemicals worldwide. It operates through three segments: Lithium, Bromine Specialties, and Catalysts. The Lithium segment offers lithium compounds, including lithium carbonate, lithium hydroxide, lithium chloride, and lithium specialties; and reagents, such as butyllithium and lithium aluminum hydride for use in lithium batteries for consumer electronics and electric vehicles, high performance greases, thermoplastic elastomers for car tires, rubber soles, plastic bottles, catalysts for chemical reactions, organic synthesis processes in the areas of steroid chemistry and vitamins, life sciences, pharmaceutical industry, and other markets. It also provides cesium products for the chemical and pharmaceutical industries; zirconium, barium, and titanium products for pyrotechnical applications; technical services for the handling and use of reactive lithium products; and lithium-containing by-products recycling services. The Bromine Specialties segment offers bromine and bromine-based fire safety solutions; specialty chemicals, including elemental bromine, alkyl and inorganic bromides, brominated powdered activated carbon, and other bromine fine chemicals for use in chemical synthesis, oil and gas well drilling and completion fluids, mercury control, water purification, beef and poultry processing, and other industrial applications; and other specialty chemicals, such as tertiary amines, biocides, disinfectants, and sanitizers. The Catalysts segment provides hydroprocessing, isomerization, and akylation catalysts; fluidized catalytic cracking catalysts and additives; and organometallics and curatives. The company serves the energy storage, petroleum refining, consumer electronics, construction, automotive, lubricants, pharmaceuticals, crop protection, and custom chemistry services markets. Albemarle Corporation was founded in 1887 and is headquartered in Charlotte, North Carolina.",
        "currency": "MXN",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "NC",
        "city": "Charlotte",
        "zipcode": "28209",
        "website": "http://www.albemarle.com",
        "market_cap": 386578153472
    },
    "ALB": {
        "short_name": "Albemarle Corporation",
        "long_name": "Albemarle Corporation",
        "summary": "Albemarle Corporation develops, manufactures, and markets engineered specialty chemicals worldwide. It operates through three segments: Lithium, Bromine Specialties, and Catalysts. The Lithium segment offers lithium compounds, including lithium carbonate, lithium hydroxide, lithium chloride, and lithium specialties; and reagents, such as butyllithium and lithium aluminum hydride for use in lithium batteries for consumer electronics and electric vehicles, high performance greases, thermoplastic elastomers for car tires, rubber soles, plastic bottles, catalysts for chemical reactions, organic synthesis processes in the areas of steroid chemistry and vitamins, life sciences, pharmaceutical industry, and other markets. It also provides cesium products for the chemical and pharmaceutical industries; zirconium, barium, and titanium products for pyrotechnical applications; technical services for the handling and use of reactive lithium products; and lithium-containing by-products recycling services. The Bromine Specialties segment offers bromine and bromine-based fire safety solutions; specialty chemicals, including elemental bromine, alkyl and inorganic bromides, brominated powdered activated carbon, and other bromine fine chemicals for use in chemical synthesis, oil and gas well drilling and completion fluids, mercury control, water purification, beef and poultry processing, and other industrial applications; and other specialty chemicals, such as tertiary amines, biocides, disinfectants, and sanitizers. The Catalysts segment provides hydroprocessing, isomerization, and akylation catalysts; fluidized catalytic cracking catalysts and additives; and organometallics and curatives. The company serves the energy storage, petroleum refining, consumer electronics, construction, automotive, lubricants, pharmaceuticals, crop protection, and custom chemistry services markets. Albemarle Corporation was founded in 1887 and is headquartered in Charlotte, North Carolina.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NC",
        "city": "Charlotte",
        "zipcode": "28209",
        "website": "http://www.albemarle.com",
        "market_cap": 18614824960
    },
    "ALBE.VI": {
        "short_name": "ALBEMARLE CORP",
        "long_name": "Albemarle Corporation",
        "summary": "Albemarle Corporation develops, manufactures, and markets engineered specialty chemicals worldwide. It operates through three segments: Lithium, Bromine Specialties, and Catalysts. The Lithium segment offers lithium compounds, including lithium carbonate, lithium hydroxide, lithium chloride, and lithium specialties; and reagents, such as butyllithium and lithium aluminum hydride for use in lithium batteries for consumer electronics and electric vehicles, high performance greases, thermoplastic elastomers for car tires, rubber soles, plastic bottles, catalysts for chemical reactions, organic synthesis processes in the areas of steroid chemistry and vitamins, life sciences, pharmaceutical industry, and other markets. It also provides cesium products for the chemical and pharmaceutical industries; zirconium, barium, and titanium products for pyrotechnical applications; technical services for the handling and use of reactive lithium products; and lithium-containing by-products recycling services. The Bromine Specialties segment offers bromine and bromine-based fire safety solutions; specialty chemicals, including elemental bromine, alkyl and inorganic bromides, brominated powdered activated carbon, and other bromine fine chemicals for use in chemical synthesis, oil and gas well drilling and completion fluids, mercury control, water purification, beef and poultry processing, and other industrial applications; and other specialty chemicals, such as tertiary amines, biocides, disinfectants, and sanitizers. The Catalysts segment provides hydroprocessing, isomerization, and akylation catalysts; fluidized catalytic cracking catalysts and additives; and organometallics and curatives. The company serves the energy storage, petroleum refining, consumer electronics, construction, automotive, lubricants, pharmaceuticals, crop protection, and custom chemistry services markets. Albemarle Corporation was founded in 1887 and is headquartered in Charlotte, North Carolina.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "NC",
        "city": "Charlotte",
        "zipcode": "28209",
        "website": "http://www.albemarle.com",
        "market_cap": 16307831808
    },
    "ALKN": {
        "short_name": "ALKANE INC",
        "long_name": "Alkane, Inc.",
        "summary": "Alkane, Inc. provides diesel additives for diesel powered engines. The company offers a multifunctional diesel additive for cars, trucks, and diesel bikes. It sells its products in Germany, Switzerland, France, Belgium, Austria, the Netherlands, Denmark, and the United Kingdom. The company is based in Lutherville, Maryland.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MD",
        "city": "Lutherville",
        "zipcode": "21093",
        "website": "http://www.monsterdiesel.com",
        "market_cap": 211683
    },
    "ALLM": {
        "short_name": "ALLIANCE BIOENERGY PLUS INC",
        "long_name": "Alliance Bioenergy Plus, Inc.",
        "summary": "Alliance Bioenergy Plus, Inc., through its subsidiaries, focuses on technologies in the renewable energy, biofuels, and bioplastics technologies sectors. It also holds license to the patented technology Cellulose-to-Sugar (CTS 2.0), a mechanical/chemical dry process for converting cellulose material into sugar for use in the biofuels industry. The company was formerly known as Alliance Media Group Holdings, Inc. and changed its name to Alliance Bioenergy Plus, Inc. in December 2014. Alliance Bioenergy Plus, Inc. was incorporated in 2012 and is based in Palm Beach Gardens, Florida.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Palm Beach Gardens",
        "zipcode": "33401",
        "website": "http://www.bluebiofuels.com",
        "market_cap": 82519280
    },
    "ALTO": {
        "short_name": "Alto Ingredients, Inc.",
        "long_name": "Alto Ingredients, Inc.",
        "summary": "Alto Ingredients, Inc. produces and markets specialty alcohols and essential ingredients in the United States. It operates in two segments, Production and Marketing. The company offers specialty alcohols used in mouthwash, cosmetics, pharmaceuticals, hand sanitizers, disinfectants, and cleaners; alcoholic beverages, flavor extracts, and vinegar, as well as corn germ used for corn oils and carbon dioxide. It also provides essential ingredients, such as dried yeast, corn gluten meal, corn gluten feed, distillers grains, and liquid feed used in commercial animal feed and pet food; and fuel-grade ethanol used as transportation fuel and distillers corn oil used as a biodiesel feedstock, as well as fuel-grade ethanol produced by third parties. In addition, the company offers transportation, storage, and delivery services through third-party service providers. It sells ethanol to integrated oil companies and gasoline marketers; essential ingredient feed products to dairies and feedlots; and corn oil to poultry and biodiesel customers. The company operates seven ethanol production facilities, including three plants in the Midwestern states of Illinois; and four plants located in the Western states of California, Oregon, and Idaho. The company was formerly known as Pacific Ethanol, Inc. and changed its name to Alto Ingredients, Inc. in January 2021. Alto Ingredients, Inc. was founded in 2003 and is headquartered in Sacramento, California.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Sacramento",
        "zipcode": "95814",
        "website": "http://www.altoingredients.com",
        "market_cap": 396988960
    },
    "AMC.F": {
        "short_name": "ALBEMARLE CORP.  DL-,01",
        "long_name": "Albemarle Corporation",
        "summary": "Albemarle Corporation develops, manufactures, and markets engineered specialty chemicals worldwide. It operates through three segments: Lithium, Bromine Specialties, and Catalysts. The Lithium segment offers lithium compounds, including lithium carbonate, lithium hydroxide, lithium chloride, and lithium specialties; and reagents, such as butyllithium and lithium aluminum hydride for use in lithium batteries for consumer electronics and electric vehicles, high performance greases, thermoplastic elastomers for car tires, rubber soles, plastic bottles, catalysts for chemical reactions, organic synthesis processes in the areas of steroid chemistry and vitamins, life sciences, pharmaceutical industry, and other markets. It also provides cesium products for the chemical and pharmaceutical industries; zirconium, barium, and titanium products for pyrotechnical applications; technical services for the handling and use of reactive lithium products; and lithium-containing by-products recycling services. The Bromine Specialties segment offers bromine and bromine-based fire safety solutions; specialty chemicals, including elemental bromine, alkyl and inorganic bromides, brominated powdered activated carbon, and other bromine fine chemicals for use in chemical synthesis, oil and gas well drilling and completion fluids, mercury control, water purification, beef and poultry processing, and other industrial applications; and other specialty chemicals, such as tertiary amines, biocides, disinfectants, and sanitizers. The Catalysts segment provides hydroprocessing, isomerization, and akylation catalysts; fluidized catalytic cracking catalysts and additives; and organometallics and curatives. The company serves the energy storage, petroleum refining, consumer electronics, construction, automotive, lubricants, pharmaceuticals, crop protection, and custom chemistry services markets. Albemarle Corporation was founded in 1887 and is headquartered in Charlotte, North Carolina.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NC",
        "city": "Charlotte",
        "zipcode": "28209",
        "website": "http://www.albemarle.com",
        "market_cap": 16524541952
    },
    "AMRS": {
        "short_name": "Amyris, Inc.",
        "long_name": "Amyris, Inc.",
        "summary": "Amyris, Inc., a synthetic biotechnology company, operates in the clean health and beauty markets through its consumer brands and as a supplier of sustainable and natural ingredients in Europe, the United States, Asia, Brazil, and internationally. It manufactures and sells products for the health and wellness, clean beauty, and flavor and fragrance markets. The company operates under the Amyris, Biofene, Biossance, Pipette, Purecane, and No Compromise trademarks. Amyris, Inc. has a collaboration agreement with the Infectious Disease Research Institute to advance a novel ribonucleic acid vaccine platform, including accelerating the development of a COVID-19 vaccine. The company was formerly known as Amyris Biotechnologies, Inc. and changed its name to Amyris, Inc. in June 2010. Amyris, Inc. was incorporated in 2003 and is headquartered in Emeryville, California.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "EmeryVille",
        "zipcode": "94608",
        "website": "http://www.amyris.com",
        "market_cap": 3530663424
    },
    "ASH": {
        "short_name": "Ashland Global Holdings Inc.",
        "long_name": "Ashland Global Holdings Inc.",
        "summary": "Ashland Global Holdings Inc. provides specialty chemical solutions worldwide. The company's Specialty Ingredients segment offers products, technologies, and resources for solving formulation and product-performance challenges. It provides solutions using natural, synthetic, and semisynthetic polymers derived from cellulose ethers, vinyl pyrrolidones, acrylic polymers, polyester and polyurethane-based adhesives, and plant and seed extracts. This segment offers its solutions for the pharmaceutical companies; makers of personal care products, food, and beverages; makers of nutraceuticals and supplements; manufacturers of paint, coatings, and construction materials; packaging and converting markets; and oilfield service companies. Its Intermediates and Solvents produces 1,4 butanediol and related derivatives, including n-methylpyrrolidone that are used as chemical intermediates in the production of engineering polymers and polyurethanes, as well as specialty process solvents used in electronics, pharmaceuticals, water filtration membranes, and others. The company was formerly known as Ashland Inc. and changed its name to Ashland Global Holdings Inc. in September 2016. Ashland Global Holdings Inc. was founded in 1924 and is headquartered in Covington, Kentucky.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "KY",
        "city": "Covington",
        "zipcode": "41011",
        "website": "http://www.ashland.com",
        "market_cap": 5359381504
    },
    "ATURF": {
        "short_name": "SIXTH WAVE INNOVATIONS INC",
        "long_name": "Sixth Wave Innovations Inc.",
        "summary": "Sixth Wave Innovations Inc., a development stage nanotechnology company, focuses on the extraction and detection of target substances at the molecular level using specialized molecularly imprinted polymers. It is in the process of commercializing its Affinity cannabinoid purification system; and IXOS, a line of extraction polymers for the gold mining industry. The company was formerly known as Atom Energy Inc. and changed its name to Sixth Wave Innovations Inc. in August 2019. Sixth Wave Innovations Inc. was incorporated in 2007 and is headquartered in Salt Lake City, Utah.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "UT",
        "city": "Salt Lake City",
        "zipcode": "84108",
        "website": "http://sixthwave.com",
        "market_cap": 25976980
    },
    "AUTR": {
        "short_name": "AUTRIS",
        "long_name": "Autris",
        "summary": "Autris, through its subsidiary, NitroHeat, LLC, assembles and supplies nitrogen generators, air filtration systems, compressed air heaters, and heated hoses. Its products include NitroMax30, a nitrogen generator producing 30cfm of pure nitrogen; HeatPro200, a compressed air heater for heating compressed air or nitrogen up to a maximum of 200f; MaxDry200, a tri stage filter, membrane dryer, and heater that is used to supply clean dry air for painting and other compressed air applications, including powder coating; and heated hoses, a sub component of the HeatPro200 and MaxDry200. The company supplies its products to automotive and industrial paint service providers, and industrial component manufacturers, as well as auto collision facilities through a distributor network in the United States, Canada, Holland, Germany, and China. Autris is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Angeles",
        "zipcode": "90025",
        "website": "http://www.autris.com",
        "market_cap": 475932
    },
    "AVG.F": {
        "short_name": "AVANTOR INC.  DL-,01",
        "long_name": "Avantor, Inc.",
        "summary": "Avantor, Inc. provides products and services to customers in biopharma, healthcare, education and government, advanced technologies, and applied materials industries in the Americas, Europe, Asia, the Middle East, and Africa. The company offers materials and consumables, such as purity chemicals and reagents, lab products and supplies, formulated silicone materials, customized excipients, customized single-use assemblies, process chromatography resins and columns, analytical sample prep kits, education and microbiology products, and clinical trial kits. It also provides equipment and instrumentation products, including filtration systems, virus inactivation systems, incubators, analytical instruments, evaporators, ultra-low-temperature freezers, biological safety cabinets, and critical environment supplies. In addition, the company offers services and specialty procurements comprising onsite lab and production, clinical, equipment, procurement and sourcing, and biopharmaceutical material scale-up and development services. Avantor, Inc. was founded in 1904 and is headquartered in Radnor, Pennsylvania.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "Radnor",
        "zipcode": "19087",
        "website": "http://www.avantorsciences.com",
        "market_cap": 15021558784
    },
    "AVG.SG": {
        "short_name": "Avantor Inc. Registered Shares ",
        "long_name": "Avantor, Inc.",
        "summary": "Avantor, Inc. provides products and services to customers in biopharma, healthcare, education and government, advanced technologies, and applied materials industries in the Americas, Europe, Asia, the Middle East, and Africa. The company offers materials and consumables, such as purity chemicals and reagents, lab products and supplies, formulated silicone materials, customized excipients, customized single-use assemblies, process chromatography resins and columns, analytical sample prep kits, education and microbiology products, and clinical trial kits. It also provides equipment and instrumentation products, including filtration systems, virus inactivation systems, incubators, analytical instruments, evaporators, ultra-low-temperature freezers, biological safety cabinets, and critical environment supplies. In addition, the company offers services and specialty procurements comprising onsite lab and production, clinical, equipment, procurement and sourcing, and biopharmaceutical material scale-up and development services. Avantor, Inc. was founded in 1904 and is headquartered in Radnor, Pennsylvania.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "Radnor",
        "zipcode": "19087",
        "website": "http://www.avantorsciences.com",
        "market_cap": 15965883392
    },
    "AVNT": {
        "short_name": "Avient Corporation",
        "long_name": "Avient Corporation",
        "summary": "Avient Corporation provides specialized polymer materials, services, and solutions in the United States, Canada, Mexico, Europe, South America, and Asia. It operates in three segments: Color, Additives and Inks; Specialty Engineered Materials; and Distribution. The Color, Additives and Inks segment offers specialized color and additive concentrates in solid and liquid form for thermoplastics; dispersions for thermosets; and specialty inks, plastisols, and vinyl slush molding solutions. The Specialty Engineered Materials segment provides specialty polymer formulations, services, and solutions for designers, assemblers, and processors of thermoplastic materials; and long glass and carbon fiber technology, and thermoset and thermoplastic composites. The Distribution segment distributes approximately 4,000 grades of engineering and commodity grade resins to custom injection molders and extruders. The company sells its products through direct sales personnel, distributors, and commissioned sales agents. The company was formerly known as PolyOne Corporation and changed its name to Avient Corporation in June 2020. Avient Corporation was founded in 1885 and is headquartered in Avon Lake, Ohio.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Avon Lake",
        "zipcode": "44012",
        "website": "http://www.avient.com",
        "market_cap": 4770142720
    },
    "AVOA": {
        "short_name": "AVOCA LLC",
        "long_name": "Avoca LLC",
        "summary": "Avoca LLC was acquired by Whitney Bank, Gulfport, MS",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "LA",
        "city": "New Orleans",
        "zipcode": "70130",
        "website": null,
        "market_cap": 7208000
    },
    "AVTR-PA": {
        "short_name": "Avantor, Inc. Series A Mandator",
        "long_name": "Avantor, Inc.",
        "summary": "Avantor, Inc. provides products and services to customers in biopharma, healthcare, education and government, advanced technologies, and applied materials industries in the Americas, Europe, Asia, the Middle East, and Africa. The company offers materials and consumables, such as purity chemicals and reagents, lab products and supplies, formulated silicone materials, customized excipients, customized single-use assemblies, process chromatography resins and columns, analytical sample prep kits, education and microbiology products, and clinical trial kits. It also provides equipment and instrumentation products, including filtration systems, virus inactivation systems, incubators, analytical instruments, evaporators, ultra-low-temperature freezers, biological safety cabinets, and critical environment supplies. In addition, the company offers services and specialty procurements comprising onsite lab and production, clinical, equipment, procurement and sourcing, and biopharmaceutical material scale-up and development services. Avantor, Inc. was founded in 1904 and is headquartered in Radnor, Pennsylvania.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Radnor",
        "zipcode": "19087",
        "website": "http://www.avantorsciences.com",
        "market_cap": 16902784000
    },
    "AVTR": {
        "short_name": "Avantor, Inc.",
        "long_name": "Avantor, Inc.",
        "summary": "Avantor, Inc. provides products and services to customers in biopharma, healthcare, education and government, advanced technologies, and applied materials industries in the Americas, Europe, Asia, the Middle East, and Africa. The company offers materials and consumables, such as purity chemicals and reagents, lab products and supplies, formulated silicone materials, customized excipients, customized single-use assemblies, process chromatography resins and columns, analytical sample prep kits, education and microbiology products, and clinical trial kits. It also provides equipment and instrumentation products, including filtration systems, virus inactivation systems, incubators, analytical instruments, evaporators, ultra-low-temperature freezers, biological safety cabinets, and critical environment supplies. In addition, the company offers services and specialty procurements comprising onsite lab and production, clinical, equipment, procurement and sourcing, and biopharmaceutical material scale-up and development services. Avantor, Inc. was founded in 1904 and is headquartered in Radnor, Pennsylvania.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Radnor",
        "zipcode": "19087",
        "website": "http://www.avantorsciences.com",
        "market_cap": 17790136320
    },
    "AVTR.VI": {
        "short_name": "AVANTOR INC",
        "long_name": "Avantor, Inc.",
        "summary": "Avantor, Inc. provides products and services to customers in biopharma, healthcare, education and government, advanced technologies, and applied materials industries in the Americas, Europe, Asia, the Middle East, and Africa. The company offers materials and consumables, such as purity chemicals and reagents, lab products and supplies, formulated silicone materials, customized excipients, customized single-use assemblies, process chromatography resins and columns, analytical sample prep kits, education and microbiology products, and clinical trial kits. It also provides equipment and instrumentation products, including filtration systems, virus inactivation systems, incubators, analytical instruments, evaporators, ultra-low-temperature freezers, biological safety cabinets, and critical environment supplies. In addition, the company offers services and specialty procurements comprising onsite lab and production, clinical, equipment, procurement and sourcing, and biopharmaceutical material scale-up and development services. Avantor, Inc. was founded in 1904 and is headquartered in Radnor, Pennsylvania.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "PA",
        "city": "Radnor",
        "zipcode": "19087",
        "website": "http://www.avantorsciences.com",
        "market_cap": 15479465984
    },
    "AXTA": {
        "short_name": "Axalta Coating Systems Ltd.",
        "long_name": "Axalta Coating Systems Ltd.",
        "summary": "Axalta Coating Systems Ltd., through its subsidiaries, manufactures, markets, and distributes high-performance coatings systems in North America, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. It operates through two segments, Performance Coatings and Transportation Coatings. The company offers water and solvent borne products and systems to repair damaged vehicles for independent body shops, multi-shop operators, and original equipment manufacturer (OEM) dealership body shops. It also provides functional and decorative liquid and powder coatings used in various industrial applications, including architectural cladding and fittings, automotive coatings, general industrial, job coaters, electrical insulation coatings, HVAC, appliances, industrial wood, coil, rebar, and oil and gas pipelines; and wood coatings for building product, cabinet, flooring, and furniture markets under the Voltatex, AquaEC, Durapon, Hydropon, UNRIVALED, Tufcote, and Ceranamel for liquid coatings; and Alesta, Nap-Gard, Abcite, and Plascoat brands for powder coatings. In addition, the company develops and supplies electrocoat, primer, basecoat, and clearcoat products for OEMs of light and commercial vehicles; and various coatings systems for various commercial applications, including HDT, bus, and rail under the Imron, Imron Elite, Centari, Rival, Corlar epoxy undercoats, and AquaEC brands; and sells and ships its products to light vehicle OEM customers. It also sells its product under the Audurra, Challenger, Chemophan, ColorNet, Cromax, Cromax Mosaic, Durapon 70, Duxone, Harmonized Coating Technologies, Imron ExcelPro, Lutophen, Nason, Spies Hecker, Standox, Stollaquid, Syntopal, Syrox, and Vermeera brand names. The company was formerly known as Axalta Coating Systems Bermuda Co., Ltd. and changed its name to Axalta Coating Systems Ltd. in August 2014. Axalta Coating Systems Ltd. was founded in 1866 and is headquartered in Philadelphia, Pennsylvania.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Philadelphia",
        "zipcode": "19103",
        "website": "http://www.axalta.com",
        "market_cap": 7601060864
    },
    "BCPC": {
        "short_name": "Balchem Corporation",
        "long_name": "Balchem Corporation",
        "summary": "Balchem Corporation develops, manufactures, and markets specialty performance ingredients and products for the nutritional, food, pharmaceutical, animal health, medical device sterilization, plant nutrition, and industrial markets in the United States and internationally. It operates through three segments: Human Nutrition & Health, Animal Nutrition & Health, and Specialty Products. The Human Nutrition & Health segment supplies ingredients in the food and beverage industry. Its products include spray dried and emulsified powders, extrusion and agglomeration, blended lipid systems, liquid flavor delivery systems, juice and dairy bases, chocolate systems, and cereal systems, as well as ice cream bases and variegates. This segment also offers microencapsulation solutions; and human grade choline nutrients and mineral amino acid chelated products for wellness applications. The Animal Nutrition & Health segment provides microencapsulated products to enhance health and milk production in ruminant animals; chelation technology, which offers enhanced nutrient absorption for various species of production and companion animals; and choline chloride, a nutrient for monogastric animal health. The Specialty Products segment offers ethylene oxide primarily for use in the health care industry; and single use canisters with ethylene oxide for sterilizing re-usable devices. This segment also sells propylene oxide, a fumigant to aid in the control of insects and microbiological spoilage, as well as to reduce bacterial and mold contamination in shell and processed nut meats, processed spices, cacao beans, cocoa powder, raisins, figs, and prunes; and chelated minerals for high value crops. The company sells its products through sales force, independent distributors, and sales agents. Balchem Corporation was incorporated in 1967 and is headquartered in New Hampton, New York.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New Hampton",
        "zipcode": "10958",
        "website": "http://www.balchem.com",
        "market_cap": 3927951104
    },
    "BL9B.F": {
        "short_name": "BALCHEM CORP. B  DL-,067",
        "long_name": "Balchem Corporation",
        "summary": "Balchem Corporation develops, manufactures, and markets specialty performance ingredients and products for the nutritional, food, pharmaceutical, animal health, medical device sterilization, plant nutrition, and industrial markets in the United States and internationally. It operates through three segments: Human Nutrition & Health, Animal Nutrition & Health, and Specialty Products. The Human Nutrition & Health segment supplies ingredients in the food and beverage industry. Its products include spray dried and emulsified powders, extrusion and agglomeration, blended lipid systems, liquid flavor delivery systems, juice and dairy bases, chocolate systems, and cereal systems, as well as ice cream bases and variegates. This segment also offers microencapsulation solutions; and human grade choline nutrients and mineral amino acid chelated products for wellness applications. The Animal Nutrition & Health segment provides microencapsulated products to enhance health and milk production in ruminant animals; chelation technology, which offers enhanced nutrient absorption for various species of production and companion animals; and choline chloride, a nutrient for monogastric animal health. The Specialty Products segment offers ethylene oxide primarily for use in the health care industry; and single use canisters with ethylene oxide for sterilizing re-usable devices. This segment also sells propylene oxide, a fumigant to aid in the control of insects and microbiological spoilage, as well as to reduce bacterial and mold contamination in shell and processed nut meats, processed spices, cacao beans, cocoa powder, raisins, figs, and prunes; and chelated minerals for high value crops. The company sells its products through sales force, independent distributors, and sales agents. Balchem Corporation was incorporated in 1967 and is headquartered in New Hampton, New York.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New Hampton",
        "zipcode": "10958",
        "website": "http://www.balchem.com",
        "market_cap": 3655947264
    },
    "CANOF": {
        "short_name": "CALIFORNIA NANOTECHNOLOGIES COR",
        "long_name": "California Nanotechnologies Corp.",
        "summary": "California Nanotechnologies Corp. engages in the research, development, and production of nano-structured components and materials. The company produces powders, billets, wires, and precision forged components from nano, near-nano, ultrafine, and conventional advanced materials. It offers cold forged parts, including fasteners, bolts, pins, caps, and other components; nano light alloy and nano grain powders, such as aluminum, aluminum alloys, titanium, titanium alloys, magnesium, and magnesium alloys, as well as nano alloy billets; nano super alloy powders; thermal spray powders comprising WC-based materials and titanium powders; and cemented carbides. The company also provides component design and manufacturing services, such as production of nano aerospace parts and components; machining and sinker EDM components; spark plasma sintering services; scanning electron microscopy and ion milling services; cryogenic milling services; controlled atmospheric handling services; high vacuum/high temperature degassing services; and spray drying services. It serves customers in aerospace, defense, automotive, medical, oil and gas, mining, sports and recreation, and other industries. The company is headquartered in Cerritos, California.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Cerritos",
        "zipcode": "90703",
        "website": "http://www.calnanocorp.com",
        "market_cap": 2518923
    },
    "CBNT": {
        "short_name": "C-BOND SYSTEMS INC",
        "long_name": "C-Bond Systems, Inc.",
        "summary": "C-Bond Systems, Inc. owns, develops, manufactures, and sells patented C-Bond technology in the United Sates. Its products include C-Bond NanoShield, a patented nanotechnology windshield glass strengthening and hydrophobic all-in-one performance system to enhance windshield safety and performance; C-Bond Secure, a patented non-toxic water-based nanotechnology solution to enhance glasses and properties of window film-to-glass products; and C-Bond BRS, a patented nanotechnology ballistic resistant film system that enhances the structural integrity of glass. The company also distributes disinfectant tablets. C-Bond Systems, Inc. was founded in 2013 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77033",
        "website": "http://www.cbondsystems.com",
        "market_cap": 6874450
    },
    "CBT.F": {
        "short_name": "CABOT CORP.  DL 1",
        "long_name": "Cabot Corporation",
        "summary": "Cabot Corporation operates as a specialty chemicals and performance materials company. It operates through three segments: Reinforcement Materials, Performance Chemicals, and Purification Solutions. The company offers rubber grade carbon blacks used in tires as a rubber reinforcing agent and performance additive, as well as in industrial products, such as hoses, belts, extruded profiles, and molded goods; and engineered elastomer composites. It also provides specialty grades of carbon black used in inks, coatings, plastics, adhesives, toners, batteries, and displays applications; masterbatch and conductive compound products for use in automotive, industrial, packaging, infrastructure, agriculture, consumer products, and electronics industries; inkjet colorants used in the inkjet printing applications; fumed silica used in adhesives, sealants, cosmetics, batteries, inks, toners, silicone elastomers, coatings, polishing slurries, and pharmaceuticals; fumed alumina used in various products, including inkjet media, lighting, coatings, cosmetics, and polishing slurries; and aerogel, a hydrophobic, silica-based particle for use in various thermal insulation and specialty chemical applications. In addition, the company offers activated carbon products used for the purification of water, air, food and beverages, pharmaceuticals, and other liquids and gases; and activated carbon solutions for activated carbon injection in coal-fired utilities, mobile water filter units, and carbon reactivation services. The company sells its products through distributors and sales representatives in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. Cabot Corporation was founded in 1882 and is headquartered in Boston, Massachusetts.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MA",
        "city": "Boston",
        "zipcode": "02210-2019",
        "website": "http://www.cabotcorp.com",
        "market_cap": 2969510656
    },
    "CBT": {
        "short_name": "Cabot Corporation",
        "long_name": "Cabot Corporation",
        "summary": "Cabot Corporation operates as a specialty chemicals and performance materials company. It operates through three segments: Reinforcement Materials, Performance Chemicals, and Purification Solutions. The company offers rubber grade carbon blacks used in tires as a rubber reinforcing agent and performance additive, as well as in industrial products, such as hoses, belts, extruded profiles, and molded goods; and engineered elastomer composites. It also provides specialty grades of carbon black used in inks, coatings, plastics, adhesives, toners, batteries, and displays applications; masterbatch and conductive compound products for use in automotive, industrial, packaging, infrastructure, agriculture, consumer products, and electronics industries; inkjet colorants used in the inkjet printing applications; fumed silica used in adhesives, sealants, cosmetics, batteries, inks, toners, silicone elastomers, coatings, polishing slurries, and pharmaceuticals; fumed alumina used in various products, including inkjet media, lighting, coatings, cosmetics, and polishing slurries; and aerogel, a hydrophobic, silica-based particle for use in various thermal insulation and specialty chemical applications. In addition, the company offers activated carbon products used for the purification of water, air, food and beverages, pharmaceuticals, and other liquids and gases; and activated carbon solutions for activated carbon injection in coal-fired utilities, mobile water filter units, and carbon reactivation services. The company sells its products through distributors and sales representatives in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. Cabot Corporation was founded in 1882 and is headquartered in Boston, Massachusetts.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MA",
        "city": "Boston",
        "zipcode": "02210-2019",
        "website": "http://www.cabotcorp.com",
        "market_cap": 3588353792
    },
    "CC.MX": {
        "short_name": "THE CHEMOURS COMPANY LLC",
        "long_name": "The Chemours Company",
        "summary": "The Chemours Company provides performance chemicals in North America, the Asia Pacific, Europe, the Middle East, Africa, and Latin America. It operates through four segments: Titanium Technologies, Thermal & Specialized Solutions, Advanced Performance Materials, and Chemical Solutions. The Titanium Technologies segment provides TiO2 pigment under the Ti-Pure and BaiMax brands for delivering whiteness, brightness, opacity, and protection in various of applications. The Thermal & Specialized Solutions segment offers of refrigerants, propellants, blowing agents, and specialty solvents. The Advanced Performance Materials segment provides polymers and advanced materials. Its Chemical Solutions segment offers industrial chemicals used in gold production, industrial, and consumer applications. The company sells its products through direct channels, as well as through a network of resellers and distributors. The Chemours Company was founded in 2014 and is headquartered in Wilmington, Delaware.",
        "currency": "MXN",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "DE",
        "city": "Wilmington",
        "zipcode": "19899",
        "website": "http://www.chemours.com",
        "market_cap": 135253311488
    },
    "CC": {
        "short_name": "Chemours Company (The)",
        "long_name": "The Chemours Company",
        "summary": "The Chemours Company provides performance chemicals in North America, the Asia Pacific, Europe, the Middle East, Africa, and Latin America. It operates through four segments: Titanium Technologies, Thermal & Specialized Solutions, Advanced Performance Materials, and Chemical Solutions. The Titanium Technologies segment provides TiO2 pigment under the Ti-Pure and BaiMax brands for delivering whiteness, brightness, opacity, and protection in various of applications. The Thermal & Specialized Solutions segment offers of refrigerants, propellants, blowing agents, and specialty solvents. The Advanced Performance Materials segment provides polymers and advanced materials. Its Chemical Solutions segment offers industrial chemicals used in gold production, industrial, and consumer applications. The company sells its products through direct channels, as well as through a network of resellers and distributors. The Chemours Company was founded in 2014 and is headquartered in Wilmington, Delaware.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "DE",
        "city": "Wilmington",
        "zipcode": "19899",
        "website": "http://www.chemours.com",
        "market_cap": 5732165632
    },
    "CCF": {
        "short_name": "Chase Corporation",
        "long_name": "Chase Corporation",
        "summary": "Chase Corporation, a specialty chemicals company, manufactures and sells protective materials for various applications worldwide. It operates through three segments: Adhesives, Sealants and Additives; Industrial Tapes; and Corrosion Protection and Waterproofing. The Adhesives, Sealants and Additives segment offers protective conformal and moisture protective electronic coatings; advanced adhesives, sealants, and coatings; polymeric microspheres; polyurethane dispersions; and superabsorbent polymers. The Industrial Tapes segment provides specialty tapes and related products; insulating and conducting materials; laminated durable papers; water-blocking compounds; laminated film foils and cover tapes; and pulling and detection tapes. The Corrosion Protection and Waterproofing segment offers protective pipe-coating tapes and other protectants; polymer additives; waterproofing membranes; waterproofing sealants, expansion joints, and accessories; technological products, and tapes and membranes; specialized high-performance coating and lining systems; waterproofing and corrosion protection systems; and bitumen pipeline protection tapes and products. The company sells its products through its salespeople, as well as manufacturers' representatives and distributors. Chase Corporation was founded in 1946 and is headquartered in Westwood, Massachusetts.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "state": "MA",
        "city": "Westwood",
        "zipcode": "02090",
        "website": "http://www.chasecorp.com",
        "market_cap": 955230208
    },
    "CG1.AX": {
        "short_name": "CARBONXT FPO",
        "long_name": "Carbonxt Group Limited",
        "summary": "Carbonxt Group Limited engages in the development and sale of specialized activated carbon (AC) products for the removal of pollutants and toxins in industrial processes in Australia and the United States. It offers powdered activated carbon and AC pellets, which are used in industrial air purification, waste water treatment, and other liquid and gas phase markets primarily for the capture of mercury and sulphur to reduce harmful emissions into the atmosphere. The company was incorporated in 2001 and is based in Gainesville, Florida.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "ASX",
        "market": "au_market",
        "country": "United States",
        "state": "FL",
        "city": "Gainesville",
        "zipcode": "32606",
        "website": "http://www.carbonxt.com",
        "market_cap": 17727500
    },
    "CJC.SG": {
        "short_name": "CHASE CORP. Registered Shares D",
        "long_name": "Chase Corporation",
        "summary": "Chase Corporation, a specialty chemicals company, manufactures and sells protective materials for various applications worldwide. It operates through three segments: Adhesives, Sealants and Additives; Industrial Tapes; and Corrosion Protection and Waterproofing. The Adhesives, Sealants and Additives segment offers protective conformal and moisture protective electronic coatings; advanced adhesives, sealants, and coatings; polymeric microspheres; polyurethane dispersions; and superabsorbent polymers. The Industrial Tapes segment provides specialty tapes and related products; insulating and conducting materials; laminated durable papers; water-blocking compounds; laminated film foils and cover tapes; and pulling and detection tapes. The Corrosion Protection and Waterproofing segment offers protective pipe-coating tapes and other protectants; polymer additives; waterproofing membranes; waterproofing sealants, expansion joints, and accessories; technological products, and tapes and membranes; specialized high-performance coating and lining systems; waterproofing and corrosion protection systems; and bitumen pipeline protection tapes and products. The company sells its products through its salespeople, as well as manufacturers' representatives and distributors. Chase Corporation was founded in 1946 and is headquartered in Westwood, Massachusetts.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United States",
        "state": "MA",
        "city": "Westwood",
        "zipcode": "02090",
        "website": "http://www.chasecorp.com",
        "market_cap": 777207936
    },
    "CLTH": {
        "short_name": "CLEAN TECH BIOFUELS INC",
        "long_name": "Cleantech Biofuels, Inc.",
        "summary": "Cleantech Biofuels, Inc., a development stage company, focuses on providing cellulosic biomass derived from municipal solid waste (MSW) in the United States and Canada. It intends to design and build a biomass recovery plant to offer biomass feedstock for producing energy and other chemical products; and provide recyclables, such as metals, plastics, and glass from the MSW. The company was founded in 2004 and is based in St. Louis, Missouri.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MO",
        "city": "St. Louis",
        "zipcode": "63130",
        "website": "http://www.cleantechbiofuels.net",
        "market_cap": 2014660
    },
    "CMT": {
        "short_name": "Core Molding Technologies Inc",
        "long_name": "Core Molding Technologies, Inc.",
        "summary": "Core Molding Technologies, Inc., together with its subsidiaries, engages in the molding of thermoplastic and thermoset structural products. The company offers a range of manufacturing processes that include compression molding of sheet molding compounds, bulk molding compounds, resin transfer molding, liquid molding of dicyclopentadiene, spray-up and hand-lay-up, glass mat thermoplastics, direct long-fiber thermoplastics, and structural foam and web injection molding, as well as reaction injection molding utilizing dicyclopentadiene technology. It serves various markets, including medium and heavy-duty truck, marine, automotive, agriculture, construction, and other commercial products in the United States, Mexico, Canada, and internationally. The company was formerly known as Core Materials Corporation and changed its name to Core Molding Technologies, Inc. in August 2002. Core Molding Technologies, Inc. was incorporated in 1996 and is headquartered in Columbus, Ohio.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Columbus",
        "zipcode": "43228-0183",
        "website": "http://www.coremt.com",
        "market_cap": 111205776
    },
    "CNO.V": {
        "short_name": "CALIFORNIA NANOTECHNOLOGIES COR",
        "long_name": "California Nanotechnologies Corp.",
        "summary": "California Nanotechnologies Corp. engages in the research, development, and production of nano-structured components and materials. The company produces powders, billets, wires, and precision forged components from nano, near-nano, ultrafine, and conventional advanced materials. It offers cold forged parts, including fasteners, bolts, pins, caps, and other components; nano light alloy and nano grain powders, such as aluminum, aluminum alloys, titanium, titanium alloys, magnesium, and magnesium alloys, as well as nano alloy billets; nano super alloy powders; thermal spray powders comprising WC-based materials and titanium powders; and cemented carbides. The company also provides component design and manufacturing services, such as production of nano aerospace parts and components; machining and sinker EDM components; spark plasma sintering services; scanning electron microscopy and ion milling services; cryogenic milling services; controlled atmospheric handling services; high vacuum/high temperature degassing services; and spray drying services. It serves customers in aerospace, defense, automotive, medical, oil and gas, mining, sports and recreation, and other industries. The company is headquartered in Cerritos, California.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "United States",
        "state": "CA",
        "city": "Cerritos",
        "zipcode": "90703",
        "website": "http://www.calnanocorp.com",
        "market_cap": 2514424
    },
    "CRKN": {
        "short_name": "Crown Electrokinetics Corp.",
        "long_name": "Crown ElectroKinetics Corp.",
        "summary": "Crown Electrokinetics Corp. focuses on commercializing electrokinetic technology for use in the smart glass market. It offers electrokinetic film technology for smart or dynamic glass. The company was formerly known as 3D Nanocolor Corp. and changed its name to Crown ElectroKinetics Corp. in October 2017. Crown ElectroKinetics Corp. was incorporated in 2015 and is based in Corvallis, Oregon.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "OR",
        "city": "Corvallis",
        "zipcode": "97330",
        "website": "http://www.crownek.com",
        "market_cap": 54206816
    },
    "DD.MX": {
        "short_name": "DUPONT DE NEMOURS INC",
        "long_name": "DuPont de Nemours, Inc.",
        "summary": "DuPont de Nemours, Inc. provides technology-based materials, ingredients, and solutions in the United States, Canada, the Asia Pacific, Latin America, Europe, the Middle East, and Africa. The company's Electronics & Imaging segment supplies materials to manufacture photovoltaics and solar cells; materials and printing systems to the advanced printing industry; and materials and solutions for the fabrication of semiconductors and integrated circuits addressing front-end and back-end of the manufacturing process. This segment also provides semiconductor and advanced packaging materials; dielectric and metallization solutions for chip packaging; and silicones for light emitting diode packaging and semiconductor applications; permanent and process chemistries for the fabrication of printed circuit boards to include laminates and substrates, electroless, and electrolytic metallization solutions, as well as patterning solutions, and materials and metallization processes for metal finishing, decorative, and industrial applications. In addition, it offers various materials to manufacture rigid and flexible displays for liquid crystal displays, advanced-matrix organic light emitting diode, and quantum dot applications. The Transportation & Advanced Polymers segment provides engineering resins, adhesives, silicones, lubricants, and parts to engineers and designers in the transportation, electronics, healthcare, industrial, and consumer end-markets. Its Safety & Construction segment provides engineered products and integrated systems for worker safety, water purification and separation, aerospace, energy, medical packaging, and building materials. The company was formerly known as DowDuPont Inc. and changed its name to DuPont de Nemours, Inc. in June 2019. DuPont de Nemours, Inc. is based in Wilmington, Delaware.",
        "currency": "MXN",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "DE",
        "city": "Wilmington",
        "zipcode": "19805",
        "website": "http://www.dupont.com",
        "market_cap": 958423433216
    },
    "DD": {
        "short_name": "DuPont de Nemours, Inc.",
        "long_name": "DuPont de Nemours, Inc.",
        "summary": "DuPont de Nemours, Inc. provides technology-based materials, ingredients, and solutions in the United States, Canada, the Asia Pacific, Latin America, Europe, the Middle East, and Africa. The company's Electronics & Imaging segment supplies materials to manufacture photovoltaics and solar cells; materials and printing systems to the advanced printing industry; and materials and solutions for the fabrication of semiconductors and integrated circuits addressing front-end and back-end of the manufacturing process. This segment also provides semiconductor and advanced packaging materials; dielectric and metallization solutions for chip packaging; and silicones for light emitting diode packaging and semiconductor applications; permanent and process chemistries for the fabrication of printed circuit boards to include laminates and substrates, electroless, and electrolytic metallization solutions, as well as patterning solutions, and materials and metallization processes for metal finishing, decorative, and industrial applications. In addition, it offers various materials to manufacture rigid and flexible displays for liquid crystal displays, advanced-matrix organic light emitting diode, and quantum dot applications. The Transportation & Advanced Polymers segment provides engineering resins, adhesives, silicones, lubricants, and parts to engineers and designers in the transportation, electronics, healthcare, industrial, and consumer end-markets. Its Safety & Construction segment provides engineered products and integrated systems for worker safety, water purification and separation, aerospace, energy, medical packaging, and building materials. The company was formerly known as DowDuPont Inc. and changed its name to DuPont de Nemours, Inc. in June 2019. DuPont de Nemours, Inc. is based in Wilmington, Delaware.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "DE",
        "city": "Wilmington",
        "zipcode": "19805",
        "website": "http://www.dupont.com",
        "market_cap": 43494301696
    },
    "DDNB34.SA": {
        "short_name": "DUPONT N INCDRN",
        "long_name": "DuPont de Nemours, Inc.",
        "summary": "DuPont de Nemours, Inc. provides technology-based materials, ingredients, and solutions in the United States, Canada, the Asia Pacific, Latin America, Europe, the Middle East, and Africa. The company's Electronics & Imaging segment supplies materials to manufacture photovoltaics and solar cells; materials and printing systems to the advanced printing industry; and materials and solutions for the fabrication of semiconductors and integrated circuits addressing front-end and back-end of the manufacturing process. This segment also provides semiconductor and advanced packaging materials; dielectric and metallization solutions for chip packaging; and silicones for light emitting diode packaging and semiconductor applications; permanent and process chemistries for the fabrication of printed circuit boards to include laminates and substrates, electroless, and electrolytic metallization solutions, as well as patterning solutions, and materials and metallization processes for metal finishing, decorative, and industrial applications. In addition, it offers various materials to manufacture rigid and flexible displays for liquid crystal displays, advanced-matrix organic light emitting diode, and quantum dot applications. The Transportation & Advanced Polymers segment provides engineering resins, adhesives, silicones, lubricants, and parts to engineers and designers in the transportation, electronics, healthcare, industrial, and consumer end-markets. Its Safety & Construction segment provides engineered products and integrated systems for worker safety, water purification and separation, aerospace, energy, medical packaging, and building materials. The company was formerly known as DowDuPont Inc. and changed its name to DuPont de Nemours, Inc. in June 2019. DuPont de Nemours, Inc. is based in Wilmington, Delaware.",
        "currency": "BRL",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "DE",
        "city": "Wilmington",
        "zipcode": "19805",
        "website": "http://www.dupont.com",
        "market_cap": 233050177536
    },
    "DDPN.VI": {
        "short_name": "DUPONT DE NEMOURS INC",
        "long_name": "DuPont de Nemours, Inc.",
        "summary": "DuPont de Nemours, Inc. provides technology-based materials, ingredients, and solutions in the United States, Canada, the Asia Pacific, Latin America, Europe, the Middle East, and Africa. The company's Electronics & Imaging segment supplies materials to manufacture photovoltaics and solar cells; materials and printing systems to the advanced printing industry; and materials and solutions for the fabrication of semiconductors and integrated circuits addressing front-end and back-end of the manufacturing process. This segment also provides semiconductor and advanced packaging materials; dielectric and metallization solutions for chip packaging; and silicones for light emitting diode packaging and semiconductor applications; permanent and process chemistries for the fabrication of printed circuit boards to include laminates and substrates, electroless, and electrolytic metallization solutions, as well as patterning solutions, and materials and metallization processes for metal finishing, decorative, and industrial applications. In addition, it offers various materials to manufacture rigid and flexible displays for liquid crystal displays, advanced-matrix organic light emitting diode, and quantum dot applications. The Transportation & Advanced Polymers segment provides engineering resins, adhesives, silicones, lubricants, and parts to engineers and designers in the transportation, electronics, healthcare, industrial, and consumer end-markets. Its Safety & Construction segment provides engineered products and integrated systems for worker safety, water purification and separation, aerospace, energy, medical packaging, and building materials. The company was formerly known as DowDuPont Inc. and changed its name to DuPont de Nemours, Inc. in June 2019. DuPont de Nemours, Inc. is based in Wilmington, Delaware.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "DE",
        "city": "Wilmington",
        "zipcode": "19805",
        "website": "http://www.dupont.com",
        "market_cap": 38180544512
    },
    "DLY.F": {
        "short_name": "LYONDELLBAS.IND.A EO -,04",
        "long_name": "LyondellBasell Industries N.V.",
        "summary": "LyondellBasell Industries N.V. operates as a chemical company in the United States, Germany, Mexico, Italy, Poland, France, Japan, China, the Netherlands, and internationally. The company operates in six segments: Olefins and PolyolefinsÂ\u0097Americas; Olefins and PolyolefinsÂ\u0097Europe, Asia, International; Intermediates and Derivatives; Advanced Polymer Solutions; Refining; and Technology. It produces and markets olefins and co-products; polyolefins; polyethylene products, which consist of high density polyethylene, low density polyethylene, and linear low density polyethylene; and polypropylene (PP) products, such as PP homopolymers and copolymers. The company also produces and sells propylene oxide and its derivatives; oxyfuels and related products; and intermediate chemicals, such as styrene monomers, acetyls, ethylene glycols, and ethylene oxides and derivatives. In addition, it produces and markets compounds and solutions, such as polypropylene compounds, engineered plastics, masterbatches, engineered composites, colors, and powders; and advanced polymers. Further, the company refines crude oil and other crude oils of varied types and sources into gasoline, diesel, and jet fuel; develops and licenses chemical and polyolefin process technologies; and manufactures and sells polyolefin catalysts. LyondellBasell Industries N.V. was founded in 1955 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77010",
        "website": "http://www.lyondellbasell.com",
        "market_cap": 31112148992
    },
    "DNMR.MX": {
        "short_name": "DANIMER SCIENTIFIC INC",
        "long_name": "Danimer Scientific, Inc.",
        "summary": "Danimer Scientific, Inc., a performance polymer company, develops, produces, and provides bioplastic replacements for traditional petrochemical-based plastics. It produces polyhydroxyalkanoate, a biodegradable plastic feedstock alternative used in a range of plastic applications, including water bottles, straws, food containers, and other things under the Nodax brand name; polylactic acid-based resins for coating disposable paper cups; and other biopolymers. The company offers its products to manufacturers in the plastics industry. Danimer Scientific, Inc. was incorporated in 2004 and is headquartered in Bainbridge, Georgia.",
        "currency": "MXN",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "GA",
        "city": "Bainbridge",
        "zipcode": "39817",
        "website": "http://www.danimerscientific.com",
        "market_cap": 34563485696
    },
    "E1CL34.SA": {
        "short_name": "ECOLAB INC  DRN",
        "long_name": "Ecolab Inc.",
        "summary": "Ecolab Inc. provides water, hygiene, and infection prevention solutions and services worldwide. Its Global Industrial segment offers water treatment and process applications, and cleaning and sanitizing solutions to manufacturing, food and beverage processing, transportation, chemical, metals and mining, power generation, pulp and paper, commercial laundry, petroleum, and petrochemical industries. The company's Global Institutional & Specialty segment provides specialized cleaning and sanitizing products to the foodservice, hospitality, lodging, government and education, and retail industries. Its Global Healthcare & Life Sciences segment offers specialized cleaning and sanitizing products to the healthcare, personal care, and pharmaceutical industries, such as infection prevention and surgical solutions, and end-to-end cleaning and contamination control solutions under the Ecolab, Microtek, and Anios brand names. The company's Other segment offers pest elimination services to detect, eliminate, and prevent pests, such as rodents and insects in restaurants, food and beverage processors, educational and healthcare facilities, hotels, quick service restaurant and grocery operations, and other institutional and commercial customers. This segment also provides colloidal silica for binding and polishing applications in semiconductor, catalyst, and aerospace component manufacturing, as well as chemical industries; and products and services that manage wash process through custom designed programs, premium products, dispensing equipment, water and energy management, and reduction, as well as real time data management. It sells its products through field sales and corporate account personnel, distributors, and dealers. The company was founded in 1923 and is headquartered in St. Paul, Minnesota.",
        "currency": "BRL",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "MN",
        "city": "Saint Paul",
        "zipcode": "55102-2233",
        "website": "http://www.ecolab.com",
        "market_cap": 306113937408
    },
    "E7T.F": {
        "short_name": "ALEXIUM INTERNATIONAL GRP",
        "long_name": "Alexium International Group Limited",
        "summary": "Alexium International Group Limited develops and sells specialty chemicals and solutions in Australia, the United States, and Cyprus. It offers flame retardant (FR) treatments, including Alexiflam FR for use in synthetic and synthetic-blend fabrics; Alexiflam NF for use in cotton and cotton-blends; and Alexicool, a chemical finish for fabrics. Its products are used in defense applications; and consumer applications, such as automotive and transportation, and bedding. The company is based in Greer, South Carolina.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "SC",
        "city": "Greer",
        "zipcode": "29650",
        "website": "http://www.alexiuminternational.com",
        "market_cap": 19831896
    },
    "ECJ.F": {
        "short_name": "ECOLAB INC.  DL 1",
        "long_name": "Ecolab Inc.",
        "summary": "Ecolab Inc. provides water, hygiene, and infection prevention solutions and services worldwide. Its Global Industrial segment offers water treatment and process applications, and cleaning and sanitizing solutions to manufacturing, food and beverage processing, transportation, chemical, metals and mining, power generation, pulp and paper, commercial laundry, petroleum, and petrochemical industries. The company's Global Institutional & Specialty segment provides specialized cleaning and sanitizing products to the foodservice, hospitality, lodging, government and education, and retail industries. Its Global Healthcare & Life Sciences segment offers specialized cleaning and sanitizing products to the healthcare, personal care, and pharmaceutical industries, such as infection prevention and surgical solutions, and end-to-end cleaning and contamination control solutions under the Ecolab, Microtek, and Anios brand names. The company's Other segment offers pest elimination services to detect, eliminate, and prevent pests, such as rodents and insects in restaurants, food and beverage processors, educational and healthcare facilities, hotels, quick service restaurant and grocery operations, and other institutional and commercial customers. This segment also provides colloidal silica for binding and polishing applications in semiconductor, catalyst, and aerospace component manufacturing, as well as chemical industries; and products and services that manage wash process through custom designed programs, premium products, dispensing equipment, water and energy management, and reduction, as well as real time data management. It sells its products through field sales and corporate account personnel, distributors, and dealers. The company was founded in 1923 and is headquartered in St. Paul, Minnesota.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MN",
        "city": "Saint Paul",
        "zipcode": "55102-2233",
        "website": "http://www.ecolab.com",
        "market_cap": 54452973568
    },
    "ECL.MX": {
        "short_name": "ECOLAB INC",
        "long_name": "Ecolab Inc.",
        "summary": "Ecolab Inc. provides water, hygiene, and infection prevention solutions and services worldwide. Its Global Industrial segment offers water treatment and process applications, and cleaning and sanitizing solutions to manufacturing, food and beverage processing, transportation, chemical, metals and mining, power generation, pulp and paper, commercial laundry, petroleum, and petrochemical industries. The company's Global Institutional & Specialty segment provides specialized cleaning and sanitizing products to the foodservice, hospitality, lodging, government and education, and retail industries. Its Global Healthcare & Life Sciences segment offers specialized cleaning and sanitizing products to the healthcare, personal care, and pharmaceutical industries, such as infection prevention and surgical solutions, and end-to-end cleaning and contamination control solutions under the Ecolab, Microtek, and Anios brand names. The company's Other segment offers pest elimination services to detect, eliminate, and prevent pests, such as rodents and insects in restaurants, food and beverage processors, educational and healthcare facilities, hotels, quick service restaurant and grocery operations, and other institutional and commercial customers. This segment also provides colloidal silica for binding and polishing applications in semiconductor, catalyst, and aerospace component manufacturing, as well as chemical industries; and products and services that manage wash process through custom designed programs, premium products, dispensing equipment, water and energy management, and reduction, as well as real time data management. It sells its products through field sales and corporate account personnel, distributors, and dealers. The company was founded in 1923 and is headquartered in St. Paul, Minnesota.",
        "currency": "MXN",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "MN",
        "city": "Saint Paul",
        "zipcode": "55102-2233",
        "website": "http://www.ecolab.com",
        "market_cap": 1231399157760
    },
    "ECL": {
        "short_name": "Ecolab Inc.",
        "long_name": "Ecolab Inc.",
        "summary": "Ecolab Inc. provides water, hygiene, and infection prevention solutions and services worldwide. Its Global Industrial segment offers water treatment and process applications, and cleaning and sanitizing solutions to manufacturing, food and beverage processing, transportation, chemical, metals and mining, power generation, pulp and paper, commercial laundry, petroleum, and petrochemical industries. The company's Global Institutional & Specialty segment provides specialized cleaning and sanitizing products to the foodservice, hospitality, lodging, government and education, and retail industries. Its Global Healthcare & Life Sciences segment offers specialized cleaning and sanitizing products to the healthcare, personal care, and pharmaceutical industries, such as infection prevention and surgical solutions, and end-to-end cleaning and contamination control solutions under the Ecolab, Microtek, and Anios brand names. The company's Other segment offers pest elimination services to detect, eliminate, and prevent pests, such as rodents and insects in restaurants, food and beverage processors, educational and healthcare facilities, hotels, quick service restaurant and grocery operations, and other institutional and commercial customers. This segment also provides colloidal silica for binding and polishing applications in semiconductor, catalyst, and aerospace component manufacturing, as well as chemical industries; and products and services that manage wash process through custom designed programs, premium products, dispensing equipment, water and energy management, and reduction, as well as real time data management. It sells its products through field sales and corporate account personnel, distributors, and dealers. The company was founded in 1923 and is headquartered in St. Paul, Minnesota.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MN",
        "city": "Saint Paul",
        "zipcode": "55102-2233",
        "website": "http://www.ecolab.com",
        "market_cap": 65509007360
    },
    "ECL.VI": {
        "short_name": "ECOLAB INC",
        "long_name": "Ecolab Inc.",
        "summary": "Ecolab Inc. provides water, hygiene, and infection prevention solutions and services worldwide. Its Global Industrial segment offers water treatment and process applications, and cleaning and sanitizing solutions to manufacturing, food and beverage processing, transportation, chemical, metals and mining, power generation, pulp and paper, commercial laundry, petroleum, and petrochemical industries. The company's Global Institutional & Specialty segment provides specialized cleaning and sanitizing products to the foodservice, hospitality, lodging, government and education, and retail industries. Its Global Healthcare & Life Sciences segment offers specialized cleaning and sanitizing products to the healthcare, personal care, and pharmaceutical industries, such as infection prevention and surgical solutions, and end-to-end cleaning and contamination control solutions under the Ecolab, Microtek, and Anios brand names. The company's Other segment offers pest elimination services to detect, eliminate, and prevent pests, such as rodents and insects in restaurants, food and beverage processors, educational and healthcare facilities, hotels, quick service restaurant and grocery operations, and other institutional and commercial customers. This segment also provides colloidal silica for binding and polishing applications in semiconductor, catalyst, and aerospace component manufacturing, as well as chemical industries; and products and services that manage wash process through custom designed programs, premium products, dispensing equipment, water and energy management, and reduction, as well as real time data management. It sells its products through field sales and corporate account personnel, distributors, and dealers. The company was founded in 1923 and is headquartered in St. Paul, Minnesota.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "MN",
        "city": "Saint Paul",
        "zipcode": "55102-2233",
        "website": "http://www.ecolab.com",
        "market_cap": 52910014464
    },
    "ENDO": {
        "short_name": "ENDOCAN CORP",
        "long_name": "Thermic Sciences International",
        "summary": "Thermic Sciences International develops and sells hemp based products. The company offers hemp formulation-based health and wellness solutions, as well as cosmeceuticals, nutraceuticals, and food brands. It also provides over the counter products for hair and skin include Hempery miracle oil, a skin care solution; Hemp milk body wash, a creamy soap; Hemp lotion bars for moisturizing hands and body; Hemp rose soap; and Hemtastique lip and body balms. The company also develops products for ailments, such as acquired immune deficiency syndrome/human immunodeficiency virus, asthma, cancer, glaucoma, influenza, pain management, and post-traumatic stress disorder. It distributes its products in the United States, Canada, Colombia, Ireland, India, China, Japan, South Korea, and Afghanistan through online and in retail stores. The company was formerly known as OmniCanna Health Solutions, Inc. Thermic Sciences International was incorporated in 1969 and is based in Colorado Springs, Colorado.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Colorado Springs",
        "zipcode": "80922",
        "website": "http://www.omnicanna.com",
        "market_cap": 1468208
    },
    "ESI": {
        "short_name": "Element Solutions Inc.",
        "long_name": "Element Solutions Inc",
        "summary": "Element Solutions Inc produces and sells specialty chemical products the United States, China, and internationally. The company operates in two segments, Electronics and Industrial & Specialty. The Electronics segment researches, formulates, and sells specialty chemicals and materials for various types of electronics hardware products. This segment offers electronic assembly materials; circuitry solutions comprising circuit board metallization products, circuit formation products, electronic materials, and surface finishes; and semiconductor solutions. This segment primarily serves mobile communications, computers, automobiles, and aerospace equipment industries. The Industrial & Specialty segment provides industrial solutions, which include chemical systems that protect and decorate metal and plastic surfaces; consumable chemicals that enable printing image transfer on flexible packaging materials; and energy solutions, which consist of chemistries used in water-based hydraulic control fluids for offshore deep-water production and drilling applications. This segment's products include electroless nickel products, plating products, pre-treatment and cleaning solutions, functional conversion coatings, hard-coated films, and water treatment products; solid sheet printing elements and liquid imaging products; and offshore fluids. This segment serves the aerospace, automotive, construction, consumer electronics, consumer packaged goods, and oil and gas production end markets. The company was formerly known as Platform Specialty Products Corporation and changed its name to Element Solutions Inc in January 2019. Element Solutions Inc was founded in 1922 and is based in Fort Lauderdale, Florida.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Fort Lauderdale",
        "zipcode": "33394",
        "website": "http://www.elementsolutionsinc.com",
        "market_cap": 5604900864
    },
    "ESPIQ": {
        "short_name": "ESP RESOURCES INC",
        "long_name": "ESP Resources, Inc.",
        "summary": "ESP Resources, Inc., through its subsidiaries, manufactures, blends, distributes, and markets specialty chemicals and analytical services to the oil and gas industry in the United States. The company supplies specialty chemicals for various oil and gas field applications, including killing bacteria, separating suspended water and other contaminants from crude oil, separating the oil from the gas, pumping enhancement, and pumping cleaning, as well as a various fluids and additives used in the drilling and production process. Its products comprise completion petrochemicals that are primarily used during the completion stage of oil or gas wells that are drilled in various shale formations. The company's products also comprise production petrochemicals, such as surfactants for treating production and injection problems; well completion and work-over chemicals that maximize productivity from new and existing wells; bactericides to kill water borne bacterial growth; scale compounds to prevent or treat scale deposits; corrosion inhibitors, which are organic compounds that form a protective film on metal surfaces to insulate the metal from its corrosive environment; antifoams for controlling foaming problems; emulsion breakers that are formulated for crude oils containing produced waters; paraffin chemicals that inhibit and/or dissolve paraffin to prevent buildup; and water clarifiers for problems associated with purifying effluent water. In addition, it provides various services for the upstream, midstream, and downstream sectors of the energy industry comprising new construction, modifications to operational support for onshore and offshore production, gathering, refining facilities, and pipelines. The company was formerly known as Pantera Petroleum, Inc. and changed its name to ESP Resources, Inc. in January 2009. ESP Resources, Inc. was incorporated in 2004 and is based in Lafayette, Louisiana.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "LA",
        "city": "Lafayette",
        "zipcode": "70508",
        "website": "http://www.espchem.com",
        "market_cap": 402300
    },
    "ETCK": {
        "short_name": "ENERTECK CORP",
        "long_name": "EnerTeck Corporation",
        "summary": "EnerTeck Corporation, through its subsidiary, EnerTeck Chemical Corp., manufactures, markets, and sells fuel borne catalytic engine treatment products for diesel engines in the United States and internationally. The company offers EnerBurn that functions as an engine treatment application by removing carbon deposits from the combustion surfaces of the engine and reducing further carbon deposit buildup to fleet and vessel operators. It also provides volumetric proportioning injection equipment, which is used to deliver proper dosage ratios of EnerBurn to the diesel fuel. The company's products are primarily used in on-road vehicles, locomotives, and diesel marine engines. Its principal target markets comprise trucking, heavy construction, maritime shipping, railroad, and mining industries, as well as for federal, state, and international government applications. The company was formerly known as Gold Bond Resources, Inc. and changed its name to EnerTeck Corporation in November 2003. EnerTeck Corporation was incorporated in 1935 and is based in Stafford, Texas.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Stafford",
        "zipcode": "77477",
        "website": "http://www.enerteckchemical.com",
        "market_cap": 3054159
    },
    "FAME": {
        "short_name": "FLAMEMASTER CORP",
        "long_name": "Flamemaster Corporation",
        "summary": "Flamemaster Corporation manufactures and sells specialty chemicals for the aerospace, defense, energy, and transportation industries. The company offers flame retardant coatings that are used in industrial applications to prevent the propagation of fire in electrical cables; and heat resistant coatings for protecting components and structural surfaces, such as the aluminum deck of a naval vessel. It also provides sealants for use in aerospace and marine applications; and epoxy bonding compounds for construction materials, epoxy joint sealers, and silicone thermal coatings and sealants. The company was founded in 1942 and is based in Pacoima, California.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Pacoima",
        "zipcode": "91331",
        "website": "http://www.flamemaster.com",
        "market_cap": 6261229
    },
    "FLKI": {
        "short_name": "FALKEN INDUSTRIES LTD",
        "long_name": "Falken Industries Ltd.",
        "summary": "Falken Industries Ltd develops, manufactures, and commercializes various lines of cleaning and maintenance products for the consumer, professional, and industrial sectors primarily in European Community. Falken Industries Ltd was incorporated in 2003 and is based in Trenton, New Jersey.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Trenton",
        "zipcode": "08619",
        "website": "http://www.falkenltd.com",
        "market_cap": 179049
    },
    "FLMP": {
        "short_name": "FLAME SEAL PRODUCTS INC",
        "long_name": "Flame Seal Products, Inc.",
        "summary": "Flame Seal Products, Inc. develops fire prevention technologies in the United States. It offers fire retardant coatings, as well as fabric fire, leather fire, paper fire, wood fire, and wildfire retardants. Flame Seal Products, Inc. was founded in 1992 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77053",
        "website": "http://www.flameseal.com",
        "market_cap": 1295508
    },
    "FOE": {
        "short_name": "Ferro Corporation",
        "long_name": "Ferro Corporation",
        "summary": "Ferro Corporation produces and markets specialty materials in the United States, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. It operates through two segments, Functional Coatings and Color Solutions. The company offers frits, porcelain and other glass enamels, glazes, stains, decorating colors, pigments, inks, polishing materials, dielectrics, electronic glasses, and other specialty coatings. It also provides slurry-based polishing products for the semiconductor and optoelectronics industry; decorative coatings for glass and high-performance plastics coatings; and dielectrics and electronic ink products for component applications. The company's products are used in appliances, electronics, automotive, industrial products, building and renovation, packaging, consumer products, sanitary, construction, healthcare, food and beverage, information technology, energy, and defense industries. It markets and sells its products directly, as well as through agents and distributors. Ferro Corporation was founded in 1919 and is headquartered in Mayfield Heights, Ohio.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Mayfield Heights",
        "zipcode": "44124",
        "website": "http://www.ferro.com",
        "market_cap": 1425082496
    },
    "FPR.F": {
        "short_name": "ALTO INGREDIENTS  DL-,015",
        "long_name": "Alto Ingredients, Inc.",
        "summary": "Alto Ingredients, Inc. produces and markets specialty alcohols and essential ingredients in the United States. It operates in two segments, Production and Marketing. The company offers specialty alcohols used in mouthwash, cosmetics, pharmaceuticals, hand sanitizers, disinfectants, and cleaners; alcoholic beverages, flavor extracts, and vinegar, as well as corn germ used for corn oils and carbon dioxide. It also provides essential ingredients, such as dried yeast, corn gluten meal, corn gluten feed, distillers grains, and liquid feed used in commercial animal feed and pet food; and fuel-grade ethanol used as transportation fuel and distillers corn oil used as a biodiesel feedstock, as well as fuel-grade ethanol produced by third parties. In addition, the company offers transportation, storage, and delivery services through third-party service providers. It sells ethanol to integrated oil companies and gasoline marketers; essential ingredient feed products to dairies and feedlots; and corn oil to poultry and biodiesel customers. The company operates seven ethanol production facilities, including three plants in the Midwestern states of Illinois; and four plants located in the Western states of California, Oregon, and Idaho. The company was formerly known as Pacific Ethanol, Inc. and changed its name to Alto Ingredients, Inc. in January 2021. Alto Ingredients, Inc. was founded in 2003 and is headquartered in Sacramento, California.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Sacramento",
        "zipcode": "95814",
        "website": "http://www.altoingredients.com",
        "market_cap": 411624640
    },
    "FR9.F": {
        "short_name": "FERRO CORP.  DL 1",
        "long_name": "Ferro Corporation",
        "summary": "Ferro Corporation produces and markets specialty materials in the United States, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. It operates through two segments, Functional Coatings and Color Solutions. The company offers frits, porcelain and other glass enamels, glazes, stains, decorating colors, pigments, inks, polishing materials, dielectrics, electronic glasses, and other specialty coatings. It also provides slurry-based polishing products for the semiconductor and optoelectronics industry; decorative coatings for glass and high-performance plastics coatings; and dielectrics and electronic ink products for component applications. The company's products are used in appliances, electronics, automotive, industrial products, building and renovation, packaging, consumer products, sanitary, construction, healthcare, food and beverage, information technology, energy, and defense industries. It markets and sells its products directly, as well as through agents and distributors. Ferro Corporation was founded in 1919 and is headquartered in Mayfield Heights, Ohio.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OH",
        "city": "Mayfield Heights",
        "zipcode": "44124",
        "website": "http://www.ferro.com",
        "market_cap": 1472334464
    },
    "FUL": {
        "short_name": "H. B. Fuller Company",
        "long_name": "H.B. Fuller Company",
        "summary": "H.B. Fuller Company, together with its subsidiaries, formulates, manufactures, and markets adhesives, sealants, coatings, polymers, tapes, encapsulants, additives, and other specialty chemical products worldwide. The company operates through three segments: Hygiene, Health and Consumable Adhesives; Engineering Adhesives; and Construction Adhesives. The Hygiene, Health and Consumable Adhesives segment produces and supplies specialty industrial adhesives such as, thermoplastic, thermoset, reactive, and water-based and solvent-based products for applications in various markets, including food and beverage containers, flexible packaging, consumer goods, package integrity and re-enforcement, and non-durable goods; corrugation, folding carton, tape and label, paper converting, envelopes, books, multi-wall bags, sacks, and tissue and towel; disposable diapers, feminine care, and medical garments; and health and beauty. The Engineering Adhesives segment produces and supplies high performance industrial adhesives such as reactive, light cure, two-part liquids, polyurethane, silicone, film, and fast cure products to the appliances and filters, windows, doors and wood flooring, and textile, transportation, electronics, medical, clean energy, aerospace and defense, appliance, heavy machinery, and insulating glass markets. The Construction Adhesives segment provides products used for tile setting, commercial roofing, heating, ventilation, and air conditioning and insulation applications, as well as caulks and sealants for the consumer market and professional trade. The company sells its products directly through distributors and retailers. H.B. Fuller Company was founded in 1887 and is headquartered in Saint Paul, Minnesota.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MN",
        "city": "Saint Paul",
        "zipcode": "55110-5101",
        "website": "http://www.hbfuller.com",
        "market_cap": 3599337216
    },
    "G31.F": {
        "short_name": "G6 MATERIALS CORP.C.",
        "long_name": "G6 Materials Corp.",
        "summary": "G6 Materials Corp., through its subsidiaries, develops, manufactures, and sells proprietary composites and coatings based on graphene and other materials for naval, automotive, military, and aerospace applications. It offers air purification materials; general purpose, flexible, high-temperature, and room temperature adhesives; advanced materials and composite formulations for businesses and daily life, as well as aerospace, marine, and automotive industries; and organic chemicals, such as substituted aromatic and heterocyclic compounds, and other supplied molecules to research facilities in the pharmaceutical, agricultural and biotechnological industries, as well as to academic institutions and technology companies. The company also offers a selection of graphene and other 2D based R&D materials through its e-commerce platform. In addition, it offers a portfolio of specialty fused filament fabrication filaments; and holds new proprietary technology encompassing the preparation and separation of atomic layers of graphene. The company was formerly known as Graphene 3D Lab Inc. and changed its name to G6 Materials Corp. in January 2020. G6 Materials Corp. was incorporated in 2011 and is headquartered in Ronkonkoma, New York.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "Ronkonkoma",
        "zipcode": "11779",
        "website": "http://www.g6-materials.com",
        "market_cap": 13796112
    },
    "G3V.F": {
        "short_name": "GREEN PLAINS INC.",
        "long_name": "Green Plains Inc.",
        "summary": "Green Plains Inc. produces, markets, and distributes ethanol in the United States and internationally. It operates through four segments: Ethanol Production, Agribusiness and Energy Services, Food and Ingredients, and Partnership. The Ethanol Production segment produces and sells ethanol, distiller grains, and corn oil. The Agribusiness and Energy Services segment engages in the grain procurement, handling, and storage activities; and commodity marketing business, which purchases, markets, sells, and distributes ethanol, distiller grains, and corn oil, as well as grain, natural gas, and other commodities in various markets. This segment also provides grain drying and storage services to grain producers. The Food and Ingredients segment produces, trades in, and sells corn and soybean oil. The Partnership segment offers fuel storage and transportation services. As of December 31, 2020, it operated through 31 ethanol storage facilities; 6 fuel terminal facilities; and a fleet of approximately 2,480 leased railcars. The company was formerly known as Green Plains Renewable Energy, Inc. and changed its name to Green Plains Inc. in May 2014. Green Plains Inc. was founded in 2004 and is headquartered in Omaha, Nebraska.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NE",
        "city": "Omaha",
        "zipcode": "68106",
        "website": "http://www.gpreinc.com",
        "market_cap": 1246529152
    },
    "GCP": {
        "short_name": "GCP Applied Technologies Inc.",
        "long_name": "GCP Applied Technologies Inc.",
        "summary": "GCP Applied Technologies Inc. produces and sells specialty construction chemicals and specialty building materials worldwide. Its Specialty Construction Chemicals segment offers concrete admixtures under the CONCERA, CLARENA, ADVA, CLARENA RC40, STRUX, MIRA, TYTRO, POLARSET, ECLIPSE, DARACEM, DARASET, DCI, RECOVER, WRDA, and ZYLA brands; admixtures for decorative concrete under the PIERI brand; concrete production management and control systems under the VERIFI brand; engineered concrete slab systems under the DUCTILCRETE brand; and cement additives under the OPTEVA HE, TAVERO VM, CBA, SYNCHRO, HEA2, TDA, and ESE brands. The company's Specialty Building Materials segment provides building envelope products to protect structures from water, and manages air and vapor transmission through building walls under the BITUTHENE, PREPRUFE, ADPRUFE, HYDRODUCT, ADCOR, SILCOR, PERM-A-BARRIER, ELIMINATOR, RIW, and INTEGRITANK brands; and residential building products comprising specialty roofing membranes and flexible flashings under the ICE & WATER SHIELD, TRI-FLEX, ULTRA, and VYCOR brands. This segment also offers fire protection products under the MONOKOTE brand; chemical grouts for repair and remediation in waterproofing and soil stabilization applications under the DE NEEF, HYDRO ACTIVE, SWELLSEAL, and DE NEEF PURe brands; cementitious grouts and mortars for under filling and gap filling purposes under the BETEC brand; and specialty flooring products, such as flooring moisture barriers and installation products under the KOVARA and ORCON brands. The company was incorporated in 2015 and is headquartered in Cambridge, Massachusetts.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MA",
        "city": "Cambridge",
        "zipcode": "02140-1623",
        "website": "http://www.gcpat.com",
        "market_cap": 1710666880
    },
    "GEVO.MX": {
        "short_name": "GEVO INC",
        "long_name": "Gevo, Inc.",
        "summary": "Gevo, Inc. operates as a renewable fuels company. The company commercializes gasoline, jet fuel, and diesel fuel to achieve zero carbon emissions, and reduce greenhouse gas emissions with sustainable alternatives. Its products also include renewable biodiesel, isooctane, isobutanol, sustainable aviation fuel, isobutylene, ethanol, and animal feed. The company was formerly known as Methanotech, Inc. and changed its name to Gevo, Inc. in March 2006. Gevo, Inc. was founded in 2005 and is headquartered in Englewood, Colorado.",
        "currency": "MXN",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.gevo.com",
        "market_cap": 34763849728
    },
    "GEVO": {
        "short_name": "Gevo, Inc.",
        "long_name": "Gevo, Inc.",
        "summary": "Gevo, Inc. operates as a renewable fuels company. The company commercializes gasoline, jet fuel, and diesel fuel to achieve zero carbon emissions, and reduce greenhouse gas emissions with sustainable alternatives. Its products also include renewable biodiesel, isooctane, isobutanol, sustainable aviation fuel, isobutylene, ethanol, and animal feed. The company was formerly known as Methanotech, Inc. and changed its name to Gevo, Inc. in March 2006. Gevo, Inc. was founded in 2005 and is headquartered in Englewood, Colorado.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.gevo.com",
        "market_cap": 1105102336
    },
    "GGG.V": {
        "short_name": "G6 MATERIALS CORP",
        "long_name": "G6 Materials Corp.",
        "summary": "G6 Materials Corp., through its subsidiaries, develops, manufactures, and sells proprietary composites and coatings based on graphene and other materials for naval, automotive, military, and aerospace applications. It offers air purification materials; general purpose, flexible, high-temperature, and room temperature adhesives; advanced materials and composite formulations for businesses and daily life, as well as aerospace, marine, and automotive industries; and organic chemicals, such as substituted aromatic and heterocyclic compounds, and other supplied molecules to research facilities in the pharmaceutical, agricultural and biotechnological industries, as well as to academic institutions and technology companies. The company also offers a selection of graphene and other 2D based R&D materials through its e-commerce platform. In addition, it offers a portfolio of specialty fused filament fabrication filaments; and holds new proprietary technology encompassing the preparation and separation of atomic layers of graphene. The company was formerly known as Graphene 3D Lab Inc. and changed its name to G6 Materials Corp. in January 2020. G6 Materials Corp. was incorporated in 2011 and is headquartered in Ronkonkoma, New York.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "United States",
        "state": "NY",
        "city": "Ronkonkoma",
        "zipcode": "11779",
        "website": "http://www.g6-materials.com",
        "market_cap": 19294400
    },
    "GLGI": {
        "short_name": "GREYSTONE LOGISTICS",
        "long_name": "Greystone Logistics, Inc.",
        "summary": "Greystone Logistics, Inc., through its subsidiaries, manufactures and markets plastic pallets and pelletized recycled plastic resins. It offers rackable, can, nestable, display, monoblock, half-barrel and slim keg stackable, drum, and mid duty pallets. The company also offers tolling services. It sells its pallets directly, as well as through a network of independent contractor distributors. The company was formerly known as PalWeb Corporation and changed its name to Greystone Logistics, Inc. in March 2005. Greystone Logistics, Inc. was founded in 1969 and is based in Tulsa, Oklahoma.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "OK",
        "city": "Tulsa",
        "zipcode": "74120",
        "website": "http://greystonelogistics.com",
        "market_cap": 38287620
    },
    "GLYE": {
        "short_name": "GLYECO INC",
        "long_name": "GlyEco, Inc.",
        "summary": "GlyEco, Inc., a specialty chemical company, develops, manufactures, and distributes performance fluids for the automotive, commercial, and industrial markets in North America. It develops, manufactures, and markets additive packages for the antifreeze/coolant, gas patch coolant, and heat transfer industries; and METALGUARD additive package product line comprising one-step inhibitor systems to make various types of antifreeze concentrates and 50/50 coolants for automobiles, heavy-duty diesel engines, stationary engines in gas patch, and other applications, as well as METALGUARD heat transfer fluids that include propylene and ethylene glycol based light and heavy-duty fluids for various operating temperatures. It also operates a glycol re-distillation plant in West Virginia, which processes waste glycol into virgin quality recycled glycol for sale to industrial customers worldwide. GlyEco, Inc. was founded in 1996 and is based in Institute, West Virginia.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WV",
        "city": "Institute",
        "zipcode": "25112",
        "website": "http://www.glyeco.com",
        "market_cap": 73868
    },
    "GNPG": {
        "short_name": "GREEN PLANET GROUP INC",
        "long_name": "Green Planet Group, Inc.",
        "summary": "Green Planet Group, Inc., through its subsidiaries, produces lubricants and additives for use in gasoline and diesel engines, and other transportation related fluids. It also develops hydrogen generators for internal combustion engines to reduce pollution and improve fuel efficiency; develops green technologies for use in the mining of rare and precious metals, and elements; and develops Fast Track, a system for organic food. The company was formerly known as EMTA Holdings, Inc. and changed its name to Green Planet Group, Inc. in May 2009 as a result of merger with its subsidiary, Green Planet Group, Inc. The company is based in Tempe, Arizona.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Tempe",
        "zipcode": "85281",
        "website": "http://www.greenplanetgroup.com",
        "market_cap": 5669860
    },
    "GPHBF": {
        "short_name": "G6 MATERIALS CORP",
        "long_name": "G6 Materials Corp.",
        "summary": "G6 Materials Corp., through its subsidiaries, develops, manufactures, and sells proprietary composites and coatings based on graphene and other materials for naval, automotive, military, and aerospace applications. It offers air purification materials; general purpose, flexible, high-temperature, and room temperature adhesives; advanced materials and composite formulations for businesses and daily life, as well as aerospace, marine, and automotive industries; and organic chemicals, such as substituted aromatic and heterocyclic compounds, and other supplied molecules to research facilities in the pharmaceutical, agricultural and biotechnological industries, as well as to academic institutions and technology companies. The company also offers a selection of graphene and other 2D based R&D materials through its e-commerce platform. In addition, it offers a portfolio of specialty fused filament fabrication filaments; and holds new proprietary technology encompassing the preparation and separation of atomic layers of graphene. The company was formerly known as Graphene 3D Lab Inc. and changed its name to G6 Materials Corp. in January 2020. G6 Materials Corp. was incorporated in 2011 and is headquartered in Ronkonkoma, New York.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Ronkonkoma",
        "zipcode": "11779",
        "website": "http://www.g6-materials.com",
        "market_cap": 17319380
    },
    "GPRE": {
        "short_name": "Green Plains, Inc.",
        "long_name": "Green Plains Inc.",
        "summary": "Green Plains Inc. produces, markets, and distributes ethanol in the United States and internationally. It operates through four segments: Ethanol Production, Agribusiness and Energy Services, Food and Ingredients, and Partnership. The Ethanol Production segment produces and sells ethanol, distiller grains, and corn oil. The Agribusiness and Energy Services segment engages in the grain procurement, handling, and storage activities; and commodity marketing business, which purchases, markets, sells, and distributes ethanol, distiller grains, and corn oil, as well as grain, natural gas, and other commodities in various markets. This segment also provides grain drying and storage services to grain producers. The Food and Ingredients segment produces, trades in, and sells corn and soybean oil. The Partnership segment offers fuel storage and transportation services. As of December 31, 2020, it operated through 31 ethanol storage facilities; 6 fuel terminal facilities; and a fleet of approximately 2,480 leased railcars. The company was formerly known as Green Plains Renewable Energy, Inc. and changed its name to Green Plains Inc. in May 2014. Green Plains Inc. was founded in 2004 and is headquartered in Omaha, Nebraska.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NE",
        "city": "Omaha",
        "zipcode": "68106",
        "website": "http://www.gpreinc.com",
        "market_cap": 1447708544
    },
    "GRA.F": {
        "short_name": "GRACE + CO., W.R. (DEL.)",
        "long_name": "W. R. Grace & Co.",
        "summary": "W. R. Grace & Co., through its subsidiaries, produces and sells specialty chemicals and materials worldwide. It operates through two segments, Grace Catalysts Technologies and Grace Materials Technologies. The Grace Catalysts Technologies segment offers fluid catalytic cracking (FCC) catalysts for the production of transportation fuels, such as gasoline and diesel fuels, and petrochemicals; and FCC additives. This segment also provides hydro processing catalysts used in process reactors to upgrade heavy oils into lighter products; polyolefin and chemical catalysts used for the production of polypropylene and polyethylene thermoplastic resins; and chemical catalysts, as well as gas-phase polypropylene process technology to manufacture polypropylene products. The Grace Materials Technologies segment offers functional additives and process aids, such as silica gel, colloidal silica, zeolitic adsorbents, precipitated silica, and silica-aluminas; and fine chemical intermediates and regulatory starting materials for use in consumer/pharma, coatings, and chemical process applications. W. R. Grace & Co. was founded in 1854 and is headquartered in Columbia, Maryland.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MD",
        "city": "Columbia",
        "zipcode": "21044-4098",
        "website": "http://www.grace.com",
        "market_cap": 3721132800
    },
    "GRA": {
        "short_name": "W.R. Grace & Co.",
        "long_name": "W. R. Grace & Co.",
        "summary": "W. R. Grace & Co., through its subsidiaries, produces and sells specialty chemicals and materials worldwide. It operates through two segments, Grace Catalysts Technologies and Grace Materials Technologies. The Grace Catalysts Technologies segment offers fluid catalytic cracking (FCC) catalysts for the production of transportation fuels, such as gasoline and diesel fuels, and petrochemicals; and FCC additives. This segment also provides hydro processing catalysts used in process reactors to upgrade heavy oils into lighter products; polyolefin and chemical catalysts used for the production of polypropylene and polyethylene thermoplastic resins; and chemical catalysts, as well as gas-phase polypropylene process technology to manufacture polypropylene products. The Grace Materials Technologies segment offers functional additives and process aids, such as silica gel, colloidal silica, zeolitic adsorbents, precipitated silica, and silica-aluminas; and fine chemical intermediates and regulatory starting materials for use in consumer/pharma, coatings, and chemical process applications. W. R. Grace & Co. was founded in 1854 and is headquartered in Columbia, Maryland.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MD",
        "city": "Columbia",
        "zipcode": "21044-4098",
        "website": "http://www.grace.com",
        "market_cap": 4548601856
    },
    "HB1.F": {
        "short_name": "FULLER -H.B. CO.  DL 1",
        "long_name": "H.B. Fuller Company",
        "summary": "H.B. Fuller Company, together with its subsidiaries, formulates, manufactures, and markets adhesives, sealants, coatings, polymers, tapes, encapsulants, additives, and other specialty chemical products worldwide. The company operates through three segments: Hygiene, Health and Consumable Adhesives; Engineering Adhesives; and Construction Adhesives. The Hygiene, Health and Consumable Adhesives segment produces and supplies specialty industrial adhesives such as, thermoplastic, thermoset, reactive, and water-based and solvent-based products for applications in various markets, including food and beverage containers, flexible packaging, consumer goods, package integrity and re-enforcement, and non-durable goods; corrugation, folding carton, tape and label, paper converting, envelopes, books, multi-wall bags, sacks, and tissue and towel; disposable diapers, feminine care, and medical garments; and health and beauty. The Engineering Adhesives segment produces and supplies high performance industrial adhesives such as reactive, light cure, two-part liquids, polyurethane, silicone, film, and fast cure products to the appliances and filters, windows, doors and wood flooring, and textile, transportation, electronics, medical, clean energy, aerospace and defense, appliance, heavy machinery, and insulating glass markets. The Construction Adhesives segment provides products used for tile setting, commercial roofing, heating, ventilation, and air conditioning and insulation applications, as well as caulks and sealants for the consumer market and professional trade. The company sells its products directly through distributors and retailers. H.B. Fuller Company was founded in 1887 and is headquartered in Saint Paul, Minnesota.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MN",
        "city": "Saint Paul",
        "zipcode": "55110-5101",
        "website": "http://www.hbfuller.com",
        "market_cap": 3054710528
    },
    "HDSN": {
        "short_name": "Hudson Technologies, Inc.",
        "long_name": "Hudson Technologies, Inc.",
        "summary": "Hudson Technologies, Inc. a refrigerant services company, provides solutions to recurring problems within the refrigeration industry primarily in the United States. The company's products and services include refrigerant and industrial gas sales; refrigerant management services consisting primarily of reclamation of refrigerants, re-usable cylinder refurbishment, and hydrostatic testing services; and RefrigerantSide services comprising system decontamination to remove moisture, oils, and other contaminants. It also offers SmartEnergy OPS service, a web-based real time continuous monitoring service; and Chiller Chemistry and Chill Smart services. In addition, the company participates in the generation of carbon offset projects. It serves commercial, industrial, and governmental customers, as well as refrigerant wholesalers, distributors, contractors, and refrigeration equipment manufacturers. Hudson Technologies, Inc. was founded in 1991 and is headquartered in Pearl River, New York.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Pearl River",
        "zipcode": "10965",
        "website": "http://www.hudsontech.com",
        "market_cap": 93711816
    },
    "HERC": {
        "short_name": "H.E.R.C PRODUCTS INC",
        "long_name": "H.E.R.C. Products Inc.",
        "summary": "H.E.R.C. Products Incorporated and its subsidiaries provide pipeline rehabilitation, tank cleaning, and other services for marine, fire protection, potable water, wastewater, industrial, and other systems primarily in the United States. Its products include pipe-klean and well-klean, which removes encrustation from water pumping and distribution systems; compound 360 and compound 400, which cleans and maintains cooling and other water treatment systems; and line-out, which cleans drip irrigation systems and removes salt from soil surfaces. The company offers its products primarily to municipal, industrial, governmental, commercial, and other customers directly and through strategic marketing alliances. H.E.R.C. Products Incorporated was incorporated in 1986 and is headquartered in Portsmouth, Virginia.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Portsmouth",
        "zipcode": "23704",
        "website": "http://www.hercprod.com",
        "market_cap": 43032
    },
    "HT4.F": {
        "short_name": "HUDSON TECHS INC.  DL-,01",
        "long_name": "Hudson Technologies, Inc.",
        "summary": "Hudson Technologies, Inc. a refrigerant services company, provides solutions to recurring problems within the refrigeration industry primarily in the United States. The company's products and services include refrigerant and industrial gas sales; refrigerant management services consisting primarily of reclamation of refrigerants, re-usable cylinder refurbishment, and hydrostatic testing services; and RefrigerantSide services comprising system decontamination to remove moisture, oils, and other contaminants. It also offers SmartEnergy OPS service, a web-based real time continuous monitoring service; and Chiller Chemistry and Chill Smart services. In addition, the company participates in the generation of carbon offset projects. It serves commercial, industrial, and governmental customers, as well as refrigerant wholesalers, distributors, contractors, and refrigeration equipment manufacturers. Hudson Technologies, Inc. was founded in 1991 and is headquartered in Pearl River, New York.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "Pearl River",
        "zipcode": "10965",
        "website": "http://www.hudsontech.com",
        "market_cap": 103250136
    },
    "HWKN": {
        "short_name": "Hawkins, Inc.",
        "long_name": "Hawkins, Inc.",
        "summary": "Hawkins, Inc. blends, manufactures, and distributes chemicals and other specialty ingredients in the United States and internationally. It operates through three segments: Industrial, Water Treatment, and Health and Nutrition. The Industrial segment offers industrial chemicals, products, and services to agriculture, chemical processing, electronics, energy, food, pharmaceutical, and plating industries. This segment primarily provides acids, alkalis, and industrial and food-grade salts. It also receives, stores, and distributes various chemicals in bulk quantities, such as liquid caustic soda, sulfuric acid, hydrochloric acid, urea, phosphoric acid, aqua ammonia, and potassium hydroxide. In addition, this segment manufactures sodium hypochlorite and agricultural products, as well as various food-grade products that include liquid phosphates, lactates, and other blended products; repackages water treatment chemicals and bulk industrial chemicals; and performs custom blending of chemicals, and contract and private label bleach packaging. The Water Treatment segment offers chemicals, equipment, and solutions for potable water, municipal and industrial wastewater, industrial process water, and non-residential swimming pool and agriculture water. The Health and Nutrition segment offers ingredient distribution, processing, and formulation solutions to manufacturers of nutraceutical, functional food and beverage, personal care, dietary supplement and other nutritional food, and health and wellness products. Its products portfolio includes minerals, botanicals and herbs, vitamins and amino acids, excipients, joint products, sweeteners, and enzymes. The company was founded in 1938 and is headquartered in Roseville, Minnesota.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "MN",
        "city": "Roseville",
        "zipcode": "55113",
        "website": "http://www.hawkinsinc.com",
        "market_cap": 698207104
    },
    "HXOH": {
        "short_name": "HEXION HLDGS CORP",
        "long_name": "Hexion Holdings Corp.",
        "summary": "Hexion Holdings Corporation, through its subsidiaries, operates in the specialty chemicals industry that produces thermosetting resins, and adhesive and structural resins and coatings. The company was incorporated in 2019 and is based in Columbus, Ohio.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Columbus",
        "zipcode": "43215-3707",
        "website": null,
        "market_cap": null
    },
    "HYDI": {
        "short_name": "HYDROMER INC",
        "long_name": "Hydromer, Inc.",
        "summary": "Hydromer, Inc. invents, develops, patents, licenses, manufactures, and sells hydrophilic polymer-based products and services in the United States and internationally. The company operates in two segments, Polymer Research and Medical Products. It offers medical coatings and services; medical hydrogel; cosmetic intermediaries; and anti-fog/anti-frost condensation control coating products. The company also provides cosmetics and personal care products, and watercraft hulls coating products; and engineering and contract coating services. It serves the medical, cosmetics, animal health, and industrial fields. Hydromer, Inc. was founded in 1980 and is based in Branchburg, New Jersey.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Branchburg",
        "zipcode": "08876-3424",
        "website": "http://www.hydromer.com",
        "market_cap": 2605616
    },
    "I1CE34.SA": {
        "short_name": "INTERCONTINEDRN",
        "long_name": "Intercontinental Exchange, Inc.",
        "summary": "Intercontinental Exchange, Inc. operates regulated exchanges, clearing houses, and listings venues for commodity, financial, fixed income, and equity markets in the United States, the United Kingdom, the European Union, Singapore, Israel, and Canada. It operates through three segments: Exchanges, Fixed Income and Data Services, and Mortgage Technology. The company operates marketplaces for listing, trading, and clearing an array of derivatives contracts and financial securities, such as commodities, interest rates, foreign exchange, and equities, as well as corporate and exchange-traded funds; trading venues, including 12 regulated exchanges and six clearing houses; and offers futures and options products for energy, agricultural and metals, financial, cash equities and equity, over-the-counter, and other markets, as well as listings and data and connectivity services. It also provides fixed income data and analytic, fixed income execution, CDS clearing, and other multi-asset class data and network services. In addition, the company offers proprietary and comprehensive mortgage origination platform, which serves residential mortgage loans; network and closing solutions that provides customers connectivity to the mortgage supply chain and facilitates the secure exchange of information; data and analytics services; and Data as a Service for lenders to access data and origination information. Intercontinental Exchange, Inc. was founded in 2000 and is headquartered in Atlanta, Georgia.",
        "currency": "BRL",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30328",
        "website": "http://www.intercontinentalexchange.com",
        "market_cap": 183935647744
    },
    "I1FF34.SA": {
        "short_name": "FLAVOR FLAGRDRN",
        "long_name": "International Flavors & Fragrances Inc.",
        "summary": "International Flavors & Fragrances Inc., together with its subsidiaries, manufactures and sells cosmetic active and natural health ingredients for use in various consumer products in Europe, Africa, the Middle East, Greater Asia, North America, and Latin America. It operates through four segments: Nourish, Scent, Health & Biosciences, and Pharma Solutions. The Nourish segment offers flavor compounds; savory solutions, such as marinades or powder blends of flavors, natural colors, seasonings, functional ingredients, and natural anti-oxidants; and inclusions. It also provides nutrition and specialty ingredients primarily consist of natural health ingredients, natural food protection products, and natural colors and flavor ingredients. The Scent segment provides fragrance compounds, which include fine fragrances comprising perfumes and colognes, as well as consumer fragrances; fragrance ingredients comprising synthetic and natural ingredients that could be combined with other materials to create fragrance and consumer compounds; and cosmetic active ingredients consisting of active and functional ingredients, botanicals, and delivery systems to support its customers' cosmetic and personal care product lines. The Health & Biosciences segment develops and produces enzymes, food cultures, probiotics, and specialty ingredients. The Pharma Solutions segment produces and sells cellulosics and alginates-based pharma excipients. The company sells its products primarily to manufacturers of perfumes and cosmetics, hair and other personal care products, soaps and detergents, cleaning products, dairy, meat and other processed foods, beverages, snacks and savory foods, sweet and baked goods, dietary supplements, infant and elderly nutrition, functional food, and pharmaceutical and oral care products. International Flavors & Fragrances Inc. was founded in 1833 and is headquartered in New York, New York.",
        "currency": "BRL",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10019",
        "website": "http://www.iff.com",
        "market_cap": 194634989568
    },
    "IFF.F": {
        "short_name": "INTL FLAVORS/FRAG.DL-,125",
        "long_name": "International Flavors & Fragrances Inc.",
        "summary": "International Flavors & Fragrances Inc., together with its subsidiaries, manufactures and sells cosmetic active and natural health ingredients for use in various consumer products in Europe, Africa, the Middle East, Greater Asia, North America, and Latin America. It operates through four segments: Nourish, Scent, Health & Biosciences, and Pharma Solutions. The Nourish segment offers flavor compounds; savory solutions, such as marinades or powder blends of flavors, natural colors, seasonings, functional ingredients, and natural anti-oxidants; and inclusions. It also provides nutrition and specialty ingredients primarily consist of natural health ingredients, natural food protection products, and natural colors and flavor ingredients. The Scent segment provides fragrance compounds, which include fine fragrances comprising perfumes and colognes, as well as consumer fragrances; fragrance ingredients comprising synthetic and natural ingredients that could be combined with other materials to create fragrance and consumer compounds; and cosmetic active ingredients consisting of active and functional ingredients, botanicals, and delivery systems to support its customers' cosmetic and personal care product lines. The Health & Biosciences segment develops and produces enzymes, food cultures, probiotics, and specialty ingredients. The Pharma Solutions segment produces and sells cellulosics and alginates-based pharma excipients. The company sells its products primarily to manufacturers of perfumes and cosmetics, hair and other personal care products, soaps and detergents, cleaning products, dairy, meat and other processed foods, beverages, snacks and savory foods, sweet and baked goods, dietary supplements, infant and elderly nutrition, functional food, and pharmaceutical and oral care products. International Flavors & Fragrances Inc. was founded in 1833 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10019",
        "website": "http://www.iff.com",
        "market_cap": 30602360832
    },
    "IFF": {
        "short_name": "Internationa Flavors & Fragranc",
        "long_name": "International Flavors & Fragrances Inc.",
        "summary": "International Flavors & Fragrances Inc., together with its subsidiaries, manufactures and sells cosmetic active and natural health ingredients for use in various consumer products in Europe, Africa, the Middle East, Greater Asia, North America, and Latin America. It operates through four segments: Nourish, Scent, Health & Biosciences, and Pharma Solutions. The Nourish segment offers flavor compounds; savory solutions, such as marinades or powder blends of flavors, natural colors, seasonings, functional ingredients, and natural anti-oxidants; and inclusions. It also provides nutrition and specialty ingredients primarily consist of natural health ingredients, natural food protection products, and natural colors and flavor ingredients. The Scent segment provides fragrance compounds, which include fine fragrances comprising perfumes and colognes, as well as consumer fragrances; fragrance ingredients comprising synthetic and natural ingredients that could be combined with other materials to create fragrance and consumer compounds; and cosmetic active ingredients consisting of active and functional ingredients, botanicals, and delivery systems to support its customers' cosmetic and personal care product lines. The Health & Biosciences segment develops and produces enzymes, food cultures, probiotics, and specialty ingredients. The Pharma Solutions segment produces and sells cellulosics and alginates-based pharma excipients. The company sells its products primarily to manufacturers of perfumes and cosmetics, hair and other personal care products, soaps and detergents, cleaning products, dairy, meat and other processed foods, beverages, snacks and savory foods, sweet and baked goods, dietary supplements, infant and elderly nutrition, functional food, and pharmaceutical and oral care products. International Flavors & Fragrances Inc. was founded in 1833 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10019",
        "website": "http://www.iff.com",
        "market_cap": 35378577408
    },
    "IFFT": {
        "short_name": "International Flavors & Fragran",
        "long_name": "International Flavors & Fragrances Inc.",
        "summary": "International Flavors & Fragrances Inc., together with its subsidiaries, manufactures and sells cosmetic active and natural health ingredients for use in various consumer products in Europe, Africa, the Middle East, Greater Asia, North America, and Latin America. It operates through four segments: Nourish, Scent, Health & Biosciences, and Pharma Solutions. The Nourish segment offers flavor compounds; savory solutions, such as marinades or powder blends of flavors, natural colors, seasonings, functional ingredients, and natural anti-oxidants; and inclusions. It also provides nutrition and specialty ingredients primarily consist of natural health ingredients, natural food protection products, and natural colors and flavor ingredients. The Scent segment provides fragrance compounds, which include fine fragrances comprising perfumes and colognes, as well as consumer fragrances; fragrance ingredients comprising synthetic and natural ingredients that could be combined with other materials to create fragrance and consumer compounds; and cosmetic active ingredients consisting of active and functional ingredients, botanicals, and delivery systems to support its customers' cosmetic and personal care product lines. The Health & Biosciences segment develops and produces enzymes, food cultures, probiotics, and specialty ingredients. The Pharma Solutions segment produces and sells cellulosics and alginates-based pharma excipients. The company sells its products primarily to manufacturers of perfumes and cosmetics, hair and other personal care products, soaps and detergents, cleaning products, dairy, meat and other processed foods, beverages, snacks and savory foods, sweet and baked goods, dietary supplements, infant and elderly nutrition, functional food, and pharmaceutical and oral care products. International Flavors & Fragrances Inc. was founded in 1833 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10019",
        "website": "http://www.iff.com",
        "market_cap": null
    },
    "IGX.F": {
        "short_name": "INGEVITY CORP.  DL-,01",
        "long_name": "Ingevity Corporation",
        "summary": "Ingevity Corporation manufactures and sells specialty chemicals and activated carbon materials in North America, the Asia-Pacific, Europe, the Middle East, Africa, and South America. The company operates through two segments, Performance Materials and Performance Chemicals. The Performance Materials segment engineers, manufactures, and sells hardwood-based and chemically activated carbon products primarily for use in gasoline vapor emission control systems in cars, motorcycles, trucks, and boats. This segment also produces other activated carbon products for use in various applications, including food, water, beverage, and chemical purification. The Performance Chemicals segment develops, manufactures, and sells a range of specialty chemicals derived from co-products of the kraft pulping process and caprolactone monomers. This segment's products are used in various applications comprising warm mix paving, pavement preservation, pavement reconstruction and recycling, oil well service additives, oil production, and downstream applications; and adhesives, agrochemical dispersants, lubricants, printing inks, coatings, resins, elastomers, bioplastics, medical devices, and other industrial applications. Ingevity Corporation was incorporated in 2015 and is headquartered in North Charleston, South Carolina.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "SC",
        "city": "North Charleston",
        "zipcode": "29405",
        "website": "http://www.ingevity.com",
        "market_cap": 2836728064
    },
    "IKNX": {
        "short_name": "Ikonics Corporation",
        "long_name": "IKONICS Corporation",
        "summary": "IKONICS Corporation develops, manufactures, and sells photosensitive liquids and films for screen printing, awards and recognition, and dye sublimation markets worldwide. It operates through four segments: Chromaline, IKONICS Imaging, Digital Texturing, and Advanced Material Solutions. The company sells screen printing films, emulsions, and inkjet receptive films, photo resistant films, art supplies, glass, and related abrasive etching equipment to end users and distributors. It also provides sound deadening and weight reduction technology to the aerospace and electronics industries; products and services for etched composites, ceramics, glass, and silicon wafers; and digital texturing technology for putting patterns and textures into steel molds for the plastic injection molding and prototyping. IKONICS Corporation markets and sells its products directly, as well as through domestic and international distributors, magazine advertising, trade shows, and the internet. The company was formerly known as The Chromaline Corporation and changed its name to IKONICS Corporation in December 2002. IKONICS Corporation was founded in 1952 and is based in Duluth, Minnesota.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "MN",
        "city": "Duluth",
        "zipcode": "55807",
        "website": "http://www.ikonics.com",
        "market_cap": 20344358
    },
    "INTK": {
        "short_name": "INDUSTRIAL NANOTECH INC",
        "long_name": "Industrial Nanotech, Inc.",
        "summary": "Industrial Nanotech, Inc. develops, manufactures, and markets industrial grade insulation products utilizing nanotechnology in the United States and internationally. Its products include Nansulate Translucent PT and Nansulate Translucent High Heat, which are protective thermal insulation and corrosion prevention coatings; EPX4 for total asset protection; Nansulate Translucent GP Â\u0096 NSF, an insulation and mold resistant coating for food sensitive environments; Home Protect ClearCoat, a protective insulation and mold prevention coating; Nansulate Energy Protect, an industrial and commercial insulation and protective coating; Nansulate Crystal Roof Coating for clear energy saving and mold resistant protection; Intelligent Shield, which offers cool color choices for exterior painting projects; Nansulate LDX Clear Lead Encapsulation Coating for lead abatement; NANOBOOST , an automotive coating; Bee Protect that is formulated to protect bees in their hives; and Nansulate Insulation for solar panels, solar water heaters, and solar thermal equipment. The company was founded in 2005 and is based in Naples, Florida.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Naples",
        "zipcode": "34109",
        "website": "http://www.industrial-nanotech.com",
        "market_cap": 10045305
    },
    "IOSP": {
        "short_name": "Innospec Inc.",
        "long_name": "Innospec Inc.",
        "summary": "Innospec Inc. develops, manufactures, blends, markets, and supplies specialty chemicals in the United States, rest of North America, the United Kingdom, rest of Europe, and internationally. It operates through Fuel Specialties, Performance Chemicals, and Oilfield Services segments. The Fuel Specialties segment offers a range of specialty chemical products used as additives in various fuels. Its products are used in the operation of automotive, marine, and aviation engines; power station generators; and heating oil. The Performance Chemicals segment provides technology-based solutions for its customers' processes or products focused in the personal care, home care, agrochemical, and metal extraction markets. The Oilfield Services segment develops and markets products to prevent loss of mud in drilling operations; chemical solutions for fracturing, stimulation, and completion operations; and products for oil and gas production, which enable flow assurance and maintain asset integrity. It sells its products primarily to oil and gas exploration and production companies, oil refineries, fuel manufacturers and users, personal care and home care companies, formulators of agrochemical and metal extraction formulations, and other chemical and industrial companies. The company was formerly known as Octel Corp. and changed its name to Innospec Inc. in January 2006. Innospec Inc. was founded in 1938 and is headquartered in Englewood, Colorado.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.innospecinc.com",
        "market_cap": 2441988352
    },
    "ITX.L": {
        "short_name": "ITACONIX PLC ORD 1P",
        "long_name": "Itaconix plc",
        "summary": "Itaconix plc, together with its subsidiaries, designs, develops, manufactures, and sells bio-based polymers for personal care, home care, and industrial sectors in North America and Europe. The company's home care and industrial products include Itaconix TSI, Itaconix DSP, Itaconix CHT, and Itaconix VELASOFT water soluble polymers; and Itaconix ZINADOR 22L and 35L, which are water soluble odor neutralizers. Its personal care products comprise Itaconix VELAFRESH ZP20 and ZP30 that are water soluble fixating complexes; and Nouryon Amaze SP, a hair styling ingredient. The company was formerly known as Revolymer plc and changed its name to Itaconix plc in February 2017. Itaconix plc was incorporated in 2012 and is headquartered in Stratham, New Hampshire.",
        "currency": "GBp",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United States",
        "state": "NH",
        "city": "Stratham",
        "zipcode": "03885",
        "website": "http://www.itaconix.com",
        "market_cap": 60573172
    },
    "ITXXF": {
        "short_name": "ITACONIX PLC",
        "long_name": "Itaconix plc",
        "summary": "Itaconix plc, together with its subsidiaries, designs, develops, manufactures, and sells bio-based polymers for personal care, home care, and industrial sectors in North America and Europe. The company's home care and industrial products include Itaconix TSI, Itaconix DSP, Itaconix CHT, and Itaconix VELASOFT water soluble polymers; and Itaconix ZINADOR 22L and 35L, which are water soluble odor neutralizers. Its personal care products comprise Itaconix VELAFRESH ZP20 and ZP30 that are water soluble fixating complexes; and Nouryon Amaze SP, a hair styling ingredient. The company was formerly known as Revolymer plc and changed its name to Itaconix plc in February 2017. Itaconix plc was incorporated in 2012 and is headquartered in Stratham, New Hampshire.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NH",
        "city": "Stratham",
        "zipcode": "03885",
        "website": "http://www.itaconix.com",
        "market_cap": 76445592
    },
    "K1W.F": {
        "short_name": "KRONOS WORLDWIDE  DL-,01",
        "long_name": "Kronos Worldwide, Inc.",
        "summary": "Kronos Worldwide, Inc. produces and markets titanium dioxide pigments (TiO2) in Europe, North America, the Asia Pacific, and internationally. The company produces TiO2 in two crystalline forms, rutile and anatase to impart whiteness, brightness, opacity, and durability for various products, including paints, coatings, plastics, paper, fibers, and ceramics, as well as for various specialty products, such as inks, foods, and cosmetics. It also produces ilmenite, a raw material used directly as a feedstock by sulfate-process TiO2 plants; iron-based chemicals, which are used as treatment and conditioning agents for industrial effluents and municipal wastewater, as well as in the manufacture of iron pigments, cement, and agricultural products; titanium oxychloride for use in the formulation of pearlescent pigments, and production of electroceramic capacitors for cell phones and other electronic devices; and titanyl sulfate that is used in pearlescent pigments, natural gas pipe, and other specialty applications. In addition, the company provides technical services for its products. It sells its products under the KRONOS brand through agents and distributors to paint, plastics, decorative laminate, and paper manufacturers. The company was founded in 1916 and is headquartered in Dallas, Texas. Kronos Worldwide, Inc. is a subsidiary of Valhi, Inc.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75240-2620",
        "website": "http://kronostio2.com",
        "market_cap": 1510207744
    },
    "K21.F": {
        "short_name": "KRATON CORP. DL -,01",
        "long_name": "Kraton Corporation",
        "summary": "Kraton Corporation manufactures and sells styrenic block copolymers, specialty polymers, and other products in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It operates in two segments, Polymer and Chemical. The Polymer segment offers performance products, including styrene-butadiene-styrene for paving and roofing application; styrene-isoprene-styrene for personal care application; ethylene-vinyl acetate, polyolefins, and metallocene polyolefins for adhesives application; and specialty polymers, such as hydrogenated styrenic block copolymer, isoprene rubber, and isoprene rubber latex for use in medical and personal care products, adhesives, tackifiers, paints, and coatings. The Chemical segment provides pine-based specialty products that include rosin-based tackifiers for packaging and pressure-sensitive adhesive applications; terpene-based tackifiers for bookbinding, hygiene, and pressure-sensitive adhesive applications; alpha-methyl-styrene (AMS) resins for bookbinding and pressure-sensitive adhesive applications; and hot melt polyamides for flexible packaging, industrial, and road making applications. This segment also provides tall oil fatty acids; tall oil rosin; distilled tall oil; tall oil pitch; and rosin-based binders for the thermoplastic pavement marking submarket, as well as produces insoluble maleic-based tackifiers. In addition, this segment offers terpene-based tread enhancement resins and AMS-based tread enhancement additives; and dimer acids and terpene fractions for fuel additives, oilfield chemicals, mining fluids, coatings, metalworking fluids, and lubricants. It sells its products through various channels, including direct sales force, marketing representatives, and distributors under the Kraton brand. The company was formerly known as Kraton Performance Polymers, Inc. and changed its name to Kraton Corporation in September 2016. Kraton Corporation was incorporated in 2009 and is based in Houston, Texas.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77032",
        "website": "http://www.kraton.com",
        "market_cap": 921520640
    },
    "KBLB": {
        "short_name": "KRAIG BIOCRAFT LABORATORIES INC",
        "long_name": "Kraig Biocraft Laboratories, Inc.",
        "summary": "Kraig Biocraft Laboratories, Inc. focuses on developing protein based fibers using recombinant DNA technology for commercial applications in the technical textile and specialty fiber industries in the United States. The company's products are used in military and police applications for ballistic protection; industrial applications, including critical cables and abrasion/impact resistant components; safety equipment; and composite materials for the aero-space industry. Its products are also used in various markets, such as medical textiles, geotextiles, defense and military textiles, safe and protective clothing, filtration textiles, composites with textile structure, and functional and sportive textiles, as well as textiles used in buildings and transportation. The company was incorporated in 2006 and is based in Ann Arbor, Michigan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MI",
        "city": "Ann Arbor",
        "zipcode": "48104",
        "website": "http://www.kraiglabs.com",
        "market_cap": 105092432
    },
    "KO9.F": {
        "short_name": "KOPPERS HOLDINGS  DL-,01",
        "long_name": "Koppers Holdings Inc.",
        "summary": "Koppers Holdings Inc. provides treated wood products, wood treatment chemicals, and carbon compounds in the United States, Australasia, Europe, and internationally. The company operates through three segments: Railroad and Utility Products and Services (RUPS), Performance Chemicals (PC), and Carbon Materials and Chemicals (CMC). The RUPS segment procures and treats crossties, switch ties, and various types of lumber used for railroad bridges and crossings. It also provides rail joint bars to join rails together for railroads; transmission and distribution poles for electric and telephone utilities; and pilings. This segment also provides railroad services, such as engineering, design, repair, and inspection services for railroad bridges. The PC segment develops, manufactures, and markets copper-based wood preservatives, including micronized copper azole, micronized pigments, alkaline copper quaternary, amine copper azole, and chromated copper arsenate for decking, fencing, utility poles, construction lumber and timbers, and various agricultural uses; water-based wood preservatives and wood specialty additives; and supplies fire-retardant chemicals for pressure treatment of wood primarily in commercial construction. The CMC segment manufactures creosote for use in the treatment of wood or as a feedstock in the production of carbon black; carbon pitch, a raw material used in the production of aluminum and steel; naphthalene for use as a feedstock in the production of phthalic anhydride and as a surfactant in the production of concrete; phthalic anhydride for the production of plasticizers, polyester resins, and alkyd paints; and carbon black feedstock for use in the production of carbon black. The company serves the railroad, specialty chemical, utility, residential lumber, agriculture, aluminum, steel, rubber, and construction industries. Koppers Holdings Inc. was founded in 1988 and is headquartered in Pittsburgh, Pennsylvania.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "Pittsburgh",
        "zipcode": "15219-1800",
        "website": "http://www.koppers.com",
        "market_cap": 603079360
    },
    "KOP": {
        "short_name": "Koppers Holdings Inc. Koppers H",
        "long_name": "Koppers Holdings Inc.",
        "summary": "Koppers Holdings Inc. provides treated wood products, wood treatment chemicals, and carbon compounds in the United States, Australasia, Europe, and internationally. The company operates through three segments: Railroad and Utility Products and Services (RUPS), Performance Chemicals (PC), and Carbon Materials and Chemicals (CMC). The RUPS segment procures and treats crossties, switch ties, and various types of lumber used for railroad bridges and crossings. It also provides rail joint bars to join rails together for railroads; transmission and distribution poles for electric and telephone utilities; and pilings. This segment also provides railroad services, such as engineering, design, repair, and inspection services for railroad bridges. The PC segment develops, manufactures, and markets copper-based wood preservatives, including micronized copper azole, micronized pigments, alkaline copper quaternary, amine copper azole, and chromated copper arsenate for decking, fencing, utility poles, construction lumber and timbers, and various agricultural uses; water-based wood preservatives and wood specialty additives; and supplies fire-retardant chemicals for pressure treatment of wood primarily in commercial construction. The CMC segment manufactures creosote for use in the treatment of wood or as a feedstock in the production of carbon black; carbon pitch, a raw material used in the production of aluminum and steel; naphthalene for use as a feedstock in the production of phthalic anhydride and as a surfactant in the production of concrete; phthalic anhydride for the production of plasticizers, polyester resins, and alkyd paints; and carbon black feedstock for use in the production of carbon black. The company serves the railroad, specialty chemical, utility, residential lumber, agriculture, aluminum, steel, rubber, and construction industries. Koppers Holdings Inc. was founded in 1988 and is headquartered in Pittsburgh, Pennsylvania.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Pittsburgh",
        "zipcode": "15219-1800",
        "website": "http://www.koppers.com",
        "market_cap": 811632320
    },
    "KRA": {
        "short_name": "Kraton Corporation",
        "long_name": "Kraton Corporation",
        "summary": "Kraton Corporation manufactures and sells styrenic block copolymers, specialty polymers, and other products in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It operates in two segments, Polymer and Chemical. The Polymer segment offers performance products, including styrene-butadiene-styrene for paving and roofing application; styrene-isoprene-styrene for personal care application; ethylene-vinyl acetate, polyolefins, and metallocene polyolefins for adhesives application; and specialty polymers, such as hydrogenated styrenic block copolymer, isoprene rubber, and isoprene rubber latex for use in medical and personal care products, adhesives, tackifiers, paints, and coatings. The Chemical segment provides pine-based specialty products that include rosin-based tackifiers for packaging and pressure-sensitive adhesive applications; terpene-based tackifiers for bookbinding, hygiene, and pressure-sensitive adhesive applications; alpha-methyl-styrene (AMS) resins for bookbinding and pressure-sensitive adhesive applications; and hot melt polyamides for flexible packaging, industrial, and road making applications. This segment also provides tall oil fatty acids; tall oil rosin; distilled tall oil; tall oil pitch; and rosin-based binders for the thermoplastic pavement marking submarket, as well as produces insoluble maleic-based tackifiers. In addition, this segment offers terpene-based tread enhancement resins and AMS-based tread enhancement additives; and dimer acids and terpene fractions for fuel additives, oilfield chemicals, mining fluids, coatings, metalworking fluids, and lubricants. It sells its products through various channels, including direct sales force, marketing representatives, and distributors under the Kraton brand. The company was formerly known as Kraton Performance Polymers, Inc. and changed its name to Kraton Corporation in September 2016. Kraton Corporation was incorporated in 2009 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77032",
        "website": "http://www.kraton.com",
        "market_cap": 1224364928
    },
    "KRO": {
        "short_name": "Kronos Worldwide Inc",
        "long_name": "Kronos Worldwide, Inc.",
        "summary": "Kronos Worldwide, Inc. produces and markets titanium dioxide pigments (TiO2) in Europe, North America, the Asia Pacific, and internationally. The company produces TiO2 in two crystalline forms, rutile and anatase to impart whiteness, brightness, opacity, and durability for various products, including paints, coatings, plastics, paper, fibers, and ceramics, as well as for various specialty products, such as inks, foods, and cosmetics. It also produces ilmenite, a raw material used directly as a feedstock by sulfate-process TiO2 plants; iron-based chemicals, which are used as treatment and conditioning agents for industrial effluents and municipal wastewater, as well as in the manufacture of iron pigments, cement, and agricultural products; titanium oxychloride for use in the formulation of pearlescent pigments, and production of electroceramic capacitors for cell phones and other electronic devices; and titanyl sulfate that is used in pearlescent pigments, natural gas pipe, and other specialty applications. In addition, the company provides technical services for its products. It sells its products under the KRONOS brand through agents and distributors to paint, plastics, decorative laminate, and paper manufacturers. The company was founded in 1916 and is headquartered in Dallas, Texas. Kronos Worldwide, Inc. is a subsidiary of Valhi, Inc.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75240-2620",
        "website": "http://kronostio2.com",
        "market_cap": 1794382720
    },
    "KWR": {
        "short_name": "Quaker Chemical Corporation",
        "long_name": "Quaker Chemical Corporation",
        "summary": "Quaker Chemical Corporation develops, produces, and markets various formulated chemical specialty products for a range of heavy industrial and manufacturing applications. It operates through four segments: Americas; Europe, Middle East, and Africa; Asia/Pacific; and Global Specialty Businesses. The company offers metal removal fluids, cleaning fluids, corrosion inhibitors, metal drawing and forming fluids, die cast mold releases, heat treatment and quenchants, metal forging fluids, hydraulic fluids, specialty greases, metal finishing fluids, offshore sub-sea energy control fluids, rolling lubricants, rod and wire drawing fluids, and surface treatment chemicals. It also provides chemical management services. The company serves steel, aluminum, automotive, aerospace, offshore, can, mining, and metalworking companies. The company was formerly known as Quaker Chemical Products Corporation and changed its name to Quaker Chemical Corporation in August 1962. Quaker Chemical Corporation was founded in 1918 and is headquartered in Conshohocken, Pennsylvania.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Conshohocken",
        "zipcode": "19428-2380",
        "website": "http://www.quakerchem.com",
        "market_cap": 4315136000
    },
    "KYZN": {
        "short_name": "KYZEN CORP",
        "long_name": "Kyzen Corp.",
        "summary": "Kyzen Corp. provides environmental cleaning technologies and solutions worldwide. It offers AQUANOX, a concentrated aqueous cleaning chemistry for the electronic assembly, aerospace, and automotive industries; Solstice PF, a fluorinated solvent for use in electronics, metal finishing, and oxygen systems cleaning applications; IONOX, a semi-aqueous solvent electronics cleaner for the electronic assembly and packaging product applications; Cybersolv products used in benchtop, stencil, and maintenance cleaning applications; and KYZEN line of products for use in electronic assembly, metal finishing, aerospace, and automotive industries. The company also provides METALNOX, a solvent and aqueous precision cleaning chemistry product for removing tough soils and cleaning metal parts used in the metal finishing, industrial, and tooling industries; MICRONOX, a semiconductor grade cleaning chemistry product for defluxing and particulate removal for the packaging, microelectronics, and semiconductor industries; OPTISOLV, an aqueous product for specialty cleaning of precision optics, glass, plastics, and ophthalmic substrates; and additional products for use in contract manufacturing, stencil, and maintenance applications. In addition, it offers application and advanced cleaning, analytical development, and engineering solutions. The company was founded in 1990 and is headquartered in Nashville, Tennessee.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TN",
        "city": "Nashville",
        "zipcode": "37211",
        "website": "http://www.kyzen.com",
        "market_cap": 2695883
    },
    "L1YB34.SA": {
        "short_name": "LYONDELLBASEDRN",
        "long_name": "LyondellBasell Industries N.V.",
        "summary": "LyondellBasell Industries N.V. operates as a chemical company in the United States, Germany, Mexico, Italy, Poland, France, Japan, China, the Netherlands, and internationally. The company operates in six segments: Olefins and PolyolefinsÂ\u0097Americas; Olefins and PolyolefinsÂ\u0097Europe, Asia, International; Intermediates and Derivatives; Advanced Polymer Solutions; Refining; and Technology. It produces and markets olefins and co-products; polyolefins; polyethylene products, which consist of high density polyethylene, low density polyethylene, and linear low density polyethylene; and polypropylene (PP) products, such as PP homopolymers and copolymers. The company also produces and sells propylene oxide and its derivatives; oxyfuels and related products; and intermediate chemicals, such as styrene monomers, acetyls, ethylene glycols, and ethylene oxides and derivatives. In addition, it produces and markets compounds and solutions, such as polypropylene compounds, engineered plastics, masterbatches, engineered composites, colors, and powders; and advanced polymers. Further, the company refines crude oil and other crude oils of varied types and sources into gasoline, diesel, and jet fuel; develops and licenses chemical and polyolefin process technologies; and manufactures and sells polyolefin catalysts. LyondellBasell Industries N.V. was founded in 1955 and is headquartered in Houston, Texas.",
        "currency": "BRL",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77010",
        "website": "http://www.lyondellbasell.com",
        "market_cap": 189087858688
    },
    "LTHM": {
        "short_name": "Livent Corporation",
        "long_name": "Livent Corporation",
        "summary": "Livent Corporation manufactures and sells performance lithium compounds primarily used in lithium-based batteries, specialty polymers, and chemical synthesis applications in North America, Latin America, Europe, the Middle East, Africa, and the Asia Pacific. The company offers lithium compounds for use in applications that have specific performance requirements, including battery-grade lithium hydroxide for use in high performance lithium-ion batteries; and butyllithium, which is used in the production of polymers and pharmaceutical products, as well as a range of specialty lithium compounds, including high purity lithium metal, which is used in the production of lightweight materials for aerospace applications and non-rechargeable batteries. It also provides lithium phosphate, pharmaceutical-grade lithium carbonate, high purity lithium chloride, and specialty organics; and lithium carbonate and lithium chloride for use as feedstock in the process of producing performance lithium compounds. The company was incorporated in 2018 and is headquartered in Philadelphia, Pennsylvania.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Philadelphia",
        "zipcode": "19104",
        "website": "http://www.livent.com",
        "market_cap": 2588355584
    },
    "LWLG": {
        "short_name": "LIGHTWAVE LOGIC INC",
        "long_name": "Lightwave Logic, Inc.",
        "summary": "Lightwave Logic, Inc., a development stage company, focuses on the development of photonic devices and non-linear optical polymer materials systems for fiber-optic data communications and optical computing markets in the United States. The company is involved in designing and synthesizing organic chromophores for use in its electro-optic polymer systems and photonic device designs. It also offers electro-optic modulators, which converts data from electric signals to optical signals for transmission over fiber-optic cables; and polymer photonic integrated circuits, a photonic device, which integrates various photonic functions on a single chip. In addition, the company provides the ridge waveguide modulator, a modulator that fabricates the waveguide within a layer of its electro-optic polymer system. It focuses on selling its products to electro-optic device manufacturers, such as telecommunications component and systems manufacturers, networking and switching suppliers, semiconductor companies, Web 2.0 media, computing companies, optical network, aerospace companies, and government agencies. The company was formerly known as Third-order Nanotechnologies, Inc. and changed its name to Lightwave Logic, Inc. in March 2008. Lightwave Logic, Inc. was founded in 1991 and is headquartered in Englewood, Colorado.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://lightwavelogic.com",
        "market_cap": 179095840
    },
    "LYB": {
        "short_name": "LyondellBasell Industries NV",
        "long_name": "LyondellBasell Industries N.V.",
        "summary": "LyondellBasell Industries N.V. operates as a chemical company in the United States, Germany, Mexico, Italy, Poland, France, Japan, China, the Netherlands, and internationally. The company operates in six segments: Olefins and PolyolefinsÂ\u0097Americas; Olefins and PolyolefinsÂ\u0097Europe, Asia, International; Intermediates and Derivatives; Advanced Polymer Solutions; Refining; and Technology. It produces and markets olefins and co-products; polyolefins; polyethylene products, which consist of high density polyethylene, low density polyethylene, and linear low density polyethylene; and polypropylene (PP) products, such as PP homopolymers and copolymers. The company also produces and sells propylene oxide and its derivatives; oxyfuels and related products; and intermediate chemicals, such as styrene monomers, acetyls, ethylene glycols, and ethylene oxides and derivatives. In addition, it produces and markets compounds and solutions, such as polypropylene compounds, engineered plastics, masterbatches, engineered composites, colors, and powders; and advanced polymers. Further, the company refines crude oil and other crude oils of varied types and sources into gasoline, diesel, and jet fuel; develops and licenses chemical and polyolefin process technologies; and manufactures and sells polyolefin catalysts. LyondellBasell Industries N.V. was founded in 1955 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77010",
        "website": "http://www.lyondellbasell.com",
        "market_cap": 38213316608
    },
    "LYBN.MX": {
        "short_name": "LYONDELLBASELL INDUSTRIES N V",
        "long_name": "LyondellBasell Industries N.V.",
        "summary": "LyondellBasell Industries N.V. operates as a chemical company in the United States, Germany, Mexico, Italy, Poland, France, Japan, China, the Netherlands, and internationally. The company operates in six segments: Olefins and PolyolefinsÂ\u0097Americas; Olefins and PolyolefinsÂ\u0097Europe, Asia, International; Intermediates and Derivatives; Advanced Polymer Solutions; Refining; and Technology. It produces and markets olefins and co-products; polyolefins; polyethylene products, which consist of high density polyethylene, low density polyethylene, and linear low density polyethylene; and polypropylene (PP) products, such as PP homopolymers and copolymers. The company also produces and sells propylene oxide and its derivatives; oxyfuels and related products; and intermediate chemicals, such as styrene monomers, acetyls, ethylene glycols, and ethylene oxides and derivatives. In addition, it produces and markets compounds and solutions, such as polypropylene compounds, engineered plastics, masterbatches, engineered composites, colors, and powders; and advanced polymers. Further, the company refines crude oil and other crude oils of varied types and sources into gasoline, diesel, and jet fuel; develops and licenses chemical and polyolefin process technologies; and manufactures and sells polyolefin catalysts. LyondellBasell Industries N.V. was founded in 1955 and is headquartered in Houston, Texas.",
        "currency": "MXN",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77010",
        "website": "http://www.lyondellbasell.com",
        "market_cap": 712164900864
    },
    "MOPN": {
        "short_name": "MOP ENVIRONMENTAL SOLUTIONS INC",
        "long_name": "JPO Solutions, Inc.",
        "summary": "JPO Solutions, Inc. produces and supplies absorbents, primarily for the oil, gas, and chemical industries. It offers organic and biodegradeable absorbents for petroleum based liquid, absorbents for use on water, absorbents for various liquids, and absorbent pads, pillows, socks, and spill kits. The company was formerly known as MOP Environmental Solutions, Inc. and changed its name to JPO Solutions, Inc. in August 2015. JPO Solutions, Inc. was incorporated in 2004 and is based in Fairfield, Connecticut.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Fairfield",
        "zipcode": "06824",
        "website": "http://www.jpoabsorbents.com",
        "market_cap": 3800000
    },
    "NANX": {
        "short_name": "NANOPHASE TECHNOLOGIES CORP",
        "long_name": "Nanophase Technologies Corporation",
        "summary": "Nanophase Technologies Corporation provides engineered materials, formulation development, and commercial manufacturing with an integrated family of technologies in North America and internationally. It offers surface engineered zinc oxide and titanium dioxide for sunscreens and personal care products; fully formulated cosmetics under the SolÃ©sence brand name; and advanced materials products, such as architectural coatings, industrial coatings, abrasion-resistant additives, plastics additives, medical diagnostics, and various surface finishing technologies applications. The company was founded in 1989 and is headquartered in Romeoville, Illinois.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Romeoville",
        "zipcode": "60446",
        "website": "http://www.nanophase.com",
        "market_cap": 61918508
    },
    "NEU": {
        "short_name": "NewMarket Corp",
        "long_name": "NewMarket Corporation",
        "summary": "NewMarket Corporation, through its subsidiaries, engages in the petroleum additives businesses. The company offers lubricant additives for use in various vehicle and industrial applications, including engine oils, transmission fluids, off-road powertrain and hydraulic systems, gear oils, hydraulic oils, turbine oils, and other applications where metal-to-metal moving parts are utilized; and engine oil, driveline, and industrial additives. It also provides fuel additives that are used to enhance the oil refining process and the performance of gasoline, diesel, biofuels, and other fuels to industry, government, original equipment manufacturers, and individual customers. In addition, it engages in the antiknock compounds business, as well as contracted manufacturing and services activities. The company has operations in the North America, Latin America, Asia Pacific, Europe, the Middle East, Africa, and India. NewMarket Corporation was founded in 1887 and is headquartered in Richmond, Virginia.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Richmond",
        "zipcode": "23219-4350",
        "website": "http://www.newmarket.com",
        "market_cap": 4187313920
    },
    "NFTI": {
        "short_name": "NO FIRE TECHNOLOGIES INC",
        "long_name": "Nofire Technologies, Inc.",
        "summary": "NoFire Technologies, Inc. develops and sells fire-retardant coatings and textile wrap systems for commercial, industrial, marine, aerospace, nuclear, military, and residential applications. NoFire Technologies, Inc. was founded in 1987 and is based in Upper Saddle River, New Jersey.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Upper Saddle River",
        "zipcode": "07458",
        "website": "http://www.nofiretechnologies.com",
        "market_cap": 909485
    },
    "NGVT": {
        "short_name": "Ingevity Corporation",
        "long_name": "Ingevity Corporation",
        "summary": "Ingevity Corporation manufactures and sells specialty chemicals and activated carbon materials in North America, the Asia-Pacific, Europe, the Middle East, Africa, and South America. The company operates through two segments, Performance Materials and Performance Chemicals. The Performance Materials segment engineers, manufactures, and sells hardwood-based and chemically activated carbon products primarily for use in gasoline vapor emission control systems in cars, motorcycles, trucks, and boats. This segment also produces other activated carbon products for use in various applications, including food, water, beverage, and chemical purification. The Performance Chemicals segment develops, manufactures, and sells a range of specialty chemicals derived from co-products of the kraft pulping process and caprolactone monomers. This segment's products are used in various applications comprising warm mix paving, pavement preservation, pavement reconstruction and recycling, oil well service additives, oil production, and downstream applications; and adhesives, agrochemical dispersants, lubricants, printing inks, coatings, resins, elastomers, bioplastics, medical devices, and other industrial applications. Ingevity Corporation was incorporated in 2015 and is headquartered in North Charleston, South Carolina.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "SC",
        "city": "North Charleston",
        "zipcode": "29405",
        "website": "http://www.ingevity.com",
        "market_cap": 3506131200
    },
    "NNUP": {
        "short_name": "NOCOPI TECHNOLOGIES",
        "long_name": "Nocopi Technologies, Inc.",
        "summary": "Nocopi Technologies, Inc. develops and markets specialty reactive inks for applications in the educational and toy product markets, and technologies for document and product authentication. The company offers specialty inks for coloring books, activity kits, play sheets, single use place mats, greeting cards, board games, promotional products, or other paper-based applications; and anti-counterfeiting and anti-diversion technologies and products for various applications in the authentication of documents having intrinsic value, such as merchandise receipts, checks, travellers' checks, gift certificates, and event tickets, as well as product labelling and packaging services. It also licenses its patented reactive ink technologies for the entertainment and toy, and document and product authentication markets. The company operates in North America, Europe, South America, Asia, and Australia. Nocopi Technologies, Inc. was founded in 1983 and is headquartered in King of Prussia, Pennsylvania.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "King of Prussia",
        "zipcode": "19406",
        "website": "http://www.nocopi.com",
        "market_cap": 12797202
    },
    "NTCHF": {
        "short_name": "N1 TECHNOLOGIES INC",
        "long_name": "N1 Technologies Inc.",
        "summary": "N1 Technologies Inc. is an employee owned hedge fund sponsor. The firm provides its services to individuals, trusts, investment companies, and retirement accounts. It invests across all sectors, geographies, asset classes, and investment instruments. The firm employs long/short and a long-only strategies along with quantitative and fundamental analysis to make its investments. N1 Technologies Inc. was founded in 2010 and is based in Menlo Park, California.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Daytona Beach",
        "zipcode": "32118",
        "website": "http://www.N1Technologies.com",
        "market_cap": null
    },
    "NTIC": {
        "short_name": "Northern Technologies Internati",
        "long_name": "Northern Technologies International Corporation",
        "summary": "Northern Technologies International Corporation develops and markets rust and corrosion inhibiting products and services in North America, South America, Europe, Asia, the Middle East and internationally. It offers rust and corrosion inhibiting products, such as plastic and paper packaging, liquids, coatings, rust removers, cleaners, diffusers, and engineered solutions designed for the oil and gas industry under the ZERUST brand. The company also provides a portfolio of biobased and certified compostable polymer resin compounds and finished products under the Natur-Tec brand. In addition, it offers on-site and technical consulting for rust and corrosion prevention issues. The company sells its products and services to automotive, electronics, electrical, mechanical, military, retail consumer, and oil and gas markets through direct sales force, network of independent distributors and agents, manufacturer's sales representatives, strategic partners, and joint venture. Northern Technologies International Corporation was founded in 1970 and is headquartered in Circle Pines, Minnesota.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "state": "MN",
        "city": "Circle Pines",
        "zipcode": "55014",
        "website": "http://www.ntic.com",
        "market_cap": 159149104
    },
    "OCT.F": {
        "short_name": "INNOSPEC INC.  DL-,01",
        "long_name": "Innospec Inc.",
        "summary": "Innospec Inc. develops, manufactures, blends, markets, and supplies specialty chemicals in the United States, rest of North America, the United Kingdom, rest of Europe, and internationally. It operates through Fuel Specialties, Performance Chemicals, and Oilfield Services segments. The Fuel Specialties segment offers a range of specialty chemical products used as additives in various fuels. Its products are used in the operation of automotive, marine, and aviation engines; power station generators; and heating oil. The Performance Chemicals segment provides technology-based solutions for its customers' processes or products focused in the personal care, home care, agrochemical, and metal extraction markets. The Oilfield Services segment develops and markets products to prevent loss of mud in drilling operations; chemical solutions for fracturing, stimulation, and completion operations; and products for oil and gas production, which enable flow assurance and maintain asset integrity. It sells its products primarily to oil and gas exploration and production companies, oil refineries, fuel manufacturers and users, personal care and home care companies, formulators of agrochemical and metal extraction formulations, and other chemical and industrial companies. The company was formerly known as Octel Corp. and changed its name to Innospec Inc. in January 2006. Innospec Inc. was founded in 1938 and is headquartered in Englewood, Colorado.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.innospecinc.com",
        "market_cap": 2071947648
    },
    "ODC": {
        "short_name": "Oil-Dri Corporation Of America",
        "long_name": "Oil-Dri Corporation of America",
        "summary": "Oil-Dri Corporation of America, together with its subsidiaries, develops, manufactures, and markets sorbent products in the United States and internationally. It operates in two segments, Retail and Wholesale Products Group; and Business to Business Products Group. The company provides agricultural and horticultural products, including mineral-based absorbent products that serve as chemical carriers, drying agents, and growing media under the Agsorb, Verge, and Flo-Fre brand names. It also offers animal health and nutrition products for the livestock industry under the Amlan, Calibrin, Varium, Neoprime, MD-09, and Pel-Unite and Pel-Unite Plus brand names; and bleaching clay and purification aid products for bleaching, purification, and filtration applications under the Pure-Flo, Perform, Select, and Ultra-Clear brand names. In addition, the company provides cat litter products, such as scoopable and non-clumping litters under the Cat's Pride and Jonny Cat brand names; industrial and automotive sorbent products from clay, polypropylene, and recycled materials to absorb oil, acid, paint, ink, water, and other liquids under the Oil-Dri brand name; and sports products for use on baseball, softball, football, and soccer fields under the Pro's Choice brand name. Its customers include mass merchandisers, wholesale clubs, drugstore chains, pet specialty retail outlets, dollar stores, retail grocery stores, distributors of industrial cleanup and automotive products, environmental service companies, and sports field product users; processors and refiners of edible oils, petroleum-based oils, and biodiesel fuel; manufacturers of animal feed and agricultural chemicals; distributors of animal health and nutrition products; and marketers of consumer products. Oil-Dri Corporation of America was founded in 1941 and is based in Chicago, Illinois.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Chicago",
        "zipcode": "60611-4213",
        "website": "http://www.oildri.com",
        "market_cap": 267146512
    },
    "OLN.DE": {
        "short_name": "OLIN CORP.  DL 1",
        "long_name": "Olin Corporation",
        "summary": "Olin Corporation manufactures and distributes chemical products in the United States, Europe, and internationally. It operates through three segments: Chlor Alkali Products and Vinyls; Epoxy; and Winchester. The Chlor Alkali Products and Vinyls segment offers chlorine and caustic soda, ethylene dichloride and vinyl chloride monomers, methyl chloride, methylene chloride, chloroform, carbon tetrachloride, perchloroethylene, trichloroethylene, hydrochloric acid, hydrogen, bleach products, potassium hydroxide, chlorinated organics intermediates and solvents, and sodium hypochlorite. The Epoxy segment provides epoxy materials and precursors, including aromatics, such as acetone, bisphenol, cumene, and phenol, as well as allyl chloride, epichlorohydrin, and glycerin used for the manufacturers of polymers, resins and other plastic materials, water purification, and pesticides; liquid and solid epoxy resins that are used in adhesives, paints and coatings, composites, and flooring; and converted epoxy resins and additives for use in electrical laminates, paints and coatings, wind blades, electronics, and construction. The Winchester segment offers sporting ammunition products, including shotshells, small caliber centerfire, and rimfire ammunition products for hunters and recreational shooters, and law enforcement agencies; small caliber military ammunition products for use in infantry and mounted weapons; and industrial products comprising gauge loads and powder-actuated tool loads for maintenance applications in power and concrete industries, and powder-actuated tools in construction industry. The company markets its products through its sales force, as well as directly to various industrial customers, mass merchants, retailers, wholesalers, other distributors, and the U.S. Government and its prime contractors. Olin Corporation was founded in 1892 and is based in Clayton, Missouri.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "MO",
        "city": "Clayton",
        "zipcode": "63105",
        "website": "http://www.olin.com",
        "market_cap": 6531696128
    },
    "OLN.F": {
        "short_name": "OLIN CORP.  DL 1",
        "long_name": "Olin Corporation",
        "summary": "Olin Corporation manufactures and distributes chemical products in the United States, Europe, and internationally. It operates through three segments: Chlor Alkali Products and Vinyls; Epoxy; and Winchester. The Chlor Alkali Products and Vinyls segment offers chlorine and caustic soda, ethylene dichloride and vinyl chloride monomers, methyl chloride, methylene chloride, chloroform, carbon tetrachloride, perchloroethylene, trichloroethylene, hydrochloric acid, hydrogen, bleach products, potassium hydroxide, chlorinated organics intermediates and solvents, and sodium hypochlorite. The Epoxy segment provides epoxy materials and precursors, including aromatics, such as acetone, bisphenol, cumene, and phenol, as well as allyl chloride, epichlorohydrin, and glycerin used for the manufacturers of polymers, resins and other plastic materials, water purification, and pesticides; liquid and solid epoxy resins that are used in adhesives, paints and coatings, composites, and flooring; and converted epoxy resins and additives for use in electrical laminates, paints and coatings, wind blades, electronics, and construction. The Winchester segment offers sporting ammunition products, including shotshells, small caliber centerfire, and rimfire ammunition products for hunters and recreational shooters, and law enforcement agencies; small caliber military ammunition products for use in infantry and mounted weapons; and industrial products comprising gauge loads and powder-actuated tool loads for maintenance applications in power and concrete industries, and powder-actuated tools in construction industry. The company markets its products through its sales force, as well as directly to various industrial customers, mass merchants, retailers, wholesalers, other distributors, and the U.S. Government and its prime contractors. Olin Corporation was founded in 1892 and is based in Clayton, Missouri.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MO",
        "city": "Clayton",
        "zipcode": "63105",
        "website": "http://www.olin.com",
        "market_cap": 6568578048
    },
    "OLN": {
        "short_name": "Olin Corporation",
        "long_name": "Olin Corporation",
        "summary": "Olin Corporation manufactures and distributes chemical products in the United States, Europe, and internationally. It operates through three segments: Chlor Alkali Products and Vinyls; Epoxy; and Winchester. The Chlor Alkali Products and Vinyls segment offers chlorine and caustic soda, ethylene dichloride and vinyl chloride monomers, methyl chloride, methylene chloride, chloroform, carbon tetrachloride, perchloroethylene, trichloroethylene, hydrochloric acid, hydrogen, bleach products, potassium hydroxide, chlorinated organics intermediates and solvents, and sodium hypochlorite. The Epoxy segment provides epoxy materials and precursors, including aromatics, such as acetone, bisphenol, cumene, and phenol, as well as allyl chloride, epichlorohydrin, and glycerin used for the manufacturers of polymers, resins and other plastic materials, water purification, and pesticides; liquid and solid epoxy resins that are used in adhesives, paints and coatings, composites, and flooring; and converted epoxy resins and additives for use in electrical laminates, paints and coatings, wind blades, electronics, and construction. The Winchester segment offers sporting ammunition products, including shotshells, small caliber centerfire, and rimfire ammunition products for hunters and recreational shooters, and law enforcement agencies; small caliber military ammunition products for use in infantry and mounted weapons; and industrial products comprising gauge loads and powder-actuated tool loads for maintenance applications in power and concrete industries, and powder-actuated tools in construction industry. The company markets its products through its sales force, as well as directly to various industrial customers, mass merchants, retailers, wholesalers, other distributors, and the U.S. Government and its prime contractors. Olin Corporation was founded in 1892 and is based in Clayton, Missouri.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MO",
        "city": "Clayton",
        "zipcode": "63105",
        "website": "http://www.olin.com",
        "market_cap": 7329010688
    },
    "P1PG34.SA": {
        "short_name": "PPG INDUSTRIDRN",
        "long_name": "PPG Industries, Inc.",
        "summary": "PPG Industries, Inc. manufactures and distributes paints, coatings, and specialty materials worldwide. The company's Performance Coatings segment offers coatings, solvents, adhesives, sealants, sundries, and software for automotive and commercial transport/fleet repair and refurbishing, light industrial coatings, and specialty coatings for signs; and coatings, sealants, transparencies, transparent armor, adhesives, engineered materials, and packaging and chemical management services for commercial, military, regional jet, and general aviation aircraft. It also provides coatings and finishes for the protection of metals and structures, such as metal fabricators, heavy duty maintenance contractors, and manufacturers of ships, bridges, and rail cars; paints, wood stains, and purchased sundries for painting and maintenance contractors, and consumers for decoration and maintenance of residential and commercial building structures; and thermoplastics, pavement marking products, and other technologies for pavement marking. The company's Industrial Coatings segment provides coatings, adhesives and sealants, and metal pretreatments, as well as services and coatings applications for appliances, agricultural and construction equipment, consumer electronics, automotive parts and accessories, building products, kitchenware, and transportation vehicles and other finished products; and on-site coatings services. It also provides coatings for metal cans, closures, plastic tubes, industrial packaging, and promotional and specialty packaging; amorphous precipitated silica for tire, battery separator, and other end-uses; TESLIN substrates for labels, e-passports, drivers' licenses, breathable membranes, and other loyalty and identification cards; and organic light emitting diode materials, displays and lighting lens materials, and optical lenses and color-change products, as well as photochromic dyes. The company was founded in 1883 and is headquartered in Pittsburgh, Pennsylvania.",
        "currency": "BRL",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "PA",
        "city": "Pittsburgh",
        "zipcode": "15272",
        "website": "http://www.ppg.com",
        "market_cap": 223470829568
    },
    "PPG.MX": {
        "short_name": "PPG INDUSTRIES INC",
        "long_name": "PPG Industries, Inc.",
        "summary": "PPG Industries, Inc. manufactures and distributes paints, coatings, and specialty materials worldwide. The company's Performance Coatings segment offers coatings, solvents, adhesives, sealants, sundries, and software for automotive and commercial transport/fleet repair and refurbishing, light industrial coatings, and specialty coatings for signs; and coatings, sealants, transparencies, transparent armor, adhesives, engineered materials, and packaging and chemical management services for commercial, military, regional jet, and general aviation aircraft. It also provides coatings and finishes for the protection of metals and structures, such as metal fabricators, heavy duty maintenance contractors, and manufacturers of ships, bridges, and rail cars; paints, wood stains, and purchased sundries for painting and maintenance contractors, and consumers for decoration and maintenance of residential and commercial building structures; and thermoplastics, pavement marking products, and other technologies for pavement marking. The company's Industrial Coatings segment provides coatings, adhesives and sealants, and metal pretreatments, as well as services and coatings applications for appliances, agricultural and construction equipment, consumer electronics, automotive parts and accessories, building products, kitchenware, and transportation vehicles and other finished products; and on-site coatings services. It also provides coatings for metal cans, closures, plastic tubes, industrial packaging, and promotional and specialty packaging; amorphous precipitated silica for tire, battery separator, and other end-uses; TESLIN substrates for labels, e-passports, drivers' licenses, breathable membranes, and other loyalty and identification cards; and organic light emitting diode materials, displays and lighting lens materials, and optical lenses and color-change products, as well as photochromic dyes. The company was founded in 1883 and is headquartered in Pittsburgh, Pennsylvania.",
        "currency": "MXN",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "PA",
        "city": "Pittsburgh",
        "zipcode": "15272",
        "website": "http://www.ppg.com",
        "market_cap": 846679113728
    },
    "PPG": {
        "short_name": "PPG Industries, Inc.",
        "long_name": "PPG Industries, Inc.",
        "summary": "PPG Industries, Inc. manufactures and distributes paints, coatings, and specialty materials worldwide. The company's Performance Coatings segment offers coatings, solvents, adhesives, sealants, sundries, and software for automotive and commercial transport/fleet repair and refurbishing, light industrial coatings, and specialty coatings for signs; and coatings, sealants, transparencies, transparent armor, adhesives, engineered materials, and packaging and chemical management services for commercial, military, regional jet, and general aviation aircraft. It also provides coatings and finishes for the protection of metals and structures, such as metal fabricators, heavy duty maintenance contractors, and manufacturers of ships, bridges, and rail cars; paints, wood stains, and purchased sundries for painting and maintenance contractors, and consumers for decoration and maintenance of residential and commercial building structures; and thermoplastics, pavement marking products, and other technologies for pavement marking. The company's Industrial Coatings segment provides coatings, adhesives and sealants, and metal pretreatments, as well as services and coatings applications for appliances, agricultural and construction equipment, consumer electronics, automotive parts and accessories, building products, kitchenware, and transportation vehicles and other finished products; and on-site coatings services. It also provides coatings for metal cans, closures, plastic tubes, industrial packaging, and promotional and specialty packaging; amorphous precipitated silica for tire, battery separator, and other end-uses; TESLIN substrates for labels, e-passports, drivers' licenses, breathable membranes, and other loyalty and identification cards; and organic light emitting diode materials, displays and lighting lens materials, and optical lenses and color-change products, as well as photochromic dyes. The company was founded in 1883 and is headquartered in Pittsburgh, Pennsylvania.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Pittsburgh",
        "zipcode": "15272",
        "website": "http://www.ppg.com",
        "market_cap": 42716688384
    },
    "PPQ.DE": {
        "short_name": "PPG IND. INC.  DL 1,666",
        "long_name": "PPG Industries, Inc.",
        "summary": "PPG Industries, Inc. manufactures and distributes paints, coatings, and specialty materials worldwide. The company's Performance Coatings segment offers coatings, solvents, adhesives, sealants, sundries, and software for automotive and commercial transport/fleet repair and refurbishing, light industrial coatings, and specialty coatings for signs; and coatings, sealants, transparencies, transparent armor, adhesives, engineered materials, and packaging and chemical management services for commercial, military, regional jet, and general aviation aircraft. It also provides coatings and finishes for the protection of metals and structures, such as metal fabricators, heavy duty maintenance contractors, and manufacturers of ships, bridges, and rail cars; paints, wood stains, and purchased sundries for painting and maintenance contractors, and consumers for decoration and maintenance of residential and commercial building structures; and thermoplastics, pavement marking products, and other technologies for pavement marking. The company's Industrial Coatings segment provides coatings, adhesives and sealants, and metal pretreatments, as well as services and coatings applications for appliances, agricultural and construction equipment, consumer electronics, automotive parts and accessories, building products, kitchenware, and transportation vehicles and other finished products; and on-site coatings services. It also provides coatings for metal cans, closures, plastic tubes, industrial packaging, and promotional and specialty packaging; amorphous precipitated silica for tire, battery separator, and other end-uses; TESLIN substrates for labels, e-passports, drivers' licenses, breathable membranes, and other loyalty and identification cards; and organic light emitting diode materials, displays and lighting lens materials, and optical lenses and color-change products, as well as photochromic dyes. The company was founded in 1883 and is headquartered in Pittsburgh, Pennsylvania.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "PA",
        "city": "Pittsburgh",
        "zipcode": "15272",
        "website": "http://www.ppg.com",
        "market_cap": 35152711680
    },
    "PPQ.F": {
        "short_name": "PPG IND. INC.  DL 1,666",
        "long_name": "PPG Industries, Inc.",
        "summary": "PPG Industries, Inc. manufactures and distributes paints, coatings, and specialty materials worldwide. The company's Performance Coatings segment offers coatings, solvents, adhesives, sealants, sundries, and software for automotive and commercial transport/fleet repair and refurbishing, light industrial coatings, and specialty coatings for signs; and coatings, sealants, transparencies, transparent armor, adhesives, engineered materials, and packaging and chemical management services for commercial, military, regional jet, and general aviation aircraft. It also provides coatings and finishes for the protection of metals and structures, such as metal fabricators, heavy duty maintenance contractors, and manufacturers of ships, bridges, and rail cars; paints, wood stains, and purchased sundries for painting and maintenance contractors, and consumers for decoration and maintenance of residential and commercial building structures; and thermoplastics, pavement marking products, and other technologies for pavement marking. The company's Industrial Coatings segment provides coatings, adhesives and sealants, and metal pretreatments, as well as services and coatings applications for appliances, agricultural and construction equipment, consumer electronics, automotive parts and accessories, building products, kitchenware, and transportation vehicles and other finished products; and on-site coatings services. It also provides coatings for metal cans, closures, plastic tubes, industrial packaging, and promotional and specialty packaging; amorphous precipitated silica for tire, battery separator, and other end-uses; TESLIN substrates for labels, e-passports, drivers' licenses, breathable membranes, and other loyalty and identification cards; and organic light emitting diode materials, displays and lighting lens materials, and optical lenses and color-change products, as well as photochromic dyes. The company was founded in 1883 and is headquartered in Pittsburgh, Pennsylvania.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "Pittsburgh",
        "zipcode": "15272",
        "website": "http://www.ppg.com",
        "market_cap": 35890159616
    },
    "PQG.F": {
        "short_name": "PQ GROUP HLDGS INC DL-,01",
        "long_name": "PQ Group Holdings Inc.",
        "summary": "PQ Group Holdings Inc. provides specialty catalysts, chemicals, and services in the United States, the Netherlands, the United Kingdom, and internationally. The company operates through three segments: Refining Services, Catalysts, and Performance Chemicals. The Refining Services segment offers sulfuric acid recycling and end-to-end logistics services to produce alkylate; and virgin sulfuric acid for water treatment, mining, and industrial applications. The Catalysts segment provides silica catalysts and zeolite catalysts for producers and licensors of polyethylene and methyl methacrylate. The Performance Chemicals segment offers sodium silicates for construction, cleaning, water treatment, pulp and paper, foundry and refractory, green tires, electronics, and refining catalysts; and specialty silicas for use as ingredients in personal care products, foods, edible oils, and beers, as well as industrial uses consisting of gloss control in coil, wood, general industrial leather, and other surface coating applications. This segment also provides other silicate derivatives, including metasilicates, spray dried silicates, and magnesium and potassium silicates for use in cleaning, specialty fertilizer, oil and gas, mining, paint, food, and cosmetic applications, as well as zeolites for use as builders for detergents and other applications, such as stabilizers for the production of polyvinylchloride applications. PQ Group Holdings Inc. was founded in 1831 and is headquartered in Malvern, Pennsylvania.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "Malvern",
        "zipcode": "19355-1740",
        "website": "http://www.pqcorp.com",
        "market_cap": 1741500160
    },
    "PQG": {
        "short_name": "PQ Group Holdings Inc.",
        "long_name": "PQ Group Holdings Inc.",
        "summary": "PQ Group Holdings Inc. provides specialty catalysts, chemicals, and services in the United States, the Netherlands, the United Kingdom, and internationally. The company operates through three segments: Refining Services, Catalysts, and Performance Chemicals. The Refining Services segment offers sulfuric acid recycling and end-to-end logistics services to produce alkylate; and virgin sulfuric acid for water treatment, mining, and industrial applications. The Catalysts segment provides silica catalysts and zeolite catalysts for producers and licensors of polyethylene and methyl methacrylate. The Performance Chemicals segment offers sodium silicates for construction, cleaning, water treatment, pulp and paper, foundry and refractory, green tires, electronics, and refining catalysts; and specialty silicas for use as ingredients in personal care products, foods, edible oils, and beers, as well as industrial uses consisting of gloss control in coil, wood, general industrial leather, and other surface coating applications. This segment also provides other silicate derivatives, including metasilicates, spray dried silicates, and magnesium and potassium silicates for use in cleaning, specialty fertilizer, oil and gas, mining, paint, food, and cosmetic applications, as well as zeolites for use as builders for detergents and other applications, such as stabilizers for the production of polyvinylchloride applications. PQ Group Holdings Inc. was founded in 1831 and is headquartered in Malvern, Pennsylvania.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Malvern",
        "zipcode": "19355-1740",
        "website": "http://www.pqcorp.com",
        "market_cap": 2134645120
    },
    "PY9.F": {
        "short_name": "AVIENT CORP.  DL-,01",
        "long_name": "Avient Corporation",
        "summary": "Avient Corporation provides specialized polymer materials, services, and solutions in the United States, Canada, Mexico, Europe, South America, and Asia. It operates in three segments: Color, Additives and Inks; Specialty Engineered Materials; and Distribution. The Color, Additives and Inks segment offers specialized color and additive concentrates in solid and liquid form for thermoplastics; dispersions for thermosets; and specialty inks, plastisols, and vinyl slush molding solutions. The Specialty Engineered Materials segment provides specialty polymer formulations, services, and solutions for designers, assemblers, and processors of thermoplastic materials; and long glass and carbon fiber technology, and thermoset and thermoplastic composites. The Distribution segment distributes approximately 4,000 grades of engineering and commodity grade resins to custom injection molders and extruders. The company sells its products through direct sales personnel, distributors, and commissioned sales agents. The company was formerly known as PolyOne Corporation and changed its name to Avient Corporation in June 2020. Avient Corporation was founded in 1885 and is headquartered in Avon Lake, Ohio.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OH",
        "city": "Avon Lake",
        "zipcode": "44012",
        "website": "http://www.avient.com",
        "market_cap": 3893397504
    },
    "QUC.F": {
        "short_name": "QUAKER CHEMICAL CORP. DL1",
        "long_name": "Quaker Chemical Corporation",
        "summary": "Quaker Chemical Corporation develops, produces, and markets various formulated chemical specialty products for a range of heavy industrial and manufacturing applications. It operates through four segments: Americas; Europe, Middle East, and Africa; Asia/Pacific; and Global Specialty Businesses. The company offers metal removal fluids, cleaning fluids, corrosion inhibitors, metal drawing and forming fluids, die cast mold releases, heat treatment and quenchants, metal forging fluids, hydraulic fluids, specialty greases, metal finishing fluids, offshore sub-sea energy control fluids, rolling lubricants, rod and wire drawing fluids, and surface treatment chemicals. It also provides chemical management services. The company serves steel, aluminum, automotive, aerospace, offshore, can, mining, and metalworking companies. The company was formerly known as Quaker Chemical Products Corporation and changed its name to Quaker Chemical Corporation in August 1962. Quaker Chemical Corporation was founded in 1918 and is headquartered in Conshohocken, Pennsylvania.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "Conshohocken",
        "zipcode": "19428-2380",
        "website": "http://www.quakerchem.com",
        "market_cap": 3544774144
    },
    "RNWF": {
        "short_name": "RENEWAL FUELS INC",
        "long_name": "Renewal Fuels, Inc.",
        "summary": "Renewal Fuels, Inc. designs, manufactures, and markets biodiesel processing equipment and accessories in the United States. The company offers FuelMeister line of biodiesel processors, which allow users to make biodiesel from waste vegetable oil for personal use. It is involved in growing cellulosic feedstock for the biofuels industry. The company sells and distributes its products through a network of dealers. Renewal Fuels, Inc. was founded in 2007 and is based in Milwaukee, Wisconsin.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WI",
        "city": "Milwaukee",
        "zipcode": "53202",
        "website": null,
        "market_cap": 19422
    },
    "RP8.F": {
        "short_name": "RPM INTERN. INC.  DL-,01",
        "long_name": "RPM International Inc.",
        "summary": "RPM International Inc. manufactures and sells specialty chemicals for the industrial, specialty, and consumer markets worldwide. It offers waterproofing, coatings, and institutional roofing systems; sealants, air barriers, tapes, and foams; residential home weatherization systems; roofing and building maintenance and related services; sealing and bonding, and flooring and in-plant glazing solutions; solutions for fire stopping and intumescent steel coating, and the manufacturing industry; rolled asphalt roofing materials and chemical admixtures; concrete and masonry admixtures, concrete fibers, curing and sealing compounds, structural grouts and mortars, epoxy adhesives, injection resins, polyurethane foams, floor hardeners and toppings, joint fillers and sealants, industrial and architectural coatings, decorative color/stains/stamps, and restoration materials; and insulated building cladding materials and concrete form wall systems. It also provides polymer flooring systems; fiberglass reinforced plastic gratings and shapes; corrosion-control coating, containment lining, fire and sound proofing, and insulation products; and specialty construction products; and amine curing agents, reactive diluents, specialty epoxy resins and other intermediates. In addition, it offers fluorescent colorants and pigments; shellac-based-specialty and marine coatings; fire and water damage restoration, and carpet cleaning and disinfecting products; fuel additives; wood treatments, furniture finishes, and touch-up products; and nail enamels, polishes, and coating components. Further, it offers specialty products for paint contractors and the DIYers, deck and fence restoration products, metallic and faux finish coatings, exterior wood deck and concrete restoration systems, flooring finishes, and hobby paints and cements; and caulk, sealant, adhesive, insulating foam, spackling, glazing, and patch and repair products. The company was founded in 1947 and is headquartered in Medina, Ohio.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OH",
        "city": "Medina",
        "zipcode": "44258",
        "website": "http://www.rpminc.com",
        "market_cap": 9780881408
    },
    "RPM": {
        "short_name": "RPM International Inc.",
        "long_name": "RPM International Inc.",
        "summary": "RPM International Inc. manufactures and sells specialty chemicals for the industrial, specialty, and consumer markets worldwide. It offers waterproofing, coatings, and institutional roofing systems; sealants, air barriers, tapes, and foams; residential home weatherization systems; roofing and building maintenance and related services; sealing and bonding, and flooring and in-plant glazing solutions; solutions for fire stopping and intumescent steel coating, and the manufacturing industry; rolled asphalt roofing materials and chemical admixtures; concrete and masonry admixtures, concrete fibers, curing and sealing compounds, structural grouts and mortars, epoxy adhesives, injection resins, polyurethane foams, floor hardeners and toppings, joint fillers and sealants, industrial and architectural coatings, decorative color/stains/stamps, and restoration materials; and insulated building cladding materials and concrete form wall systems. It also provides polymer flooring systems; fiberglass reinforced plastic gratings and shapes; corrosion-control coating, containment lining, fire and sound proofing, and insulation products; and specialty construction products; and amine curing agents, reactive diluents, specialty epoxy resins and other intermediates. In addition, it offers fluorescent colorants and pigments; shellac-based-specialty and marine coatings; fire and water damage restoration, and carpet cleaning and disinfecting products; fuel additives; wood treatments, furniture finishes, and touch-up products; and nail enamels, polishes, and coating components. Further, it offers specialty products for paint contractors and the DIYers, deck and fence restoration products, metallic and faux finish coatings, exterior wood deck and concrete restoration systems, flooring finishes, and hobby paints and cements; and caulk, sealant, adhesive, insulating foam, spackling, glazing, and patch and repair products. The company was founded in 1947 and is headquartered in Medina, Ohio.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Medina",
        "zipcode": "44258",
        "website": "http://www.rpminc.com",
        "market_cap": 11905946624
    },
    "S1HW34.SA": {
        "short_name": "THE SHERWIN DRN",
        "long_name": "The Sherwin-Williams Company",
        "summary": "The Sherwin-Williams Company develops, manufactures, distributes, and sells paints, coatings, and related products to professional, industrial, commercial, and retail customers. It operates in three segments: The Americas Group, Consumer Brands Group, and Performance Coatings Group. The Americas Group segment offers architectural paints and coatings, and protective and marine products, as well as OEM product finishes and related products for architectural and industrial paint contractors, and do-it-yourself homeowners. The Consumer Brands Group segment provides branded and private-label architectural paints, stains, varnishes, industrial products, wood finishes products, wood preservatives, applicators, corrosion inhibitors, aerosols, caulks, and adhesives to retailers and distributors. The Performance Coatings Group segment develops and sells industrial coatings for wood finishing and general industrial applications, automotive refinish products, protective and marine coatings, coil coatings, packaging coatings, and performance-based resins and colorants. It serves retailers, dealers, jobbers, licensees, and other third-party distributors through its branches and direct sales staff, as well as through outside sales representatives. The company has operations primarily in North and South America, the Caribbean, Europe, Asia, and Australia. As of December 31, 2021, it operated 4,774 company-operated stores. The Sherwin-Williams Company was founded in 1866 and is headquartered in Cleveland, Ohio.",
        "currency": "BRL",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "OH",
        "city": "Cleveland",
        "zipcode": "44115-1075",
        "website": "http://www.sherwin-williams.com",
        "market_cap": 399625420800
    },
    "SCL": {
        "short_name": "Stepan Company",
        "long_name": "Stepan Company",
        "summary": "Stepan Company, together with its subsidiaries, produces and sells specialty and intermediate chemicals to other manufacturers for use in various end products in North America, Europe, Latin America, and Asia. The company operates through three segments: Surfactants, Polymers, and Specialty Products. The Surfactants segment offers surfactants that are used as principal ingredients in consumer and industrial cleaning products, including detergents for washing clothes, dishes, carpets, and floors and walls, as well as shampoos and body washes; and other applications, such as fabric softeners, germicidal quaternary compounds, and lubricating ingredients. Its surfactants are also used in various applications, including emulsifiers for spreading agricultural products; and industrial applications comprising latex systems, plastics, and composites. The Polymers segment provides polyurethane polyols that are used in the manufacture of rigid foam for thermal insulation in the construction industry, as well as a base raw material for coatings, adhesives, sealants, and elastomers (CASE); polyester resins, including liquid and powdered products, which are used in CASE applications; and phthalic anhydride that is used in unsaturated polyester resins, alkyd resins, and plasticizers for applications in construction materials, as well as components of automotive, boating, and other consumer products. The Specialty Products segment offers flavors, emulsifiers, and solubilizers for use in the food, flavoring, nutritional supplement, and pharmaceutical applications. Stepan Company was founded in 1932 and is headquartered in Northfield, Illinois.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Northfield",
        "zipcode": "60093",
        "website": "http://www.stepan.com",
        "market_cap": 2954072832
    },
    "SE81.F": {
        "short_name": "SENESTECH INC.  DL -,001",
        "long_name": "SenesTech, Inc.",
        "summary": "SenesTech, Inc. develops a technology for managing animal pest populations through fertility control. The company offers ContraPest, a liquid bait that limits reproduction of male and female rats. It is also developing a pipeline of fertility control and animal health products, including feral animal fertility control, non-surgical spay and neutering, boar taint, and animal cancer treatment. The company was incorporated in 2004 and is headquartered in Phoenix, Arizona.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85027",
        "website": "http://www.senestech.com",
        "market_cap": 17580020
    },
    "SEVT": {
        "short_name": "SUMMIT ENVIRONMENTAL CORP. INC",
        "long_name": "Summit Environmental Corporation, Inc.",
        "summary": "Summit Environmental Corporation, Inc. markets fire suppression and retardant products in the United States. The company offers FlameOut, which is non-toxic and biodegradable firefighting foam to municipal fire departments, forestry services, and the military and other federal government agencies. It markets its bulk firefighting products through strategic alliances and directly to the end user. The company was founded in 1997 and is based in Oak Creek, Wisconsin.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WI",
        "city": "Oak Creek",
        "zipcode": "53154",
        "website": null,
        "market_cap": 4858
    },
    "SHW.MX": {
        "short_name": "SHERWIN-WILLIAMS CO",
        "long_name": "The Sherwin-Williams Company",
        "summary": "The Sherwin-Williams Company develops, manufactures, distributes, and sells paints, coatings, and related products to professional, industrial, commercial, and retail customers. It operates in three segments: The Americas Group, Consumer Brands Group, and Performance Coatings Group. The Americas Group segment offers architectural paints and coatings, and protective and marine products, as well as OEM product finishes and related products for architectural and industrial paint contractors, and do-it-yourself homeowners. The Consumer Brands Group segment provides branded and private-label architectural paints, stains, varnishes, industrial products, wood finishes products, wood preservatives, applicators, corrosion inhibitors, aerosols, caulks, and adhesives to retailers and distributors. The Performance Coatings Group segment develops and sells industrial coatings for wood finishing and general industrial applications, automotive refinish products, protective and marine coatings, coil coatings, packaging coatings, and performance-based resins and colorants. It serves retailers, dealers, jobbers, licensees, and other third-party distributors through its branches and direct sales staff, as well as through outside sales representatives. The company has operations primarily in North and South America, the Caribbean, Europe, Asia, and Australia. As of December 31, 2021, it operated 4,774 company-operated stores. The Sherwin-Williams Company was founded in 1866 and is headquartered in Cleveland, Ohio.",
        "currency": "MXN",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "OH",
        "city": "Cleveland",
        "zipcode": "44115-1075",
        "website": "http://www.sherwin-williams.com",
        "market_cap": 1482367959040
    },
    "SHW": {
        "short_name": "Sherwin-Williams Company (The)",
        "long_name": "The Sherwin-Williams Company",
        "summary": "The Sherwin-Williams Company develops, manufactures, distributes, and sells paints, coatings, and related products to professional, industrial, commercial, and retail customers. It operates in three segments: The Americas Group, Consumer Brands Group, and Performance Coatings Group. The Americas Group segment offers architectural paints and coatings, and protective and marine products, as well as OEM product finishes and related products for architectural and industrial paint contractors, and do-it-yourself homeowners. The Consumer Brands Group segment provides branded and private-label architectural paints, stains, varnishes, industrial products, wood finishes products, wood preservatives, applicators, corrosion inhibitors, aerosols, caulks, and adhesives to retailers and distributors. The Performance Coatings Group segment develops and sells industrial coatings for wood finishing and general industrial applications, automotive refinish products, protective and marine coatings, coil coatings, packaging coatings, and performance-based resins and colorants. It serves retailers, dealers, jobbers, licensees, and other third-party distributors through its branches and direct sales staff, as well as through outside sales representatives. The company has operations primarily in North and South America, the Caribbean, Europe, Asia, and Australia. As of December 31, 2021, it operated 4,774 company-operated stores. The Sherwin-Williams Company was founded in 1866 and is headquartered in Cleveland, Ohio.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Cleveland",
        "zipcode": "44115-1075",
        "website": "http://www.sherwin-williams.com",
        "market_cap": 76848906240
    },
    "SHWW.VI": {
        "short_name": "SHERWIN-WILLIAMS CO",
        "long_name": "The Sherwin-Williams Company",
        "summary": "The Sherwin-Williams Company develops, manufactures, distributes, and sells paints, coatings, and related products to professional, industrial, commercial, and retail customers. It operates in three segments: The Americas Group, Consumer Brands Group, and Performance Coatings Group. The Americas Group segment offers architectural paints and coatings, and protective and marine products, as well as OEM product finishes and related products for architectural and industrial paint contractors, and do-it-yourself homeowners. The Consumer Brands Group segment provides branded and private-label architectural paints, stains, varnishes, industrial products, wood finishes products, wood preservatives, applicators, corrosion inhibitors, aerosols, caulks, and adhesives to retailers and distributors. The Performance Coatings Group segment develops and sells industrial coatings for wood finishing and general industrial applications, automotive refinish products, protective and marine coatings, coil coatings, packaging coatings, and performance-based resins and colorants. It serves retailers, dealers, jobbers, licensees, and other third-party distributors through its branches and direct sales staff, as well as through outside sales representatives. The company has operations primarily in North and South America, the Caribbean, Europe, Asia, and Australia. As of December 31, 2021, it operated 4,774 company-operated stores. The Sherwin-Williams Company was founded in 1866 and is headquartered in Cleveland, Ohio.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "OH",
        "city": "Cleveland",
        "zipcode": "44115-1075",
        "website": "http://www.sherwin-williams.com",
        "market_cap": 60732162048
    },
    "SIXW.CN": {
        "short_name": "SixthWaveInno",
        "long_name": "Sixth Wave Innovations Inc.",
        "summary": "Sixth Wave Innovations Inc., a development stage nanotechnology company, focuses on the extraction and detection of target substances at the molecular level using specialized molecularly imprinted polymers. It is in the process of commercializing its Affinity cannabinoid purification system; and IXOS, a line of extraction polymers for the gold mining industry. The company was formerly known as Atom Energy Inc. and changed its name to Sixth Wave Innovations Inc. in August 2019. Sixth Wave Innovations Inc. was incorporated in 2007 and is headquartered in Salt Lake City, Utah.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "United States",
        "state": "UT",
        "city": "Salt Lake City",
        "zipcode": "84108",
        "website": "http://sixthwave.com",
        "market_cap": 31221878
    },
    "SJ3.F": {
        "short_name": "SHERWIN-WILLIAMS  DL 1",
        "long_name": "The Sherwin-Williams Company",
        "summary": "The Sherwin-Williams Company develops, manufactures, distributes, and sells paints, coatings, and related products to professional, industrial, commercial, and retail customers. It operates in three segments: The Americas Group, Consumer Brands Group, and Performance Coatings Group. The Americas Group segment offers architectural paints and coatings, and protective and marine products, as well as OEM product finishes and related products for architectural and industrial paint contractors, and do-it-yourself homeowners. The Consumer Brands Group segment provides branded and private-label architectural paints, stains, varnishes, industrial products, wood finishes products, wood preservatives, applicators, corrosion inhibitors, aerosols, caulks, and adhesives to retailers and distributors. The Performance Coatings Group segment develops and sells industrial coatings for wood finishing and general industrial applications, automotive refinish products, protective and marine coatings, coil coatings, packaging coatings, and performance-based resins and colorants. It serves retailers, dealers, jobbers, licensees, and other third-party distributors through its branches and direct sales staff, as well as through outside sales representatives. The company has operations primarily in North and South America, the Caribbean, Europe, Asia, and Australia. As of December 31, 2021, it operated 4,774 company-operated stores. The Sherwin-Williams Company was founded in 1866 and is headquartered in Cleveland, Ohio.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OH",
        "city": "Cleveland",
        "zipcode": "44115-1075",
        "website": "http://www.sherwin-williams.com",
        "market_cap": 61247160320
    },
    "SNES": {
        "short_name": "SenesTech, Inc.",
        "long_name": "SenesTech, Inc.",
        "summary": "SenesTech, Inc. develops a technology for managing animal pest populations through fertility control. The company offers ContraPest, a liquid bait that limits reproduction of male and female rats. It is also developing a pipeline of fertility control and animal health products, including feral animal fertility control, non-surgical spay and neutering, boar taint, and animal cancer treatment. The company was incorporated in 2004 and is headquartered in Phoenix, Arizona.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85027",
        "website": "http://www.senestech.com",
        "market_cap": 18611990
    },
    "SSF.F": {
        "short_name": "SENSIENT TEC  DL-,10",
        "long_name": "Sensient Technologies Corporation",
        "summary": "Sensient Technologies Corporation, together with its subsidiaries, develops, manufactures, and markets colors, flavors, and other specialty ingredients in North America, Europe, the Asia Pacific, and internationally. It operates through three segments: Flavors & Extracts Group, Color Group, and Asia Pacific Group. The company offers flavor-delivery systems, and compounded and blended products; ingredient products, such as essential oils, natural and synthetic flavors, and natural extracts; fragrance products; and chili powder, paprika, and chili pepper, as well as dehydrated vegetables comprising parsley, celery, and spinach to the food, beverage, personal care, and household-products industries. It also provides natural and synthetic color systems for use in foods, beverages, pharmaceuticals, and nutraceuticals; colors and other ingredients for cosmetics, such as active ingredients, solubilizers, and surface treated pigments; pharmaceutical and nutraceutical excipients, including colors, flavors, coatings, and nutraceutical ingredients; and technical colors for industrial applications under the Sensient Food Colors, Sensient Pharmaceutical Coating Systems, Sensient Cosmetic Technologies, and Sensient Industrial Colors trade names. The company was incorporated in 1882 and is headquartered in Milwaukee, Wisconsin.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "WI",
        "city": "Milwaukee",
        "zipcode": "53202-5304",
        "website": "http://www.sensient.com",
        "market_cap": 2988377088
    },
    "SXT": {
        "short_name": "Sensient Technologies Corporati",
        "long_name": "Sensient Technologies Corporation",
        "summary": "Sensient Technologies Corporation, together with its subsidiaries, develops, manufactures, and markets colors, flavors, and other specialty ingredients in North America, Europe, the Asia Pacific, and internationally. It operates through three segments: Flavors & Extracts Group, Color Group, and Asia Pacific Group. The company offers flavor-delivery systems, and compounded and blended products; ingredient products, such as essential oils, natural and synthetic flavors, and natural extracts; fragrance products; and chili powder, paprika, and chili pepper, as well as dehydrated vegetables comprising parsley, celery, and spinach to the food, beverage, personal care, and household-products industries. It also provides natural and synthetic color systems for use in foods, beverages, pharmaceuticals, and nutraceuticals; colors and other ingredients for cosmetics, such as active ingredients, solubilizers, and surface treated pigments; pharmaceutical and nutraceutical excipients, including colors, flavors, coatings, and nutraceutical ingredients; and technical colors for industrial applications under the Sensient Food Colors, Sensient Pharmaceutical Coating Systems, Sensient Cosmetic Technologies, and Sensient Industrial Colors trade names. The company was incorporated in 1882 and is headquartered in Milwaukee, Wisconsin.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "WI",
        "city": "Milwaukee",
        "zipcode": "53202-5304",
        "website": "http://www.sensient.com",
        "market_cap": 3754116608
    },
    "T70.F": {
        "short_name": "TREDEGAR CORP.",
        "long_name": "Tredegar Corporation",
        "summary": "Tredegar Corporation, through its subsidiaries, manufactures and sells aluminum extrusions, PE Films, and polyester films in the United States and internationally. It operates through Aluminum Extrusions, PE Films, and Flexible Packaging Films segments. The Aluminum Extrusions segment produces soft-alloy and medium-strength aluminum extrusions primarily for building and construction, automotive and transportation, consumer durables, machinery and equipment, electrical and renewable energy, and distribution markets; and manufactures mill, anodized, and painted and fabricated aluminum extrusions to fabricators and distributors. The PE Films segment offers single- and multi-layer surface protection films for protecting components of flat panel displays used in televisions, monitors, notebooks, smart phones, tablets, e-readers, and digital signage under the UltraMask, ForceField, ForceField PEARL, and Pearl A brands. This segment also provides thin-gauge films for bathroom tissue and paper towels, as well as polyethylene overwrap films and films for other markets. The Flexible Packaging Films segment offers polyester-based films for food packaging and industrial applications under the Terphane and Sealphane brands. Tredegar Corporation was founded in 1955 and is headquartered in Richmond, Virginia.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "VA",
        "city": "Richmond",
        "zipcode": "23225",
        "website": "http://www.tredegar.com",
        "market_cap": 427818592
    },
    "TG": {
        "short_name": "Tredegar Corporation",
        "long_name": "Tredegar Corporation",
        "summary": "Tredegar Corporation, through its subsidiaries, manufactures and sells aluminum extrusions, PE Films, and polyester films in the United States and internationally. It operates through Aluminum Extrusions, PE Films, and Flexible Packaging Films segments. The Aluminum Extrusions segment produces soft-alloy and medium-strength aluminum extrusions primarily for building and construction, automotive and transportation, consumer durables, machinery and equipment, electrical and renewable energy, and distribution markets; and manufactures mill, anodized, and painted and fabricated aluminum extrusions to fabricators and distributors. The PE Films segment offers single- and multi-layer surface protection films for protecting components of flat panel displays used in televisions, monitors, notebooks, smart phones, tablets, e-readers, and digital signage under the UltraMask, ForceField, ForceField PEARL, and Pearl A brands. This segment also provides thin-gauge films for bathroom tissue and paper towels, as well as polyethylene overwrap films and films for other markets. The Flexible Packaging Films segment offers polyester-based films for food packaging and industrial applications under the Terphane and Sealphane brands. Tredegar Corporation was founded in 1955 and is headquartered in Richmond, Virginia.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Richmond",
        "zipcode": "23225",
        "website": "http://www.tredegar.com",
        "market_cap": 507093056
    },
    "TORM": {
        "short_name": "TOR Minerals International Inc",
        "long_name": "TOR Minerals International, Inc.",
        "summary": "TOR Minerals International, Inc. produces and sells specialty mineral products in the United States, Europe, and Asia. The company offers alumina trihydrate and boehmite halogen-free flame retardant and smoke suppressant fillers for plastics, rubber, and specialty applications; and beige and gray colored titanium dioxide (TiO2) pigments for use in paints, coatings, plastics, paper, and various other products. It also provides white TiO2, a pigment to add whiteness and opacity to paints and coatings, plastics, and other materials; and engineered fillers for use in plastics, paints, coatings, catalysts, and industrial products. The company was founded in 1973 and is headquartered in Corpus Christi, Texas.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Corpus Christi",
        "zipcode": "78402",
        "website": "http://www.torminerals.com",
        "market_cap": 4383222
    },
    "TR5.F": {
        "short_name": "TRINSEO SA  DL -,01",
        "long_name": "Trinseo S.A.",
        "summary": "Trinseo S.A., a materials company, manufactures and markets synthetic rubber, latex binders, and plastic products in the United States, Europe, the Asia-Pacific, and internationally. The company operates through six segments: Latex Binders, Synthetic Rubber, Performance Plastics, Polystyrene, Feedstocks, and Americas Styrenics. The Latex Binders segment offers styrene-butadiene, styrene-acrylate, vinylidene chloride, and butadiene-methacrylate latex products for the carpet and artificial turf markets, as well as performance latex products for the adhesive, building and construction, and technical textile paper market. The Synthetic Rubber segment provides styrene-butadiene rubber, emulsion styrene-butadiene rubber, nickel polybutadiene rubber, and neodymium polybutadiene rubber for use in tires and modifiers, as well as technical rubber products, such as conveyor belts, hoses, seals, and gaskets. The Performance Plastics segment offers engineered compounds and blends for the automotive, consumer electronics, medical, electrical, building and construction, appliance, and lighting markets. This segment also offers acrylonitrile-butadiene-styrene, styrene-acrylonitrile, and polycarbonate solutions; and soft-touch polymers and bioplastics, such as thermoplastic elastomers. The Polystyrene segment provides general purpose polystyrenes and high impact polystyrene for use in appliances, food packaging and food service disposables, consumer electronics, and building and construction materials. The Feedstocks segment offers styrene monomer, a basic building block of plastic. The Americas Styrenics segment provides styrene and polystyrene. Trinseo S.A. was founded in 2010 and is based in Berwyn, Pennsylvania.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "Berwyn",
        "zipcode": "19312",
        "website": "http://www.trinseo.com",
        "market_cap": 2115876736
    },
    "TREC": {
        "short_name": "Trecora Resources",
        "long_name": "Trecora Resources",
        "summary": "Trecora Resources primarily manufactures and sells various specialty petrochemicals products and specialty waxes in the United States. The company operates through two segments, Specialty Petrochemicals and Specialty Waxes. The Specialty Petrochemicals segment offers hydrocarbons and other petroleum based products, such as isopentane, normal pentane, isohexane, and hexane used in the production of polyethylene, packaging, polypropylene, expandable polystyrene, poly-iso/urethane foams, and crude oil from the Canadian tar sands, as well as in the catalyst support industry. It also owns and operates natural gas pipelines. The Specialty Waxes segment provides specialty polyethylene waxes for use in the paints and inks, adhesives, coatings, and PVC lubricants markets; and specialized synthetic poly alpha olefin waxes for use as toner in printers and as additives for candles. This segment also provides custom processing services. The company was formerly known as Arabian American Development Company and changed its name to Trecora Resources in June 2014. Trecora Resources was founded in 1967 and is based in Sugar Land, Texas.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Sugar Land",
        "zipcode": "77478",
        "website": "http://www.trecora.com",
        "market_cap": 212187200
    },
    "TSE": {
        "short_name": "Trinseo S.A.",
        "long_name": "Trinseo S.A.",
        "summary": "Trinseo S.A., a materials company, manufactures and markets synthetic rubber, latex binders, and plastic products in the United States, Europe, the Asia-Pacific, and internationally. The company operates through six segments: Latex Binders, Synthetic Rubber, Performance Plastics, Polystyrene, Feedstocks, and Americas Styrenics. The Latex Binders segment offers styrene-butadiene, styrene-acrylate, vinylidene chloride, and butadiene-methacrylate latex products for the carpet and artificial turf markets, as well as performance latex products for the adhesive, building and construction, and technical textile paper market. The Synthetic Rubber segment provides styrene-butadiene rubber, emulsion styrene-butadiene rubber, nickel polybutadiene rubber, and neodymium polybutadiene rubber for use in tires and modifiers, as well as technical rubber products, such as conveyor belts, hoses, seals, and gaskets. The Performance Plastics segment offers engineered compounds and blends for the automotive, consumer electronics, medical, electrical, building and construction, appliance, and lighting markets. This segment also offers acrylonitrile-butadiene-styrene, styrene-acrylonitrile, and polycarbonate solutions; and soft-touch polymers and bioplastics, such as thermoplastic elastomers. The Polystyrene segment provides general purpose polystyrenes and high impact polystyrene for use in appliances, food packaging and food service disposables, consumer electronics, and building and construction materials. The Feedstocks segment offers styrene monomer, a basic building block of plastic. The Americas Styrenics segment provides styrene and polystyrene. Trinseo S.A. was founded in 2010 and is based in Berwyn, Pennsylvania.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Berwyn",
        "zipcode": "19312",
        "website": "http://www.trinseo.com",
        "market_cap": 2638981376
    },
    "UEO.F": {
        "short_name": "WESTLAKE CHEM.CORP.DL-,01",
        "long_name": "Westlake Chemical Corporation",
        "summary": "Westlake Chemical Corporation, together with its subsidiaries, manufactures and markets basic chemicals, vinyls, polymers, and building products worldwide. It operates through two segments, Vinyls and Olefins. The Vinyls segment provides specialty and commodity polyvinyl chloride (PVC), vinyl chloride monomers, ethylene dichloride, chlorine, caustic soda, chlorinated derivative, and ethylene products. This segment also manufactures and sells PVC compounds and building products fabricated from PVC, including residential siding, trim and molding, pipe and fittings for various water, sewer and industrial applications, profiles for windows and doors, decking products, films for various inflatables, wall covering tapes, roofing applications, and composite roof tiles. The Olefins segment offers polyethylene, styrene monomers, and various ethylene co-products, as well as sells propylene, crude butadiene, pyrolysis gasoline, and hydrogen products. Westlake Chemical Corporation offers its products to a range of customers, including chemical processors, plastics fabricators, small construction contractors, municipalities, and supply warehouses in various consumer and industrial markets, such as flexible and rigid packaging, automotive products, coatings, water treatment, refrigerants, and residential and commercial construction, as well as other durable and non-durable goods. The company was founded in 1986 and is headquartered in Houston, Texas. Westlake Chemical Corporation is a subsidiary of TTWF LP.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77056",
        "website": "http://www.westlake.com",
        "market_cap": 10922723328
    },
    "UG9.F": {
        "short_name": "NEWMARKET CORP.",
        "long_name": "NewMarket Corporation",
        "summary": "NewMarket Corporation, through its subsidiaries, engages in the petroleum additives businesses. The company offers lubricant additives for use in various vehicle and industrial applications, including engine oils, transmission fluids, off-road powertrain and hydraulic systems, gear oils, hydraulic oils, turbine oils, and other applications where metal-to-metal moving parts are utilized; and engine oil, driveline, and industrial additives. It also provides fuel additives that are used to enhance the oil refining process and the performance of gasoline, diesel, biofuels, and other fuels to industry, government, original equipment manufacturers, and individual customers. In addition, it engages in the antiknock compounds business, as well as contracted manufacturing and services activities. The company has operations in the North America, Latin America, Asia Pacific, Europe, the Middle East, Africa, and India. NewMarket Corporation was founded in 1887 and is headquartered in Richmond, Virginia.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "VA",
        "city": "Richmond",
        "zipcode": "23219-4350",
        "website": "http://www.newmarket.com",
        "market_cap": 3171568384
    },
    "UNRG": {
        "short_name": "UNITED ENERGY CORP",
        "long_name": "United Energy Corp.",
        "summary": "United Energy Corp. engages in the development, manufacture, and sale of specialty chemical products in the United States and internationally. The company offers K-Line of chemical products for the oil industry, such as KH-30, a mixture of modified oils, dispersants, and oil-based surfactants to control paraffin and asphaltene deposits in oil wells; KX-100, a formula for the removal of a plug of paraffin or asphaltene; SR-3 scale and rust remover for the removal of calcium carbonate and calcium sulfate salt deposits; HPD-1 PLUS for remediation of tough clogging problems with upper medium to high molecular weight paraffin; and GSA Gun & Bore Cleaner, a bore and chamber cleaner for guns ranging from small handguns to 16Â\u0094 guns. The company, through its subsidiary, Green Globe Industries, Inc., provides various solvents, paint strippers, and cleaners under the Qualchem trade name for the U.S. military. Green Globe's products include leak detection compound type I and II, a gas leak detection compound for detecting leaks in high and low-pressure oxygen systems in aircraft and other related oxygen systems; corrosion inhibitor, an additive for use with anti-freeze in water to retard corrosion; corrosion removing compound type I, II, and III, which include corrosion removing and metal conditioning compounds to remove rust from ferrous metal surfaces; ethylene glycol, a mixture of ethylene glycol and distilled water to provide a coolant mixture for use in radar domes used by the military; and NPX powder coating, a reusable paint stripper for stripping metals, including magnesium, zinc, high strength steel, and titanium. It markets and distributes its K-Line of chemical products through independent contractors in the United States, Mexico, South America, Africa, Europe, and the Middle East, as well as other products through distributors. The company was formerly known as Aztec Silver Mining Co. United Energy Corp. was founded in 1971 and is based in Sachse, Texas.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Sachse",
        "zipcode": "75048",
        "website": "http://www.unitedenergycorp.net",
        "market_cap": 93437
    },
    "VYST": {
        "short_name": "VYSTAR CORPORATION",
        "long_name": "Vystar Corporation",
        "summary": "Vystar Corporation manufactures and sells Vytex natural rubber latex (NRL) products to the manufacturers of rubber and rubber end products in the United States. Its products are used by manufacturers of a range of consumer and medical products, such as adhesives, gloves, balloons, condoms, and other medical devices, as well as natural rubber latex foam mattresses, toppers, and pillows. The company also offers RXair, an air purifier; and a range of residential furniture and decorative accessories. Vystar Corporation was founded in 2000 and is based in Worcester, Massachusetts.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MA",
        "city": "Worcester",
        "zipcode": "01610",
        "website": "http://www.vystarcorp.com",
        "market_cap": 33497856
    },
    "WD1.F": {
        "short_name": "WD-40 CO.  DL -,001",
        "long_name": "WD-40 Company",
        "summary": "WD-40 Company develops and sells maintenance products, and homecare and cleaning products in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. The company offers multi-purpose maintenance products, including aerosol sprays, non-aerosol trigger sprays, and in liquid-bulk form products under the WD-40 Multi-Use brand name for various consumer uses and industrial applications; and specialty maintenance products, such as penetrants, degreasers, corrosion inhibitors, greases, lubricants, and rust removers under the WD-40 Specialist brand, as well as various products under the WD-40 Bike brand name. It also provides multi-purpose and specialty drip oils, and spray lubricant products, as well as other specialty maintenance products under the 3-IN-ONE brand name; and professional spray maintenance products and lubricants for the bike market under the GT85 brand name. In addition, the company offers automatic toilet bowl cleaners under the 2000 Flushes brand name; aerosol and liquid trigger carpet stain and odor eliminators under the Spot Shot brand; room and rug deodorizers under the Carpet Fresh brand name; carpet and household cleaners, and rug and room deodorizers under the 1001 brand; heavy-duty hand cleaner products under the Lava brand name in the United States, as well as under the Solvol brand name in Australia; and liquid mildew stain removers and automatic toilet bowl cleaners under the X-14 brand name. It sells its products primarily through warehouse club stores, hardware stores, automotive parts outlets, industrial distributors and suppliers, mass retail and home center stores, value retailers, grocery stores, online retailers, farm supply, sport retailers, and independent bike dealers. WD-40 Company was founded in 1953 and is headquartered in San Diego, California.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "San Diego",
        "zipcode": "92131",
        "website": "http://www.wd40company.com",
        "market_cap": 2881548800
    },
    "WDFC": {
        "short_name": "WD-40 Company",
        "long_name": "WD-40 Company",
        "summary": "WD-40 Company develops and sells maintenance products, and homecare and cleaning products in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. The company offers multi-purpose maintenance products, including aerosol sprays, non-aerosol trigger sprays, and in liquid-bulk form products under the WD-40 Multi-Use brand name for various consumer uses and industrial applications; and specialty maintenance products, such as penetrants, degreasers, corrosion inhibitors, greases, lubricants, and rust removers under the WD-40 Specialist brand, as well as various products under the WD-40 Bike brand name. It also provides multi-purpose and specialty drip oils, and spray lubricant products, as well as other specialty maintenance products under the 3-IN-ONE brand name; and professional spray maintenance products and lubricants for the bike market under the GT85 brand name. In addition, the company offers automatic toilet bowl cleaners under the 2000 Flushes brand name; aerosol and liquid trigger carpet stain and odor eliminators under the Spot Shot brand; room and rug deodorizers under the Carpet Fresh brand name; carpet and household cleaners, and rug and room deodorizers under the 1001 brand; heavy-duty hand cleaner products under the Lava brand name in the United States, as well as under the Solvol brand name in Australia; and liquid mildew stain removers and automatic toilet bowl cleaners under the X-14 brand name. It sells its products primarily through warehouse club stores, hardware stores, automotive parts outlets, industrial distributors and suppliers, mass retail and home center stores, value retailers, grocery stores, online retailers, farm supply, sport retailers, and independent bike dealers. WD-40 Company was founded in 1953 and is headquartered in San Diego, California.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Diego",
        "zipcode": "92131",
        "website": "http://www.wd40company.com",
        "market_cap": 3328802048
    },
    "WLAB": {
        "short_name": "WHITE LABEL LIQUID INC",
        "long_name": "White Label Liquid, Inc.",
        "summary": "White Label Liquid, Inc. provides manufacturing service for custom-blended products containing hemp-derived CBD oil. It sells its products to various companies, including major and small brands, chain stores, vape shops, distributors, and dealers worldwide. The company creates, brands, designs, and customizes packaging for its clients and deliver various products engineered to meet their specific goals. It also manufactures CBD oil, terpenes oil, vape liquid, CBD gummies, infused herbs, pre-filled vape pens, lotions, lip balms, and other products. The company has the capability to produce approximately 50,000 units per day in various packaging sizes and shapes using custom labels and customized presentation packaging. White Label Liquid, Inc. is based in Daytona Beach, Florida.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Daytona Beach",
        "zipcode": "32114",
        "website": "http://www.whitelabelliquid.com",
        "market_cap": null
    },
    "WLK": {
        "short_name": "Westlake Chemical Corporation",
        "long_name": "Westlake Chemical Corporation",
        "summary": "Westlake Chemical Corporation, together with its subsidiaries, manufactures and markets basic chemicals, vinyls, polymers, and building products worldwide. It operates through two segments, Vinyls and Olefins. The Vinyls segment provides specialty and commodity polyvinyl chloride (PVC), vinyl chloride monomers, ethylene dichloride, chlorine, caustic soda, chlorinated derivative, and ethylene products. This segment also manufactures and sells PVC compounds and building products fabricated from PVC, including residential siding, trim and molding, pipe and fittings for various water, sewer and industrial applications, profiles for windows and doors, decking products, films for various inflatables, wall covering tapes, roofing applications, and composite roof tiles. The Olefins segment offers polyethylene, styrene monomers, and various ethylene co-products, as well as sells propylene, crude butadiene, pyrolysis gasoline, and hydrogen products. Westlake Chemical Corporation offers its products to a range of customers, including chemical processors, plastics fabricators, small construction contractors, municipalities, and supply warehouses in various consumer and industrial markets, such as flexible and rigid packaging, automotive products, coatings, water treatment, refrigerants, and residential and commercial construction, as well as other durable and non-durable goods. The company was founded in 1986 and is headquartered in Houston, Texas. Westlake Chemical Corporation is a subsidiary of TTWF LP.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77056",
        "website": "http://www.westlake.com",
        "market_cap": 13070439424
    },
    "XLPI": {
        "short_name": "XCELPLUS INTERNATIONAL INC",
        "long_name": "XcelPlus International, Inc.",
        "summary": "XcelPlus International, Inc. distributes chemicals, lubricants, and alternative fuel technologies in the United States. It offers products in the areas of automotive, aviation, marine, emissions, lawn and garden, heavy duty equipment, industrial heavy duty equipment, agricultural, mission critical, railway, and miscellaneous. The company was incorporated in 2000 and is headquartered in Saluda, Virginia. XcelPlus International, Inc. operates as a subsidiary of Clean Energy Pathways, Inc.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Saluda",
        "zipcode": "23149",
        "website": null,
        "market_cap": 293020
    },
    "XQN.F": {
        "short_name": "CORE MOLDING TECH. DL-,01",
        "long_name": "Core Molding Technologies, Inc.",
        "summary": "Core Molding Technologies, Inc., together with its subsidiaries, engages in the molding of thermoplastic and thermoset structural products. The company offers a range of manufacturing processes that include compression molding of sheet molding compounds, bulk molding compounds, resin transfer molding, liquid molding of dicyclopentadiene, spray-up and hand-lay-up, glass mat thermoplastics, direct long-fiber thermoplastics, and structural foam and web injection molding, as well as reaction injection molding utilizing dicyclopentadiene technology. It serves various markets, including medium and heavy-duty truck, marine, automotive, agriculture, construction, and other commercial products in the United States, Mexico, Canada, and internationally. The company was formerly known as Core Materials Corporation and changed its name to Core Molding Technologies, Inc. in August 2002. Core Molding Technologies, Inc. was incorporated in 1996 and is headquartered in Columbus, Ohio.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OH",
        "city": "Columbus",
        "zipcode": "43228-0183",
        "website": "http://www.coremt.com",
        "market_cap": 84862944
    },
    "ZGV3.F": {
        "short_name": "GEVO INC.  DL-,01",
        "long_name": "Gevo, Inc.",
        "summary": "Gevo, Inc. operates as a renewable fuels company. The company commercializes gasoline, jet fuel, and diesel fuel to achieve zero carbon emissions, and reduce greenhouse gas emissions with sustainable alternatives. Its products also include renewable biodiesel, isooctane, isobutanol, sustainable aviation fuel, isobutylene, ethanol, and animal feed. The company was formerly known as Methanotech, Inc. and changed its name to Gevo, Inc. in March 2006. Gevo, Inc. was founded in 2005 and is headquartered in Englewood, Colorado.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.gevo.com",
        "market_cap": 1417447808
    }
}