{"MTN.MX": {"short_name": "VAIL RESORTS INC", "long_name": "Vail Resorts, Inc.", "summary": "Vail Resorts, Inc., through its subsidiaries, operates mountain resorts and urban ski areas in the United States. Its Mountain segment operates Vail Mountain, Breckenridge Ski, Keystone, Beaver Creek, and Crested Butte Mountain resorts in Colorado; Heavenly Mountain, Northstar, and Kirkwood Mountain resorts in the Lake Tahoe area of California and Nevada; Mount Sunapee Resort in New Hampshire; Park City resort in Utah; Stowe and Okemo Mountain Resort in Vermont; and Stevens Pass Mountain Resort in Washington. This segment also operates Whistler Blackcomb in Canada; and Perisher Ski Resort, and Falls Creek and Hotham Alpine Resort in Australia, as well as 3 urban ski areas, such as Afton Alps in Minnesota, Mount Brighton in Michigan, and Wilmot Mountain in Wisconsin. Its resorts offer various winter and summer recreational activities, including skiing, snowboarding, snowshoeing, snowtubing, sightseeing, mountain biking, guided hiking, zip lines, challenge ropes courses, alpine slides and mountain coasters, children's activities, and other recreational activities; and ski and snowboard lessons, equipment rental and retail merchandise services, dining venues, private club operations, and other winter and summer recreational activities. This segment also leases its owned and leased commercial space to third party operators; and provides real estate brokerage services. The company's Lodging segment owns and/or manages various luxury hotels and condominiums under the RockResorts brand, and other lodging properties; various condominiums located in proximity to the company's mountain resorts; destination resorts; and golf courses, as well as offers resort ground transportation services. This segment operates approximately 5,500 owned and managed hotel and condominium units. Its Real Estate segment owns, develops, and sells real estate properties in and around the company's resort communities. The company was founded in 1997 and is based in Broomfield, Colorado.", "currency": "MXN", "sector": "Basic Materials", "industry": "Steel & Iron", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Broomfield"}}