{
    "APGN.SW": {
        "short_name": "APG SGA N",
        "long_name": "APG|SGA SA",
        "summary": "APG|SGA SA, a media company, provides out of home advertising services primarily in Switzerland and Serbia. The company transports advertising messages into the public and private areas, including streets, city centers, pedestrian zones, railway stations, shopping centers, airports, and tourist resorts, as well as on the outside and inside of public transport vehicles through posters, screens, and related media. It serves customers, and advertising and media agencies. The company was formerly known as Affichage Holding SA and changed its name to APG|SGA SA in July 2012. APG|SGA SA was founded in 1900 and is headquartered in Geneva, Switzerland.",
        "currency": "CHF",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Geneva"
    },
    "MCHN.SW": {
        "short_name": "MCH GROUP N",
        "long_name": "MCH Group AG",
        "summary": "MCH Group AG operates as a live marketing company that provides a network of services in the exhibition and event market worldwide. The company organizes exhibitions, congresses, concerts, and various corporate and public events. It organizes approximately 90 company owned and guest exhibitions in Switzerland and internationally. The company also offers event infrastructures for exhibitions, congresses, and corporate and public events in Basel and Zurich. In addition, it provides customized marketing solutions in the areas of strategic and conceptional consulting, marketing consulting, event management, exhibition and event structures, and multimedia. MCH Group AG was founded in 1916 and is headquartered in Basel, Switzerland.",
        "currency": "CHF",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Basel"
    }
}