{"HLEE.SW": {"short_name": "HIGHLIGHT E AND E I", "long_name": "Highlight Event and Entertainment AG", "summary": "Highlight Event and Entertainment AG, through its subsidiaries, primarily engages in the event marketing business. The company operates through Film, Sports and Event Marketing, Sports, and Event Marketing segments. The Film segment engages in the production of films and exploitation of rights; and distribution of theatrical, DVD/Blu-ray, and TV movies. The Sports and Event Marketing segment is involved in the marketing of the UEFA Champions League, UEFA Europa League, and UEFA Super Cup. The Sports segment conducts the World Boxing Super Series, an annual boxing tournament. The Event Marketing segment engages in the marketing of international music, culture, and entertainment projects, primarily consisting of exploitation and service provision of the marketing rights for the Vienna Philharmonic Orchestra and Eurovision Song Contest. The company was formerly known as Escor Casinos & Entertainment SA and changed its name to Highlight Event and Entertainment AG in May 2012. Highlight Event and Entertainment AG is based in Pratteln, Switzerland.", "currency": "CHF", "sector": "Communication Services", "industry": "Entertainment", "exchange": "EBS", "market": "ch_market", "country": "Switzerland", "city": "Pratteln"}, "HLG.DE": {"short_name": "HIGHLIGHT CMNCTS INH.SF 1", "long_name": "Highlight Communications AG", "summary": "Highlight Communications AG operates as a strategic and financial holding company worldwide. The company operates through Film, Sports-and Event-Marketing, and Sports segments. The Film segment is involved in the film production/procurement of rights, film distribution, home entertainment, license trading/TV exploitation, and TV production; production and distribution of movies, television, and video formats; and production of event specials, primetime shows, comedy, reality shows, scripted reality, and docusoaps, as well as provision of services for entertainment media. It also engages in distribution of theatrical, DVD/Blu-ray, and TV movies; and exploitation of its video rights for in-house and licensed films. The Sports-and Event-Marketing segment markets various international sports events, including the UEFA Champions League, the UEFA Europa League, and the UEFA Super Cup. The Sports segment engages in the advertising and sponsorship sales in the free TV and digital areas, and pay TV. The company was founded in 1983 and is headquartered in Pratteln, Switzerland.", "currency": "EUR", "sector": "Communication Services", "industry": "Entertainment", "exchange": "GER", "market": "de_market", "country": "Switzerland", "city": "Pratteln"}, "KUD.SW": {"short_name": "KUDELSKI I", "long_name": "Kudelski SA", "summary": "Kudelski SA develops and delivers a range of secure content protection solutions to address the needs of the digital television ecosystem in Internet, satellite, cable, terrestrial, and hybrid end-to-end transmission systems in Switzerland, the United States, France, Norway, and internationally. It operates through four segments: Digital TV, Cybersecurity, Internet of Things (IoT), and Public Access. The Digital TV segment offers integrated solutions, including open conditional access solutions, which allow TV operators and content providers to operate various value-added pay TV services on a secure platform, and middleware software solutions for set-top boxes and other consumer devices; and intellectual property consulting services. The Cybersecurity segment provides cybersecurity solutions to various sectors, such as advisory, technology and resale, managed security, and research and development services. The IoT segment offers device security through identity authentication and firmware protection; data security to ensure the confidentiality, integrity, and authenticity of sensitive data; and access management and active security protections to enable secure processing, local decision making, and threat detection and response. The Public Access segment provides access control systems and ticketing services for ski lifts, car parks, stadiums, concert halls, and other events. The company also offers watermarking solutions, as well as operates a travel agency; and finance services. In addition, it offers smartcards and digital TV sales and support services. Kudelski SA was founded in 1951 and is headquartered in Cheseaux-sur-Lausanne, Switzerland.", "currency": "CHF", "sector": "Communication Services", "industry": "Entertainment", "exchange": "EBS", "market": "ch_market", "country": "Switzerland", "city": "Cheseaux-sur-Lausanne"}, "MSU.MI": {"short_name": "MONDO TV SUISSE", "long_name": "Mondo TV Suisse S.A.", "summary": "Mondo TV Suisse S.A. produces and distributes animated television series in Switzerland. It is also involved in licensing and merchandising activities related to games, clothing, books, comics, magazines, and sticker albums. The company was founded in 2014 and is based in Lugano, Switzerland. Mondo TV Suisse S.A. is a subsidiary of Mondo TV S.p.A.", "currency": "EUR", "sector": "Communication Services", "industry": "Entertainment", "exchange": "MIL", "market": "it_market", "country": "Switzerland", "city": "Lugano"}}