{
    "SLXIT.CO": {
        "short_name": "Seluxit A/S",
        "long_name": "Seluxit A/S",
        "summary": "Seluxit A/S provides Internet of Things solutions. It offers hardware and software, including embedded systems; Seluxit IoT platform; Wappsto, an App marketplace; and Wappsto apps that digitize products to provide Smart Home, Smart Meters, and Smart Machines solutions. The company was founded in 2006 and is based in Aalborg, Denmark.",
        "currency": "DKK",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "CPH",
        "market": "dk_market",
        "country": "Denmark",
        "state": null,
        "city": "Aalborg",
        "zipcode": "9200",
        "website": "http://www.seluxit.com",
        "full_time_employees": 19
    },
    "ZVR.F": {
        "short_name": "SOLAR AS B  DK 100",
        "long_name": "Solar A/S",
        "summary": "Solar A/S operates as a sourcing and services company in electrical, heating and plumbing, ventilation, and climate and energy solutions in the Danish, Swedish, Norwegian, and Dutch markets. The company offers lighting fixtures and luminaries, and various installation materials; switches and sockets, and other products in relation to intelligent building systems; and cables. It also provides communication and security products and solutions, such as video surveillance equipment and accessories, burglar alarms, fire alarms, and access control systems for large installations and urban networks, as well as customized solutions for home switches, UPS, and antenna equipment for telephony. In addition, the company offers valves; solar panels and electricity, wood, pellet boilers, etc.; products for bathrooms and kitchens, as well as pipes of steel, copper, and plastic for various purposes; products for mounting and supporting the pipes; and drainage systems, cable protection systems, floor drains, cold-water pumps, and hoses and insulation products. Further, it provides logistics, professional support, and training services. The company was founded in 1919 and is headquartered in Vejen, Denmark.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Denmark",
        "state": null,
        "city": "Vejen",
        "zipcode": "6600",
        "website": "http://www.solar.eu",
        "full_time_employees": 2864
    }
}