{
    "LIQT": {
        "short_name": "LiqTech International, Inc.",
        "long_name": "LiqTech International, Inc.",
        "summary": "LiqTech International, Inc., a clean technology company, designs, develops, produces, markets, and sells automated filtering systems, and ceramic silicon carbide liquid and diesel particulate air filters in the United States, Canada, Europe, Asia, and South America. The company manufactures and sells ceramic silicon carbide membranes and systems for liquid filtration under the LiqTech, Cometas, and Provital brand names, which are used for the filtration of produced water, pre-filtration of reverse osmosis drinking water, industrial applications, producing clean drinking water, and pool and spa water, as well as marine scrubber wash water. It also offers diesel particulate filters for exhaust emission control solutions to the verified retrofit and the original equipment manufacturer market; and plastics, which provide machined and welded plastic parts for the prepress, UV, and aquaculture market segments. LiqTech International, Inc. sells its products primarily to industrial customers through direct sales, systems integrators, distributors, agents, and partners. The company was formerly known as Blue Moose Media, Inc. and changed its name to LiqTech International, Inc. in October 2011. LiqTech International, Inc. was founded in 2004 and is headquartered in Ballerup, Denmark.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Denmark",
        "city": "Ballerup"
    },
    "WATURU.CO": {
        "short_name": "Waturu Holding A/S",
        "long_name": "Waturu Holding A/S",
        "summary": "Waturu Holding A/S manufactures, develops, and sells water heater and water treatment technology products. The company offers a point-of-use water heater that heats the water directly through the transfer of energy and eliminates circulation losses; and an industrial wastewater disinfection solution, as well as related components WATURU brand name. It also develops various medical devices that treat, sterilize, and hydrogenates water to treat wound care and atopic dermatitis diseases. The company was founded in 2016 and is based in Vejle, Denmark.",
        "currency": "DKK",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "CPH",
        "market": "dk_market",
        "country": "Denmark",
        "city": "Vejle"
    },
    "X9A.F": {
        "short_name": "WATURU HOLDING  DK-,05",
        "long_name": "Waturu Holding A/S",
        "summary": "Waturu Holding A/S manufactures, develops, and sells water heater and water treatment technology products. The company offers a point-of-use water heater that heats the water directly through the transfer of energy and eliminates circulation losses; and an industrial wastewater disinfection solution, as well as related components WATURU brand name. It also develops various medical devices that treat, sterilize, and hydrogenates water to treat wound care and atopic dermatitis diseases. The company was founded in 2016 and is based in Vejle, Denmark.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Denmark",
        "city": "Vejle"
    }
}