{
  "BACTIQ.CO": {
    "city": "Horsholm",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Bactiquant A/S",
    "market": "dk_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "BactiQuant A/S",
    "state": null,
    "summary": "Bactiquant A/S develops and provides technology for the mobile and online surveillance of bacterial contamination levels in water. The company is based in 1998 and is based in Horsholm, Denmark.",
    "website": "http://www.mycometer.com",
    "zipcode": "DK-2970"
  },
  "LIQT": {
    "city": "Ballerup",
    "country": "Denmark",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Pollution & Treatment Controls",
    "long_name": "LiqTech International, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "LiqTech International, Inc.",
    "state": null,
    "summary": "LiqTech International, Inc., a clean technology company, designs, develops, produces, markets, and sells automated filtering systems, and ceramic silicon carbide liquid applications and diesel particulate air filters in the United States, Canada, Europe, Asia, and South America. The company manufactures and sells ceramic silicon carbide filters and membranes for liquid filtration under the LiqTech, Cometas, and Provital brand names, which are used for the filtration of produced water, pre-filtration of reverse osmosis drinking water, industrial applications, producing clean drinking water, and pool and spa water, as well as marine scrubber wash water. It also offers diesel particulate filters for exhaust emission control solutions to the verified retrofit and the original equipment manufacturer market; and plastics, which provide machined and welded plastic parts for the prepress, UV, and aquaculture market segments. LiqTech International, Inc. sells its products primarily to industrial customers through direct sales, systems integrators, distributors, agents, and partners. The company was formerly known as Blue Moose Media, Inc. and changed its name to LiqTech International, Inc. in October 2011. LiqTech International, Inc. was incorporated in 2004 and is headquartered in Ballerup, Denmark.",
    "website": "http://www.liqtech.com",
    "zipcode": "2750"
  }
}
