{"1904.T": {"short_name": "TAISEI ONCHO CO", "long_name": "Taisei Oncho Co., Ltd.", "summary": "Taisei Oncho Co., Ltd. engages in the design and construction of air conditioning systems, water supply/drainage sanitary systems, and electrical equipment in Japan. It also offers related maintenance and renovation services. The company was founded in 1941 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "1979.T": {"short_name": "TAIKISHA LTD", "long_name": "Taikisha Ltd.", "summary": "Taikisha Ltd. designs, manages, and constructs HVAC systems and automobile paint plants and sells related equipment in Japan and internationally. The company operates through two segment, Green Technology System Division and Paint Finishing System Division. It designs and constructs HVAC systems for office buildings, schools, hospitals, hotels, museums, airport terminals, manufacturing facilities, and research laboratories. The company engages in the design, construction, and administration of HVAC, freezing, and fumatorium facilities; clean rooms and peripheral equipment; plumbing and sanitary facilities; fire and disaster protection systems; HVAC facilities in communities and cogeneration facilities; paint finishing plants for automobile manufacturers; treatment systems for emissions and waste; and electric and instrumentation facilities. It is also involved in the design, implementation, and administration of construction works; and manufacture, process, sale, and import/export of peripheral equipment. The company was founded in 1913 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "1981.T": {"short_name": "KYOWANISSEI CO LTD", "long_name": "Kyowanissei Co.,Ltd.", "summary": "Kyowanissei Co.,Ltd. engages in the construction and civil engineering business in Japan. Its businesses cover gas facility construction; heating/cooling hot water supply/air conditioning equipment construction; residential solar power generation system construction; gas conduit laying work; road paving work related to gas conduit burial work; and maintenance services in the areas of gas conduit repair work, gas leakage emergency dispatch, and gas security patrol service. The company is also involved in water supply/hot water supply, drainage, ventilation equipment, outdoor water supply/drainage and sewage septic tank facilities, and factory plant construction, as well as sanitation, firefighting, and kitchen equipment construction; air conditioning installation work; and water supply/hot water supply, drainage, ventilation, and other equipment maintenance. In addition, its business covers electric construction and maintenance work comprising general civil engineering work, such as water supply construction and road paving work; and irrigation work. The company was founded in 1887 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "1994.T": {"short_name": "TAKAHASHI CURTAIN WALL CORP", "long_name": "Takahashi Curtain Wall Corporation", "summary": "Takahashi Curtain Wall Corporation designs, manufactures, and constructs precast concrete curtain walls in Japan. It also plans, proposes, designs, and constructs water environments, water spaces, and water facilities. The company was founded in 1951 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3110.T": {"short_name": "NITTO BOSEKI CO", "long_name": "Nitto Boseki Co., Ltd.", "summary": "Nitto Boseki Co., Ltd. engages in the manufacture, processing, and sale of textile products and textile-related industrial goods, rock wool and building materials, glass fiber products, and specialty chemicals and medical products in Japan. The company offers a range of apparel and other products, including interlinings for women's apparel, stretch fabrics, and functional textiles. It also provides glass fiber products for use in automobiles; composites for smartphone casings; high performance electronic substrates; resin-coated film materials; and house insulation materials. In addition, the company develops reagents for in vitro diagnostics in the biochemistry, hematology, and immunology fields; develops specialty chemicals, such as functional polymers for various applications; and produces and sells PET bottles and soft drinks. Further, it engages in the planning, supervision, and contracting for construction; and design, manufacture, and sale of machinery and equipment. The company was formerly known as Fukusima Seiren Seishi K.K. and changed its name to Nitto Boseki Co., Ltd. in April 1923. Nitto Boseki Co., Ltd. was founded in 1918 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4026.T": {"short_name": "KONOSHIMA CHEMICAL CO", "long_name": "Konoshima Chemical Co.,Ltd.", "summary": "Konoshima Chemical Co.,Ltd. manufactures and sells building materials, chemicals, and ceramics. The company offers building materials, such as ceramic exterior walls for houses; interior materials for buildings and houses; and fireproofing protection plates and fireproof panels for buildings. It also provides chemicals, such as magnesium oxide, magnesium hydroxide, magnesium carbonate, non-halogen flame retardant, calcium carbonate, etc.; and functional ceramics. Konoshima Chemical Co.,Ltd. was founded in 1917 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "4212.T": {"short_name": "SEKISUI JUSHI CORP", "long_name": "Sekisui Jushi Corporation", "summary": "Sekisui Jushi Corporation provides materials based on composite technology in Japan. The company offers transportation and landscape related products, including road marking materials, road signs, signs, signboards, soundproof wall materials, traffic safety materials, electronic system related products, pedestrian guard fences, vehicle guard fences, wind and snow fences, car stops, assembly sidewalks, balustrades, park materials, shelter, solar lighting, artificial wood, etc. It also provides sports facility related products, artificial turf field watering systems, artificial turf field high-speed drainage systems, etc. In addition, the company offers housing and building materials related products, which include mesh fences, fences, soundproof meshes, exterior products, bicycle storage products, decorative building materials, functional surface materials, handrail products, etc.; and packing and binding bands and films, packing materials, packing machines, agricultural materials, facility gardening materials, etc. Further, it provides other products consisting heat-shielding pavement products, concrete piece peeling prevention systems, aluminum resin laminated composite boards, assembly pipe systems, digital picking systems, automobile parts related products, etc. Sekisui Jushi Corporation was incorporated in 1941 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "4216.T": {"short_name": "ASAHI YUKIZAI CORPORATION", "long_name": "Asahi Yukizai Corporation", "summary": "Asahi Yukizai Corporation engages in the valve and piping systems, resins, and water treatment and natural resources exploitation businesses in Japan. The company offers ASAHI AV manual and automatic valves, and pipes and fittings; Dymatrix products for semiconductor and flat panel display process needs; Falconics flow control systems; and various mixers; as well as designs, produces, and constructs various equipment and facilities. It also engages in the development and supply of water and thermal resources, including well drilling and geothermal exploitation, geological surveys and consulting, and hot spring exploitation; design and construction of water utility facilities and reuse of wastewater; industrial water and wastewater treatment; prevention of environmental pollution and purification; and provision of public sewage facilities. In addition, the company provides environmental equipment and systems, and maintenance and management services. Further, it offers resins and sand products for casting; and electronics materials, as well as products for housing and construction, and industrial applications. The company was formerly known as Asahi Organic Chemicals Industry Co., Ltd. and changed its name to Asahi Yukizai Corporation in April 2016. Asahi Yukizai Corporation was founded in 1945 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4224.T": {"short_name": "LONSEAL CORP", "long_name": "Lonseal Corporation", "summary": "Lonseal Corporation manufactures and sells plastic products in Japan and internationally. The company offers flooring materials; sheet waterproof materials; antivirus, antibacterial, deodorizing, and contamination-proof wall materials, as well as products for sick building syndrome; and flexible, rigid, and antiviral PVC films, as well as flexible acrylic films for use in various industrial purposes. It also provides floor coverings for railroad vehicles; floor coating materials for buses, specially equipped vehicles, and cars; substrate films for semiconductors and electronic components; and housing material products. Lonseal Corporation was founded in 1928 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "5237.T": {"short_name": "NOZAWA CORPORATION", "long_name": "Nozawa Corporation", "summary": "Nozawa Corporation manufactures and sells extruded cement panels in Japan. Its principal products include flat panels, rib and emboss design panels, and coated panels. The company offers extruded cement panels for resistance against noise, freezing, fire, and earthquakes; and exterior walls and partitions of various office buildings, plants, and warehouses, as well as for external insulation systems with other application technologies. It also engages in the manufacture and sale of building materials. The company was founded in 1890 and is headquartered in Kobe, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kobe"}, "5262.T": {"short_name": "NIPPON HUME CORP", "long_name": "Nippon Hume Corporation", "summary": "Nippon Hume Corporation designs, manufactures, and sells concrete secondary products in Japan and internationally. The company offers pipeline products, such as hume tubes and synthetic steel pipes, box and arch culverts, assembly manholes, precast joint grooves, wellman products, jip pipes, propulsion pipes, optical fiber compatible products, and antibacterial concrete products; concrete piles; RC segments and FN fittings; and PC and composite wells, and press casts and PRC hollow piers. It also provides multi-arch divided systems, precast guard fences, EMC wall rails, and wall railings; and valve boxes, precast retarding basins, and eco concrete products, as well as optical fiber cables. Further, the company is involved in the construction contracting, and civil engineering and telecommunications works; sale of concrete products and big agents; sports business; manufacture, sale, design, and equipment construction of deplant deodorization system; maintenance of buildings; manufacture and sale of formwork for concrete products; real estate business; laying business; and pipeline diagnosis business. The company was founded in 1925 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "5268.T": {"short_name": "ASAHI CONCRETE WORKS CO", "long_name": "Asahi Concrete Works Co., Ltd.", "summary": "Asahi Concrete Works Co., Ltd. manufactures and sells cement products in Japan. The company offers box culverts, rain water reservoirs, manholes, joint grooves, disaster toilets, earthquake resistance water reservoirs, fire water tanks, and home garages. It also provides high tension concrete flumes and L-type blocks for waterways; and railway products, including water collection flumes, truck load box culverts, and ultra-high strength fiber reinforced concrete products. In addition, the company offers road products, such as L-shaped retaining walls for roads, FC slabs, Tail Alme and Tikpun products, and precast guard fences; counter bases; and other products comprising centrifugal reinforced concrete pipes, prefabricated small scale processing facilities, and precast river septic tanks. Asahi Concrete Works Co., Ltd. was founded in 1923 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "5271.T": {"short_name": "TOYO ASANO FOUNDATION", "long_name": "Toyo Asano Foundation Co., Ltd.", "summary": "Toyo Asano Foundation Co., Ltd. manufactures and sells concrete piles for construction industries in Japan. Its products include prestressed and pre-manufactured piles. The also company engages in the rental of real estate business. Toyo Asano Foundation Co., Ltd. was founded in 1951 and is headquartered in Numazu, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Numazu"}, "5273.T": {"short_name": "MITANI SEKISAN CO", "long_name": "Mitani Sekisan Co., Ltd.", "summary": "Mitani Sekisan Co., Ltd. produces and sells concrete products in Japan. The company offers prestressed concrete, PRC, and SC piles, as well as triple plate joints; construction management equipment; coupling pile and F.T. pile construction products; prestressed concrete poles, high, and thin diameter poles; and shake and surf blocks, surf flats and steps, surf flats L types, and tine block S types. It also provides gravel and stones for civil engineering construction, railway tracking and pavement roadbed materials, raw concrete, various concrete secondary products, aggregate of asphalt composite material, and construction materials; solar/pile systems; and VS lateral grooves, L type retaining walls, block holding walls, box culverts, flumes, and H-form PC piles, as well as rents office buildings. In addition, the company engages in the hotel, environmental hygiene, and information related businesses. Mitani Sekisan Co., Ltd. was founded in 1946 and is headquartered in Fukui, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Fukui"}, "5277.T": {"short_name": "SPANCRETE CORP", "long_name": "Spancrete Corporation", "summary": "Spancrete Corporation manufactures and sells precast concrete boards. It offers spanklite, a construction and civil engineering material, which is used in the building industry as a material for building floors, walls, and roofs. The company was founded in 1963 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "5285.T": {"short_name": "YAMAX CORP", "long_name": "Yamax Corp.", "summary": "Yamax Corp. manufactures and sells concrete and cement products for the construction and civil engineering projects in Japan. The company offers various concrete secondary products for a range of fields, including roads, agriculture, rivers, and sewerage. Yamax Corp. was founded in 1963 and is based in Kumamoto, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kumamoto"}, "5287.T": {"short_name": "ITO YOGYO CO LTD", "long_name": "Ito Yogyo Co., Ltd", "summary": "Ito Yogyo Co., Ltd manufactures and sells semi-dry cast concrete products in Japan and internationally. It also imports and sells products that are used in sewer engineering, landscape maintenance, and storm water treatment; and sells and installs products for building equipment. The company was founded in 1950 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "5332.T": {"short_name": "TOTO LTD", "long_name": "Toto Ltd.", "summary": "Toto Ltd. manufactures and sells bathroom and kitchen plumbing products worldwide. It offers sanitary ware, such as toilet basins, urinals, sinks, washbasins, etc.; system toilets; toilet seats; plumbing accessories, etc.; bathtubs; unit bathrooms; and fittings consisting of various faucets, drain fittings, etc. The company also provides modular kitchens; bathroom vanity units; marbright artificial marble counters; bathroom ventilation, heating, and drying systems; and welfare equipment, etc. In addition, it offers green building materials, such as tiles, ceramic slabs, etc.; and ceramics consisting of air bearings, electrostatic chucks, bonding capillaries, and receptacles for the semiconductor, FPD manufacturing, and optical communication industries, as well as optical components. The company was formerly known as TOTO Kiki Ltd. and changed its name to Toto Ltd. in 2007. Toto Ltd. was founded in 1917 and is headquartered in Kitakyushu, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kitakyushu"}, "5337.T": {"short_name": "DANTO HOLDINGS CORPORATION", "long_name": "Danto Holdings Corporation", "summary": "Danto Holdings Corporation manufactures and sells tiles in Japan. The company offers architectural/interior design and product planning services and residential mortgages services, as well as operates as a licensed investment management company. It is also involved in the residential development business. The company was formerly known as Danto Company and changed its name to Danto Holdings Corporation in 2006. Danto Holdings Corporation was founded in 1885 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "5351.T": {"short_name": "SHINAGAWA REFRACTORIES CO", "long_name": "Shinagawa Refractories Co., Ltd.", "summary": "Shinagawa Refractories Co., Ltd. manufactures and sells refractory products in Japan. It offers shaped refractory bricks, including basic, carbon-containing, fire clay and high alumina, silicon carbide, and silica bricks; monolithic refractories comprising castable and gunning refractories, precast shapes, plastic and ramming mixes, and refractory mortars; and functional products, such as slide gate plate bricks, submerged entry nozzles, monoblock stoppers, ladle shrouds, and Eddy current level meters, as well as mold powder for continuous casting. The company also provides ceramic fiber in various forms consisting of modules, preformed shapes, refractory insulating boards, sheets, and gaskets; and fine ceramics, including high precision large-sized ceramic parts, as well as alumina, zirconia, silicon carbide, a-Sialon, and porous ceramics for use in liquid crystal and semiconductor manufacturing equipment. In addition, it offers multifunctional absorbent and desiccants, and inorganic heat-resistant paints and adhesives; and related products. Further, the company designs, installs, and maintains various industrial furnaces and kilns. Its products are used in the steel, cement, glass, chemistry, and waste disposal industries. The company exports its engineering and refractory products to approximately 50 countries. Shinagawa Refractories Co., Ltd. was founded in 1875 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "5358.T": {"short_name": "ISOLITE INSULATING PRODUCTS CO", "long_name": "Isolite Insulating Products Co., Ltd.", "summary": "Isolite Insulating Products Co., Ltd. manufactures and sells insulation materials in Japan, China, Taiwan, and Malaysia. It offers alkaline earth silicate and polycrystalline wool products, refractory ceramic fibers, insulation firebricks, fire protection products, and environment and greening products, as well as heatproof filters, setters, and machinable ceramics; and engineering services, including consultation, insulation materials selection, designing, installation, inspection, and repair works. The company also provides blanket, board, and module lining for ovens; blanket, boards, felt, etc. for backup for ovens; fillers for various gaps that occur after firing refractory layers; vacuum formed shapes in various forms, such as flat plates, sleeves, cones, etc.; seal and packing products; dust filters; machinable ceramics; and diatomaceous earth and soil conditioners. Its products are used in various high temperature insulation applications in the steel, nonferrous metals, glass, petrochemical, ceramics, and various other industries, as well as for energy conservation in the thermal industry. The company was founded in 1927 and is headquartered in Osaka, Japan. Isolite Insulating Products Co., Ltd. is a subsidiary of Shinagawa Refractories Co., Ltd.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "5380.T": {"short_name": "SHINTO COMPANY(JP)", "long_name": "Shinto Company Limited", "summary": "Shinto Company Limited manufactures and sells Japanese and Western-style roofing tiles in Japan. The company also develops and exports various roofing materials, such as system, disaster resistant, and high reflective tiles, as well as solar power systems. Shinto Company Limited was founded in 1963 and is headquartered in Takahama, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Takahama"}, "5386.T": {"short_name": "TSURUYA CO LTD", "long_name": "Tsuruya Co., Ltd.", "summary": "Tsuruya Co., Ltd. manufactures and sells ceramic roofing tiles for residential roofs in Japan. It is also involved in the contract and construction of roofing works; and sale of roofing materials. The company was founded in 1887 and is based in Handa, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Handa"}, "5612.T": {"short_name": "NIPPON CHUTETSUKAN KK", "long_name": "Nippon Chutetsukan K.K.", "summary": "Nippon Chutetsukan K.K. manufactures and sells ductile iron pipes and lids, polyethylene gas pipes, and valves primarily in Japan. It provides ductile iron pipes for applications in clean water, sewage, gas, industrial water, agricultural water, etc.; ductile cast iron deformed tubes; ductile iron covers for applications in water supply and sewage, gas, electricity, communication, etc.; polyethylene pipes for gas; valves and stoppers; accessories, such as push rings, rubber ring, and bolts and nuts; cast iron products; and water supply and on-site pipe laying works. Nippon Chutetsukan K.K. was founded in 1937 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "5900.T": {"short_name": "DAIKEN CO LTD", "long_name": "Daiken Co., Ltd.", "summary": "Daiken Co.,Ltd. manufactures and supplies various metal products primarily in Japan. It offers building materials, including external trim products, such as waterproof border materials, blindfolding and lattice panels, external louvers, eaves, external panels, and advertising curtain equipment; builders hardware comprising mail boxes for condominiums, secure delivery boxes, and boxes for fire extinguishers; and door hangers, such as sliding door closers, interior door hangers, and other door hangers, as well as rollers for heavy doors. The company's building materials also comprise indoor trim and ditch products that include ceiling, wall, and floor hatches; ventilation hatches for gymnasiums; floor ditch covers for wiring, pipe laying, and drain applications; grating covers for gutters; scenic grating covers; metal mats for entrance; ceiling louvers; and rail and hanging tools for paintings. In addition, it provides exterior metal products consisting of environmental products and house related products, including bicycle parking area roofs and stands, garages, outdoor storages, accordion type gates, garbage collection boxes, kerosene tanks, and propane gas bottle sheds. Further, the company offers living related products, such as curtain rails, combination padlocks, handle sets, and key boxes. It also exports products related to houses and buildings. The company was founded in 1924 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "5928.T": {"short_name": "ALMETAX MANUFACTURING CO", "long_name": "Almetax Manufacturing Co., Ltd.", "summary": "Almetax Manufacturing Co., Ltd. develops, manufactures, and sells building materials, electrical materials, and civil engineering products in Japan. The company offers design windows and functional windows for luxury houses. It also provides heat-shielding stratification and heat-breaking stratification products. The company was founded in 1969 and is based in Osaka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "5929.T": {"short_name": "SANWA HOLDINGS CORP", "long_name": "Sanwa Holdings Corporation", "summary": "Sanwa Holdings Corporation, through its subsidiaries, manufactures and sells steel construction materials for commercial and residential construction in Japan, North America, Europe, and Asia. The company offers door openers; automatic, industrial sectional, garage, steel, condominium, and light weight sliding doors; partitions and toilet booths; waterproofing products; rolling, high-speed sheet, lightweight, heavy duty, and window shutters; aluminum and stainless steel facades; curtain walls; and mail and delivery boxes. It also provides shutter-related products, store front products, window products, residential door products, exterior products, and residential garage door products; and openers for garage doors and other doors, as well as engages in the maintenance and service business. Sanwa Holdings Corporation was founded in 1956 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "5930.T": {"short_name": "BUNKA SHUTTER CO", "long_name": "Bunka Shutter Co., Ltd.", "summary": "Bunka Shutter Co., Ltd. manufactures and sells various shutters and construction materials in Japan. It operates through Shutter-Related Business, Construction Related Materials Business, Service Business, and Refurbishments Business segments. The company offers electric wide-grill shutters, transparent panel shutters, horizontal panel shutters, fire shutters, smoke shutters, movable partitions, shop awnings, stainless steel joinery, water barriers, water barrier doors, and steel doors with opening assistance. It also provides sheet shutters, PVC curtains, over sliding doors, insulating over sliding doors, dock shelters, steel hanger doors, aluminum stud movable partitions, steel partitions, and sound insulation doors; and wide aluminum shutters, flat garage shutters, residential over sliding doors, high speed/low vibration grill shutters, residential window shutters, home awnings, recycled wood/plastic composite materials, lightweight steel entrance doors, hollow stainless steel frame for glass front, and outdoor steel stairway/corridor units. In addition, the company offers lightweight steel freely-opening folding doors, sliding doors with automatic closing device, entrance sliding doors for elderly residential housing, wooden sliding doors, steel doors, steel doors with opening assistance, fire-prevention apparatus with heat resistant glass, hollow stainless steel frame for glass fronts, movable partition, toilet booths, child toilet booths, and recycled wood/plastic composite materials. Further, it provides maintenance and repair services for the shutters and building materials; service for alteration and/or extension of a house; and replacement and repair services for household equipment. The company was formerly known as Japan Bunka Shutter Co., Ltd. and changed its name to Bunka Shutter Co., Ltd. in April 1970. Bunka Shutter Co., Ltd. was founded in 1955 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "5932.T": {"short_name": "SANKYO TATEYAMA INC", "long_name": "Sankyo Tateyama, Inc.", "summary": "Sankyo Tateyama, Inc. develops, manufactures, and sells building, housing, and exterior construction materials in Japan. It also manufactures and sells fabricated products made of rolled aluminum and other metals. In addition, the company engages in the casting, extrusion, fabrication, and sale of aluminum and magnesium; sale of commercial and general-purpose display fixtures; manufacture and sale of standard signs and other signage products; and maintenance of stores related equipment. Sankyo Tateyama, Inc. was founded in 1960 and is headquartered in Takaoka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Takaoka"}, "5935.T": {"short_name": "GANTAN BEAUTY INDUSTRY CO", "long_name": "Gantan Beauty Industry Co., Ltd.", "summary": "Gantan Beauty Industry Co., Ltd. designs, manufactures, and sells various metal roofing products in Japan and internationally. The company offers horizontal and vertical metallic, panel, and folded sheet roofing products; construction materials; and ecology roofing products comprising solar panels, top light, and green and architectural roofs. Its metal roof products are used in public facilities, factories, shops, general residences, and others. Gantan Beauty Industry Co., Ltd. was founded in 1965 and is headquartered in Fujisawa, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Fujisawa"}, "5936.T": {"short_name": "TOYO SHUTTER CO", "long_name": "Toyo Shutter Co., Ltd.", "summary": "Toyo Shutter Co., Ltd. manufactures, installs, and sells various building materials in Japan. It provides heavy, lightweight, aluminum, high speed sheet, and high speed shutters; over, hanger, steel, entrance, and special doors; disaster prevention, compact type, bill fine, and other products; hardware; shutter blinds; lever handles; and building exterior repair systems. The company was founded in 1955 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "5938.T": {"short_name": "LIXIL CORPORATION", "long_name": "LIXIL Corporation", "summary": "LIXIL Corporation, through its subsidiaries, operates in the housing and building industry worldwide. It operates through LIXIL Water Technology (LWT), LIXIL Housing Technology (LHT), LIXIL Building Technology (LBT), Distribution & Retail Business (D&R), and Housing & Services Business (H&S) segments. The LWT segment offers sanitary ware, shower toilets, water faucets, washstands, bathtubs, prefabricated bathrooms, showerheads, washstand fixtures, washstand cabinet units, kitchen systems, etc.; and tiles for houses and buildings, and internal decorative tiles, etc. The LHT segment provides housing window sashes, entrance doors, various types of shutters, gates, carports, banisters, high railings, tide barriers, smoke insulated screens, etc.; window frames, wooden furnishing materials, interior decorative materials, etc.; sidings, stone materials, roofing materials, etc.; curtains; and solar power systems, etc. The LBT segment offers curtain walls, building sashes, store facades, etc. The D&R segment operates home centers that provide household products, DIY products, building materials, etc.; and building material stores that offer building materials, tools, hardware, etc. The H&S segment develops homebuilding franchise chains; offers construction on order, ground inspections and improvements, etc.; provides services for land, buildings, real estate management, real estate franchises development support, etc.; and offers housing loans. The company was formerly known as LIXIL Group Corporation and changed its name to LIXIL Corporation in December 2020. LIXIL Corporation was founded in 1923 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "5940.T": {"short_name": "FUJISASH CO LTD", "long_name": "Fujisash Co.,Ltd.", "summary": "Fujisash Co.,Ltd. manufactures and sells sash and curtain walls in Japan and internationally. It offers sashes and curtain walls for buildings; building renewal services to various apartments and office buildings; frontage products, such as entrances of apartments and offices, as well as aperture facades of shops and showrooms; housing construction materials, including eco shutters and eco grilles; multipurpose prefabricated house modules, storages for disaster mitigation, and housing equipment; and LED modules. The company also provides urban waste processing systems to manufacturer and sales agents; fly ash treatment plants for urban waste incineration; and plant engineering of recycling and large-sized waste disposal facilities, as well as produces building materials, semiconductor manufacturing equipment, automotive products, home appliances, office equipment, and commodities as a supplier of light metals of aluminum. In addition, it is involved in the research and development of extrusion processing technology for lightweight magnesium alloys among industrial metals. Fujisash Co.,Ltd. was founded in 1930 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "5943.T": {"short_name": "NORITZ CORP", "long_name": "Noritz Corporation", "summary": "Noritz Corporation develops, manufactures, and sells various water heaters worldwide. The company offers water heaters, hydronic heating systems, gas fan heaters, and gas co-generation systems; water tank units for use with fuel cells; solar water heaters; photovoltaic power generation systems for industry use; built-in bath and kitchen systems, and wash basins; and built-in gas cookers and gas table cookers. Noritz Corporation was founded in 1951 and is headquartered in Kobe, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kobe"}, "5958.T": {"short_name": "SANYO INDUSTRIES", "long_name": "Sanyo Industries, Ltd.", "summary": "Sanyo Industries, Ltd. manufactures and sells metallic building materials in Japan. The company engages in the manufacture, sale, and contract work of metallic building materials, and internal and external materials; design and manufacture of air-conditioning and ventilation systems, and associated equipment; sale and contract work of solar energy equipment; and export and import of other related products and materials. It also offers aluminum products, including handrails, copings, louvers, and spandrels; system floors, such as multipurpose, magic, deck, and condominium floors; forced and natural ventilation products; and metal flame, natural lighting, system ceiling, filler, and wire and metal products. The company was incorporated in 1947 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "5997.T": {"short_name": "KYORITSU AIR TECH INC", "long_name": "Kyoritsu Air Tech Inc.", "summary": "Kyoritsu Air Tech Inc. manufactures and sells air-conditioning and disaster prevention equipment for buildings in Japan. It offers air conditioning disaster prevention/damper products; outlets/inlets; wind volume units; air conditioning unit systems; and low carbon eco-materials, as well as housing equipment and high food products. The company was founded in 1961 and is headquartered in Kasuya, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kasuya"}, "6230.T": {"short_name": "SANEI LTD", "long_name": "Sanei Ltd.", "summary": "Sanei Ltd. produces and sells faucets, and shower and accessory products for buildings in Japan. The company offers water faucet metal fittings, single water faucets, hot/cold water mixer faucets, shower sets, shuts-off valves, connectors, plumbing parts, sanitary parts, ball cocks, drain fixtures, bathroom accessories, sprinklers, metal gas fittings, etc. Its faucets are used in public facilities, such as hotels and inns. The company was founded in 1954 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "6367.T": {"short_name": "DAIKIN INDUSTRIES", "long_name": "Daikin Industries,Ltd.", "summary": "Daikin Industries, Ltd. manufactures, distributes, and sells air-conditioning and refrigeration equipment, and chemical products. The company's air-conditioning and refrigeration equipment products include room air-conditioning systems; air purifiers; heat-pump hot-water supply and room-heating systems; packaged air-conditioning systems; multiple air-conditioning systems for office buildings; air-conditioning systems for facilities and plants; absorption refrigerators; freezers; water chillers; turbo refrigerator equipment; air-handling units; air filters; industrial dust collectors; marine-type container refrigeration; and refrigerating and freezing showcases. The company's chemical products comprise fluorocarbons, fluoroplastics, fluoroelastomers, fluoropaints, fluoro coating agents, semiconductor-etching products, water and oil repellent agents, pharmaceuticals and intermediates, and dry air suppliers. It also provides oil hydraulics products, including oil hydraulic pumps and valves, cooling equipment and systems, inverter controlled pump motors, hydrostatic transmissions, and centralized lubrication units and systems; and defense products consisting of warheads, warhead parts for guided missiles, and home-use oxygen therapy equipment. In addition, the company offers after sales services. It sells its products in Japan, the United States, China, Asia and Oceania, Europe, and internationally. Daikin Industries, Ltd. was founded in 1924 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "6458.T": {"short_name": "SINKO INDUSTRIES LTD", "long_name": "Sinko Industries Ltd.", "summary": "Sinko Industries Ltd. manufactures, sells, and installs air conditioning equipment for various buildings worldwide. Its products include air conditioning systems, heat pump-type air conditioning systems, desiccant dehumidifiers, fan coil units, heater units, air terminal units, air purifiers, and room cleaner equipment, as well as natural refrigerant circulation systems. The company was founded in 1950 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "6485.T": {"short_name": "MAEZAWA KYUSO INDUSTRIES CO", "long_name": "Maezawa Kyuso Industries Co.,Ltd.", "summary": "Maezawa Kyuso Industries Co.,Ltd. designs, manufactures, and sells water supply equipment in Japan. It offers corporation stops with saddle, pipe fittings, ball-type water stop valves, water meters, meter sets, crosslinked polyethylene pipes, indoor plumbing units, joint clears, pair tube for reheating devices, and stainless steel fittings. The company was founded in 1937 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7434.T": {"short_name": "OTAKE CORP", "long_name": "Otake Corporation", "summary": "Otake Corporation engages in sale of tube machinery, housing equipment, and air conditioning equipment. It offers chemical industrial plant equipment, residential equipment, and general building equipment products, which include valves, fittings and piping, etc. The company was formerly known as Otake Shoten Co., Ltd. and changed its name to Otake Corporation in 1988. Otake Corporation was founded in 1946 and is headquartered in Nagoya, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Nagoya"}, "7463.T": {"short_name": "ADVAN CO LTD", "long_name": "Advan Co., Ltd.", "summary": "Advan Co., Ltd. manufactures, imports, and sells building materials in Japan. It provides building materials, such as tiles, kitchen products, floorings, around the water products, garage doors, stones and natural stones, washbasins, faucets, vinyl floor tiles, bricks, and wood-burning stoves. The company was founded in 1975 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7539.T": {"short_name": "AINAVO HOLDINGS CO LTD", "long_name": "AINAVO HOLDINGS Co.,Ltd.", "summary": "AINAVO HOLDINGS Co.,Ltd., through its subsidiaries, engages in the housing, sanitary, and air conditioning businesses in Japan. The company engages in designing and wholesale of tiles and imported stones for housing building, as well as is involved in the construction contract activities. It is also involved in project outline construction/drawing of equipment, data entry, and office work, as well as designing and constructing drainage, sanitation, firefighting, and electrical equipment. The company was formerly known as Avelco Co., Ltd. and changed its name to AINAVO HOLDINGS Co.,Ltd. in October 2013. AINAVO HOLDINGS Co.,Ltd. was founded in 1924 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7570.T": {"short_name": "HASHIMOTO SOGYO HOLDINGS CO LTD", "long_name": "Hashimoto Sogyo Holdings Co.,Ltd.", "summary": "Hashimoto Sogyo Holdings Co.,Ltd. sells pipe construction and housing equipment in Japan. It also provides information processing, money lending, guarantee, leasing, and non-life insurance agency services. The company was formerly known as Hashimoto Sogyo Co., Ltd. and changed its name to Hashimoto Sogyo Holdings Co.,Ltd. in April 2016. Hashimoto Sogyo Holdings Co.,Ltd. was incorporated in 1938 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7635.T": {"short_name": "SUGITA ACE CO LTD", "long_name": "Sugita Ace Co.,Ltd.", "summary": "Sugita Ace Co.,Ltd. sells and distributes construction hardware and materials to hardware dealers, building material trading companies, and metal construction companies in Japan. It also sells DIY products to home improvement stores, mail-order companies, etc.; and operates general stores under the PATIO PETITE and IZAMESHI brands, as well as imports and sells gardening items. The company was founded in 1948 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7820.T": {"short_name": "NIHON FLUSH CO LTD", "long_name": "Nihon Flush Co., Ltd.", "summary": "Nihon Flush Co., Ltd. manufactures and sells interior products in Japan. It offers various indoor and flash doors, storage systems, and construction materials. The company was founded in 1964 and is headquartered in Komatsushima, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Komatsushima"}, "7871.T": {"short_name": "FUKUVI CHEMICAL INDUSTRY CO", "long_name": "Fukuvi Chemical Industry Co.,Ltd.", "summary": "Fukuvi Chemical Industry Co.,Ltd. manufactures and sells plastic extrusion of construction and industrial products under the Fukuvi and Victory Bear brands in Japan and internationally. The company also provides skirting boards, wood plastic composite products, multi-layer flooring products, inspection opening frames, plastic transitions, and rustication strips, as well as corner beads for wall, ceilings, and mortars. In addition, it produces extruded plastic profiles; and serves as original equipment manufacturer for the lighting bars, window frames, cooler ducts for vehicles, handles for furniture, refrigerated display cases, modesty panels, and other applications. The company was formerly known as Fukui Vinyl Industries Co., Ltd. and changed its name to Fukuvi Chemical Industry Co.,Ltd. in January 1970. Fukuvi Chemical Industry Co.,Ltd. was incorporated in 1947 and is headquartered in Fukui, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Fukui"}, "7879.T": {"short_name": "NODA CORP", "long_name": "Noda Corporation", "summary": "Noda Corporation manufactures, processes, imports, and sells woody and inorganic building material, medium-density fiberboard, and plywood products worldwide. The company offers building interior materials, including flooring, inner wall, fixture, staircase member, and framework products; exterior substrate materials for mortar use; and home furnishings and fixtures, such as interior and sliding doors, closets, opening frame members, front hall storage racks, home storage units, and other products, as well as handrail members. It also provides laminated wood; and imports and sells ordinary, concrete forming, structural, and painted plywood, as well as coniferous plywood, south-sea lumber plywood, and other products. The company was formerly known as NODA PLYWOOD Mfg. Co., Ltd. and changed its name to Noda Corporation in 1989. Noda Corporation was founded in 1902 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7905.T": {"short_name": "DAIKEN CORP", "long_name": "Daiken Corporation", "summary": "Daiken Corporation manufactures and sells industrial and building materials in Japan and internationally. The company offers functional industrial materials, such as insulation boards for inner part of a tatami mat; protection boards; MDF materials for flooring; base materials for building and furniture; tatami mats for houses and accommodation; ceiling materials for houses and offices; wall base materials for house external walls; non-combustible wall materials; and I-joist, and structural materials. It also provides building materials, including flooring, doors, cabinets, and sound products for housing, public spaces, and commercial facilities. In addition, the company engages in the interior construction for public spaces and commercial facilities, including schools, event venues, office buildings, and apartment buildings. Daiken Corporation was founded in 1945 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "7949.T": {"short_name": "KOMATSU WALL INDUSTRY CO", "long_name": "Komatsu Wall Industry Co., Ltd.", "summary": "Komatsu Wall Industry Co., Ltd. engages in the design, manufacture, construction, sale, and service of steel and aluminum movable partitions, and walls in Japan. Its products include moving partitions, movable partitions, school partitions, steel lightweight doors, interior metal works, low partitions, and toilet booths. The company was founded in 1968 and is headquartered in Komatsu, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Komatsu"}, "7953.T": {"short_name": "KIKUSUI CHEMICAL INDUSTRIES CO", "long_name": "Kikusui Chemical Industries Co., Ltd.", "summary": "Kikusui Chemical Industries Co., Ltd. manufactures and sells functional, building finishing, construction, and civil engineering materials in Japan. It offers building interior and exterior finish coating materials, and sheet-like natural crushed stone decorative materials; paints for detached houses; premix mortars; and industrial paints, as well as manufactures and sells other machinery and equipment. The company also exports its products. Kikusui Chemical Industries Co., Ltd. was founded in 1959 and is headquartered in Nagoya, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Nagoya"}, "7971.T": {"short_name": "TOLI CORP", "long_name": "TOLI Corporation", "summary": "TOLI Corporation manufactures and sells floor coverings, wallpapers, drapes, and related installation accessories in Japan and internationally. It offers carpet tiles, vinyl tiles, vinyl sheets, carpets, curtains, wall coverings, and other products, as well as interior goods. The company was formerly known as TOYO LINOLEUM and changed its name to TOLI Corporation in October 1991. TOLI Corporation was founded in 1919 and is headquartered in Itami, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Itami"}, "9767.T": {"short_name": "NIKKEN KOGAKU CO", "long_name": "Nikken Kogaku Co., Ltd.", "summary": "Nikken Kogaku Co., Ltd. develops wave dissipating blocks, coastal revetment blocks, and other civil engineering products in Japan. The company offers coastal protection blocks, riverbank disaster-prevention and environment protection blocks/natural stone products, and geo-synthetics. It serves primarily ministry of land, infrastructure, transport, and tourism; and local governments, construction companies, and construction consultants. Nikken Kogaku Co., Ltd. was founded in 1964 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9872.T": {"short_name": "KITAKEI CO LTD", "long_name": "Kitakei Co., Ltd.", "summary": "Kitakei Co., Ltd. engages in the sale of construction works for housing materials and facility equipment in Japan. The company provides interior products, including floor, wall, roofing, frame, and building materials; interior doors; stairs, hand railings, and counters; entryway, wall, and closet boxes and storage products; tiles, bricks, and rock/stone materials; and Japanese style housing materials. It also offers fixtures and fittings, such as kitchen, bath, sink bowl, sink vanity, and toilet products; hot water heaters, electrical water heaters, and water purifiers; cooking stoves and induction heating cookers; ventilation fans, heaters and dehumidifiers, air conditioning products, stoves/heaters, floor heating products, and thermal storage heating systems; locks, door phone, and security equipment; lights and health-related equipment; and PV systems. In addition, the company provides function materials and hardware comprising insulation, humidity control, waterproof/soundproof, and hygienic materials; chalk board, urethane foam, and cellulose fibers; nails, screws, construction hardware, and aseimatic reinforcing materials; and glue, paints, wood preservatives and pesticides, and anti-fungal and anti-rust agents. Further, it offers exterior materials consisting of guttering, eaves, fences, front doors, window sashes, windows, deck materials, gate pillars and doors, carports, tiles, bricks, and stone materials. Additionally, the company provides structural materials, fixtural timber, and laminated wood products; furniture and core materials; alcove materials, open work gratings, and Japanese-style room repair materials; tatami room tables, ornament shelves, and craft objects; and plywood, LVL, MDF, and particle boards. It also engages in the provision of interior, housing appliance, exterior, and fitting construction works. The company was founded in 1959 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "DKI.F": {"short_name": "DAIKIN IND. LTD", "long_name": "Daikin Industries,Ltd.", "summary": "Daikin Industries, Ltd. manufactures, distributes, and sells air-conditioning and refrigeration equipment, and chemical products. The company's air-conditioning and refrigeration equipment products include room air-conditioning systems; air purifiers; heat-pump hot-water supply and room-heating systems; packaged air-conditioning systems; multiple air-conditioning systems for office buildings; air-conditioning systems for facilities and plants; absorption refrigerators; freezers; water chillers; turbo refrigerator equipment; air-handling units; air filters; industrial dust collectors; marine-type container refrigeration; and refrigerating and freezing showcases. The company's chemical products comprise fluorocarbons, fluoroplastics, fluoroelastomers, fluoropaints, fluoro coating agents, semiconductor-etching products, water and oil repellent agents, pharmaceuticals and intermediates, and dry air suppliers. It also provides oil hydraulics products, including oil hydraulic pumps and valves, cooling equipment and systems, inverter controlled pump motors, hydrostatic transmissions, and centralized lubrication units and systems; and defense products consisting of warheads, warhead parts for guided missiles, and home-use oxygen therapy equipment. In addition, the company offers after sales services. It sells its products in Japan, the United States, China, Asia and Oceania, Europe, and internationally. Daikin Industries, Ltd. was founded in 1924 and is headquartered in Osaka, Japan.", "currency": "EUR", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Osaka"}, "DKIA.F": {"short_name": "DAIKIN INDUSTR.UNSP.ADR", "long_name": "Daikin Industries,Ltd.", "summary": "Daikin Industries, Ltd. manufactures, distributes, and sells air-conditioning and refrigeration equipment, and chemical products. The company's air-conditioning and refrigeration equipment products include room air-conditioning systems; air purifiers; heat-pump hot-water supply and room-heating systems; packaged air-conditioning systems; multiple air-conditioning systems for office buildings; air-conditioning systems for facilities and plants; absorption refrigerators; freezers; water chillers; turbo refrigerator equipment; air-handling units; air filters; industrial dust collectors; marine-type container refrigeration; and refrigerating and freezing showcases. The company's chemical products comprise fluorocarbons, fluoroplastics, fluoroelastomers, fluoropaints, fluoro coating agents, semiconductor-etching products, water and oil repellent agents, pharmaceuticals and intermediates, and dry air suppliers. It also provides oil hydraulics products, including oil hydraulic pumps and valves, cooling equipment and systems, inverter controlled pump motors, hydrostatic transmissions, and centralized lubrication units and systems; and defense products consisting of warheads, warhead parts for guided missiles, and home-use oxygen therapy equipment. In addition, the company offers after sales services. It sells its products in Japan, the United States, China, Asia and Oceania, Europe, and internationally. Daikin Industries, Ltd. was founded in 1924 and is headquartered in Osaka, Japan.", "currency": "EUR", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Osaka"}, "DKILF": {"short_name": "DAIKIN INDUSTRIES", "long_name": "Daikin Industries,Ltd.", "summary": "Daikin Industries, Ltd. manufactures, distributes, and sells air-conditioning and refrigeration equipment, and chemical products. The company's air-conditioning and refrigeration equipment products include room air-conditioning systems; air purifiers; heat-pump hot-water supply and room-heating systems; packaged air-conditioning systems; multiple air-conditioning systems for office buildings; air-conditioning systems for facilities and plants; absorption refrigerators; freezers; water chillers; turbo refrigerator equipment; air-handling units; air filters; industrial dust collectors; marine-type container refrigeration; and refrigerating and freezing showcases. The company's chemical products comprise fluorocarbons, fluoroplastics, fluoroelastomers, fluoropaints, fluoro coating agents, semiconductor-etching products, water and oil repellent agents, pharmaceuticals and intermediates, and dry air suppliers. It also provides oil hydraulics products, including oil hydraulic pumps and valves, cooling equipment and systems, inverter controlled pump motors, hydrostatic transmissions, and centralized lubrication units and systems; and defense products consisting of warheads, warhead parts for guided missiles, and home-use oxygen therapy equipment. In addition, the company offers after sales services. It sells its products in Japan, the United States, China, Asia and Oceania, Europe, and internationally. Daikin Industries, Ltd. was founded in 1924 and is headquartered in Osaka, Japan.", "currency": "USD", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Osaka"}, "DKILY": {"short_name": "DAIKIN INDUSTRIES", "long_name": "Daikin Industries,Ltd.", "summary": "Daikin Industries, Ltd. manufactures, distributes, and sells air-conditioning and refrigeration equipment, and chemical products. The company's air-conditioning and refrigeration equipment products include room air-conditioning systems; air purifiers; heat-pump hot-water supply and room-heating systems; packaged air-conditioning systems; multiple air-conditioning systems for office buildings; air-conditioning systems for facilities and plants; absorption refrigerators; freezers; water chillers; turbo refrigerator equipment; air-handling units; air filters; industrial dust collectors; marine-type container refrigeration; and refrigerating and freezing showcases. The company's chemical products comprise fluorocarbons, fluoroplastics, fluoroelastomers, fluoropaints, fluoro coating agents, semiconductor-etching products, water and oil repellent agents, pharmaceuticals and intermediates, and dry air suppliers. It also provides oil hydraulics products, including oil hydraulic pumps and valves, cooling equipment and systems, inverter controlled pump motors, hydrostatic transmissions, and centralized lubrication units and systems; and defense products consisting of warheads, warhead parts for guided missiles, and home-use oxygen therapy equipment. In addition, the company offers after sales services. It sells its products in Japan, the United States, China, Asia and Oceania, Europe, and internationally. Daikin Industries, Ltd. was founded in 1924 and is headquartered in Osaka, Japan.", "currency": "USD", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Osaka"}, "JSGRY": {"short_name": "LIXIL CORPORATION", "long_name": "LIXIL Corporation", "summary": "LIXIL Corporation, through its subsidiaries, operates in the housing and building industry worldwide. It operates through LIXIL Water Technology (LWT), LIXIL Housing Technology (LHT), LIXIL Building Technology (LBT), Distribution & Retail Business (D&R), and Housing & Services Business (H&S) segments. The LWT segment offers sanitary ware, shower toilets, water faucets, washstands, bathtubs, prefabricated bathrooms, showerheads, washstand fixtures, washstand cabinet units, kitchen systems, etc.; and tiles for houses and buildings, and internal decorative tiles, etc. The LHT segment provides housing window sashes, entrance doors, various types of shutters, gates, carports, banisters, high railings, tide barriers, smoke insulated screens, etc.; window frames, wooden furnishing materials, interior decorative materials, etc.; sidings, stone materials, roofing materials, etc.; curtains; and solar power systems, etc. The LBT segment offers curtain walls, building sashes, store facades, etc. The D&R segment operates home centers that provide household products, DIY products, building materials, etc.; and building material stores that offer building materials, tools, hardware, etc. The H&S segment develops homebuilding franchise chains; offers construction on order, ground inspections and improvements, etc.; provides services for land, buildings, real estate management, real estate franchises development support, etc.; and offers housing loans. The company was formerly known as LIXIL Group Corporation and changed its name to LIXIL Corporation in December 2020. LIXIL Corporation was founded in 1923 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "NB5.F": {"short_name": "NITTO BOSEKI", "long_name": "Nitto Boseki Co., Ltd.", "summary": "Nitto Boseki Co., Ltd. engages in the manufacture, processing, and sale of textile products and textile-related industrial goods, rock wool and building materials, glass fiber products, and specialty chemicals and medical products in Japan. The company offers a range of apparel and other products, including interlinings for women's apparel, stretch fabrics, and functional textiles. It also provides glass fiber products for use in automobiles; composites for smartphone casings; high performance electronic substrates; resin-coated film materials; and house insulation materials. In addition, the company develops reagents for in vitro diagnostics in the biochemistry, hematology, and immunology fields; develops specialty chemicals, such as functional polymers for various applications; and produces and sells PET bottles and soft drinks. Further, it engages in the planning, supervision, and contracting for construction; and design, manufacture, and sale of machinery and equipment. The company was formerly known as Fukusima Seiren Seishi K.K. and changed its name to Nitto Boseki Co., Ltd. in April 1923. Nitto Boseki Co., Ltd. was founded in 1918 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "TJS.F": {"short_name": "LIXIL CORP.", "long_name": "LIXIL Corporation", "summary": "LIXIL Corporation, through its subsidiaries, operates in the housing and building industry worldwide. It operates through LIXIL Water Technology (LWT), LIXIL Housing Technology (LHT), LIXIL Building Technology (LBT), Distribution & Retail Business (D&R), and Housing & Services Business (H&S) segments. The LWT segment offers sanitary ware, shower toilets, water faucets, washstands, bathtubs, prefabricated bathrooms, showerheads, washstand fixtures, washstand cabinet units, kitchen systems, etc.; and tiles for houses and buildings, and internal decorative tiles, etc. The LHT segment provides housing window sashes, entrance doors, various types of shutters, gates, carports, banisters, high railings, tide barriers, smoke insulated screens, etc.; window frames, wooden furnishing materials, interior decorative materials, etc.; sidings, stone materials, roofing materials, etc.; curtains; and solar power systems, etc. The LBT segment offers curtain walls, building sashes, store facades, etc. The D&R segment operates home centers that provide household products, DIY products, building materials, etc.; and building material stores that offer building materials, tools, hardware, etc. The H&S segment develops homebuilding franchise chains; offers construction on order, ground inspections and improvements, etc.; provides services for land, buildings, real estate management, real estate franchises development support, etc.; and offers housing loans. The company was formerly known as LIXIL Group Corporation and changed its name to LIXIL Corporation in December 2020. LIXIL Corporation was founded in 1923 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "TO4.F": {"short_name": "TOTO LTD", "long_name": "Toto Ltd.", "summary": "Toto Ltd. manufactures and sells bathroom and kitchen plumbing products worldwide. It offers sanitary ware, such as toilet basins, urinals, sinks, washbasins, etc.; system toilets; toilet seats; plumbing accessories, etc.; bathtubs; unit bathrooms; and fittings consisting of various faucets, drain fittings, etc. The company also provides modular kitchens; bathroom vanity units; marbright artificial marble counters; bathroom ventilation, heating, and drying systems; and welfare equipment, etc. In addition, it offers green building materials, such as tiles, ceramic slabs, etc.; and ceramics consisting of air bearings, electrostatic chucks, bonding capillaries, and receptacles for the semiconductor, FPD manufacturing, and optical communication industries, as well as optical components. The company was formerly known as TOTO Kiki Ltd. and changed its name to Toto Ltd. in 2007. Toto Ltd. was founded in 1917 and is headquartered in Kitakyushu, Japan.", "currency": "EUR", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Kitakyushu"}, "TOTDF": {"short_name": "TOTO LTD", "long_name": "Toto Ltd.", "summary": "Toto Ltd. manufactures and sells bathroom and kitchen plumbing products worldwide. It offers sanitary ware, such as toilet basins, urinals, sinks, washbasins, etc.; system toilets; toilet seats; plumbing accessories, etc.; bathtubs; unit bathrooms; and fittings consisting of various faucets, drain fittings, etc. The company also provides modular kitchens; bathroom vanity units; marbright artificial marble counters; bathroom ventilation, heating, and drying systems; and welfare equipment, etc. In addition, it offers green building materials, such as tiles, ceramic slabs, etc.; and ceramics consisting of air bearings, electrostatic chucks, bonding capillaries, and receptacles for the semiconductor, FPD manufacturing, and optical communication industries, as well as optical components. The company was formerly known as TOTO Kiki Ltd. and changed its name to Toto Ltd. in 2007. Toto Ltd. was founded in 1917 and is headquartered in Kitakyushu, Japan.", "currency": "USD", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Kitakyushu"}, "TOTDY": {"short_name": "TOTO LTD", "long_name": "Toto Ltd.", "summary": "Toto Ltd. manufactures and sells bathroom and kitchen plumbing products worldwide. It offers sanitary ware, such as toilet basins, urinals, sinks, washbasins, etc.; system toilets; toilet seats; plumbing accessories, etc.; bathtubs; unit bathrooms; and fittings consisting of various faucets, drain fittings, etc. The company also provides modular kitchens; bathroom vanity units; marbright artificial marble counters; bathroom ventilation, heating, and drying systems; and welfare equipment, etc. In addition, it offers green building materials, such as tiles, ceramic slabs, etc.; and ceramics consisting of air bearings, electrostatic chucks, bonding capillaries, and receptacles for the semiconductor, FPD manufacturing, and optical communication industries, as well as optical components. The company was formerly known as TOTO Kiki Ltd. and changed its name to Toto Ltd. in 2007. Toto Ltd. was founded in 1917 and is headquartered in Kitakyushu, Japan.", "currency": "USD", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Kitakyushu"}, "XST.F": {"short_name": "SANWA HOLDINGS CORP.", "long_name": "Sanwa Holdings Corporation", "summary": "Sanwa Holdings Corporation, through its subsidiaries, manufactures and sells steel construction materials for commercial and residential construction in Japan, North America, Europe, and Asia. The company offers door openers; automatic, industrial sectional, garage, steel, condominium, and light weight sliding doors; partitions and toilet booths; waterproofing products; rolling, high-speed sheet, lightweight, heavy duty, and window shutters; aluminum and stainless steel facades; curtain walls; and mail and delivery boxes. It also provides shutter-related products, store front products, window products, residential door products, exterior products, and residential garage door products; and openers for garage doors and other doors, as well as engages in the maintenance and service business. Sanwa Holdings Corporation was founded in 1956 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Industrials", "industry": "Building Products & Equipment", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}}