{"3035.T": {"short_name": "KTK INC", "long_name": "ktk Inc.", "summary": "ktk INC. provides recycled products, expendable items, and stationery office supplies for use in office automation equipment in Japan. It offers repack toners, ribbons, repack gels, cartridges, etc.; and office furniture and equipment. The company is also involved in the sale and maintenance of MFPs, and network security operations; and logistic and warehouse business. It sells its products primarily through the Internet and mail order catalogs. The company was founded in 1971 and is headquartered in Nagoya, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Nagoya"}, "4901.T": {"short_name": "FUJIFILM HOLDINGS CORPORATION", "long_name": "FUJIFILM Holdings Corporation", "summary": "FUJIFILM Holdings Corporation develops, manufactures, sells, and services imaging, healthcare and material, and document solutions worldwide. Its Imaging Solutions segment offers color films, instant cameras, developing and printing systems, color papers, and photo printing services; and TV and cinema lenses, surveillance cameras, industrial lenses for production line inspection, and projectors. The company's Healthcare & Material Solutions segment provides products and services, such as medical devices, biomedical contract development and manufacturing organization, pharmaceutical, regenerative medicine, and cosmetics and supplements in the three areas of prevention, diagnosis, and treatment. This segment offers inkjet digital presses and printing plates for printing industries, as well as industrial inkjet-related products and inkjet heads; storage media and archiving services to save and manage digital data volumes; and materials for industrials, including display and touch panel, semiconductor and image sensor, and functional film materials. Its Document Solutions provides devices and services used in offices, including digital multifunction devices, printers, software, and cloud services; workflow solutions for printing companies and others in the graphical communications sector; and document services tailored to diverse business formats and roles, including system integration, business process outsourcing, and others FUJIFILM Holdings Corporation was founded in 1934 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4902.T": {"short_name": "KONICA MINOLTA INC", "long_name": "Konica Minolta, Inc.", "summary": "Konica Minolta, Inc. engages in office, professional print, healthcare, and industrial businesses in Japan, the United States, European countries, China, other Asian countries, and internationally. The company develops, manufactures, and sells multi-functional peripherals, laser printers, filing devices, software and peripheral devices, digital color printing systems, digital monochrome printing systems, inkjet print heads, inkjet textile printers, and inkjet inks, as well as print and cloud services. It also offers healthcare systems, such as diagnostic ultrasound systems, digital X-ray diagnostic imaging systems, digital mammography systems, and medical imaging filling systems, as well as medical management ICT services. In addition, the company provides measuring instruments, including colorimeters, luminance meters, spectrophotometers, and photovoltaic reference cells; TAC films for liquid crystal displays; organic light emitting diode lighting products; lenses for industrial and professional use; and functional film displays. Further, it manages and operates planetarium facilities. Konica Minolta, Inc. was founded in 1873 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7314.T": {"short_name": "ODAWARA AUTO-MACHINE MFG CO LTD", "long_name": "Odawara Auto-Machine Mfg. Co., Ltd.", "summary": "Odawara Auto-Machine Mfg. Co., Ltd. designs, manufactures, and sells bus and railway fare collecting equipment. The company offers fare boxes, ticket machines, IC card systems, ticket issuing machines, LCD fare indicators, speech synthesis guide devices, IC card systems, data management systems, and bus location systems. It also provides fare boxes and fare indicators for railway vehicles, as well as departure signs and various indicators for stations and platforms. In addition, the company offers system development, engineering, and software design services. Odawara Auto-Machine Mfg. Co., Ltd. was founded in 1950 and is headquartered in Odawara, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Odawara"}, "7752.T": {"short_name": "RICOH CO", "long_name": "Ricoh Company, Ltd.", "summary": "Ricoh Company, Ltd. provides various office and commercial printing solutions and related solutions worldwide. It offers multifunctional printers, printers, industrial inkjet, garment and production printers, 3D printers, projectors, video and web conference systems, and interactive whiteboards. The company also provides digital, spherical, single lens reflex, action, and FA cameras; and automotive stereo cameras, automotive precision machined parts, and small and low energy mobile ICs. In addition, it produces and markets thermal paper and media for food labels, clothing tags, tickets, and handy terminal paper; manufactures and sells watches; and provides magnetoencephaiograph used in brain activity measurement. Further, the company provides managed print, application/ business process, communication, intelligent workplace, and IT services; and solar power facility operations and maintenance services, as well as electricity sales services. It serves manufacturing, retail, healthcare, real estate, travel and tourism, and engineering and construction sectors. The company was formerly known as Riken Optical Co., Ltd. and changed its name to Ricoh Company, Ltd. in 1963. Ricoh Company, Ltd. was founded in 1936 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7846.T": {"short_name": "PILOT CORP(NEW).PORSCHE INN.LEA", "long_name": "Pilot Corporation", "summary": "Pilot Corporation manufactures, purchases, and sells writing instruments, and other stationery products and toys in Japan, the Americas, Europe, and Asia. The company provides writing instruments, including ballpoint pens, mechanical pencils, ink markers, and fountain pens; stationery products, such as magnetic boards; office equipment; and toner cartridge recycling services. It also offers wedding rings and other precious metal accessories, as well as engages in the ceramic business. The company was founded in 1918 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7957.T": {"short_name": "FUJICOPIAN CO LTD", "long_name": "Fujicopian Co., Ltd.", "summary": "Fujicopian Co., Ltd. manufactures and sells consumable supplies for information and data processing applications in Japan and internationally. The company's products include FIXFILM; and thermal transfer media products, such as thermal color and monochrome ribbons that are used in home fax machines, barcode printers, and various types of ticket dispensing machines. It also provides stationary products comprising correction and glue tapes; fabric ribbons for use in printers and typewriters; correctable film ribbons; and multi-strike film ribbons, as well as analysis and measurement services. The company was founded in 1950 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "7975.T": {"short_name": "LIHIT LAB INC", "long_name": "Lihit Lab., Inc.", "summary": "Lihit Lab., Inc. manufactures and sells office supplies in Japan and internationally. Its products include clear holders, ring files, punch less files, and pipe files; ring binders, clear books, etc.; bags, clear cases, clipboards, card holders, desk trays, and desk supplies; and other office equipment, such as auto punches, paper drills, multi-hole punch for bookbinding, and medical supplies. The company is also involved in the real estate rental business. Lihit Lab., Inc. was founded in 1938 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "7976.T": {"short_name": "MITSUBISHI PENCIL CO", "long_name": "Mitsubishi Pencil Co., Ltd.", "summary": "Mitsubishi Pencil Co., Ltd. manufactures and supplies writing instruments in Japan. The company's products include gel, water-based, and oil-based ballpoint pens; mechanical pens; pencils and colored pencils; felt-tip pens; school and desk supplies; and eco products. Mitsubishi Pencil Co., Ltd. was founded in 1887 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7984.T": {"short_name": "KOKUYO CO LTD", "long_name": "Kokuyo Co., Ltd.", "summary": "Kokuyo Co., Ltd. manufactures, purchases, and sells stationery and office furniture products in Japan. The company provides various office paper products, and stationery and PC-related products, as well as information management and meeting management systems; and develops and produces a range of picture story books, and educational toys and goods. It also offers office furniture and furniture for public spaces, as well as configures space for office, government offices and public facilities, educational and medical facilities, retail stores and commercial spaces, and hotels. In addition, the company provides mail-order services for individuals, as well as various local enterprises in the Shanghai and Beijing regions. Further, it engages in the wholesale of stationery, office supplies, office equipment, office-automation equipment, school supplies, and office furniture to distribution companies; and retail of furniture, textiles, and general home furnishings under the Actus brand, as well as offers space design and consultation services. The company was founded in 1905 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "7991.T": {"short_name": "MAMIYA-OP CO LTD", "long_name": "Mamiya-OP Co., Ltd.", "summary": "Mamiya-OP Co., Ltd. manufactures and sells electronic and sports equipment in Japan and internationally. It offers pachinko machines, thin film thickness meters, ticket-vending machines, bill transport systems, bill validators, banknote transport systems, IC card readers and writers, and coin dispensing machines. The company also provides golf equipment, golf shafts, and interrupter levers. Mamiya-OP Co., Ltd. was founded in 1931 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7992.T": {"short_name": "SAILOR PEN CO", "long_name": "The Sailor Pen Co., Ltd.", "summary": "The Sailor Pen Co., Ltd. produces and sells writing instruments worldwide. Its Stationery division offers fountain pens, ballpoint pens, mechanical pencils, fude pens, marking pens, inks, correction fluids, sheets, and gift accessories. This division also operates and manages an online shop. The company's Robot Equipment division manufactures and sells standard machines, such as automatic takeout robots for plastic injection molded products; custom-made machines, including automation equipment, stock equipment, factory automation systems, and order-made equipment; and handling robots of semiconductors, metal press, etc. Its Special Machinery division manufactures and sells pachinko prize dispensers and labor-saving equipment for prize vendors; and general prizes for the amusement industry. The company was founded in 1911 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7994.T": {"short_name": "OKAMURA CORP", "long_name": "Okamura Corporation", "summary": "Okamura Corporation, together with its subsidiaries, manufactures, sells, distributes, and installs office furniture, store displays, material handling systems, and industrial machinery in Japan and internationally. The company offers office furniture products, including desks and work stations, office seating, partition screens, storage systems, filing supplies, wooden furniture, reception/meeting room furniture, and recreational areas furniture. It also provides display fixtures for foods, as well as fixtures for drug stores, home centers, bookshops and audio/video stores, electrical appliance stores, clothes shops, auto supply outlets, and sporting goods shops; and checkout-related fixtures and counters, other special-order fixtures, backyard fixtures, Fontana-Deux display refrigerators and freezers, and Visplay modular systems for commercial interiors. In addition, the company offers shelves for light, medium, and heavy-duty products; movable shelves and shelves for layered and multilayered materials; IT fixtures for logistics; facilities for use in automated warehouses/rotary rack; distribution products and equipment for plants and warehouses; articles for distribution and warehouses; various transportation systems; torque converters; power shift transmissions; transmissions and reduction gearboxes; clutches; and fluid couplings. Further, it is involved in the contracting of metal fitting installation works; design, manufacture, and sale related to the construction industry, as well as auxiliary works; construction, design, and sale of security systems; design, manufacture, and sale of medical equipment, and other machinery and equipment; and provision of information on improvement of office environments and improvement of office/production efficiency, as well as manufacture and sale of related equipment. Okamura Corporation was founded in 1945 and is headquartered in Yokohama, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Yokohama"}, "7999.T": {"short_name": "MUTOH HOLDINGS CO LTD", "long_name": "Mutoh Holdings Co., Ltd.", "summary": "Mutoh Holdings Co., Ltd. develops, manufactures, sells, maintains, and services information imaging equipment worldwide. The company offers inkjet printers/plotters, pencil/pen plotters, 3D printers, cutting plotters, and image scanners. It also provides CAD/CAM information services, including 2D and 3D CAD systems, CAD/CAM peripheral software and system integration services, and IT and 3D solutions; drafting machines and optical measuring instruments; and merchandising products. In addition, the company imports and sells sports-related products, such as taping tapes, supporters, insoles, and fitness gears; manages stores; and leases real estate properties. Mutoh Holdings Co., Ltd. was founded in 1942 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8060.T": {"short_name": "CANON MARKETING JAPAN INC", "long_name": "Canon Marketing Japan Inc.", "summary": "Canon Marketing Japan Inc. markets and sells Canon products and related solutions in Japan. It operates through Consumers, Enterprise, Area, and Professional segments. The Consumers segment provides digital cameras and inkjet printers to consumers. The Enterprise segment supplies input/output equipment and solutions to help resolve the business-specific management issues. The Area segment supplies input/output equipment and solutions to help resolve the management issues of small-to medium-sized enterprises. The Professional segment sells digital printers, wide-format printers, and point-of-purchase systems and consumables; print prepress and post-processing equipment, inspection devices, and printing-related software and maintenance services; workflow systems and print services; semiconductor fabrication and measuring equipment to semiconductor and other electronic device manufacturers; and modalities, IT systems, and solutions to medical institutions, as well as dispensing machines and IT systems to pharmacies. The company was founded in 1968 and is headquartered in Tokyo, Japan. Canon Marketing Japan Inc. is a subsidiary of Canon Inc.", "currency": "JPY", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "BRTHF": {"short_name": "BROTHER INDUSTRIES", "long_name": "Brother Industries, Ltd.", "summary": "Brother Industries, Ltd. manufactures and sells communications and printing equipment in Japan, the Americas, Europe, rest of Asia, and internationally. It operates through Printing & Solutions Business, Personal & Home Business, Machinery Business, Network & Contents Business, Domino Business, and Others segments. The Printing & Solutions Business segment offers laser and inkjet printers; all-in-one black-and-white laser and color printers; fax machines and scanners; and electronic stationary comprising labeling systems, and label and mobile printers. The Personal & Home Business segment provides home sewing and cutting machines, sewing and embroidery machines, and commercial embroidery machines. The Machinery Business segment offers industrial sewing machines, machine tools, and garment printers, as well as industrial parts, such as reducers and gears. The Network & Contents Business segment provides online karaoke systems, music boxes, applications for smartphones/tablets, health care supporting equipment, and content services, as well as manages Karaoke clubs. The Domino Business segment offers coding and marking equipment, and digital printing equipment. The Others segment engages in real estate and other activities. The company was formerly known as Nippon Sewing Machine Manufacturing Co. and changed its name to Brother Industries, Ltd. in 1962. Brother Industries, Ltd. was founded in 1908 and is headquartered in Nagoya, Japan.", "currency": "USD", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Nagoya"}, "BRTHY": {"short_name": "BROTHER INDUSTRIES", "long_name": "Brother Industries, Ltd.", "summary": "Brother Industries, Ltd. manufactures and sells communications and printing equipment in Japan, the Americas, Europe, rest of Asia, and internationally. It operates through Printing & Solutions Business, Personal & Home Business, Machinery Business, Network & Contents Business, Domino Business, and Others segments. The Printing & Solutions Business segment offers laser and inkjet printers; all-in-one black-and-white laser and color printers; fax machines and scanners; and electronic stationary comprising labeling systems, and label and mobile printers. The Personal & Home Business segment provides home sewing and cutting machines, sewing and embroidery machines, and commercial embroidery machines. The Machinery Business segment offers industrial sewing machines, machine tools, and garment printers, as well as industrial parts, such as reducers and gears. The Network & Contents Business segment provides online karaoke systems, music boxes, applications for smartphones/tablets, health care supporting equipment, and content services, as well as manages Karaoke clubs. The Domino Business segment offers coding and marking equipment, and digital printing equipment. The Others segment engages in real estate and other activities. The company was formerly known as Nippon Sewing Machine Manufacturing Co. and changed its name to Brother Industries, Ltd. in 1962. Brother Industries, Ltd. was founded in 1908 and is headquartered in Nagoya, Japan.", "currency": "USD", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Nagoya"}, "CNJ.F": {"short_name": "CANON MARKETING JAPAN INC", "long_name": "Canon Marketing Japan Inc.", "summary": "Canon Marketing Japan Inc. markets and sells Canon products and related solutions in Japan. It operates through Consumers, Enterprise, Area, and Professional segments. The Consumers segment provides digital cameras and inkjet printers to consumers. The Enterprise segment supplies input/output equipment and solutions to help resolve the business-specific management issues. The Area segment supplies input/output equipment and solutions to help resolve the management issues of small-to medium-sized enterprises. The Professional segment sells digital printers, wide-format printers, and point-of-purchase systems and consumables; print prepress and post-processing equipment, inspection devices, and printing-related software and maintenance services; workflow systems and print services; semiconductor fabrication and measuring equipment to semiconductor and other electronic device manufacturers; and modalities, IT systems, and solutions to medical institutions, as well as dispensing machines and IT systems to pharmacies. The company was founded in 1968 and is headquartered in Tokyo, Japan. Canon Marketing Japan Inc. is a subsidiary of Canon Inc.", "currency": "EUR", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "FJI.F": {"short_name": "FUJIFILM HOLDINGS CORP.", "long_name": "FUJIFILM Holdings Corporation", "summary": "FUJIFILM Holdings Corporation develops, manufactures, sells, and services imaging, healthcare and material, and document solutions worldwide. Its Imaging Solutions segment offers color films, instant cameras, developing and printing systems, color papers, and photo printing services; and TV and cinema lenses, surveillance cameras, industrial lenses for production line inspection, and projectors. The company's Healthcare & Material Solutions segment provides products and services, such as medical devices, biomedical contract development and manufacturing organization, pharmaceutical, regenerative medicine, and cosmetics and supplements in the three areas of prevention, diagnosis, and treatment. This segment offers inkjet digital presses and printing plates for printing industries, as well as industrial inkjet-related products and inkjet heads; storage media and archiving services to save and manage digital data volumes; and materials for industrials, including display and touch panel, semiconductor and image sensor, and functional film materials. Its Document Solutions provides devices and services used in offices, including digital multifunction devices, printers, software, and cloud services; workflow solutions for printing companies and others in the graphical communications sector; and document services tailored to diverse business formats and roles, including system integration, business process outsourcing, and others FUJIFILM Holdings Corporation was founded in 1934 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "FUJIF": {"short_name": "FUJIFILM HOLDINGS CORPORATION", "long_name": "FUJIFILM Holdings Corporation", "summary": "FUJIFILM Holdings Corporation develops, manufactures, sells, and services imaging, healthcare and material, and document solutions worldwide. Its Imaging Solutions segment offers color films, instant cameras, developing and printing systems, color papers, and photo printing services; and TV and cinema lenses, surveillance cameras, industrial lenses for production line inspection, and projectors. The company's Healthcare & Material Solutions segment provides products and services, such as medical devices, biomedical contract development and manufacturing organization, pharmaceutical, regenerative medicine, and cosmetics and supplements in the three areas of prevention, diagnosis, and treatment. This segment offers inkjet digital presses and printing plates for printing industries, as well as industrial inkjet-related products and inkjet heads; storage media and archiving services to save and manage digital data volumes; and materials for industrials, including display and touch panel, semiconductor and image sensor, and functional film materials. Its Document Solutions provides devices and services used in offices, including digital multifunction devices, printers, software, and cloud services; workflow solutions for printing companies and others in the graphical communications sector; and document services tailored to diverse business formats and roles, including system integration, business process outsourcing, and others FUJIFILM Holdings Corporation was founded in 1934 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "FUJIY": {"short_name": "FUJIFILM HOLDINGS CORPORATION", "long_name": "FUJIFILM Holdings Corporation", "summary": "FUJIFILM Holdings Corporation develops, manufactures, sells, and services imaging, healthcare and material, and document solutions worldwide. Its Imaging Solutions segment offers color films, instant cameras, developing and printing systems, color papers, and photo printing services; and TV and cinema lenses, surveillance cameras, industrial lenses for production line inspection, and projectors. The company's Healthcare & Material Solutions segment provides products and services, such as medical devices, biomedical contract development and manufacturing organization, pharmaceutical, regenerative medicine, and cosmetics and supplements in the three areas of prevention, diagnosis, and treatment. This segment offers inkjet digital presses and printing plates for printing industries, as well as industrial inkjet-related products and inkjet heads; storage media and archiving services to save and manage digital data volumes; and materials for industrials, including display and touch panel, semiconductor and image sensor, and functional film materials. Its Document Solutions provides devices and services used in offices, including digital multifunction devices, printers, software, and cloud services; workflow solutions for printing companies and others in the graphical communications sector; and document services tailored to diverse business formats and roles, including system integration, business process outsourcing, and others FUJIFILM Holdings Corporation was founded in 1934 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "JCM.F": {"short_name": "JAPAN CASH MACHINE", "long_name": "Japan Cash Machine Co., Ltd.", "summary": "Japan Cash Machine Co., Ltd., together with its subsidiaries, develops, manufactures, and sells money-handling and amusement center machines in Japan and internationally. It offers bill acceptors, coin and bill counting and processing machines, OEM terminals for sports and track facilities, and other equipment for the financial industry; and ATMs, automatic ticketing machines, fare adjustment machines, vending machines, depositing machines, and kiosk terminals under the JCM brand name. It serves casinos and gaming, banking, transportation, retail, amusement, and other markets. The company was founded in 1955 and is headquartered in Osaka, Japan.", "currency": "EUR", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Osaka"}, "KNCAF": {"short_name": "KONICA MINOLTA INC", "long_name": "Konica Minolta, Inc.", "summary": "Konica Minolta, Inc. engages in office, professional print, healthcare, and industrial businesses in Japan, the United States, European countries, China, other Asian countries, and internationally. The company develops, manufactures, and sells multi-functional peripherals, laser printers, filing devices, software and peripheral devices, digital color printing systems, digital monochrome printing systems, inkjet print heads, inkjet textile printers, and inkjet inks, as well as print and cloud services. It also offers healthcare systems, such as diagnostic ultrasound systems, digital X-ray diagnostic imaging systems, digital mammography systems, and medical imaging filling systems, as well as medical management ICT services. In addition, the company provides measuring instruments, including colorimeters, luminance meters, spectrophotometers, and photovoltaic reference cells; TAC films for liquid crystal displays; organic light emitting diode lighting products; lenses for industrial and professional use; and functional film displays. Further, it manages and operates planetarium facilities. Konica Minolta, Inc. was founded in 1873 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "KNCAY": {"short_name": "KONICA MINOLTA INC", "long_name": "Konica Minolta, Inc.", "summary": "Konica Minolta, Inc. engages in office, professional print, healthcare, and industrial businesses in Japan, the United States, European countries, China, other Asian countries, and internationally. The company develops, manufactures, and sells multi-functional peripherals, laser printers, filing devices, software and peripheral devices, digital color printing systems, digital monochrome printing systems, inkjet print heads, inkjet textile printers, and inkjet inks, as well as print and cloud services. It also offers healthcare systems, such as diagnostic ultrasound systems, digital X-ray diagnostic imaging systems, digital mammography systems, and medical imaging filling systems, as well as medical management ICT services. In addition, the company provides measuring instruments, including colorimeters, luminance meters, spectrophotometers, and photovoltaic reference cells; TAC films for liquid crystal displays; organic light emitting diode lighting products; lenses for industrial and professional use; and functional film displays. Further, it manages and operates planetarium facilities. Konica Minolta, Inc. was founded in 1873 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "KOK.F": {"short_name": "KOKUYO CO. LTD", "long_name": "Kokuyo Co., Ltd.", "summary": "Kokuyo Co., Ltd. manufactures, purchases, and sells stationery and office furniture products in Japan. The company provides various office paper products, and stationery and PC-related products, as well as information management and meeting management systems; and develops and produces a range of picture story books, and educational toys and goods. It also offers office furniture and furniture for public spaces, as well as configures space for office, government offices and public facilities, educational and medical facilities, retail stores and commercial spaces, and hotels. In addition, the company provides mail-order services for individuals, as well as various local enterprises in the Shanghai and Beijing regions. Further, it engages in the wholesale of stationery, office supplies, office equipment, office-automation equipment, school supplies, and office furniture to distribution companies; and retail of furniture, textiles, and general home furnishings under the Actus brand, as well as offers space design and consultation services. The company was founded in 1905 and is headquartered in Osaka, Japan.", "currency": "EUR", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Osaka"}, "KPI1.F": {"short_name": "KONICA MINOLTA INC.", "long_name": "Konica Minolta, Inc.", "summary": "Konica Minolta, Inc. engages in office, professional print, healthcare, and industrial businesses in Japan, the United States, European countries, China, other Asian countries, and internationally. The company develops, manufactures, and sells multi-functional peripherals, laser printers, filing devices, software and peripheral devices, digital color printing systems, digital monochrome printing systems, inkjet print heads, inkjet textile printers, and inkjet inks, as well as print and cloud services. It also offers healthcare systems, such as diagnostic ultrasound systems, digital X-ray diagnostic imaging systems, digital mammography systems, and medical imaging filling systems, as well as medical management ICT services. In addition, the company provides measuring instruments, including colorimeters, luminance meters, spectrophotometers, and photovoltaic reference cells; TAC films for liquid crystal displays; organic light emitting diode lighting products; lenses for industrial and professional use; and functional film displays. Further, it manages and operates planetarium facilities. Konica Minolta, Inc. was founded in 1873 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "NHBAF": {"short_name": "NICHIBAN CO LTD", "long_name": "Nichiban Co., Ltd.", "summary": "Nichiban Co., Ltd. manufactures and sells medical products and tapes in Asia and Europe. It offers medical products, including surgical tapes, dressing tapes, first-aid bandages, hemostatic bandages, and others. The company also provides OTC products, such as anti-inflammatory patches, foot care products, waterproof films, and bandages. In addition, it offers taping tapes comprising cotton, elastic, kinesiology, strapping tapes, and others; and stationery products consisting of cellulose adhesive tapes, double sided tapes, adhesive transfer tapes, book binding tapes, and others. Further, the company provides industrial tapes for non-heavy duty packaging, carton boxes, agricultural use, vehicles, and machinery, as well as specialized tapes; and cellulose, OPP packing, kraft paper, lithographic, and crepe tapes. Nichiban Co., Ltd. was founded in 1918 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "RIC1.F": {"short_name": "RICOH CO. LTD", "long_name": "Ricoh Company, Ltd.", "summary": "Ricoh Company, Ltd. provides various office and commercial printing solutions and related solutions worldwide. It offers multifunctional printers, printers, industrial inkjet, garment and production printers, 3D printers, projectors, video and web conference systems, and interactive whiteboards. The company also provides digital, spherical, single lens reflex, action, and FA cameras; and automotive stereo cameras, automotive precision machined parts, and small and low energy mobile ICs. In addition, it produces and markets thermal paper and media for food labels, clothing tags, tickets, and handy terminal paper; manufactures and sells watches; and provides magnetoencephaiograph used in brain activity measurement. Further, the company provides managed print, application/ business process, communication, intelligent workplace, and IT services; and solar power facility operations and maintenance services, as well as electricity sales services. It serves manufacturing, retail, healthcare, real estate, travel and tourism, and engineering and construction sectors. The company was formerly known as Riken Optical Co., Ltd. and changed its name to Ricoh Company, Ltd. in 1963. Ricoh Company, Ltd. was founded in 1936 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "RICO.L": {"short_name": "RICOH CO LTD RICOH ORD SHS", "long_name": "Ricoh Company, Ltd.", "summary": "Ricoh Company, Ltd. provides various office and commercial printing solutions and related solutions worldwide. It offers multifunctional printers, printers, industrial inkjet, garment and production printers, 3D printers, projectors, video and web conference systems, and interactive whiteboards. The company also provides digital, spherical, single lens reflex, action, and FA cameras; and automotive stereo cameras, automotive precision machined parts, and small and low energy mobile ICs. In addition, it produces and markets thermal paper and media for food labels, clothing tags, tickets, and handy terminal paper; manufactures and sells watches; and provides magnetoencephaiograph used in brain activity measurement. Further, the company provides managed print, application/ business process, communication, intelligent workplace, and IT services; and solar power facility operations and maintenance services, as well as electricity sales services. It serves manufacturing, retail, healthcare, real estate, travel and tourism, and engineering and construction sectors. The company was formerly known as Riken Optical Co., Ltd. and changed its name to Ricoh Company, Ltd. in 1963. Ricoh Company, Ltd. was founded in 1936 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "LSE", "market": "gb_market", "country": "Japan", "city": "Tokyo"}, "RICOF": {"short_name": "RICOH CO", "long_name": "Ricoh Company, Ltd.", "summary": "Ricoh Company, Ltd. provides various office and commercial printing solutions and related solutions worldwide. It offers multifunctional printers, printers, industrial inkjet, garment and production printers, 3D printers, projectors, video and web conference systems, and interactive whiteboards. The company also provides digital, spherical, single lens reflex, action, and FA cameras; and automotive stereo cameras, automotive precision machined parts, and small and low energy mobile ICs. In addition, it produces and markets thermal paper and media for food labels, clothing tags, tickets, and handy terminal paper; manufactures and sells watches; and provides magnetoencephaiograph used in brain activity measurement. Further, the company provides managed print, application/ business process, communication, intelligent workplace, and IT services; and solar power facility operations and maintenance services, as well as electricity sales services. It serves manufacturing, retail, healthcare, real estate, travel and tourism, and engineering and construction sectors. The company was formerly known as Riken Optical Co., Ltd. and changed its name to Ricoh Company, Ltd. in 1963. Ricoh Company, Ltd. was founded in 1936 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "RICOY": {"short_name": "RICOH CO", "long_name": "Ricoh Company, Ltd.", "summary": "Ricoh Company, Ltd. provides various office and commercial printing solutions and related solutions worldwide. It offers multifunctional printers, printers, industrial inkjet, garment and production printers, 3D printers, projectors, video and web conference systems, and interactive whiteboards. The company also provides digital, spherical, single lens reflex, action, and FA cameras; and automotive stereo cameras, automotive precision machined parts, and small and low energy mobile ICs. In addition, it produces and markets thermal paper and media for food labels, clothing tags, tickets, and handy terminal paper; manufactures and sells watches; and provides magnetoencephaiograph used in brain activity measurement. Further, the company provides managed print, application/ business process, communication, intelligent workplace, and IT services; and solar power facility operations and maintenance services, as well as electricity sales services. It serves manufacturing, retail, healthcare, real estate, travel and tourism, and engineering and construction sectors. The company was formerly known as Riken Optical Co., Ltd. and changed its name to Ricoh Company, Ltd. in 1963. Ricoh Company, Ltd. was founded in 1936 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Industrials", "industry": "Business Equipment & Supplies", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}}