{
    "2170.T": {
        "short_name": "LINK AND MOTIVATION INC",
        "long_name": "Link and Motivation Inc.",
        "summary": "Link and Motivation Inc. provides consulting and cloud services in Japan. It offers consulting, training package, and cloud services for employee engagement; corporate branding services; personnel placement and temp staff services; and venture incubation services, as well as operates career schools and examination preparatory schools. The company was founded in 2000 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0061",
        "website": "http://www.lmi.ne.jp",
        "full_time_employees": 1498
    },
    "2353.T": {
        "short_name": "NIPPON PARKING DEVELOPMENT CO.L",
        "long_name": "NIPPON PARKING DEVELOPMENT Co.,Ltd.",
        "summary": "NIPPON PARKING DEVELOPMENT Co.,Ltd. provides consulting services for parking lot businesses in Japan. The company's operations/services comprise parking facility design and planning solutions, operations planning solutions, parking facilities operations manning services, and valet services. Its profitability management solutions consist of rent proposal report, operational profitability estimation, unused real estate assets activation, parking operation, and marketing services. In addition, the company provides cost management solutions in the fields of parking facility planning and design, facility maintenance plan, construction management, monthly facilities maintenance, and sale of parking facilities. Further, it offers parking safety improvement programs. The company serves building owners, parking facility owners, hotel business owners, store owners, property managers, asset managers, development project managers, and rental/lease businesses. NIPPON PARKING DEVELOPMENT Co.,Ltd. was founded in 1991 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0018",
        "website": "http://www.n-p-d.co.jp",
        "full_time_employees": 1166
    },
    "2449.T": {
        "short_name": "PRAP JAPAN INC",
        "long_name": "PRAP Japan, Inc.",
        "summary": "PRAP Japan, Inc., together with its subsidiaries, operates as a public relations consultancy company in Japan. The company provides crisis communications support services; purpose-built media training studio services; event management; and digital influence services. The company serves healthcare, finance, energy, automobiles, culture/fashion/art, travel and retail, food and restaurants, and information technology industries. PRAP Japan, Inc. was founded in 1970 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-6033",
        "website": "http://www.prap.co.jp",
        "full_time_employees": 273
    },
    "3719.T": {
        "short_name": "GEXEED CO LTD",
        "long_name": "Gexeed Co., Ltd.",
        "summary": "Gexeed Co., Ltd. provides business and IT consulting services in Japan. The company's business consulting services include organizational change management assistance, technology implementation, strategy development, and operational improvement services; and improvement and reform support services for various business processes, such as general accounting, management accounting, manufacturing, and distribution, as well as financial strategies and budget planning services. Its business consulting services also comprise finance, management accounting, and performance accounting support services to assist with business administration primarily for corporate consolidation; BPR for strategic human capital management and human resource management outsourcing services; and IT diagnosis consulting services. The company also provides enterprise resource planning (ERP) implementation services. In addition, it offers JD Edwards implementation consulting, roll-in/out project support, and original support services; SAP implementation services, including the implementation of business cases, blueprinting, technical implementation, development, and post go-live support services; NetSuite Cloud ERP solutions; and business incubation services, as well as provides SAP human capital management services, technical and cloud solutions, and software as a service. The company was founded in 1964 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0054",
        "website": "http://www.gexeed.co.jp",
        "full_time_employees": 107
    },
    "3768.T": {
        "short_name": "RISKMONSTER.COM",
        "long_name": "Riskmonster.com",
        "summary": "Riskmonster.com provides credit management and ASP cloud services in Japan. The company offers corporate ratings backed by bankruptcy records, ASP and cloud services, and consulting services; and BPO services comprising digital data creation and data entry solutions. It also provides credit management support services, including RM score and RM credit limit credit indicators; e-credit navi and e-management files that combine credit decisions and continuous management; portfolio and credit management regulation consulting services; corporate credit survey services, and Analyst Monster and News Monster tools; Secured Monster plans; credit management qualification systems; RISMON e-corporate business support services; and shared programs and credit management cloud services. In addition, the company offers Attack Monster sales support services; trainer dispatch services; credit management training services; and training and human resources development services, as well as operates a business portal site that provides ASP and cloud versions of desknet's groupware. The company was founded in 2000 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.riskmonster.co.jp",
        "full_time_employees": 142
    },
    "3906.T": {
        "short_name": "ALBERT",
        "long_name": "ALBERT Inc.",
        "summary": "ALBERT Inc. provides data solutions in big data analytics in Japan. It offers AI, data analysis, and research and development support services. The company also provides big data collection and analytics, algorithm development, and system deployment services. In addition, it offers Sugures, a chatbot service equipped with AI, which offers an automated inquiry response that integrated with LINE and various other SNS tools enables users to achieve communication that is optimized to their needs; and Takuminome, an AI/image-recognition service that provides AI construction support services for companies looking to make use of image-recognition technology. Further, the company provides data scientist training support services. It serves automotive, manufacturing, communications, distribution and infrastructure, and finance sectors. ALBERT Inc. was incorporated in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "169-0074",
        "website": "http://www.albert2005.co.jp",
        "full_time_employees": 163
    },
    "3SY.F": {
        "short_name": "NIPPON PARK.DEV.CO.LTD.",
        "long_name": "NIPPON PARKING DEVELOPMENT Co.,Ltd.",
        "summary": "NIPPON PARKING DEVELOPMENT Co.,Ltd. provides consulting services for parking lot businesses in Japan. The company's operations/services comprise parking facility design and planning solutions, operations planning solutions, parking facilities operations manning services, and valet services. Its profitability management solutions consist of rent proposal report, operational profitability estimation, unused real estate assets activation, parking operation, and marketing services. In addition, the company provides cost management solutions in the fields of parking facility planning and design, facility maintenance plan, construction management, monthly facilities maintenance, and sale of parking facilities. Further, it offers parking safety improvement programs. The company serves building owners, parking facility owners, hotel business owners, store owners, property managers, asset managers, development project managers, and rental/lease businesses. NIPPON PARKING DEVELOPMENT Co.,Ltd. was founded in 1991 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0018",
        "website": "http://www.n-p-d.co.jp",
        "full_time_employees": 1166
    },
    "4422.T": {
        "short_name": "VALUENEX JAPAN INC",
        "long_name": "VALUENEX Japan Inc.",
        "summary": "VALUENEX Japan Inc. provides information analysis services. It offers various services, such as bird's eye view analysis tool by ASP; and consulting and coaching from bird's eye view analysis to forecast analysis and strategy utilization. The company is also involved in tool license sales business. VALUENEX Japan Inc. was founded in 2006 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "112-0006",
        "website": "http://valuenex.com",
        "full_time_employees": 32
    },
    "4490.T": {
        "short_name": "VISASQ INC",
        "long_name": "VisasQ Inc.",
        "summary": "VisasQ Inc. provides professional knowledge sharing platform/consulting services for new business and organizational development in Japan. The company offers in-person meeting, phone consultation, survey, site visit, short-term assignment, and seminar and event services. It serves consulting and professional firms, financial institutions, Fortune 500 companies, and small and medium-sized enterprises. The company was founded in 2012 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "153-0042",
        "website": "http://visasq.co.jp",
        "full_time_employees": null
    },
    "4792.T": {
        "short_name": "YAMADA CONSULTING GROUP CO LTD",
        "long_name": "YAMADA Consulting Group Co., Ltd.",
        "summary": "YAMADA Consulting Group Co., Ltd. provides various consulting services in Japan and internationally. It offers sustainable growth consulting, business restructuring consulting, M&A Consulting, business succession consulting, people and organization consulting, corporate governance consulting, IT consulting, international business consulting, real estate consulting, education and training, and industry-specific consulting services. The company was formerly known as TFP Consulting Group Co., Ltd. and changed its name to YAMADA Consulting Group Co., Ltd. in December 2010. YAMADA Consulting Group Co., Ltd. was founded in 1989 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.yamada-cg.co.jp",
        "full_time_employees": 790
    },
    "6027.T": {
        "short_name": "BENGO4.COM INC",
        "long_name": "Bengo4.com,Inc.",
        "summary": "Bengo4.com,Inc. primarily develops and operates legal search and consultation portal site in Japan. It also develops and operates sites for tax consultation, legal news media, legal advice, web-complete cloud contract service, corporate legal affairs, and career consulting and career change support services, as well as for business support and customer support service for tax accountants. The company was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "106-0032",
        "website": "http://corporate.bengo4.com",
        "full_time_employees": null
    },
    "6578.T": {
        "short_name": "NLINKS CO LTD",
        "long_name": "NLINKS Co., Ltd.",
        "summary": "NLinks Co., Ltd engages in media management and sales agency businesses. It is involved in data analysis and management of Internet media/services; and real estate rental and stores management activities. The company also provides recruitment consulting services; and sales outsourcing and call center services. NLinks Co., Ltd was founded in 2010 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "171-0014",
        "website": "http://www.n-links.co.jp",
        "full_time_employees": 791
    },
    "8929.T": {
        "short_name": "AOYAMA ZAISAN NETWORKS CO LIMIT",
        "long_name": "Aoyama Zaisan Networks Company,Limited",
        "summary": "Aoyama Zaisan Networks Company,Limited provides real estate consulting solutions primarily in Japan. The company also offers corporate finance consulting and individual asset consulting services. In addition, it provides asset management solutions to individual asset owners and corporate owners. The company was formerly known as Funai Zaisan Consultants Co., Ltd. and changed its name to Aoyama Zaisan Networks Company,Limited in July 2012. The company was founded in 1991 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0052",
        "website": "http://www.azn.co.jp",
        "full_time_employees": 247
    },
    "9644.T": {
        "short_name": "TANABE CONSULTING CO LTD",
        "long_name": "Tanabe Consulting Co.,Ltd.",
        "summary": "Tanabe Consulting Co., Ltd. engages in the management and marketing consulting activities. It offers sales and web promotion, merger and acquisition, human resource development, function, digital transformation, and domain consulting, as well as strategy research and business management services. The company serves the healthcare, construction, infrastructure, business model, house and living, lifestyle, agribusiness, manufacturing, SDG, tourism, education and learning, logistics, and food production sectors. It operates an office network covering 10 cities in Japan. The company was formerly known as Tanabe Management Consulting Co., Ltd. The company was founded in 1957 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": null,
        "website": "http://www.tanabekeiei.co.jp",
        "full_time_employees": 356
    },
    "9755.T": {
        "short_name": "OYO CORP",
        "long_name": "OYO Corporation",
        "summary": "OYO Corporation provides geological survey services. The company operates in four segments: Infrastructure Maintenance, Management, and Renovation; Natural Disaster Prevention and Mitigation; Environment; and Natural Resources and Energy. The Infrastructure Maintenance, Management, and Renovation segment provides investigation services on infrastructures, building infrastructure maintenance, and management systems; and design and measuring services for disaster-resilient infrastructure, as well as develops and sells non-destructive test equipment, etc. The Natural Disaster Prevention and Mitigation segment engages in the provision of support services to governments in preparing disaster prevention plans; prediction of damages from earthquake, tsunami, fire, and other disasters; investigation, loss estimations, and consultations on countermeasures for natural disaster risks; and development, installation, and renewal of monitoring systems. The Environment segment provides solutions for preservation of biodiversity; soil and groundwater contamination and waste; and asbestos analysis and removal. The Natural Resources and Energy segment offers geological consultation for the power plants; support services for the commercialization of renewable energy; four-dimensional subsea investigation service; research and development services on methane hydrate; and develops systems for natural resource exploration. It also develops, manufactures, sells, leases, and rents various measuring instruments, security instruments, software, and systems. The company was founded in 1954 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-8486",
        "website": "http://www.oyo.co.jp",
        "full_time_employees": 2243
    },
    "9757.T": {
        "short_name": "FUNAI SOKEN HOLDINGS INCORPORAT",
        "long_name": "Funai Soken Holdings Incorporated",
        "summary": "Funai Soken Holdings Incorporated provides consulting services to manufacturing and retail businesses in Japan. The company offers management consulting services; logistics services, including consulting, trading, and transportation; and consulting services for various sectors, such as housing and real estate, medical, nursing care, welfare, automotive, HR business, food and distribution, retail, and direct sales, as well as certified professional, amusement, community care, and specialist services. It also provides support services, including systems design and analysis, program creation, and systems operation and management, as well as training and diagnostics services. The company was formerly known as Funai Consulting Incorporated and changed its name to Funai Soken Holdings Incorporated in July 2014. Funai Soken Holdings Incorporated was incorporated in 1970 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0041",
        "website": "http://hd.funaisoken.co.jp",
        "full_time_employees": 1303
    }
}