{
    "1433.T": {
        "short_name": "BESTERRA CO LTD",
        "long_name": "Besterra Co., Ltd.",
        "summary": "Besterra Co., Ltd. engages in the dismantling business. It is involved in the dismantling of plant facilities, such as steelworks, power plants, gas and petrochemical plants, and various factories. The company also provides 3D measurement services for the renovation and disassembling of equipment facilities; and recruits professionals in IT industry and construction management. Besterra Co., Ltd. was founded in 1974 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1434.T": {
        "short_name": "JESCO HOLDINGS INC",
        "long_name": "Jesco Holdings, Inc.",
        "summary": "JESCO Holdings, Inc. engages in the design, construction, and maintenance of electrical equipment, and information and communication systems. The company operates through Domestic EPC, ASEAN EPC, Integrated media, and CRE businesses. The Domestic EPC business engages in the installation of electrical equipment and telecommunication systems. The ASEAN EPC business is involved in construction work, electrical equipment engineering, telecommunications engineering, and air-conditioning and sanitary equipment engineering activities. The Integrated Media Communication business sells and installs OEM-manufactured large display systems, such as LED displays, as well as owns and operates large displays installed along Metropolitan Expressways. The Corporate Real Estate (CRE) business leases office buildings. The company was formerly known as JESCO Co., Ltd. and changed its name to JESCO Holdings, Inc. in September 2004. JESCO Holdings, Inc. was founded in 1970 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1439.T": {
        "short_name": "YASUE CORPORATION",
        "long_name": "Yasue Corporation",
        "summary": "Yasue Corporation engages in housing remodeling and renovation activities in Japan. It also provides real estate brokerage and purchase resale services; and architecture services. In addition, the company develops and sells building materials; and designs and constructs custom houses. The company was founded in 1970 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Nagoya"
    },
    "1443.T": {
        "short_name": "GIKEN HOLDINGS CO LTD",
        "long_name": "Giken Holdings Co., Ltd.",
        "summary": "Giken Holdings Co., Ltd. primarily engages in civil engineering business. It is involved in the installation and material sale activities for anchored grid-type retaining wall construction; on-site and simple blow-on concrete slope coverings; Mather soil and high-energy absorbing shelf construction; beads ringer net construction; tree planting; and other slope, landslide prevention, and borehole construction. The company also manufactures, sells, and installs seawall wave-damping foundation and environmental blocks, as well as erosion control and free-standing molded blocks for preservation; and provides reefs, and civil engineering and building materials. Giken Holdings Co., Ltd. was founded in 1958 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1446.T": {
        "short_name": "CANDEAL CO LTD",
        "long_name": "CANDEAL Co.,Ltd",
        "summary": "CANDEAL CO.,Ltd, through its subsidiaries, operates in the construction industry in Japan. The company offers repair and maintenance services for the housing environment in the construction industry; and repair, interior construction, inspection, and lifting services for the residential and commercial environments. It is also involved in the trading and distribution of repair and interior decoration materials. The company was formerly known as Burn Holdings Co., Ltd. and changed its name to CANDEAL CO.,Ltd in October 2016. CANDEAL CO.,Ltd was founded in 2014 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1450.T": {
        "short_name": "TANAKEN",
        "long_name": "Tanaken",
        "summary": "TANAKEN engages in the engineering design, construction, and supervision of interior and exterior construction works in Japan. It also undertakes civil engineering construction projects; and sells construction materials and machinery. The company is involved in the import, export, lease, collection, transportation, and disposal of industrial waste; and buying and selling, leasing, managing, and mediation of land. TANAKEN was founded in 1982 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1716.T": {
        "short_name": "DAI-ICHI CUTTER KOGYO KK",
        "long_name": "Dai-Ichi Cutter Kogyo k.k.",
        "summary": "Dai-Ichi Cutter Kogyo k.k. engages in the construction and civil engineering activities in Japan. The company offers flat sawing, core drilling, wall and wire sawing, grooving, various dry cutting/perforating, and various metal cutting/perforating services; concrete chipping, concrete surface treatment, coating removal treatment, metal cutting, and plant equipment cleaning decontamination services; shot and vacuum blast and decontamination services; and various cleaning, polishing, mechanical cutting, peeling, and mirror floor polishing services. It also provides building maintenance services comprising drain pipe and water tank cleaning, common floor and mechanical pit cleaning, firefighting equipment inspection, pest control, sewage layer, miscellaneous drainage tank repair, and water supply equipment inspection services; and anchor construction, industrial waste collection and transportation, and intermediate treatment services. The company was founded in 1967 and is headquartered in Chigasaki, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Chigasaki"
    },
    "1717.T": {
        "short_name": "MEIHO FACILITY WORKS",
        "long_name": "Meiho Facility Works Ltd.",
        "summary": "Meiho Facility Works Ltd. provides programming, design, evaluation, construction management, consulting, and moving services for office and building projects in Japan. The company provides services for new construction, reconstruction, renovations, conversion, repair, relocation, and renewal of various projects, such as hotels and lodging, commercial, hospitals and medical, public, and schools and educational facilities, as well as plants and laboratories, office buildings, data centers, and financial institutions. It also provides office fit-out and consolidation services, including support for relocation project startup, design, project management, and operation support services; mechanical, electrical, and plumbing facilities renewal, as well as energy saving services; and business continuity planning (BCP) facilities, including location analysis and deliberation on BCP measures for customer facilities, planning of countermeasures, and calculation of costs. In addition, the company offers cost management and cost assessment services; and integrated multi-facility management services. Meiho Facility Works Ltd. was founded in 1980 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1718.T": {
        "short_name": "MIKIKOGYO CO LTD",
        "long_name": "Mikikogyo Co., Ltd.",
        "summary": "Mikikogyo Co., Ltd. engages in building construction, civil engineering, remodeling, and city gas businesses in Japan. The company designs and constructs public facilities; commercial facilities; medical facilities; condominiums; office buildings; welfare facilities for the elderly, nursery schools, houses; and others, as well as plans and proposes construction for remodeling of reinforced concrete and steel-framed buildings, such as wooden houses; and undertakes civil engineering works, including construction of sewerage main, road, pavement, river/park, residential land development, etc. It also sells custom-built homes; and offers remodeling works comprising environmental remodeling and eco-remodeling based on the water area and interior/exterior of a detached houses. In addition, the company provides air-conditioning equipment; gas hot water heating systems, cogeneration systems, and gas appliances; and housing equipment, as well as constructs and generates solar power. Further, it is involved in the conduit laying and maintenance; and real estate leasing businesses, as well as operates Miki Museum. Additionally, the company engages in the general insurance agency business. Mikikogyo Co., Ltd. was founded in 1952 and is based in Himeji, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Himeji"
    },
    "1719.T": {
        "short_name": "HAZAMA ANDO CORP",
        "long_name": "Hazama Ando Corporation",
        "summary": "Hazama Ando Corporation engages in the construction and construction-related business in Japan and internationally. The company offers civil engineering and building construction services, including surveys, measurements, planning, designing, executing, supervising, technical guidance contract, commissioning, and consulting services. Its projects include offices, production and distribution facilities, medical and welfare facilities, educational and research facilities, cultural and sports facilities, commercial and leisure facilities, traditional facilities, housing complexes, and other buildings; and dams, water/sewer systems, tunnels, roads and land reclamation, bridges, airports, and other public works, as well as renewal, urban civil engineering, civil engineering structure, offshore engineering, and other projects. The company also provides real estate transaction services; and owns and uses real properties and securities. In addition, it undertakes soil survey and purification works, such as the collection, handling, and disposal of waste, as well as related consulting services; and offers planning, designing, and consulting services related to area and urban development, environmental improvements, etc. Further, the company is involved in power generation; and electricity, thermal, and other energy supply activities. Additionally, it sells construction materials, machinery, and appliances; develops, licenses, and sells software; and provides building maintenance and security services. The company was formerly known as Hazama Corporation and changed its name to Hazama Ando Corporation in April 2013. Hazama Ando Corporation was founded in 1873 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1720.T": {
        "short_name": "TOKYU CONSTRUCTION CO(NEW)",
        "long_name": "Tokyu Construction Co., Ltd.",
        "summary": "Tokyu Construction Co., Ltd. engages in the civil engineering and building construction businesses in Japan. It constructs railways, roads, tunnels, bridges, and other construction, reconstruction work after earthquakes, etc.; and commercial facilities, hotels, offices, housing, factories, hospitals, and distribution centers, and wooden building, as well as offers renovation services. The company also engages in the acquisition of properties; and rental business, as well as PPP/concession and the paprika business. The company was founded in 1946 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1721.T": {
        "short_name": "COMSYS HOLDINGS CORP",
        "long_name": "COMSYS Holdings Corporation",
        "summary": "COMSYS Holdings Corporation, together with its subsidiaries, engages in the telecommunications construction, electrical facilities construction, and information processing related businesses in Japan. It constructs wired and wireless networks, cable TV and related facilities, access networks, mobile facilities, and electric power facilities; installs, replaces, and removes metal and optical fiber communication cables; installs and replaces utility poles; installs, relocates, and removes communication and information processing equipment in communication stations and data centers; and installs mobile phone base stations and wirings, as well as handles configuration settings and troubleshooting of communication equipment. The company also provides IT solutions and develops software for government agencies; constructions physical environments, such as LAN and Wi-Fi systems, including servers, storage facilities, and networks. In addition, it is involved in the construction of underground tunnels for telecommunication facilities, and towers and buildings; biomass and wind power generation; sale of solar power generation facilities for detached homes and electricity from solar power plants; undergrounding of utility poles and civil engineering construction related to water supply and sewerage for regional municipalities; and construction of the gas facility. The company was founded in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1726.T": {
        "short_name": "BR. HOLDINGS CORPORATION",
        "long_name": "Br. Holdings Corporation",
        "summary": "Br. Holdings Corporation, through its subsidiaries, engages in the construction business in Japan. The company operates through four segments: Construction Business; Product Sales Business; Information Systems Business; and Real Estate Leasing Business. It primarily constructs prestressed concrete (PC) bridges and other structures; sells PC; and manufactures and sells railroad and sleepers, construction materials, and secondary concrete products. The company also provides information processing and software developing services. In addition, it rents and manages real estate properties. Br. Holdings Corporation was founded in 2002 and is headquartered in Hiroshima, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Hiroshima"
    },
    "1730.T": {
        "short_name": "ASO FOAM CRETE CO",
        "long_name": "Aso Foam Crete Co., Ltd.",
        "summary": "Aso Foam Crete Co., Ltd. engages in the civil engineering and construction activities in Japan. It undertakes aerated light-weight concrete and ground improvement works, as well as sells materials, such as foaming agents, etc. The company was founded in 1961 and is based in Kawasaki, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kawasaki"
    },
    "1734.S": {
        "short_name": "KITA KOUDENSHA CORP",
        "long_name": "KITA KOUDENSHA Corporation",
        "summary": "KITA KOUDENSHA Corporation engages in indoor wiring and power-related construction businesses in Japan. It undertakes electric construction work, pipe work, air conditioning control equipment installation work, steel structure construction, machinery equipment installation work, telecommunication construction, fire facility construction, water facility construction, civil engineering work, and construction work, as well as provides related planning, design, maintenance, maintenance, management, and consulting services. The company is also involved in the construction of overhead power and underground transmission lines, underground distribution and communication lines, substation electrical equipment, air conditioning automatic control systems for buildings, and optical communication cable. In addition, it sells FA equipment, such as emergency generators; laser processing and electric discharge machines, and various robots and machine tools; industrial equipment, such as power equipment, low voltage generator cars, electric wire and pipe materials, information and communication systems, etc.; generators, transformers, electric motors, and elevators; telephone exchangers and electronic calculators; and gas turbine engines, diesel engines and installed cranes, and package air conditioners. Further, the company manufactures and sells intermediary of air conditioning equipment, such as wind turbines; tube construction equipment, including boilers and pumps; and housing equipment comprising lighting equipment and ventilators, computers for information processing, various electric wires, and electric rings and accessories. Additionally, it is involved in the construction of solar power generation equipment and wind power generation business. KITA KOUDENSHA Corporation was founded in 1910 and is headquartered in Sapporo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SAP",
        "market": "jp_market",
        "country": "Japan",
        "city": "Sapporo"
    },
    "1737.T": {
        "short_name": "MESCO INC",
        "long_name": "MESCO, Inc.",
        "summary": "MESCO, Inc. provides engineering services for various industrial plants, environmental facilities, and automation and energy saving machineries in Japan, Taiwan, Malaysia, Thailand, and internationally. It offers engineering works for copper smelting/refining and others; factory automation; general and chemical industries; IT related materials; smelting/refining facilities; handling machines for refinery, and other refinery and smelter machineries; and petroleum, gas, overhaul inspection, and pipe industries. The company engages in the engineering, manufacturing, marketing and sale, and construction and installation of polyethylene pipes for use in water supply, sewage and waste water, hydrant piping, slurry transport, sea and lake bottom intake and water discharge piping, road panel heating and antifreeze pipes, hot spring and geo thermal water supply, and local and district heating and air conditioning piping applications. In addition, it offers ONSHUT, a soundproofing, vibration control, and protection from X-ray and radiation wavers; EMISHUT, a high grade electromagnetic wave shielding; RAYSHUT, a radiation shielding for nuclear industry; FLELEAD, a conductor made by lamination of electrolytic copper foil; and reinforced corrosion resistant drums for storing radioactive wastes. The company was formerly known as Mitsui Kinzoku Engineering Service Company, Limited and changed its name to MESCO, Inc. in March 1977. MESCO, Inc. was founded in 1964 and is headquartered in Tokyo, Japan. MESCO, Inc. is a subsidiary of Mitsui Mining & Smelting Co., Ltd.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1743.T": {
        "short_name": "KOATSU KOGYO CO",
        "long_name": "Koatsu Kogyo Co.,Ltd.",
        "summary": "Koatsu Kogyo Co., Ltd. designs and constructs pre-stressed concrete (PC) bridges and tanks in Japan. It also designs, manufactures, and sells concrete products, including PC concrete bridge girders, Hume pipes, propelling pipes, preholes, MU Hume pipes, box culverts, portal culverts, Tail Almes, well girders, L-shaped retaining walls, SS blocks, and PC car stop/high brightness light storage stoppers. In addition, the company leases concrete product formworks; manufactures and sells construction materials; designs, constructs, supervises, and contracts civil engineering and construction works; and provides real estate buying and selling, leasing, exchange, management, and intermediary services. Further, it develops residential land; manufactures and sells health food, including turmeric, etc.; and generates and sells solar power. The company was founded in 1959 and is headquartered in Kagoshima, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kagoshima"
    },
    "1758.T": {
        "short_name": "TAIYO KISOKOGYO CO",
        "long_name": "Taiyo Kisokogyo Co.,Ltd.",
        "summary": "Taiyo Kisokogyo Co.,Ltd. engages in the civil engineering works in Japan. The company undertakes ground reinforcement and pipe works in various fields, including general civil works, such as water and sewage, electric and gas pipelines, and rivers and roads, as well as construction works. It also engages in building repair and reinforcement, and urban redevelopment activities. The company was founded in 1958 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Nagoya"
    },
    "1762.T": {
        "short_name": "TAKAMATSU CONSTRUCTION GROUP CO",
        "long_name": "Takamatsu Construction Group Co., Ltd.",
        "summary": "Takamatsu Construction Group Co., Ltd. engages in construction, civil engineering, and real estate businesses in Japan. It constructs urban development projects, high-rise buildings, condominiums, individual housing projects, public facilities, medical/welfare facilities, shrines/temples/churches, educational and cultural institutions, commercial facilities, and factories/warehouses. The company also provides civil engineering services for various projects, including rivers, roads, railways, ports, airports, dams, tunnels, bridges, residential developments, water and sewerage systems, erosion flood control, marine civil engineering, underwater civil engineering, and wind power plants. In addition, it rents, develops, and sells condominiums; maintains buildings; and offers real estate agency, subleasing, and financing services. The company was formerly known as Takamatsu Corporation and changed its name to Takamatsu Construction Group Co., Ltd. in 1990. Takamatsu Construction Group Co., Ltd. was founded in 1917 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "1764.T": {
        "short_name": "KUDO CORP",
        "long_name": "Kudo Corporation",
        "summary": "Kudo Corporation engages in the construction business in Japan. It is involved in the contracting of civil engineering works; and real estate, custom house, building management, nursing care, and directly managed room businesses. The company was founded in 1966 and is headquartered in Yokohama, Japan. Kudo Corporation is a subsidiary of Top Corporation.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "1768.T": {
        "short_name": "SONEC CORP",
        "long_name": "Sonec Corporation",
        "summary": "Sonec Corporation engages in the general construction business. It constructs medical, welfare, education/childcare/cultural, commercial, production/logistics, and religious facilities, as well as housing complexes. The company also engages in the civil engineering construction businesses, including road and bridge, and river/sabo construction activities. In addition, it offers building repair and maintenance, and other renewal services. Further, the company is involved in design and construction supervision; and lending of construction machinery and equipment. Sonec Corporation was founded in 1944 and is headquartered in Takasago, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Takasago"
    },
    "1770.T": {
        "short_name": "FUJITA ENGINEERING CO",
        "long_name": "Fujita Engineering Co., Ltd.",
        "summary": "Fujita Engineering Co., Ltd. engages in the facilities construction business in Japan and internationally. The company undertakes air-conditioning and sanitation, electrical, instrumentation, information and communication, mechanical installation, and other works. It is also involved in the sale of industrial equipment; management of equipment maintenance facilities; manufacture of electronic devices; and contract management of water supply and sewerage system. The company was founded in 1926 and is headquartered in Takasaki, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Takasaki"
    },
    "1771.F": {
        "short_name": "NIPPON KANRYU INDUSTRY CO",
        "long_name": "Nippon Kanryu Industry Co., Ltd.",
        "summary": "Nippon Kanryu Industry Co., Ltd. engages in the construction business. The company is involved in the traffic safety facilities, landscape, and other construction works, as well as civil engineering, law related disaster prevention, and river and sabo related works. It also sells materials related to various construction works; disaster prevention goods; and industrial safety and health supplies, as well as provides structure repair related services. In addition, the company produces chemicals, such as insoluble sulfur, as well as manufactures natural soil herbs. Nippon Kanryu Industry Co., Ltd. was founded in 1939 and is headquartered in Fukuoka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FKA",
        "market": "jp_market",
        "country": "Japan",
        "city": "Fukuoka"
    },
    "1775.T": {
        "short_name": "FUJI FURUKAWA ENG & CONST CO LT",
        "long_name": "Fuji Furukawa Engineering & Construction Co.Ltd.",
        "summary": "Fuji Furukawa Engineering & Construction Co.Ltd. engages in construction business in Japan and internationally. The company undertakes social infrastructure, industrial system, and power generation facilities construction works; industrial process air conditioning, general air conditioning, and sanitary equipment installation facilities works; and electrical equipment installation and insulation works, internal electrical works in general buildings, and solar power generation equipment installation works. It is also involved in undertaking overhead and underground power transmission works; telecommunications cable installation, security equipment installation, and network wiring works; and construction and engineering, seismic reinforcement, and repair and renovation works. The company was formerly known as Fuji Electric E & C Co.Ltd. and changed its name to Fuji Furukawa Engineering & Construction Co.Ltd. in October 2009. Fuji Furukawa Engineering & Construction Co.Ltd. was founded in 1923 and is headquartered in Kawasaki, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kawasaki"
    },
    "1776.T": {
        "short_name": "SUMIKEN MITSUI ROAD CO LTD",
        "long_name": "Sumiken Mitsui Road Co.,Ltd.",
        "summary": "Sumiken Mitsui Road Co.,Ltd. primarily engages in construction business in Japan. The company is involved in the design, construction, and supervision of pavements and roads, airports, ports, and living and community facilities, as well as landscaping, civil works, building, and electricity and plumbing works. It also manufactures, sells, and leases machinery; and offers consulting services, security guard outsourcing, and buildings and equipment maintenance and management services. In addition, the company engages in the collection, transportation, and treatment of general and industrial waste; manufacture and sale of asphalt mixture, aggregates, and other construction materials; and acquisition, management, use, disposal, leasing, and sale of real estate properties. Further, it is involved in the soil and groundwater pollution restoration and purification activities; and generation, supply, and sale of solar power. The company was founded in 1948 and is headquartered in Tokyo, Japan. Sumiken Mitsui Road Co.,Ltd. is a subsidiary of Sumitomo Mitsui Construction Co. Ltd.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1780.T": {
        "short_name": "YAMAURA CORP",
        "long_name": "Yamaura Corporation",
        "summary": "Yamaura Corporation engages in the construction business in Japan. The company's projects include housing, and civil engineering and public buildings. It also undertakes infrastructure projects, such as roads, bridges, sabo, landslide countermeasures, river, pavements, parks, water and sewerage construction projects, as well as projects for renovation of existing infrastructure, and disaster prevention and mitigation measures. In addition, the company engages in the buying, selling, and leasing of real estate properties; and residential land development, real estate transactions and management, and condominium businesses, etc. Further, it plans, designs, produces, and constructs control/information systems, environment/energy systems, and bridge structure/mechanical systems, as well as provides engineering services. Yamaura Corporation was founded in 1920 and is headquartered in Komagane, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Komagane"
    },
    "1782.T": {
        "short_name": "JOBAN KAIHATSU CO",
        "long_name": "Joban Kaihatsu Co., Ltd.",
        "summary": "Joban Kaihatsu Co., Ltd., together with its subsidiaries, engages in the construction, environmental, and real estate businesses. The company undertakes the construction of various projects, including civil engineering, green spaces, water treatment facilities, etc.; provides facilities management, asbestos removal, disintegration, and radioactive energy removal services. It is also involved in environmental measurement and analysis; industrial waste disposal; the analysis of ultra-trace chemical substances; the measurement and analysis of radioactive energy monitoring and concentration, as well as sanitation system testing business; and selling and leasing of real estate properties. In addition, the company engages in the detached house construction work, real estate sales brokerage business, electrical work, air conditioning and plumbing works, and security businesses; geological survey, survey design, construction consultant, civil engineering/drilling work, inspection, repair/reinforcement design, as well as constructs concrete structures, such as bridges; offers telecommunications and electrical equipment; design, manufacture, and sale of material handling equipment, automatic control machines, etc.; and installation of machinery and equipment, steel structures, and pipe construction. Joban Kaihatsu Co., Ltd. was founded in 1960 and is headquartered in Iwaki, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Iwaki"
    },
    "1786.T": {
        "short_name": "ORIENTAL SHIRAISHI CORPORATION",
        "long_name": "Oriental Shiraishi Corporation",
        "summary": "Oriental Shiraishi Corporation produces, constructs, and sells prestressed concrete products and structures in Japan. The company also engages in the construction of pneumatic caissons; repair, retrofit, and reinforcement of infrastructures; design and construction of earthquake-resistant buildings; and sale of construction materials and devices. In addition, it generates, supplies, and sells solar power through operation and administration of solar power plants. The company was formerly known as Oriental Construction Co. Ltd. and changed its name to Oriental Shiraishi Corporation in October 2007. The company was incorporated in 1952 and is based in Tokyo, Japan. Oriental Shiraishi Corporation is a subsidiary of OSJB Holdings Corporation.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1788.T": {
        "short_name": "SANTO CO LTD",
        "long_name": "Santo Co.,Ltd.",
        "summary": "Santo Co.,Ltd. operates in construction industry in Japan. It engages in the civil work and building of temples and shrines business. The company was founded in 1954 and is headquartered in Ritto, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Ritto"
    },
    "1793.T": {
        "short_name": "OHMOTO GUMI CO",
        "long_name": "Ohmoto Gumi Co., Ltd.",
        "summary": "Ohmoto Gumi Co., Ltd. provides civil engineering and construction services in Japan. It is also involved in buried, real estate development and technology development businesses. The company provides services to large industrial, government, geotechnical, masonry, electric power, and steel structure works. Ohmoto Gumi Co., Ltd. was founded in 1907 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Okayama City"
    },
    "1795.T": {
        "short_name": "MASARU CORPORATION",
        "long_name": "Masaru Corporation",
        "summary": "Masaru Corporation engages in the construction activities in Japan. The company is involved in the renewal of condominiums and buildings; and skyscraper sealing works and membrane waterproofing works. It also provides diagnosis for building management, and contamination services for joint and outer walls. Masaru Corporation was founded in 1957 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1798.T": {
        "short_name": "MORIYA CORPORATION",
        "long_name": "Moriya Corporation",
        "summary": "Moriya Corporation operates in the construction industry. The company was founded in 1916 and is headquartered in Nagano, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Nagano"
    },
    "1799.T": {
        "short_name": "DAIICHI KENSETSU CORP",
        "long_name": "Daiichi Kensetsu Corporation",
        "summary": "Daiichi Kensetsu Corporation provides contract work services for civil engineering, architecture, and railway construction in Japan. The company offers planning, design, surveying, supervision, inspection, and consulting services for civil engineering, architecture, and railway construction. It also manufactures and sells materials for civil engineering, architecture, and railway construction; and buys and sells, exchanges, leases, mediates, and manages real estate properties, as well as provides non-life insurance agency services. Daiichi Kensetsu Corporation was founded in 1942 and is headquartered in Niigata, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Niigata"
    },
    "1801.T": {
        "short_name": "TAISEI CORP",
        "long_name": "Taisei Corporation",
        "summary": "Taisei Corporation engages in the civil engineering, construction contracts, and real estate development businesses in Japan and internationally. The company constructs tunnels, bridges, roads, and dams; and builds social infrastructures, as well as offers decontamination, maintenance, and preservation services. It also constructs airports, office buildings, commercial facilities, factories, and hospitals, as well as provides renovation and demolition services. In addition, the company is involved in the redevelopment projects, PFI projects, property management, and condominium sales projects; and purchase, sale, and rental of land and buildings. Further, it engages in the contract research, technology provision, and environmental measurement; housing; and leisure businesses. The company was formerly known as Nippon Doboku Corporation and changed its name to Taisei Corporation in 1946. Taisei Corporation was founded in 1873 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1802.T": {
        "short_name": "OBAYASHI CORP",
        "long_name": "Obayashi Corporation",
        "summary": "Obayashi Corporation engages in the construction business in Japan, North America, Asia, the Middle East, Europe, and Oceania. The company constructs buildings, including offices, condominiums, commercial facilities, factories, hospitals, and schools; and civil engineering projects, such as tunnels, bridges, dams, riverbanks, railroads, and expressways. It is also involved in the development and leasing of real estate properties in various locations, primarily in metropolitan areas, as well as property management activities; solar, biomass, hydropower, geothermal, and wind power generation business; and PPP and agriculture business. In addition, the company sells materials and equipment for construction; develops and sells computer software; sells and leases electronic equipment; offers finance-related services; and operates golf clubs. Further, it engages in the provision of urban development, contracted engineering, management, consultancy services, etc.; and is involved in the M&E design and construction activities. The company was founded in 1892 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1803.T": {
        "short_name": "SHIMIZU CORP",
        "long_name": "Shimizu Corporation",
        "summary": "Shimizu Corporation engages in the building contracting, civil engineering, machinery, and other construction works in Japan. It is also involved in the research, planning, study, evaluation, diagnosis, soil analysis, surveying, design, supervision, management, and consultancy related to regional, urban, ocean, space, resources, and energy developments, as well as construction works and environment improvement; and purchase, sale, letting, brokerage, management, appraisal, and consultancy of real estate. The company constructs, lets, sells, and caretaking of residential houses and other buildings; plans, constructs, possesses, maintains, and operates public office buildings, roads, harbors, airports, and parks, as well as educational and cultural, medical and welfare, and water supply and sewerage facilities; generates and supplies electricity and heat; undertakes purification works; collects, disposes, and reutilizes waste; and designs, installs, leases, sells, and maintains information communication and building management system. It also engages in the cultivation, production, management, sale, and consultancy of agricultural produce and seafood, and forestry work; maintenance and upkeep, security, and cleaning of buildings, equipment, and machinery; and design, manufacture, sale, lease, and brokerage of construction machinery and materials, concrete and wooden products, furniture, and interior fitting. The company offers industrial property, copyrights, and computer software; pharmaceutical, medical care material, and medical machinery and equipment; and advertisement, publication, printing, images and other information media, business event, inland transportation, warehouse, distribution center, insurance and travel agency, manpower supply, loan, guarantee, and factoring services. It also engages in the management and consultancy of sporting, hotel, restaurant, nursing, and resort facilities. The company was founded in 1804 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1805.T": {
        "short_name": "TOBISHIMA CORP",
        "long_name": "Tobishima Corporation",
        "summary": "Tobishima Corporation engages in the construction business in Japan and internationally. The company is involved in the research, survey, planning, designing, supervision, and management of civil engineering and building construction works, as well as regional and urban developments, ocean developments and environmental considerations, etc.; and planning, designing, development, possession, maintenance, operation, and management of various public facilities and infrastructure, including roads, ports, water supply and sewage works, government office buildings, educational and cultural facilities, solid waste disposal facilities, medical and sports facilities, hotels, and restaurants. It also engages in the environmental enhancement business, such as soil enhancement, river and lake bottom sediment purification, and lake and seawater improvement; collection, transportation, treatment, and recycling of general and industrial waste; thermal and other electricity and energies supply; and fabrication, procurement, sale, and lease of construction machinery, equipment, materials, and other manufactured items. In addition, the company is involved in the real estate dealing and leasing, and housing businesses; maintenance and security services works for buildings and incidental facilities; and life insurance business. Further, it acquires, licenses, and sells industrial property rights, copyrights, and other intellectual proprietary rights; offers information processing services; develops computer software and hardware; produces, processes, and sells agricultural, forestry, and fishery products; researches, studies, and develops production related agricultural, forestry, and fishery products; offers consulting services; and operates as a non-life and car insurance agent. The company was formerly known as Tobishima Civil Engineering and changed its name to Tobishima Corporation in 1965. The company was founded in 1883 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1807.T": {
        "short_name": "WATANABE SATO CO LTD",
        "long_name": "Watanabe Sato Co., Ltd.",
        "summary": "Watanabe Sato Co., Ltd. engages in the contracting and investigation, planning, designing, supervision, technical guidance, and consultation of civil engineering construction activities. It also manufactures and sells construction materials. The company offers porous concrete and asphalt pavement, asphalt mixture, concrete pavement system, block system, resin pavement, chipping/surface treatment, top coat/coating film, sports pavement, heat shielding asphalt pavement, rainwater storage and retention penetration, disaster prevention/emergency maintenance measures construction method, freezing suppression asphalt pavement, snow melt pavements, high durability pavements, repair/maintenance products, and mixtures. In addition, it engages in the design, manufacture, leasing, and sale of construction equipment for construction work; industrial waste processing business; purchase, lease, brokerage, sale, and management of real estate properties; and others. The company was founded in 1923 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1810.T": {
        "short_name": "MATSUI CONSTRUCTION CO",
        "long_name": "Matsui Construction Co., Ltd.",
        "summary": "Matsui Construction Co., Ltd. engages in the civil engineering, architectural designing, supervising, and construction business in Japan. The company undertakes shrines, temples, and cultural property works, as well as government building, office building, education/culture, commerce/distribution/production, medical/welfare/welfare, living space, and environmental works. It is also involved in the lumber and wood processing activities; manufacturing, processing, and selling of building materials; and owing, selling, leasing, trading, and management of real estate properties. In addition, the company manages sports, tourism, and leisure facilities; and engages in buying and selling of electricity and power generation business. Further, it provides building survey, maintenance, and non-life insurance agency services. The company was founded in 1586 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1811.T": {
        "short_name": "ZENITAKA CORP",
        "long_name": "The Zenitaka Corporation",
        "summary": "The Zenitaka Corporation provides general contracting services in Japan and internationally. It is involved in the planning, design, and execution of construction activities; urban, suburban, and marine development operations; and real estate and engineering activities. The company was founded in 1705 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1812.T": {
        "short_name": "KAJIMA CORP",
        "long_name": "Kajima Corporation",
        "summary": "Kajima Corporation engages in the construction, real estate development and management, architectural and engineering design, and other activities worldwide. It provides procurement and construction services comprising sale and lease of construction equipment and materials, and subcontracting for various construction projects; ground improvement, foundation construction, and soil remediation; paving of roads, bridges, airports, etc., as well as manufacture and sale of paving materials; ocean port and coastal protection work, and geological surveying; calculation and preparation of construction plans; environmental and consulting work focused on water and waste; construction machinery manufacturing; repair and reinforcement work for civil engineering structures, and sale of repair materials; and integrated facility construction, and renovation services. The company also offers building management services; leasing and operational management services of real estate, and hotel management; and brokerage and appraisal services of real estate. In addition, it provides travel agency, product sales, and business services; temporary staffing and human resources placement, and events planning services; planning of construction projects, and building and equipment leasing; design, operation, and management of information communication technology infrastructure and various computer systems; collection, transportation, and processing of waste; public relations and advertising planning and production, as well as video production services; and real estate asset management and consulting, as well as buying, selling, and brokerage of beneficial interests of a trust. Further, the company offers book publishing; hotel, golf course, and ski resort services; and greening landscaping, mountain forest management, and agency handling services of property, casualty, and life insurance. Kajima Corporation was founded in 1840 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1815.T": {
        "short_name": "TEKKEN CORP",
        "long_name": "Tekken Corporation",
        "summary": "Tekken Corporation engages in the construction business in Japan and internationally. It constructs infrastructure projects, including roads, tunnels, bridges, water supply and sewerage facilities, revetments, etc.; railway projects, such as grade-separated intersections, tunnels, bridges, embankments, railway station buildings, train depots, etc.; and commercial buildings, schools, and medical and welfare facilities. The company was founded in 1944 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1820.T": {
        "short_name": "NISHIMATSU CONSTRUCTION CO",
        "long_name": "Nishimatsu Construction Co., Ltd.",
        "summary": "Nishimatsu Construction Co., Ltd. engages in the construction, development, real estate, and other businesses in Japan and internationally. It operates in three segments: Civil Engineering, Building Construction, and Development and Real Estate. The company's projects include offices, educational facilities, cultural facilities, hospitals, welfare facilities for senior citizens, accommodations, residential and commercial buildings, sports facilities, industrial facilities, logistics facilities, dams, railways, airports/harbors and wharfs, roads, earthworks, energy facilities, river, water supply and sewer facilities, environmental facilities, and agricultural civil engineering facilities. It is also involved in leasing and sale of real estate. The company was formerly known as Nishimatsu Gumi Co., Ltd. and changed its name to Nishimatsu Construction Co., Ltd. in July 1948. Nishimatsu Construction Co., Ltd. was founded in 1874 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1822.T": {
        "short_name": "DAIHO CORPORATION",
        "long_name": "Daiho Corporation",
        "summary": "Daiho Corporation operates as an engineering and construction company in Japan and internationally. The company operates through three segments: Civil Engineering, Building Construction, and Other. It undertakes heavy civil works, such as dams and power plants, sea ports, expressways, bridge foundations, and railways; and building works, including offices, accommodations, retail shop buildings, warehouse factories and laboratories, condominiums, education and cultural buildings, medical and welfare buildings, sports and leisure facilities, and environmental protection and cleaning facilities. The company also develops shield tunneling and concrete caisson methods; and undertakes urban tunneling projects for subway, cabling, water supply, and sewer systems. In addition, it develops environmentally friendly technologies comprising the recycling of construction waste materials and by-products, soil de-contamination, and project life cycle; and seismic technologies that protect multifamily residential and school buildings during earthquakes. Daiho Corporation was founded in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1824.T": {
        "short_name": "MAEDA CORP",
        "long_name": "Maeda Corporation",
        "summary": "Maeda Corporation operates as a building and civil engineering contractor in Japan and internationally. It operates through four segments: Building, Civil Engineering, Manufacturing, and Infrastructure Management. The company constructs public and commercial buildings, such as schools, office buildings, and hospitals, as well as provides other related services. It also undertakes civil engineering projects, including dams, railways, subways, tunnels, and subterranean works; highways and bridges; water supply systems; and hydro, thermal, and nuclear power stations. In addition, the company produces and sells construction machinery and concrete secondary products; and rents construction machinery and others. Further, it engages in the generation of electricity from solar and wind power, as well as concession operations and other related businesses. Maeda Corporation was founded in 1919 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1826.T": {
        "short_name": "SATA CONSTRUCTION CO",
        "long_name": "Sata Construction Co., Ltd.",
        "summary": "Sata Construction Co., Ltd. engages in the contracting and investigation, planning and designing, and supervision of civil engineering and other construction works in Japan. It also offers civil engineering services for highways, bridges, tunnels, dams, residential land development projects, and disaster recovery works; and extension, renovation, and remodeling of buildings and condominiums. In addition, the company manufactures, sells, and rents construction materials, equipment, and machineries; owns and leases vehicles, ships, aircrafts, and other machineries; and produces and sells gravels and wood products. Further, it engages in the industrial waste recycling and treatment; building rental and tourism; insurance agency and recruitment of life insurance; and land house selling, mediation, and lending businesses, as well as regional development, urban development, and other projects. Additionally, the company generates, supplies, and sells electricity. Sata Construction Co., Ltd. was founded in 1918 and is headquartered in Maebashi, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Maebashi"
    },
    "1827.T": {
        "short_name": "NAKANO CORPORATION",
        "long_name": "Nakano Corporation",
        "summary": "Nakano Corporation engages in the construction business in Japan, Singapore, Malaysia, Indonesia, Thailand, Vietnam, and internationally. It engages in the real estate business. The company plans, designs, and constructs educational, office, residential, commercial, industrial, and healthcare facilities, as well as leisure, religious, renovation, and public work and civil engineering projects. It also offers development assistance, as well as land and building based consulting services; engages in solar power generation and insurance agency business; and deals with technical support projects located in the Far East, Russia and the Middle East. Further, the company leases office buildings, commercial facilities, and residual units. Nakano Corporation was founded in 1933 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1828.T": {
        "short_name": "TANABE ENGINEERING CORP",
        "long_name": "Tanabe Engineering Corporation",
        "summary": "Tanabe Engineering Corporation engages in the plant construction and machinery production activities in Japan. The company offers plant engineering services, including planning, design, purchasing, construction, inspection, trial operation, delivery, and maintenance. It also engages in the design and construction of electric instrumentation and control systems, as well as the integrated construction of machinery and electricity; and provision of automated/work-saving equipment for industrial fields, such as automobile, liquid crystal, pharmaceutical, etc. Further, the company designs and produces thermal machineries/industrial furnaces. Tanabe Engineering Corporation was incorporated in 1969 and is based in Joetsu, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Joetsu"
    },
    "1832.S": {
        "short_name": "HOKKAI ELECTRICAL CONSTRUCTION",
        "long_name": "Hokkai Electrical Construction Company,Incorporated",
        "summary": "Hokkai Electrical Construction Company,Incorporated engages in the construction and maintenance of power distribution facilities in Japan. The company undertakes electrical, telecommunications, civil engineering, construction, steel structure, pipe, painting, and firefighting facility works, as well as jump and earthwork. It undertakes electrical works for distribution lines, power transmission lines, and substations. The company was founded in 1944 and is headquartered in Sapporo, Japan. Hokkai Electrical Construction Company,Incorporated is a subsidiary of Hokkaido Electric Power Company, Incorporated.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SAP",
        "market": "jp_market",
        "country": "Japan",
        "city": "Sapporo"
    },
    "1833.T": {
        "short_name": "OKUMURA CORP",
        "long_name": "Okumura Corporation",
        "summary": "Okumura Corporation engages in the civil engineering, architectural construction, and investment development businesses in Japan. The company undertakes various civil engineering projects for railways, roads, power station facilities, sewage and water works, and others; and construction projects, including houses, public facilities, medical facilities, and office buildings. It also designs, manufactures, sells, and repairs construction/industrial machines and devices; and provides real estate, land, and building management services, as well as owns rental properties, such as residential buildings, warehouses, and land in Osaka and other areas; and manufactures and sells construction machinery, materials, and others. In addition, the company generates and sells renewable electricity. The company was founded in 1907 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "1841.T": {
        "short_name": "SANYU CONSTRUCTION CO",
        "long_name": "Sanyu Construction Co.,Ltd.",
        "summary": "Sanyu Construction Co.,Ltd. engages in the construction business. It primarily undertakes building projects. The company also manufactures metal products, such as vehicle brake parts, railroad brake shoes, automotive and industrial machinery parts, 4WD parts, gas stove parts, aircraft landing systems, teak products, and construction formwork and small elevator products. In addition, it is involved in the real estate and hotel inn business, as well as builds and sells houses. The company was formerly known as Horie Koumuten and changed its name to Sanyu Construction Co.,Ltd. in 1967. The company was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1844.T": {
        "short_name": "OHMORI CO LTD",
        "long_name": "Ohmori Co.,Ltd.",
        "summary": "Ohmori Co., Ltd. primarily engages in construction business in Japan. The company undertakes upper and lower waterworks. It also constructs and sells apartments; leases OLY equipment; and sells photovoltaic power generation equipment. The company was founded in 1967 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1848.T": {
        "short_name": "FUJI P.S CORPORATION",
        "long_name": "Fuji P.S Corporation",
        "summary": "Fuji P.S Corporation engages in the construction business. The company undertakes various civil engineering works, such as construction of pre-stressed concrete (PC) road and railway bridges, tanks, and other civil engineering projects; seismic reinforcement of building structures; PC buried deck works; and PC ring and tension construction works. It also manufactures and sells civil engineering concrete products, such as PC orbit Makuragi, PC orbital floor slabs, and PC pile sheets; and architectural concrete products, such as PC beams and concrete columns. Fuji P.S Corporation was founded in 1954 and is headquartered in Fukuoka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Fukuoka"
    },
    "1850.T": {
        "short_name": "NANKAI TATSUMURA CONSTRUCTION C",
        "long_name": "Nankai Tatsumura Construction Co., Ltd.",
        "summary": "Nankai Tatsumura Construction Co., Ltd. operates as a construction company in Japan. The company undertakes civil engineering, construction, pipe, electrical, and telecommunications construction works, as well as general construction works. It also owns and sells real estate properties. The company was founded in 1923 and is headquartered in Osaka, Japan. Nankai Tatsumura Construction Co., Ltd. is a subsidiary of Nankai Electric Railway Co., Ltd.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "1852.T": {
        "short_name": "ASANUMA CORP",
        "long_name": "Asanuma Corporation",
        "summary": "Asanuma Corporation operates as a general contractor in Japan and internationally. The company undertakes a range of projects, such as schools, hospitals, hotels, water and sewer lines, and roads. Asanuma Corporation was founded in 1892 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "1861.T": {
        "short_name": "KUMAGAI GUMI CO",
        "long_name": "Kumagai Gumi Co.,Ltd.",
        "summary": "Kumagai Gumi Co., Ltd. operates as a construction company in Japan and internationally. The company constructs tunnels, roads and bridges, railways, dams, and airports/marine ports, as well as water and sewerage, environmental, energy, renewal, ICT civil engineering, housing/mansion, office/government, hotel, commercial, culture, education/research, sports/entertainment, medical/social welfare, plant, distribution, and other projects. It also engages in the production of asphalt mixture and the paving of roads, airports, ports, bridges, etc.; building renovation business, including building survey/diagnosis, antiseismic diagnosis and reinforcement, and renovation plans; construction of semiconductor plants and golf courses; and manufacture of steel products for shield tunnels and temporary construction machinery, as well as designing/producing/installing soil decontamination equipment and leasing of steel frames. In addition, the company provides construction and building plans, and applications for projects; construction education to universities and construction companies; technical support services; and insurance agency services, as well as operates as a technology trading company for construction industry. Kumagai Gumi Co., Ltd. was founded in 1898 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1866.T": {
        "short_name": "KITANO CONSTRUCTION CORP",
        "long_name": "Kitano Construction Corp.",
        "summary": "Kitano Construction Corp., a general contractor, engages in the planning, designing, management, and consulting of construction works in Japan and internationally. The company is also involved in the regional and urban development; development of resort projects; and renewable energy business. In addition, it manages golf courses, hotels, and theater and sports facilities; and provides advertising agency services. The company was formerly known as Kitano Kenchiku Kogyo Corp. and changed its name to Kitano Construction Corp. in 1948. Kitano Construction Corp. was founded in 1946 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1867.T": {
        "short_name": "UEKI CORP",
        "long_name": "UEKI Corporation",
        "summary": "UEKI Corporation operates as a general construction company in Japan. The company is involved in the design, planning, supervision, and consulting of civil engineering, pipe, pavement, and track construction; purchase, sale, leasing, management, mediation, and exchange of land and buildings; and land development business. It also engages in the manufacture, maintenance, sale, and rental of automobiles, and construction materials and equipment; and maintenance and repair of power generation facilities and equipment. The company was founded in 1885 and is headquartered in Kashiwazaki, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kashiwazaki"
    },
    "1870.T": {
        "short_name": "YAHAGI CONSTRUCTION CO",
        "long_name": "Yahagi Construction Co.,Ltd.",
        "summary": "Yahagi Construction Co.,Ltd. engages in the construction of buildings. Its works include condominiums, logistics centers, commercial facilities, office buildings, airport terminal buildings, residential site development, roadways, railways, aseismic reinforcement, and slope face reinforcement. The company is involved in planning, surveying, designing, supervising, executing, and consulting for civil engineering, architecture, and other construction projects. It also engages in the maintenance and management of buildings and structures, diagnosis and assessment of seismic resistance, etc. In addition, the company is involved in the planning, design, supervision, and consulting related to inspection and removal of environmental pollutants; and planning, construction, and maintenance of public facilities, such as roads, railroads, buildings, educational/cultural facilities, etc. Further, it purchases, sells, leases, mediates, and manages real estate, as well as provides management and consulting related to real estate investment. The company was founded in 1949 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Nagoya"
    },
    "1871.T": {
        "short_name": "P.S.MITSUBISHI CONSTRUCTION CO.",
        "long_name": "P.S. Mitsubishi Construction Co., Ltd.",
        "summary": "P.S. Mitsubishi Construction Co., Ltd. engages in the civil engineering and architecture businesses in Japan and internationally. It undertakes works of precast segment bridges, composite bridges, concrete arch bridges, and marine structures, as well as PC confined pier and H-shaped PC pile works; and architectural building construction works. The company was founded in 1952 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1879.T": {
        "short_name": "SHINNIHON CORP",
        "long_name": "Shinnihon Corporation",
        "summary": "Shinnihon Corporation operates as a construction company in Japan. The company constructs apartment buildings, government offices, hotels, office buildings, shopping centers, stores, hospitals and welfare facilities, and factories. It also develops, sells, and rents condominiums and detached houses, as well as plans and develops commercial facilities, offices, warehouses, etc. The company was founded in 1923 and is based in Chiba, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Chiba"
    },
    "1882.T": {
        "short_name": "TOA ROAD CORPORATION",
        "long_name": "Toa Road Corporation",
        "summary": "Toa Road Corporation engages in civil engineering business in Japan. The company constructs road networks and transportation infrastructure, such as expressways and national roads, as well as paving on bridges and tunnels; and enhances aged infrastructure. It also undertakes civil works, including airport projects and civil construction parts of the road projects, as well as super express, railway container yard, photovoltaic power generation, and regional contribution and disaster recovery projects. In addition, the company manufactures and sells asphalt emulsion for roads, railways, landscape, and sports facilities; asphalt mixtures; polymer modified asphalt for heavy traffic roads, porous asphalt pavements, bridge deck pavements, and cold regions; and pavement materials for various applications, such as garages and bridges. Further, it provides pavement materials for various landscaping locations comprising historical places and parks; and sports pavement materials for use in running tracks, baseball stadiums, tennis courts, bicycle racetracks, and others. Additionally, the company conducts surveying/cleaning of soil pollution; designs and builds various underground reservoirs; demolishes buildings, factories, chimneys, etc. for redevelopment projects; and provides road maintenance plans that integrate pavement maintenance techniques comprising planning, inspection/diagnosis, performance evaluation/forecasting, maintenance/rehabilitation design, etc. with asset management. The company was founded in 1930 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1885.T": {
        "short_name": "TOA CORPORATION",
        "long_name": "TOA Corporation",
        "summary": "TOA Corporation provides construction and engineering services in Japan, the Southeast Asia, and internationally. The company operates through Domestic Civil Engineering Businesses, Domestic Architectural Building Businesses, and Overseas Businesses segments. It is involved in contracting, planning, designing, executing, and supervising civil engineering and architectural works; dredging, reclamation, and land preparation activities; planning, designing, supervision, and contract works for regional, urban, and ocean development; and surveying and geological investigation activities. The company also engages in the planning, construction, and maintenance of roads, railroads, ports and harbors, airports, waterworks and sewer systems, government offices, waste disposal and treatment facilities, other public facilities, etc. In addition, it leases equipment and properties; constructs power generation facilities; and provides consulting services. The company was formerly known as TOA Harbour Works Co., Ltd. and changed its name to TOA Corporation in 1987. TOA Corporation was founded in 1908 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1887.T": {
        "short_name": "JDC CORPORATION",
        "long_name": "JDC Corporation",
        "summary": "JDC Corporation provides civil engineering and building construction works in Japan and internationally. It develops electrical power, transportation, ports and harbors, afforestation, flood control, irrigation, land reclamation, underground resources, and other development of national land; and produces, sells, loans, and repairs construction and mining machinery, other machinery, tools, etc. The company also manufactures and sells construction materials, stone materials, chemical products, etc. In addition, it engages in the sale, rental, brokerage, management, and appraisal of real estate; and ownership, rental, and management of leisure facilities, such as golf courses, ski resorts, etc. Further, the company is involved in the generation and supply of electricity, heat, etc.; and soil and water remediation in rivers, lakes, and bays, as well as the collection, transport, processing, disposal, and recycling of municipal, industrial, and construction waste. The company was founded in 1951 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1888.T": {
        "short_name": "WAKACHIKU CONSTRUCTION CO",
        "long_name": "Wakachiku Construction Co., Ltd.",
        "summary": "Wakachiku Construction Co., Ltd. engages in the construction, construction consulting, management, and real estate businesses in Japan and internationally. It is also involved in the marine development, regional and urban development, and environmental maintenance and conservation businesses. The company was founded in 1890 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1893.T": {
        "short_name": "PENTA OCEAN CONSTRUCTION",
        "long_name": "Penta-Ocean Construction Co., Ltd.",
        "summary": "Penta-Ocean Construction Co., Ltd. engages in the construction of civil engineering and building projects in Japan, Southeast Asia, and internationally. The company also constructs tunnels and subways. In addition, it is involved in the sale or rent of real estate and other activities; and shipbuilding, leasing, insurance, and environment businesses. The company was founded in 1896 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1897.T": {
        "short_name": "KANESHITA CONSTRUCTION CO",
        "long_name": "The Kaneshita Construction Co.,Ltd.",
        "summary": "The Kaneshita Construction Co.,Ltd. provides planning, survey, supervision, design, and construction services in Japan. The company engages in carrying out civil engineering works, such as roads, tunnels, bridges, river maintenance, etc., as well as public works, road pavement works, and social infrastructures; and design and construction of buildings, such as medical/welfare/commercial facilities, private homes, educational and childcare facilities, condominiums, and public and private constructions, as well as renovations, expansions, repair, and maintenance works. It also manufactures and sells construction paving materials, including asphalt mixture; and recycles industrial waste and waste asphalt into recycled asphalt mix and roadbed. The company was founded in 1935 and is headquartered in Miyazu, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Miyazu"
    },
    "1898.T": {
        "short_name": "SEIKITOKYU KOGYO CO",
        "long_name": "Seikitokyu Kogyo Co., Ltd.",
        "summary": "Seikitokyu Kogyo Co., Ltd. operates as an infrastructure building company in Japan. The company is involved in paving various roads, such as expressways and bridges. It also undertakes civil engineering, and environment and landscape projects; and manufactures and sells asphalt mixtures. The company was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1899.T": {
        "short_name": "FUKUDA CORP",
        "long_name": "Fukuda Corporation",
        "summary": "Fukuda Corporation engages in the construction business in Japan. It is involved in the contracting, planning, design, supervision, and consulting of construction works; exchanging, leasing, brokerage, and management of real estate; the construction and sale of houses; and the creation and sale of land. The company also provides regional development, urban development, and environmental improvement, as well as related contracting, planning, designing, supervising, and consulting services. In addition, it is involved in the ownership, rental, and management of accommodation facilities, sports facilities, recreation facilities, health and medical facilities, etc. Further, the company processes, sells, and rents construction materials, and equipment and machinery. Its projects comprise construction, roads, railways, ports, and energy related facilities. The company was founded in 1902 and is headquartered in Niigata, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Niigata"
    },
    "1905.T": {
        "short_name": "TENOX CORP",
        "long_name": "Tenox Corporation",
        "summary": "Tenox Corporation engages in the construction business in Japan. The company specializes in foundation works; and provides civil engineering and construction consulting services, etc. It also sells concrete piles and steel pipe piles; rents equipment; and offers contracting services for ground improvement work. Tenox Corporation was founded in 1970 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1921.T": {
        "short_name": "TOMOE CORPORATION",
        "long_name": "Tomoe Corporation",
        "summary": "Tomoe Corporation engages in the general construction, steel structures construction, and real estate businesses in Japan. The company plans, designs, manufactures, and constructs three-dimensional structures, bridges, steel frames, and steel-towers. It also purchases, manages, leases, sells, and mediates real estate properties. The company was founded in 1917 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1926.T": {
        "short_name": "RAITO KOGYO CO LTD",
        "long_name": "Raito Kogyo Co., Ltd.",
        "summary": "Raito Kogyo Co., Ltd. engages in the civil engineering contract works in Japan and internationally. It is involved in civil engineering works related to slope protection and landslide prevention, foundation and ground improvement, pile and diaphragm wall, structural repair and reinforcement, environmental restoration, and sewage system, building, and civil engineering construction, as well as other projects. In addition, the company trades in construction material and equipment, and office equipment; and sells and leases vehicles, and office, construction, and homecare equipment. Further, it operates care houses; and provides temporary staffing, elderly care, and life and non-life insurance agency services. The company was formerly known as Raito Bosui Kogyosho Co., Ltd. and changed its name to Raito Kogyo Co., Ltd. in 1951. Raito Kogyo Co., Ltd. was founded in 1943 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1929.T": {
        "short_name": "NITTOC CONSTRUCTION CO",
        "long_name": "Nittoc Construction Co., Ltd.",
        "summary": "Nittoc Construction Co., Ltd. engages in specialized construction works in Japan. The company undertakes disaster prevention and environmental conservation works, such as re-vegetation, temporary anchor, river and shore embankment protection, slope protection, landslide protection, rock slope failure prevention, anchoring, retaining wall, and structure diagnosis works. It also provides urban regeneration services, including ground improvement, piling, reinforcement and foundation, industrial waste recycling, liquification prevention measuring, and anchoring services, as well as foundation treatment of waste disposal site; and maintenance and renovation services comprising slope reinforcement, concrete structures diagnosis and investigation, concrete structure upgradation, rock slope diagnosis, existing structures reinforcement, and repairing and structural improvement services. In addition, the company offers civil engineering, construction consultancy, grouting, applied engineering, and shield and pipe jacking services, as well as survey, geological survey, and design services. Nittoc Construction Co., Ltd. was founded in 1947 and is headquartered in Tokyo, Japan. Nittoc Construction Co., Ltd. is a subsidiary of AN Holdings Co., Ltd.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1930.T": {
        "short_name": "HOKURIKU ELECTRICAL CONSTRUCTIO",
        "long_name": "Hokuriku Electrical Construction Co.,Ltd.",
        "summary": "Hokuriku Electrical Construction Co.,Ltd. engages in the construction business in Japan. The company undertakes electrical contracting, ventilating and air conditioning, telecommunication, plumbing, firefighting facility, and steel structure works. It also offers offers electrical, steam, and other energy related services; and sells, leases, and manages real estate properties. The company was founded in 1944 and is headquartered in Toyama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Toyama"
    },
    "1934.T": {
        "short_name": "YURTEC CORPORATION",
        "long_name": "Yurtec Corporation",
        "summary": "Yurtec Corporation operates as a facility engineering company in Japan and internationally. It undertakes construction, maintenance, and repair works of electric power equipment; electric, air conditioning, water supply and drainage, and information communication equipment works at various facilities; and civil engineering, construction, and renovation works. The company provides its services to urban buildings, hospitals, hotels, cultural facilities, and private homes. The company was founded in 1944 and is headquartered in Sendai, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Sendai"
    },
    "1939.T": {
        "short_name": "YONDENKO CORP",
        "long_name": "Yondenko Corporation",
        "summary": "Yondenko Corporation engages in the electrical, and electrical power transmission and distribution facilities construction activities in Japan. The company is involved in the construction of building, public, and factory electrical facilities; air conditioning systems; water supply, drainage, and sanitary plumbing systems; water treatment systems; facilities and equipment for telecommunications; and disaster and crime prevention facilities. It also constructs overhead power transmission and distribution facilities; underground power transmission and distribution facilities; civil engineering projects; and solar power generation facilities, as well as information and communications equipment. In addition, it is involved in the private finance initiative business; public private partnership; development and sale of CAD software for building equipment; solar power business; and power pole advertising activities. The company was formerly known as Shikoku Electric Construction Corporation and changed its name to Yondenko Corporation in November 1989. Yondenko Corporation was founded in 1963 and is headquartered in Takamatsu, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Takamatsu"
    },
    "1941.T": {
        "short_name": "CHUDENKO CORP",
        "long_name": "Chudenko Corporation",
        "summary": "Chudenko Corporation operates as an equipment engineering company in Japan. It undertakes electrical works, such as light/outlet, image/sound/TV/broadcast, power receiving/transforming, and plant equipment works; energy-related works comprising wind/solar power generation, cogeneration, energy-saving power, and private power generation system works; and environment-related works, including recycling and heat storage system works. The company also undertakes electric line/distribution line/leading wire/underground line works; and office/household water and sewerage, and industrial water and sewerage facilities works, as well as constructs, maintains, and repairs roads and architecture. In addition, it is involved in the Internet/Intranet, CATV/community wireless system/telephone, LAN, optical and mobile communication, and OA floor equipment, as well as system integration and integrated information wiring works; air-conditioning/cooling, heating/water supply, drainage/sanitation/environment equipment, and clean room system works; and fire-alarm, theft monitoring/alarm, and firefighting/evacuation guidance equipment works. Further, the company engages in building equipment renewal and housing renovation works, as well as pylon works; designs, produces, sells, repairs, installs, and maintains electrical equipment, such as distribution boards, supervisory panels, control boards, power source equipment, communication devices, heavy current devices, various measuring devices, and others; and plans, develops, sells, rents, operates, and maintains software and information processing systems. Additionally, it provides consulting and maintenance services consisting of energy saving diagnosis/support services, as well as disaster prevention and firefighting equipment inspection services. The company was founded in 1944 and is headquartered in Hiroshima, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Hiroshima"
    },
    "1942.T": {
        "short_name": "KANDENKO CO LTD",
        "long_name": "Kandenko Co.,Ltd.",
        "summary": "Kandenko Co.,Ltd. operates as a general infrastructure company in Japan. It engages in the facility installation works, electrical equipment sale, real estate rental and leasing, and electric power sale, as well as electrical, plumbing, and various other works. The company also undertakes works on electrical facilities and equipment inside various types of buildings and structures, building interiors, and control equipment; and environmental facilities and systems, and renovation works on air conditioning and sanitation systems, as well as water, heat, and disaster prevention systems. In addition, it is involved in the installation and maintenance of information and telecommunications systems; laying of optical fiber cables for telecommunications providers; installation of optical transmission equipment; and building and maintenance of transmission base stations for mobile communications and networks for cable TV and municipalities, as well as maintenance of telecommunications facilities for electric power providers. Further, the company undertakes the construction and maintenance of overhead power distribution lines facilities comprises power poles with power cables; and underground distribution lines facilities consisting of underground power cables. Additionally, it engages in the power stations and substations, underground and overhead transmission lines, and civil engineering works; designs and constructs power plants, as well as generates solar and wind power; and inspects and maintains nuclear power plant facilities and equipment. Kandenko Co.,Ltd. was founded in 1944 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1944.T": {
        "short_name": "KINDEN CORPORATION",
        "long_name": "Kinden Corporation",
        "summary": "Kinden Corporation operates as an integrated electrical and facility engineering company in Japan. It plans, designs, develops, constructs, and maintains electrical systems, such as solar and wind farm power generation systems, water treatment plant and incineration plant electrical systems, and cogeneration systems; high voltage power reception and transformer electrical system, main feeder and control panel, CVCF and UPS, regular/emergency power generation, and DC power supply systems; electrical equipment systems for residential use; and power station, substation, and overhead and underground power transmission and distribution lines. The company also undertakes overhead and underground line incoming, power distribution automation, watt-hour metering, and common trench for cable works for electrical power supply; constructs building automation and energy management systems; designs and supplies measurement and analysis equipment; and offers process/factory automation and facility monitoring and control systems. In addition, it offers designs, installs, and maintains Internet, Intranet, LAN, telephone, video transmission and display equipment, information processing facility, and security system; and wide area information communication equipment. Further, the company provides air conditioning, air purification, ventilation, and supply and wastewater sanitation systems; exhaust heat recovery, radiation air-conditioning, ground thermal energy, and thermal storage air-conditioning systems; waste water treatment and emission treatment systems; and clean room and interior system products, as well as develops infrastructure for civil engineering and landscaping works. It also offers air conditioning and sanitation systems equipment, and electrical systems equipment diagnosis; and develops, constructs, and maintains wind turbine generation and photovoltaic power generation optimization systems. Kinden Corporation was founded in 1944 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "1946.T": {
        "short_name": "TOENEC CORP",
        "long_name": "Toenec Corporation",
        "summary": "Toenec Corporation, an integrated facility company, engages in the construction and improvement of social infrastructure in the energy, environment, and information technology fields in Japan. The company constructs electricity distribution routes; underground power lines; indoor electrical equipment that supports building functions and factory production systems; and broadband networks, such as transmission equipment, telecommunication related, FTTH, and infrastructure construction, as well as provides information and telecommunication equipment construction services. It also deploys infrastructure for mobile telecommunications equipment comprising the construction of mobile telephone base stations; constructs air conditioning and ground water usage systems; designs, constructs, and maintains sanitary equipment and water treatment facilities, and energy projects for public services; and supplies water for buildings and factories, and heat for building air conditioning. In addition, the company engages in the fire-control system construction; scaffolding, earthworks, concrete, painting, waterproofing, and interior finishing works; and procurement, manufacture, sale, and leasing of control equipment, lighting equipment, wiring materials, electrical appliances, furniture, kitchen equipment, medical equipment, health and hygiene equipment, home-care devices and goods, fitness equipment, sporting goods, apparel, sundry items, building plant and equipment, air-conditioning equipment, compressors, electrical communication equipment, computer systems, data terminals, and related parts. Further, the company provides freight vehicles; sells, leases, and manages real estate; invests and finances in other companies; and dispatches manpower. The company was founded in 1944 and is headquartered in Nagoya, Japan. Toenec Corporation is a subsidiary of Chubu Electric Power Company, Incorporated.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Nagoya"
    },
    "1948.T": {
        "short_name": "KODENSHA CO LTD",
        "long_name": "The Kodensha Co., Ltd.",
        "summary": "The Kodensha Co., Ltd. engages in the construction business in Japan. It constructs power plants, power transmission lines, high-rise buildings, houses, schools, hospitals, and factories. It also engages in design and construction of power receiving and transforming, power generation, power, lighting, communication information, monitoring / control, disaster prevention / security equipment, etc. in buildings, factories, condominiums, etc.; highway lighting and lighting work for various sports facilities; and aviation sign equipment construction. The company also undertakes construction, renewal, and maintenance works of transmission line facilities for electric power companies. In addition, it sells general-purpose electrical equipment, air conditioning equipment, elevator equipment, building equipment, security equipment, video surveillance systems, low temperature equipment, industrial mechatronics equipment, FA equipment, building management systems, etc. The company was founded in 1910 and is headquartered in Tokyo, Japan. The Kodensha Co., Ltd. is a subsidiary of Mitsubishi Electric Corporation.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1949.T": {
        "short_name": "SUMITOMO DENSETSU CO",
        "long_name": "Sumitomo Densetsu Co.,Ltd.",
        "summary": "Sumitomo Densetsu Co.,Ltd. operates as a construction company in Japan, Indonesia, Thailand, Cambodia, Myanmar, the Philippines, China, and Malaysia. It constructs overhead and underground power transmission, electrical substations, and electrical power distribution systems; and constructs interconnected systems to supply electricity from new energy facilities, including photovoltaic, wind, and hydroelectric power stations. The company also engages in the construction of photovoltaic, redox flow battery, and biomass power-generating systems; provision of engineering services for various systems, such as electrical work and electrical instrumentation in factories and plants; and establishment of facility management system and building energy management and automation systems. In addition, it is involved in the consultation, system design, construction, operation, and maintenance of communication/broadcasting infrastructure; and the design, establishment, operation, and maintenance of information networks for various companies, universities, hospitals, data centers, etc. Further, the company engages in the planning, construction, and maintenance of plant machines used in various manufacturing plants, air-conditioning and plumbing systems in factories, office buildings, and hotels. The company was formerly known as Taiyo Kudo Construction Co., Ltd. and changed its name to Sumitomo Densetsu Co., Ltd. in July 1985. Sumitomo Densetsu Co.,Ltd. was founded in 1947 and is headquartered in Osaka, Japan. Sumitomo Densetsu Co.,Ltd. is a subsidiary of Sumitomo Electric Industries, Ltd.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "1951.T": {
        "short_name": "KYOWA EXEO CORP",
        "long_name": "Kyowa Exeo Corporation",
        "summary": "Kyowa Exeo Corporation provides telecommunication carrier, urban infrastructure, and system solutions worldwide. It plans, designs, installs, operates, and maintains various telecommunications equipment of telecom carriers, such as access networks fiber optic cables, network facilities, electric power equipment, outdoor and indoor mobile communication base station, and base station equipment. The company also constructs and maintains CATV cables, railroad communication network, elimination of utility poles, underground utilities, electrical facilities, data centers, photovoltaic plants, wastes treatment facilities, and biomass boilers. In addition, theit engages in the development, maintenance, and operation of cloud-based enterprise communications network systems and various enterprise systems for telecom carriers for finance and manufacturing sectors. The company was formerly known as Kyowa Densetsu Kaisha, Ltd. and changed its name to Kyowa Exeo Corporation in May 1991. Kyowa Exeo Corporation was founded in 1954 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1954.T": {
        "short_name": "NIPPON KOEI CO",
        "long_name": "Nippon Koei Co., Ltd.",
        "summary": "Nippon Koei Co., Ltd. provides engineering consulting and electric power engineering services in Japan and internationally. Its Domestic Consulting Operations segment offers site surveying, planning, evaluation/assessment, designing, construction management, and operational advisory services in the fields of water resources development, energy development, agricultural development, transportation, urban and regional development, management of natural and social environment, etc. The company's International Consulting Operations segment provides technical studies, planning, reviews, designing, construction supervision, operational advisory services in the fields of water resources development, energy development, agricultural development, transportation, urban and regional development, social development, management of natural and social environment, etc. Its Power Engineering Operations segment manufactures and sells control devices and systems for power generating and transforming stations, water turbines, power generators, voltage converters, electric power related equipment. This segment also engages in designing and implementation of various construction works for electric power and general electric facilities, including construction for power generation/transformation/transmission/distribution and civil engineering. The company's Urban & Spatial Development Operations segment is involved in the urban and spatial development business that includes urban planning and architectural design. Its Energy Business Operations segment engages in the research, development, design, construction, management, operation, support, and system/technology development of power generation/energy management operations utilizing distributed energy resources. The company's Real Estate Leasing Operations segment leases real estate properties in Japan. Nippon Koei Co., Ltd. was founded in 1946 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1959.T": {
        "short_name": "KYUDENKO CORP",
        "long_name": "Kyudenko Corporation",
        "summary": "Kyudenko Corporation engages in the design, construction, and maintenance of electrical facilities in Japan. It offers various types of electrical system installations in public and commercial facilities, such as buildings, factories, schools, hospitals, etc. The company also designs and constructs heating, ventilation, and air conditioning installations and plumbing products in public and commercial facilities, including buildings, factories, schools, hospitals, etc.; and various types of infrastructure development facilities comprising community drainage, water supply and sewerage, waste water treatment, and total energy management saving systems. In addition, it designs and constructs infrastructure development facilities that include information and telecommunication instruments in factories and buildings, and cable television and base stations for mobile communications, as well as installs local area network. Further, the company provides power distribution and underground power facilities consisting of power poles, and overhead and underground distribution lines, as well as lines to homes, electric power meters, etc.; and surveys, designs, and constructs renewable energy facilities, as well as generates solar power and wind power. Kyudenko Corporation was founded in 1944 and is headquartered in Fukuoka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Fukuoka City"
    },
    "1960.T": {
        "short_name": "SANYO ENGINEERING & CONS INC",
        "long_name": "Sanyo Engineering & Construction Inc.",
        "summary": "Sanyo Engineering & Construction Inc. engages in the electric facility construction business in Tokyo and internationally. The company designs and constructs electrical and instrumentation equipment in various buildings and production facilities, and environment-related and private finance initiative businesses; power generation equipment; and air conditioning and ventilation equipment, and fire extinguishing equipment, as well as water supply, drainage, and sanitary equipment in office buildings, commercial facilities, entertainment facilities, hotels, condominiums, medical and welfare facilities, school and research facilities, road and harbor facilities, and various production facilities. It also renovates electric, air conditioning, and sanitary equipment in various facilities, as well as handles environment related business, including energy saving, eco multi heat pump systems, and ESCO. In addition, the company undertakes electric power transmission, electric power generation and substation, underground line, electric power distribution, and wind-power generation equipment works, as well as develops technical development and applied products. Further, it is involved in the information and communication related works comprising iron communication tower, steel pipe pole, mobile phone base station, and communication station house equipment works; design and construction of optical fiber and metal communication lines; civil engineering and steel structural works; painting, interior finishing, and survey works; and production and sale of electric equipment, as well as the provision of construction consultancy and worker dispatch services. Additionally, the company designs, constructs, and maintains electrical and mechanical equipment works for various facilities; and designs and fabricates high and low voltage distribution panels, power and control panels, and safety grounding tools for overhead electric lines; and buys, sells, rents, and manages real estate properties. Sanyo Engineering & Construction Inc. was founded in 1937 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1961.T": {
        "short_name": "SANKI ENGINEERING CO",
        "long_name": "Sanki Engineering Co., Ltd.",
        "summary": "Sanki Engineering Co., Ltd. provides various social infrastructure services in Japan and internationally. The company provides facilities construction services in the areas of HVAC (heating, ventilation, and air conditioning) and plumbing services for buildings, which cover HVAC systems, water supply and drainage plumbing, disaster prevention systems, kitchen systems, district heating and cooling plants, and nuclear power related facilities. It also provides facilities construction services in the areas of industrial HVAC systems, which cover semiconductor and flat panel display manufacturing systems; and manufacturing facilities for medical, pharmaceutical, and food products, as well as environmental control, and freezing and refrigeration. In addition, the company provides services in the areas of electrical systems, telecommunications, and civil engineering services; smart building solutions comprising central monitoring and automated control systems, ICT systems, crisis management solutions, IP-phone systems, and security systems; and facility system, which cover dealing room facilities for financial institutions, relocation projects, and business continuity management. Further, it provides services in the areas of machinery systems that include factory automation and clean conveyance, material handling, airport baggage and cargo handling, control and information, and standard conveyor systems; and environmental systems, including water supply/sewage treatment facilities, general and industrial waste treatment and recycling systems, and environmental facilities for industries, as well as plant facilities for the food, chemical, and other industries. Additionally, the company leases land and building; and provides building maintenance and management services. Sanki Engineering Co., Ltd. was founded in 1925 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1963.T": {
        "short_name": "JGC HOLDINGS CORPORATION",
        "long_name": "JGC Holdings Corporation",
        "summary": "JGC Holdings Corporation, together with its subsidiaries, provides engineering, procurement, and construction services for various plants and facilities. It operates in two segments, Total Engineering and Functional Materials Manufacturing. The company is involved in the design, procurement, construction, and performance test services of plant and machinery for petroleum, petroleum refining, petrochemicals, gas chemicals, nuclear energy, metal refining, biochemical, food, pharmaceuticals, medicals, logistics, information technology, environment conservation, and pollution control. It also manufactures and distributes chemicals and catalyst products, including FCC catalysts, hydrotreating catalysts, deNOx catalysts, petrochemical catalysts, etc.; functional material products, such as colloidal silica, coating materials for surface treatment on cathode ray tubes, material for semiconductors, cosmetic products, etc.; and fine ceramic products, as well as environment, energy and resources, and social science consulting services. It serves in Japan, East and Southeast Asia, the Middle East, Africa, North America, and internationally. The company was formerly known as JGC Corporation and changed its name to JGC Holdings Corporation in October 2019. JGC Holdings Corporation was founded in 1928 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "1965.T": {
        "short_name": "TECHNO RYOWA LTD",
        "long_name": "Techno Ryowa Ltd.",
        "summary": "Techno Ryowa Ltd. engages in the design, construction, and maintenance of environmental control systems in Japan. The company offers industrial equipment, including clean systems, temperature/humidity control systems, energy/resource conservation equipment, spot air conditioning systems, industrial waste water/air treatment facilities, refrigeration/low-temperature equipment, clean effluent processing plants, production process operations, and nuclear power-related equipment. It also provides general building equipment comprising general air conditioning equipment, plumbing systems, disaster prevention/fire extinguishing systems, waste water treatment systems, district cooling/heating products, and co-generation systems. In addition, the company is involved in the provision of equipment maintenance services, such as equipment diagnosis and overhaul maintenance; design/construction of building ancillary equipment; and manufacture/sales of related machinery. The company was founded in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1966.T": {
        "short_name": "TAKADA CORPORATION",
        "long_name": "Takada Corporation",
        "summary": "Takada Corporation, a general plant construction company, designs, procures, manufactures, constructs, and maintains industrial facilities in Japan and internationally. The company constructs steel manufacturing plants; oil/natural gas plants; nuclear energy plants; and environmental plants comprising waste and sewage treatment facilities, as well as designs, manufactures, and constructs equipment, machines, and piping work for chemical plants. It also provides engineering and plant diagnosis services. In addition, the company offers electronic equipment, including ultrasonic cutting, polish cut, single wafer wet processing, and batch process automated wafer cleaning systems, as well as dicing frame cleaners and IPA vapor dryers. Takada Corporation was founded in 1940 and is headquartered in Kitakyushu, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kitakyushu"
    },
    "1967.T": {
        "short_name": "YAMATO CORPORATION",
        "long_name": "Yamato Corporation",
        "summary": "Yamato Corporation engages in construction business in Japan. It constructs air conditioning and hygiene facilities; civil engineering; and refrigeration, as well as designs, constructs, and manages water and sewerage, and water treatment facilities. The company's project portfolio includes office and government buildings, stores, medical and welfare facilities, hotels, inns, leisure and hot bathing facilities, food supermarkets, and factories and warehouses. It serves pipe construction, water supply facilities construction, civil engineering, electric construction, telecommunication construction, landscape construction, machine equipment installation work, steel structure construction, home work construction, firefighting facility construction, and cleaning facility construction industries. The company was formerly known as Yamato Setsubi Kogyo K.K. and changed its name to Yamato Corporation in 2000. Yamato Corporation was founded in 1945 and is headquartered in Maebashi, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Maebashi"
    },
    "1969.T": {
        "short_name": "TAKASAGO THERMAL ENGINEERING CO",
        "long_name": "Takasago Thermal Engineering Co., Ltd.",
        "summary": "Takasago Thermal Engineering Co., Ltd. designs, constructs, manufactures, and installs HVAC systems in Japan and internationally. It also offers air conditioning, cleanrooms and associated systems, district heating and cooling facilities, plumbing and drainage, co-generation, electrical, automatic control, communication, equipment diagnosis/failure diagnosis, and dehumidifying/drying systems. In addition, the company provides HVAC systems for nuclear energy facilities, high precision HVAC systems, waste vacuum transfer facility, discharged-heat recovery systems, heating/cooling systems, refrigerating/freezing systems, and other types of environmental control and thermal engineering systems. Further, it is involved in coordination for construction work, labor dispatch business, security business, cleaning business, energy supply, power generation, and water treatment activities. The company engages in the purchase and sale, brokerage, lease, and management of real estate; business related to greenhouse gas emission rights trading; consulting services, energy saving, and environmental measures services; and manufacture, sale, import, and export of machinery, equipment, and various materials. The company was formerly known as Takasago Heating Works Co., Ltd. and changed its name to Takasago Thermal Engineering Co., Ltd. in 1943. Takasago Thermal Engineering Co., Ltd. was founded in 1923 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1976.T": {
        "short_name": "MEISEI INDUSTRIAL CO",
        "long_name": "MEISEI INDUSTRIAL Co.,Ltd.",
        "summary": "MEISEI INDUSTRIAL Co.,Ltd. operates as a construction works company in Japan and internationally. It operates in two segments, Construction Business and Boiler Business. The company offers hot and cold insulation systems, including the Keical-Ace Super-Silica, which is used in various fields as a primary hot insulation material; the Keical-Ace Win for rust prevention of heat-insulated objects; and the Recycal, a recycled calcium silicate insulation material. It also undertakes liquefied natural (LNG) gas and petroleum gas related insulation works comprising on-site liquefaction equipment, low-temperature liquefaction carriers, and domestic storage facilities; furnace and refractory insulation works for industrial furnaces, incinerators, and boiler ducts; and insulation works for nuclear power plants. In addition, the company provides fireproofing products, such as Pyrocrete 241, a cement-based fireproofing material; Thermolag 3000, an epoxy-type fireproofing material; Mandoseal; and Fendolite M II Marine Mandolite 25/40. Further, it is involved in the repair and reinforcement of concrete structures; construction of incinerator facilities; repair of stack inner linings and stack reconstruction; and provision of acoustic insulation products. Additionally, the company offers various materials used in insulation related work, such as processed polyurethane foams, insulation panels for LNG carriers, molded polyurethane foams, metal insulation products, light anti-corrosion coatings, and calcium silicate insulation materials. It also provides Grapple Zinc Primer, a heavy duty anticorrosion coating for steel structures; and ULVA Shield, a polymeric rubber sheet for the thermal insulation of piping, vessels, and equipment, as well as manufactures and installs boilers. The company was founded in 1944 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "1982.T": {
        "short_name": "HIBIYA ENGINEERING",
        "long_name": "Hibiya Engineering, Ltd.",
        "summary": "Hibiya Engineering, Ltd., together with its subsidiaries, provides various engineering products and services primarily in Japan. The company operates in three segments: Construction, Equipment Sales, and Equipment Manufacturing. It offers a range of services comprising planning, design, and installation of air conditioning, sanitary, electrical, plumbing, and information and communications equipment, as well as maintenance, management, and upgrading activities. The company also undertakes building and public works design and construction; and building and building system maintenance and management, building security, and cleaning activities. In addition, it engages in the manufacture and sale of construction and sanitary equipment; development, design, installation, sale, and maintenance of building security systems; and provision of consulting services. The company was founded in 1966 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1997.T": {
        "short_name": "AKATSUKI EAZIMA CO LTD",
        "long_name": "Akatsuki Eazima Co., Ltd.",
        "summary": "Akatsuki Eazima Co., Ltd. engages in the energy conservation and renewal businesses in Japan. It is also involved in the air conditioning renovation works, energy management construction, energy-saving lighting fixture renovation, and solar control film construction. In addition, the company engages in the construction, maintenance, and renewal of mechanical, electrical, and architecture related equipment; nuclear power related facility construction; survey, design, construction, and renewal of constructions; water and sewer construction works; civil engineering construction works; landscape construction activities; and golf course sprinkling equipment construction. In addition, it is involved in maintenance/management of building facilities, equipment, and electricity; maintenance of residential building facilities; and conduit repair works. Akatsuki Eazima Co., Ltd. was founded in 1952 and is headquartered in Mito, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Mito"
    },
    "1999.F": {
        "short_name": "SAITA HOLDINGS",
        "long_name": "Saita Corporation",
        "summary": "Saita Corporation engages in the construction and crushed stone businesses in Japan. It undertakes various civil work projects, such as roads, rivers, land construction, water and sewerage, agricultural civil engineering, and disaster restoration. The company also produces and sells liquors, sake, and shochu; and sells imported goods and HFC products. In addition, it engages in water treatment, security, and cargo transportation businesses. Saita Corporation was founded in 1923 and is based in Asakura, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FKA",
        "market": "jp_market",
        "country": "Japan",
        "city": "Asakura"
    },
    "2311.T": {
        "short_name": "EPCO CO LTD",
        "long_name": "EPCO Co.,Ltd.",
        "summary": "EPCO Co.,Ltd. provides construction design and equipment related services to housing and construction companies in Japan. The company offers various designing services, such as water supply and drainage facility, electrical equipment, rain gutter, housing equipment, and energy-saving equipment design services; design and application agency services; and supporting services. It also provides housing management services, including operation of a call center for a housing company that handles various repairs for housing; and system development solutions for the housing-related businesses, as well as photovoltaic system related services. EPCO Co.,Ltd. was founded in 1990 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "2PW.F": {
        "short_name": "HAZAMA ANDO CORP.",
        "long_name": "Hazama Ando Corporation",
        "summary": "Hazama Ando Corporation engages in the construction and construction-related business in Japan and internationally. The company offers civil engineering and building construction services, including surveys, measurements, planning, designing, executing, supervising, technical guidance contract, commissioning, and consulting services. Its projects include offices, production and distribution facilities, medical and welfare facilities, educational and research facilities, cultural and sports facilities, commercial and leisure facilities, traditional facilities, housing complexes, and other buildings; and dams, water/sewer systems, tunnels, roads and land reclamation, bridges, airports, and other public works, as well as renewal, urban civil engineering, civil engineering structure, offshore engineering, and other projects. The company also provides real estate transaction services; and owns and uses real properties and securities. In addition, it undertakes soil survey and purification works, such as the collection, handling, and disposal of waste, as well as related consulting services; and offers planning, designing, and consulting services related to area and urban development, environmental improvements, etc. Further, the company is involved in power generation; and electricity, thermal, and other energy supply activities. Additionally, it sells construction materials, machinery, and appliances; develops, licenses, and sells software; and provides building maintenance and security services. The company was formerly known as Hazama Corporation and changed its name to Hazama Ando Corporation in April 2013. Hazama Ando Corporation was founded in 1873 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3431.T": {
        "short_name": "MIYAJI ENGINEERING GROUP INC",
        "long_name": "Miyaji Engineering Group,Inc.",
        "summary": "Miyaji Engineering Group,Inc., through its subsidiaries, engages in the construction and civil engineering activities in Japan. The company produces, erects, installs, maintains, and repairs bridges, steel frames, and other steel structures; designs and produces prestressed concrete; and constructs, manages, and assembles steel frames, steel towers, and large space structures. It sells bolts and welding materials; and provides staffing and other services. The company was founded in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3443.T": {
        "short_name": "KAWADA TECHNOLOGIES INC",
        "long_name": "Kawada Technologies, Inc.",
        "summary": "Kawada Technologies, Inc. engages in the steel, civil engineering, architecture, and IT service sectors in Japan and internationally. The company's Steel Construction segment fabricates and erects steel bridges, and building structures/steel structures, as well as offers steel and concrete composite decking systems. Its Civil Engineering segment constructs pre-stressed concrete bridges, prebeam bridges, half-precast structures, and precast concrete beams and pillars, as well as provides bridge repair and maintenance services. The company's Architecture segment offers general construction services, pre-engineered metal buildings, roof-top and ground planter systems, and VE panels; GEOneo, an air conditioning system; and Eco-Tank, a rainwater underground storage tank system. Its Other segment provides civil engineering and ICT solutions services; bridge and road assembly parts; helicopter and airplane flight services, such as scheduled commuter passenger flights, sightseeing tours, chartered flights, and medical and rescue flights; life-sized humanoid biped robots; and industrial robots. Kawada Technologies, Inc. was founded in 1922 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4642.T": {
        "short_name": "ORIGINAL ENGINEERING",
        "long_name": "Original Engineering Consultants Co., Ltd.",
        "summary": "Original Engineering Consultants Co., Ltd. provides engineering consultancy services in Japan. The company offers various consulting services, such as prefeasibility study, investigation, planning, detailed design, diagnosis, construction supervision, and relevant services in the fields of water supply, wastewater collection systems, wastewater and sludge treatment, waste management, septic tank planning, urban runoff control planning, water related BOP business coordinating, sewerage works, industrial wastewater, night soil treatment, refusal disposal, stream pollution, rain over flood control, and sanitation and solid waste treatment. It also undertakes various projects in other Asian countries, the Pacific Islands, the Middle East, and South America. Original Engineering Consultants Co., Ltd. was founded in 1962 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4673.T": {
        "short_name": "KAWASAKI GEOLOGICAL ENGINEER",
        "long_name": "Kawasaki Geological Engineering Co., Ltd.",
        "summary": "Kawasaki Geological Engineering Co., Ltd. provides geological survey services in Japan and internationally. It also provides ocean, resources, and energy; disaster prevention/reduction; maintenance; analysis/design; and research and development services. The company was formerly known as Kawasaki Boring Co., Ltd. and changed its name to Kawasaki Geological Engineering Co., Ltd. in August 1970. Kawasaki Geological Engineering Co., Ltd. was founded in 1943 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4748.T": {
        "short_name": "KOZO KEIKAKU ENGINEERING INC",
        "long_name": "Kozo Keikaku Engineering Inc.",
        "summary": "Kozo Keikaku Engineering Inc. provides IT services in the information and communication, construction, manufacturing, and decision-making support fields in Japan. The company offers base isolation, vibration control, seismic damping, structural design and supervision of super-high-rise buildings disaster preparedness, and disaster mitigation services. It is also involved in software development for system development projects, such as large scale mobile communications, bus operations control, mobile inspection, examination of next generation wireless telecommunication system, radio wave propagation analysis, and electromagnetic field analysis consulting, as well as sells related products in the information and telecommunication field. In addition, the company offers quality management, design support, scheduling optimization, and logistics analysis solutions. Further, it conducts scientific studies in evacuation planning, risk communication, behavior evaluation, and housing history management services in the decision-making support field. The company was founded in 1956 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4750.T": {
        "short_name": "DAISAN CO LTD",
        "long_name": "Daisan Co., Ltd.",
        "summary": "Daisan Co., Ltd. develops, manufactures, assembles, and sells scaffolding equipment for temporary construction and other related services in Japan. It also provides setting up and removing services for wedge lock scaffolding equipment; and accepts customized and special product specification orders from clients. Daisan Co., Ltd. was founded in 1975 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "5070.T": {
        "short_name": "DRAFT INC",
        "long_name": "DRAFT Inc.",
        "summary": "Draft Inc. provides design services related to space creation. The company is involved in office design, shop design, layout and space planning and execution, commercial building brand consulting, office relocation, and consulting for new project; furniture design, layout and space planning and execution, equipment and interior design; and import, export, and sale of furniture, office furniture, and accessories. It also offers website strategy management support, graphic design, advertisement design, and 3D and 2D design services. The company provides its commercial space design services for hotels and mixed-use buildings, architectural design, and product design. Draft Inc. was founded in 2008 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Shibuya-Ku"
    },
    "5279.T": {
        "short_name": "NIHON KOGYO CO LTD",
        "long_name": "Nihon Kogyo Co., Ltd.",
        "summary": "Nihon Kogyo Co., Ltd. engages in the civil engineering, landscape, and exterior and gardening businesses in Japan. It undertakes various civil engineering projects, including roads, rivers, sewage, and residential lands development. The company also manufactures, processes, and sells various concrete products, such as box culvert, culvert, rainwater storage/disaster prevention and mitigation, retaining wall, road, electric wires undergrounding, waterway, river, architecture, special concrete, and breeding reef/seaweed bed reef products. In addition, it offers paving materials/floating floor/floating floor construction products, plants furniture, street furniture, and other products for parks, towns, and various public facilities. Further, the company provides lifestyle, garden, stacking, and bedding products; and infrastructure projects management services. Nihon Kogyo Co., Ltd. was founded in 1945 and is headquartered in Sanuki, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Sanuki"
    },
    "5911.T": {
        "short_name": "YOKOGAWA BRIDGE HOLDINGS CORP",
        "long_name": "Yokogawa Bridge Holdings Corp.",
        "summary": "Yokogawa Bridge Holdings Corp. constructs infrastructure projects in Japan and internationally. The company designs, fabricates, and erects steel bridge projects; and maintains, repairs, and retrofits existing structures. It is also involved in the supply of structural steel buildings for factories, storehouses, shops, and sports facilities; fabrication of port and offshore structures; and construction of high-rise buildings and dome-type sports stadiums based on bridge erection technology. In addition, the company supplies metal frames for use in the production of semiconductors and LED panels; provides software for the total design system for steel bridges and simulation systems for the erection of steel structures, etc.; and researches and develops anti-seismic devices. Yokogawa Bridge Holdings Corp. was founded in 1907 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "5915.T": {
        "short_name": "KOMAIHALTEC INC",
        "long_name": "Komaihaltec Inc.",
        "summary": "Komaihaltec Inc. designs and constructs steel bridges, steel framework, and wind energy generating systems. The company also manufactures and installs construction machinery. In addition, it develops, constructs, and installs a 300kW wind turbine system; and develops solar systems. The company was founded in 1868 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "5918.T": {
        "short_name": "TAKIGAMI STEEL CONSTRUCTION CO",
        "long_name": "The Takigami Steel Construction Co., Ltd.",
        "summary": "The Takigami Steel Construction Co., Ltd. designs, manufactures, and constructs bridges, steel frames, steel towers, and other steel structures primarily in Japan. The company was founded in 1895 and is headquartered in Handa, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Handa"
    },
    "5923.T": {
        "short_name": "TAKADA KIKO STEEL CONSTRUCTION ",
        "long_name": "TAKADAKIKO (Steel Construction) CO.,LTD.",
        "summary": "TAKADAKIKO (Steel Construction) CO., LTD. engages in the construction business in Japan. The company designs, produces, and installs steel bridges, such as road and railway bridges, steel frames, and school gymnasiums. It is also involved in the building construction; and installation of steel bridge upper works, floor plates, pavement works, signs, and protective fences. The company was founded in 1921 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "5959.T": {
        "short_name": "OKABE CO LTD",
        "long_name": "Okabe Co., Ltd.",
        "summary": "Okabe Co., Ltd., together with its subsidiaries, manufactures and sells construction materials and equipment in Japan, North America, and internationally. It offers temporary construction products, such as clamps, inserts for scaffolding, scaffolding, temporary pass, and safety products; and concrete formwork products, including basic items, items for H-beam, items for sheet pile method, supports, water stop/disposal products, insulation items, inserts, rooftop protection, other formwork items, and chamfers. The company also provides products for rebar work, such as joints, pile head, and spacers, as well as products for foundations and beams; and civil engineering products. In addition, it manufactures and sells automotive bolts and screw nuts; automotive battery parts; industrial machinery products; and marine materials and fishing sinkers. Okabe Co., Ltd. was founded in 1917 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "5EY.DU": {
        "short_name": "KANDENKO CO. LTD",
        "long_name": "Kandenko Co.,Ltd.",
        "summary": "Kandenko Co.,Ltd. operates as a general infrastructure company in Japan. It engages in the facility installation works, electrical equipment sale, real estate rental and leasing, and electric power sale, as well as electrical, plumbing, and various other works. The company also undertakes works on electrical facilities and equipment inside various types of buildings and structures, building interiors, and control equipment; and environmental facilities and systems, and renovation works on air conditioning and sanitation systems, as well as water, heat, and disaster prevention systems. In addition, it is involved in the installation and maintenance of information and telecommunications systems; laying of optical fiber cables for telecommunications providers; installation of optical transmission equipment; and building and maintenance of transmission base stations for mobile communications and networks for cable TV and municipalities, as well as maintenance of telecommunications facilities for electric power providers. Further, the company undertakes the construction and maintenance of overhead power distribution lines facilities comprises power poles with power cables; and underground distribution lines facilities consisting of underground power cables. Additionally, it engages in the power stations and substations, underground and overhead transmission lines, and civil engineering works; designs and constructs power plants, as well as generates solar and wind power; and inspects and maintains nuclear power plant facilities and equipment. Kandenko Co.,Ltd. was founded in 1944 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "DUS",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "5EY.F": {
        "short_name": "KANDENKO CO. LTD",
        "long_name": "Kandenko Co.,Ltd.",
        "summary": "Kandenko Co.,Ltd. operates as a general infrastructure company in Japan. It engages in the facility installation works, electrical equipment sale, real estate rental and leasing, and electric power sale, as well as electrical, plumbing, and various other works. The company also undertakes works on electrical facilities and equipment inside various types of buildings and structures, building interiors, and control equipment; and environmental facilities and systems, and renovation works on air conditioning and sanitation systems, as well as water, heat, and disaster prevention systems. In addition, it is involved in the installation and maintenance of information and telecommunications systems; laying of optical fiber cables for telecommunications providers; installation of optical transmission equipment; and building and maintenance of transmission base stations for mobile communications and networks for cable TV and municipalities, as well as maintenance of telecommunications facilities for electric power providers. Further, the company undertakes the construction and maintenance of overhead power distribution lines facilities comprises power poles with power cables; and underground distribution lines facilities consisting of underground power cables. Additionally, it engages in the power stations and substations, underground and overhead transmission lines, and civil engineering works; designs and constructs power plants, as well as generates solar and wind power; and inspects and maintains nuclear power plant facilities and equipment. Kandenko Co.,Ltd. was founded in 1944 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6085.T": {
        "short_name": "ARCHITECTS STUDIO JAPAN INC",
        "long_name": "Architects Studio Japan Inc.",
        "summary": "Architects Studio Japan Inc. provides design and construction support services in Japan. The company supports the design and construction of buildings, such as houses, commercial facilities, apartment buildings, etc. It also provides specialized services for architects; and events, and exhibition and seminar spaces, as well as publishes and sells books and information magazines. The company was founded in 2002 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6091.T": {
        "short_name": "WESCO HOLDINGS INC",
        "long_name": "Wesco Holdings Inc.",
        "summary": "Wesco Holdings Inc. engages in general construction consulting business in Japan. The company is also involved in copy bookbinding, real estate, sports facility management, and kinder toe nen businesses. Wesco Holdings Inc. was founded in 1970 and is based in Okayama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Okayama"
    },
    "6171.T": {
        "short_name": "C.E.MANAGEMENT INTEGRATED LABOR",
        "long_name": "C.E.Management Integrated Laboratory Co.Ltd",
        "summary": "C.E.Management Integrated Laboratory Co.Ltd provides services in the areas of civil engineering and construction in Japan. The company conducts geological surveys to obtain ground information for the construction for civil engineering structures and buildings; surveys and diagnosis of various infrastructures; disaster prevention systems, including the installation of debris flow warning systems, automatic monitoring systems, and measurement equipment to ensure safety of construction sites; and ground survey services, such as conducting of surveys and tests in various situations ranging from quality control, form control, and data provision. It also offers environmental research services that include surveys and tests on the natural environment, which comprise soil against environmental pollution concerned about human body and nature impact; and non-destructive testing services, including investigation and diagnosis of social infrastructures, such as roads, railways, ports, airports, water, gas, and electricity, as well as buildings and condominiums. In addition, the company provides survey and design services comprising slope stability analysis consulting, pollution diffusion analysis, and drawing preparation services; and undertakes soil purification and ground reinforcement works that include forming a reinforcing body in the ground that secures stable strength and residential environment. C.E.Management Integrated Laboratory Co.Ltd was founded in 1985 and is headquartered in Chikuma, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Chikuma"
    },
    "6366.T": {
        "short_name": "CHIYODA CORP",
        "long_name": "Chiyoda Corporation",
        "summary": "Chiyoda Corporation operates as an integrated engineering company in Japan, the United States, Russia, and internationally. The company offers consulting, planning, engineering, procurement, construction, commissioning, and maintenance services for facilities related to gas, electricity, petroleum, petrochemical, chemical, pharmaceutical, antipollution, environment, preservation, and others. It also explores for oil, gas, and other mineral resource, as well as invests in and finances exploration activities. The company was founded in 1948 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "6540.T": {
        "short_name": "SEMBA CORPORATION",
        "long_name": "Semba Corporation",
        "summary": "Semba Corporation engages in the planning, design, construction, and supervision of commercial spaces in Japan and internationally. Its services include investigation and analysis, consulting, conceptual and master planning, working drawing, project management, opening sales promotion, tenant mixed planning, market research, merchandising planning, and construction management. The company also provides commercial spaces and facilities, shopping malls, department stores, specialty stores, cafes, restaurants, toys shops, character and apparel shops, amusement parks, and others. Semba Corporation was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7057.T": {
        "short_name": "NEW CONSTRUCTOR'S NETWORK CO LT",
        "long_name": "New Constructor's Network Co., Ltd.",
        "summary": "New Constructor's Network Co., Ltd. constructs wooden earthquake-resistant houses in Japan. It also engages in the building network business; and provides construction support services, housing loans, and insurance. The company was founded in 1996 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7945.T": {
        "short_name": "COMANY INC",
        "long_name": "Comany Inc.",
        "summary": "Comany Inc., together with its subsidiaries, manufactures and sells partitions in Japan. The company offers high, low, toilet, and movable partitions; tender, hanging, lightweight steel, sliding, skeleton mounted automatic folding, and designer doors; clean room partitions; electronic locks; and booths, whiteboard panels, wall mounted, and panel design steel partitions for application in offices, factories, education facilities, medical and welfare facilities, and public and commercial facilities. It is also involved in the import and export of office furniture and building materials; and construction and sale of partitions and interior finish building materials. The company was formerly known as Komatsu Partition Industry Inc. and changed its name to Comany Inc. in November 1984. Comany Inc. was founded in 1961 and is headquartered in Komatsu, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Komatsu"
    },
    "9233.T": {
        "short_name": "ASIA AIR SURVEY CO",
        "long_name": "Asia Air Survey Co., Ltd.",
        "summary": "Asia Air Survey Co., Ltd., a construction consulting company, provides aerial surveying services and products in Japan and internationally. The company offers geospatial survey services, including space-borne remote sensing, aerial photography, airborne and mobile LiDAR surveying, UAV aerial surveying services, etc. It also engages in map-making, GIS data preparation, 3D model creation and visualization, LiDAR data analysis and visualization, administration-support GIS, and mapping system and 3DViewer system development activities, as well as the provision of red relief image maps. In addition, the company provides disaster management services, including erosion control, volcanic disaster prevention, and river disaster prevention consulting, as well as regional planning for disaster prevention; and environmental management services, such as biodiversity conservation, environmental assessment, forest resources management, soil contamination investigation, support for environmental rehabilitation, and renewable energy development. Further, it offers infrastructure asset management services, including urban and regional planning; planning and designing of public facilities, such as roads, ports, bridges, rivers, and lifeline facilities; maintenance engineering services comprising investigation, diagnosis, analysis, monitoring, and reinforcement; and system and database for facility management. The company was formerly known as Asia Airlines Measurement Ltd and changed its name to Asia Air Survey Co., Ltd. in 1963. Asia Air Survey Co., Ltd. was founded in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9612.T": {
        "short_name": "LUCKLAND CO LTD",
        "long_name": "LuckLand Co., Ltd.",
        "summary": "LuckLand Co., Ltd. engages in the planning, design, and production of commercial facilities and stores related to food in Japan. The company's activities include planning and production of store facilities, commercial facilities, food factories, and distribution warehouses. It is also involved in the store maintenance, energy saving and CO2 reduction project, and building businesses, as well as engages in the building, and freezing and refrigerating equipment businesses. The company was founded in 1970 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9624.T": {
        "short_name": "CHODAI CO LTD",
        "long_name": "Chodai Co., Ltd.",
        "summary": "Chodai Co., Ltd. provides services for various local infrastructure projects in Japan. The company's construction services include studying, planning, designing, asset management, inspection, diagnosis, and testing of bridge repairs and special structures; analysis and experiment of bridges; construction management and supervision; and design for civil structures and facilities. It also studies, plans, designs, and supervises the construction of roads, tunnels, and associated facilities; studies, estimates, evaluates, and plans maintenance for buildings and facilities; studies, plans, and designs local plans, urban plans, regional plans, urban facilities, water supply, pumping stations, and processing facilities; studies, analyzes, plans, and designs river improvements, irrigation, environment, and river structures; provides viability studies for the introduction of PFI and advisory work for PFI; and studies, analyzes, plans, designs, and manages the operation for general traffic plans, road development plans, route plans, and advanced road traffic systems. In addition, the company provides consultancy, system planning, and design services for data processing infrastructure; consultancy, social experiment, system planning, design, and data maintenance services for advanced road traffic systems; and consultancy, system planning, design, software development, data maintenance, and operational management services for road maintenance, as well as plans, produces, and sells software products. Further, it provides planning, designing, project supervision, study, research, and technical supervision services in relation to construction, city planning, and interior design, as well as develops civil engineering products that promote environment conservation and energy saving. The company was founded in 1968 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9663.T": {
        "short_name": "NAGAWA CO LTD",
        "long_name": "NAGAWA Co., Ltd.",
        "summary": "NAGAWA Co., Ltd. manufactures, sells, and rents unit houses under the Super House name in Japan. It also engages in the system module architecture design and construction of the building. In addition, the company rents and sells construction machinery and equipment, as well as sells construction materials. Further, it undertakes remodeling, civil engineering, and various types of construction works; and rents surveillance cameras, as well as engages in the factory repair/renovation business. The company was formerly known as Nagawa Sekiyu Corporation and changed its name to NAGAWA Co., Ltd. in March 1978. NAGAWA Co., Ltd. was founded in 1966 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9716.T": {
        "short_name": "NOMURA CO LTD",
        "long_name": "NOMURA Co., Ltd.",
        "summary": "NOMURA Co., Ltd. designs, constructs, operates, and manages architectural spaces in Japan and internationally. Its work covers a range of purposes, including commercial complexes, shopping centers, specialty facilities, museums, leisure complexes, event sites, and public spaces. The company engages in the planning, design, manufacture, and construction of architecture, building redevelopment, interior design, and signs; display and promotion creation for visitor-attraction spaces; and planning, design, and execution of store construction, interior design, equipment and fixtures, and kitchens. It is also involved in the design, production, maintenance, and operation of exhibition equipment, videos, graphics, information systems, etc.; layout and supervision of the tea drink and goods chain store; provision of integrated business services, temporary staffing, and facility operation; and book editing, printing, publishing, and sales. In addition, it offers design for various exhibitions and events; architectural decoration design and construction services; and technical consulting and services. The company was founded in 1892 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9765.T": {
        "short_name": "OHBA CO LTD",
        "long_name": "Ohba Co., Ltd.",
        "summary": "Ohba Co., Ltd. provides consulting services in Japan and internationally. The company offers consulting services for the planning of charming cities, as well as technical support services to land owners in relation to land use and land use conversion. It is also involved in the planning and design of roads, bridges, structures, waterways, and water supply and sewage systems; and provision of technical services for creating social infrastructure. In addition, the company offers consulting services related to environmental investigations and assessments; and handles surveys and investigations involving geography and terrain. Further, it provides land and infrastructure maintenance and management services; and consulting services related to the disposal of real estate, as well as handles land, and drill boring and soil contamination investigations. Additionally, the company offers proposals involving geographic information and other related systems related to urban planning, civil engineering, environmental investigation, and preparation of spatial information. It also provides consulting services related to inheritance tax and real estate utilization, as well as proposes solutions for addressing various social issues. The company was founded in 1922 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "CHYCF": {
        "short_name": "CHIYODA CORP",
        "long_name": "Chiyoda Corporation",
        "summary": "Chiyoda Corporation operates as an integrated engineering company in Japan, the United States, Russia, and internationally. The company offers consulting, planning, engineering, procurement, construction, commissioning, and maintenance services for facilities related to gas, electricity, petroleum, petrochemical, chemical, pharmaceutical, antipollution, environment, preservation, and others. It also explores for oil, gas, and other mineral resource, as well as invests in and finances exploration activities. The company was founded in 1948 and is headquartered in Yokohama, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "CHYCY": {
        "short_name": "CHIYODA CORP",
        "long_name": "Chiyoda Corporation",
        "summary": "Chiyoda Corporation operates as an integrated engineering company in Japan, the United States, Russia, and internationally. The company offers consulting, planning, engineering, procurement, construction, commissioning, and maintenance services for facilities related to gas, electricity, petroleum, petrochemical, chemical, pharmaceutical, antipollution, environment, preservation, and others. It also explores for oil, gas, and other mineral resource, as well as invests in and finances exploration activities. The company was founded in 1948 and is headquartered in Yokohama, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "CKOCF": {
        "short_name": "CHUDENKO CORP",
        "long_name": "Chudenko Corporation",
        "summary": "Chudenko Corporation operates as an equipment engineering company in Japan. It undertakes electrical works, such as light/outlet, image/sound/TV/broadcast, power receiving/transforming, and plant equipment works; energy-related works comprising wind/solar power generation, cogeneration, energy-saving power, and private power generation system works; and environment-related works, including recycling and heat storage system works. The company also undertakes electric line/distribution line/leading wire/underground line works; and office/household water and sewerage, and industrial water and sewerage facilities works, as well as constructs, maintains, and repairs roads and architecture. In addition, it is involved in the Internet/Intranet, CATV/community wireless system/telephone, LAN, optical and mobile communication, and OA floor equipment, as well as system integration and integrated information wiring works; air-conditioning/cooling, heating/water supply, drainage/sanitation/environment equipment, and clean room system works; and fire-alarm, theft monitoring/alarm, and firefighting/evacuation guidance equipment works. Further, the company engages in building equipment renewal and housing renovation works, as well as pylon works; designs, produces, sells, repairs, installs, and maintains electrical equipment, such as distribution boards, supervisory panels, control boards, power source equipment, communication devices, heavy current devices, various measuring devices, and others; and plans, develops, sells, rents, operates, and maintains software and information processing systems. Additionally, it provides consulting and maintenance services consisting of energy saving diagnosis/support services, as well as disaster prevention and firefighting equipment inspection services. The company was founded in 1944 and is headquartered in Hiroshima, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Hiroshima"
    },
    "CS7.F": {
        "short_name": "COMSYS HLDGS CORP.",
        "long_name": "COMSYS Holdings Corporation",
        "summary": "COMSYS Holdings Corporation, together with its subsidiaries, engages in the telecommunications construction, electrical facilities construction, and information processing related businesses in Japan. It constructs wired and wireless networks, cable TV and related facilities, access networks, mobile facilities, and electric power facilities; installs, replaces, and removes metal and optical fiber communication cables; installs and replaces utility poles; installs, relocates, and removes communication and information processing equipment in communication stations and data centers; and installs mobile phone base stations and wirings, as well as handles configuration settings and troubleshooting of communication equipment. The company also provides IT solutions and develops software for government agencies; constructions physical environments, such as LAN and Wi-Fi systems, including servers, storage facilities, and networks. In addition, it is involved in the construction of underground tunnels for telecommunication facilities, and towers and buildings; biomass and wind power generation; sale of solar power generation facilities for detached homes and electricity from solar power plants; undergrounding of utility poles and civil engineering construction related to water supply and sewerage for regional municipalities; and construction of the gas facility. The company was founded in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "CYA.F": {
        "short_name": "CHIYODA CORP.",
        "long_name": "Chiyoda Corporation",
        "summary": "Chiyoda Corporation operates as an integrated engineering company in Japan, the United States, Russia, and internationally. The company offers consulting, planning, engineering, procurement, construction, commissioning, and maintenance services for facilities related to gas, electricity, petroleum, petrochemical, chemical, pharmaceutical, antipollution, environment, preservation, and others. It also explores for oil, gas, and other mineral resource, as well as invests in and finances exploration activities. The company was founded in 1948 and is headquartered in Yokohama, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "JDD.F": {
        "short_name": "JDC CORP I.K.",
        "long_name": "JDC Corporation",
        "summary": "JDC Corporation provides civil engineering and building construction works in Japan and internationally. It develops electrical power, transportation, ports and harbors, afforestation, flood control, irrigation, land reclamation, underground resources, and other development of national land; and produces, sells, loans, and repairs construction and mining machinery, other machinery, tools, etc. The company also manufactures and sells construction materials, stone materials, chemical products, etc. In addition, it engages in the sale, rental, brokerage, management, and appraisal of real estate; and ownership, rental, and management of leisure facilities, such as golf courses, ski resorts, etc. Further, the company is involved in the generation and supply of electricity, heat, etc.; and soil and water remediation in rivers, lakes, and bays, as well as the collection, transport, processing, disposal, and recycling of municipal, industrial, and construction waste. The company was founded in 1951 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "JGCCY": {
        "short_name": "JGC HOLDINGS CORPORATION",
        "long_name": "JGC Holdings Corporation",
        "summary": "JGC Holdings Corporation, together with its subsidiaries, provides engineering, procurement, and construction services for various plants and facilities. It operates in two segments, Total Engineering and Functional Materials Manufacturing. The company is involved in the design, procurement, construction, and performance test services of plant and machinery for petroleum, petroleum refining, petrochemicals, gas chemicals, nuclear energy, metal refining, biochemical, food, pharmaceuticals, medicals, logistics, information technology, environment conservation, and pollution control. It also manufactures and distributes chemicals and catalyst products, including FCC catalysts, hydrotreating catalysts, deNOx catalysts, petrochemical catalysts, etc.; functional material products, such as colloidal silica, coating materials for surface treatment on cathode ray tubes, material for semiconductors, cosmetic products, etc.; and fine ceramic products, as well as environment, energy and resources, and social science consulting services. It serves in Japan, East and Southeast Asia, the Middle East, Africa, North America, and internationally. The company was formerly known as JGC Corporation and changed its name to JGC Holdings Corporation in October 2019. JGC Holdings Corporation was founded in 1928 and is headquartered in Yokohama, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "KAJ.F": {
        "short_name": "KAJIMA CORP.",
        "long_name": "Kajima Corporation",
        "summary": "Kajima Corporation engages in the construction, real estate development and management, architectural and engineering design, and other activities worldwide. It provides procurement and construction services comprising sale and lease of construction equipment and materials, and subcontracting for various construction projects; ground improvement, foundation construction, and soil remediation; paving of roads, bridges, airports, etc., as well as manufacture and sale of paving materials; ocean port and coastal protection work, and geological surveying; calculation and preparation of construction plans; environmental and consulting work focused on water and waste; construction machinery manufacturing; repair and reinforcement work for civil engineering structures, and sale of repair materials; and integrated facility construction, and renovation services. The company also offers building management services; leasing and operational management services of real estate, and hotel management; and brokerage and appraisal services of real estate. In addition, it provides travel agency, product sales, and business services; temporary staffing and human resources placement, and events planning services; planning of construction projects, and building and equipment leasing; design, operation, and management of information communication technology infrastructure and various computer systems; collection, transportation, and processing of waste; public relations and advertising planning and production, as well as video production services; and real estate asset management and consulting, as well as buying, selling, and brokerage of beneficial interests of a trust. Further, the company offers book publishing; hotel, golf course, and ski resort services; and greening landscaping, mountain forest management, and agency handling services of property, casualty, and life insurance. Kajima Corporation was founded in 1840 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "KAJMF": {
        "short_name": "KAJIMA CORP",
        "long_name": "Kajima Corporation",
        "summary": "Kajima Corporation engages in the construction, real estate development and management, architectural and engineering design, and other activities worldwide. It provides procurement and construction services comprising sale and lease of construction equipment and materials, and subcontracting for various construction projects; ground improvement, foundation construction, and soil remediation; paving of roads, bridges, airports, etc., as well as manufacture and sale of paving materials; ocean port and coastal protection work, and geological surveying; calculation and preparation of construction plans; environmental and consulting work focused on water and waste; construction machinery manufacturing; repair and reinforcement work for civil engineering structures, and sale of repair materials; and integrated facility construction, and renovation services. The company also offers building management services; leasing and operational management services of real estate, and hotel management; and brokerage and appraisal services of real estate. In addition, it provides travel agency, product sales, and business services; temporary staffing and human resources placement, and events planning services; planning of construction projects, and building and equipment leasing; design, operation, and management of information communication technology infrastructure and various computer systems; collection, transportation, and processing of waste; public relations and advertising planning and production, as well as video production services; and real estate asset management and consulting, as well as buying, selling, and brokerage of beneficial interests of a trust. Further, the company offers book publishing; hotel, golf course, and ski resort services; and greening landscaping, mountain forest management, and agency handling services of property, casualty, and life insurance. Kajima Corporation was founded in 1840 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "KAJMY": {
        "short_name": "KAJIMA CORP",
        "long_name": "Kajima Corporation",
        "summary": "Kajima Corporation engages in the construction, real estate development and management, architectural and engineering design, and other activities worldwide. It provides procurement and construction services comprising sale and lease of construction equipment and materials, and subcontracting for various construction projects; ground improvement, foundation construction, and soil remediation; paving of roads, bridges, airports, etc., as well as manufacture and sale of paving materials; ocean port and coastal protection work, and geological surveying; calculation and preparation of construction plans; environmental and consulting work focused on water and waste; construction machinery manufacturing; repair and reinforcement work for civil engineering structures, and sale of repair materials; and integrated facility construction, and renovation services. The company also offers building management services; leasing and operational management services of real estate, and hotel management; and brokerage and appraisal services of real estate. In addition, it provides travel agency, product sales, and business services; temporary staffing and human resources placement, and events planning services; planning of construction projects, and building and equipment leasing; design, operation, and management of information communication technology infrastructure and various computer systems; collection, transportation, and processing of waste; public relations and advertising planning and production, as well as video production services; and real estate asset management and consulting, as well as buying, selling, and brokerage of beneficial interests of a trust. Further, the company offers book publishing; hotel, golf course, and ski resort services; and greening landscaping, mountain forest management, and agency handling services of property, casualty, and life insurance. Kajima Corporation was founded in 1840 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "KUG1.F": {
        "short_name": "KUMAGAI GUMI",
        "long_name": "Kumagai Gumi Co.,Ltd.",
        "summary": "Kumagai Gumi Co., Ltd. operates as a construction company in Japan and internationally. The company constructs tunnels, roads and bridges, railways, dams, and airports/marine ports, as well as water and sewerage, environmental, energy, renewal, ICT civil engineering, housing/mansion, office/government, hotel, commercial, culture, education/research, sports/entertainment, medical/social welfare, plant, distribution, and other projects. It also engages in the production of asphalt mixture and the paving of roads, airports, ports, bridges, etc.; building renovation business, including building survey/diagnosis, antiseismic diagnosis and reinforcement, and renovation plans; construction of semiconductor plants and golf courses; and manufacture of steel products for shield tunnels and temporary construction machinery, as well as designing/producing/installing soil decontamination equipment and leasing of steel frames. In addition, the company provides construction and building plans, and applications for projects; construction education to universities and construction companies; technical support services; and insurance agency services, as well as operates as a technology trading company for construction industry. Kumagai Gumi Co., Ltd. was founded in 1898 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "OBA.F": {
        "short_name": "OBAYASHI CORP.",
        "long_name": "Obayashi Corporation",
        "summary": "Obayashi Corporation engages in the construction business in Japan, North America, Asia, the Middle East, Europe, and Oceania. The company constructs buildings, including offices, condominiums, commercial facilities, factories, hospitals, and schools; and civil engineering projects, such as tunnels, bridges, dams, riverbanks, railroads, and expressways. It is also involved in the development and leasing of real estate properties in various locations, primarily in metropolitan areas, as well as property management activities; solar, biomass, hydropower, geothermal, and wind power generation business; and PPP and agriculture business. In addition, the company sells materials and equipment for construction; develops and sells computer software; sells and leases electronic equipment; offers finance-related services; and operates golf clubs. Further, it engages in the provision of urban development, contracted engineering, management, consultancy services, etc.; and is involved in the M&E design and construction activities. The company was founded in 1892 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "OBYCF": {
        "short_name": "OBAYASHI CORP",
        "long_name": "Obayashi Corporation",
        "summary": "Obayashi Corporation engages in the construction business in Japan, North America, Asia, the Middle East, Europe, and Oceania. The company constructs buildings, including offices, condominiums, commercial facilities, factories, hospitals, and schools; and civil engineering projects, such as tunnels, bridges, dams, riverbanks, railroads, and expressways. It is also involved in the development and leasing of real estate properties in various locations, primarily in metropolitan areas, as well as property management activities; solar, biomass, hydropower, geothermal, and wind power generation business; and PPP and agriculture business. In addition, the company sells materials and equipment for construction; develops and sells computer software; sells and leases electronic equipment; offers finance-related services; and operates golf clubs. Further, it engages in the provision of urban development, contracted engineering, management, consultancy services, etc.; and is involved in the M&E design and construction activities. The company was founded in 1892 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "OKA.F": {
        "short_name": "OKUMURA CORP.",
        "long_name": "Okumura Corporation",
        "summary": "Okumura Corporation engages in the civil engineering, architectural construction, and investment development businesses in Japan. The company undertakes various civil engineering projects for railways, roads, power station facilities, sewage and water works, and others; and construction projects, including houses, public facilities, medical facilities, and office buildings. It also designs, manufactures, sells, and repairs construction/industrial machines and devices; and provides real estate, land, and building management services, as well as owns rental properties, such as residential buildings, warehouses, and land in Osaka and other areas; and manufactures and sells construction machinery, materials, and others. In addition, the company generates and sells renewable electricity. The company was founded in 1907 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "PO6.F": {
        "short_name": "PENTA-OCEAN CONSTR.",
        "long_name": "Penta-Ocean Construction Co., Ltd.",
        "summary": "Penta-Ocean Construction Co., Ltd. engages in the construction of civil engineering and building projects in Japan, Southeast Asia, and internationally. The company also constructs tunnels and subways. In addition, it is involved in the sale or rent of real estate and other activities; and shipbuilding, leasing, insurance, and environment businesses. The company was founded in 1896 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "SHMUF": {
        "short_name": "SHIMIZU CORP",
        "long_name": "Shimizu Corporation",
        "summary": "Shimizu Corporation engages in the building contracting, civil engineering, machinery, and other construction works in Japan. It is also involved in the research, planning, study, evaluation, diagnosis, soil analysis, surveying, design, supervision, management, and consultancy related to regional, urban, ocean, space, resources, and energy developments, as well as construction works and environment improvement; and purchase, sale, letting, brokerage, management, appraisal, and consultancy of real estate. The company constructs, lets, sells, and caretaking of residential houses and other buildings; plans, constructs, possesses, maintains, and operates public office buildings, roads, harbors, airports, and parks, as well as educational and cultural, medical and welfare, and water supply and sewerage facilities; generates and supplies electricity and heat; undertakes purification works; collects, disposes, and reutilizes waste; and designs, installs, leases, sells, and maintains information communication and building management system. It also engages in the cultivation, production, management, sale, and consultancy of agricultural produce and seafood, and forestry work; maintenance and upkeep, security, and cleaning of buildings, equipment, and machinery; and design, manufacture, sale, lease, and brokerage of construction machinery and materials, concrete and wooden products, furniture, and interior fitting. The company offers industrial property, copyrights, and computer software; pharmaceutical, medical care material, and medical machinery and equipment; and advertisement, publication, printing, images and other information media, business event, inland transportation, warehouse, distribution center, insurance and travel agency, manpower supply, loan, guarantee, and factoring services. It also engages in the management and consultancy of sporting, hotel, restaurant, nursing, and resort facilities. The company was founded in 1804 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "SHMUY": {
        "short_name": "SHIMIZU CORP",
        "long_name": "Shimizu Corporation",
        "summary": "Shimizu Corporation engages in the building contracting, civil engineering, machinery, and other construction works in Japan. It is also involved in the research, planning, study, evaluation, diagnosis, soil analysis, surveying, design, supervision, management, and consultancy related to regional, urban, ocean, space, resources, and energy developments, as well as construction works and environment improvement; and purchase, sale, letting, brokerage, management, appraisal, and consultancy of real estate. The company constructs, lets, sells, and caretaking of residential houses and other buildings; plans, constructs, possesses, maintains, and operates public office buildings, roads, harbors, airports, and parks, as well as educational and cultural, medical and welfare, and water supply and sewerage facilities; generates and supplies electricity and heat; undertakes purification works; collects, disposes, and reutilizes waste; and designs, installs, leases, sells, and maintains information communication and building management system. It also engages in the cultivation, production, management, sale, and consultancy of agricultural produce and seafood, and forestry work; maintenance and upkeep, security, and cleaning of buildings, equipment, and machinery; and design, manufacture, sale, lease, and brokerage of construction machinery and materials, concrete and wooden products, furniture, and interior fitting. The company offers industrial property, copyrights, and computer software; pharmaceutical, medical care material, and medical machinery and equipment; and advertisement, publication, printing, images and other information media, business event, inland transportation, warehouse, distribution center, insurance and travel agency, manpower supply, loan, guarantee, and factoring services. It also engages in the management and consultancy of sporting, hotel, restaurant, nursing, and resort facilities. The company was founded in 1804 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "TBM.F": {
        "short_name": "TOBISHIMA CORP.",
        "long_name": "Tobishima Corporation",
        "summary": "Tobishima Corporation engages in the construction business in Japan and internationally. The company is involved in the research, survey, planning, designing, supervision, and management of civil engineering and building construction works, as well as regional and urban developments, ocean developments and environmental considerations, etc.; and planning, designing, development, possession, maintenance, operation, and management of various public facilities and infrastructure, including roads, ports, water supply and sewage works, government office buildings, educational and cultural facilities, solid waste disposal facilities, medical and sports facilities, hotels, and restaurants. It also engages in the environmental enhancement business, such as soil enhancement, river and lake bottom sediment purification, and lake and seawater improvement; collection, transportation, treatment, and recycling of general and industrial waste; thermal and other electricity and energies supply; and fabrication, procurement, sale, and lease of construction machinery, equipment, materials, and other manufactured items. In addition, the company is involved in the real estate dealing and leasing, and housing businesses; maintenance and security services works for buildings and incidental facilities; and life insurance business. Further, it acquires, licenses, and sells industrial property rights, copyrights, and other intellectual proprietary rights; offers information processing services; develops computer software and hardware; produces, processes, and sells agricultural, forestry, and fishery products; researches, studies, and develops production related agricultural, forestry, and fishery products; offers consulting services; and operates as a non-life and car insurance agent. The company was formerly known as Tobishima Civil Engineering and changed its name to Tobishima Corporation in 1965. The company was founded in 1883 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "TCW.F": {
        "short_name": "TOKYU CONSTRUCTION CO.LTD",
        "long_name": "Tokyu Construction Co., Ltd.",
        "summary": "Tokyu Construction Co., Ltd. engages in the civil engineering and building construction businesses in Japan. It constructs railways, roads, tunnels, bridges, and other construction, reconstruction work after earthquakes, etc.; and commercial facilities, hotels, offices, housing, factories, hospitals, and distribution centers, and wooden building, as well as offers renovation services. The company also engages in the acquisition of properties; and rental business, as well as PPP/concession and the paprika business. The company was founded in 1946 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "TISCF": {
        "short_name": "TAISEI CORP",
        "long_name": "Taisei Corporation",
        "summary": "Taisei Corporation engages in the civil engineering, construction contracts, and real estate development businesses in Japan and internationally. The company constructs tunnels, bridges, roads, and dams; and builds social infrastructures, as well as offers decontamination, maintenance, and preservation services. It also constructs airports, office buildings, commercial facilities, factories, and hospitals, as well as provides renovation and demolition services. In addition, the company is involved in the redevelopment projects, PFI projects, property management, and condominium sales projects; and purchase, sale, and rental of land and buildings. Further, it engages in the contract research, technology provision, and environmental measurement; housing; and leisure businesses. The company was formerly known as Nippon Doboku Corporation and changed its name to Taisei Corporation in 1946. Taisei Corporation was founded in 1873 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "TISCY": {
        "short_name": "TAISEI CORP",
        "long_name": "Taisei Corporation",
        "summary": "Taisei Corporation engages in the civil engineering, construction contracts, and real estate development businesses in Japan and internationally. The company constructs tunnels, bridges, roads, and dams; and builds social infrastructures, as well as offers decontamination, maintenance, and preservation services. It also constructs airports, office buildings, commercial facilities, factories, and hospitals, as well as provides renovation and demolition services. In addition, the company is involved in the redevelopment projects, PFI projects, property management, and condominium sales projects; and purchase, sale, and rental of land and buildings. Further, it engages in the contract research, technology provision, and environmental measurement; housing; and leisure businesses. The company was formerly known as Nippon Doboku Corporation and changed its name to Taisei Corporation in 1946. Taisei Corporation was founded in 1873 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "TKK.F": {
        "short_name": "TAISEI CORP. ADR/ 1/4",
        "long_name": "Taisei Corporation",
        "summary": "Taisei Corporation engages in the civil engineering, construction contracts, and real estate development businesses in Japan and internationally. The company constructs tunnels, bridges, roads, and dams; and builds social infrastructures, as well as offers decontamination, maintenance, and preservation services. It also constructs airports, office buildings, commercial facilities, factories, and hospitals, as well as provides renovation and demolition services. In addition, the company is involved in the redevelopment projects, PFI projects, property management, and condominium sales projects; and purchase, sale, and rental of land and buildings. Further, it engages in the contract research, technology provision, and environmental measurement; housing; and leisure businesses. The company was formerly known as Nippon Doboku Corporation and changed its name to Taisei Corporation in 1946. Taisei Corporation was founded in 1873 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "TKK1.F": {
        "short_name": "TAISEI CORP.",
        "long_name": "Taisei Corporation",
        "summary": "Taisei Corporation engages in the civil engineering, construction contracts, and real estate development businesses in Japan and internationally. The company constructs tunnels, bridges, roads, and dams; and builds social infrastructures, as well as offers decontamination, maintenance, and preservation services. It also constructs airports, office buildings, commercial facilities, factories, and hospitals, as well as provides renovation and demolition services. In addition, the company is involved in the redevelopment projects, PFI projects, property management, and condominium sales projects; and purchase, sale, and rental of land and buildings. Further, it engages in the contract research, technology provision, and environmental measurement; housing; and leisure businesses. The company was formerly known as Nippon Doboku Corporation and changed its name to Taisei Corporation in 1946. Taisei Corporation was founded in 1873 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "VJC.F": {
        "short_name": "JGC HOLDINGS CORP.",
        "long_name": "JGC Holdings Corporation",
        "summary": "JGC Holdings Corporation, together with its subsidiaries, provides engineering, procurement, and construction services for various plants and facilities. It operates in two segments, Total Engineering and Functional Materials Manufacturing. The company is involved in the design, procurement, construction, and performance test services of plant and machinery for petroleum, petroleum refining, petrochemicals, gas chemicals, nuclear energy, metal refining, biochemical, food, pharmaceuticals, medicals, logistics, information technology, environment conservation, and pollution control. It also manufactures and distributes chemicals and catalyst products, including FCC catalysts, hydrotreating catalysts, deNOx catalysts, petrochemical catalysts, etc.; functional material products, such as colloidal silica, coating materials for surface treatment on cathode ray tubes, material for semiconductors, cosmetic products, etc.; and fine ceramic products, as well as environment, energy and resources, and social science consulting services. It serves in Japan, East and Southeast Asia, the Middle East, Africa, North America, and internationally. The company was formerly known as JGC Corporation and changed its name to JGC Holdings Corporation in October 2019. JGC Holdings Corporation was founded in 1928 and is headquartered in Yokohama, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "XSZ.F": {
        "short_name": "SHIMIZU CORP.",
        "long_name": "Shimizu Corporation",
        "summary": "Shimizu Corporation engages in the building contracting, civil engineering, machinery, and other construction works in Japan. It is also involved in the research, planning, study, evaluation, diagnosis, soil analysis, surveying, design, supervision, management, and consultancy related to regional, urban, ocean, space, resources, and energy developments, as well as construction works and environment improvement; and purchase, sale, letting, brokerage, management, appraisal, and consultancy of real estate. The company constructs, lets, sells, and caretaking of residential houses and other buildings; plans, constructs, possesses, maintains, and operates public office buildings, roads, harbors, airports, and parks, as well as educational and cultural, medical and welfare, and water supply and sewerage facilities; generates and supplies electricity and heat; undertakes purification works; collects, disposes, and reutilizes waste; and designs, installs, leases, sells, and maintains information communication and building management system. It also engages in the cultivation, production, management, sale, and consultancy of agricultural produce and seafood, and forestry work; maintenance and upkeep, security, and cleaning of buildings, equipment, and machinery; and design, manufacture, sale, lease, and brokerage of construction machinery and materials, concrete and wooden products, furniture, and interior fitting. The company offers industrial property, copyrights, and computer software; pharmaceutical, medical care material, and medical machinery and equipment; and advertisement, publication, printing, images and other information media, business event, inland transportation, warehouse, distribution center, insurance and travel agency, manpower supply, loan, guarantee, and factoring services. It also engages in the management and consultancy of sporting, hotel, restaurant, nursing, and resort facilities. The company was founded in 1804 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    }
}