{
    "1736.T": {
        "short_name": "OTEC CORP",
        "long_name": "Otec Corporation",
        "summary": "Otec Corporation trades in pipework equipment in Japan. The company trades in sanitary ware, housing equipment, industrial equipment, fittings, and valves and steel pipes. It also designs, constructs, and maintains automatic control systems; and engages in the environmental system business. The company was formerly known as Ohishi Shoji Co., Ltd. and changed its name to Otec Corporation in 1989. Otec Corporation was founded in 1934 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "135-0016",
        "website": "http://www.o-tec.co.jp",
        "full_time_employees": 430
    },
    "3153.T": {
        "short_name": "YASHIMA DENKI CO LTD",
        "long_name": "Yashima Denki Co., Ltd.",
        "summary": "Yashima Denki Co., Ltd. provides plant systems, and industrial and transportation systems in Japan and internationally. The company offers plants and equipment related to oil, chemical, and gas businesses; private electrical power facilities; substation and power distribution equipment; monitoring equipment and various electrical control devices; energy-saving equipment; and solar power systems, as well as steel systems. It also provides industrial equipment and energy-saving products, such as drive control devices, inspection devices, and process control systems, as well as high and low pressure power-supply, production, and renewable-energy-related facilities; air-conditioning, chiller, and refrigerator equipment; LED lighting products; and IT solutions comprising production control, security, camera surveillance, and entrance and exit control systems, as well as develops and distributes various software. In addition, the company offers social/public systems, including aviation-related, water supply and sewerage, supervisory control, power, and solar power systems, as well as water treatment cleanup facilities and industrial instruments; and transportation systems consisting of vehicles, electrical products for vehicles, electrical transmission and distribution system monitor and control equipment, platform screen doors, signal systems, and digital signage. Further, it provides electronic devices and components, including liquid crystal display modules, batteries, sensors, passive parts, and other components. The company was formerly known as Yashima Denki Shokai Co., Ltd. and changed its name to Yashima Denki Co., Ltd. in February 1960. Yashima Denki Co., Ltd. was founded in 1946 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8686",
        "website": "http://www.yashimadenki.co.jp",
        "full_time_employees": 1048
    },
    "3176.T": {
        "short_name": "SANYO TRADING CO LIMITED",
        "long_name": "Sanyo Trading Co., Ltd.",
        "summary": "Sanyo Trading Co., Ltd., through its subsidiaries, engages in the rubber, chemicals, machinery and environmental, industrial products, and scientific instruments businesses in Japan and internationally. The company provides various rubbers, such as butyl rubbers, as well as nitrile butadiene rubbers (NBR) and hydrogenated NBR for industrial rubber goods; and specialty and general purpose rubbers, including polyisoprene, isoprene rubbers, EPDM, polychloroprene rubbers, epichlorohydrin rubbers, silicone rubbers, and fluoroelastomers. It is also involved in the import, export, and tripartite trade of chemicals, such as resins, additives, and other products for marketing to domestic manufacturers of paint, ink, floor polish, textiles, paper, adhesives, and leather. In addition, the company sells pelletizers; equipment for mixing and blending, drying and cooling, sifting, and particle size reduction for the manufacturers of woody biomass, feeds for livestock animals, and aquatic species; and wood gasifiers, which uses pellets as fuel source. Further, it develops and imports automotive parts and components; and imports and markets various analytical instruments and testing equipment to government institutes, universities, and research and quality control divisions of the various industries comprising chemical, petrochemical, pharmaceutical, food, machinery, automobile, and energy. Sanyo Trading Co., Ltd. was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0054",
        "website": "http://www.sanyo-trading.co.jp",
        "full_time_employees": 413
    },
    "3388.T": {
        "short_name": "MEIJI ELECTRIC INDUSTRIES CO LT",
        "long_name": "Meiji Electric Industries Co.,Ltd.",
        "summary": "Meiji Electric Industries Co.,Ltd. imports, exports, and sells electrical devices, measuring instruments, electrical equipment, and automation and energy-saving function components and equipment. It also designs, develops, and manufactures inspection, mechatronic, FA, and information and distribution systems, as well as electronic products. In addition, the company offers measurement, control, and information processing consulting services; and maintenance services for industrial instrumentation and electrical measurement devices. Meiji Electric Industries Co.,Ltd. was founded in 1920 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "453-8580",
        "website": "http://www.meijidenki.co.jp",
        "full_time_employees": 707
    },
    "7417.T": {
        "short_name": "NANYO CORP",
        "long_name": "NANYO Corporation",
        "summary": "NANYO Corporation operates as a general machinery trading company in Japan and internationally. It operates through Industrial Machinery Business, Construction Machinery Business, and Other divisions. The Industrial Machinery Business division offers semiconductor production equipment, precision machineries, inspection equipment, electronic/conduction devices, labor saving machineries/equipment, logistics equipment, and environment-related equipment, as well as other industrial machineries. The Construction Machinery Business division provides various construction machineries, attachments, vehicles/trucks, compaction equipment, environment-related equipment, sewer pipes, and other products. The Other division manufactures and sells quarry machineries. The company also offers ultraviolet rays irradiation systems for dicing films removal, as well as a sewer pipe cleaning and drilling robot, a turning equipment for various purposes under the NANYO brand. NANYO Corporation was founded in 1950 and is headquartered in Fukuoka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuoka",
        "zipcode": "812-8556",
        "website": "http://www.nanyo.co.jp",
        "full_time_employees": 425
    },
    "7456.T": {
        "short_name": "MATSUDA SANGYO",
        "long_name": "MATSUDA SANGYO Co., Ltd.",
        "summary": "MATSUDA SANGYO Co., Ltd. engages in the precious metals, environmental, and food businesses in Japan and internationally. It offers wiring connection, film forming, precious metal, plating, and catalyst materials; jewelry materials and products; precious metal ingots; and instruments for clean rooms, measuring equipment, industrial water treatment systems, and chlorine producing equipment. The company is also involved in the cleaning of semiconductor manufacturing equipment. In addition, it engages in the neutralization and dehydration of waste acids and alkali; incineration of waste oils, acids, alkali, and sludge and waste plastics; crushing of waste plastics, metals, glass, and ceramics; and treatment of waste from the photographic industry. Further, the company sells vacuum thermal recycling equipment and dental materials; collects silver from photographic industry wastes and removed caps; recycles precious metals; and manufactures, imports, and sells medical treatment machinery and equipment, as well as medical articles. Additionally, it offers surimi; marine products, such as fresh and frozen fish, various shellfish, mollusks, and seaweed; agricultural products, including eggs, milk protein, rice, materials for bakeries, canned fruits, dried mashed potatoes, sugar, starch, food additives, dairy products, edible oils, and wheat and bread flour, as well as fresh, frozen, dried, and canned vegetables; and livestock products comprising meat, portion cut meat, beef trimmings, and beef tissues. MATSUDA SANGYO Co., Ltd. was founded in 1935 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "163-0558",
        "website": "http://www.matsuda-sangyo.co.jp",
        "full_time_employees": 1436
    },
    "7594.T": {
        "short_name": "MARUKA CORPORATION",
        "long_name": "Maruka Corporation",
        "summary": "Maruka Corporation, a trading company, engages in the import, export, and sale of industrial and construction machineries in the United States, Asia, and internationally. The company's Industrial Machinery division provides machine tools, forming machinery, washing machines, injection molding machinery, welding machinery, surface treatment equipment, production machinery, bearings, hydraulic equipment, industrial robots, environmental equipment, water chillers, mold temperature controllers, environment-related products, and food machinery. This division serves automobile, consumer electronics, agricultural equipment, railroad, food machinery, airplane, medical, and energy-related industries. Its Construction Machinery division sells and rents construction machines for harbor and construction machinery industries. The company was formerly known as Maruka Machinery Co., Ltd. and changed its name to Maruka Corporation in April 2019. Maruka Corporation was founded in 1946 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "540-0024",
        "website": "http://www.maruka.co.jp",
        "full_time_employees": 698
    },
    "7624.T": {
        "short_name": "NAITO & CO LTD",
        "long_name": "Naito & Co., Ltd.",
        "summary": "Naito & Co., Ltd., a trading company, sells cutting tools, mechanical tools, industrial devices, machine tools, and other products in Japan and internationally. The company's cutting tools include carbide tools, special steel tools, abrasives, and diamond tools; and measurement devices comprise 3D measuring machines, shape measuring devices, optical measurement devices, torque machines, various test equipment, foreign object detectors, and others, as well as vernier calipers, micrometers, dial gauges, and gauges. Its industrial devices consists of tooling products, complementary tools, pneumatic equipment, hydraulic equipment, environmental equipment, and working tools; and machine tools comprise lathes, milling machines, machining centers, grinding machines, electric discharge machines, robots, and CAD/CAM systems. Naito & Co., Ltd. was founded in 1945 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.naito.net",
        "full_time_employees": 344
    },
    "7628.T": {
        "short_name": "OHASHI TECHNICA",
        "long_name": "Ohashi Technica Inc.",
        "summary": "Ohashi Technica Inc. plans, develops, produces, and markets precision components assembled to various products in automobile and other industries in Japan, the Americas, the ASEAN countries, China, and Europe. Its automotive parts comprise engine and mission, differential, brake, body and chasse, and interior/exterior components; and information technology (IT) and communications device parts include mobile phone hinges and others. The company also manufactures forged press, machining, and sheet metal welding parts, as well as provides public warehousing and automotive freight shipping services. In addition, it engages in general operation related to logistics, such as packing and inspection of various parts. The company was formerly known as Ohashi Shoji, Inc. and changed its name to Ohashi Technica Inc. in May 1987. Ohashi Technica Inc. was founded in 1953 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0001",
        "website": "http://www.ohashi.co.jp",
        "full_time_employees": null
    },
    "8052.T": {
        "short_name": "TSUBAKIMOTO KOGYO",
        "long_name": "Tsubakimoto Kogyo Co., Ltd.",
        "summary": "Tsubakimoto Kogyo Co., Ltd. operates as a general trading company that deals in machinery and technology in Japan. The company's Power Transmission division supplies motion controllers, sensors and testers, measuring equipment, motors and geared motors, linear servo devices, servo devices, chains and belts, transmission/reduction assemblies and gears, peripheral equipment and maintenance, couplings and U-joints, actuators, clutches, and brakes, as well as handles maintenance and repair work. Its Industrial Equipment division supplies automation and labor-reducing systems, such as distribution systems, medical and healthcare systems, testing and measuring systems, powder systems, newspaper production equipment, automobile engine machining and assembly systems, robot systems, and food processing systems for materials handling, processing, assembly, testing, packaging, and environmental equipment. The company's Industrial Materials division develops and supplies packaged products comprising containers and packaging materials. This division provides functional materials, precision components, nonwoven fabrics, building and construction materials, plastic raw materials and plastic molded/composite products, hand pumps and dispensers, automobile interior materials, and stone surface plates. Its International Division exports components and equipment based on Japanese applied technology, and imports components and equipment from manufacturers, as well as supports manufacturing operations through its procurement network. The company was formerly known as Tsubakimoto Shoten Co., Ltd. and changed its name to Tsubakimoto Kogyo Co., Ltd. in July 1943. Tsubakimoto Kogyo Co., Ltd. was founded in 1916 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0001",
        "website": "http://www.tsubaki.co.jp",
        "full_time_employees": 748
    },
    "8061.T": {
        "short_name": "SEIKA CORP",
        "long_name": "Seika Corporation",
        "summary": "Seika Corporation operates as a general trading company of machineries in Japan and internationally. It offers systems and equipment for thermal and renewable power generation; peripheral equipment for nuclear power plants; electrical substation equipment; environmental preservation equipment; and other power generation related equipment. The company also provides a range of equipment and systems for air pollution control, waste water treatment, waste disposal, and safety and prevention; systems and equipment for film, plastic, and textile manufacturing; and food/beverage production, research and development, quality control, and pharmaceutical production equipment, as well as equipment for packaging materials. In addition, it offers various tools for producing the core parts of digital electronic devices comprising laser titler and peripheral exposure devices, laser processing and glass cutting systems, laser direct patterning systems, automatic optical inspection devices, UV curing devices, nitrogen gas circulation purifier systems, nitrogen gas chamber systems, array inspection devices, glass polishing repair systems, liquid crystal pouring equipment, PI pre-cure equipment, cooling systems, and cleaning systems, as well as PI HVCD and curing systems for flexible display. Further, the company provides measuring devices for food/pharmaceutical production and laboratory use, and electrochemistry/porous materials; fluid/combustion measuring systems; life science/biochemical-related measuring devices and accessories; and other devices. Additionally, it offers painting, parts, assembly, and research and development equipment for automobile and parts manufacturers; printing and bookbinding machinery, transport equipment, energy saving products, IT systems, and other machineries and systems; and materials and parts in the areas of textile, electronics, and semiconductor businesses. Seika Corporation was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.seika.com",
        "full_time_employees": null
    },
    "8077.T": {
        "short_name": "TORQ INC",
        "long_name": "TORQ Inc.",
        "summary": "TORQ Inc. engages in the import, export, and sale of rivets and fastening products in Japan. It offers a range of screw products, including small screws and high-tension bolts, inserts, spacers, PC nuts, coupler washers, flange hardware, connecting plates, and lifting jigs, as well as hardware for manholes; construction and civil engineering, and building related products, such as material handling and transportation, civil engineering and construction, and hydraulic equipment, as well as welding/fusing instruments, work/measuring tools, safety and disaster prevention goods, air electric tools, electric installation, plumbing fixtures, and cutting and grinding tools; machine and industrial screws, and fasteners; and stainless steel and special steel products, such as brass, copper, titanium, and hastelloy. The company was formerly known as Kobayashi Metals Limited and changed its name to TORQ Inc. in April 2020. TORQ Inc. was founded in 1926 and is based in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "550-0015",
        "website": "http://www.torq.co.jp",
        "full_time_employees": 267
    },
    "8085.T": {
        "short_name": "NARASAKI SANGYO CO",
        "long_name": "Narasaki Sangyo Co., Ltd.",
        "summary": "Narasaki Sangyo Co., Ltd. engages in the sale of electric machinery and equipment, and petroleum products to industry and households. It offers measuring and monitoring supervisory control equipment; air conditioning and sanitation equipment, freezing and refrigerating equipment, elevators, power receiving/transforming facilities, emergency home power generators, power supply systems, parking lot equipment, large-scale mapping devices, building management systems, and security systems; FA and high-performance materials; and industrial equipment and agricultural implements, as well as boat products, shipping materials, disaster prevention devices, and other products. The company also sells construction machinery and systems; construction materials; and energy equipment. In addition, it is involved in motor truck operations; shipping and transport operations; warehouse management; boat leasing; domestic coastal shipping; customs clearance; sea transport agency; air service agency; and gas station management activities. Further, the company sells automobile parts, liquefied petroleum gas, and other high-pressure gases; and repairs automobiles. The company was formerly known as Narasaki Sangyo Kaiun K.K. and changed its name to Narasaki Sangyo Co., Ltd. in 2002. Narasaki Sangyo Co., Ltd. was founded in 1902 and is headquartered in Sapporo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sapporo",
        "zipcode": "060-0001",
        "website": "http://www.narasaki.co.jp",
        "full_time_employees": null
    },
    "8103.T": {
        "short_name": "MEIWA CORPORATION",
        "long_name": "Meiwa Corporation",
        "summary": "Meiwa Corporation engages in the chemicals, lubricants, battery materials, automotive-related and mineral resource, and environmental-related businesses in Japan and internationally. The company's battery materials include raw materials for primary components, such as cathode materials, anode materials, electrolytic solutions and separators, and intermediate products and finished goods. It also offers mineral resources comprising rare earths, rare metals, metal products, and inorganic materials; environmental services, which deals with materials used in water processing environments; and resins and flame retardants, including resin materials span, such as automotive, electrical/electronics, food packaging materials, residential construction materials, and daily goods. In addition, the company provides pharmaceutical materials and intermediates; petroleum products, such as fuel, heavy fuel oil, lubricating oil and grease, base oil, lubricant additives, solvents, asphalt, rubber compounding oil, and others, as well as develops petroleum-related businesses in Southeast Asia; and construction materials, including waterproof materials, heat-insulating materials/subsidiary, interior trim, internal store trim, flooring, wooden packaging, and residential fittings. Further, it sells general chemical raw materials, such as polymer raw materials; urethane raw materials; resin for coatings; FRP raw materials; high-precision chemical products comprising organic chemicals and fillers for optics and electronics; and inorganic chemical products, including inorganic fibers. Additionally, the company offers general automotive parts and materials, such as synthetic resin products, trim parts, cast products, etc.; and raw materials. Meiwa Corporation was founded in 1947 and is headquartered in Tokyo, Japan. Meiwa Corporation operates as a subsidiary of JAPAN Creative Platform Group Co., Ltd.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8311",
        "website": "http://www.meiwa.co.jp",
        "full_time_employees": null
    },
    "8147.T": {
        "short_name": "TOMITA CO LTD",
        "long_name": "Tomita Co., Ltd.",
        "summary": "Tomita Co., Ltd. distributes machine tool products and industrial machinery in Japan and internationally. The company provides general-purpose and CNC lathes; milling, drilling, broaching, boring, gun drilling, electrical discharge, additive manufacturing, cutting, laser processing, sheet metal, forming, injection molding, and other machines; machining centers; grinders; gear processing machines, including cutting, finishing, honing, shaving, and hobbing; and CNC routers and light metal/plastic/wood processing machines. It also offers pneumatic and hydraulic equipment; cutting tools and abrasives; power transmission products; electronic components; measuring equipment; metal working related devices; dust collectors and washing machines; coolant units; material handling equipment; heat treatment and environmental equipment; welding equipment; molding machine related equipment; and other products, as well as electric equipment, tools, conduction equipment, drives, and instruments. In addition, the company provides automation, retrofit, and customized devices/machines; robots/loaders/conveyors; CAD/CAM systems; and production management systems/software products, as well as imports machinery and tools. Further, it provides maintenance, repair, and operational services; and mediation for part machining. Tomita Co., Ltd. was founded in 1911 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0061",
        "website": "http://www.tomitaj.co.jp",
        "full_time_employees": null
    },
    "8249.T": {
        "short_name": "TECHNO ASSOCIE CO",
        "long_name": "TECHNO ASSOCIE Co., Ltd.",
        "summary": "TECHNO ASSOCIE Co., Ltd. designs, manufactures, and sells fasteners, processed components, metal materials, raw steel, electrical components, chemical products, and industrial machineries worldwide. It offers structural parts for smartphones, tablets, digital cameras, and car navigation systems, as well as wearables; automotive metal and molded products, such as engines, transmissions, electrical components, anti-vibration, brakes, seats, and interior products; and solutions for air conditioners, refrigerators, copiers, robotics, and smart meters. The company also provides housing and construction products, such as solar power generation systems and other products for energy-creating equipment and installation materials; double-sided tape adhesive, tie bolts, and other house construction work-saving products; decorative products for housing equipment and home renovation; and exterior materials. In addition, it offers fastener products, including JIS standard screws, tapping screws for resin, tapping screws for light alloys, high-strength screws, lightweight screws, special surface treatment, anti-loosening screws and nuts, tapping screws for thin gage metal, anti-cam out screws, micro screws, anti-corrosion screws, functional rivets, and imported products. Further, the company provides industrial tapes, industrial adhesives, rubber parts, styrofoams, non-woven fabrics, highly functional films, PTFE porous films, filters, heat-damage-prevention products, noise-damage-prevention products, electromagnetic-prevention products, water-proof/water-stop products, and flame-resistant and non-combustible materials. Additionally, it offers machine tools and factory automation products; parts for medical equipment; fastener parts and decorative materials for trains; and caterpillar forgings for construction machinery. The company was founded in 1804 and is headquartered in Osaka, Japan. TECHNO ASSOCIE Co., Ltd. operates as a subsidiary of Sumitomo Electric Industries, Ltd.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "550-0001",
        "website": "http://www.technoassocie.co.jp",
        "full_time_employees": null
    },
    "9830.T": {
        "short_name": "TRUSCO NAKAYAMA CORP",
        "long_name": "Trusco Nakayama Corporation",
        "summary": "Trusco Nakayama Corporation operates as a specialized trading company in Japan and internationally. The company engages in the wholesale of machine tools, distribution equipment, environmental safety equipment, and other equipment; and metal products, as well as planning and development of the products under the Trusco brand name. It sells its products to dealers of machine tools, welding consumables, electrical materials, architectural hardware, and tubing materials, as well as do-it-yourself stores, home centers, and other customers. The company was formerly known as Nakayama Kiko Co., Ltd. and changed its name to Trusco Nakayama Corporation in 1994. Trusco Nakayama Corporation was founded in 1959 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0004",
        "website": "http://www.trusco.co.jp",
        "full_time_employees": 1674
    },
    "9845.T": {
        "short_name": "PARKER CORPORATION",
        "long_name": "Parker Corporation",
        "summary": "Parker Corporation provides product development, manufacturing, sales, and technical services for the automobiles, electrical machinery, chemicals, steel, electronics, food, etc. industries in Japan and internationally. The company imports and sells machinery and equipment for use in automobile, food, shoemaking, and chemical industries. It also develops, manufactures, and sells fine chemicals for industrial use, such as cleaning agents, rust prevention, etc.; and chemical products centered on advanced chemicals, such as electronics and printing, as well as special chemicals for the aftermarket of car, railways, and aircraft. In addition, the company develops and sells industrial sealing materials and adhesives; and manufactures and sells soundproofing materials for automobile and air conditioners. Further, it develops, designs, manufactures, and sells industrial machinery. The company was formerly known as Parker Shoji Co., Ltd. and changed its name to Parker Corporation in August 1988. Parker Corporation was founded in 1951 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.parkercorp.co.jp",
        "full_time_employees": 1678
    },
    "9914.T": {
        "short_name": "UEMATSU SHOKAI CO",
        "long_name": "Uematsu Shokai Co.,Ltd.",
        "summary": "Uematsu Shokai Co.,Ltd., a direct sales trading company, provides machine tools and industrial machinery in Japan. The company offers NC/MC machine tools, electric discharge machines/grinders, and various FA systems; and logistic, hydraulic/pneumatic, labor-saving automation system, and FA system equipment. It also provides machine tool accessories, such as NC/MC peripherals, cutting tools, measurement equipment, and various machine equipment; bearings/motors, conductors, reducers, and transmissions; and environmental loading reduction devices and RDV systems. Uematsu Shokai Co.,Ltd. was founded in 1945 and is headquartered in Sendai, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sendai",
        "zipcode": "984-8680",
        "website": "http://www.uem-net.co.jp",
        "full_time_employees": null
    },
    "9932.T": {
        "short_name": "SUGIMOTO & CO",
        "long_name": "Sugimoto & Co., Ltd.",
        "summary": "Sugimoto & Co., Ltd. engages in the sale, import, and export of machinery and equipment in Japan and internationally. The company offers machines and measuring equipment, and test machines; cutting tools and working equipment; pneumatic tools, hydraulic, and pneumatic equipment; electric tools, conduction equipment, and working tools; and pipe-working equipment and OA equipment. Sugimoto & Co., Ltd. was founded in 1921 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "550-8502",
        "website": "http://www.sugi-net.co.jp",
        "full_time_employees": null
    },
    "9967.T": {
        "short_name": "SAKAI TRADING CO",
        "long_name": "Sakai Trading Co., Ltd.",
        "summary": "Sakai Trading Co., Ltd. engages in the import, export, manufacture, and sale of chemicals and related products in Japan and internationally. The company offers various chemicals, including titanium dioxide, zinc products, barium salts, resin stabilizers, catalysts, phenol derivatives, azo compounds, hydrazine derivatives, isocyanates, amines, polyethyleneimines, sebacic acids, phosphates, alginic acids, glucosamine, and chitin and chitosan; hygienic products, such as SAP, nonwoven fabrics, breathable and non-breathable films, loop and hook tapes, diaper tissues, laminated nonwoven fabrics, elastic nonwovens and films, and diapers. It also provides polyurethane resins, epoxy resins, phenoxy resins, acrylic resins, PET resins, polyvinyl chloride, polyolefins, polyamides, polyimides, copolyesters, chlorinated polyolefins, reflective sheets, and functional films; and electronic materials comprising perovskite compounds, PET and PI films, conductive pastes, silver powders, connectors, and barium and strontium carbonates, as well as binders for ceramics. In addition, the company offers mineral products and biomass ethanol that include ilmenite, barite, celestite, tungsten, vanadium, zirconium, and titanium slags; and industrial materials, which comprise sandbags, construction sheets, joint sealants, water stops, nets, weed proof and impervious sheets, and curing tapes. Sakai Trading Co., Ltd. was founded in 1936 and is headquartered in Osaka, Japan. Sakai Trading Co., Ltd. is a subsidiary of Sakai Chemical Industry Co., Ltd.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0005",
        "website": "http://www.sakaitrading.co.jp",
        "full_time_employees": 330
    },
    "9986.T": {
        "short_name": "ZAOH CO LTD",
        "long_name": "ZAOH Company, Ltd.",
        "summary": "ZAOH Company, Ltd. imports and sells machines for anti-pollution and cleaning in Japan. The company is also involved in the sale of machines and devices for construction, manufacturing, measurement, and transportation; and sale of metalworking oils and related products. Its products include sweepers, vacuum cleaners, floor scrubbers, high pressure cleaners, carpet scrubbers and cleaners, steam cleaners, alkali ionized machines, and other products. The company was incorporated in 1956 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "135-0001",
        "website": "http://www.zaohnet.co.jp",
        "full_time_employees": null
    }
}