{
    "1835.T": {
        "short_name": "TOTETSU KOGYO CO",
        "long_name": "Totetsu Kogyo Co., Ltd.",
        "summary": "Totetsu Kogyo Co., Ltd. engages in the railway track maintenance, civil engineering, architectural, and environmental businesses in Japan. The company is involved in the repair and reconstruction of railway tracks, as well as building new railway tracks for the Tohoku Shinkansen, and other public and private sectors. It also engages in the construction, renovation, and reinforcement of elevated and standard bridges, tunnels, motorways, and multilevel crossings, as well as setting up railway platform edge doors for passenger protection. In addition, the company is involved in the construction and maintenance of station buildings for railway lines, apartment houses, office buildings, hotels, shops, schools, etc. Further, it provides environmental technology and services, such as constructing solar power generation systems, greening of buildings, draining disposal systems, removing asbestos, implementing energy conservation systems for air conditioning, etc. The company was founded in 1943 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Infrastructure Operations",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-8589",
        "website": "http://www.totetsu.co.jp",
        "market_cap": "Large Cap"
    },
    "1883.T": {
        "short_name": "MAEDA ROAD CONSTRUCTION CO",
        "long_name": "MAEDA ROAD CONSTRUCTION Co., Ltd.",
        "summary": "MAEDA ROAD CONSTRUCTION Co., Ltd. engages in the contract, design, and supervision of civil engineering construction works. It also produces and sells materials for civil engineering construction, etc. The company was founded in 1930 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Infrastructure Operations",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-8665",
        "website": "http://www.maedaroad.co.jp",
        "market_cap": "Large Cap"
    },
    "1950.T": {
        "short_name": "NIPPON DENSETSU KOGYO CO",
        "long_name": "Nippon Densetsu Kogyo Co., Ltd.",
        "summary": "Nippon Densetsu Kogyo Co., Ltd. operates as a railway electronics equipment construction company in Japan. The company engages in the construction of electrical facilities for buildings, such as related to renewable energies and energy-saving buildings, as well as undertakes renovation, and air conditioning and plumbing equipment works; and information and communication systems, including mobile communication-related construction, IP network related equipment construction, railway communication systems construction, and network infrastructure development, as well as maintenance and technical support services. It also constructs power plants and substations, electric train lines, transmission lines, electric light and power systems, signal equipment, and public and private railways, as well as provides human resources development services. The company was formerly known as Railway Electric Industries Co., Ltd. and changed its name to Nippon Densetsu Kogyo Co., Ltd. in 1949. Nippon Densetsu Kogyo Co., Ltd. was founded in 1942 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Infrastructure Operations",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "110-8706",
        "website": "http://www.densetsuko.co.jp",
        "market_cap": "Large Cap"
    },
    "1968.T": {
        "short_name": "TAIHEI DENGYO KAISHA",
        "long_name": "Taihei Dengyo Kaisha, Ltd.",
        "summary": "Taihei Dengyo Kaisha, Ltd. engages in the plant construction business in Japan and internationally. The company constructs and maintains thermal, nuclear, gas turbine, diesel engine, geothermal, combined cycle, and wind power plants; steel mill, petrochemical, sugar refining, cement, and other industrial plants; and refuse incineration, dioxin treatment, sludge treatment, and waste recycling plants, as well as dome stadiums and bridge construction projects. It is also involved in the design, manufacture, installation, and maintenance of various electrical systems, sub-stations, control systems, optical fiber communication systems, instrumentation, and building electrical facilities; and design and construction of various industrial plants comprising heat ventilation and air conditioning systems, utility sanitary systems, etc. In addition, the company designs, procures, and fabricates machined products, tanks, piping, pressure vessels, electrical and control panels, etc., as well as provides equipment installation services for building facilities, amusement facilities, etc. Taihei Dengyo Kaisha, Ltd. was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Infrastructure Operations",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-8416",
        "website": "http://www.taihei-dengyo.co.jp",
        "market_cap": "Large Cap"
    },
    "6379.T": {
        "short_name": "RAIZNEXT CORPORATION",
        "long_name": "RAIZNEXT Corporation",
        "summary": "Shinko Plantech Co., Ltd., a plant maintenance company, provides maintenance and engineering services in Japan and internationally. It offers engineering and consulting services, as well as installation, civil engineering, electrical instrumentation, and plumbing services. It also provides design, supervision, and construction of equipment and machinery. The company serves oil, petrochemicals, gas, general chemicals, non-ferrous metals, metal processing, electronic materials, resource recycling, electricity, nuclear power, renewable energy, distributed energy, iron manufacturing, coal, desalination, fodder, biochemical, food products, pharmaceuticals, medical supplies, medical care, information/communications, shipping/transportation, distribution, stockpiles, air conditioning/plumbing, pollution control, accident prevention, and environmental conservation industries. Shinko Plantech Co., Ltd. was founded in 1938 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Infrastructure Operations",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "235-0017",
        "website": "http://www.raiznext.co.jp",
        "market_cap": "Large Cap"
    },
    "7821.T": {
        "short_name": "MAEDA KOSEN CO.LTD",
        "long_name": "Maeda Kosen Co., Ltd.",
        "summary": "Maeda Kosen Co., Ltd. manufactures and sells civil engineering materials, construction materials, agricultural materials and nonwoven fabrics in Japan. It also manufactures and sells chemical fibers; non-woven fabrics; adhesive agents; oil fences; tents and sheets for use in land and sea transportation; electric pasture units; medical devices for animals; livestock and dairy farming machinery; automobile wheels, and other transportation machine parts and related materials; and disaster prevention articles, ship outfitting supplies, and vehicle accessories. In addition, the company's products include embankment reinforcement materials, civil engineering sheets, river bank protection materials, slope disaster prevention products, adhesive anchors, water pollution prevention membranes, plastic false wood, drainage materials, polymer cement mortar, vegetation products, thinning material products, etc. Further, its products include flat display panels used in clean rooms; wiping cloths for precision equipment; secondary products of thin ribbons and knits, such as name ribbons and various industrial fibers; and circular knits for clothing and various industrial materials. Furthermore, the company manufactures high-grade forged wheels, and supplies OEMs to automakers and sells them to the aftermarket; and develops, manufactures, and sells medical devices. Maeda Kosen Co., Ltd. was founded in 1918 and is headquartered in Sakai, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Infrastructure Operations",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sakai",
        "zipcode": "103-0005",
        "website": "http://www.maedakosen.jp",
        "market_cap": "Large Cap"
    }
}