{
    "9101.T": {
        "short_name": "NIPPON YUSEN KABUSHIKI KAISHA",
        "long_name": "Nippon Yusen Kabushiki Kaisha",
        "summary": "Nippon Yusen Kabushiki Kaisha provides sea, land, and air transportation services worldwide. The company offers various logistics services, including liner trading services, such as container shipping, and terminal and stevedoring services for containerships, car carriers, and cruise ships; and air cargo transportation services. It also provides bulk shipping services comprising transport services for finished automobiles, heavy construction machines, and used cars; transportation services for bulk freight, which include iron ore, coal, and wood chips; and transportation services for crude oil, petroleum products, petrochemical products and other liquid chemicals, liquefied natural gas, and ammonia for oil, petrochemical, and energy companies. In addition, the company is involved in the upstream areas of the supply chain for oil and natural gas. Further, it operates Asuka II, a luxury cruise ship; and manages commercial and residential buildings. The company was founded in 1885 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.nyk.com",
        "full_time_employees": null
    },
    "9104.T": {
        "short_name": "MITSUI O.S.K. LINES LTD",
        "long_name": "Mitsui O.S.K. Lines, Ltd.",
        "summary": "Mitsui O.S.K. Lines, Ltd. engages in the marine transportation business in Japan and internationally. The company operates through Dry Bulk Business, Energy Transport Business, Product Transport Business, and Associated Businesses. Its fleet consists of dry bulk carriers for the transportation of iron ore, coal, grain, wood, wood chips, cement, fertilizer, and salt; crude oil tankers; tankers that transport refined petroleum products, such as gas oils, naphtha, and gasoline; chemical tankers that transport liquid chemical products; methanol carriers; and LPG carriers. The company's fleet also includes car carriers that transport passenger cars and construction machinery; containerships; and ferries and coastal RoRo ships. In addition, it operates container terminals in Japan and internationally; floating storage and regasification units; and floating production, storage, and offloading systems, as well as offers logistics services, such as air and ocean freight forwarding, trucking, customs clearance, warehousing, inspection, and heavyweight and oversized cargo transport, as well as buyers' consolidation. Further, the company is involved in ocean shipping related businesses comprising tugboat operation, land transport, maritime consulting, travel, office building leasing, property management, finance, trading, insurance, ICT systems, temporary staffing, supporting an oil stockpile project, nautical charts, and other businesses. As of March 31, 2020, it operated 263 dry bulkers; 290 tankers, LNG carriers, and steaming coal carriers; 64 containerships; 1 cruise ship; and 186 product transport vessels, as well as 2 other vessels. The company was founded in 1884 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8688",
        "website": "http://www.mol.co.jp",
        "full_time_employees": 8931
    },
    "9107.T": {
        "short_name": "KAWASAKI KISEN KAISHA",
        "long_name": "Kawasaki Kisen Kaisha, Ltd.",
        "summary": "Kawasaki Kisen Kaisha, Ltd. provides marine, land, and air transportation services in Japan, the United States, Europe, Asia, and internationally. The company operates through Dry Bulk, Energy Resource Transport, Product Logistics, and Other segments. It offers containership services; dry bulk carrier services comprising transport of raw materials, such as coal, iron ore, wheat, soybeans, corn, etc., as well as woodchips, and pulp; car carrier services; liquefied natural gas (LNG) carrier services; marine transport of crude oil, oil derivatives, and liquefied petroleum gas (LPG) products through tankers; offshore support vessel services; offshore drilling services; and floating production storage and offloading services. The company also offers logistics services, including air and sea freight forwarding, land transportation, warehousing, and buyer's consolidation services; and operates container terminals. As of March 31, 2020, it operated a fleet of 49 short sea and coastal vessels; 46 containership vessels; 183 dry bulk carriers; 89 car carriers; 1 FPSO and drillship; 6 offshore support vessels; 17 oil tankers; and 47 LNG carriers; and 29 thermal coal carriers. The company was founded in 1919 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8540",
        "website": "http://www.kline.co.jp",
        "full_time_employees": 6080
    },
    "9110.T": {
        "short_name": "NS UNITED KAIUN KA",
        "long_name": "NS United Kaiun Kaisha, Ltd.",
        "summary": "NS United Kaiun Kaisha, Ltd., together with its subsidiaries, owns and operates land and sea transportation vessels. The company operates through International Shipping and Coastal Shipping segments. It also operates as a shipping agent for land, air, and marine transportation. The company provides iron ore and coking coal transportation services; energy resources transport services; and tramp chartering services. In addition, it engages in the sale, lease, repair, and maintenance of vessels; manufacture, sale, and maintenance of shipping equipment; real estate operations; personnel placement agency operations; and property and life insurance agency operations, as well as in the provision of data-processing and business information services. The company operates in Japan, rest of Asia, Brazil, Europe, the Middle East, North America, South America, Australia, and internationally. As of March 31, 2020, it operated a fleet of 197 vessels. The company was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8108",
        "website": "http://www.nsuship.co.jp",
        "full_time_employees": null
    },
    "9119.T": {
        "short_name": "IINO KAIUN KAISHA",
        "long_name": "Iino Kaiun Kaisha, Ltd.",
        "summary": "Iino Kaiun Kaisha, Ltd. engages in shipping and real estate businesses worldwide. The company operates oil tankers, including very large crude carriers for the transport of crude oil and petroleum products; chemical tankers to transport liquid cargoes, such as petrochemical products, methanol, vegetable oil, ethanol, and lubricating oils; a fleet of large gas carriers that transport liquefied gases comprising liquefied petroleum gas (LPG) and liquefied natural gas; small gas carriers to transport LPG; and dry bulk carriers to transport coal for electric power generation, fertilizers, and wood chips for paper production. It also offers real estate services, including office leasing, building management, and warehousing services. In addition, the company provides photography studios and photo retouching services. Further, it offers hall and conference center management, accounting, IT related, insurance agency, and shipping agency and ship equipment sale services, as well as supports for general affairs and human resources-related operations. As of March 31, 2020, it operated a fleet of 105 vessels. The company was founded in 1899 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0011",
        "website": "http://www.iino.co.jp",
        "full_time_employees": null
    },
    "9127.T": {
        "short_name": "TAMAI STEAMSHIP CO",
        "long_name": "Tamai Steamship Co., Ltd.",
        "summary": "Tamai Steamship Co., Ltd. owns and operates ships primarily in Japan. It primarily transports bauxite, alumina, grain, gypsum, blast furnace slag, cement clinker, steel products, etc. The company also provides freight forwarding, manning agency, and real estate services. Tamai Steamship Co., Ltd. was founded in 1929 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0023",
        "website": "http://www.tamaiship.co.jp",
        "full_time_employees": null
    },
    "9130.T": {
        "short_name": "KYOEI TANKER CO",
        "long_name": "Kyoei Tanker Co., Ltd.",
        "summary": "Kyoei Tanker Co., Ltd. operates in the shipping industry in Japan. It provides shipping, shipping agency and brokerage, seamen's dispatch, warehousing, and non-life insurance agency services, as well as real estate, building lease, and estate agency services. The company also purchases and sells ship's stores, as well as their brokerage; purchases and sells ships; and sells petroleum and petroleum products. Kyoei Tanker Co., Ltd. was founded in 1937 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0073",
        "website": "http://www.kyoeitanker.co.jp",
        "full_time_employees": null
    },
    "9171.T": {
        "short_name": "KURIBAYASHI STEAMSHIP CO",
        "long_name": "Kuribayashi Steamship Co., Ltd.",
        "summary": "Kuribayashi Steamship Co., Ltd. engages in the marine transportation business in Japan. It transports cargo, including paper products, used raw paper, cast and forged steel products, commercial vehicles, and general merchandise. The company also provides land and sea integrated transportation services for the collection and delivery of cargoes; coastal irregular ships that transports oil refinery pressure vessels for refineries and blades for wind power generation facilities; and irregular freighter services for bulk cargo transportation, such as steel, raw sugar, rice, fertilizer, ore, etc. In addition, it is involved in ferry, hotel, and real estate leasing, ship management, equipment development and sale businesses. Kuribayashi Steamship Co., Ltd. was founded in 1894 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0004",
        "website": "http://www.kuribayashishosen.com",
        "full_time_employees": null
    },
    "9173.T": {
        "short_name": "TOKAI KISEN CO",
        "long_name": "Tokai Kisen Co., Ltd.",
        "summary": "Tokai Kisen Co., Ltd. engages in the fleet service, trading, restaurant and hotel management, food and beverage, general passenger automobile carrier, and other businesses in Japan. The company was formerly known as Tokyo Wan Kisen Co., Ltd and changed its name to Tokai Kisen Co., Ltd. in August 1964. Tokai Kisen Co., Ltd. was founded in 1889 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-6891",
        "website": "http://www.tokaikisen.co.jp",
        "full_time_employees": 312
    },
    "9176.T": {
        "short_name": "SADO STEAM SHIP CO",
        "long_name": "Sado Steam Ship Co., Ltd.",
        "summary": "Sado Steam Ship Co., Ltd. provides shipping, road, and harbor transportation services in Japan. The company's services include passengers, cars, and freight transportation. It also offers travel services. The company was incorporated in 1913 and is headquartered in Sado, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sado",
        "zipcode": "952-0014",
        "website": "http://www.sadokisen.co.jp",
        "full_time_employees": 860
    },
    "9179.T": {
        "short_name": "KAWASAKI KINKAI KISEN KAISHA",
        "long_name": "Kawasaki Kinkai Kisen Kaisha, Ltd.",
        "summary": "Kawasaki Kinkai Kisen Kaisha, Ltd. engages in the marine transportation business. The company is also involved in the marine transportation brokerage, port transportation and warehousing, cargo transportation handling, marine transportation agency, general insurance agency and life insurance solicitation, vehicle and vehicle accessories rental, and information processing and providing service activities; and oversight of ship construction and repair business. In addition, it engages in real estate sale, purchase, rental, brokerage, and management activities; gasoline stand management, automobile repair, and automobile parts sales activities; and managing restaurants, coffee shops, and gift shops. Further, the company sells folk crafts and handicrafts, agricultural and livestock products, marine products, spices, beverages, processed foods, liquor and tobacco products, and postal stamps. Kawasaki Kinkai Kisen Kaisha, Ltd. was incorporated in 1966 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0013",
        "website": "http://www.kawakin.co.jp",
        "full_time_employees": null
    },
    "9193.T": {
        "short_name": "TOKYO KISEN CO LTD",
        "long_name": "Tokyo Kisen Co., Ltd.",
        "summary": "Tokyo Kisen Co., Ltd. operates as a tug boat company in Japan. The company provides harbor tug, escort tug, pilot boats, and CTVs for offshore wind farms. It also offers transfer boats, water busses, harbor cruise ships, and car ferries. The company was founded in 1947 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "231-0023",
        "website": "http://www.tokyokisen.co.jp",
        "full_time_employees": null
    },
    "9305.T": {
        "short_name": "YAMATANE CORP",
        "long_name": "Yamatane Corporation",
        "summary": "Yamatane Corporation engages in the wholesale, import, and export of staple foods and foodstuffs in Japan. It also offers overseas moving, warehousing, harbor transport, customs clearance, cargo handling, packaging, worker dispatching, and freight forwarding services. In addition, the company designs, develops, and sells computer software and other information equipment; sells and leases computers; and offers real estate agency services, as well as casualty and life insurance. The company was formerly known as Yamatane Sangyo Co., Ltd. and changed its name to Yamatane Corporation in 1995. Yamatane Corporation was founded in 1924 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "135-8501",
        "website": "http://www.yamatane.co.jp",
        "full_time_employees": 802
    },
    "9353.T": {
        "short_name": "SAKURAJIMA FUTO KAISHA",
        "long_name": "Sakurajima Futo Kaisha, Ltd.",
        "summary": "Sakurajima Futo Kaisha, Ltd. engages in the port transportation business in Japan. The company is involved in the bulk cargo handling, such as coal, coke, raw salt, soda ash, alloyed iron, etc.; liquid cargo handling, including petroleum products, chemical products, etc.; and frozen and refrigerated cargo handling businesses, as well as logistic warehousing comprising dangerous goods, central kitchen, refrigerated warehouse, etc. It also provides barge transportation, warehousing, freight transportation, port cargo transportation, and customs clearing services. Sakurajima Futo Kaisha, Ltd. was founded in 1948 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "554-0032",
        "website": "http://www.sakurajima-futo.co.jp",
        "full_time_employees": null
    },
    "9361.T": {
        "short_name": "FUSHIKI KAIRIKU UNSO CO",
        "long_name": "Fushiki Kairiku Unso Co.,Ltd.",
        "summary": "Fushiki Kairiku Unso Co.,Ltd. provides port transportation services in Japan. The company engages in warehousing, maritime transportation, occasional route business, shipping agency, customs clearance, packing, industrial waste collection and transportation, air transport agency, and measurement certification businesses, as well as business related to contracting and guarantee of the security. It also offers used freight transportation, coastal shipping operation, cargo vehicle transportation, general insurance agent, and automobile damage compensation insurance agent services; and real estate lending and automobile disassembly maintenance services. In addition, the company processes and sells carbon materials, hydrogen peroxide, and food; and invests in related businesses. Fushiki Kairiku Unso Co.,Ltd. was founded in 1944 and is headquartered in Takaoka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Takaoka",
        "zipcode": "933-0104",
        "website": "http://www.fkk-toyama.co.jp",
        "full_time_employees": 747
    },
    "9362.T": {
        "short_name": "HYOKI KAIUN KAISHA",
        "long_name": "Hyoki Kaiun Kaisha, Ltd.",
        "summary": "Hyoki Kaiun Kaisha, Ltd. provides shipping services in Japan. It offers domestic and international shipping, ocean voyage, port transportation, warehousing, customs clearance, international combined transportation, trade agency, etc. The company was founded in 1942 and is headquartered in Kobe, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kobe",
        "zipcode": "650-0045",
        "website": "http://www.hyoki.co.jp",
        "full_time_employees": null
    },
    "9365.T": {
        "short_name": "TRADIA CORPORATION",
        "long_name": "Tradia Corporation",
        "summary": "Tradia Corporation operates as a logistics company. It offers various harbor transport and international transportation services, which cover the process of foreign trade, such as loading and landing of cargo at seaports, customs clearance, transport, storage, and inspection and distribution processing, as well as coordination of routes and expense quotes for international transportation. The company transports goods between Japan, India, China, and other Asian countries, as well as internationally. It also provides export and import services; and international freight forwarding services comprising door-to-door cargo delivery, multimodal transport, and other logistics services, as well as owns and operates warehouses and distribution centers. The company was formerly known as Dainichi Tsuun Co., Ltd. and changed its name to Tradia Corporation in April 1994. Tradia Corporation was founded in 1941 and is headquartered in Kobe, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kobe",
        "zipcode": "650-0024",
        "website": "http://www.tradia.co.jp",
        "full_time_employees": null
    },
    "9367.T": {
        "short_name": "DAITO KOUN CO LTD",
        "long_name": "Daito Koun Co.,Ltd.",
        "summary": "Daito Koun Co.,Ltd. operates as a logistics company in Japan. The company engages in the port transportation, transportation, warehousing, customs clearance, freight car transportation, packing, waste collecting, food freezing and refrigeration, worker dispatch, and non-life insurance agency businesses. It is also involved in the import/export and sale of various goods; and leasing of real estate properties. The company was formerly known as Tatsumi Shipping Co., Ltd. and changed its name to Daito Koun Co.,Ltd. in January 1961. Daito Koun Co.,Ltd. was founded in 1957 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0023",
        "website": "http://www.daito-koun.co.jp",
        "full_time_employees": null
    },
    "9380.T": {
        "short_name": "AZUMA SHIPPING CO. LTD",
        "long_name": "Azuma Shipping Co., Ltd.",
        "summary": "Azuma Shipping Co., Ltd. engages in logistics, maritime transportation, real estate, and other businesses in Japan and internationally. The company offers coastal and international shipping services; and domestic and international transportation services, including truck transportation, car-ferry transportation, project cargo, large construction machinery transportation, vessel chartering, ocean container transportation and trucking, and LCL services, as well as air freight services. It also provides export/import related services that consist of proxy services for export and import customs clearance, terminal operations, and warehousing and packing services; and third party logistics and environmental solutions. In addition, the company offers harbor transportation services, such as marine cargo handling, stevedoring, barge transportation and cargo sorting, and storage; and land transportation services, including general cargo transportation, ocean container hauling, bulk cement transportation, and removal services, as well as warehousing, warehouse and factory work contracting, and steamship company agency services. Further, it operates oceangoing/coastal cement tankers and general cargo vessels; leases real estate properties; and produces and sells agricultural products. The company was founded in 1917 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-6233",
        "website": "http://www.azumaship.co.jp",
        "full_time_employees": null
    },
    "KAIKY": {
        "short_name": "KAWASAKI KISEN KAISHA",
        "long_name": "Kawasaki Kisen Kaisha, Ltd.",
        "summary": "Kawasaki Kisen Kaisha, Ltd. provides marine, land, and air transportation services in Japan, the United States, Europe, Asia, and internationally. The company operates through Dry Bulk, Energy Resource Transport, Product Logistics, and Other segments. It offers containership services; dry bulk carrier services comprising transport of raw materials, such as coal, iron ore, wheat, soybeans, corn, etc., as well as woodchips, and pulp; car carrier services; liquefied natural gas (LNG) carrier services; marine transport of crude oil, oil derivatives, and liquefied petroleum gas (LPG) products through tankers; offshore support vessel services; offshore drilling services; and floating production storage and offloading services. The company also offers logistics services, including air and sea freight forwarding, land transportation, warehousing, and buyer's consolidation services; and operates container terminals. As of March 31, 2020, it operated a fleet of 49 short sea and coastal vessels; 46 containership vessels; 183 dry bulk carriers; 89 car carriers; 1 FPSO and drillship; 6 offshore support vessels; 17 oil tankers; and 47 LNG carriers; and 29 thermal coal carriers. The company was founded in 1919 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8540",
        "website": "http://www.kline.co.jp",
        "full_time_employees": 6080
    },
    "KLI1.F": {
        "short_name": "KAWASAKI KISEN",
        "long_name": "Kawasaki Kisen Kaisha, Ltd.",
        "summary": "Kawasaki Kisen Kaisha, Ltd. provides marine, land, and air transportation services in Japan, the United States, Europe, Asia, and internationally. The company operates through Dry Bulk, Energy Resource Transport, Product Logistics, and Other segments. It offers containership services; dry bulk carrier services comprising transport of raw materials, such as coal, iron ore, wheat, soybeans, corn, etc., as well as woodchips, and pulp; car carrier services; liquefied natural gas (LNG) carrier services; marine transport of crude oil, oil derivatives, and liquefied petroleum gas (LPG) products through tankers; offshore support vessel services; offshore drilling services; and floating production storage and offloading services. The company also offers logistics services, including air and sea freight forwarding, land transportation, warehousing, and buyer's consolidation services; and operates container terminals. As of March 31, 2020, it operated a fleet of 49 short sea and coastal vessels; 46 containership vessels; 183 dry bulk carriers; 89 car carriers; 1 FPSO and drillship; 6 offshore support vessels; 17 oil tankers; and 47 LNG carriers; and 29 thermal coal carriers. The company was founded in 1919 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8540",
        "website": "http://www.kline.co.jp",
        "full_time_employees": 6080
    },
    "MILA.F": {
        "short_name": "MITSUI OSK LINES",
        "long_name": "Mitsui O.S.K. Lines, Ltd.",
        "summary": "Mitsui O.S.K. Lines, Ltd. engages in the marine transportation business in Japan and internationally. The company operates through Dry Bulk Business, Energy Transport Business, Product Transport Business, and Associated Businesses. Its fleet consists of dry bulk carriers for the transportation of iron ore, coal, grain, wood, wood chips, cement, fertilizer, and salt; crude oil tankers; tankers that transport refined petroleum products, such as gas oils, naphtha, and gasoline; chemical tankers that transport liquid chemical products; methanol carriers; and LPG carriers. The company's fleet also includes car carriers that transport passenger cars and construction machinery; containerships; and ferries and coastal RoRo ships. In addition, it operates container terminals in Japan and internationally; floating storage and regasification units; and floating production, storage, and offloading systems, as well as offers logistics services, such as air and ocean freight forwarding, trucking, customs clearance, warehousing, inspection, and heavyweight and oversized cargo transport, as well as buyers' consolidation. Further, the company is involved in ocean shipping related businesses comprising tugboat operation, land transport, maritime consulting, travel, office building leasing, property management, finance, trading, insurance, ICT systems, temporary staffing, supporting an oil stockpile project, nautical charts, and other businesses. As of March 31, 2020, it operated 263 dry bulkers; 290 tankers, LNG carriers, and steaming coal carriers; 64 containerships; 1 cruise ship; and 186 product transport vessels, as well as 2 other vessels. The company was founded in 1884 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8688",
        "website": "http://www.mol.co.jp",
        "full_time_employees": null
    },
    "MSLOY": {
        "short_name": "MITSUI O.S.K. LINES LTD",
        "long_name": "Mitsui O.S.K. Lines, Ltd.",
        "summary": "Mitsui O.S.K. Lines, Ltd. engages in the marine transportation business in Japan and internationally. The company operates through Dry Bulk Business, Energy Transport Business, Product Transport Business, and Associated Businesses. Its fleet consists of dry bulk carriers for the transportation of iron ore, coal, grain, wood, wood chips, cement, fertilizer, and salt; crude oil tankers; tankers that transport refined petroleum products, such as gas oils, naphtha, and gasoline; chemical tankers that transport liquid chemical products; methanol carriers; and LPG carriers. The company's fleet also includes car carriers that transport passenger cars and construction machinery; containerships; and ferries and coastal RoRo ships. In addition, it operates container terminals in Japan and internationally; floating storage and regasification units; and floating production, storage, and offloading systems, as well as offers logistics services, such as air and ocean freight forwarding, trucking, customs clearance, warehousing, inspection, and heavyweight and oversized cargo transport, as well as buyers' consolidation. Further, the company is involved in ocean shipping related businesses comprising tugboat operation, land transport, maritime consulting, travel, office building leasing, property management, finance, trading, insurance, ICT systems, temporary staffing, supporting an oil stockpile project, nautical charts, and other businesses. As of March 31, 2020, it operated 263 dry bulkers; 290 tankers, LNG carriers, and steaming coal carriers; 64 containerships; 1 cruise ship; and 186 product transport vessels, as well as 2 other vessels. The company was founded in 1884 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8688",
        "website": "http://www.mol.co.jp",
        "full_time_employees": null
    },
    "NPNYY": {
        "short_name": "NIPPON YUSEN KABUSHIKI KAISHA",
        "long_name": "Nippon Yusen Kabushiki Kaisha",
        "summary": "Nippon Yusen Kabushiki Kaisha provides sea, land, and air transportation services worldwide. The company offers various logistics services, including liner trading services, such as container shipping, and terminal and stevedoring services for containerships, car carriers, and cruise ships; and air cargo transportation services. It also provides bulk shipping services comprising transport services for finished automobiles, heavy construction machines, and used cars; transportation services for bulk freight, which include iron ore, coal, and wood chips; and transportation services for crude oil, petroleum products, petrochemical products and other liquid chemicals, liquefied natural gas, and ammonia for oil, petrochemical, and energy companies. In addition, the company is involved in the upstream areas of the supply chain for oil and natural gas. Further, it operates Asuka II, a luxury cruise ship; and manages commercial and residential buildings. The company was founded in 1885 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.nyk.com",
        "full_time_employees": 34857
    },
    "NYKA.F": {
        "short_name": "NIPPON YUSEN",
        "long_name": "Nippon Yusen Kabushiki Kaisha",
        "summary": "Nippon Yusen Kabushiki Kaisha provides sea, land, and air transportation services worldwide. The company offers various logistics services, including liner trading services, such as container shipping, and terminal and stevedoring services for containerships, car carriers, and cruise ships; and air cargo transportation services. It also provides bulk shipping services comprising transport services for finished automobiles, heavy construction machines, and used cars; transportation services for bulk freight, which include iron ore, coal, and wood chips; and transportation services for crude oil, petroleum products, petrochemical products and other liquid chemicals, liquefied natural gas, and ammonia for oil, petrochemical, and energy companies. In addition, the company is involved in the upstream areas of the supply chain for oil and natural gas. Further, it operates Asuka II, a luxury cruise ship; and manages commercial and residential buildings. The company was founded in 1885 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.nyk.com",
        "full_time_employees": null
    },
    "NYUKF": {
        "short_name": "NIPPON YUSEN KABUSHIKI KAISHA",
        "long_name": "Nippon Yusen Kabushiki Kaisha",
        "summary": "Nippon Yusen Kabushiki Kaisha provides sea, land, and air transportation services worldwide. The company offers various logistics services, including liner trading services, such as container shipping, and terminal and stevedoring services for containerships, car carriers, and cruise ships; and air cargo transportation services. It also provides bulk shipping services comprising transport services for finished automobiles, heavy construction machines, and used cars; transportation services for bulk freight, which include iron ore, coal, and wood chips; and transportation services for crude oil, petroleum products, petrochemical products and other liquid chemicals, liquefied natural gas, and ammonia for oil, petrochemical, and energy companies. In addition, the company is involved in the upstream areas of the supply chain for oil and natural gas. Further, it operates Asuka II, a luxury cruise ship; and manages commercial and residential buildings. The company was founded in 1885 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.nyk.com",
        "full_time_employees": null
    }
}