{
    "1787.T": {
        "short_name": "NAKABOHTEC CORROSION PROTECTING",
        "long_name": "Nakabohtec Corrosion Protecting Co.,Ltd.",
        "summary": "Nakabohtec Corrosion Protecting Co.,Ltd. provides survey, analysis, design, engineering, work supervision, and material supply services for protecting metallic structures from corrosion. The company was formerly known as Nakagawa corrosion Industrial Co., Ltd. and changed its name to Nakabohtec Corrosion Protecting Co.,Ltd. in 1991. Nakabohtec Corrosion Protecting Co.,Ltd. was founded in 1951 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0033",
        "website": "http://www.nakabohtec.co.jp",
        "market_cap": "Small Cap"
    },
    "1Y0.F": {
        "short_name": "YAMASHINA",
        "long_name": "Yamashina Corporation",
        "summary": "Yamashina Corporation plans, manufactures, and sells metal products in Japan, China, Hong Kong, and Thailand. The company offers tapping fasteners for metals, resins, and thin plates; aluminum alloy fasteners, CFRP fasteners, loosening prevention fasteners, caulking bolts, washer built-in screws, and head shape products; and custom-made products, such as neck tight screws and small metal parts, as well as other products for weight reduction, prevention of loosening, thin plate fastening, and electric corrosion measures. It serves automobile, home appliances/industrial equipment, medical equipment, robot, and architecture industries. The company was founded in 1917 and is headquartered in Kyoto, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "607-8155",
        "website": "http://www.kk-yamashina.co.jp",
        "market_cap": "Small Cap"
    },
    "3024.T": {
        "short_name": "CREATE CORPORATION",
        "long_name": "Create Corporation",
        "summary": "Create Corporation, together with its subsidiaries, engages in the wholesale of plumbing materials under the TORO brand in Japan. The company offers plumbing fittings and water taps, water supply pipe equipment, and drainage pipe equipment; and housing equipment, such as air-conditioners. It is also involved in the import of iron castings; sale of drainage pipe fittings and drainage implements; construction and package of drainage implements; processing and production of resinous plumbing systems; construction; interior finishing works; and buildings design and building materials sales activities. The company was formerly known as Fukui Kazuo Shoten Co., Ltd. and changed its name to Create Corporation in April 1993. Create Corporation was founded in 1916 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": null,
        "website": "http://www.cr-net.co.jp",
        "market_cap": "Small Cap"
    },
    "3435.T": {
        "short_name": "SANKO TECHNO CO LTD",
        "long_name": "Sanko Techno Co., Ltd.",
        "summary": "Sanko Techno Co., Ltd. researches and develops, constructs, manufactures, and sells construction materials, composites, and waterproofing materials in Japan. Its construction materials include post-installation anchors, industrial fasteners, and drill bits. The company also provides earthquake resistant reinforcement systems to protect schools, hospitals, highways, railway bridges, and other structures from possible earthquake damage. Sanko Techno Co., Ltd. was founded in 1964 and is headquartered in Nagareyama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagareyama",
        "zipcode": null,
        "website": "http://www.sanko-techno.co.jp",
        "market_cap": "Small Cap"
    },
    "3440.T": {
        "short_name": "NISSO PRONITY CO LTD",
        "long_name": "NISSO PRONITY Co., Ltd.",
        "summary": "NISSO PRONITY Co., Ltd. provides various metal products. The company offers environment related products, panels, bed and section steel products, parking lot/bicycle parking materials, agriculture animal husbandry materials, tile materials, sheet metals, roofs, wall materials, interior and exterior materials, and others. Its products are used in various industries, including building and construction materials, environment, energy, factory and plant, parking lot, temporary/prefabricated semiconductors, agriculture, and livestock industries. The company was founded in 1983 and is headquartered in Minami, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Minami",
        "zipcode": "815-0035",
        "website": "http://www.kakou-nisso.co.jp",
        "market_cap": "Small Cap"
    },
    "3441.T": {
        "short_name": "SANNO CO LTD",
        "long_name": "SANNO Co., Ltd.",
        "summary": "SANNO Co., Ltd. engages in the precious metal surface treatment of electronic parts with the focus on connectors in Japan. The company's products are used in PC related products, mobile handsets, digital appliances, electronic cards, semiconductor facilities, gaming devices, automobile devices, and other devices. SANNO Co., Ltd. was founded in 1958 and is based in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": null,
        "website": "http://www.sanno.co.jp",
        "market_cap": "Small Cap"
    },
    "3447.T": {
        "short_name": "SHINWA CO LTD",
        "long_name": "Shinwa Co., Ltd.",
        "summary": "Shinwa Co., Ltd. provides construction and logistic equipment in Japan. It offers system and general scaffolding equipment; hanging and mesh pallets; pallets for pipes, system scaffolding, and preceding handrails; and optional parts, such as pre-installed handrails. Shinwa Co., Ltd. was founded in 1977 and is headquartered in Kaizu, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kaizu",
        "zipcode": "503-0311",
        "website": "http://www.shinwa-jp.com",
        "market_cap": "Small Cap"
    },
    "3449.T": {
        "short_name": "TECHNOFLEX CORP",
        "long_name": "Technoflex Corporation",
        "summary": "Technoflex Corporation provides flexible metal hoses, expansion joints, and multi-layer pipes. The company also offers formed bellows, vacuum components, and fluoroplastic hoses. Its products are used for various applications, such as construction pipes, city water pipes, semiconductors, iron manufacturing, shipbuilding, city gas, LP gas, electricity, thermal power, nuclear power, and general plants. The company was founded in 2001 and is headquartered in Tokyo, japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "111-0051",
        "website": "http://www.technoflex.co.jp",
        "market_cap": "Small Cap"
    },
    "5603.T": {
        "short_name": "KOGI CORPORATION",
        "long_name": "Kogi Corporation",
        "summary": "Kogi Corporation engages in casting roll-related, and machinery and environment-related businesses in Japan. The company offers various rolling rolls, steel castings, etc.; castings for steel ingot molds, automobile press dies, and industrial machinery; and public civil engineering castings, such as ground manholes, grating, iron lids for electric wire utility tunnels, etc. It also provides industrial castings, including water and sewerage, railway, and industrial machinery related parts; and continuous cast-iron rods comprising ordinary cast iron, ductile cast iron, ni-resist cast iron, and special alloy cast iron materials. In addition, the company offers blowers, transvectors, vortex schoolers, etc.; KC metal fibers and KC carbon ceramics; and stoker type waste incinerators, recycling equipment, various deodorization equipment, superheated steam application drying and carbonization equipment, etc. Kogi Corporation was founded in 1916 and is headquartered in Himeji, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Himeji",
        "zipcode": "671-1132",
        "website": "http://www.kogi.co.jp",
        "market_cap": "Small Cap"
    },
    "5644.T": {
        "short_name": "METALART CORP",
        "long_name": "Metalart Corporation",
        "summary": "Metalart Corporation engages in the manufacture, sale, and machining of hot forged, precise, and closed-die-forged products for automobiles, construction and agricultural machinery, ships, and other industrial machinery in Japan and internationally. The company primarily offers engine parts, such as crank shafts and connecting rods, as well as precision forged gears, CVT products, automatic and manual transmission parts, chassis parts, track links, and other parts, as well as assembles crawlers. It is also involved in the manufacture, heat treatment, and surface treatment of precise forged products; and hot and cold forging, hot press forging, hot hammer forging, machining, and manufacture of dies. The company was formerly known as Goto Drop Forging Co., Ltd. and changed its name to Metalart Corporation in October 1991. Metalart Corporation was founded in 1916 and is headquartered in Kusatsu, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kusatsu",
        "zipcode": "525-0059",
        "website": "http://www.metalart.co.jp",
        "market_cap": "Small Cap"
    },
    "5852.T": {
        "short_name": "AHRESTY CORPORATION",
        "long_name": "Ahresty Corporation",
        "summary": "Ahresty Corporation engages in the aluminum die casting, aluminum, and proprietary products businesses in Japan, North America, and Asia. The company engages in manufacturing and sale of auto parts, general engine parts, industrial machinery parts, and dies. It is also involved in smelting, production, and sale of aluminum alloy ingots. In addition, the company manufactures and sells MOVAFLOR, a proprietary raised floor system used in clean rooms, data centers, factories, offices, etc.; and peripheral equipment for die cast production. The company was formerly known as Fuso Light Alloys Co., Ltd. and changed its name to Ahresty Corporation in 1988. Ahresty Corporation was founded in 1938 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "164-0012",
        "website": "http://www.ahresty.co.jp",
        "market_cap": "Small Cap"
    },
    "5922.T": {
        "short_name": "NASU DENKI-TEKKO CO",
        "long_name": "Nasu Denki-Tekko Co., Ltd.",
        "summary": "Nasu Denki-Tekko Co., Ltd. manufactures and sells steel tower, steel structure, overhead wire material, transportation system materials, and underground wire materials in Japan. It offers transmission, telecommunication, and lighting towers; and overhead wire materials, such as insulators, resin covers, wire rods, and antenna support for information communication. The company also constructs communication towers, underground facilities, and road facilities, as well as engages in deterioration diagnosis and recycling of galvanized products. In addition, it provides surface treatment, such as hot-dip galvanized aluminum alloy plating, zinc phosphate treatment, and various coatings; steel pipe and composite column; and hydrogen storage alloy systems. The company serves electric power and power related, telecommunications and related companies; ministry of land, infrastructure, and transport and tourism; the ministry of internal affairs and communications; ministry of defense; other government agencies; and highway, construction, and railroad companies. Nasu Denki-Tekko Co., Ltd. was founded in 1929 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-0022",
        "website": "http://www.nasudenki.co.jp",
        "market_cap": "Small Cap"
    },
    "5955.T": {
        "short_name": "YAMASHINA CORP",
        "long_name": "Yamashina Corporation",
        "summary": "Yamashina Corporation plans, manufactures, and sells metal products in Japan, China, Hong Kong, and Thailand. The company offers tapping fasteners for metals, resins, and thin plates; aluminum alloy fasteners, CFRP fasteners, loosening prevention fasteners, caulking bolts, washer built-in screws, and head shape products; and custom-made products, such as neck tight screws and small metal parts, as well as other products for weight reduction, prevention of loosening, thin plate fastening, and electric corrosion measures. It serves automobile, home appliances/industrial equipment, medical equipment, robot, and architecture industries. The company was founded in 1917 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "607-8155",
        "website": "http://www.kk-yamashina.co.jp",
        "market_cap": "Small Cap"
    },
    "5987.T": {
        "short_name": "ONEX CORP (JAPAN)",
        "long_name": "ONEX Corporation",
        "summary": "ONEX Corporation provides metal heat treatment, remediation, and processing services in Japan. The company's metal heat treatment services include carburizing, carbonitriding, vacuum, high frequency, bright heat, and aluminum alloy heat treatment. Its services also comprise quenching and tempering, nitriding, gas nitrocarburizing, shot peening, and PVD coating treatment services, as well as heat treatments for oversized parts. The company offers its heat treatment services for a range of components used in the automotive, industrial machinery, machine tool, and construction equipment sectors. In addition, it provides logistics and information system development services. The company was formerly known as Oya Netsushori Co., Ltd. and changed its name to Onex Corporation in July 1991. Onex Corporation was founded in 1951 and is headquartered in Atsugi, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Atsugi",
        "zipcode": "243-0801",
        "website": "http://www.onex.co.jp",
        "market_cap": "Small Cap"
    },
    "5994.T": {
        "short_name": "FINE SINTER CO LTD",
        "long_name": "Fine Sinter Co., Ltd.",
        "summary": "Fine Sinter Co., Ltd. manufactures and sells automobile parts, railroad vehicle parts, and hydraulic equipment worldwide. Its automotive parts include engines, shock absorbers, transmission and parts, steering parts, body parts, and brakes. The company also offers pantograph contact strips and brake linings for railroad vehicles; industrial machinery, such as industrial machinery parts, business machines/home electric appliances, and sintered vents; and hydraulic units comprising hydraulic equipment and hydraulic packages. Fine Sinter Co., Ltd. was founded in 1950 and is headquartered in Kasugai, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kasugai",
        "zipcode": "480-0303",
        "website": "http://www.fine-sinter.com",
        "market_cap": "Small Cap"
    },
    "5999.T": {
        "short_name": "IHARA SCIENCE CORP",
        "long_name": "Ihara Science Corporation",
        "summary": "Ihara Science Corporation manufactures and sells fittings, valves, hoses, and pipes primarily in Japan, Taiwan, China, South Korea, North America, Southeast Asia, Europe, and Australia. It offers fittings, including double ferule type tube fittings, resin tube fittings, vinyl hose and weldless fittings, automatic weld fittings, metal gasket seal type fittings, metal gasket seal fittings, and swivel joints, as well as quick joint fittings, biting fittings, high-pressure screw-in/insert welded joint, hose joint, branch header piping, and inline filter. The company also provides bellow and metal diaphragm, ball, stop, stainless check, and piston valves; metal flexible tubes, precision carbon steel galvanized steel pipe, and stainless steel tubes; and tube cutters and pre-setting devices. The company was formerly known as Ihara High Pressure Fittings Co.,Ltd. and changed its name to Ihara Science Corporation in October 1997. Ihara Science Corporation was founded in 1941 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0074",
        "website": "http://www.ihara-sc.co.jp",
        "market_cap": "Small Cap"
    },
    "6138.T": {
        "short_name": "DIJET INDUSTRIAL",
        "long_name": "Dijet Industrial Co., Ltd.",
        "summary": "Dijet Industrial Co., Ltd. engages in the manufacture and sale of cemented carbide tools worldwide. It offers tuff modular system, drill, indexable and solid end mill, face mill, coated and non-coated inserts, sintered CBN and diamond inserts, cermet inserts, and wear and impact resistant tool products. The company was formerly known as Hyakunen Industrial Co., Ltd. and changed its name to Dijet Industrial Co., Ltd. in June 1954. Dijet Industrial Co., Ltd. was founded in 1938 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "547-0002",
        "website": "http://www.dijet.co.jp",
        "market_cap": "Small Cap"
    },
    "6150.T": {
        "short_name": "TAKEDA MACHINERY CO",
        "long_name": "Takeda Machinery Co., Ltd.",
        "summary": "Takeda Machinery Co., Ltd. manufactures and sells metalworking machines and tools in Japan. It provides small shaped steel processing machines, flat plate drilling machines, H-shaped steel drilling machines, and steel plate processing machines. The company also offers circular saw machines, such as shaped steel cutting, unprocessed steel cutting, and pipe cutting machines, as well as dies. Takeda Machinery Co., Ltd. was founded in 1966 and is headquartered in Nomi, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nomi",
        "zipcode": "923-1101",
        "website": "http://www.takeda-mc.co.jp",
        "market_cap": "Small Cap"
    },
    "6362.T": {
        "short_name": "ISHII IRON WORKS CO",
        "long_name": "Ishii Iron Works Co., Ltd.",
        "summary": "Ishii Iron Works Co., Ltd. operates as an engineering, procurement, and construction contractor worldwide. The company constructs low-temperature tanks and terminals; LNG tanks and satellite terminals; spherical tanks and gas holders; and atmospheric storage tanks, as well as provides maintenance services. It also provides wet and dry seal type gas holders; leisure facility works, including stainless steel swimming pool facilities, adventure sliders and coasters, tile and running pools, and tunnels, as well as swimming pools with moving floor, artificial waves, and flowing systems; and specialized construction works. In addition, the company engages in the anticorrosive film and waterproofing construction of reservoirs; and seismic analysis; and provision of waterworks equipment, such as emergency drinking water tanks, elevated water tanks, and water distribution pools, as well as environmental equipment comprising sludge digestion gas systems, combustion furnaces for surplus gas, gas processing facilities for waste, and waste disposal site gas processing facilities. Further, it provides gas generation systems that include generation plants for city gas and P-13A facilities; and steel structures, which comprise steel frames and towers for iron bridges, steel chimneys, artworks, and silos for crops, as well as rust inhibitors. Additionally, the company offers condominiums, logistics facilities, commercial facilities, and solar power generation equipment. It serves companies dealing with petroleum, chemical engineering, steel mill, electric and gas power, government authority, and various public organizations. The company was founded in 1900 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0052",
        "website": "http://www.ishii-iiw.co.jp",
        "market_cap": "Small Cap"
    },
    "6433.T": {
        "short_name": "HEPHAIST CO LTD",
        "long_name": "HEPHAIST Co., Ltd.",
        "summary": "HEPHAIST Co., Ltd. manufactures and sells linear motion parts, ultra-precision processing products, and system products in Japan. The company offers linear motion products, including linear ball bearings, linear bushes, linear bushes with flanges, miniature linear bushes, splines, and circular arc roller guides; system products, such as XYqz stages, ultrasonic stages, control devices, small manipulators, and combination stages; and precision grinding and ultra-precision finishing products, and processed parts. It also provides alignment systems, spherical rolling joints, and ordered machining products. The company was incorporated in 1962 and is headquartered in Kawagoe, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kawagoe",
        "zipcode": "350-1151",
        "website": "http://www.hephaist.co.jp",
        "market_cap": "Small Cap"
    },
    "6488.T": {
        "short_name": "YOSHITAKE INC",
        "long_name": "Yoshitake Inc.",
        "summary": "Yoshitake Inc. manufactures and sells fluid control valves in Japan and internationally. It offers pressure reducing valves, drain separators, safety and relief valves, strainers, solenoid/motor/air operated valves, temperature regulators, steam traps/radiator products, and primary pressure regulating valves. The company also provides expansion and flexible joints, sight glasses, air vents/outs, noiseless heaters and vacuum relief valves, fluid control products, assist/pumping traps, and hot water systems, as well as KAWAKI products. Its products are used in machines and plants, buildings, public facilities, and others. The company was formerly known as Yoshitake Works, Ltd. and changed its name to Yoshitake Inc. in July 1990. Yoshitake Inc. was founded in 1944 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "467-0861",
        "website": "http://www.yoshitake.jp",
        "market_cap": "Small Cap"
    },
    "6497.T": {
        "short_name": "HAMAI INDUSTRIES",
        "long_name": "Hamai Industries Ltd.",
        "summary": "Hamai Industries Ltd. manufactures and sells precision machine equipment, valves, and high-pressure gas related equipment in Japan. The company leases real estate properties. It also offers LPG cylinder valves; ball valves for factories, construction machinery, food machinery, water treatment equipment, and semiconductor manufacturing equipment; natural gas automotive valves; medical gas valves; and high pressure gas valves, as well as valves for hydrogen fuel cell vehicles, and fire extinguishers and fire extinguishing equipment; and safety plug for hydrogen tanks. The company was formerly known as Hamai Factory Limited and changed its name to Hamai Industries Ltd. in April 1991. Hamai Industries Ltd. was founded in 1927 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-8512",
        "website": "http://www.hamai-net.com",
        "market_cap": "Small Cap"
    },
    "6998.T": {
        "short_name": "NIPPON TUNGSTEN CO",
        "long_name": "Nippon Tungsten Co., Ltd.",
        "summary": "Nippon Tungsten Co., Ltd. provides rare metal and fine ceramic products primarily composed of tungsten based on powder metallurgical technology. Its products include tungsten wire and rod, tungsten ribbon and SC molybdenum; resistance welding electrodes, TD/TCP/Starter contacts, silicon nitride, and roll press machine that are used in automobile manufacturing; and heavy alloys. The company's products also consist of discharge tungsten wire, electric discharge machining electrodes for use in electric machines and tools; cemented carbides and ceramic materials for use in wear resistant and shock resistant tools; NT die cutters and fine ceramic cutting tools; seal rings and sleeves, and corrosion resistant sliding materials; and porous ceramics for transferring workpieces. In addition, it is also engaged in real estate leasing and management; renewable energy power generation business; and sale of electricity. Nippon Tungsten Co., Ltd. was founded in 1931 and is headquartered in Fukuoka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuoka City",
        "zipcode": "812-8538",
        "website": "http://www.nittan.co.jp",
        "market_cap": "Small Cap"
    },
    "7414.T": {
        "short_name": "ONOKEN CO LTD",
        "long_name": "Onoken Co., Ltd.",
        "summary": "Onoken Co., Ltd. engages in the sale, fabrication, and import/export of steel in Japan. It offers steel plates, checker plates, expanded metals, hot rolled steel coils, and wire rods; and steel in various shapes, such as H-beams, angles, channels, flat bars, steel pipes, and column steels, as well as deformed steel bars. The company also sells construction materials, which include outside walls, sashes, roofs, fences, versatile steel boards, tiles, and slates, as well as ironware products. It serves the fabrication, shipbuilding, construction, equipment manufacturing, and coil center secondary product manufacturing markets. The company was formerly known as Ono Kenzai Co., Ltd. and changed its name to Onoken Co., Ltd. in February 1957. Onoken Co., Ltd. was founded in 1925 and is headquartered in Kitakyushu, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kitakyushu",
        "zipcode": "803-8558",
        "website": "http://www.onoken.co.jp",
        "market_cap": "Small Cap"
    },
    "7637.T": {
        "short_name": "HAKUDO CO LTD",
        "long_name": "Hakudo Co., Ltd.",
        "summary": "Hakudo Co., Ltd. processes and distributes metal materials primarily in Japan, China, Thailand, and Vietnam. It offers aluminum plates, bars, and tubes; stainless steel plates; and elongated copper products, as well as special steel, titanium, and engineering plastics. The company was founded in 1932 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.hakudo.co.jp",
        "market_cap": "Small Cap"
    },
    "8087.T": {
        "short_name": "FURUSATO INDUSTRIES",
        "long_name": "Furusato Industries, Ltd.",
        "summary": "Furusato Industries,Ltd. provides steel frame building supplies for steel fabricators in Japan. It operates through Equipment & Tools, Machine & Facility, and Construction & Piping Products segments. The company also offers piping products for buildings and production facilities; automation materials and industrial equipment, such as consumable supplies and tools, and machines and tools manufacturers and retailers; and machine and tools for the automotive industry. In addition, it provides housing equipment, including kitchen equipment, bathroom equipment, washing stand, gas equipment, boiler equipment, sanitary equipment, and exterior materials; and surveillance cameras, access control equipment, other security products, and related consulting and technical services. Further, the company sells cutting tools, machine tools, and peripherals; and imports, exports, and sells building supplies, equipment, and tools. The company was formerly known as Furusato Tekkosho Ltd. and changed its name to Furusato Industries,Ltd. in 1973. Furusato Industries,Ltd. was founded in 1959 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "540-0024",
        "website": "http://www.furusato.co.jp",
        "market_cap": "Small Cap"
    }
}