{"2445.T": {"short_name": "TAKAMIYA CO LTD", "long_name": "Takamiya Co., Ltd.", "summary": "Takamiya Co., Ltd. sells and rents temporary equipment and materials for the construction sites in Japan and internationally. It operates through Rental Business, Overseas Business, and Sales Business segments. The company's temporary equipment include YT lock system that can be erected along slopes, as well as used as a gantry; VMAX, a hanging-type scaffolding that is used for bridge repair; G Walk, a catwalk panel with fewer gaps to prevent stumbling and falling objects; and dimple post X, which protects the safety and lives of workers while they are under the beams for work, including steel construction and ridge beam operations. Its temporary equipment also includes clamps, a bolted fastening-type metal fittings; standing bear that enables safe assembly and disassembly; power frame, a wedge-type support system that fits the shape of a structure flexibly; lift climber, a mechanical scaffold for skyscrapers; Iq systems; and AL-speeders. In addition, the company provides stainless steel column formwork; building and agricultural materials; and environmental equipment, such as echo barrier, a soundproof sheet that reduces noise by absorbing sound, and H2 systems. Further, it plans and draws temporary construction. The company was formerly known as SRG Takamiya Co., Ltd. and changed its name to Takamiya Co., Ltd. in April 2019. Takamiya Co., Ltd. was founded in 1969 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Rental & Leasing Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "4669.T": {"short_name": "NIPPAN RENTAL CO", "long_name": "NIPPAN RENTAL Co.,Ltd.", "summary": "NIPPAN RENTAL Co.,Ltd. engages in the rental of construction machinery and vehicles in Japan. The company rents construction machinery for civil engineering and architecture, road equipment, cars, and other general-purpose machineries. It is also involved in the sale and repair of construction equipment. The company was founded in 1979 and is headquartered in Maebashi, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Rental & Leasing Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Maebashi"}, "7081.T": {"short_name": "KOYOU RENTIA CO LTD", "long_name": "Koyou Rentia Co., Ltd.", "summary": "Koyou Rentia Co., Ltd. engages in the general furniture and equipment rental business. The company is involved in renting out furniture and equipment to companies in construction, real estate brokerage, event organization, IT, and other industries in Japan and internationally. It also provides office relocation, cleaning and repair, and office designing services, as well as operates 4 recycle shops. The company was founded in 1970 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Rental & Leasing Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7647.T": {"short_name": "ONTSU CO LTD", "long_name": "ONTSU Co.,Ltd.", "summary": "ONTSU Co.,Ltd. owns and operates conventional 100 yen shops for selling groceries. It also engages in the sale and rental of karaoke equipment and related products; wholesale and sale of sundries; management of fitness facilities and yoga studios; and wholesale and sale of daily necessities. The company was founded in 1981 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Rental & Leasing Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "8424.T": {"short_name": "FUYO GENERAL LEASE CO LTD", "long_name": "Fuyo General Lease Co., Ltd.", "summary": "Fuyo General Lease Co., Ltd. engages in leasing and installment sales business in Japan and internationally. It is involved in the lease and installment sale of IT and office equipment, industrial machinery/machine tools, commercial/service equipment, medical devices, civil engineering and construction machinery, etc., as well as transportation equipment, including ships, aircraft, automobiles, etc. The company also offers various leases comprising finance, operating, PC eco and value, auto, vendor, building, and space leases. In addition, it provides installment sales schemes for properties; rental estate financing services consisting of non-recourse real estate loans and other financing schemes. Further, the company provides aircraft operating leases; life insurance consulting services; and Web-based data and contract management service, and asset management services. It provides consulting services that identify the issues and needs inherent in customers' management and financial strategies; leasing and financing for overseas expansions; and ESCO service that comprises technology, facilities, and funds required by the customers. Fuyo General Lease Co., Ltd. was founded in 1969 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Rental & Leasing Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9619.T": {"short_name": "ICHINEN HOLDINGS", "long_name": "Ichinen Holdings Co., Ltd.", "summary": "Ichinen Holdings Co., Ltd. engages in automotive leasing, chemical, parking, machine tool sales, and synthetic resin businesses in Japan. It provides automobile leasing, fuel sales, and automotive maintenance and outsourcing services; and manufactures various chemical products to power, iron, and steel plants, as well as to repair shops and households. The company also operates parking lots and plots for facilities, such as supermarkets and hospitals, parking garages affiliated with tenant buildings, and idle lands; and offers automotive, industrial machine, air conditioning, and do-it-yourselfers tools. In addition, it manufactures and sells synthetic resins, scientific measuring instrument, electronics, amusement, and game machine parts. The company was formerly known as Kuroda Shoji Co., Ltd. and changed its name to Ichinen Holdings Co., Ltd. in 2008. Ichinen Holdings Co., Ltd. was founded in 1930 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Rental & Leasing Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "9641.T": {"short_name": "SACOS CORP", "long_name": "Sacos Corporation", "summary": "Sacos Corporation engages in the rental, leasing, import, export, and sale of machinery and equipment. It rents construction machinery, commercial cars, and office equipment. The company was formerly known as Sanko Machinery Leasing Co., Ltd. and changed its name to Sacos Corporation in September 1986. Sacos Corporation was founded in 1967 and is headquartered in Tokyo, Japan. Sacos Corporation is a subsidiary of Nishio Rent All Co., Ltd.", "currency": "JPY", "sector": "Industrials", "industry": "Rental & Leasing Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9678.T": {"short_name": "KANAMOTO CO LTD", "long_name": "Kanamoto Co.,Ltd.", "summary": "Kanamoto Co.,Ltd. engages in the construction equipment rental business in Japan and internationally. The company's products include various hand tools and construction equipment, including dump trucks, hydraulic excavators, temporary housing materials and structures, and electrical generators; and used equipment. It also supplies general steel products, including steel bar and H-beams, sheet piles, and single tube pipes; and handles contracts for various specialized works, including the construction of autoclave lightweight concrete exterior walls or insulation construction works, as well as the sale and installation of KT roof system and insulated waterproof roofing. In addition, the company rents and sells road construction equipment; furniture, fixtures, and safety products; welfare nursing care devices; shield tunneling method related peripheral equipment; specialized engineering works equipment; and nursing care products. Further, it offers nursing care, and consulting services, as well as various network solutions; produces and executes image graphics; undertakes road works construction; and rents hardware. The company was founded in 1964 and is headquartered in Sapporo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Rental & Leasing Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Sapporo"}, "9699.T": {"short_name": "NISHIO RENT ALL CO", "long_name": "Nishio Rent All Co., Ltd.", "summary": "Nishio Rent All Co., Ltd. engages in the construction machinery rental business in Japan and internationally. It rents and sells lighting systems, unmanned construction support systems, asphalt finishers, motor graders, various rollers, small-sized compactors, generators, compressors, welders, and resistors for civil and road construction projects. The company also offers specialty equipment, such as tunneling work equipment, railroad tractors and battery motorized vehicles, construction wastewater treatment systems, shoring, quality assurance, and environmental protection equipment for civil work projects. In addition, it provides various aerial platforms, maintenance equipment, forklifts, tower cranes and work platforms, and unmanned transport vehicles for plant maintenance and building works; and equipment for exhibitions, and equipment and materials for outdoor events. Additionally, it undertakes the planning, manufacture, and sale of materials designed for indoor kids play facilities; and outdoor play equipment. The company also performs the operation, transport, leasing, and contracting of construction machinery; and designs and supervises the construction of electrical equipment, as well as offers parking lot and car maintenance services. It operates through 395 rental operation division; and 57 franchise operation chain stores in Japan. The company was incorporated in 1946 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Rental & Leasing Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "9763.T": {"short_name": "MARUBENI CONSTR.MATERIAL LEASE", "long_name": "Marubeni Construction Material Lease Co.,Ltd.", "summary": "Marubeni Construction Material Lease Co.,Ltd. primarily engages in the lease, sale, repair, and fabrication of temporary steel construction materials for foundation construction work in Japan. The company primarily offers sheet piles, H-beams, steel supports, steel decks, steel plates, and earth-retaining walls for foundation construction work. It also installs and extracts piles; and undertakes earth retainment and underground continuous wall works. The company was formerly known as Marubeni Steel Construction Material Lease Co., Ltd. and changed its name to Marubeni Construction Material Lease Co.,Ltd. in October 1972. Marubeni Construction Material Lease Co.,Ltd. was founded in 1968 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Rental & Leasing Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9908.T": {"short_name": "NIHON DENKEI CO", "long_name": "Nihon Denkei Co.,Ltd.", "summary": "Nihon Denkei Co.,Ltd. trades in electronic measuring instruments in Japan and internationally. The company manufactures, distributes, leases, and rents electronic measuring instruments, system equipment, electronic parts, etc. It also provides communication measuring instruments, computers and computer supplies, automate and labor-saving machines, physics and chemistry measuring equipment, industrial application instruments, production process measuring instruments, environmental testing instruments, photonic measuring instruments, educational laboratory equipment, power supplies, electronic components, and mechanical parts. In addition, the company plans, designs, and manufactures software products and testing jigs; and rents and leases measuring instruments and used goods. Further, it is involved in contracting business, including earthworks, steel structural constructions, and interior finishing works. Nihon Denkei Co.,Ltd. was founded in 1950 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Rental & Leasing Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9991.T": {"short_name": "GECOSS CORPORATION", "long_name": "Gecoss Corporation", "summary": "Gecoss Corporation rents and sells construction machinery and steel products in Japan. It is involved in the rental and sale of temporary construction steel materials, such as H-section steel, steel sheet piles, floor iron plates, lining boards, and mountain retaining materials. The company also manufactures and sells various processed products, including steel parts for tunnel construction, special parts for temporary construction, and steel segments for sewer construction; rents, sells, and constructs temporary bridges, station building platforms, stairs, shield mounts, road bridges, and bridge collapse prevention hardware; rents cars; and rents construction machinery, such as aerial work platforms, backhoe, generators, temporary houses and lights. In addition, it undertakes design and construction of pile punching work, mountain stay construction and dismantling, soil cement column wall construction, etc. Further, the company provides planning and design, and technical support services for temporary construction works. The company was founded in 1968 and is headquartered in Tokyo, Japan. Gecoss Corporation is a subsidiary of JFE Steel Corporation.", "currency": "JPY", "sector": "Industrials", "industry": "Rental & Leasing Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}}