{
    "1909.T": {
        "short_name": "NIPPON DRY-CHEMICAL CO LTD",
        "long_name": "Nippon Dry-Chemical Co., Ltd.",
        "summary": "Nippon Dry-Chemical Co., Ltd. designs, manufactures, sells, fire extinguishing equipment, fire engines, security systems, etc. in Japan and internationally. The company offers various fire protection systems for buildings, including sprinkler systems; drencher equipment; sprinkler systems for apartment buildings; automatic fire alarm systems; water ejector sprinkler systems; indoor/outdoor hydrants; tunnel disaster prevention systems; and consolidated water pipes, as well as inert gas, powder, portable, carbon dioxide, foam, and halogen fire extinguishing systems. It also provides concentrated control systems and system machinery; and fire engines, such as general pumpers, pumper with a water tank, chemical fire engines, support vehicles, water tankers, and other various fire engines. In addition, the company offers electronics equipment; chemical plant systems; hydrant, air conditioning, and hygine systems; smoke control systems; fire extinguishing agent and emergency equipment; and fire protection systems and equipment. Further, it provides maintenance and inspection services of fire protection systems. Nippon Dry-Chemical Co., Ltd. was founded in 1955 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "114-0014",
        "website": "http://www.ndc-group.co.jp",
        "market_cap": "Small Cap"
    },
    "2331.T": {
        "short_name": "SOHGO SECURITY SERVICES CO.LTD.",
        "long_name": "Sohgo Security Services Co.,Ltd.",
        "summary": "Sohgo Security Services Co.,Ltd. provides electronic security, stationed security, and transportation security services in Japan. It offers home security systems and services, such as housework contracting and safety confirmation services for senior citizens; stalker countermeasures for women; and long-term care services. The company offers various systems for corporate customers, including online security systems, electronic security systems, condominium complex security systems, and automated management system for ATMs, as well as security systems for supporting schedule management at unmanned stores and other buildings; and damage insurance policies. In addition, it offers stationed security services, total security and robot systems, transportation security systems, cash management solutions for stores, ATM service packages, and total ATM management systems; and general property management and fire protection, building management, and call-center services, as well as automated external defibrillator, a device that administrates an electric shock. Further, the company offers other products and services for corporate customers, such as guest reception terminals, risk management tools, and security camera systems, as well as information security, specialty security, confidential document collection and recycling, test administration support, telegram, career training, BCP solution, and acquisition support services. The company was founded in 1965 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-8511",
        "website": "http://www.alsok.co.jp",
        "market_cap": "Mid Cap"
    },
    "2SW.SG": {
        "short_name": "SHIGEMATSU WORKS CO. LTD. Regis",
        "long_name": "Shigematsu Works Co., Ltd.",
        "summary": "Shigematsu Works Co., Ltd. manufactures and sells personal protective equipment, instruments, chemicals, and chemicals related to disaster prevention in Japan and internationally. The company offers dustproof masks, breathing protection equipment with electric fan, gas masks, air supply masks, air/oxygen respirators, soundproof protective equipment, protective glasses, protective clothing, protective gloves, safety belts, stretchers, oximeters, etc. It serves textile, chemical, petroleum, automobile, machinery, electricity, gas, steel, shipbuilding, heavy equipment, fishery, mining, transportation, warehousing, construction, civil engineering, and food industries, as well as government agencies. Shigematsu Works Co., Ltd. was founded in 1917 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "114-0024",
        "website": "http://www.sts-japan.com",
        "market_cap": "Small Cap"
    },
    "3782.T": {
        "short_name": "DDS INC",
        "long_name": "DDS,Inc.",
        "summary": "DDS,Inc. engages in the biometrics business in Japan. It is involved in the research, development, and sale of information technology-related products, such as fingerprint authentication systems for PCs and cell phones using biometric authentication technology. The company offers UBF fingerprint authentication products for PCs, laptops, and tablet PCs. It also provides EVE MA, a multifactor authentication platform; EVE FA, a two-factor authentication platform; Themis, a universal authentication platform; Magatama Platform, a cloud identity authentication solution; Dokodemo Personal Identification, a solution for online face-to-face personal identification; and hybrid fingerprint authentication system development kit, as well as Magatama Service, a cloud identity authentication service. In addition, the company offers customized development system covering a range of technologies and product fields. DDS,Inc. was founded in 1992 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "460-0002",
        "website": "http://www.dds.co.jp",
        "market_cap": "Small Cap"
    },
    "4342.T": {
        "short_name": "SECOM JOSHINETSU CO LTD",
        "long_name": "Secom Joshinetsu Co., Ltd.",
        "summary": "Secom Joshinetsu Co., Ltd. engages in the security, medical, general electric work, and construction businesses in Japan. It offers online security systems, including sensors and controllers that detect intrusions, fires, etc., as well as for use in the office buildings, factories, stores, ATM corners of financial institutions, and condominiums. The company also provides security services that the security guards dispatched to contractors to manage security at various facilities, such as office buildings, shopping malls, and factories; and crowd control services to guide people and cars at events and festivals to prevent accidents, as well as cash transportation services. In addition, it offers safety products, such as surveillance camera and access control systems, as well as home care related services. The company was founded in 1967 and is headquartered in Niigata, Japan. Secom Joshinetsu Co., Ltd. is a subsidiary of Secom Co., Ltd.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Niigata",
        "zipcode": "950-8557",
        "website": "http://www.secom-joshinetsu.co.jp",
        "market_cap": "Small Cap"
    },
    "4754.T": {
        "short_name": "TOSNET CORP",
        "long_name": "TOSNET Corporation",
        "summary": "TOSNET Corporation, together with its subsidiaries, provides security services in Japan. The company provides static guard services for office buildings, stores, parking lots, banks, warehouses, residences, etc.; security patrol services, including checking and responding to intruders and suspicious objects; access control by checking the identity of each person; crowd control services for festivals, concerts, sporting games, conventions, seminars, parades, expos, shop's openings, etc.; traffic control services for parking lots, construction sites, warehouses, etc.; and retail security services for grocery stores, jewelry shops, department stores, appliance stores, etc. It also supplies and installs CCTV camera, shop security mirror, and electronic article surveillance systems. In addition, the company offers power supply car services for events, concerts, sporting games, blackouts, data centers, and business continuity plans; mailing services, including wrapping, packaging, and label printing services; and building management, equipment maintenance, and cleaning services. It serves customers through its network of 82 branch offices. TOSNET Corporation was founded in 1977 and is headquartered in Sendai, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sendai",
        "zipcode": "983-0045",
        "website": "http://www.tosnet.co.jp",
        "market_cap": "Small Cap"
    },
    "6744.T": {
        "short_name": "NOHMI BOSAI",
        "long_name": "Nohmi Bosai Ltd.",
        "summary": "Nohmi Bosai Ltd. develops, markets, installs, and maintains various fire protection systems in Japan, China, other parts of Asia, and the United States. The company operates in three segments: Fire Alarm Systems, Fire Extinguishing Systems, and Maintenance Services. The Fire Alarm Systems segment offers various fire alarm systems and equipment, including automatic fire alarm systems, environmental monitoring systems, hinged fire doors, smoke control systems, and other products for homes, and commercial and industrial facilities. It also provides control panels, infrared ray flame detectors, air sampling type smoke detection systems, fire alarms and bells, transmitters, and auxiliary equipment, as well as heat, smoke, and gas detectors. The Fire Extinguishing Systems segment offers sprinklers, spray heads and nozzles, fire extinguishers, foam extinguishing systems, dry chemical extinguishing systems, heat and gas dispersion control systems, and water cannons for office buildings, leisure complexes, industrial plants and factories, road tunnels, waste incineration facilities, chemical plants, medical facilities and welfare institutions, and other specialized facilities. The Maintenance Services segment provides various maintenance and inspection services comprising telephone support services; repair services; and fire protection consulting services to building owners. The company also installs and manages parking lot driving lane control systems; and offers parking lot maintenance services. Nohmi Bosai Ltd. was founded in 1916 and is headquartered in Tokyo, Japan. Nohmi Bosai Ltd. is a subsidiary of SECOM Co., Ltd.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-8277",
        "website": "http://www.nohmi.co.jp",
        "market_cap": "Small Cap"
    },
    "6745.T": {
        "short_name": "HOCHIKI CORP",
        "long_name": "Hochiki Corporation",
        "summary": "Hochiki Corporation engages in the research and development, manufacture, sale, consulting, engineering, design, and maintenance of fire alarm, smoke control, fire extinguishing, network, and security systems in Japan and internationally. The company's fire alarm systems comprise automatic fire alarm systems, emergency alarm systems, apartment house automatic fire alarm systems, dialer to fire stations, high sensitivity aspirating smoke detection systems, smoke control systems, fire and gas leakage alarm device, and residential use smoke alarms. Its information and communication systems include TV master antenna, digital terrestrial broadcasting receiving, BS/110CS receiving, cable TV/optical transmission, public address, intercom, ITV, LAN, and network camera systems, as well as ancillary facilities for radio communication. The company's fire-extinguishing systems comprise sprinkler, apartment house sprinkler, hydrant, foam fire extinguishing, CO2 fire extinguishing, N2 fire extinguishing, water cannon, and tunnel fire prevention system. Its security systems include intruder detection and alarm, access control, and key management systems. The company was formerly known as Tokyo Hochiki Co., Ltd. and changed its name to Hochiki Corporation in July 1972. Hochiki Corporation was founded in 1918 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-8660",
        "website": "http://www.hochiki.co.jp",
        "market_cap": "Small Cap"
    },
    "6870.T": {
        "short_name": "FENWAL CONTROLS OF JAPAN",
        "long_name": "Fenwal Controls of Japan, Ltd.",
        "summary": "Fenwal Controls of Japan, Ltd. designs, develops, manufactures, and sells fire prevention, temperature control, and medical equipment in Japan. It offers residential use fire alarm, industrial explosion protection, fire extinguishing, smoke detection, and overheating alarm systems; and dialysis systems and medical equipment, as well as artwork design, anti-noise measures, and printed circuit board assembling services. The company also offers temperature controllers, temperature sensors, heat and smoke detectors, thermo-switches, and thermo-mechatronics; and hot plate and apparatus for semiconductor manufacturing equipment. Fenwal Controls of Japan, Ltd. was founded in 1961 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0072",
        "website": "http://www.fenwal.co.jp",
        "market_cap": "Small Cap"
    },
    "7058.T": {
        "short_name": "KYOEI SECURITY SERVICE CO LTD",
        "long_name": "Kyoei Security Service Co., Ltd.",
        "summary": "Kyoei Security Service Co., Ltd. engages in security guard and worker dispatching business in Japan. It offers worker dispatching services for access control, patrols, opening/closing hall management, key management, disaster prevention equipment monitoring, emergency response, traffic induction, toll collection, checkout machines handling, regulation monitoring, accident prevention, personal protection, acceptance of companies/office buildings/hospitals, commercial facilities information, firefighting and rescue activities, facility management and cleaning, etc. The company was founded in 1985 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0074",
        "website": "http://www.kyoei-ss.co.jp",
        "market_cap": "Small Cap"
    },
    "7464.T": {
        "short_name": "SAFTEC CO LTD",
        "long_name": "Saftec Co.,Ltd.",
        "summary": "Saftec Co.,Ltd. provides safety products to the construction industry in Japan. It rents solar sign boards, color cones, parcel supplies, barricades, fencing products, traffic light, safety equipment, regulated cars, bulletin boards, helmets, signal lights/hand flags/lights, armbands, fire extinguishers/benches/ wastebasket/ladder, display boards, corner cushion/nets, illumination products, post cone/ delineator/road marking materials, remote camera, safety boots, and fall prevention equipment. The company was founded in 1952 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "113-0033",
        "website": "http://www.saftec.co.jp",
        "market_cap": "Small Cap"
    },
    "7734.T": {
        "short_name": "RIKEN KEIKI CO LTD",
        "long_name": "Riken Keiki Co., Ltd.",
        "summary": "Riken Keiki Co., Ltd. manufactures and sells gas detection and monitoring equipment worldwide. It offers gas detection and indicator alarm systems for continuous monitoring; portable/personal gas monitors; portable gas leak checkers; entrusted experiment for measurement of leaked gas diffusion; toxic gas monitors/indicator alarm units; oxygen monitor alarm systems; portable combination gas monitors; optical gas indicator gas detection tubes; auto-emission and surface analyzers; gas indicators for medical use; and SALCON, a portable salinity analyzer. Riken Keiki Co., Ltd. was founded in 1939 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "174-8744",
        "website": "http://www.rikenkeiki.co.jp",
        "market_cap": "Small Cap"
    },
    "7980.T": {
        "short_name": "SHIGEMATSU WORKS CO",
        "long_name": "Shigematsu Works Co., Ltd.",
        "summary": "Shigematsu Works Co., Ltd. manufactures and sells personal protective equipment, instruments, chemicals, and chemicals related to disaster prevention in Japan and internationally. The company offers dustproof masks, breathing protection equipment with electric fan, gas masks, air supply masks, air/oxygen respirators, soundproof protective equipment, protective glasses, protective clothing, protective gloves, safety belts, stretchers, oximeters, etc. It serves textile, chemical, petroleum, automobile, machinery, electricity, gas, steel, shipbuilding, heavy equipment, fishery, mining, transportation, warehousing, construction, civil engineering, and food industries, as well as government agencies. Shigematsu Works Co., Ltd. was founded in 1917 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "114-0024",
        "website": "http://www.sts-japan.com",
        "market_cap": "Small Cap"
    },
    "9735.T": {
        "short_name": "SECOM CO",
        "long_name": "SECOM CO., LTD.",
        "summary": "SECOM CO., LTD. provides security services in Japan and internationally. The company's Security Services segment provides online security systems, static guard services, armored car services. Its Fire Protection Services segment provides automatic fire alarm systems, fire extinguishing systems, other fire protection systems, and related maintenance services to office buildings, plants, tunnels, cultural properties, ships and residences. This segment also provides maintenance services. The company's Medical Services segment offers home medical services; operates general hospital, pharmacies, and residences for seniors; provides electronic medical report systems; health and preventative care services; and sells medical equipment and pharmaceuticals. Its Insurance Services Segment provides fire insurance, automobile insurance, and cancer treatment insurance services. The company's Geospatial Information Services segment provides geospatial information services to public-sector entities, including national and local governments; private sector customers; and to overseas government agencies. Its BPO and ICT Services segment offers data center services, disaster preparedness services, BCP support services, information security services, cloud-based services, and BPO services. The Real Estate and Other Services segment engages in development and sale of condominiums equipped with distinctive security and disaster preparedness features, as well as real estate leasing, construction, installation, and other services. The company also offers electrical engineering, general office, credit, clerical, and software development services; sells security and water-treatment equipment; operates PFI correctional facilities, restaurants and shops at medical facilities; and provides lifestyle support and car maintains services, as well as sells and maintains freight elevators. The company was founded in 1962 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0001",
        "website": "http://www.secom.co.jp",
        "market_cap": "Large Cap"
    },
    "9740.T": {
        "short_name": "CENTRAL SECURITY PATROLS CO",
        "long_name": "Central Security Patrols Co., Ltd.",
        "summary": "Central Security Patrols Co., Ltd. provides security services in Japan. The company offers resident security services, such as facility security, fire and disaster prevention safety management, and VIPs personal protection services; online and home security services; and transportation security for cash and valuables, as well as sells non-life insurance linked to machine security contracts. It also constructs and sells surveillance camera/image surveillance systems; and entrance/exit management systems, as well as undertakes crime, fire, and disaster prevention equipment and facilities installation works. The company was founded in 1966 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "163-0831",
        "website": "http://www.we-are-csp.co.jp",
        "market_cap": "Small Cap"
    },
    "SOMLF": {
        "short_name": "SECOM CO",
        "long_name": "SECOM CO., LTD.",
        "summary": "SECOM CO., LTD. provides security services in Japan and internationally. The company's Security Services segment provides online security systems, static guard services, armored car services. Its Fire Protection Services segment provides automatic fire alarm systems, fire extinguishing systems, other fire protection systems, and related maintenance services to office buildings, plants, tunnels, cultural properties, ships and residences. This segment also provides maintenance services. The company's Medical Services segment offers home medical services; operates general hospital, pharmacies, and residences for seniors; provides electronic medical report systems; health and preventative care services; and sells medical equipment and pharmaceuticals. Its Insurance Services Segment provides fire insurance, automobile insurance, and cancer treatment insurance services. The company's Geospatial Information Services segment provides geospatial information services to public-sector entities, including national and local governments; private sector customers; and to overseas government agencies. Its BPO and ICT Services segment offers data center services, disaster preparedness services, BCP support services, information security services, cloud-based services, and BPO services. The Real Estate and Other Services segment engages in development and sale of condominiums equipped with distinctive security and disaster preparedness features, as well as real estate leasing, construction, installation, and other services. The company also offers electrical engineering, general office, credit, clerical, and software development services; sells security and water-treatment equipment; operates PFI correctional facilities, restaurants and shops at medical facilities; and provides lifestyle support and car maintains services, as well as sells and maintains freight elevators. The company was founded in 1962 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0001",
        "website": "http://www.secom.co.jp",
        "market_cap": "Large Cap"
    },
    "SOMLY": {
        "short_name": "SECOM CO",
        "long_name": "SECOM CO., LTD.",
        "summary": "SECOM CO., LTD. provides security services in Japan and internationally. The company's Security Services segment provides online security systems, static guard services, armored car services. Its Fire Protection Services segment provides automatic fire alarm systems, fire extinguishing systems, other fire protection systems, and related maintenance services to office buildings, plants, tunnels, cultural properties, ships and residences. This segment also provides maintenance services. The company's Medical Services segment offers home medical services; operates general hospital, pharmacies, and residences for seniors; provides electronic medical report systems; health and preventative care services; and sells medical equipment and pharmaceuticals. Its Insurance Services Segment provides fire insurance, automobile insurance, and cancer treatment insurance services. The company's Geospatial Information Services segment provides geospatial information services to public-sector entities, including national and local governments; private sector customers; and to overseas government agencies. Its BPO and ICT Services segment offers data center services, disaster preparedness services, BCP support services, information security services, cloud-based services, and BPO services. The Real Estate and Other Services segment engages in development and sale of condominiums equipped with distinctive security and disaster preparedness features, as well as real estate leasing, construction, installation, and other services. The company also offers electrical engineering, general office, credit, clerical, and software development services; sells security and water-treatment equipment; operates PFI correctional facilities, restaurants and shops at medical facilities; and provides lifestyle support and car maintains services, as well as sells and maintains freight elevators. The company was founded in 1962 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0001",
        "website": "http://www.secom.co.jp",
        "market_cap": "Large Cap"
    },
    "XSC.F": {
        "short_name": "SECOM CO. LTD",
        "long_name": "SECOM CO., LTD.",
        "summary": "SECOM CO., LTD. provides security services in Japan and internationally. The company's Security Services segment provides online security systems, static guard services, armored car services. Its Fire Protection Services segment provides automatic fire alarm systems, fire extinguishing systems, other fire protection systems, and related maintenance services to office buildings, plants, tunnels, cultural properties, ships and residences. This segment also provides maintenance services. The company's Medical Services segment offers home medical services; operates general hospital, pharmacies, and residences for seniors; provides electronic medical report systems; health and preventative care services; and sells medical equipment and pharmaceuticals. Its Insurance Services Segment provides fire insurance, automobile insurance, and cancer treatment insurance services. The company's Geospatial Information Services segment provides geospatial information services to public-sector entities, including national and local governments; private sector customers; and to overseas government agencies. Its BPO and ICT Services segment offers data center services, disaster preparedness services, BCP support services, information security services, cloud-based services, and BPO services. The Real Estate and Other Services segment engages in development and sale of condominiums equipped with distinctive security and disaster preparedness features, as well as real estate leasing, construction, installation, and other services. The company also offers electrical engineering, general office, credit, clerical, and software development services; sells security and water-treatment equipment; operates PFI correctional facilities, restaurants and shops at medical facilities; and provides lifestyle support and car maintains services, as well as sells and maintains freight elevators. The company was founded in 1962 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0001",
        "website": "http://www.secom.co.jp",
        "market_cap": "Large Cap"
    }
}