{
    "1RH.F": {
        "short_name": "RECRUIT HOLDINGS CO.LTD",
        "long_name": "Recruit Holdings Co., Ltd.",
        "summary": "Recruit Holdings Co., Ltd. provides employment information services in Japan and internationally. It operates through three segments: HR Technology, Media & Solutions, and Staffing. The company operates Indeed.com, a job aggregator search engine; and Glassdoor, an online job platform and company information site. It also operates Suumo, an online platform and print media, which provides information related to home purchases, sales, rentals, and renovation services; Zexy, a magazine and online platform providing information to organize customized wedding events; Study Sapuri Shinro, an online platform and print media, which provides higher education and career information primarily for high school students; Study Sapuri, an online learning support platform for students and adults; and Car Sensor that provides information on pre-owned automobiles for potential buyers. In addition, the company operates Jalan, a site offering travel information and accommodation booking for travel; Hot Pepper Gourmet, an online booking site information about restaurants and discount coupons, as well as online reservations and a scheduling function for invited guests; Hot Pepper Beauty, a domestic search and booking site for hair, relaxation, and beauty salons; AirRegi and AirPAY provides support services to dining and beauty enterprise clients; Rikunabi, a job information site for soon-to-be graduates; Rikunabi Next, a job portal site for people looking to change jobs; Recruit Agent, an employment agency staffed with career advisors; and Townwork, a magazine that provides information on job openings to part-time job seekers. Further, it offers clerical and IT staffing agency; light industrial staffing; human capital outsourcing; IT and digital recruitment services specializing in contracting and permanent recruitment; and human resources services, products, and technologies to organizations and individuals. The company was founded in 1960 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-6640",
        "website": "http://recruit-holdings.com",
        "market_cap": "Large Cap"
    },
    "2124.T": {
        "short_name": "JAC RECRUITMENT CO LTD",
        "long_name": "JAC Recruitment Co., Ltd.",
        "summary": "JAC Recruitment Co., Ltd. operates as a recruitment consultancy in Japan and internationally. The company provides recruitment services for medium-to-high-income job positions, such as specialists, middle management positions, and executives. It provides its services under the JAC Recruitment, JAC Digital, JAC International, VantagePoint, JAC Executive, and CareerCross brands. The company was formerly known as JAC Japan Co., Ltd. and changed its name to JAC Recruitment Co., Ltd. in 2009. JAC Recruitment Co., Ltd. was founded in 1975 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0051",
        "website": "http://corp.jac-recruitment.jp",
        "market_cap": "Small Cap"
    },
    "2154.T": {
        "short_name": "BENEXT-YUMESHIN GRP CO",
        "long_name": "BeNext-Yumeshin Group Co.",
        "summary": "BeNext-Yumeshin Group Co. engages in engineer dispatching, subcontracting, outsourcing, and recruiting business for the technology and manufacturing fields in Japan and internationally. It is also involved in the development of automotive software; and dispatching, placement, and introduction of personnel. In addition, the company offers employment for disabled people. The company was formerly known as BeNEXT Group Inc. and changed its name to BeNext-Yumeshin Group Co. in April 2021. BeNext-Yumeshin Group Co. was founded in 1959 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0021",
        "website": "http://www.benext.co.jp",
        "market_cap": "Small Cap"
    },
    "2163.T": {
        "short_name": "ARTNER CO LTD",
        "long_name": "Artner Co.,Ltd.",
        "summary": "Artner Co.,Ltd. provides worker dispatching and employment placement services in Japan. The company is also involved in the design and development of machinery, electronic devices, and electric circuits; and development of software. It serves engineers and corporate clients. Artner Co.,Ltd. was founded in 1962 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "222-0033",
        "website": "http://www.artner.co.jp",
        "market_cap": "Micro Cap"
    },
    "2168.T": {
        "short_name": "PASONA GROUP INC",
        "long_name": "Pasona Group Inc.",
        "summary": "Pasona Group Inc. provides human resource-related support services in Japan. It offers temporary staffing, contracting, HR consulting, education and training, global sourcing, placement/recruiting, outplacement, outsourcing, and other services, as well as life and public solutions. The company was founded in 1976 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8228",
        "website": "http://www.pasonagroup.co.jp/english/company/outline_g_e.html",
        "market_cap": "Small Cap"
    },
    "2181.T": {
        "short_name": "PERSOL HOLDINGS CO LTD",
        "long_name": "Persol Holdings Co., Ltd.",
        "summary": "Persol Holdings Co., Ltd. provides human resource services under the PERSOL brand worldwide. The company offers general worker dispatching, permanent placement, outsourcing, and other services. It also provides temporary staffing services, such as clerical work, research, clinical development, sales, and light work; outsourcing services, including clerical work, government office contract, call center, helpdesk, CRO, and manufacturing; and temporary job placement services. In addition, the company offers permanent placement mid-career and new grad recruitment; career change media and direct recruiting; executive and advisory placement; outplacement support; and career training services. Further, it provides IT and business outsourcing, digital solutions and system development, business consulting, and engineering services; and digital solutions, such as employment, human resources management, and education, as well as incubation programs. Additionally, the company offers equipment/facility maintenance, outsourcing, human resource management consulting, and education/training services. The company was formerly known as Temp Holdings Co., Ltd. and changed its name to Persol Holdings Co., Ltd. in July 2017. The company was incorporated in 2008 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0062",
        "website": "http://www.persol-group.co.jp",
        "market_cap": "Mid Cap"
    },
    "2301.T": {
        "short_name": "GAKUJO CO LTD",
        "long_name": "Gakujo Co., Ltd.",
        "summary": "Gakujo Co., Ltd. provides human resource and recruitment services in Japan. The company engages in the new graduate and mid-career recruitment, employment support, career change events, and job-hunting support activities. It also provides internship career support, training, and recruitment tool production services, as well as recruitment outsourcing and advertising services. The company was founded in 1976 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0061",
        "website": "http://www.gakujo.ne.jp",
        "market_cap": "Micro Cap"
    },
    "2410.T": {
        "short_name": "CAREER DESIGN CENTER CO.LTD.",
        "long_name": "Career Design Center Co., Ltd.",
        "summary": "Career Design Center Co., Ltd. provides human resource services in Japan. It operates job change sites; and provides job fair, recruitment, IT dispatch, new graduate recruitment support, and career change services, as well as information magazines and events for job hunting. The company was founded in 1993 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0052",
        "website": "http://www.type.jp",
        "market_cap": "Micro Cap"
    },
    "2427.T": {
        "short_name": "OUTSOURCING INC",
        "long_name": "OUTSOURCING Inc.",
        "summary": "OUTSOURCING Inc., together with its subsidiaries, provides engineering, manufacturing, and service operations outsourcing services in Japan and internationally. It operates through Domestic Engineering Outsourcing Business; Domestic Manufacturing Outsourcing Business; Domestic Service Operations Outsourcing Business; Overseas Engineering Outsourcing Business; Overseas Manufacturing and Service Operations Outsourcing Business; and Other segments. The company engages in the design, development, and experiment/evaluation process; development of telecommunication-related applications for websites/smartphones, and ecommerce websites; development of foundational IT systems and infrastructure networks; provision of outsourcing services for research and development operations in medical-and chemical-related areas operation of construction plans and design planning, and construction; and operation of IT schools, etc. It also offers construction management services; production technologies and management services for outsourcing manufacturing operations; outsourcing services for recruiting fixed-term employees; administrative work outsourcing services, including labor management and housing management for foreign technical interns, etc.; and job hunting support for employees. In addition, the company provides outsourcing services to government offices, such as U.S. military facilities, as well as convenience stores, call centers, etc.; dispatch services for IT engineers and finance-related experts; human resource services for manufacturing-related production; outsourcing, dispatching and recruiting of personnel services for administrative and service-related work; payroll services; BPO services and temporary worker dispatching for public institutions; and cross-border employment services. Additionally, it develops, manufactures, and markets products. The company was founded in 1997 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.outsourcing.co.jp",
        "market_cap": "Mid Cap"
    },
    "2429.T": {
        "short_name": "WORLD HOLDINGS CO LTD",
        "long_name": "World Holdings Co., Ltd.",
        "summary": "World Holdings Co., Ltd. engages in the human resources and education, information and telecommunications, and real estate businesses. It offers temporary staffing, business contracting, and personnel introduction services; and manufacturing, office, construction engineer, and sales staff dispatch services. It also provides geographic information system development, discipline education and training, administrative consignment, and clinical trial consignment services; hospitality outsourcing; and cameras and digital equipment, and precision instruments repair services. In addition, the company is also involved in the software outsourcing and development business; condominium sales and management, residential land sales, building management, real estate consulting and brokerage, real estate development, renovation, and leasing management businesses; construction and sale of single-family detached homes; and design, development, sales, and rental of prefabricated houses. Further, it provides telemarketing and corporate solutions; operates cellphone shops; offers Web production and creative services; and manages agricultural parks and personal computer schools. The company was formerly known as World Intec Co., Ltd. and changed its name to World Holdings Co., Ltd. in July 2014. World Holdings Co., Ltd. was founded in 1993 and is headquartered in Fukuoka City, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuoka City",
        "zipcode": "812-0011",
        "website": "http://www.world-hd.co.jp",
        "market_cap": "Small Cap"
    },
    "2475.T": {
        "short_name": "WDB HOLDINGS CO LTD",
        "long_name": "WDB Holdings Co., Ltd.",
        "summary": "WDB Holdings Co., Ltd. provides human resource services in Japan. The company offers placement and dispatching services for research and development in the biopharma and chemical sectors; and specified dispatching services for research and development in the engineering sectors. It also provides safety information management support services; data management and statistical analysis for clinical trials/post marketing surveillance; and consulting services and dossier preparation for product-registrarion services. In addition, the company offers clinical trial services in pharmacovigilance and analytics; clinical monitoring, data management, statistical analysis, and safety information management support services; research and development services in drug discovery research; and custom synthetic services for drug discovery research. Further, it develops and manufactures an assortment of devices, including gas-assist injection molding machines, nitrogen generators, and bio-related devices. WDB Holdings Co., Ltd. was founded in 1985 and is headquartered in Himeji, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Himeji",
        "zipcode": "670-0964",
        "website": "http://www.wdbhd.co.jp",
        "market_cap": "Small Cap"
    },
    "30T.F": {
        "short_name": "TECHNOPRO HOLDINGS INC.",
        "long_name": "TechnoPro Holdings, Inc.",
        "summary": "TechnoPro Holdings, Inc., through its subsidiaries, operates as a technology-focused staffing and services company in Japan and internationally. The company offers engineer dispatch, contract assignment, outsourced development, placement, and offshoring services in the machinery, electrics and electronics, embedded controls, information systems, IT infrastructure, software development and maintenance, civil engineering, production plant, architecture, chemistry, biotechnology, and construction areas. It also offers IT system integration and package products; application development and IT consulting services; assessment, inspection, design, and supervision services of buildings; employment services for people with disabilities; and education and training services for CAD, programming, network construction, web design, PC operation, Microsoft office, etc. In addition, the company provides engineering consultancy and offshore development services; and recruitment process outsourcing services, as well as operates as a recruitment agency. The company was formerly known as Prompt Holdings, Inc. and changed its name to TechnoPro Holdings, Inc. in April 2012. TechnoPro Holdings, Inc. was founded in 1995 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "106-6135",
        "website": "http://www.technoproholdings.com",
        "market_cap": "Mid Cap"
    },
    "3900.T": {
        "short_name": "CROWDWORKS INC",
        "long_name": "CrowdWorks Inc.",
        "summary": "CrowdWorks Inc. provides crowdsourcing services in Japan. The company operates CrowdWorks, a crowdsourcing platform that connects companies with individuals over the Internet enabling orders to be placed and accepted for work; and Crowdtech, a project matching service platform for freelancers and companies. It also offers specialized project matching services for the needs of online work; 3-days-a-week work services to freelancers; coach and student lesson matching services; specialized side job/second business matching services for high-value professionals; and Software as a service. CrowdWorks Inc. was founded in 2011 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-6006",
        "website": "http://crowdworks.co.jp",
        "market_cap": "Micro Cap"
    },
    "3991.T": {
        "short_name": "WANTEDLY INC",
        "long_name": "Wantedly, Inc.",
        "summary": "Wantedly, Inc. engages in the planning, development, and management of business SNS services. It offers business card management applications. The company was founded in 2010 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0071",
        "website": "http://wantedlyinc.com",
        "market_cap": "Micro Cap"
    },
    "4290.T": {
        "short_name": "PRESTIGE INTERNATIONAL INC",
        "long_name": "Prestige International Inc.",
        "summary": "Prestige International Inc. provides business process outsourcing services in Japan and internationally. It offers roadside assistance services for nonlife insurance companies, car manufacturers, and car dealerships; and property assistance services, such as home and parking assistance services for real estate management companies, parking lot operators, and car sharing service operators. The company also provides insurance BPO services, including travel insurance claim agent services and health care programs; and extended warranties for automobiles, rental guarantees, household equipment warranties, and nursing care expense guarantees. In addition, it offers contact service-related IT infrastructure; CRM, accident reception, and credit card issuance and operation services; and temporary worker services. Further, the company provides support for implementing supply-chain management; offers co-signing, rental property businesses management, living support, rent guarantee, towing, and rehabilitation day services; and develops and provides sales promotion systems and value-added services. Prestige International Inc. was founded in 1986 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0083",
        "website": "http://www.prestigein.com",
        "market_cap": "Small Cap"
    },
    "4318.T": {
        "short_name": "QUICK CO LTD",
        "long_name": "Quick Co.,Ltd.",
        "summary": "QUICK CO.,LTD. provides human resource and information services in Japan and internationally. The company offers recruitment advertisement planning, and handling services, as well as human resources consultancy, education and training, and other services; personnel placement, temporary staffing, temporary-to-permanent staffing, and business contracting services; and personnel and labor consulting, advisory, and other services. It also publishes and posts information magazines; offers posting and concierge services; and operates Nihon no Jinjibu, a human resources department Website with information related to personnel and other labor-related subjects. QUICK CO.,LTD. was founded in 1980 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0018",
        "website": "http://www.919.jp",
        "market_cap": "Micro Cap"
    },
    "4336.T": {
        "short_name": "CRIE ANABUKI INC",
        "long_name": "Crie Anabuki Inc.",
        "summary": "Crie Anabuki Inc. operates as a human resources service company in Japan. It offers temporary staffing, temporary to permanent placement, recruitment support, human resources consulting, training and assessment, and outplacement services, as well as business management or personnel management outsourcing services. The company was incorporated in 1986 and is headquartered in Takamatsu, Japan. Crie Anabuki Inc. is a subsidiary of Anabuki Kosan Inc.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Takamatsu",
        "zipcode": "760-0026",
        "website": "http://www.crie.co.jp",
        "market_cap": "Nano Cap"
    },
    "4433.T": {
        "short_name": "HITO-COMMUNICATIONS HOLDINGS IN",
        "long_name": "HITO-Communications Holdings,Inc.",
        "summary": "HITO-Communications Holdings,Inc., through its subsidiary, HITO-Communications,Inc., provides outsourcing, temporary staffing, and placement services; and engages in the e-commerce/television commerce support business, wholesale business, etc., in Japan. It offers sales and marketing services for various products from consumables to durables. The company also provides sales promotion services, including store and booth design; in-store point of purchase design and production; planning, design, and administration for domestic and international exhibitions; and planning and implementation of action plans to attract customers. In addition, it offers temporary and permanent staffing, training and employment agency services; call center services, including inbound and outbound services and multilingual support in Chinese, English, Korean, Thai, and others; and inbound service for visitors from abroad. Further, the company provides staffing services for the tourism industry, which include tour conductor staffing, bus tour guide staffing, hotel and resort facility staffing, interpreter staffing, licensed interpreter/guide staffing, document translation, and tourism business-related clerical work. Additionally, it offers miscellaneous support services, such as meeting/seminars for companies; company trips/training trips; international meetings/society meetings, and summit meetings; and culture/sporting events, and exhibition/trade fair. The company was founded in 1998 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "170-0013",
        "website": "http://www.hitocom-hd.com/ja/index.html",
        "market_cap": "Small Cap"
    },
    "4641.T": {
        "short_name": "ALTECH CORPORATION",
        "long_name": "Altech Corporation",
        "summary": "Altech Corporation provides technical and engineer assignment services in Japan and internationally. The company offers staffing solutions, including assignment/contracting in technical/administrative fields; welfare solutions, such as the cultivation of nursing care staff, assignment/introduction of staff to nursing care facilities, and introduction of residents to nursing care facilities; and education solutions comprising working professional/technical training for new and mid-career employees. It also provides engineering solutions/technical support services comprising engineers staffing service; contracting/outsourcing services; and contract partners/total business solutions. In addition, the company designs, manufactures, and installs plant and factory equipment; offers installation and electric wiring services for transportation systems inside clean room factories; and provides staff assignment, staff introduction, and total staffing services. Further, it provides agriculture staffing services; business solutions for nursing care; and training care person services. The company serves manufacturing companies of machinery, electricity and precision instrument, and information processing and communication businesses, as well as listed and blue-chip companies. Altech Corporation was founded in 1968 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "220-6218",
        "website": "http://www.alpsgiken.co.jp",
        "market_cap": "Small Cap"
    },
    "4834.S": {
        "short_name": "CAREER BANK",
        "long_name": "CAREER BANK Co., Ltd.",
        "summary": "CAREER BANK Co., Ltd. primarily engages in the dispatching of general workers and fee-charging employment placement business. It operates through Manpower Dispatching, Manpower Dispatching (Kanto), Recruitment, Re-employment Support, Payroll, and Others segments. The company also provides sales outsourcing services; counselling and training services for re-employment; payroll services; and language training services. CAREER BANK Co., Ltd. was founded in 1987 and is headquartered in Sapporo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "SAP",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sapporo",
        "zipcode": "060-0005",
        "website": "http://www.career-bank.co.jp",
        "market_cap": "Nano Cap"
    },
    "4848.T": {
        "short_name": "FULLCAST HOLDINGS",
        "long_name": "Fullcast Holdings Co., Ltd.",
        "summary": "Fullcast Holdings Co., Ltd. provides human resource solutions in Japan. It operates through Short-Term Operational Support Business; Sales Support Business; and Security, Other Businesses segments. The company offers short-term personnel services; security services primarily for public facilities and ordinary corporations; short-term human resources services in various business fields, including distribution, warehouses, retail, services, and call centers; and charged employment placement services. It also provides human resources services to an active senior primarily in the Tokyo metropolitan area; human resources services specializing in drivers; and staffing services primarily for foreign nationals. In addition, the company offers data entry, order management contracting, credit screening agency services, invoice agency and processing, payment management operations, order management, and book keeping and accounting contracting services. Further, it provides housekeeping, manned guarding, street and traffic security services, etc.; and human resources services for reception, as well as real estate leasing, payroll management outsourcing, and management advisory services. Additionally, the company engages in the sales support of telecommunications products and call center operations. The company was founded in 1990 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0031",
        "website": "http://www.fullcastholdings.co.jp",
        "market_cap": "Small Cap"
    },
    "59R.F": {
        "short_name": "PERSOL HOLDINGS CO. LTD.",
        "long_name": "Persol Holdings Co., Ltd.",
        "summary": "Persol Holdings Co., Ltd. provides human resource services under the PERSOL brand worldwide. The company offers general worker dispatching, permanent placement, outsourcing, and other services. It also provides temporary staffing services, such as clerical work, research, clinical development, sales, and light work; outsourcing services, including clerical work, government office contract, call center, helpdesk, CRO, and manufacturing; and temporary job placement services. In addition, the company offers permanent placement mid-career and new grad recruitment; career change media and direct recruiting; executive and advisory placement; outplacement support; and career training services. Further, it provides IT and business outsourcing, digital solutions and system development, business consulting, and engineering services; and digital solutions, such as employment, human resources management, and education, as well as incubation programs. Additionally, the company offers equipment/facility maintenance, outsourcing, human resource management consulting, and education/training services. The company was formerly known as Temp Holdings Co., Ltd. and changed its name to Persol Holdings Co., Ltd. in July 2017. The company was incorporated in 2008 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0062",
        "website": "http://www.persol-group.co.jp",
        "market_cap": "Mid Cap"
    },
    "6028.T": {
        "short_name": "TECHNOPRO HOLDINGS INC",
        "long_name": "TechnoPro Holdings, Inc.",
        "summary": "TechnoPro Holdings, Inc., through its subsidiaries, operates as a technology-focused staffing and services company in Japan and internationally. The company offers engineer dispatch, contract assignment, outsourced development, placement, and offshoring services in the machinery, electrics and electronics, embedded controls, information systems, IT infrastructure, software development and maintenance, civil engineering, production plant, architecture, chemistry, biotechnology, and construction areas. It also offers IT system integration and package products; application development and IT consulting services; assessment, inspection, design, and supervision services of buildings; employment services for people with disabilities; and education and training services for CAD, programming, network construction, web design, PC operation, Microsoft office, etc. In addition, the company provides engineering consultancy and offshore development services; and recruitment process outsourcing services, as well as operates as a recruitment agency. The company was formerly known as Prompt Holdings, Inc. and changed its name to TechnoPro Holdings, Inc. in April 2012. TechnoPro Holdings, Inc. was founded in 1995 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "106-6135",
        "website": "http://www.technoproholdings.com",
        "market_cap": "Mid Cap"
    },
    "6070.T": {
        "short_name": "CAREERLINK CO LTD",
        "long_name": "Careerlink Co., Ltd.",
        "summary": "Careerlink Co., Ltd. provides human resource services in Japan. It offers human resource services for business process outsourcing, customer relationship management, and sales support related businesses; and general office works. The company also provides temporary staffing, recruitment, and contracting human resource services for food processing and manufacturing/processing businesses, and cleaning of buildings and hotels, etc. The company was founded in 1996 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "163-0433",
        "website": "http://www.careerlink.co.jp",
        "market_cap": "Micro Cap"
    },
    "6098.T": {
        "short_name": "RECRUIT HOLDINGS CO LTD",
        "long_name": "Recruit Holdings Co., Ltd.",
        "summary": "Recruit Holdings Co., Ltd. provides employment information services in Japan and internationally. It operates through three segments: HR Technology, Media & Solutions, and Staffing. The company operates Indeed.com, a job aggregator search engine; and Glassdoor, an online job platform and company information site. It also operates Suumo, an online platform and print media, which provides information related to home purchases, sales, rentals, and renovation services; Zexy, a magazine and online platform providing information to organize customized wedding events; Study Sapuri Shinro, an online platform and print media, which provides higher education and career information primarily for high school students; Study Sapuri, an online learning support platform for students and adults; and Car Sensor that provides information on pre-owned automobiles for potential buyers. In addition, the company operates Jalan, a site offering travel information and accommodation booking for travel; Hot Pepper Gourmet, an online booking site information about restaurants and discount coupons, as well as online reservations and a scheduling function for invited guests; Hot Pepper Beauty, a domestic search and booking site for hair, relaxation, and beauty salons; AirRegi and AirPAY provides support services to dining and beauty enterprise clients; Rikunabi, a job information site for soon-to-be graduates; Rikunabi Next, a job portal site for people looking to change jobs; Recruit Agent, an employment agency staffed with career advisors; and Townwork, a magazine that provides information on job openings to part-time job seekers. Further, it offers clerical and IT staffing agency; light industrial staffing; human capital outsourcing; IT and digital recruitment services specializing in contracting and permanent recruitment; and human resources services, products, and technologies to organizations and individuals. The company was founded in 1960 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-6640",
        "website": "http://recruit-holdings.com",
        "market_cap": "Large Cap"
    },
    "6194.T": {
        "short_name": "ATRAE INC",
        "long_name": "Atrae, Inc.",
        "summary": "Atrae, Inc. plans, develops, and manages job information Websites in Japan. It operates Green, a job site that provides a proposal of job offers to job seekers and talents to companies; yenta, a matching app that connects business professionals utilizing AI technology; and wevox, an engagement analysis tool, as well as provides stress check test services. Atrae, Inc. was founded in 2003 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "106-0045",
        "website": "http://atrae.co.jp",
        "market_cap": "Small Cap"
    },
    "6198.T": {
        "short_name": "CAREER CO LTD",
        "long_name": "CAREER CO., LTD.",
        "summary": "CAREER CO., LTD. provides human resources services in Japan. The company engages in general worker dispatch, outsourcing, job consulting and advertisement, and paid employment placement businesses. It also offers temporary staffing services. CAREER CO., LTD. was founded in 2009 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "154-0004",
        "website": "http://careergift.co.jp",
        "market_cap": "Nano Cap"
    },
    "6538.T": {
        "short_name": "CAREERINDEX INC",
        "long_name": "CareerIndex Inc.",
        "summary": "CareerIndex Inc. operates job related Internet platforms in Japan. The company operates CAREER INDEX that provides job change services; Lacotto, which provides part-time job information service; Fashion HR, a job change information platform for the fashion and apparel industries; and Leadle that provides sales support service for human resources companies. It also provides DOOR Rental that provides rental condominium, apartment, and rental single-family property information; and Cashback A, a rental information site where client can get a congratulatory money when they decide to move in. CareerIndex Inc. was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0071",
        "website": "http://careerindex.co.jp",
        "market_cap": "Micro Cap"
    },
    "6539.T": {
        "short_name": "MATCHING SERVICE JAPAN CO LTD",
        "long_name": "Matching Service Japan Co., Ltd.",
        "summary": "Matching Service Japan Co., Ltd. engages in the recruitment business in Japan. The company offers services in the areas of accounting, finance, human resources, general affairs, legal affairs, accounting office, lawyer, certified public accountant, tax accountant, etc. The company was founded in 1990 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0071",
        "website": "http://www.jmsc.co.jp",
        "market_cap": "Micro Cap"
    },
    "6551.T": {
        "short_name": "TSUNAGU GROUP HOLDINGS INC",
        "long_name": "Tsunagu Group Holdings, Inc.",
        "summary": "Tsunagu Group Holdings, Inc. provides career consulting services primarily for part-time jobs in Japan. It is involved in the recruitment agency activities; various consulting activities in the areas of general human resources, and personnel and general affairs; and human resource development/training, personnel placement and paid employment placement, general worker dispatching, and promotion support businesses. The company was formerly known as Tsunagu Solutions Inc. and changed its name to Tsunagu Group Holdings, Inc. in November 2018. Tsunagu Group Holdings, Inc. was founded in 2007 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0006",
        "website": "http://www.tsunagu.co.jp",
        "market_cap": "Nano Cap"
    },
    "6558.T": {
        "short_name": "COOKBIZ CO LTD",
        "long_name": "Cookbiz Co.,Ltd.",
        "summary": "Cookbiz Co.,Ltd. provides human resource services specializing in the food industry. The company offers paid employment, recruitment site management, and training services. It also provides job advertisement, talent agency, and scout services. In addition, the company operates Cook Biz Food College, which supports skill improvement. Cookbiz Co.,Ltd. was founded in 2007 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0012",
        "website": "http://cookbiz.co.jp",
        "market_cap": "Nano Cap"
    },
    "6563.T": {
        "short_name": "MIRAI WORKS INC",
        "long_name": "Mirai Works Inc.",
        "summary": "Mirai Works Inc. provides hiring recruitment/procurement support services in Japan. It offers Freeconsultant.jp, a business matching service for freelance consultants; Professional career, a job change support; Glocal Mission Jobs, a local career change support platform for professional human resources and local areas; Adult intern, a re-employment support service with trial operation for freelancer; and Skill Shift, a side business matching platform that connects professional human resources in urban areas with local companies. The company was founded in 2012 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0021",
        "website": "http://mirai-works.co.jp",
        "market_cap": "Nano Cap"
    },
    "6569.T": {
        "short_name": "NISSO CORPORATION",
        "long_name": "Nisso Corporation",
        "summary": "Nisso Corporation provides human resources services in Japan. The company operates in two segments, General Human Resources Service Business and Other Businesses. It offers contracting services, such as manufacturing, and maintenance and design work contracting; human resources and employment placement dispatching services, including skilled staff, employment placement, supervisor, general, engineer, and manufacturing dispatching; recruitment services comprising operators, office workers, managers, specialist, etc.; and temporary staffing services. The company also provides labor management support services consisting of recruitment, labor management, company housing management, and vehicle operation management agent services; contracting consulting services; and education and training services. In addition, it offers nursing care and home nursing care facility services; and light work contracting services, as well as engages in the sale of goods. The company was founded in 1971 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "222-0033",
        "website": "http://www.nisso.co.jp",
        "market_cap": "Micro Cap"
    },
    "7043.T": {
        "short_name": "ALUE CO LTD",
        "long_name": "Alue Co.,Ltd.",
        "summary": "Alue Co.,Ltd. provides human resources development, employee training, and HR consulting services to companies within the IT, manufacturing, and financial fields in Japan. The company was founded in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0073",
        "website": "http://www.alue.co.jp",
        "market_cap": "Nano Cap"
    },
    "7045.T": {
        "short_name": "TSUKUI STAFF CORP",
        "long_name": "Tsukui Staff Corporation",
        "summary": "Tsukui Staff Corporation engages in worker dispatch projects, paid employment introduction business, and education and training projects in Japan. The company was founded in 2016 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "233-0002",
        "website": "http://www.tsukui-staff.net",
        "market_cap": "Nano Cap"
    },
    "7059.T": {
        "short_name": "COPRO-HOLDINGS CO LTD",
        "long_name": "COPRO-HOLDINGS. Co., Ltd.",
        "summary": "COPRO-HOLDINGS. Co., Ltd., a temporary staffing agency, dispatches construction engineers in Japan. The company was founded in 2006 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "450-6427",
        "website": "http://www.copro-h.co.jp",
        "market_cap": "Micro Cap"
    },
    "7064.T": {
        "short_name": "HOWTELEVISION INC",
        "long_name": "Howtelevision, Inc.",
        "summary": "Howtelevision,Inc. operates and manages a carrier platform in Japan. The company's carrier platform offers students a growth environment through internships and job hunting activities; and provides content, such as company information, and recruitment information. It also provides Liiga, a career improvement support service for working people. The company was founded in 2010 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0002",
        "website": "http://howtelevision.co.jp",
        "market_cap": "Nano Cap"
    },
    "7080.T": {
        "short_name": "SPORTSFIELD CO LTD",
        "long_name": "Sportsfield Co., Ltd.",
        "summary": "Sportsfield Co., Ltd. engages in the recruitment support business in Japan. It is involved in the planning and operation of Sponavi joint employment seminars and Sponavi bytes; planning and management of Sponavi agent, employment site, Sponavi career, and Sponavi intern; management of Sponavi shop; and employment guidance, education and training, and recruitment consulting, and subsidy consulting businesses. The company was incorporated in 2010 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "162-0845",
        "website": "http://www.sports-f.co.jp",
        "market_cap": "Nano Cap"
    },
    "7088.T": {
        "short_name": "FORUM ENGINEERING INC",
        "long_name": "Forum Engineering Inc.",
        "summary": "Forum Engineering Inc. engages in workers dispatch and paid job placement businesses. It offers mechanical/electrical engineer staffing, student employment support, corporate training, in-house engineer position matching system, and mechanical/electrical engineer job-change support services. The company was founded in 1981 and is based in Minato, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Minato",
        "zipcode": "105-6024",
        "website": "http://www.forumeng.co.jp",
        "market_cap": "Micro Cap"
    },
    "7089.T": {
        "short_name": "FOR STARTUPS INC",
        "long_name": "for Startups, Inc.",
        "summary": "for Startups, Inc. operates growth industry support platform in Japan. The company was founded in 2016 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "106-6036",
        "website": "http://forstartups.com",
        "market_cap": "Nano Cap"
    },
    "7367.T": {
        "short_name": "CELM INC",
        "long_name": "CELM,Inc.",
        "summary": "Celm, Inc. provides corporate in-house training and human resource development consulting services. It also offers organizational development consulting, organization survey, and personnel system design services. The company was founded in 1995 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0013",
        "website": "http://www.celm.co.jp",
        "market_cap": "Micro Cap"
    },
    "7781.T": {
        "short_name": "HIRAYAMA HOLDINGS CO LTD",
        "long_name": "HIRAYAMA HOLDINGS Co.,Ltd.",
        "summary": "HIRAYAMA HOLDINGS Co.,Ltd. operates as a manufacturing support company in Japan. The company provides in-sourcing and temporary staffing services, including manufacturing outsourcing, and manufacturing temporary staffing and personnel placement services; and engineer placement and entrusted development engineer services, such as dispatching its engineer staff to the engineering section of its clients. It also offers GENBA KAIZEN consulting, and human resources development and education/management services. The company was formerly known as HIRAYAMA Co.,Ltd. and changed its name to HIRAYAMA HOLDINGS Co.,Ltd. in March 2017. HIRAYAMA HOLDINGS Co.,Ltd. was founded in 1955 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0075",
        "website": "http://www.hirayamastaff.co.jp",
        "market_cap": "Nano Cap"
    },
    "9610.T": {
        "short_name": "WILSON LEARNING WORLDWIDE INC",
        "long_name": "Wilson Learning Worldwide Inc.",
        "summary": "Wilson Learning Worldwide Inc. provides human resource and organizational development consulting and solutions in Japan, China, Europe, North America, Asia Pacific, and internationally. It assesses, develops, delivers, reinforces, and sustains learning solutions. The company offers solutions for sales and leadership, including employee engagement, salesforce development, leadership development, strategy alignment, business transformation, and workforce upskilling, as well as learning solutions. It serves clients in 50 countries and 30 languages. The company was founded in 1965 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0001",
        "website": "http://www.global.wilsonlearning.com",
        "market_cap": "Nano Cap"
    },
    "9744.T": {
        "short_name": "MEITEC CORPORATION",
        "long_name": "Meitec Corporation",
        "summary": "Meitec Corporation provides dispatch engineering solutions to manufacturing companies in Japan. It offers engineering solutions, including mechanical design, electrical/electronic design, software development, chemical engineering, and analysis/evaluation. The company was formerly known as Nagoya Technical Center Co., Ltd. and changed its name to Meitec Corporation in 1985. Meitec Corporation was founded in 1974 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.meitec.co.jp",
        "market_cap": "Small Cap"
    },
    "9D4.F": {
        "short_name": "PASONA GROUP INC.",
        "long_name": "Pasona Group Inc.",
        "summary": "Pasona Group Inc. provides human resource-related support services in Japan. It offers temporary staffing, contracting, HR consulting, education and training, global sourcing, placement/recruiting, outplacement, outsourcing, and other services, as well as life and public solutions. The company was founded in 1976 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8228",
        "website": "http://www.pasonagroup.co.jp/english/company/outline_g_e.html",
        "market_cap": "Small Cap"
    },
    "MJ1.MU": {
        "short_name": "MEITEC CORP.",
        "long_name": "Meitec Corporation",
        "summary": "Meitec Corporation provides dispatch engineering solutions to manufacturing companies in Japan. It offers engineering solutions, including mechanical design, electrical/electronic design, software development, chemical engineering, and analysis/evaluation. The company was formerly known as Nagoya Technical Center Co., Ltd. and changed its name to Meitec Corporation in 1985. Meitec Corporation was founded in 1974 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.meitec.co.jp",
        "market_cap": "Small Cap"
    },
    "RCRRF": {
        "short_name": "RECRUIT HOLDINGS CO LTD",
        "long_name": "Recruit Holdings Co., Ltd.",
        "summary": "Recruit Holdings Co., Ltd. provides employment information services in Japan and internationally. It operates through three segments: HR Technology, Media & Solutions, and Staffing. The company operates Indeed.com, a job aggregator search engine; and Glassdoor, an online job platform and company information site. It also operates Suumo, an online platform and print media, which provides information related to home purchases, sales, rentals, and renovation services; Zexy, a magazine and online platform providing information to organize customized wedding events; Study Sapuri Shinro, an online platform and print media, which provides higher education and career information primarily for high school students; Study Sapuri, an online learning support platform for students and adults; and Car Sensor that provides information on pre-owned automobiles for potential buyers. In addition, the company operates Jalan, a site offering travel information and accommodation booking for travel; Hot Pepper Gourmet, an online booking site information about restaurants and discount coupons, as well as online reservations and a scheduling function for invited guests; Hot Pepper Beauty, a domestic search and booking site for hair, relaxation, and beauty salons; AirRegi and AirPAY provides support services to dining and beauty enterprise clients; Rikunabi, a job information site for soon-to-be graduates; Rikunabi Next, a job portal site for people looking to change jobs; Recruit Agent, an employment agency staffed with career advisors; and Townwork, a magazine that provides information on job openings to part-time job seekers. Further, it offers clerical and IT staffing agency; light industrial staffing; human capital outsourcing; IT and digital recruitment services specializing in contracting and permanent recruitment; and human resources services, products, and technologies to organizations and individuals. The company was founded in 1960 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-6640",
        "website": "http://recruit-holdings.com",
        "market_cap": "Large Cap"
    },
    "RCRUY": {
        "short_name": "RECRUIT HOLDINGS CO LTD",
        "long_name": "Recruit Holdings Co., Ltd.",
        "summary": "Recruit Holdings Co., Ltd. provides employment information services in Japan and internationally. It operates through three segments: HR Technology, Media & Solutions, and Staffing. The company operates Indeed.com, a job aggregator search engine; and Glassdoor, an online job platform and company information site. It also operates Suumo, an online platform and print media, which provides information related to home purchases, sales, rentals, and renovation services; Zexy, a magazine and online platform providing information to organize customized wedding events; Study Sapuri Shinro, an online platform and print media, which provides higher education and career information primarily for high school students; Study Sapuri, an online learning support platform for students and adults; and Car Sensor that provides information on pre-owned automobiles for potential buyers. In addition, the company operates Jalan, a site offering travel information and accommodation booking for travel; Hot Pepper Gourmet, an online booking site information about restaurants and discount coupons, as well as online reservations and a scheduling function for invited guests; Hot Pepper Beauty, a domestic search and booking site for hair, relaxation, and beauty salons; AirRegi and AirPAY provides support services to dining and beauty enterprise clients; Rikunabi, a job information site for soon-to-be graduates; Rikunabi Next, a job portal site for people looking to change jobs; Recruit Agent, an employment agency staffed with career advisors; and Townwork, a magazine that provides information on job openings to part-time job seekers. Further, it offers clerical and IT staffing agency; light industrial staffing; human capital outsourcing; IT and digital recruitment services specializing in contracting and permanent recruitment; and human resources services, products, and technologies to organizations and individuals. The company was founded in 1960 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-6640",
        "website": "http://recruit-holdings.com",
        "market_cap": "Large Cap"
    },
    "TCCPY": {
        "short_name": "TECHNOPRO HOLDINGS INC SPON ADS",
        "long_name": "TechnoPro Holdings, Inc.",
        "summary": "TechnoPro Holdings, Inc., through its subsidiaries, operates as a technology-focused staffing and services company in Japan and internationally. The company offers engineer dispatch, contract assignment, outsourced development, placement, and offshoring services in the machinery, electrics and electronics, embedded controls, information systems, IT infrastructure, software development and maintenance, civil engineering, production plant, architecture, chemistry, biotechnology, and construction areas. It also offers IT system integration and package products; application development and IT consulting services; assessment, inspection, design, and supervision services of buildings; employment services for people with disabilities; and education and training services for CAD, programming, network construction, web design, PC operation, Microsoft office, etc. In addition, the company provides engineering consultancy and offshore development services; and recruitment process outsourcing services, as well as operates as a recruitment agency. The company was formerly known as Prompt Holdings, Inc. and changed its name to TechnoPro Holdings, Inc. in April 2012. TechnoPro Holdings, Inc. was founded in 1995 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "106-6135",
        "website": "http://www.technoproholdings.com",
        "market_cap": "Mid Cap"
    },
    "TXHPF": {
        "short_name": "TECHNOPRO HOLDINGS INC",
        "long_name": "TechnoPro Holdings, Inc.",
        "summary": "TechnoPro Holdings, Inc., through its subsidiaries, operates as a technology-focused staffing and services company in Japan and internationally. The company offers engineer dispatch, contract assignment, outsourced development, placement, and offshoring services in the machinery, electrics and electronics, embedded controls, information systems, IT infrastructure, software development and maintenance, civil engineering, production plant, architecture, chemistry, biotechnology, and construction areas. It also offers IT system integration and package products; application development and IT consulting services; assessment, inspection, design, and supervision services of buildings; employment services for people with disabilities; and education and training services for CAD, programming, network construction, web design, PC operation, Microsoft office, etc. In addition, the company provides engineering consultancy and offshore development services; and recruitment process outsourcing services, as well as operates as a recruitment agency. The company was formerly known as Prompt Holdings, Inc. and changed its name to TechnoPro Holdings, Inc. in April 2012. TechnoPro Holdings, Inc. was founded in 1995 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "106-6135",
        "website": "http://www.technoproholdings.com",
        "market_cap": "Mid Cap"
    }
}