{
    "3064.T": {
        "short_name": "MONOTARO CO.LTD",
        "long_name": "MonotaRO Co., Ltd.",
        "summary": "MonotaRO Co., Ltd., together with its subsidiaries, operates an online MRO products store in Japan and internationally. It offers products in various categories, such as safety protection equipment, work clothes, and safety shoes; logistics, storage, and packing supplies; tapes; safety supplies/safety signs; office supplies; office furniture/lighting/cleaning supplies; cutting tools/abrasives; measurement/surveying supplies; work/electric/pneumatic tools; spray/oil/grease/paint/adhesion/repair/welding supplies; and agricultural materials/gardening supplies. The company also provides building hardware products, building materials, and painting interior supplies; air conditioning/electrical equipment materials/electrical materials; piping/water supply/pump/pneumatic/hydraulic equipment/hose products; mechanical parts; control equipment/solder/static electricity countermeasure supplies; screws/bolts/nails/materials; car/truck supplies; motorcycle/bicycle supplies; kitchen equipment/kitchen products/store supplies; scientific research and development/clean room supplies; and medical/long-term care products. It serves factories, construction, automobile maintenance, and other industries. The company was formerly known as Sumisho Grainger Co., Ltd. and changed its name to MonotaRO Co., Ltd. in 2006. MonotaRO Co., Ltd. was founded in 2000 and is headquartered in Amagasaki, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Amagasaki",
        "zipcode": "660-0876",
        "website": "http://www.monotaro.com",
        "market_cap": "Large Cap"
    },
    "3173.T": {
        "short_name": "COMINIX CO LTD",
        "long_name": "Cominix Co.,Ltd.",
        "summary": "Cominix Co., Ltd. operates as a specialized trading company in Japan and internationally. It distributes cutting and wear-resisting tools, optical products, precision measuring instruments, tooling systems, peripheral equipment, and environmental equipment. The company offers its products under Cominix brand name. The company was founded in 1945 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "542-0061",
        "website": "http://www.cominix.jp",
        "market_cap": "Mid Cap"
    },
    "5658.T": {
        "short_name": "NICHIA STEEL WORKS",
        "long_name": "Nichia Steel Works, Ltd.",
        "summary": "Nichia Steel Works, Ltd. manufactures and sells iron and steel products in Japan. It offers iron wires, zinc-plated iron wires, colored galvanized iron wires, and galvanized deformed coil rebars, as well as zinc, aluminum, and magnesium alloy plated iron wires; tertiary fences and wires; and civil engineering and architectural processed and pre-mesh processed products. The company also provides hard steel wires, galvanized steel wires, piano wires, zinc/aluminum/magnesium alloy plated steel wires, colored galvanized steel wires, steel flat wires, iron flat wires, deformed wires, stranded wires, coupling coils, and one-touch tunnels. In addition, it offers high strength and hexagon bolts, and hot dip galvanized high strength bolts. The company serves customers in industries, including construction and civil engineering, as well as agriculture, forestry, animal husbandry, fishery, electric power communication, and automobile industries. Nichia Steel Works, Ltd. was founded in 1908 and is headquartered in Amagasaki, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Amagasaki",
        "zipcode": "660-0083",
        "website": "http://www.nichiasteel.co.jp",
        "market_cap": "Large Cap"
    },
    "5659.T": {
        "short_name": "NIPPON SEISEN CO",
        "long_name": "Nippon Seisen Co.,Ltd.",
        "summary": "Nippon Seisen Co.,Ltd. manufactures and sells stainless steel wires in Japan and internationally. Its stainless steel wires include spring, micro, cold heading, shaft, weaving, and high-alloy/titanium wires for use in used in vehicles, aircraft, office automation appliances, electric appliances, medical instruments, commodities, and leisure goods, as well as screws, steel nettings, etc. The company also offers filament yarn, cloth, tape/belt, felt, knit, sleeve, chop, and other metal fibers. In addition, it provides filters, such as metal filters, including NASLON filters, NPM filters, EXCEL PORE, FINE MET, and re-washable systems for synthetic fiber, film, resin, nuclear and thermal power generation, petroleum refining, medical, and other applications; and semiconductor gas filters for process and bulk gases, component protection, integrated gas panels, and diffusers. Further, the company offers straight bars; and flat, angular, precise, and other shaped wires. The company was formerly known as The Sanshin Special Wire Manufacturing Company and changed its name to Nippon Seisen Co.,Ltd. in October 1956. Nippon Seisen Co.,Ltd. was founded in 1951 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0043",
        "website": "http://www.n-seisen.co.jp",
        "market_cap": "Large Cap"
    },
    "5851.T": {
        "short_name": "RYOBI LTD",
        "long_name": "Ryobi Limited",
        "summary": "Ryobi Limited, together with its subsidiaries, operates as a die casting manufacturer in Japan, the United States, China, and internationally. The company operates through Die Castings, Builders' Hardware, and Printing Equipment segments. It offers die cast products comprising cylinder blocks, transmission cases, and sub frames for use in the automobile industry; builders' hardware, such as sliding door closers, floor hinges, and concealed and overhead concealed door closers, as well as architectural hardware, such as as door stoppers/door holders, door guards, flush bolts, and door coordinators; and printing equipment, including offset printing presses, peripherals, etc. The company also manufactures and sells aluminum forged products. Ryobi Limited was founded in 1943 and is headquartered in Fuchu, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fuchu",
        "zipcode": "726-8628",
        "website": "http://www.ryobi-group.co.jp",
        "market_cap": "Large Cap"
    },
    "5945.T": {
        "short_name": "TENRYU SAW MFG CO",
        "long_name": "Tenryu Saw Mfg. Co., Ltd.",
        "summary": "Tenryu Saw Mfg. Co., Ltd. manufactures and sells saw blades in Japan and internationally. The company offers cutting tools, such as carbide tools for ferrous and non-ferrous metals, as well as wood applications; cutters, routers, and grinds; HSS tools; and steel center for diamond saw blade, circular and band saw blades, circular knives, and miter saw blades. It also offers machines for carbide tipped saw blades, including ultrasonic bath for saw blade; and band saw processing machines comprising automatic band saw welders, levelers, heat-tensioning machines, hard-facing alloy tipping machines, hard-facing alloy rough grinders, side grinders, and saw sharpeners, as well as narrow band saw sharpeners. Tenryu Saw Mfg. Co., Ltd. was founded in 1909 and is based in Fukuroi, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuroi",
        "zipcode": "437-1195",
        "website": "http://www.tenryu-saw.com",
        "market_cap": "Large Cap"
    },
    "5950.T": {
        "short_name": "JAPAN POWER FASTENING CO",
        "long_name": "Japan Power Fastening Co.,Ltd.",
        "summary": "Japan Power Fastening Co., Ltd. engages in the manufacture and sale of fasteners and related tools in Japan. Its fasteners and related tools are used in residential and general construction, and civil engineering, including prefabricated housing applications. The company also manufactures and sells parts for automobiles and home appliances; and leases real estate properties. Japan Power Fastening Co., Ltd. was founded in 1951 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "531-0076",
        "website": "http://www.jpf-net.co.jp",
        "market_cap": "Mid Cap"
    },
    "5952.T": {
        "short_name": "AMATEI INCORPORATED",
        "long_name": "Amatei Incorporated",
        "summary": "Amatei Incorporated engages in the manufacture and sale of nails, screws, nailers, and building materials in Japan. It offers ordinary and special nails, as well as various connecting nails. The company was founded in 1901 and is headquartered in Amagasaki, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Amagasaki",
        "zipcode": "660-0862",
        "website": "http://www.amatei.co.jp",
        "market_cap": "Mid Cap"
    },
    "5957.T": {
        "short_name": "NITTOSEIKO CO LTD",
        "long_name": "Nittoseiko Co.,Ltd.",
        "summary": "Nittoseiko Co.,Ltd. manufactures and sells screws, automated assembly systems, and inspection equipment in Japan and internationally. It provides various types of screw products, such as precision and loose-proof screws, cold forged parts, screw manufacturing tools, metal and plastic fastening screws, drive recesses, heads, bearing points, surface treatment products, and other metal parts. The company manufactures screw driving motors, handheld type screw drivers, single spindle and multi spindle screw driving machines, screw driving robots, screw feeders, caulking machines, assembly robots, and conveyors. It also offers flow meters, receivers/converters, micro-bubble washers, products for marine and batch applications, machines for SWS and SDS tests, and inspection systems, well as measuring and instrumentation systems. The company was founded in 1938 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "623-0054",
        "website": "http://www.nittoseiko.co.jp",
        "market_cap": "Large Cap"
    },
    "5962.T": {
        "short_name": "ASAKA INDUSTRIAL CO",
        "long_name": "Asaka Industrial Co., Ltd.",
        "summary": "Asaka Industrial Co., Ltd. manufactures and sells shovels, scoops, farming tools, gardening tools, physical distribution system components, and store fixtures in Japan. The company was founded in 1661 and is headquartered in Sakai, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sakai",
        "zipcode": "590-0982",
        "website": "http://www.asaka-ind.co.jp",
        "market_cap": "Small Cap"
    },
    "5964.T": {
        "short_name": "TOYO KNIFE CO LTD",
        "long_name": "Toyo Knife Co., Ltd.",
        "summary": "Toyo Knife Co., Ltd. produces and sells industrial knives and cutters in Japan and internationally. It offers steel knives, paper-related knives, and various other deformed knives, as well as industrial machinery and parts. The company was founded in 1925 and is headquartered in Tomiya, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tomiya",
        "zipcode": "981-3311",
        "website": "http://www.toyoknife.co.jp",
        "market_cap": "Small Cap"
    },
    "5966.T": {
        "short_name": "KYOTO TOOL CO LTD",
        "long_name": "Kyoto Tool Co., Ltd.",
        "summary": "Kyoto Tool Co., Ltd. produces and sells work tools for automobile maintenance, other general tools, and relative apparatus in Japan and internationally. It also provides precision molded tools; and high-precision machine tool parts and industrial machine parts. The company's products include tool sets; tool storage products; measuring instruments; building/equipment; general purpose, conventional, insulation, automobile, motorcycle, cycle, medical equipment, plumbing, and power tools; apparel; goods; and garage items and others. It offers its products under the nepros, KTC, TRASAS, Digirache, and FF WORLD brands. The company was founded in 1950 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "613-0034",
        "website": "http://www.ktc.co.jp",
        "market_cap": "Mid Cap"
    },
    "5967.T": {
        "short_name": "TONE CO LTD",
        "long_name": "Tone Co., Ltd.",
        "summary": "Tone Co., Ltd. develops, manufactures, and sells professional machines and work tools, industrial power tools, and torque management equipment under the TONE brand name in Asia, North America, Europe, and internationally. The company's products comprise stainless steel and titanium tools, tool set and cases, working tools, saving effort tools, specialized car equipment and cycle tools, torque wrenches, air tools, electric power tools, and other hand and other tools. It primarily serves general, construction, automotive, bridge construction, plant engineering, transportation, and alternative energy industries. The company was formerly known as Maeda Metal Industries, Ltd. and changed its name to Tone Co., Ltd. in November 2013. Tone Co., Ltd. was founded in 1938 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "556-0017",
        "website": "http://www.tonetool.co.jp",
        "market_cap": "Mid Cap"
    },
    "5969.T": {
        "short_name": "LOBTEX CO LTD",
        "long_name": "Lobtex Co., Ltd.",
        "summary": "Lobtex Co., Ltd. manufactures and sells various tools worldwide. It offers electrical, hydraulic, cutting, working, and fastening tools, as well as industrial fasteners. The company also provides general hand tools, such as wrenches, equipment/piping tools, socket wrenches, electric drill sockets, clamps, nejianguirus, and hammers, as well as pliers, cutters, and nippers; and electrician tools, including crimping tools, strippers, and oil-hydraulic punchers. In addition, it offers fasteners and fastening tools that include riveters, nut rivet setters, auto rivet feeders, AP rivets, blind rivets, S-bolts, eco boxes, ST locks, blind nut rivets, blind nut rivets with serration, anchors and plugs, lobster hammer drill bit SDS-plus shank, and caulking chipper products; ALC, cast iron pipe, concrete/block/brick, file/dresser, roofing tile, tile, slot cutting/repairing, road surface cutting/grinding, and resin diamond tools; tool sets; and carbide tipped saws for steel, stainless steel, ceramic, aluminum, and other, as well as hole saws and stage drills. The company sells its products under the LOBSTER brand name. Lobtex Co., Ltd. was founded in 1888 and is headquartered in Higashi-Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Higashiosaka",
        "zipcode": "579-8053",
        "website": "http://www.lobtex.co.jp",
        "market_cap": "Small Cap"
    },
    "5971.T": {
        "short_name": "KYOWAKOGYOSYO CO",
        "long_name": "Kyowakogyosyo Co.,Ltd.",
        "summary": "Kyowakogyosyo Co.,Ltd. engages in the manufacture and sale of hexagon bolts, JIS hexagon socket head cap screws, bolts for construction machinery and internal combustion engines, cold-forged parts for automobiles, and special cold-/hot-forged parts in Japan. It also provides automobile parts, such as transmission, steering and suspension, and other forging parts; gears; and industrial bolts. The company was founded in 1950 and is based in Komatsu, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Komatsu",
        "zipcode": "923-8620",
        "website": "http://www.kyowakogyosyo.co.jp",
        "market_cap": "Mid Cap"
    },
    "5998.T": {
        "short_name": "ADVANEX INC",
        "long_name": "Advanex Inc.",
        "summary": "Advanex Inc., together with its subsidiaries, manufactures and sells precision springs in Japan and internationally. The company offers wire springs, including precision springs, micro springs, and wire inserts; flat springs, such as precision presses, multi formings, molding presses, and insert collars; and insert moldings. It also provides component parts comprising torque limiters and spring clutches, and other assemblies. In addition, the company designs and manufactures tools and die sets for precision deep drawing products. Further, it manufactures and sells precision deep drawing and metal stamping products; and motors. The company was formerly known as Kato Spring Works Co., Ltd. and changed its name to Advanex Inc. in July 2001. Advanex Inc. was founded in 1930 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "114-8581",
        "website": "http://www.advanex.co.jp",
        "market_cap": "Mid Cap"
    },
    "6101.T": {
        "short_name": "TSUGAMI CORP",
        "long_name": "Tsugami Corporation",
        "summary": "Tsugami Corporation, together with its subsidiaries, manufactures and sells precision machine tools in Japan. The company offers CNC precision automatic lathes, including independent opposed gang tool type, opposed gang tool type, gang-tool slede and turret, and chuck work products; and CNC lathes. It also offers precision turning center products; precision machining center products comprising vertical and horizontal machining centers; precision grinding machines, such as CNC cylindrical grinding machines; and rolling machines. In addition, the company installs and repairs machine tool parts; inspects and maintains buildings and facilities of factories; and operates as a non-life insurance agency, as well as undertakes various business activities, such as research on individual companies and other services. It also operates in China, Thailand, South Korea, Singapore, the Philippines, India, the United States, Switzerland, Germany, France, Italy, and Mexico. The company serves various industries, including electronics, information and telecommunications, and automobile industries. The company was formerly known as Tsugami Mfg., Co., Ltd. and changed its name to Tsugami Corporation in November 1970. Tsugami Corporation was founded in 1937 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0006",
        "website": "http://www.tsugami.co.jp",
        "market_cap": "Large Cap"
    },
    "6136.T": {
        "short_name": "OSG CORP",
        "long_name": "OSG Corporation",
        "summary": "OSG Corporation, together with its subsidiaries, manufactures and sells cutting tools in Japan, the Americas, Europe and Africa, and Asia. The company's products include taps, drills, end mills, indexable tools, rolling dies, thread mills, gauges, machine tools, machine parts, and tooling systems, as well as reconditioning services to worn tools. It also offers special products and accessories, such as tap holders, holder/arbor related products, circular saws/bandsaws, diameter correction tools, tool storage cabinets, parts/accessories, LHSTIX/bits, and coating rods. In addition, the company imports and sells tools, as well as provides reconditioning services to worn tools. The company's products are used in automotive, die/mold, aerospace, energy, and heavy industry applications. OSG Corporation was founded in 1938 and is headquartered in Toyokawa, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Toyokawa",
        "zipcode": "442-8543",
        "website": "http://www.osg.co.jp",
        "market_cap": "Large Cap"
    },
    "6141.T": {
        "short_name": "DMG MORI CO LTD",
        "long_name": "DMG Mori Co., Ltd.",
        "summary": "DMG Mori Co., Ltd. manufactures and sells machine tools worldwide. It offers 5-axis/multi-axis machines, turning centers, machining centers, and Lasertec and ultrasonic machines, as well as handling, shaping, measuring, and monitoring technology cycles. The company also provides pallet pool, workpiece handling, pallet handling, and tool handling systems; tool pre-setting, shrinking, measuring, and balancing devices; and CELOS, an operating system for machine tools, as well as CELOS software. In addition, it offers peripherals, such as coolant oil, oil skimmer, compressor, coolant filtration, air dryer, and coolant nozzle machines; measuring devices, including tool presetter, shrink fit and balancing machines, and on-machine measurement devices; bar feeder machines; and electrical cabinet coolers. The company was formerly known as DMG Mori Seiki Co., Ltd. and changed its name to DMG Mori Co., Ltd. in 2015. DMG Mori Co., Ltd. was founded in 1948 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "135-0052",
        "website": "http://www.dmgmori.co.jp",
        "market_cap": "Large Cap"
    },
    "6156.T": {
        "short_name": "A-ONE SEIMITSU LTD",
        "long_name": "A-One Seimitsu Inc.",
        "summary": "A-One Seimitsu Inc. produces and sells collet chuck products. It offers collet chuck/guide bushes, cutting tools, re-polishing and special tools, and machines and cams for automatic lathes. The company was founded in 1965 and is headquartered in Fuchu, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fuchu",
        "zipcode": "183-0033",
        "website": "http://www.a-one-seimitsu.co.jp",
        "market_cap": "Mid Cap"
    },
    "6165.T": {
        "short_name": "PUNCH INDUSTRY CO LTD",
        "long_name": "Punch Industry Co., Ltd.",
        "summary": "Punch Industry Co., Ltd. engages in the manufacture and sale of mold and die components in Japan and internationally. It offers components for plastic molds, such as ejector and sleeves; center and core pins; date stamps/stoppers for cavity insert; angular pins/locking blocks; slide cores/guide rails; sprue bushings/locating rings; runner, gate, locating, leader, and ejector space components; mold and die opening controllers; cooling and heating items; screws and mold accessories; coil springs; and electrodes and chemical products. The company also provides components for press dies, including punch guide bushings; punches and dies for forming; special shaped, precision, and carbide punches and dies; retainers; stripper bolts; related components of misfeed sensors; coil and urethane springs; stripper guide pins and bushings; guide posts and bushings for die sets; components for guide lifters, holder guide post sets, automobile dies, and transfer dies; hooks and components for die storage; and cam units and wear plates. It offers special order parts. The company's dies are used in a range of industries such as automobiles, and electrical and electronic equipment; plastic mold products are used in manufacturing plastic products, including exterior parts of plastic models and mobile phones; and press dies that are used to manufacture metal components, which include housing of batteries and car bodies. Punch Industry Co., Ltd. was founded in 1975 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "140-0013",
        "website": "http://www.punch.co.jp",
        "market_cap": "Large Cap"
    },
    "6282.T": {
        "short_name": "OILES CORPORATION",
        "long_name": "Oiles Corporation",
        "summary": "Oiles Corporation manufactures and sells bearings, structural devices, and architectural devices in Japan and internationally. It offers self-lubricating bearings, die components, slide shifters, guide units, and air bearings for use in long-term maintenance-free applications, such as dams and long-span bridges, automobiles, railway vehicles, power generation equipment, and OA equipment; and seismic isolation and vibration control products for bridges and roads. The company also provides ventilation and shade systems for bridges and buildings. Oiles Corporation was founded in 1939 and is headquartered in Fujisawa, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fujisawa",
        "zipcode": "252-0811",
        "website": "http://www.oiles.co.jp",
        "market_cap": "Large Cap"
    },
    "6464.T": {
        "short_name": "TSUBAKI NAKASHIMA CO LTD",
        "long_name": "Tsubaki Nakashima Co., Ltd.",
        "summary": "Tsubaki Nakashima Co., Ltd. manufactures and sells industrial precision balls, rollers, and sheet metal parts worldwide. The company operates through Precision Component Business, Linear Business, and Others Business segments. It offers precision steel balls, including bearing and stainless steel, ballpoint pen, and various metal balls for use in home electronics, such as air conditioners, refrigerators, and vacuum cleaners; and precision rollers and stampings comprising tapered, spherical, cylindrical, and needle rollers, as well as cages, sheet metal stampings, and welded products for transmission, engine, pump, wheel bearing, mining, heavy industry, and railway applications. The company also provides precision ceramic balls, including silicon nitride balls for use in electric vehicles, wind power generators, semiconductor manufacturing equipment, and other applications; and alumina oxide balls for use in agriculture, dairy, water treatment, and automotive industries. In addition, it offers ball screws, such as long/large diameter, rolled, precision, and precision and standard rolled ball screws for machine tools, electric injection molding machines, semiconductor manufacturing equipment, industrial robots, and advanced medical equipment applications; ball screws for the heavy load; support units for ball screws; precision and precision miniature ball ways; slideways, bushings, units, and shafts; 30 degrees trapezoid feed screws; and precision planetary roller screws and recirculating roller screws. Further, the company provides iron and steel, electric power, wind tunnel, and other blowers for steel, thermal power, and nuclear power applications; and customized solutions comprising solid plastic balls, specially manufactured products, and glass balls for medical diagnostic tests and devices. Additionally, it is involved in the leasing of real estate properties. Tsubaki Nakashima Co., Ltd. was founded in 1934 and is headquartered in Katsuragi, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Katsuragi",
        "zipcode": "639-2162",
        "website": "http://www.tsubaki-nakashima.com",
        "market_cap": "Large Cap"
    },
    "6472.T": {
        "short_name": "NTN CORP",
        "long_name": "NTN Corporation",
        "summary": "NTN Corporation, together with its subsidiaries, manufactures and sells bearings, drive shafts, and precision equipment and other products in Japan, the Americas, Europe, other Asian countries, and internationally. The company offers rolling bearings, including radial and thrust ball, radial and thrust roller, special application, and linear motion bearings; plummer blocks; bearing units; slip bearings; constant velocity joints; automatic tensioners; clutches; electric motor and actuator; sensor related products; parts feeders; electro mechanical brake systems; condition monitoring systems; composite material products; and wind and hydro turbines. It also provides aftermarket parts and maintenance services. The company serves automobile and motorcycle, electric vehicle, rolling stock, wind turbine, construction and mining machinery, agricultural machinery, office machinery, steel manufacturing machinery, machine tools, paper manufacturing machinery, food machinery, medical equipment, aerospace, precision equipment, robots, electrical machinery, vacuum and clean, gearbox, and green energy markets. NTN Corporation was founded in 1918 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "550-0003",
        "website": "http://www.ntn.co.jp",
        "market_cap": "Large Cap"
    },
    "6474.T": {
        "short_name": "NACHI-FUJIKOSHI CORP",
        "long_name": "Nachi-Fujikoshi Corp.",
        "summary": "Nachi-Fujikoshi Corp. operates as a machinery manufacturer in Japan, rest of Asia, the Americas, and Europe. It provides cutting tools, including drills, taps, end mills, gear cutters, broaches, and cut-off and re-grinding tools; and machine tools, such as broaching machines, precision roll forming machines, grinding machines, machining cells, and power finishers, as well as skiving machining center for gears. The company also offers robots for spot and arc welding, handling, palletizing, heavy duty, cleanroom, and option, as well as controllers and support services; and radial ball, radial roller, thrust ball, and thrust roller bearings, as well as bearing units and plummer block housings. In addition, it provides hydraulic equipment comprising valves, pumps, motors, units, and rotary center joints; special steels consisting of high speed tool and alloy tool steels, bearing and martensitic stainless steels, cermet, and micron hard products; and industrial furnaces, including vacuum carburizing furnace, and vacuum degreasing machine and system, as well as coating equipment and services. Further, the company offers forming tools, cutting saws, machining systems, and automotive hydraulics. Additionally, it provides engineering services for regrinding and recoating of tools, robots, machining equipment, heat treatment equipment, bearings, hydraulic equipment, and special steels. The company serves customers in the automotive, machinery and retail, energy, and infrastructure markets. Nachi-Fujikoshi Corp. was founded in 1928 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0021",
        "website": "http://www.nachi-fujikoshi.co.jp",
        "market_cap": "Large Cap"
    },
    "6480.T": {
        "short_name": "NIPPON THOMPSON CO",
        "long_name": "Nippon Thompson Co., Ltd.",
        "summary": "Nippon Thompson Co., Ltd. develops, manufactures, and sells needle roller bearings, linear motion rolling guides, precision positioning tables, and machine components under the IKO brand in Japan and internationally. The company's needle roller bearings comprise radial type and combined type needle roller bearings, and thrust bearings, as well as cam followers, roller followers, crossed roller bearings, and spherical bushings for applications in automobiles, motorcycles, printing machines, industrial robots, and construction machinery. Its linear motion rolling guides include linear way/ linear roller way, crossed roller way, linear slide unit, linear ball spine, linear bushing, stroke rotary bushing, and roller way and flat roller cage products; and precision positioning table series of products comprise ball screw drives, linear motor drives, timing belt drive type, and controllers for use in semiconductor and flat panel display manufacturing equipment, and other precision equipment. The company was formerly known as Daiichi-Kogyo Co., Ltd. and changed its name to Nippon Thompson Co., Ltd. in 1963. Nippon Thompson Co., Ltd. was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-8586",
        "website": "http://www.ikont.co.jp",
        "market_cap": "Large Cap"
    },
    "6586.T": {
        "short_name": "MAKITA CORP",
        "long_name": "Makita Corporation",
        "summary": "Makita Corporation engages in the manufacture and sale of electric power tools, pneumatic tools, and gardening and household equipment in Japan, Europe, North America, rest of Asia, Central and South America, Oceania, and the Middle East and Africa. It offers cordless, drilling/fastening, impact drilling/demolition, grinding/sanding, sawing, planning/routering, pneumatic, outdoor power, and dust extraction/other equipment, as well as accessories; and cutting equipment for new materials, masonry, and metals. Makita Corporation markets its products under the Makita brand. The company was formerly known as Makita Electric Works, Ltd. and changed its name to Makita Corporation in April 1991. Makita Corporation was founded in 1915 and is headquartered in Anjo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Anjo",
        "zipcode": "446-8502",
        "website": "http://www.makita.co.jp",
        "market_cap": "Large Cap"
    },
    "6877.T": {
        "short_name": "OBARA GROUP INC.",
        "long_name": "Obara Group Incorporated",
        "summary": "Obara Group Incorporated engages in the manufacture and sale of resistance welder and precision polisher products in Japan and internationally. It offers resistance welding systems to weld metal sheets mainly of car bodies; arc welders to weld steel parts by melting welding; and weld metal sheets mainly of car bodies. The company also provides polishing equipment for electronic and precision industries, such as polishers for material substrates used for electronic components on PC, mobile phones, etc.; cleaners to clean minute particles off from parts, such as memory disks, flat panel displays, and other opto-electronic parts; laser equipment for the local welding of various metals; and consumable sets, including slurry, abrasives, carriers, pads, and plates for various applications. Obara Group Incorporated was founded in 1955 and is headquartered in Yamato, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yamato",
        "zipcode": "242-0007",
        "website": "http://www.obara-g.com",
        "market_cap": "Large Cap"
    },
    "7399.T": {
        "short_name": "NANSIN CO LTD",
        "long_name": "Nansin Co., Ltd.",
        "summary": "Nansin Co., Ltd. manufactures and sells casters, material handling equipment, rubber and plastic products, die-casting products, and molded products in Japan. It also offers general, industrial, medical, heavy duty, stem, and towing casters; and plastic and steel trolley. The company was formerly known as Nansin Rubber Industries Co., Ltd. and changed its name to Nansin Co., Ltd. in July 1987. Nansin Co., Ltd. was founded in 1932 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0013",
        "website": "http://www.nansin.co.jp",
        "market_cap": "Mid Cap"
    },
    "7726.T": {
        "short_name": "KURODA PRECISION INDUSTRIES CO",
        "long_name": "Kuroda Precision Industries Ltd.",
        "summary": "Kuroda Precision Industries Ltd. manufactures and sells motion control systems, press tools and die systems, and machine tools and measurement systems worldwide. It offers support tools, precision ground ball screws, and custom ball/JIS standard screws; ball screw actuators; line motion guides, support-units, greases, and feed screws; surface grinding machines; laminated precision press tools for motor core; and precision metal press products/motor core products. The company also provides parallel thread, taper thread/taper pipe thread, oil country, master/plain, and taper gauges; gauge blocks, test bars, and measuring instruments; wafer flatness measuring systems, wafer flatness/SORI measuring systems, and surface and flatness measuring systems, as well as surface and flatness measuring systems for large discs. In addition, it offers hydraulic tools; and minimal quantity lubrication systems. The company was formerly known as Kuroda Gauge Manufacturing Co., Ltd. and changed its name to Kuroda Precision Industries Ltd. in June 1965. Kuroda Precision Industries Ltd. was founded in 1925 and is headquartered in Kawasaki, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kawasaki",
        "zipcode": "212-8560",
        "website": "http://www.kuroda-precision.co.jp",
        "market_cap": "Large Cap"
    },
    "7928.T": {
        "short_name": "ASAHI KAGAKU KOGYO CO",
        "long_name": "Asahi Kagaku Kogyo Co.,Ltd.",
        "summary": "Asahi Kagaku Kogyo Co.,Ltd. designs, manufactures, and sells plastic molds. It engages in molding, processing, and assembling molded and processed products, as well as assemblies of electric power tool parts, such as impact drivers, hammer drills, dust collectors, and others; and automotive parts, including pillar garnishes, side moldings, console and other automobile interior parts, exterior parts and cooling equipment parts, and molded parts and assemblies. The company also provides building materials, such as anchor plugs, molded parts of pump parts and applied equipment parts, processed parts, and assembled parts. Asahi Kagaku Kogyo Co.,Ltd. was founded in 1962 and is headquartered in Anjo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Anjo",
        "zipcode": "844-1205",
        "website": "http://www.asahikagakukogyo.co.jp",
        "market_cap": "Mid Cap"
    },
    "7983.T": {
        "short_name": "MIROKU CORPORATION",
        "long_name": "Miroku Corporation",
        "summary": "Miroku Corporation, through its subsidiaries, manufactures and sells hunting guns in Japan and internationally. The company offers sporting and hunting guns under the Browning, Winchester, and Miroku brand names. It also manufactures and sells machine tools, including gun drilling machines; and automotive parts comprising solid-wood steering wheels. The company was founded in 1893 and is headquartered in Nankoku, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nankoku",
        "zipcode": "783-0006",
        "website": "http://www.miroku-jp.com",
        "market_cap": "Mid Cap"
    },
    "9895.T": {
        "short_name": "CONSEC CORP",
        "long_name": "Consec Corporation",
        "summary": "Consec Corporation manufactures and sells drilling and sawing equipment in Japan and internationally. It offers hand, wall, and plunge cutter diamond tools, as well as wire saws and core drill products; automatic feeding systems, hydraulic units, fiber optic cable laying robots, and road grinding machines; and diamond core bits, blades, and wires under the Hakken brand name. The company also undertakes special construction contract works; and sells construction machinery, housing and living related equipment, and OA equipment. In addition, it provides life insurance agency services; offers business IT services, including systems outsourcing support; and rents real estate facilities. Consec Corporation was founded in 1967 and is headquartered in Hiroshima, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Hiroshima",
        "zipcode": "733-0833",
        "website": "http://www.consec.co.jp",
        "market_cap": "Mid Cap"
    },
    "9962.T": {
        "short_name": "MISUMI GROUP INC",
        "long_name": "MISUMI Group Inc.",
        "summary": "MISUMI Group Inc. engages in the factory automation and die components businesses worldwide. The company operates through three segments: FA Business, Die Components Business, and VONA Business. It offers mechanical components, including shafts, timing pulleys, linear bushings, flat belt conveyors, set collars, locating pins, gears, and couplings; and locator devices and measurement equipment, such as automatic stage units, actuators, optical measurement devices, and optical waveguide alignment products. The company also provides metal press/plastic mold components comprising punches, button dies, ejector pins, and sprue bushings. In addition, it distributes sensors and switches, pipefittings, screws, bolts, nuts, washers, castors, couplings, transformers, connectors, cables, transformers, end mills, hexagonal wrenches, milling chips, calipers, carts, work gloves, parts cleaners, and laboratory equipment and supplies. MISUMI Group Inc. was founded in 1963 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "112-8583",
        "website": "http://www.misumi.co.jp",
        "market_cap": "Large Cap"
    },
    "DCV.F": {
        "short_name": "ADVANEX INC.",
        "long_name": "Advanex Inc.",
        "summary": "Advanex Inc., together with its subsidiaries, manufactures and sells precision springs in Japan and internationally. The company offers wire springs, including precision springs, micro springs, and wire inserts; flat springs, such as precision presses, multi formings, molding presses, and insert collars; and insert moldings. It also provides component parts comprising torque limiters and spring clutches, and other assemblies. In addition, the company designs and manufactures tools and die sets for precision deep drawing products. Further, it manufactures and sells precision deep drawing and metal stamping products; and motors. The company was formerly known as Kato Spring Works Co., Ltd. and changed its name to Advanex Inc. in July 2001. Advanex Inc. was founded in 1930 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "114-8581",
        "website": "http://www.advanex.co.jp",
        "market_cap": "Small Cap"
    },
    "MK2A.F": {
        "short_name": "MAKITA CORP.",
        "long_name": "Makita Corporation",
        "summary": "Makita Corporation engages in the manufacture and sale of electric power tools, pneumatic tools, and gardening and household equipment in Japan, Europe, North America, rest of Asia, Central and South America, Oceania, and the Middle East and Africa. It offers cordless, drilling/fastening, impact drilling/demolition, grinding/sanding, sawing, planning/routering, pneumatic, outdoor power, and dust extraction/other equipment, as well as accessories; and cutting equipment for new materials, masonry, and metals. Makita Corporation markets its products under the Makita brand. The company was formerly known as Makita Electric Works, Ltd. and changed its name to Makita Corporation in April 1991. Makita Corporation was founded in 1915 and is headquartered in Anjo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Anjo",
        "zipcode": "446-8502",
        "website": "http://www.makita.co.jp",
        "market_cap": "Mid Cap"
    },
    "MKTAY": {
        "short_name": "MAKITA CORP",
        "long_name": "Makita Corporation",
        "summary": "Makita Corporation engages in the manufacture and sale of electric power tools, pneumatic tools, and gardening and household equipment in Japan, Europe, North America, rest of Asia, Central and South America, Oceania, and the Middle East and Africa. It offers cordless, drilling/fastening, impact drilling/demolition, grinding/sanding, sawing, planning/routering, pneumatic, outdoor power, and dust extraction/other equipment, as well as accessories; and cutting equipment for new materials, masonry, and metals. Makita Corporation markets its products under the Makita brand. The company was formerly known as Makita Electric Works, Ltd. and changed its name to Makita Corporation in April 1991. Makita Corporation was founded in 1915 and is headquartered in Anjo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Anjo",
        "zipcode": "446-8502",
        "website": "http://www.makita.co.jp",
        "market_cap": "Large Cap"
    },
    "MONOY": {
        "short_name": "MONOTARO CO.LTD",
        "long_name": "MonotaRO Co., Ltd.",
        "summary": "MonotaRO Co., Ltd., together with its subsidiaries, operates an online MRO products store in Japan and internationally. It offers products in various categories, such as safety protection equipment, work clothes, and safety shoes; logistics, storage, and packing supplies; tapes; safety supplies/safety signs; office supplies; office furniture/lighting/cleaning supplies; cutting tools/abrasives; measurement/surveying supplies; work/electric/pneumatic tools; spray/oil/grease/paint/adhesion/repair/welding supplies; and agricultural materials/gardening supplies. The company also provides building hardware products, building materials, and painting interior supplies; air conditioning/electrical equipment materials/electrical materials; piping/water supply/pump/pneumatic/hydraulic equipment/hose products; mechanical parts; control equipment/solder/static electricity countermeasure supplies; screws/bolts/nails/materials; car/truck supplies; motorcycle/bicycle supplies; kitchen equipment/kitchen products/store supplies; scientific research and development/clean room supplies; and medical/long-term care products. It serves factories, construction, automobile maintenance, and other industries. The company was formerly known as Sumisho Grainger Co., Ltd. and changed its name to MonotaRO Co., Ltd. in 2006. MonotaRO Co., Ltd. was founded in 2000 and is headquartered in Amagasaki, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Amagasaki",
        "zipcode": "660-0876",
        "website": "http://www.monotaro.com",
        "market_cap": "Large Cap"
    },
    "MS3.F": {
        "short_name": "MISUMI GROUP INC.",
        "long_name": "MISUMI Group Inc.",
        "summary": "MISUMI Group Inc. engages in the factory automation and die components businesses worldwide. The company operates through three segments: FA Business, Die Components Business, and VONA Business. It offers mechanical components, including shafts, timing pulleys, linear bushings, flat belt conveyors, set collars, locating pins, gears, and couplings; and locator devices and measurement equipment, such as automatic stage units, actuators, optical measurement devices, and optical waveguide alignment products. The company also provides metal press/plastic mold components comprising punches, button dies, ejector pins, and sprue bushings. In addition, it distributes sensors and switches, pipefittings, screws, bolts, nuts, washers, castors, couplings, transformers, connectors, cables, transformers, end mills, hexagonal wrenches, milling chips, calipers, carts, work gloves, parts cleaners, and laboratory equipment and supplies. MISUMI Group Inc. was founded in 1963 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "112-8583",
        "website": "http://www.misumi.co.jp",
        "market_cap": "Mid Cap"
    },
    "NTN.F": {
        "short_name": "NTN CORP.",
        "long_name": "NTN Corporation",
        "summary": "NTN Corporation, together with its subsidiaries, manufactures and sells bearings, drive shafts, and precision equipment and other products in Japan, the Americas, Europe, other Asian countries, and internationally. The company offers rolling bearings, including radial and thrust ball, radial and thrust roller, special application, and linear motion bearings; plummer blocks; bearing units; slip bearings; constant velocity joints; automatic tensioners; clutches; electric motor and actuator; sensor related products; parts feeders; electro mechanical brake systems; condition monitoring systems; composite material products; and wind and hydro turbines. It also provides aftermarket parts and maintenance services. The company serves automobile and motorcycle, electric vehicle, rolling stock, wind turbine, construction and mining machinery, agricultural machinery, office machinery, steel manufacturing machinery, machine tools, paper manufacturing machinery, food machinery, medical equipment, aerospace, precision equipment, robots, electrical machinery, vacuum and clean, gearbox, and green energy markets. NTN Corporation was founded in 1918 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "550-0003",
        "website": "http://www.ntn.co.jp",
        "market_cap": "Small Cap"
    },
    "OSG.F": {
        "short_name": "OSG CORP.",
        "long_name": "OSG Corporation",
        "summary": "OSG Corporation, together with its subsidiaries, manufactures and sells cutting tools in Japan, the Americas, Europe and Africa, and Asia. The company's products include taps, drills, end mills, indexable tools, rolling dies, thread mills, gauges, machine tools, machine parts, and tooling systems, as well as reconditioning services to worn tools. It also offers special products and accessories, such as tap holders, holder/arbor related products, circular saws/bandsaws, diameter correction tools, tool storage cabinets, parts/accessories, LHSTIX/bits, and coating rods. In addition, the company imports and sells tools, as well as provides reconditioning services to worn tools. The company's products are used in automotive, die/mold, aerospace, energy, and heavy industry applications. OSG Corporation was founded in 1938 and is headquartered in Toyokawa, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Toyokawa",
        "zipcode": "442-8543",
        "website": "http://www.osg.co.jp",
        "market_cap": "Small Cap"
    },
    "RYBIF": {
        "short_name": "RYOBI LTD",
        "long_name": "Ryobi Limited",
        "summary": "Ryobi Limited, together with its subsidiaries, operates as a die casting manufacturer in Japan, the United States, China, and internationally. The company operates through Die Castings, Builders' Hardware, and Printing Equipment segments. It offers die cast products comprising cylinder blocks, transmission cases, and sub frames for use in the automobile industry; builders' hardware, such as sliding door closers, floor hinges, and concealed and overhead concealed door closers, as well as architectural hardware, such as as door stoppers/door holders, door guards, flush bolts, and door coordinators; and printing equipment, including offset printing presses, peripherals, etc. The company also manufactures and sells aluminum forged products. Ryobi Limited was founded in 1943 and is headquartered in Fuchu, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Fuchu",
        "zipcode": "726-8628",
        "website": "http://www.ryobi-group.co.jp",
        "market_cap": "Small Cap"
    },
    "RYO1.F": {
        "short_name": "RYOBI LTD",
        "long_name": "Ryobi Limited",
        "summary": "Ryobi Limited, together with its subsidiaries, operates as a die casting manufacturer in Japan, the United States, China, and internationally. The company operates through Die Castings, Builders' Hardware, and Printing Equipment segments. It offers die cast products comprising cylinder blocks, transmission cases, and sub frames for use in the automobile industry; builders' hardware, such as sliding door closers, floor hinges, and concealed and overhead concealed door closers, as well as architectural hardware, such as as door stoppers/door holders, door guards, flush bolts, and door coordinators; and printing equipment, including offset printing presses, peripherals, etc. The company also manufactures and sells aluminum forged products. Ryobi Limited was founded in 1943 and is headquartered in Fuchu, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Fuchu",
        "zipcode": "726-8628",
        "website": "http://www.ryobi-group.co.jp",
        "market_cap": "Small Cap"
    }
}