{
    "1843.HK": {
        "short_name": "SNACK EMPIRE",
        "long_name": "Snack Empire Holdings Limited",
        "summary": "Snack Empire Holdings Limited, a food and beverage company, engages in the wholesale and retail of food and beverages. The company provides Taiwanese snacks and beverages under the Shihlin Taiwan Street Snacks brand. It operates approximately 248 outlets and restaurants in Singapore, Malaysia, Indonesia, and the United States. The company was founded in 2003 and is headquartered in Singapore.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "1A0.SI": {
        "short_name": "$ Katrina",
        "long_name": "Katrina Group Ltd.",
        "summary": "Katrina Group Ltd., an investment holding company, owns and operates restaurants and cafes. The company operates through two segments, Hospitality, and Food and Beverages. It serves Hong Kong, Indonesian, Japanese, Mexican, northern Chinese, Thai, Vietnamese, and Yunnan cuisines. The company also provides online food delivery services; manufactures and distributes foods; and offers domestic household cleaning services. It operates 42 restaurants in Singapore and 2 restaurants in Indonesia under the Bali, Thai, Honguo, So Pho, Streats, Bayang, Hutong, Muchos, RENNthai, and Tomo Izakaya food and beverage brands. The company leases and manages 241 private residences, and 2 apartment buildings comprising 68 apartment units, as well as 4 co-living hotels, including approximately 242 rooms across Singapore and 18 serviced apartments in Hong Kong. Katrina Group Ltd. was founded in 1995 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "1D0.SI": {
        "short_name": "$ Kimly",
        "long_name": "Kimly Limited",
        "summary": "Kimly Limited, an investment holding company, operates coffee shops in Singapore. The company operates through three segments: Outlet Management, Food Retail, and Others. The Outlet Management segment engages in the sale of food, beverages, and tobacco products; leasing of food outlet premises to tenants; and provision of cleaning and utilities services to tenants, as well as management services to third party coffee shops. It operates and manages 67 coffee shops and four industrial canteens under the Kimly brand and a third party brand; and three food courts under the foodclique brand. The Food Retail segment is primarily involved in the retail of cooked food directly to consumers through a network of 83 food outlets under the Kimly, foodclique, and a third party brand; and 137 food stalls comprising Mixed Vegetable Rice, Teochew Porridge, Dim Sum, and Seafood Zi Char, as well as 1 Kanaaji Japanese Tonkatsu food stall, two Tonkichi restaurants, and seven Rive Gauche confectionery shops. The Others segment offers management, finance, human resource, treasury, and administrative services. Kimly Limited was founded in 1990 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "1D3.SI": {
        "short_name": "$ LifeBrandz",
        "long_name": "LifeBrandz Ltd.",
        "summary": "LifeBrandz Ltd., an investment holding company, engages in the brand development and management, travel, fintech, IT, fund management, and food and beverage businesses in Singapore, Thailand, Japan, and the United States. The company operates through two segments, Lifestyle and Entertainment, and Travel Agency Services. It provides leisure and travel consultancy, and ticketing agency services; and other travel-related services and products, such as travel insurance arrangement, visa applications, and land transfers between airport and accommodation. The company also offers financial institutions white label wealth solutions to automate the process of financial planning, saving, and investing through its digital platform. In addition, it operates a pub and restaurant. The company was founded in 2001 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "1G6.SI": {
        "short_name": "$ No Signboard",
        "long_name": "No Signboard Holdings Ltd.",
        "summary": "No Signboard Holdings Ltd., an investment holding company, manages and operates food and beverage outlets in Singapore. It operates a chain of restaurants under various F&B brands and concepts, including No Signboard Seafood, Hawker Asian Burger & Buns, Little Sheep Hot Pot, and Mom's Touch Korean Chicken & Burger. The company also produces, promotes, and distributes beer under the Draft Denmark brand, as well as is involved in the wholesale trade of liquor and soft drinks; and distributes various third party brands of beer, as well as operates as an OEM beer supplier for third party brands. In addition, it produces and distributes ready meals through a network of vending machines. The company was founded in 1981 and is based in Singapore. No Signboard Holdings Ltd. is a subsidiary of GuGong Pte. Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "1O7.F": {
        "short_name": "BANYAN TREE HLDGS LTD",
        "long_name": "Banyan Tree Holdings Limited",
        "summary": "Banyan Tree Holdings Limited, an investment holding company, develops, operates, and manages resorts, hotels, spas, and residences in Singapore, South East Asia, Indian Oceania, the Middle East, North East Asia, and internationally. It operates through Hotel Investments, Property Sales, and Fee-Based segments. The company engages in the hotel and restaurant operations; sale of hotel villas or suites to investors under the leaseback scheme; and development and sale of vacation homes in Laguna Phuket, as well as in the land development and sales activities. It is also involved in the management of an asset-backed destination club and private-equity funds; sale of merchandise; provision of architectural and design services; ownership and management of golf courses; and holding of land plots. In addition, the company provides tourist transportation, management consultancy, marketing, business management, investment management and related consulting, and tourism management consultancy services; operation and ancillary services related to the hospitality industry; consultation and management services of the international hotels marketing; purchasing and project services for hotels, resorts, and spas; and designing, planning, and consultancy services for hotels, resorts and spas, as well as owns and manages the intellectual property. Further, it is involved in the holiday club membership and property holding operations; operation, investment, and rental of retail outlets and offices; and development of residential properties. The company manages 29 hotels and resorts, 63 spas, 72 retail galleries, and 3 golf courses. Banyan Tree Holdings Limited was founded in 1984 and is based in Singapore.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "40B.SI": {
        "short_name": "$ HealthBank",
        "long_name": "HealthBank Holdings Limited",
        "summary": "HealthBank Holdings Limited, an investment holding company, provides hospitality facilities management and consultancy services for hotels and resorts in China. The company offers consultancy services for hotel and resorts management, investment, developing, and branding. It is also involved in the property management business. The company was formerly known as SMJ International Holdings Ltd. and changed its name to HealthBank Holdings Limited in April 2019. HealthBank Holdings Limited was incorporated in 2013 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "42R.SI": {
        "short_name": "$ Jumbo",
        "long_name": "Jumbo Group Limited",
        "summary": "Jumbo Group Limited, an investment holding company, operates and manages a network of restaurants in Singapore, the People's Republic of China, Taiwan, and internationally. It operates 39 food and beverages (F&B) outlets under the JUMBO Seafood, NG AH SIO Bak Kut Teh, HACK IT, Chui Huay Lim Teochew Cuisine, Zui Yu Xuan Teochew Cuisine, Chao Ting, Kok Kee Wanton Noodle, Singapore Seafood Republic, and XINYAO Hainanese Chicken Rice restaurant brands in Singapore, Shanghai, Xi'an, Beijing, Fuzhou, Bangkok, Ho Chi Minh, Seoul, Ilsan, Taipei, Taichung, Hsinchu, Taoyuan, Tokyo and Osaka. The company also operates 2 Cha Chaan Teng outlet as a franchisee, as well as manages 1 Singapore Seafood Republic outlet in Singapore. In addition, it sells packaged sauces and spice mixes in its outlets, selected stores, supermarkets, travel agencies, and online through JUMBO eShop and e-commerce stores, as well as offers catering services in Singapore. The company was founded in 1987 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "504.SI": {
        "short_name": "$ HS Optimus",
        "long_name": "HS Optimus Holdings Limited",
        "summary": "HS Optimus Holdings Limited, an investment holding company, engages in the manufacture and distribution of doors in Singapore. The company operates in three segments: Investment, Door Business, and Property Business. It is involved in the manufacture and distribution of furniture and fittings, and wood related products; manufacture and processing of various artificial, thin veneer, and flooring boards; supply and installation of doors, moldings, and wood based floorings; and trading of doors, moldings, wood floorings, and related products. The company also imports and distributes doors, locksets ironmongeries, furniture and fittings, and wood related products; and rents premises, as well as invests in and develops properties. It exports its wood products to the United Kingdom, Ireland, and the United States. The company was formerly known as KLW Holdings Limited and changed its name to HS Optimus Holdings Limited in September 2020. HS Optimus Holdings Limited was incorporated in 1995 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "543.SI": {
        "short_name": "Noel Gifts Intl",
        "long_name": "Noel Gifts International Ltd",
        "summary": "Noel Gifts International Ltd provides hampers, flowers, and gifts in Singapore and Malaysia. The company operates in two segments, Gifts and Properties. It operates a franchise program that provides franchisees the right to use the company's name. The company also engages in creative gift designs; and markets, sells, operates, and purchases strategies and systems. In addition, it invests in and develops properties. Noel Gifts International Ltd offers its products through its retail outlets and online. The company was formerly known as Noel Hampers and Gifts Pte Ltd and changed its name to Noel Gifts International Ltd in 1993. Noel Gifts International Ltd was founded in 1975 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "596.SI": {
        "short_name": "Pavillon",
        "long_name": "Pavillon Holdings Ltd.",
        "summary": "Pavillon Holdings Ltd., an investment holding company, engages in the restaurant operations in Singapore, the People's Republic of China, and internationally. The company operates through Food and Beverages Operations, Leasing Operations, and Properties Operations segments. It owns 2 self-managed restaurants and 6 franchise restaurants; and operates food stalls. The company also provides leases motor vehicles and equipment. In addition, it is involved in the business development, trading, import, and export of machineries; financial leasing of machineries, tools, and equipment; and provision of asset management, enterprise management, mergers and acquisitions, and financial advisory services. Further, the company offers property management, warehousing, and logistics management services. The company was formerly known as Thai Village Holdings Ltd and changed its name to Pavillon Holdings Ltd. in January 2014. Pavillon Holdings Ltd. was founded in 1991 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5DO.SI": {
        "short_name": "Sakae",
        "long_name": "Sakae Holdings Ltd.",
        "summary": "Sakae Holdings Ltd., together with its subsidiaries, operates as a food and beverage company in Singapore, Malaysia, and internationally. The company operates through Sakae Sushi, and Other Products and Services segments. It operates restaurants, kiosks, and cafes primarily under the Sakae Sushi, Sakae Delivery, Sakae Teppanyaki, Sakae Shoppe, Hei Sushi, Hei Delivery, Senjyu, Nouvelle Events & Catering, Sachi, and Crepes & Cream brand names, as well as food delivery services under the Sakae Delivery and Hei Delivery names. The company is also involved in trading, sushi processing, catering, and franchising activities; and provision of cleaning, investment property holding, general wholesale trading, and cold storage warehousing and logistics services activities. In addition, it offers advisory and strategic investor relations services; financial and technological applications and training; and trading of canned and frozen seafood products. The company was formerly known as Apex-Pal International Ltd. and changed its name to Sakae Holdings Ltd. in 2010. Sakae Holdings Ltd. was founded in 1996 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5DP.SI": {
        "short_name": "Heeton",
        "long_name": "Heeton Holdings Limited",
        "summary": "Heeton Holdings Limited, an investment holding company, engages in the hospitality business in Singapore, Thailand, Australia, Japan, Malaysia, Vietnam, and the United Kingdom. It operates through Hospitality, Property Investment, and Property Development segments. The company engages in the development and sale of private residential properties, as well as provides property management services. It also leases residential, retail, and commercial properties. In addition, the company owns, manages, and franchises hotels and related services; and provides administrative and management services. As of December 31, 2019, it operates 13 hotels. Heeton Holdings Limited was founded in 1976 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5HH.SI": {
        "short_name": "$ Sinjia Land",
        "long_name": "Sinjia Land Limited",
        "summary": "Sinjia Land Limited, an investment holding company, operates and manages lodging and boarding houses, and backpackers hostels in Singapore, Thailand, and the United States. It also invests in fund management business. The company was formerly known as HLN Technologies Limited and changed its name to Sinjia Land Limited in April 2013. Sinjia Land Limited was founded in 1979 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5HT.SI": {
        "short_name": "$ Imperium Crown",
        "long_name": "Imperium Crown Limited",
        "summary": "Imperium Crown Limited operates as a property investment, development, and management company in China. The company engages in the development of Wonder Stone Park, a tourist attraction and mixed-use development project with a theme park featuring rides and attractions. It also operates a hotel under the Inzone brand. The company was formerly known as Communication Design International Limited and changed its name to Imperium Crown Limited in June 2015. Imperium Crown Limited was incorporated in 1995 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5I1.SI": {
        "short_name": "$ KOP",
        "long_name": "KOP Limited",
        "summary": "KOP Limited, an investment holding company, operates as a real estate development and entertainment company. It operates through Real Estate Development and Investment, Real Estate Origination and Management Services, Hospitality, and Entertainment segments. The company invests in, develops, constructs, manages, and sells real estate properties. It is also involved in the properties acquisition and development conceptualization, construction management, and marketing and branding strategizing activities, as well as retail sale of projects; and development, management, and operation of hotels and resorts, including restaurants and spas. In addition, the company sells goods and tickets; and assigns distribution rights, as well as engages in the sponsorship, theatrical distribution, and concert promotions activities. Further, it is involved in business and management consultancy services; property management and consultancy activities; ownership and lease of real estate properties; investment management and consultancy activities; and operation of cafes and coffee houses. The company has operations in Singapore, Indonesia, and the People's Republic of China. KOP Limited was incorporated in 2004 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5IG.SI": {
        "short_name": "Gallant Venture",
        "long_name": "Gallant Venture Ltd.",
        "summary": "Gallant Venture Ltd., an investment holding company, operates as an integrated automotive company primarily in Indonesia. Its Industrial parks segment develops, constructs, operates, and maintains industrial properties in Batam and Bintan Islands with supporting infrastructure activities. The company's Utilities segment provides electricity and water supply, telecommunications, waste management, and sewage treatment services to the industrial parks and resorts in Batam and Bintan Islands. It operates 18 dual fuel fired generators with an installed capacity of approximately 125MW at Batamindo Industrial Park; 6 generators with an installed capacity of approximately 10MW at Bintan Industrial Estate; and 4 generators with an installed capacity of approximately 24MW at Bintan Resorts. Its Resort Operations segment offers services to resort operators in Bintan Resort, including ferry services and ferry terminal operations, tour operations, property rental, workers accommodation, security, fire-fighting, and medical support services, as well as facilities required by resort operators. This segment also provides estate and township maintenance services, such as road maintenance and drainage, as well as operates a 24-hour crisis center. The company's Property Development segment develops industrial and resort properties in Batam and Bintan Islands. Its Automotive segment engages in the vehicle sales distribution, after sales services, vehicle ownership financing, spare part distribution, vehicle assembly, automotive parts manufacturing, and other related supporting activities. The company also offers business management consultancy services; engages in the Wholesaler of hotels, resorts, and golf courses. The company was incorporated in 2003 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5KI.SI": {
        "short_name": "Soup Restaurant",
        "long_name": "Soup Restaurant Group Limited",
        "summary": "Soup Restaurant Group Limited, an investment holding company, operates restaurants. The company operates 19 restaurant outlets in Singapore and Malaysia under Soup Restaurant, CAFE O, and POT LUCK brands, as well as 2 franchised outlets in Indonesia. It also sources, supplies, processes, and distributes raw materials and food products, as well as provides procurement services; and offers job training and vocational rehabilitation services. The company was founded in 1991 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5LE.SI": {
        "short_name": "$ Sitra",
        "long_name": "Sitra Holdings (International) Limited",
        "summary": "Sitra Holdings (International) Limited, an investment holding company, distributes wood-based products and lifestyle outdoor furniture under the Comcia, decKING, and Pacific brands. Its wood-based products include decks, decking systems, flooring, fences, and other DIY products; and lifestyle furniture products comprise outdoor garden furniture, garden accessories, and contract furnishings. The company also manufactures, supplies, and distributes wood-based and other related products, as well as develops properties. It has operations in Australia, New Zealand, Europe, and Asia. The company was founded in 1979 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5OX.SI": {
        "short_name": "$ Mary Chia",
        "long_name": "Mary Chia Holdings Limited",
        "summary": "Mary Chia Holdings Limited, an investment holding company, provides lifestyle and wellness products and services in Singapore, Malaysia, and Taiwan. The company operates through Beauty, Slimming and Spa Treatment for Women; Beauty, Slimming and Spa Treatment for Men; and Direct Selling segments. It offers beauty and facial, slimming, medical aesthetic, and spa and wellness therapy services under the Mary Chia, Urban Homme, Masego, Huang Ah Ma, Organica, Scinn Medical Centre, and Dr Scinn brands. The company also retails lifestyle and wellness products; and distributes nutrition and skincare products through its direct selling network, as well as provides natural sanitizer and disinfectant spray under the INTENSE RESCUE brand. In addition, it engages in the general wholesale trading activities. The company was founded in 1988 and is based in Singapore. Mary Chia Holdings Limited is a subsidiary of Suki Sushi Pte. Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5SO.SI": {
        "short_name": "Duty Free Intl",
        "long_name": "Duty Free International Limited",
        "summary": "Duty Free International Limited, an investment holding company, trades in duty free merchandise under the Zon brand in Malaysia. The company wholesales, distributes, and retails duty free and non-dutiable merchandise, including imported duty free beverages, tobacco products, chocolates and confectionary products, perfumes, cosmetics, and souvenirs. It operates approximately 40 outlets comprising duty-free retail outlets and duty paid retail outlets located at various locations in airports, seaports, ferry terminals, border towns, and tourist destinations. The company is also involved in the development of resorts; property investment and management activities; cultivation of oil palms; and sale of fresh oil palm fruit bunches. The company was founded in 1978 and is based in Singapore. Duty Free International Limited is a subsidiary of Atlan Holdings Bhd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5SR.SI": {
        "short_name": "Zhongmin Baihui",
        "long_name": "Zhongmin Baihui Retail Group Ltd.",
        "summary": "Zhongmin Baihui Retail Group Ltd., an investment holding company, owns, operates, and manages a chain of department stores and supermarkets in the People's Republic of China. As of March 26, 2020, it operated 19 stores under the Zhongmin Baihui brand name comprising 16 self-owned stores and 3 managed stores with a total gross floor area of 219,100 square meters. The company provides its merchandise, lifestyle products, and customer-oriented services to middle income consumers. Zhongmin Baihui Retail Group Ltd. was founded in 1997 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5TI.SI": {
        "short_name": "$ Kitchen Culture",
        "long_name": "Kitchen Culture Holdings Ltd.",
        "summary": "Kitchen Culture Holdings Ltd., an investment holding company, sells and distributes imported kitchen systems and appliances, wardrobe systems, bathroom furniture, and household furniture and kitchen accessories. It operates in two segments, Distribution and Retail and Residential Projects. The Distribution and Retail segment sells and distributes products through a network of authorized dealers and retailers. The Residential Projects segment engages in the design, assembly, installation, testing, and inspection of various furniture and fittings, kitchen equipment, and related products. The company offers its products under the Poggenpohl, Hacker, LA Cornue, Pureform, Eggersmann, Snaidero, Rational, Kitchen Culture Kitchens, Leicht, Bora, Inventum, Kuppersbusch, Steel, Foster, Barazza, Elica Collection, Teka, Candy, Liebherr, Fimes, KFF, Tisettanta, Dall'agnese, and Tre-P & Tre-Piu brand names. It is also involved in the trading of medical and related supplies; and provision of labour services. It also undertakes fund management activities for ultra high net worth individuals and families. The company has operations in Singapore, Hong Kong, Malaysia, and China. Kitchen Culture Holdings Ltd. was founded in 1991 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5WG.SI": {
        "short_name": "$ SingaporeKitchen",
        "long_name": "Singapore Kitchen Equipment Limited",
        "summary": "Singapore Kitchen Equipment Limited, an investment holding company, provides commercial and industrial kitchen solutions in Singapore, Malaysia, and internationally. It operates through two segments, Fabrication and Distribution Business, and Maintenance and Servicing Business. The Fabrication and Distribution Business segment manufactures and sells standard and customized kitchen facilities, as well as kitchen equipment under the InnoFlame brand name. It also provides Industrial refrigeration products under the Qoolux brand name. The Maintenance and Servicing Business segment provides preventive maintenance works and repairs on kitchen equipment. The company is also involved in the equipment fabrication, installation, and distribution activities; provision of design and consultancy services; designing, fabricating, and installation of stainless steel kitchenware and commercial kitchens; distribution of kitchen equipment; and wholesale of commercial food service equipment. It serves food and beverage industries; and hospitality services industries, such as central kitchens, restaurants, integrated resorts, membership clubs, and hotels, as well as government agencies, and developers and owners of residential properties. The company was founded in 1996 and is headquartered in Singapore. Singapore Kitchen Equipment Limited is a subsidiary of QKE Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5WJ.SI": {
        "short_name": "$ MoneyMax Fin",
        "long_name": "MoneyMax Financial Services Ltd.",
        "summary": "MoneyMax Financial Services Ltd., an investment holding company, engages in the pawnbroking, retailing, and trading of new and pre-owned jewellery, luxury bags, and timepieces. The company operates through two segments, Pawnbroking, and Retail and Trading of Pre-Owned Luxury Items. It also operates MoneyMax Online, an online platform to shop, sell, and appraise valuables. In addition, the company provides finance leasing, automotive financing, and refurbishment and repair services, as well as insurance agency services. It operates a network of 71 outlets in Singapore and Malaysia. The company was founded in 2008 and is headquartered in Singapore. MoneyMax Financial Services Ltd. is a subsidiary of Money Farm Pte. Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "6090.HK": {
        "short_name": "CENTURION CORP",
        "long_name": "Centurion Corporation Limited",
        "summary": "Centurion Corporation Limited, an investment holding company, owns, develops, and manages workers and student accommodation assets in Singapore, the United Kingdom, the United States, Malaysia, Australia, and internationally. The company operates through three segments: Workers Accommodation, Student Accommodation, and Others. It manages workers accommodation assets under the Westlite Accommodation brand and student accommodation assets under the dwell brand. As of December 31, 2020, the company owned and managed a portfolio of 35 operational accommodation assets totaling 73,460 beds. It also manufactures and sells optical discs and related data storage products. In addition, the company offers laundry; cleaning and maintenance; management; utilities and transportation; tourist; asset management; fund management; trustee; and business and management consultancy services. The company was founded in 1984 and is headquartered in Singapore. Centurion Corporation Limited is a subsidiary of Centurion Properties Pte Ltd.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "6928.HK": {
        "short_name": "TOMO HOLDINGS",
        "long_name": "TOMO Holdings Limited",
        "summary": "TOMO Holdings Limited, an investment holding company, engages in the design, manufacture, supply, and installation of leather upholstery for passenger vehicles in Singapore. It operates in two segments, Passenger Vehicle Leather Upholstery, and Passenger Vehicle Electronic Accessories. The company offers rear and front seats leather upholstery products. It also provides leather wrappings for other passenger vehicle interior products, such as door panels, and head and arm rests. In addition, the company offers passenger vehicle electronic accessories, including navigation and multimedia accessories comprising navigation systems, head units, and in-car entertainment systems; and safety and security accessories that enhance driver and passenger safety and security consisting of digital video recorders, reverse cameras and parking sensors, and security alarm systems. It sells its products to passenger vehicle distributors and dealers. The company was founded in 1995 and is headquartered in Singapore. TOMO Holdings Limited is a subsidiary of TOMO Ventures Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "8126.HK": {
        "short_name": "G. A. HOLDINGS",
        "long_name": "G.A. Holdings Limited",
        "summary": "G.A. Holdings Limited, an investment holding company, engages in the sale of motor vehicles and provision of car-related technical services in Singapore, Hong Kong, and the People's Republic of China. It operates through two segments, Motor Vehicles Sales and Services Business, and Car Rental Business. The company distributes a range of luxury and ultra-luxury motor vehicles of various brands, such as BMW, Mini, Ferrari, and Maserati. It is also involved in the wholesale and retail of original auto parts and accessories of BMW, Mini Cooper, Ferrari, and Maserati, as well as operates as an authorized distributor of AC Schnitzer. In addition, the company operates authorized service centers that offers repair and maintenance services for high-end automobiles; and operates as a licensee of the Hertz car rental services. Further, the company engages in the automobile dealership and motor vehicles exhibition business. G.A. Holdings Limited was founded in 1993 and is headquartered in Singapore.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "8527.HK": {
        "short_name": "JLOGO HLDGS",
        "long_name": "JLogo Holdings Limited",
        "summary": "JLogo Holdings Limited, an investment holding company, owns and operates restaurants in Singapore. The company operates through two segments, The Dining Operations and The Artisanal Bakery. It operates eight restaurants, which include six restaurants under the Central Hong Kong CafÃ© brand, one restaurant under the Black Society brand, and one restaurant under the franchised Greyhound CafÃ© brand. The company also operates artisanal dimsum cafÃ© under MASA by Black Society brand. In addition, it operates 21 bakery retail outlets in Malaysia, including 17 are self-operated bakery retail outlets and four are franchised bakery retail outlets under the Bread Story brand. The company's bakery retail outlets sell various breads, pastries, cakes, and flour confectionery products under Bread Story brand. It serves primarily retail customers. The company was founded in 2002 and is headquartered in Singapore.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "A34.SI": {
        "short_name": "Amara",
        "long_name": "Amara Holdings Limited",
        "summary": "Amara Holdings Limited, an investment holding company, engages in the hotel investment and management; property investment and development; and specialty restaurants and food services businesses in Singapore, the People's Republic of China, and Thailand. It invests in and develops office, retail, and residential properties. The company is also involved in the share trading and investment activities; and the provision of construction services, as well as in franchising business. In addition, it offers management and technical advisory services for the management and development of hotels and resorts; and general management and administrative services. The company was incorporated in 1970 and is based in Singapore. Amara Holdings Limited is a subsidiary of First Security Pte Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "AAX1.F": {
        "short_name": "ACMA LTD",
        "long_name": "Acma Ltd.",
        "summary": "Acma Ltd., an investment holding company, manufactures and sells tools, automotive molds, and plastic injection molding products for the automotive and electronics industries. It operates through Tooling and Plastic Injection Moulding; Communications, Electronics and Equipment Distribution; Investment; and Metal Packaging and Metal Printing Services segments. The company is also involved in the sale, maintenance, and rental of communication equipment, computer equipment, peripherals, and other office and industrial equipment and supplies; and trading of tools and molds. In addition, it distributes air-conditioner packaged and multi-split units; and trades in telecommunications and networking equipment. Further, the company produces metal containers, such as food cans, confectionery cans, paints cans, etc.; and provides customized metal printing services. It operates in the People's Republic of China, Singapore, Europe, Vietnam, Rest of Asia, North America, and internationally. The company was formerly known as China Auto Corporation Ltd. and changed its name to Acma Ltd. in April 2013. Acma Ltd. was incorporated in 1965 and is based in Singapore.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "AGS.SI": {
        "short_name": "TheHourGlass",
        "long_name": "The Hour Glass Limited",
        "summary": "The Hour Glass Limited, an investment holding company, retails and distributes watches, jewelry, and other luxury products in South East Asia, Australia, and North East Asia. It also invests in properties. The company operates 45 boutiques. The Hour Glass Limited was founded in 1979 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "AVX.SI": {
        "short_name": "HL Global Ent",
        "long_name": "HL Global Enterprises Limited",
        "summary": "HL Global Enterprises Limited, an investment holding company, operates in the hospitality operations and property development activities in Singapore, Malaysia, and the People's Republic of China. It operates in three segments: Investments and Others, Hospitality and Restaurant, and Property Development. The company operates and manages hotels and restaurants; and develops, sells, and rents properties. It also provides property and development project management, and hotel management and consultancy services. The company was formerly known as HLG Enterprise Limited and changed its name to HL Global Enterprises Limited in April 2008. HL Global Enterprises Limited was incorporated in 1961 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "AWI.SI": {
        "short_name": "Thakral",
        "long_name": "Thakral Corporation Ltd",
        "summary": "Thakral Corporation Ltd, an investment holding company, markets and distributes beauty, wellness, and lifestyle products. It operates through two divisions, Lifestyle Division and Investment Division. The company's Lifestyle division distributes beauty, wellness, and lifestyle products in Hong Kong, India, Indonesia, the Philippines, Singapore, and Thailand. It distributes products of at-home beauty and wellness device brands comprising Panasonic, DermaWand, Philips, T3, and Slendertone; skin and hair care products under the John Masters Organics brand; fragrance under the Maison Margiela, Ralph Lauren, Diesel, and Cacharel brands; and lifestyle brands, such as DJI. The company's Investments division is involved in real estate and property investments in Australia, Japan, and Singapore. It invests in real estate and other investment opportunities, which include property-backed financial instruments. This division also engages in the origination, packaging, and managing investment projects; and development and management of retirement living resorts under the GemLife brand. It is also involved in the property development activities. The company was incorporated in 1993 and is based in Singapore. Thakral Corporation Ltd is a subsidiary of Prime Trade Enterprises Limited.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "AYV.SI": {
        "short_name": "Acma",
        "long_name": "Acma Ltd.",
        "summary": "Acma Ltd., an investment holding company, manufactures and sells tools, automotive molds, and plastic injection molding products for the automotive and electronics industries. It operates through Tooling and Plastic Injection Moulding; Communications, Electronics and Equipment Distribution; Investment; and Metal Packaging and Metal Printing Services segments. The company is also involved in the sale, maintenance, and rental of communication equipment, computer equipment, peripherals, and other office and industrial equipment and supplies; and trading of tools and molds. In addition, it distributes air-conditioner packaged and multi-split units; and trades in telecommunications and networking equipment. Further, the company produces metal containers, such as food cans, confectionery cans, paints cans, etc.; and provides customized metal printing services. It operates in the People's Republic of China, Singapore, Europe, Vietnam, Rest of Asia, North America, and internationally. The company was formerly known as China Auto Corporation Ltd. and changed its name to Acma Ltd. in April 2013. Acma Ltd. was incorporated in 1965 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "B16.SI": {
        "short_name": "GL",
        "long_name": "GL Limited",
        "summary": "GL Limited (formerly known at various times as GuocoLeisure Limited, BIL International Limited and Brierley Investments Limited) was established in New Zealand in 1961. Today, GL Limited is an investment holding company with principal investments in hotel management & operations, oil & gas, property development and other areas in the leisure industry.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "B28.SI": {
        "short_name": "Bonvests",
        "long_name": "Bonvests Holdings Limited",
        "summary": "Bonvests Holdings Limited, an investment holding company, engages in the property development and investment, hotel ownership and management, and waste management and contract cleaning businesses. The company operates through Rental, Hotel, Industrial, Investment, and Others segments. It owns and manages various commercial and residential properties. The company also engages in the operation of the golf course, hotels and restaurants, bars, and thalassotherapy center; and investment, operation, and management of resorts, spas, and food and beverage outlets; and securities trading and investment holding activities. In addition, the company offers business and management, and public relations consultancy services; sales and marketing support; contract cleaning; laundry; and waste management services, such as waste disposal services to commercial, industrial, and residential properties, as well as other waste disposal related services. It operates in Singapore, Tunisia, Mauritius, Zanzibar, Maldives, Indonesia, Morocco, and Australia. Bonvests Holdings Limited was founded in 1982 and is based in Singapore. Bonvests Holdings Limited is a subsidiary of Goldvein Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "B58.SI": {
        "short_name": "Banyan Tree",
        "long_name": "Banyan Tree Holdings Limited",
        "summary": "Banyan Tree Holdings Limited, an investment holding company, develops, operates, and manages resorts, hotels, spas, and residences in Singapore, South East Asia, Indian Oceania, the Middle East, North East Asia, and internationally. It operates through Hotel Investments, Property Sales, and Fee-Based segments. The company engages in the hotel and restaurant operations; sale of hotel villas or suites to investors under the leaseback scheme; and development and sale of vacation homes in Laguna Phuket, as well as in the land development and sales activities. It is also involved in the management of an asset-backed destination club and private-equity funds; sale of merchandise; provision of architectural and design services; ownership and management of golf courses; and holding of land plots. In addition, the company provides tourist transportation, management consultancy, marketing, business management, investment management and related consulting, and tourism management consultancy services; operation and ancillary services related to the hospitality industry; consultation and management services of the international hotels marketing; purchasing and project services for hotels, resorts, and spas; and designing, planning, and consultancy services for hotels, resorts and spas, as well as owns and manages the intellectual property. Further, it is involved in the holiday club membership and property holding operations; operation, investment, and rental of retail outlets and offices; and development of residential properties. The company manages 29 hotels and resorts, 63 spas, 72 retail galleries, and 3 golf courses. Banyan Tree Holdings Limited was founded in 1984 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "BDX.SI": {
        "short_name": "GSH",
        "long_name": "GSH Corporation Limited",
        "summary": "GSH Corporation Limited, an investment holding company, engages in the development and sale of properties primarily in Malaysia and China. It operates through Hospitality, Property, and Others segments. The company is also involved in the rental of investment properties. In addition, it owns and operates the Sutera Harbour Resort comprising two five-star hotels, a 104-berth marina, and a 27-hole championship golf course in Kota Kinabalu, Malaysia, as well as the idyllic Sutera@Mantanani Resort, a 30-room resort on the Mantanani Islands in Sabah. Further, the company is involved in the retailing of clothing, souvenirs, and convenience items, as well as provision of upmarket train and facilities management services. Additionally, it engages in the sale of fuel and other related bunkering services; and frozen food trading business. The company was formerly known as JEL Corporation (Holdings) Ltd. and changed its name to GSH Corporation Limited in May 2012. GSH Corporation Limited was incorporated in 2001 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "BHU.SI": {
        "short_name": "SUTL Enterprise",
        "long_name": "SUTL Enterprise Limited",
        "summary": "SUTL Enterprise Limited, an investment holding company, develops and operates integrated marinas. The company operates its own marinas under the ONEÂ°15 brand, as well as third party marinas under management contracts. It operates the ONEÂ°15 Marina Sentosa Cove in Singapore; and ONEÂ°15 Marina Brooklyn in New York, the United States. The company also provides yacht chartering services with a fleet of approximately 40 luxury yachts; and marina consultancy and development services. The company was incorporated in 1993 and is headquartered in Singapore. SUTL Enterprise Limited is a subsidiary of SUTL Global Pte. Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "BJZ.SI": {
        "short_name": "Koda",
        "long_name": "Koda Ltd",
        "summary": "Koda Ltd, together with its subsidiaries, designs, manufactures, and sells wood furniture and fixtures in the Asia-Pacific, North America, Europe, and internationally. It operates through two segments, Manufacturing, and Retail and Distribution. The company manufactures wooden and steel furniture; and trades in, exports, and retails furniture. It offers bedroom, dining, living, and other collections of furniture products. The company is also involved in the inlaying of marble on wood; and interior decoration activities. In addition, it operates as a timber merchant. Koda Ltd was founded in 1972 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "BKW.SI": {
        "short_name": "Datapulse Tech",
        "long_name": "Datapulse Technology Limited",
        "summary": "Datapulse Technology Limited, an investment holding company, engages in the hotel and hospitality property investment business in South Korea and Singapore. The company is involved in the acquisition, property development, and trading of real estate, such as hotels and hospitality, commercial, industrial, residential, and mixed development properties; and operation of a hotel. It also provides asset management services, as well as engages in the investment activity of holding long-term and trading in short-term investments. The company was founded in 1980 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "BPF.SI": {
        "short_name": "YHI Intl",
        "long_name": "YHI International Limited",
        "summary": "YHI International Limited, an investment holding company, distributes automotive and industrial products in Singapore, Malaysia, China, Hong Kong, Taiwan, Australia, New Zealand, and internationally. It operates through three segments: Manufacturing, Distribution, and Rental. The company distributes automotive products, including tires and alloy wheels; industrial power products comprising automotive and rechargeable batteries for commercial and industrial use, as well as golf and utility buggies; and other industrial power products, such as solar panels, chargers, invertors, and uninterruptible power supply products. It also designs, develops, manufactures, advertises, promotes, distributes, and sells alloy wheels. In addition, the company engages in the rental of investment property; and provision of consultancy, marketing, and technology related services. The company distributes tires under the Yokohama, Nitto, Nankang, Nexen, Pirelli, Achilles, ATG Tires, Mickey Thompson, and Neuton Tyres brand names; alloy wheels under the Enkei, OZ, Konig, Breyton, and Advanti Racing brands; industrial power products under the Trojan, CSB, Crown, Vision, Neuton Power, Benning, Delta Q, and Jinko Solar brand names; and buggies and utility vehicles under the E-Z-GO, Cushman, and Neuton Electric brands. The company was founded in 1948 and is headquartered in Singapore. YHI International Limited is a subsidiary of YHI Holdings Pte Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "BTE.SI": {
        "short_name": "Bund Center",
        "long_name": "Bund Center Investment Ltd",
        "summary": "Bund Center Investment Ltd, an investment holding company, owns a hotel; and owns and manages commercial and retail properties in the People's Republic of China. It operates through Hotel and Property Leasing segments. The company owns The Westin Bund Center Shanghai, a five-star hotel in Shanghai. It also owns and manages the Bund Center Office Tower in Shanghai; and the Golden Center, a six-storey retail complex in Ningbo, Zhejiang. In addition, the company is involved in the trading of hotel supplies and related products; property development activities; and provision of consultancy and management services. The company was incorporated in 2009 and is based in Singapore. Bund Center Investment Ltd is a subsidiary of Flambo Bund Centre Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "BY91.MU": {
        "short_name": "GL LTD  DL-,20",
        "long_name": "GL Limited",
        "summary": "GL Limited (formerly known at various times as GuocoLeisure Limited, BIL International Limited and Brierley Investments Limited) was established in New Zealand in 1961. Today, GL Limited is an investment holding company with principal investments in hotel management & operations, oil & gas, property development and other areas in the leisure industry.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "BY92.F": {
        "short_name": "GL LTD  UNSP.ADR/10 O.N.",
        "long_name": "GL Limited",
        "summary": "GL Limited (formerly known at various times as GuocoLeisure Limited, BIL International Limited and Brierley Investments Limited) was established in New Zealand in 1961. Today, GL Limited is an investment holding company with principal investments in hotel management & operations, oil & gas, property development and other areas in the leisure industry.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "C07.SI": {
        "short_name": "Jardine C&C",
        "long_name": "Jardine Cycle & Carriage Limited",
        "summary": "Jardine Cycle & Carriage Limited, an investment holding company, engages in automotive, financial services, heavy equipment, mining, construction and energy, agribusiness, infrastructure and logistics, information technology, and property businesses in Indonesia and internationally. The company manufactures, assembles, distributes, and retails motor vehicles and motorcycles; retails used cars under the Republic Auto brand; distributes BYD electric forklifts; manufactures and distributes automotive components, as well as provides automotive rental, fleet management, and after-sales services; and offers motor vehicles and motorcycles consumer financing, heavy equipment financing, banking, and general and life insurance services. It also supplies construction and mining equipment, as well as provides related after-sales services; offers coal mining contractor services; and distributes Komatsu heavy equipment. In addition, the company is involved in cultivation, harvesting, processing, and production of crude palm oil; leasing business; development and management of toll roads; and provisions of logistics services, such as warehousing, freight forwarding, and seaport services. Further, it provides document information and communication technology solutions; distributes Fuji Xerox office equipment; and develops office buildings, and residential and commercial projects. The company was formerly known as Cycle & Carriage Ltd. and changed its name to Jardine Cycle & Carriage Limited in 2004. The company was founded in 1899 and is based in Singapore. Jardine Cycle & Carriage Limited is a subsidiary of Jardine Strategic Singapore Pte Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "C41.SI": {
        "short_name": "Cortina",
        "long_name": "Cortina Holdings Limited",
        "summary": "Cortina Holdings Limited, an investment holding company, retails and distributes timepieces and accessories in Singapore, Malaysia, Thailand, Indonesia, Hong Kong, Taiwan, and Russia. The company operates through Wholesale, Retail, and Others segments. The Wholesale segment engages in the wholesale of timepieces and luxury branded accessories. The Retail segment is involved in the retail of timepieces, branded pens, and accessories. The Others segment provides other support services. The company was founded in 1972 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "CHJ.SI": {
        "short_name": "Uni-Asia Grp",
        "long_name": "Uni-Asia Group Limited",
        "summary": "Uni-Asia Group Limited, together with its subsidiaries, operates as an alternative investment company. It operates hotels under the Hotel Vista and Hotel Vista Premio brands. The company also owns and charters ships, as well as offers ship investment and asset management services. In addition, it provides ship commercial and technical management services; and shipping related brokerage services, as well as involved in finance arrangement business. Further, the company provides property management and investment, project management, accounting, and administration, as well as investment advisory; and property leasing and construction management services. The company has operations in Japan, Asia, and internationally. Uni-Asia Group Limited was founded in 1997 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "CYC.F": {
        "short_name": "JARDINE CYCLE+CARR. SD 1",
        "long_name": "Jardine Cycle & Carriage Limited",
        "summary": "Jardine Cycle & Carriage Limited, an investment holding company, engages in automotive, financial services, heavy equipment, mining, construction and energy, agribusiness, infrastructure and logistics, information technology, and property businesses in Indonesia and internationally. The company manufactures, assembles, distributes, and retails motor vehicles and motorcycles; retails used cars under the Republic Auto brand; distributes BYD electric forklifts; manufactures and distributes automotive components, as well as provides automotive rental, fleet management, and after-sales services; and offers motor vehicles and motorcycles consumer financing, heavy equipment financing, banking, and general and life insurance services. It also supplies construction and mining equipment, as well as provides related after-sales services; offers coal mining contractor services; and distributes Komatsu heavy equipment. In addition, the company is involved in cultivation, harvesting, processing, and production of crude palm oil; leasing business; development and management of toll roads; and provisions of logistics services, such as warehousing, freight forwarding, and seaport services. Further, it provides document information and communication technology solutions; distributes Fuji Xerox office equipment; and develops office buildings, and residential and commercial projects. The company was formerly known as Cycle & Carriage Ltd. and changed its name to Jardine Cycle & Carriage Limited in 2004. The company was founded in 1899 and is based in Singapore. Jardine Cycle & Carriage Limited is a subsidiary of Jardine Strategic Singapore Pte Ltd.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "DM0.SI": {
        "short_name": "Hanwell",
        "long_name": "Hanwell Holdings Limited",
        "summary": "Hanwell Holdings Limited, together with its subsidiaries, supplies provisions and household consumer products in Singapore, Malaysia, China, and Japan. The company operates through two segments, Consumer Essentials Consumer Business and Strategic Investments Packaging. It engages in the marketing and sale of agency lines and proprietary brands; packaging and sale of paper products; and marketing and sale of consumer products in ambient and chilled categories, including rice, oil, and detergents. The company also manufactures and sells grass jelly products, soya bean products, noodles, and bakery products; and corrugated paper boards, corrugated paper cartons, die-cut boxes, assembly cartons, and heavy duty corrugated paper products, as well as consumer and commercial tissue paper products under the Beautex, Mood, Hibis, Comfy, and Parity brand names. In addition, it markets and distributes confectionery, snacks, grocery, and beverage, and bakery products; washroom hygiene products, such as cleaning agents and dispensers, and baby and adult diapers under brand names of PetPet, Fitti, and Certainty; and distributes automobile cleaning products under the brand name of MR.CLEAN, as well as distributes coconut milk under the Harmuni brand. Further, the company is involved in the property holding, investment, and development activities, as well as in property related activities. It serves food and beverage, electronics and electrical, plastic and metal stamping, pharmaceutical, chemical, printing, publishers, and converting industries, as well as offers its products to retail and food service outlets, such as supermarket, hypermarkets, convenience stores, and pharmacies. The company also exports its products. The company was formerly known as PSC Corporation Ltd and changed its name to Hanwell Holdings Limited in April 2012. Hanwell Holdings Limited was founded in 1974 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "DTPA.MU": {
        "short_name": "DATAPULSE TECHNOLOGY NEW",
        "long_name": "Datapulse Technology Limited",
        "summary": "Datapulse Technology Limited, an investment holding company, engages in the hotel and hospitality property investment business in South Korea and Singapore. The company is involved in the acquisition, property development, and trading of real estate, such as hotels and hospitality, commercial, industrial, residential, and mixed development properties; and operation of a hotel. It also provides asset management services, as well as engages in the investment activity of holding long-term and trading in short-term investments. The company was founded in 1980 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "F10.SI": {
        "short_name": "$ FJ Benjamin",
        "long_name": "F J Benjamin Holdings Ltd",
        "summary": "F J Benjamin Holdings Ltd, an investment holding company, engages in the brand building and management, and development of retail and distribution networks for international luxury and lifestyle brands in Southeast Asia. The company operates through three segments: Ongoing Retail, Distribution, and Export. It is involved in the import, export, licensing, distribution, and retail of consumer fashion wear and accessories, as well as home furnishings and timepieces. The company offers its luxury and lifestyle products under the Babyzen, Guess, La Senza, Marc Jacobs, Petunia Pickle Bottom, Pretty Ballerinas, Rebecca Minkoff, Sheridan, Superdry, U.S. Polo, and VNC. It also distributes timepieces under the Alpina, Baume & Mercier, Casio, FrÃ©dÃ©rique Constant, Gc, Guess, Nautica, Watchzone, and Victorinox Swiss Army brands. As of June 30, 2020, the company operated 169 stores, including 14 stores in Singapore, 53 stores in Malaysia, and 102 stores in Indonesia. F J Benjamin Holdings Ltd was founded in 1959 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "G13.SI": {
        "short_name": "Genting Sing",
        "long_name": "Genting Singapore Limited",
        "summary": "Genting Singapore Limited engages in the development, management, and operation of integrated resort destinations in Asia. The company primarily owns Resorts World Sentosa, a destination resort, S.E.A. Aquarium, Adventure Cove Waterpark, Universal Studios Singapore Theme Park, hotels, MICE venues, restaurants, SPA, and specialty retail outlets. It also engages in the operation of casinos; and the provision of sales and marketing support services to leisure and hospitality related businesses, as well as investment activities. The company was incorporated in 1984 and is headquartered in Singapore. Genting Singapore Limited is a subsidiary of Genting Overseas Holdings Limited.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "G50.SI": {
        "short_name": "Grand Banks",
        "long_name": "Grand Banks Yachts Limited",
        "summary": "Grand Banks Yachts Limited, an investment holding company, manufactures and sells luxury recreational motor yachts in the United States, Australia, and Europe. The company offers its yachts primarily under the Grand Banks and Palm Beach brand names. It also engages in the sale of new and previously-owned yachts, as well as boat brokerage activities. Grand Banks Yachts Limited was founded in 1956 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "GD1M.F": {
        "short_name": "ICP LTD -LOCAL-",
        "long_name": "ICP Ltd.",
        "summary": "ICP Ltd., an investment holding company, engages in the hospitality, and vessel ownership and chartering activities in Singapore, Malaysia, Korea, Hong Kong, and internationally. It is also involved in the ownership of hotels, as well as management and franchising of the Travelodge hotel brand. In addition, the company provides management consultancy services; owns trademark rights; offers leasing services; and invests in quoted and/or unquoted securities, including debentures, stocks, shares, and units in any fund or collective investment scheme. Further, it owns and charters two steel petroleum product tankers. The company was formerly known as Goldtron Limited and changed its name to ICP Ltd. in 2012. ICP Ltd. was incorporated in 1962 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "GIGNF": {
        "short_name": "GENTING SINGAPORE LTD",
        "long_name": "Genting Singapore Limited",
        "summary": "Genting Singapore Limited engages in the development, management, and operation of integrated resort destinations in Asia. The company primarily owns Resorts World Sentosa, a destination resort, S.E.A. Aquarium, Adventure Cove Waterpark, Universal Studios Singapore Theme Park, hotels, MICE venues, restaurants, SPA, and specialty retail outlets. It also engages in the operation of casinos; and the provision of sales and marketing support services to leisure and hospitality related businesses, as well as investment activities. The company was incorporated in 1984 and is headquartered in Singapore. Genting Singapore Limited is a subsidiary of Genting Overseas Holdings Limited.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "GIGNY": {
        "short_name": "GENTING SINGAPORE LTD",
        "long_name": "Genting Singapore Limited",
        "summary": "Genting Singapore Limited engages in the development, management, and operation of integrated resort destinations in Asia. The company primarily owns Resorts World Sentosa, a destination resort, S.E.A. Aquarium, Adventure Cove Waterpark, Universal Studios Singapore Theme Park, hotels, MICE venues, restaurants, SPA, and specialty retail outlets. It also engages in the operation of casinos; and the provision of sales and marketing support services to leisure and hospitality related businesses, as well as investment activities. The company was incorporated in 1984 and is headquartered in Singapore. Genting Singapore Limited is a subsidiary of Genting Overseas Holdings Limited.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "GLE.AX": {
        "short_name": "GLG CORP FPO",
        "long_name": "GLG Corp Ltd",
        "summary": "GLG Corp Ltd manufactures and supplies fabrics and garments worldwide. It offers ready to wear, casual active, performance, sleepwear, menswear, children's wear, private label, and ultra mask products. The company supplies its garments through marketing and manufacturing network primarily to retailers in the United States. The company is headquartered in Singapore. GLG Corp Ltd is a subsidiary of Ghim Li Group Pte Ltd.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "GUORY": {
        "short_name": "GL LIMITED",
        "long_name": "GL Limited",
        "summary": "GL Limited (formerly known at various times as GuocoLeisure Limited, BIL International Limited and Brierley Investments Limited) was established in New Zealand in 1961. Today, GL Limited is an investment holding company with principal investments in hotel management & operations, oil & gas, property development and other areas in the leisure industry.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "H07.SI": {
        "short_name": "Stamford Land",
        "long_name": "Stamford Land Corporation Ltd",
        "summary": "Stamford Land Corporation Ltd, an investment holding company, owns, operates, and manages luxury hotels in Singapore, Australia, the United Kingdom, and New Zealand. The company operates through five segments: Hotel Owning and Management, Property Development, Property Investment, Trading, and Others. It owns and operates hotels and resorts under the Sir Stamford Circular Quay, Stamford Plaza Sydney Airport, Stamford Grand Adelaide, Stamford Plaza Adelaide, Stamford Plaza Melbourne, Stamford Plaza Brisbane, and Stamford Plaza Auckland names. The company also invests in, develops, constructs, trades in, rents, and manages real estate properties. In addition, it trades in interior  decoration products; and offers trustee, travel agency, and management services. Further, the company invests in securities; and provides treasury functions. The company was formerly known as Hai Sun Hup Group Ltd. Stamford Land Corporation Ltd was founded in 1935 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "H12.SI": {
        "short_name": "Hotel Royal",
        "long_name": "Hotel Royal Limited",
        "summary": "Hotel Royal Limited, an investment holding company, operates in the hotelier business. The company operates through Hotel Operations, Property Investments, and Financial Investments segments. It owns, operates, and manages 7 hotels in Singapore, Malaysia, and Thailand. The company is also involved in owning and letting out residential buildings, office units, factory units, shopping centers, and car park lots in Singapore, Malaysia, and New Zealand. In addition, it invests in portfolio of shares, bonds, and funds. The company was incorporated in 1968 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "H15.SI": {
        "short_name": "HPL",
        "long_name": "Hotel Properties Limited",
        "summary": "Hotel Properties Limited, an investment holding company, owns, manages, and operates hotels in Singapore and internationally. It operates through Hotels, Properties, and Others segments. The company owns and operates 36 hotels under the Four Seasons, Hilton International, Como Hotels, InterContinental Hotels Group, Six Senses Hotels, Marriott International, Hard Rock Hotels, and Concorde Hotels & Resorts brands, as well as resorts and shopping galleries primarily in Singapore, Malaysia, Thailand, Maldives, Indonesia, Seychelles, the United Kingdom and Europe, Vanuatu, Bhutan, Tanzania, South Africa, Vietnam, Italy, and Sri Lanka. It also engages in the rental and sale of residential properties and commercial units; property development and project management activities; trading of quoted investments and share dealing; card service operations; casino operations; and provision of administrative and information services. The company was incorporated in 1980 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "H18.SI": {
        "short_name": "Hotel Grand",
        "long_name": "Hotel Grand Central Limited",
        "summary": "Hotel Grand Central Limited, together with its subsidiaries, owns, operates, and manages hotels in Singapore, Malaysia, Australia, New Zealand, and China. It also provides marketing and support, and management services; and invests in commercial properties. The company was founded in 1968 and is based in Singapore. Hotel Grand Central Limited is a subsidiary of Tan Chee Hoe & Sons Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "I15.SI": {
        "short_name": "Isetan",
        "long_name": "Isetan (Singapore) Limited",
        "summary": "Isetan (Singapore) Limited operates department stores and supermarkets in Singapore. The company operates in two segments, Retail and Property. It operates stores under the Isetan Scotts, Isetan Katong, Isetan Tampines, and Isetan Serangoon Central names. The company also operates online stores; owns and leases properties; and trades in general merchandise. The company was formerly known as Isetan Emporium (Singapore) Private Limited and changed its name to Isetan (Singapore) Limited in 1981. Isetan (Singapore) Limited was founded in 1886 and is headquartered in Singapore. Isetan (Singapore) Limited is a subsidiary of Isetan Mitsukoshi Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "JCYCF": {
        "short_name": "JARDINE CYCLE & CARRIAGE LTD",
        "long_name": "Jardine Cycle & Carriage Limited",
        "summary": "Jardine Cycle & Carriage Limited, an investment holding company, engages in automotive, financial services, heavy equipment, mining, construction and energy, agribusiness, infrastructure and logistics, information technology, and property businesses in Indonesia and internationally. The company manufactures, assembles, distributes, and retails motor vehicles and motorcycles; retails used cars under the Republic Auto brand; distributes BYD electric forklifts; manufactures and distributes automotive components, as well as provides automotive rental, fleet management, and after-sales services; and offers motor vehicles and motorcycles consumer financing, heavy equipment financing, banking, and general and life insurance services. It also supplies construction and mining equipment, as well as provides related after-sales services; offers coal mining contractor services; and distributes Komatsu heavy equipment. In addition, the company is involved in cultivation, harvesting, processing, and production of crude palm oil; leasing business; development and management of toll roads; and provisions of logistics services, such as warehousing, freight forwarding, and seaport services. Further, it provides document information and communication technology solutions; distributes Fuji Xerox office equipment; and develops office buildings, and residential and commercial projects. The company was formerly known as Cycle & Carriage Ltd. and changed its name to Jardine Cycle & Carriage Limited in 2004. The company was founded in 1899 and is based in Singapore. Jardine Cycle & Carriage Limited is a subsidiary of Jardine Strategic Singapore Pte Ltd.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "JCYGY": {
        "short_name": "JARDINE CYCLE & CARRIAGE LTD",
        "long_name": "Jardine Cycle & Carriage Limited",
        "summary": "Jardine Cycle & Carriage Limited, an investment holding company, engages in automotive, financial services, heavy equipment, mining, construction and energy, agribusiness, infrastructure and logistics, information technology, and property businesses in Indonesia and internationally. The company manufactures, assembles, distributes, and retails motor vehicles and motorcycles; retails used cars under the Republic Auto brand; distributes BYD electric forklifts; manufactures and distributes automotive components, as well as provides automotive rental, fleet management, and after-sales services; and offers motor vehicles and motorcycles consumer financing, heavy equipment financing, banking, and general and life insurance services. It also supplies construction and mining equipment, as well as provides related after-sales services; offers coal mining contractor services; and distributes Komatsu heavy equipment. In addition, the company is involved in cultivation, harvesting, processing, and production of crude palm oil; leasing business; development and management of toll roads; and provisions of logistics services, such as warehousing, freight forwarding, and seaport services. Further, it provides document information and communication technology solutions; distributes Fuji Xerox office equipment; and develops office buildings, and residential and commercial projects. The company was formerly known as Cycle & Carriage Ltd. and changed its name to Jardine Cycle & Carriage Limited in 2004. The company was founded in 1899 and is based in Singapore. Jardine Cycle & Carriage Limited is a subsidiary of Jardine Strategic Singapore Pte Ltd.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "L38.SI": {
        "short_name": "AF Global",
        "long_name": "AF Global Limited",
        "summary": "AF Global Limited, an investment holding company, owns and operates hotels and serviced residences. It operates through Property, Hotel and Serviced Residence, and Leisure and Others segments. The company operates Holiday Inn Resort Phuket, a hotel with 398 rooms; and serviced residences, which consists of studio units, apartments, and office units. It also provides project and property management services; and real estate consultancy services, as well as develops, sells, and invests in properties. In addition, the company owns and operates family entertainment centers. It has operations in Singapore, the People's Republic of China, Thailand, Vietnam, the Lao People's Democratic Republic, and the United Kingdom. The company was formerly known as LCD Global Investments Ltd. and changed its name to AF Global Limited in April 2016. The company was founded in 1973 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "M01.SI": {
        "short_name": "Metro",
        "long_name": "Metro Holdings Limited",
        "summary": "Metro Holdings Limited, together with its subsidiaries, engages in retail, and property development and investment businesses in Singapore, China, Indonesia, the United Kingdom, Australia, and internationally. The company operates through two segments, Property Investment and Development, and Retail. It leases shopping and office spaces, as well as invests in property-related investments; and develops and sells residential and mixed-use properties. The company offers a range of merchandise products, men's and women's fashion products, kids wear, toys, and home and bedding products through a chain of 2 Metro department stores in Singapore. Metro Holdings Limited was founded in 1957 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "N08.SI": {
        "short_name": "New Toyo",
        "long_name": "New Toyo International Holdings Ltd",
        "summary": "New Toyo International Holdings Ltd, an investment holding company, produces and sells specialty packaging materials in Hong Kong, Vietnam, Singapore, Indonesia, Malaysia, Australia, Dubai, and China. It operates through Specialty Papers, Printed Cartons and Labels, Trading, Tissue paper, and Investment Holding segments. The company offers laminated aluminum foil papers, coated paper and metallized papers, and laminated metalized polyethylene teraphthalate boards for cigarette packaging, food, beverages, wine and liquor, tissue boxes, cosmetic packaging, and gift-wrapping applications; and paper cones, paper plates, and paper cups. It also provides gravure and offset printed materials for fast-moving consumer goods, such as cigarette cartons, cereal boxes, and beer labels. In addition, the company engages in the procurement of tobacco packaging related materials; manufacture of corrugated recycled cartons and sheets for general packaging in fast-moving consumer goods industries; manufacture of tissue papers comprises jumbo rolls; trading of paper products, machinery, and spares and equipment; and production and sale of electric motorcycles, electric scooters, and electric bicycles. Further, it invests in commercial properties, residential apartments, factories, and industrial and warehouse buildings. The company was founded in 1975 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "O08.SI": {
        "short_name": "Ossia Intl^",
        "long_name": "Ossia International Limited",
        "summary": "Ossia International Limited, an investment holding company, imports, distributes, and retails apparel, sporting goods, footwear, accessories, bags, and golf products in the Asia Pacific region. It serves customers through a network of approximately 1,300 channels/outlets. The company was founded in 1982 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "O9E.SI": {
        "short_name": "Parkson Retail^",
        "long_name": "Parkson Retail Asia Limited",
        "summary": "Parkson Retail Asia Limited, an investment holding company, operates department stores and apparel outlets primarily in Malaysia, Vietnam, Indonesia, and Myanmar. Its stores offer merchandise, including fashion apparel and household goods. The company is also involved in the operation of bakeries; and merchandising activities. In addition, it operates shopping centers, and food and beverage outlets; and provides fashion products under private label brands, as well as agency apparel lines of various international brands. Further, the company trades in apparel and consumer products; distributes and sells fragrance and beauty care products; and provides management and consulting services on real estate, business, and marketing in relation to department stores. As of June 30, 2020, it operated 61 department stores. The company was founded in 1987 and is based in Singapore. Parkson Retail Asia Limited is a subsidiary of East Crest International Limited.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "OU8.SI": {
        "short_name": "Centurion",
        "long_name": "Centurion Corporation Limited",
        "summary": "Centurion Corporation Limited, an investment holding company, owns, develops, and manages workers and student accommodation assets in Singapore, the United Kingdom, the United States, Malaysia, Australia, and internationally. The company operates through three segments: Workers Accommodation, Student Accommodation, and Others. It manages workers accommodation assets under the Westlite Accommodation brand and student accommodation assets under the dwell brand. As of December 31, 2020, the company owned and managed a portfolio of 35 operational accommodation assets totaling 73,460 beds. It also manufactures and sells optical discs and related data storage products. In addition, the company offers laundry; cleaning and maintenance; management; utilities and transportation; tourist; asset management; fund management; trustee; and business and management consultancy services. The company was founded in 1984 and is headquartered in Singapore. Centurion Corporation Limited is a subsidiary of Centurion Properties Pte Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "RBZHF": {
        "short_name": "REEBONZ HOLDING LIMITED",
        "long_name": "Reebonz Holding Limited",
        "summary": "Reebonz Holding Limited operates an online marketplace and platform for buying and selling new and pre-owned luxury products in Southeast Asia and the Asia Pacific markets. It offers a range of new and pre-owned luxury goods, including handbags, small leather goods and other accessories, shoes, watches, and jewelry. The company was founded in 2009 and is headquartered in Singapore.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "RDR.SI": {
        "short_name": "$ Incredible",
        "long_name": "Incredible Holdings Ltd.",
        "summary": "Incredible Holdings Ltd., an investment holding company, distributes specialty chemical products and consumable materials for the electronic industry in the Asia Pacific and the People's Republic of China. It also designs, assembles, supplies, and installs electrical switch boxes; distributes equipment; and retails and trades in new and used luxury goods. In addition, the company provides loan financing services. The company was formerly known as Vashion Group Ltd. and changed its name to Incredible Holdings Ltd. in November 2019. Incredible Holdings Ltd. was incorporated in 1999 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "S29.SI": {
        "short_name": "Stamford Tyres",
        "long_name": "Stamford Tyres Corporation Limited",
        "summary": "Stamford Tyres Corporation Limited, an investment holding company, engages in the wholesale and retail of tires and wheels in South East Asia, North Asia, Africa, and internationally. The company offers tires for high performance cars, passenger cars, SUVs, light trucks, and truck radials; and radials for sports and passenger cars, light trucks, trucks, and buses, as well as for military, agriculture, and industrial solid tires. It also provides tires for the construction and mining industry; industrial and construction tires for use in skid steers, backhoes, and forklifts; and nylon bias tires for light truck, truck, agriculture, and earthmover applications. In addition, the company engages in the design and contract manufacturing of tires for proprietary brands, tire retreading, equipment trading, and servicing of motor vehicles; manufacture and sale of aluminum alloy wheels; and property holding activities. Further, it distributes Falken, Dunlop, Continental, and Maxam branded tires, as well as offers its proprietary brands, such as Sumo Firenza, Sumo Tire, and SSW wheels. Additionally, the company operates a retail network in Singapore and Malaysia with Mega Mart and Tyre Mart outlets that offer a range of tires, wheels, batteries, and auto accessories, as well as workshop and tire services. Stamford Tyres Corporation Limited was incorporated in 1989 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "S85.SI": {
        "short_name": "Straco",
        "long_name": "Straco Corporation Limited",
        "summary": "Straco Corporation Limited, together with its subsidiaries, develops and manages tourism-related businesses in Singapore and the People's Republic of China. It operates in two segments, Aquariums and Giant Observation Wheel (GOW). The Aquariums segment operates aquatic-related facilities and tourist attractions, including sea mammal performances. The GOW segment operates circular giant observation structure; and provides commercial space. The company also operates cable-car facilities; and provides management and consulting services, and project management services to third parties. Straco Corporation Limited was incorporated in 2002 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "SJY.SI": {
        "short_name": "$ MeGroup",
        "long_name": "MeGroup Ltd.",
        "summary": "MeGroup Ltd., through its subsidiaries, primarily engages in the automobile dealership business in Malaysia. The company operates in two segments, Manufacturing Business and Dealership Business. It engages in the sale of new automobiles, as well as automobile parts and accessories; and provision of automobile body paintwork, collision repair, and after-sales services. The company also manufactures noise, vibration, and harshness (NVH) components, such as headliners and engine outers that are incorporated into various parts of automobiles, including top ceiling, dashboard, hood, and boot; and non-NVH components comprising parcel trays and board assembly decks for the automotive industry, as well as provides related support services. MeGroup Ltd. was incorporated in 2018 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "SR6.F": {
        "short_name": "SOUP RESTAURANT GROUP LTD",
        "long_name": "Soup Restaurant Group Limited",
        "summary": "Soup Restaurant Group Limited, an investment holding company, operates restaurants. The company operates 19 restaurant outlets in Singapore and Malaysia under Soup Restaurant, CAFE O, and POT LUCK brands, as well as 2 franchised outlets in Indonesia. It also sources, supplies, processes, and distributes raw materials and food products, as well as provides procurement services; and offers job training and vocational rehabilitation services. The company was founded in 1991 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "SST.F": {
        "short_name": "HEETON HLDGS LTD  SD-,20",
        "long_name": "Heeton Holdings Limited",
        "summary": "Heeton Holdings Limited, an investment holding company, engages in the hospitality business in Singapore, Thailand, Australia, Japan, Malaysia, Vietnam, and the United Kingdom. It operates through Hospitality, Property Investment, and Property Development segments. The company engages in the development and sale of private residential properties, as well as provides property management services. It also leases residential, retail, and commercial properties. In addition, the company owns, manages, and franchises hotels and related services; and provides administrative and management services. As of December 31, 2019, it operates 13 hotels. Heeton Holdings Limited was founded in 1976 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "T12.SI": {
        "short_name": "Tat Seng Pkg",
        "long_name": "Tat Seng Packaging Group Ltd",
        "summary": "Tat Seng Packaging Group Ltd, together with its subsidiaries, designs, manufactures, and sells corrugated paper products and other packaging products in Singapore and the People's Republic of China. The company offers regular slotted carton boxes, die-cut carton boxes, offset-printed boxes, corrugated partition pads/layer pads, corrugated boards, and heavy duty corrugated products; other packaging-related or customized products, such as tapes, stretch films, foams, and edgeboard protectors; and paper pallets for storage and transport requirements. It serves multi-national corporations and local manufacturers in the food and beverage, electronics and electrical, pharmaceutical and chemical, plastic and metal stamping, and other exporting related industries. The company was formerly known as Tat Seng Paper Containers Pte Ltd. and changed its name to Tat Seng Packaging Group Ltd in 2001. The company was founded in 1968 and is based in Singapore. Tat Seng Packaging Group Ltd is a subsidiary of Hanwell Holdings Limited.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "T6I.SI": {
        "short_name": "ValueMax",
        "long_name": "ValueMax Group Limited",
        "summary": "ValueMax Group Limited, an investment holding company, engages in the pawnbroking, moneylending, retailing of jewellery and watches, gold trading, and remittance activities. It offers pawn broking services through pledging jewellery in yellow or white gold, diamond jewellery, and branded timepieces, as well as gold, platinum, or silver bars and coins as pledges. The company also provides secured and unsecured loans for businessmen and corporates; and financing services for automotive industry. In addition, it sells new and pre-owned jewellery, such as gold and diamond jewellery, gold bars and coins, branded watches, and HermÃ¨s bags in its outlets; purchases scrap gold from other pawnbrokers and jewellery traders; sells fine gold bars to jewellery factories, wholesalers, and retailers; and provides services of remitting money. The company operates 40 pawn and retail outlets and one other pawnshops in Singapore, as well as 14 outlets in Malaysia. Further, it is involved in the provision of management and IT, business management and consultancy, and car financing services, as well as in the property holding activities. ValueMax Group Limited was founded in 1988 and is based in Singapore. ValueMax Group Limited is a subsidiary of Yeah Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "THK1.F": {
        "short_name": "THAKRAL CORP. LTD",
        "long_name": "Thakral Corporation Ltd",
        "summary": "Thakral Corporation Ltd, an investment holding company, markets and distributes beauty, wellness, and lifestyle products. It operates through two divisions, Lifestyle Division and Investment Division. The company's Lifestyle division distributes beauty, wellness, and lifestyle products in Hong Kong, India, Indonesia, the Philippines, Singapore, and Thailand. It distributes products of at-home beauty and wellness device brands comprising Panasonic, DermaWand, Philips, T3, and Slendertone; skin and hair care products under the John Masters Organics brand; fragrance under the Maison Margiela, Ralph Lauren, Diesel, and Cacharel brands; and lifestyle brands, such as DJI. The company's Investments division is involved in real estate and property investments in Australia, Japan, and Singapore. It invests in real estate and other investment opportunities, which include property-backed financial instruments. This division also engages in the origination, packaging, and managing investment projects; and development and management of retirement living resorts under the GemLife brand. It is also involved in the property development activities. The company was incorporated in 1993 and is based in Singapore. Thakral Corporation Ltd is a subsidiary of Prime Trade Enterprises Limited.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "VL6.SI": {
        "short_name": "Koufu",
        "long_name": "Koufu Group Limited",
        "summary": "Koufu Group Limited, an investment holding company, manages and operates food courts and coffee shops in Singapore and Macau. The company operates in two segments, Outlet & Mall Management and Food and Beverages (F&B) Retail. The Outlet & Mall Management segment operates and/or manages food courts, coffee shops, and a hawker center and a commercial mall. As of December 31, 2019, it operated 50 food courts, including two food courts in Macau, as well as 16 coffee shops, a hawker center, and a commercial mall in Singapore. The F&B Retail segment operates 76 self-operated F&B stalls, including four F&B stalls in Macau; 29 F&B kiosks comprising one in Macau and one in Malaysia; and 7 quick-service and 4 full-service restaurants. The company operates food courts under the Koufu, Rasapura Masters, Cookhouse by Koufu, Fork & Spoon, and Gourmet Paradise brands; coffee shops under the Happy Hawkers, R&B Tea, and 1983-A Taste Of Nanyang brands; full service restaurants under the Elemen brand; quick service restaurants under the Grove, 1983-Coffee & Toast, and Supertea brands; and commercial mall under the Punggol Plaza brand. It also processes food products; leases intangible assets; and engages in letting and operating coffee shops. The company was founded in 2002 and is based in Singapore. Koufu Group Limited is a subsidiary of Jun Yuan Holdings Pte Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "WJP.SI": {
        "short_name": "VICOM Ltd",
        "long_name": "VICOM Ltd",
        "summary": "VICOM Ltd provides technical testing and inspection services in Singapore. The company offers vehicle inspection services, including inspection for petrol-driven and diesel-driven vehicles, motorcycles, and power assisted bicycles; vehicle assessment services; and emission test laboratory services. It also provides vehicle evaluation, vehicle inspection and type approval system, in-vehicle unit, speed limiter check, chassis dynamometer smoke test, road tax renewal, motor and general insurance, car buying tips and maintenance talks, and consultancy services. The company offers testing, calibration, inspection, consultancy, and training services to aerospace, marine and offshore, biotechnology, oil and petrochemical, building construction, and electronics manufacturing industries. The company was incorporated in 1981 and is based in Singapore. VICOM Ltd is a subsidiary of ComfortDelGro Corporation Limited.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "XCF.SI": {
        "short_name": "$ KTMG",
        "long_name": "KTMG Limited",
        "summary": "KTMG Limited, an investment holding company, operates as an integrated textile and apparel manufacturer. The company engages in the contract manufacturing of nightwear, lounge wear, casual wear, and plus sized apparel for retailers. It is also involved in the knitting, dyeing, finishing, and printing of fabrics. The company sells its products in the United States, the United Kingdom, Canada, European Union, Malaysia, and internationally. KTMG Limited is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "Y45.SI": {
        "short_name": "SingMyanmar^",
        "long_name": "Singapore Myanmar Investco Limited",
        "summary": "Singapore Myanmar Investco Limited operates as an investment and management company primarily in Myanmar. The company engages in the travel and fashion retail, auto services, food and beverage, logistics and warehouse services, construction services, and serviced offices businesses. It distributes heavy equipment and spare parts; retail of fashion, lifestyle, and travel products; and provides car rental and limousine services. The company is also involved in the operation of food and beverage outlets, including restaurants, and coffee and tea stores; distribution of food and beverage items, wine, syrup, and water; provision of trucking, warehousing, and cold storage facility services; and equipment rental, vehicle repair, and fleet management activities. In addition, it offers infrastructure engineering, management consultancy, and consultancy and advertising services for the food and beverage industry. The company was formerly known as Singapore Windsor Holdings Limited and changed its name to Singapore Myanmar Investco Limited in July 2015. The company was founded in 1986 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "YAV1.F": {
        "short_name": "SUTL ENTERPRISE LTD",
        "long_name": "SUTL Enterprise Limited",
        "summary": "SUTL Enterprise Limited, an investment holding company, develops and operates integrated marinas. The company operates its own marinas under the ONEÂ°15 brand, as well as third party marinas under management contracts. It operates the ONEÂ°15 Marina Sentosa Cove in Singapore; and ONEÂ°15 Marina Brooklyn in New York, the United States. The company also provides yacht chartering services with a fleet of approximately 40 luxury yachts; and marina consultancy and development services. The company was incorporated in 1993 and is headquartered in Singapore. SUTL Enterprise Limited is a subsidiary of SUTL Global Pte. Ltd.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}