{
    "5IG.SI": {
        "short_name": "Gallant Venture",
        "long_name": "Gallant Venture Ltd.",
        "summary": "Gallant Venture Ltd., an investment holding company, operates as an integrated automotive company primarily in Indonesia. Its Industrial parks segment develops, constructs, operates, and maintains industrial properties in Batam and Bintan Islands with supporting infrastructure activities. The company's Utilities segment provides electricity and water supply, telecommunications, waste management, and sewage treatment services to the industrial parks and resorts in Batam and Bintan Islands. It operates 18 dual fuel fired generators with an installed capacity of approximately 125MW at Batamindo Industrial Park; 6 generators with an installed capacity of approximately 10MW at Bintan Industrial Estate; and 4 generators with an installed capacity of approximately 24MW at Bintan Resorts. Its Resort Operations segment offers services to resort operators in Bintan Resort, including ferry services and ferry terminal operations, tour operations, property rental, workers accommodation, security, fire-fighting, and medical support services, as well as facilities required by resort operators. This segment also provides estate and township maintenance services, such as road maintenance and drainage, as well as operates a 24-hour crisis center. The company's Property Development segment develops industrial and resort properties in Batam and Bintan Islands. Its Automotive segment engages in the vehicle sales distribution, after sales services, vehicle ownership financing, spare part distribution, vehicle assembly, automotive parts manufacturing, and other related supporting activities. The company also offers business management consultancy services; engages in the Wholesaler of hotels, resorts, and golf courses. The company was incorporated in 2003 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "099254",
        "website": "http://www.gallantventure.com",
        "full_time_employees": 1227
    },
    "8126.HK": {
        "short_name": "G. A. HOLDINGS",
        "long_name": "G.A. Holdings Limited",
        "summary": "G.A. Holdings Limited, an investment holding company, engages in the sale of motor vehicles and provision of car-related technical services in Singapore, Hong Kong, and the People's Republic of China. It operates through two segments, Motor Vehicles Sales and Services Business, and Car Rental Business. The company distributes a range of luxury and ultra-luxury motor vehicles of various brands, such as BMW, Mini, Ferrari, and Maserati. It is also involved in the wholesale and retail of original auto parts and accessories of BMW, Mini Cooper, Ferrari, and Maserati, as well as operates as an authorized distributor of AC Schnitzer. In addition, the company operates authorized service centers that offers repair and maintenance services for high-end automobiles; and operates as a licensee of the Hertz car rental services. Further, the company engages in the automobile dealership and motor vehicles exhibition business. G.A. Holdings Limited was founded in 1993 and is headquartered in Singapore.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "308900",
        "website": "http://www.ga-holdings.com.hk",
        "full_time_employees": 757
    },
    "SJY.SI": {
        "short_name": "$ MeGroup",
        "long_name": "MeGroup Ltd.",
        "summary": "MeGroup Ltd., through its subsidiaries, primarily engages in the automobile dealership business in Malaysia. The company operates in two segments, Manufacturing Business and Dealership Business. It engages in the sale of new automobiles, as well as automobile parts and accessories; and provision of automobile body paintwork, collision repair, and after-sales services. The company also manufactures noise, vibration, and harshness (NVH) components, such as headliners and engine outers that are incorporated into various parts of automobiles, including top ceiling, dashboard, hood, and boot; and non-NVH components comprising parcel trays and board assembly decks for the automotive industry, as well as provides related support services. MeGroup Ltd. was incorporated in 2018 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "048623",
        "website": "http://www.me-grp.com",
        "full_time_employees": null
    },
    "WJP.SI": {
        "short_name": "VICOM Ltd",
        "long_name": "VICOM Ltd",
        "summary": "VICOM Ltd provides technical testing and inspection services in Singapore. The company offers vehicle inspection services, including inspection for petrol-driven and diesel-driven vehicles, motorcycles, and power assisted bicycles; vehicle assessment services; and emission test laboratory services. It also provides vehicle evaluation, vehicle inspection and type approval system, in-vehicle unit, speed limiter check, chassis dynamometer smoke test, road tax renewal, motor and general insurance, car buying tips and maintenance talks, and consultancy services. The company offers testing, calibration, inspection, consultancy, and training services to aerospace, marine and offshore, biotechnology, oil and petrochemical, building construction, and electronics manufacturing industries. The company was incorporated in 1981 and is based in Singapore. VICOM Ltd is a subsidiary of ComfortDelGro Corporation Limited.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "575718",
        "website": "http://www.vicom.com.sg",
        "full_time_employees": 863
    }
}