{"6928.HK": {"short_name": "TOMO HOLDINGS", "long_name": "TOMO Holdings Limited", "summary": "TOMO Holdings Limited, an investment holding company, engages in the design, manufacture, supply, and installation of leather upholstery for passenger vehicles in Singapore. It operates in two segments, Passenger Vehicle Leather Upholstery, and Passenger Vehicle Electronic Accessories. The company offers rear and front seats leather upholstery products. It also provides leather wrappings for other passenger vehicle interior products, such as door panels, and head and arm rests. In addition, the company offers passenger vehicle electronic accessories, including navigation and multimedia accessories comprising navigation systems, head units, and in-car entertainment systems; and safety and security accessories that enhance driver and passenger safety and security consisting of digital video recorders, reverse cameras and parking sensors, and security alarm systems. It sells its products to passenger vehicle distributors and dealers. The company was founded in 1995 and is headquartered in Singapore. TOMO Holdings Limited is a subsidiary of TOMO Ventures Limited.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "HKG", "market": "hk_market", "country": "Singapore", "city": "Singapore"}, "AAX1.F": {"short_name": "ACMA LTD", "long_name": "Acma Ltd.", "summary": "Acma Ltd., an investment holding company, manufactures and sells tools, automotive molds, and plastic injection molding products for the automotive and electronics industries. It operates through Tooling and Plastic Injection Moulding; Communications, Electronics and Equipment Distribution; Investment; and Metal Packaging and Metal Printing Services segments. The company is also involved in the sale, maintenance, and rental of communication equipment, computer equipment, peripherals, and other office and industrial equipment and supplies; and trading of tools and molds. In addition, it distributes air-conditioner packaged and multi-split units; and trades in telecommunications and networking equipment. Further, the company produces metal containers, such as food cans, confectionery cans, paints cans, etc.; and provides customized metal printing services. It operates in the People's Republic of China, Singapore, Europe, Vietnam, Rest of Asia, North America, and internationally. The company was formerly known as China Auto Corporation Ltd. and changed its name to Acma Ltd. in April 2013. Acma Ltd. was incorporated in 1965 and is based in Singapore.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "FRA", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "AYV.SI": {"short_name": "Acma", "long_name": "Acma Ltd.", "summary": "Acma Ltd., an investment holding company, manufactures and sells tools, automotive molds, and plastic injection molding products for the automotive and electronics industries. It operates through Tooling and Plastic Injection Moulding; Communications, Electronics and Equipment Distribution; Investment; and Metal Packaging and Metal Printing Services segments. The company is also involved in the sale, maintenance, and rental of communication equipment, computer equipment, peripherals, and other office and industrial equipment and supplies; and trading of tools and molds. In addition, it distributes air-conditioner packaged and multi-split units; and trades in telecommunications and networking equipment. Further, the company produces metal containers, such as food cans, confectionery cans, paints cans, etc.; and provides customized metal printing services. It operates in the People's Republic of China, Singapore, Europe, Vietnam, Rest of Asia, North America, and internationally. The company was formerly known as China Auto Corporation Ltd. and changed its name to Acma Ltd. in April 2013. Acma Ltd. was incorporated in 1965 and is based in Singapore.", "currency": "SGD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "BHQ.SI": {"short_name": "Sunningdale Tech", "long_name": "Sunningdale Tech Ltd", "summary": "Sunningdale Tech Ltd manufactures and sells dies, tools, jigs, fixtures, high precision steel molds, and plastic components. The company operates through four segments: Automotive, Healthcare, Consumer/IT, and Mould Fabrication. The Automotive segment produces faceplates for automotive audio systems and climate controls, speedometers/clusters, steering switches, exterior antenna covers, etc. The Healthcare segment produces scoops, caps, and drug delivery and diagnostic devices. The Consumer/IT segment produces IT, consumer, and telecommunication products, including point-of-sale terminals, water filtration products, grooming products, inkjet cartridges, etc. The Mould Fabrication segment designs and manufactures molds that are used in the manufacture of plastic injection parts. The company is also involved in the trading of car audio equipment; manufacture of plastic products in video front panels, office automation products, and sub-assembly of paper feeders for printers and computer components; contract manufacturing of assembled plastic products; and manufacture and sale of precision plastic injection molding products and engineering plastic components, as well as painted and laser etched plastic parts. In addition, it provides technical consulting services. The company offers its products to multi-national companies and original equipment manufacturers in Singapore, Thailand, Indonesia, Malaysia, the People's Republic of China, Hong Kong, the Americas, Europe, and internationally. Sunningdale Tech Ltd was incorporated in 1995 and is headquartered in Singapore.", "currency": "SGD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "BPF.SI": {"short_name": "YHI Intl", "long_name": "YHI International Limited", "summary": "YHI International Limited, an investment holding company, distributes automotive and industrial products in Singapore, Malaysia, China, Hong Kong, Taiwan, Australia, New Zealand, and internationally. It operates through three segments: Manufacturing, Distribution, and Rental. The company distributes automotive products, including tires and alloy wheels; industrial power products comprising automotive and rechargeable batteries for commercial and industrial use, as well as golf and utility buggies; and other industrial power products, such as solar panels, chargers, invertors, and uninterruptible power supply products. It also designs, develops, manufactures, advertises, promotes, distributes, and sells alloy wheels. In addition, the company engages in the rental of investment property; and provision of consultancy, marketing, and technology related services. The company distributes tires under the Yokohama, Nitto, Nankang, Nexen, Pirelli, Achilles, ATG Tires, Mickey Thompson, and Neuton Tyres brand names; alloy wheels under the Enkei, OZ, Konig, Breyton, and Advanti Racing brands; industrial power products under the Hitachi, Trojan, CSB, Crown, Vision, FIAMM, Neuton Power, Benning, Delta Q, and Jinko Solar brand names; and buggies and utility vehicles under the E-Z-GO, Cushman, and Neuton Electric brands. The company was founded in 1948 and is headquartered in Singapore. YHI International Limited is a subsidiary of YHI Holdings Pte Ltd.", "currency": "SGD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "S29.SI": {"short_name": "Stamford Tyres", "long_name": "Stamford Tyres Corporation Limited", "summary": "Stamford Tyres Corporation Limited, an investment holding company, engages in the wholesale and retail of tires and wheels in South East Asia, North Asia, Africa, and internationally. The company offers tires for high performance cars, passenger cars, SUVs, light trucks, and truck radials; and radials for sports and passenger cars, light trucks, trucks, and buses, as well as for military, agriculture, and industrial solid tires. It also provides tires for the construction and mining industry; industrial and construction tires for use in skid steers, backhoes, and forklifts; and nylon bias tires for light truck, truck, agriculture, and earthmover applications. In addition, the company engages in the design and contract manufacturing of tires for proprietary brands, tire retreading, equipment trading, and servicing of motor vehicles; manufacture and sale of aluminum alloy wheels; and property holding activities. Further, it distributes Falken, Dunlop, Continental, and Maxam branded tires, as well as offers its proprietary brands, such as Sumo Firenza, Sumo Tire, and SSW wheels. Additionally, the company operates a retail network in Singapore and Malaysia with Mega Mart and Tyre Mart outlets that offer a range of tires, wheels, batteries, and auto accessories, as well as workshop and tire services. Stamford Tyres Corporation Limited was incorporated in 1989 and is headquartered in Singapore.", "currency": "SGD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}}