{
    "5SR.SI": {
        "short_name": "Zhongmin Baihui",
        "long_name": "Zhongmin Baihui Retail Group Ltd.",
        "summary": "Zhongmin Baihui Retail Group Ltd., an investment holding company, owns, operates, and manages a chain of department stores and supermarkets in the People's Republic of China. As of March 26, 2020, it operated 19 stores under the Zhongmin Baihui brand name comprising 16 self-owned stores and 3 managed stores with a total gross floor area of 219,100 square meters. The company provides its merchandise, lifestyle products, and customer-oriented services to middle income consumers. Zhongmin Baihui Retail Group Ltd. was founded in 1997 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "449269",
        "website": "http://www.zhongminbaihui.com.sg",
        "market_cap": 131380264
    },
    "I15.SI": {
        "short_name": "Isetan",
        "long_name": "Isetan (Singapore) Limited",
        "summary": "Isetan (Singapore) Limited operates department stores and supermarkets in Singapore. The company operates in two segments, Retail and Property. It operates stores under the Isetan Scotts, Isetan Katong, Isetan Tampines, and Isetan Serangoon Central names. The company also operates online stores; owns and leases properties; and trades in general merchandise. The company was formerly known as Isetan Emporium (Singapore) Private Limited and changed its name to Isetan (Singapore) Limited in 1981. Isetan (Singapore) Limited was founded in 1886 and is headquartered in Singapore. Isetan (Singapore) Limited is a subsidiary of Isetan Mitsukoshi Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "169641",
        "website": "http://www.isetan.com.sg",
        "market_cap": 161700000
    },
    "M01.SI": {
        "short_name": "Metro",
        "long_name": "Metro Holdings Limited",
        "summary": "Metro Holdings Limited, together with its subsidiaries, engages in retail, and property development and investment businesses in Singapore, China, Indonesia, the United Kingdom, Australia, and internationally. The company operates through two segments, Property Investment and Development, and Retail. It leases shopping and office spaces, as well as invests in property-related investments; and develops and sells residential and mixed-use properties. The company offers a range of merchandise products, men's and women's fashion products, kids wear, toys, and home and bedding products through a chain of 2 Metro department stores in Singapore. Metro Holdings Limited was founded in 1957 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "238873",
        "website": "http://www.metroholdings.com.sg",
        "market_cap": 650008256
    },
    "O9E.SI": {
        "short_name": "Parkson Retail^",
        "long_name": "Parkson Retail Asia Limited",
        "summary": "Parkson Retail Asia Limited, an investment holding company, operates department stores and apparel outlets primarily in Malaysia, Vietnam, Indonesia, and Myanmar. Its stores offer merchandise, including fashion apparel and household goods. The company is also involved in the operation of bakeries; and merchandising activities. In addition, it operates shopping centers, and food and beverage outlets; and provides fashion products under private label brands, as well as agency apparel lines of various international brands. Further, the company trades in apparel and consumer products; distributes and sells fragrance and beauty care products; and provides management and consulting services on real estate, business, and marketing in relation to department stores. As of June 30, 2020, it operated 61 department stores. The company was founded in 1987 and is based in Singapore. Parkson Retail Asia Limited is a subsidiary of East Crest International Limited.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068898",
        "website": "http://www.parkson.com.sg",
        "market_cap": 8759400
    }
}