{
    "40B.SI": {
        "short_name": "$ HealthBank",
        "long_name": "HealthBank Holdings Limited",
        "summary": "HealthBank Holdings Limited, an investment holding company, provides hospitality facilities management and consultancy services for hotels and resorts in China. The company offers consultancy services for hotel and resorts management, investment, developing, and branding. It is also involved in the property management business. The company was formerly known as SMJ International Holdings Ltd. and changed its name to HealthBank Holdings Limited in April 2019. HealthBank Holdings Limited was incorporated in 2013 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "039190",
        "website": "http://healthbankholdings.com",
        "market_cap": "Small Cap"
    },
    "5DP.SI": {
        "short_name": "Heeton",
        "long_name": "Heeton Holdings Limited",
        "summary": "Heeton Holdings Limited, an investment holding company, engages in the hospitality business in Singapore, Thailand, Australia, Japan, Malaysia, Vietnam, and the United Kingdom. It operates through Hospitality, Property Investment, and Property Development segments. The company engages in the development and sale of private residential properties, as well as provides property management services. It also leases residential, retail, and commercial properties. In addition, the company owns, manages, and franchises hotels and related services; and provides administrative and management services. As of December 31, 2019, it operates 13 hotels. Heeton Holdings Limited was founded in 1976 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "779088",
        "website": "http://www.heeton.com",
        "market_cap": "Small Cap"
    },
    "5HH.SI": {
        "short_name": "$ Sinjia Land",
        "long_name": "Sinjia Land Limited",
        "summary": "Sinjia Land Limited, an investment holding company, operates and manages lodging and boarding houses, and backpackers hostels in Singapore, Thailand, and the United States. It also invests in fund management business. The company was formerly known as HLN Technologies Limited and changed its name to Sinjia Land Limited in April 2013. Sinjia Land Limited was founded in 1979 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "339156",
        "website": "http://www.sinjl.com",
        "market_cap": "Small Cap"
    },
    "5HT.SI": {
        "short_name": "$ Imperium Crown",
        "long_name": "Imperium Crown Limited",
        "summary": "Imperium Crown Limited operates as a property investment, development, and management company in China. The company engages in the development of Wonder Stone Park, a tourist attraction and mixed-use development project with a theme park featuring rides and attractions. It also operates a hotel under the Inzone brand. The company was formerly known as Communication Design International Limited and changed its name to Imperium Crown Limited in June 2015. Imperium Crown Limited was incorporated in 1995 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "149544",
        "website": "http://www.imperium-crown.com",
        "market_cap": "Small Cap"
    },
    "5I1.SI": {
        "short_name": "$ KOP",
        "long_name": "KOP Limited",
        "summary": "KOP Limited, an investment holding company, operates as a real estate development and entertainment company. It operates through Real Estate Development and Investment, Real Estate Origination and Management Services, Hospitality, and Entertainment segments. The company invests in, develops, constructs, manages, and sells real estate properties. It is also involved in the properties acquisition and development conceptualization, construction management, and marketing and branding strategizing activities, as well as retail sale of projects; and development, management, and operation of hotels and resorts, including restaurants and spas. In addition, the company sells goods and tickets; and assigns distribution rights, as well as engages in the sponsorship, theatrical distribution, and concert promotions activities. Further, it is involved in business and management consultancy services; property management and consultancy activities; ownership and lease of real estate properties; investment management and consultancy activities; and operation of cafes and coffee houses. The company has operations in Singapore, Indonesia, and the People's Republic of China. KOP Limited was incorporated in 2004 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "247978",
        "website": "http://www.koplimited.com",
        "market_cap": "Small Cap"
    },
    "6090.HK": {
        "short_name": "CENTURION CORP",
        "long_name": "Centurion Corporation Limited",
        "summary": "Centurion Corporation Limited, an investment holding company, owns, develops, and manages workers and student accommodation assets in Singapore, the United Kingdom, the United States, Malaysia, Australia, and internationally. The company operates through three segments: Workers Accommodation, Student Accommodation, and Others. It manages workers accommodation assets under the Westlite Accommodation brand and student accommodation assets under the dwell brand. As of December 31, 2020, the company owned and managed a portfolio of 35 operational accommodation assets totaling 73,460 beds. It also manufactures and sells optical discs and related data storage products. In addition, the company offers laundry; cleaning and maintenance; management; utilities and transportation; tourist; asset management; fund management; trustee; and business and management consultancy services. The company was founded in 1984 and is headquartered in Singapore. Centurion Corporation Limited is a subsidiary of Centurion Properties Pte Ltd.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "408696",
        "website": "http://www.centurioncorp.com.sg",
        "market_cap": "Small Cap"
    },
    "A34.SI": {
        "short_name": "Amara",
        "long_name": "Amara Holdings Limited",
        "summary": "Amara Holdings Limited, an investment holding company, engages in the hotel investment and management; property investment and development; and specialty restaurants and food services businesses in Singapore, the People's Republic of China, and Thailand. It invests in and develops office, retail, and residential properties. The company is also involved in the share trading and investment activities; and the provision of construction services, as well as in franchising business. In addition, it offers management and technical advisory services for the management and development of hotels and resorts; and general management and administrative services. The company was incorporated in 1970 and is based in Singapore. Amara Holdings Limited is a subsidiary of First Security Pte Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "079027",
        "website": "http://www.amaraholdings.com",
        "market_cap": "Small Cap"
    },
    "AVX.SI": {
        "short_name": "HL Global Ent",
        "long_name": "HL Global Enterprises Limited",
        "summary": "HL Global Enterprises Limited, an investment holding company, operates in the hospitality operations and property development activities in Singapore, Malaysia, and the People's Republic of China. It operates in three segments: Investments and Others, Hospitality and Restaurant, and Property Development. The company operates and manages hotels and restaurants; and develops, sells, and rents properties. It also provides property and development project management, and hotel management and consultancy services. The company was formerly known as HLG Enterprise Limited and changed its name to HL Global Enterprises Limited in April 2008. HL Global Enterprises Limited was incorporated in 1961 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "079903",
        "website": "http://www.hlge.com.sg",
        "market_cap": "Small Cap"
    },
    "B16.SI": {
        "short_name": "GL",
        "long_name": "GL Limited",
        "summary": "GL Limited (formerly known at various times as GuocoLeisure Limited, BIL International Limited and Brierley Investments Limited) was established in New Zealand in 1961. Today, GL Limited is an investment holding company with principal investments in hotel management & operations, oil & gas, property development and other areas in the leisure industry.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "078881",
        "website": "http://www.gl-grp.com",
        "market_cap": "Small Cap"
    },
    "B28.SI": {
        "short_name": "Bonvests",
        "long_name": "Bonvests Holdings Limited",
        "summary": "Bonvests Holdings Limited, an investment holding company, engages in the property development and investment, hotel ownership and management, and waste management and contract cleaning businesses. The company operates through Rental, Hotel, Industrial, Investment, and Others segments. It owns and manages various commercial and residential properties. The company also engages in the operation of the golf course, hotels and restaurants, bars, and thalassotherapy center; and investment, operation, and management of resorts, spas, and food and beverage outlets; and securities trading and investment holding activities. In addition, the company offers business and management, and public relations consultancy services; sales and marketing support; contract cleaning; laundry; and waste management services, such as waste disposal services to commercial, industrial, and residential properties, as well as other waste disposal related services. It operates in Singapore, Tunisia, Mauritius, Zanzibar, Maldives, Indonesia, Morocco, and Australia. Bonvests Holdings Limited was founded in 1982 and is based in Singapore. Bonvests Holdings Limited is a subsidiary of Goldvein Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "238881",
        "website": "http://www.bonvests.com.sg",
        "market_cap": "Small Cap"
    },
    "BDX.SI": {
        "short_name": "GSH",
        "long_name": "GSH Corporation Limited",
        "summary": "GSH Corporation Limited, an investment holding company, engages in the development and sale of properties primarily in Malaysia and China. It operates through Hospitality, Property, and Others segments. The company is also involved in the rental of investment properties. In addition, it owns and operates the Sutera Harbour Resort comprising two five-star hotels, a 104-berth marina, and a 27-hole championship golf course in Kota Kinabalu, Malaysia, as well as the idyllic Sutera@Mantanani Resort, a 30-room resort on the Mantanani Islands in Sabah. Further, the company is involved in the retailing of clothing, souvenirs, and convenience items, as well as provision of upmarket train and facilities management services. Additionally, it engages in the sale of fuel and other related bunkering services; and frozen food trading business. The company was formerly known as JEL Corporation (Holdings) Ltd. and changed its name to GSH Corporation Limited in May 2012. GSH Corporation Limited was incorporated in 2001 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "049705",
        "website": "http://www.gshcorporation.com",
        "market_cap": "Small Cap"
    },
    "BKW.SI": {
        "short_name": "Datapulse Tech",
        "long_name": "Datapulse Technology Limited",
        "summary": "Datapulse Technology Limited, an investment holding company, engages in the hotel and hospitality property investment business in South Korea and Singapore. The company is involved in the acquisition, property development, and trading of real estate, such as hotels and hospitality, commercial, industrial, residential, and mixed development properties; and operation of a hotel. It also provides asset management services, as well as engages in the investment activity of holding long-term and trading in short-term investments. The company was founded in 1980 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068811",
        "website": "http://www.datapulse.com.sg",
        "market_cap": "Small Cap"
    },
    "BTE.SI": {
        "short_name": "Bund Center",
        "long_name": "Bund Center Investment Ltd",
        "summary": "Bund Center Investment Ltd, an investment holding company, owns a hotel; and owns and manages commercial and retail properties in the People's Republic of China. It operates through Hotel and Property Leasing segments. The company owns The Westin Bund Center Shanghai, a five-star hotel in Shanghai. It also owns and manages the Bund Center Office Tower in Shanghai; and the Golden Center, a six-storey retail complex in Ningbo, Zhejiang. In addition, the company is involved in the trading of hotel supplies and related products; property development activities; and provision of consultancy and management services. The company was incorporated in 2009 and is based in Singapore. Bund Center Investment Ltd is a subsidiary of Flambo Bund Centre Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068805",
        "website": "http://www.bundcenter.com",
        "market_cap": "Small Cap"
    },
    "BY91.MU": {
        "short_name": "GL LTD  DL-,20",
        "long_name": "GL Limited",
        "summary": "GL Limited (formerly known at various times as GuocoLeisure Limited, BIL International Limited and Brierley Investments Limited) was established in New Zealand in 1961. Today, GL Limited is an investment holding company with principal investments in hotel management & operations, oil & gas, property development and other areas in the leisure industry.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "078881",
        "website": "http://www.gl-grp.com",
        "market_cap": "Small Cap"
    },
    "BY92.F": {
        "short_name": "GL LTD  UNSP.ADR/10 O.N.",
        "long_name": "GL Limited",
        "summary": "GL Limited (formerly known at various times as GuocoLeisure Limited, BIL International Limited and Brierley Investments Limited) was established in New Zealand in 1961. Today, GL Limited is an investment holding company with principal investments in hotel management & operations, oil & gas, property development and other areas in the leisure industry.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "078881",
        "website": "http://www.gl-grp.com",
        "market_cap": "Small Cap"
    },
    "CHJ.SI": {
        "short_name": "Uni-Asia Grp",
        "long_name": "Uni-Asia Group Limited",
        "summary": "Uni-Asia Group Limited, together with its subsidiaries, operates as an alternative investment company. It operates hotels under the Hotel Vista and Hotel Vista Premio brands. The company also owns and charters ships, as well as offers ship investment and asset management services. In addition, it provides ship commercial and technical management services; and shipping related brokerage services, as well as involved in finance arrangement business. Further, the company provides property management and investment, project management, accounting, and administration, as well as investment advisory; and property leasing and construction management services. The company has operations in Japan, Asia, and internationally. Uni-Asia Group Limited was founded in 1997 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068811",
        "website": "http://www.uni-asia.com",
        "market_cap": "Small Cap"
    },
    "DTPA.MU": {
        "short_name": "DATAPULSE TECHNOLOGY NEW",
        "long_name": "Datapulse Technology Limited",
        "summary": "Datapulse Technology Limited, an investment holding company, engages in the hotel and hospitality property investment business in South Korea and Singapore. The company is involved in the acquisition, property development, and trading of real estate, such as hotels and hospitality, commercial, industrial, residential, and mixed development properties; and operation of a hotel. It also provides asset management services, as well as engages in the investment activity of holding long-term and trading in short-term investments. The company was founded in 1980 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068811",
        "website": "http://www.datapulse.com.sg",
        "market_cap": "Small Cap"
    },
    "GD1M.F": {
        "short_name": "ICP LTD -LOCAL-",
        "long_name": "ICP Ltd.",
        "summary": "ICP Ltd., an investment holding company, engages in the hospitality, and vessel ownership and chartering activities in Singapore, Malaysia, Korea, Hong Kong, and internationally. It is also involved in the ownership of hotels, as well as management and franchising of the Travelodge hotel brand. In addition, the company provides management consultancy services; owns trademark rights; offers leasing services; and invests in quoted and/or unquoted securities, including debentures, stocks, shares, and units in any fund or collective investment scheme. Further, it owns and charters two steel petroleum product tankers. The company was formerly known as Goldtron Limited and changed its name to ICP Ltd. in 2012. ICP Ltd. was incorporated in 1962 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "079903",
        "website": "http://www.icp.com.sg",
        "market_cap": "Small Cap"
    },
    "GUORY": {
        "short_name": "GL LIMITED",
        "long_name": "GL Limited",
        "summary": "GL Limited (formerly known at various times as GuocoLeisure Limited, BIL International Limited and Brierley Investments Limited) was established in New Zealand in 1961. Today, GL Limited is an investment holding company with principal investments in hotel management & operations, oil & gas, property development and other areas in the leisure industry.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "078881",
        "website": "http://www.gl-grp.com",
        "market_cap": "Small Cap"
    },
    "H07.SI": {
        "short_name": "Stamford Land",
        "long_name": "Stamford Land Corporation Ltd",
        "summary": "Stamford Land Corporation Ltd, an investment holding company, owns, operates, and manages luxury hotels in Singapore, Australia, the United Kingdom, and New Zealand. The company operates through five segments: Hotel Owning and Management, Property Development, Property Investment, Trading, and Others. It owns and operates hotels and resorts under the Sir Stamford Circular Quay, Stamford Plaza Sydney Airport, Stamford Grand Adelaide, Stamford Plaza Adelaide, Stamford Plaza Melbourne, Stamford Plaza Brisbane, and Stamford Plaza Auckland names. The company also invests in, develops, constructs, trades in, rents, and manages real estate properties. In addition, it trades in interior  decoration products; and offers trustee, travel agency, and management services. Further, the company invests in securities; and provides treasury functions. The company was formerly known as Hai Sun Hup Group Ltd. Stamford Land Corporation Ltd was founded in 1935 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "089763",
        "website": "http://www.stamfordland.com",
        "market_cap": "Small Cap"
    },
    "H12.SI": {
        "short_name": "Hotel Royal",
        "long_name": "Hotel Royal Limited",
        "summary": "Hotel Royal Limited, an investment holding company, operates in the hotelier business. The company operates through Hotel Operations, Property Investments, and Financial Investments segments. It owns, operates, and manages 7 hotels in Singapore, Malaysia, and Thailand. The company is also involved in owning and letting out residential buildings, office units, factory units, shopping centers, and car park lots in Singapore, Malaysia, and New Zealand. In addition, it invests in portfolio of shares, bonds, and funds. The company was incorporated in 1968 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "307964",
        "website": "http://www.hotelroyal.com.sg",
        "market_cap": "Small Cap"
    },
    "H15.SI": {
        "short_name": "HPL",
        "long_name": "Hotel Properties Limited",
        "summary": "Hotel Properties Limited, an investment holding company, owns, manages, and operates hotels in Singapore and internationally. It operates through Hotels, Properties, and Others segments. The company owns and operates 36 hotels under the Four Seasons, Hilton International, Como Hotels, InterContinental Hotels Group, Six Senses Hotels, Marriott International, Hard Rock Hotels, and Concorde Hotels & Resorts brands, as well as resorts and shopping galleries primarily in Singapore, Malaysia, Thailand, Maldives, Indonesia, Seychelles, the United Kingdom and Europe, Vanuatu, Bhutan, Tanzania, South Africa, Vietnam, Italy, and Sri Lanka. It also engages in the rental and sale of residential properties and commercial units; property development and project management activities; trading of quoted investments and share dealing; card service operations; casino operations; and provision of administrative and information services. The company was incorporated in 1980 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "249724",
        "website": "http://www.hotelprop.com.sg",
        "market_cap": "Small Cap"
    },
    "H18.SI": {
        "short_name": "Hotel Grand",
        "long_name": "Hotel Grand Central Limited",
        "summary": "Hotel Grand Central Limited, together with its subsidiaries, owns, operates, and manages hotels in Singapore, Malaysia, Australia, New Zealand, and China. It also provides marketing and support, and management services; and invests in commercial properties. The company was founded in 1968 and is based in Singapore. Hotel Grand Central Limited is a subsidiary of Tan Chee Hoe & Sons Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "229617",
        "website": "http://www.grandcentral.com.sg",
        "market_cap": "Small Cap"
    },
    "L38.SI": {
        "short_name": "AF Global",
        "long_name": "AF Global Limited",
        "summary": "AF Global Limited, an investment holding company, owns and operates hotels and serviced residences. It operates through Property, Hotel and Serviced Residence, and Leisure and Others segments. The company operates Holiday Inn Resort Phuket, a hotel with 398 rooms; and serviced residences, which consists of studio units, apartments, and office units. It also provides project and property management services; and real estate consultancy services, as well as develops, sells, and invests in properties. In addition, the company owns and operates family entertainment centers. It has operations in Singapore, the People's Republic of China, Thailand, Vietnam, the Lao People's Democratic Republic, and the United Kingdom. The company was formerly known as LCD Global Investments Ltd. and changed its name to AF Global Limited in April 2016. The company was founded in 1973 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "408864",
        "website": "http://www.afgl.com.sg",
        "market_cap": "Small Cap"
    },
    "OU8.SI": {
        "short_name": "Centurion",
        "long_name": "Centurion Corporation Limited",
        "summary": "Centurion Corporation Limited, an investment holding company, owns, develops, and manages workers and student accommodation assets in Singapore, the United Kingdom, the United States, Malaysia, Australia, and internationally. The company operates through three segments: Workers Accommodation, Student Accommodation, and Others. It manages workers accommodation assets under the Westlite Accommodation brand and student accommodation assets under the dwell brand. As of December 31, 2020, the company owned and managed a portfolio of 35 operational accommodation assets totaling 73,460 beds. It also manufactures and sells optical discs and related data storage products. In addition, the company offers laundry; cleaning and maintenance; management; utilities and transportation; tourist; asset management; fund management; trustee; and business and management consultancy services. The company was founded in 1984 and is headquartered in Singapore. Centurion Corporation Limited is a subsidiary of Centurion Properties Pte Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "408696",
        "website": "http://www.centurioncorp.com.sg",
        "market_cap": "Small Cap"
    },
    "SST.F": {
        "short_name": "HEETON HLDGS LTD  SD-,20",
        "long_name": "Heeton Holdings Limited",
        "summary": "Heeton Holdings Limited, an investment holding company, engages in the hospitality business in Singapore, Thailand, Australia, Japan, Malaysia, Vietnam, and the United Kingdom. It operates through Hospitality, Property Investment, and Property Development segments. The company engages in the development and sale of private residential properties, as well as provides property management services. It also leases residential, retail, and commercial properties. In addition, the company owns, manages, and franchises hotels and related services; and provides administrative and management services. As of December 31, 2019, it operates 13 hotels. Heeton Holdings Limited was founded in 1976 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "779088",
        "website": "http://www.heeton.com",
        "market_cap": "Small Cap"
    }
}