{
    "5MX.SG": {
        "short_name": "Maxi-Cash Financial Svcs Corp.R",
        "long_name": "Maxi-Cash Financial Services Corporation Ltd.",
        "summary": "Maxi-Cash Financial Services Corporation Ltd., an investment holding company, engages in the retail and trading of jewelry and branded merchandise in Singapore, Australia, Ireland, and Malaysia. It operates through three segments: Pawnbroking, Money Lending, and Retail and Trading of Jewellery and Branded Merchandise. The company offers pre-owned jewelry under the LuxeSTYLE brand name, watches, and branded bags. It also provides financial services in the form of pawnbroking through a network of 47 outlets located in shopping malls, heartland neighborhoods, and MRT stations; and money lending services to corporations. In addition, the company rents properties; and offers other support services. Further, it provides auction and e-services. The company was incorporated in 2008 and is based in Singapore. Maxi-Cash Financial Services Corporation Ltd. is a subsidiary of Aspial Corporation Limited.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5UF.SI": {
        "short_name": "$ Maxi-Cash Fin",
        "long_name": "Maxi-Cash Financial Services Corporation Ltd.",
        "summary": "Maxi-Cash Financial Services Corporation Ltd., an investment holding company, engages in the retail and trading of jewelry and branded merchandise in Singapore, Australia, Ireland, and Malaysia. It operates through three segments: Pawnbroking, Money Lending, and Retail and Trading of Jewellery and Branded Merchandise. The company offers pre-owned jewelry under the LuxeSTYLE brand name, watches, and branded bags. It also provides financial services in the form of pawnbroking through a network of 47 outlets located in shopping malls, heartland neighborhoods, and MRT stations; and money lending services to corporations. In addition, the company rents properties; and offers other support services. Further, it provides auction and e-services. The company was incorporated in 2008 and is based in Singapore. Maxi-Cash Financial Services Corporation Ltd. is a subsidiary of Aspial Corporation Limited.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "AGS.SI": {
        "short_name": "TheHourGlass",
        "long_name": "The Hour Glass Limited",
        "summary": "The Hour Glass Limited, an investment holding company, retails and distributes watches, jewelry, and other luxury products in South East Asia, Australia, and North East Asia. It also invests in properties. The company operates 45 boutiques. The Hour Glass Limited was founded in 1979 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "C41.SI": {
        "short_name": "Cortina",
        "long_name": "Cortina Holdings Limited",
        "summary": "Cortina Holdings Limited, an investment holding company, retails and distributes timepieces and accessories in Singapore, Malaysia, Thailand, Indonesia, Hong Kong, Taiwan, and Russia. The company operates through Wholesale, Retail, and Others segments. The Wholesale segment engages in the wholesale of timepieces and luxury branded accessories. The Retail segment is involved in the retail of timepieces, branded pens, and accessories. The Others segment provides other support services. The company was founded in 1972 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "RDR.SI": {
        "short_name": "$ Incredible",
        "long_name": "Incredible Holdings Ltd.",
        "summary": "Incredible Holdings Ltd., an investment holding company, distributes specialty chemical products and consumable materials for the electronic industry in the Asia Pacific and the People's Republic of China. It also designs, assembles, supplies, and installs electrical switch boxes; distributes equipment; and retails and trades in new and used luxury goods. In addition, the company provides loan financing services. The company was formerly known as Vashion Group Ltd. and changed its name to Incredible Holdings Ltd. in November 2019. Incredible Holdings Ltd. was incorporated in 1999 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}