{"DM0.SI": {"short_name": "Hanwell", "long_name": "Hanwell Holdings Limited", "summary": "Hanwell Holdings Limited, together with its subsidiaries, supplies provisions and household consumer products in Singapore, Malaysia, China, and Japan. The company operates through two segments, Consumer Essentials Consumer Business and Strategic Investments Packaging. It engages in the marketing and sale of agency lines and proprietary brands; packaging and sale of paper products; and marketing and sale of consumer products in ambient and chilled categories, including rice, oil, and detergents. The company also manufactures and sells grass jelly products, soya bean products, noodles, and bakery products; and corrugated paper boards, corrugated paper cartons, die-cut boxes, assembly cartons, and heavy duty corrugated paper products, as well as consumer and commercial tissue paper products under the Beautex, Mood, Hibis, Comfy, and Parity brand names. In addition, it markets and distributes confectionery, snacks, grocery, and beverage, and bakery products; washroom hygiene products, such as cleaning agents and dispensers, and baby and adult diapers under brand names of PetPet, Fitti, and Certainty; and distributes automobile cleaning products under the brand name of MR.CLEAN, as well as distributes coconut milk under the Harmuni brand. Further, the company is involved in the property holding, investment, and development activities, as well as in property related activities. It serves food and beverage, electronics and electrical, plastic and metal stamping, pharmaceutical, chemical, printing, publishers, and converting industries, as well as offers its products to retail and food service outlets, such as supermarket, hypermarkets, convenience stores, and pharmacies. The company also exports its products. The company was formerly known as PSC Corporation Ltd and changed its name to Hanwell Holdings Limited in April 2012. Hanwell Holdings Limited was founded in 1974 and is based in Singapore.", "currency": "SGD", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}}