{
    "HONV.PA": {
        "short_name": "THALES NV21",
        "long_name": "Thales S.A.",
        "summary": "Thales S.A. provides various solutions for civilian and military customers in the aeronautics, space, defense, security, and ground transportation markets worldwide. It operates through Aerospace, Transport, Defence & Security, and Digital Identity & Security segments. The company offers communications, command, and control systems; mission services and support; protection and mission/combat systems; surveillance, detection, and intelligence systems; training and simulation solutions for air, land, naval, and joint forces; and digital identity and security solutions. It also provides air traffic management solutions; flight decks and avionics equipment and functions; in-flight entertainment and connectivity systems and services; electrical systems; aerospace training solutions; navigation solutions; support and services for avionics equipment; and vision systems. In addition, the company designs, operates, and delivers satellite-based systems for telecommunications, navigation, earth observation, environmental management, exploration, and science and orbital infrastructures; signaling, communications and supervision, and fare collection management systems and related services; cybersecurity and railway digitalization systems; and main line rail, and urban and intermodal mobility solutions. Further, it provides solutions for various markets and applications, including radiology, radio frequency, microwave sources, training and simulation solutions, lasers, and microelectronics solutions for science, industry, space, defense, automotive, railways, and energy conversion platforms. The company was formerly known as Thomson-CSF and changed its name to Thales S.A. in 2000. Thales S.A. was founded in 1893 and is based in Courbevoie, France.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Aerospace Defense - Major Diversified",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "Courbevoie",
        "zipcode": "92400",
        "website": "http://www.thalesgroup.com/en",
        "market_cap": null
    }
}