{
    "1724.T": {
        "short_name": "SYNCLAYER INC",
        "long_name": "Synclayer Inc.",
        "summary": "Synclayer Inc. provides system integration services for CATV network in Japan. Its services include system design, engineering, equipment procurement, network management, etc. The company also offers turnkey project construction for cable plant from headend to customer premise; and cable TV Internet solutions, including sales and support for CMTS and cable modems. In addition, it provides cable-networking for convention hall, office, MDU, and campus LAN applications. Further, the company offers ultra-high-speed data transfer and voice over Internet protocol services, as well as digital video transmission capacity for approximately 300 channels. Additionally, it provides fiber-to-the-home solution that offers gigabit data transfer, full streaming video, and RF multichannel video broadcasting; and fiber-to-the-office solutions. The company was formerly known as Aichi Electronics Co., Ltd. and changed its name to Synclayer Inc. in July 2002. Synclayer Inc. was founded in 1962 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "460-0012",
        "website": "http://www.synclayer.com",
        "market_cap": "Mid Cap"
    },
    "1992.T": {
        "short_name": "KANDA TSUSHINKI CO",
        "long_name": "Kanda Tsushinki Co., Ltd.",
        "summary": "Kanda Tsushinki Co.,Ltd. provides construction contract services in Japan. It is also involved in the information and communication systems development, software development, control lighting, communication system development, and computer network system development businesses. In addition, the company manufactures, maintains, and sells computer, OA, and communication equipment and supplies. Further, it engages in facility service and contact center businesses. The company was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0043",
        "website": "http://www.kandt.co.jp",
        "market_cap": "Mid Cap"
    },
    "2763.T": {
        "short_name": "FTGROUP CO LTD",
        "long_name": "FTGroup Co., Ltd.",
        "summary": "FTGroup Co., Ltd. supplies communication devices to small and medium-sized enterprises in Japan and internationally. The company offers business phones, office automation equipment, air conditioning equipment, corporate mobiles, water faucet equipment, marking supplies or printer consumables, LED lights, and photo voltaic systems, as well as optical fiber line, Internet, ISP, and broadband services. It is also involved in the installation, maintenance, and support of communications equipment; and management activities; investment and incubation of venture business; and Web gift and marketing business, as well as remodeling sales and construction activities. In addition, the company engages in the sale of solar and electric power, batteries, EV chargers, and HEMS; OEM/ODM and development business; and network security equipment business. Further, it is involved in mortgage refinance, sales, brokerage, and management of real estate; and insurance business, as well as purchase of used cars, auto leasing, and provision of loans. Additionally, the company operates call centers; and mobile shops, as well as offers multi-payment solutions. FTGroup Co., Ltd. was founded in 1985 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0014",
        "website": "http://www.ftgroup.co.jp",
        "market_cap": "Large Cap"
    },
    "4441.T": {
        "short_name": "TOBILA SYSTEM INC",
        "long_name": "Tobila Systems Inc.",
        "summary": "Tobila Systems Inc. develops and provides fraud filtering systems in Japan. The company offers prank call filter services for mobile and business phones, as well as nuisance call filter services for landlines. It also provides other services, which include netcomfy, a content blocker application for iPhone; phone number.com, an online phonebook; and HP4U, a homepage production service that include coverage, photography, and production. The company was founded in 2004 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "460-0003",
        "website": "http://www.tobila.jp",
        "market_cap": "Large Cap"
    },
    "5817.T": {
        "short_name": "JMACS JAPAN CO LTD",
        "long_name": "JMACS Japan Co., Ltd.",
        "summary": "JMACS Japan Co., Ltd. manufactures and sells instrumentation cables, control cables, communication cables, disaster prevention cables, optical fiber cables, performance cables, and processed harness products in Japan. It also offers smart system solutions, smart security systems, display systems for FA lines, software and hardware systems, industrial products, and lighting products. The company was formerly known as Nihon Electric Wire & Cable Co., Ltd. and changed its name to JMACS Japan Co., Ltd. in September 2015. The company was founded in 1965 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "553-0003",
        "website": "http://www.jmacs-j.co.jp",
        "market_cap": "Mid Cap"
    },
    "6634.T": {
        "short_name": "NCXX GROUP INC",
        "long_name": "NCXX Group Inc.",
        "summary": "NCXX Group Inc. engages in the development, sale, maintenance, and other services of communication equipment centered on mobile Internet devices and M2M modules. It also provides IoT solutions; Internet travel services; and nursing care services, as well as develops and sells nursing care robots and nursing care ICT systems. In addition, the company is involved in planning, developing, and selling agricultural ICT, as well as plans, manufactures, and sells original ethnic clothing and miscellaneous goods; and provides consulting, design, construction, system development operation and maintenance, network, database, and other infrastructure construction services in manufacturing, finance, distribution, and social public industries. NCXX Group Inc. was founded in 1984 and is headquartered in Hanamaki, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Hanamaki",
        "zipcode": "025-0323",
        "website": "http://www.ncxxgroup.co.jp",
        "market_cap": "Mid Cap"
    },
    "6675.T": {
        "short_name": "SAXA HOLDINGS INC",
        "long_name": "SAXA Holdings, Inc.",
        "summary": "SAXA Holdings, Inc., through its subsidiaries, engages in the development, manufacture, and sale of information communication system equipment and components in Japan. The company was founded in 2004 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-8050",
        "website": "http://www.saxa.co.jp",
        "market_cap": "Mid Cap"
    },
    "6703.T": {
        "short_name": "OKI ELECTRIC INDUSTRY CO",
        "long_name": "Oki Electric Industry Co., Ltd.",
        "summary": "Oki Electric Industry Co., Ltd. manufactures and sells products, technologies, software, and solutions for telecommunication and information systems in Japan and internationally. It operates through Solution Systems Business and Components & Platforms Business segments. The company offers transportation infrastructure systems, disaster prevention related systems, defense related systems, communication equipment for telecommunication carriers, financial branch office systems, administrative centralized systems, reservation ticketing systems, IP-PBX, business phones, contact centers, 920 MHz multi-hop wireless systems, etc. It also provides mechatronics systems, including automated teller machines (ATMs), cash handling machines, bank branch terminals, reservation ticket issuing terminals, check-in terminals, foreign currency exchange machines, ATM monitoring and operations services, etc.; and printers, such as color/monochrome LED printers, color/monochrome LED multifunction printers, large format inkjet printers, dot impact printers, etc. In addition, the company offers EMS services, such as consigned design and manufacturing services, printed wiring boards, etc. Oki Electric Industry Co., Ltd. was founded in 1881 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8460",
        "website": "http://www.oki.com",
        "market_cap": "Large Cap"
    },
    "6704.T": {
        "short_name": "IWATSU ELECTRIC CO",
        "long_name": "Iwatsu Electric Co., Ltd.",
        "summary": "Iwatsu Electric Co., Ltd. manufactures and sells business communication, printing systems, and test and measurement equipment in Japan and internationally. It offers industrial digital label printing systems and digital platesetters; and test and measurement equipment, including semiconductor curve tracers, B-H analyzers, isolation systems and probes, oscilloscopes, delay pattern generators, digital multimeters, signal generators, and universal counters, as well as coil current probes. Iwatsu Electric Co., Ltd. was founded in 1938 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "168-8501",
        "website": "http://www.iwatsu.co.jp",
        "market_cap": "Mid Cap"
    },
    "6706.T": {
        "short_name": "DKK CO LTD",
        "long_name": "Denki Kogyo Co.,Ltd.",
        "summary": "DKK Co., Ltd. manufactures and sells telecommunication and radio frequency equipment in Japan and internationally. The company's Telecommunication division offers mobile communication infrastructure systems, including cellular base station and smaller size antennas, products for mobile WiMAX, peripheral devices, and mobile communications towers, as well as provides cellular base station construction and maintenance services; and broadcasting products, such as broadcasting and microwave antennas, medium and short wave antennas, gap fillers, towers, shelters, power supply apparatus, and FPU rotators, as well as provides broadcasting construction and maintenance services. This division also offers data communications products comprising regional WiMAX products, microwave network antennas, and satellite telecommunication products; and energy products consisting of wind towers, mounting structures for solar power panels, and mounting structures for secondary batteries. Its Radio Frequency division provides induction heating equipment, including hardening and tempering equipment, and high frequency generators; RF applied equipment, such as high power RF amplifier systems, and RF power generators for plasma excitation and induction heating; vacuum furnaces; and IH heat-treatment processing products. DKK Co., Ltd. was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.denkikogyo.co.jp",
        "market_cap": "Large Cap"
    },
    "6715.T": {
        "short_name": "NAKAYO INC",
        "long_name": "Nakayo, Inc.",
        "summary": "Nakayo, Inc. manufactures and sells telecommunications equipment in Japan and internationally. The company offers key telephone systems, telephone sets, telephone parts, switching equipment, and data equipment, as well as devices related to environmental, and energy equipment and related products. The company operates through Business Solutions, Consumer Solutions, Network Solutions, and Service & Support divisions. The Business Solutions division offers digital button telephones, IP terminal devices, cordless phones, DSL modems, components, etc. The Consumer Solutions division provides ISDN terminal adapters, alarm devices, PHS modules, cordless phones, and fax machines. The Network Solutions division offers switching systems, PBXs, and transfer equipment. The Service & Support division offers EMS and software development services; and metal dies for presses/molds, etc. The company was formerly known as Nakayo Telecommunications, Inc. and changed its name to Nakayo, Inc. in August 2014. Nakayo, Inc. was founded in 1944 and is based in Maebashi, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Maebashi",
        "zipcode": "371-0853",
        "website": "http://www.nyc.co.jp",
        "market_cap": "Mid Cap"
    },
    "6718.T": {
        "short_name": "AIPHONE CO LTD",
        "long_name": "Aiphone Co.,Ltd.",
        "summary": "Aiphone Co.,Ltd. manufactures and sells communication and security devices under the AIPHONE brand name for housing, hospitals, nursing facilities, office buildings, and other uses worldwide. It offers general intercom devices for home and business use; security door intercoms and electronic locking systems; video door intercoms; health care intercom devices, such as nurse call and home care systems; and information transmission devices comprising living information display panels. The company was incorporated in 1947 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "460-0004",
        "website": "http://www.aiphone.net",
        "market_cap": "Large Cap"
    },
    "6771.T": {
        "short_name": "IKEGAMI TSUSHINKI CO",
        "long_name": "Ikegami Tsushinki Co., Ltd.",
        "summary": "Ikegami Tsushinki Co., Ltd. provides broadcast equipment in Japan and internationally. It offers broadcast cameras and monitors; digital FPU microwave products, such as microwave links, millimeter-wave wireless links, and, multichannel fiber transmission products; switchers and routers; medical grade cameras, monitors, and recorders; security cameras, monitors, and DVR; and tablet inspection/printing equipment, powder inspection equipment, plane inspection equipment, and inspection equipment peripherals. The company was formerly known as Ikegami Tsushinki Seisakusho and changed its name to Ikegami Tsushinki Co., Ltd. in 1951. Ikegami Tsushinki Co., Ltd. was founded in 1946 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "146-8567",
        "website": "http://www.ikegami.co.jp",
        "market_cap": "Mid Cap"
    },
    "6778.T": {
        "short_name": "ARTIZA NETWORKS",
        "long_name": "Artiza Networks, Inc.",
        "summary": "Artiza Networks, Inc. provides radio access network and core network node testing products to mobile network operators, network equipment manufacturers, system integrators, and other types of companies in the telecommunications industry. The company offers LTE eNodeB testing products, including Duo SIM-advanced load testers, functional testers, and environmental simulators, as well as DuoSIM-5G and DuoSIM testers; QoE optimization and packet capture tools; and compact Ethernet service testing devices for carrier/metro Ethernet service providers. It also provides functional testing, performance testing, product demonstration, and 5G solutions; and QoE optimization, centralized RAN, carrier aggregation, Internet of Things, and quality assurance solutions. The company was formerly known as Able Communication Inc. and changed its name to Artiza Networks, Inc. in 2001. Artiza Networks, Inc. was founded in 1990 and is headquartered in Tachikawa, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tachikawa",
        "zipcode": "190-0012",
        "website": "http://www.artizanetworks.com",
        "market_cap": "Large Cap"
    },
    "6815.T": {
        "short_name": "UNIDEN HOLDINGS CORPORATION",
        "long_name": "Uniden Holdings Corporation",
        "summary": "Uniden Holdings Corporation develops, manufactures, and sells telecommunications equipment in Japan, the United States, Europe, Australia, and internationally. It offers cordless telephones for home and office users; CB radios, marine electronics, 2-way radios, and scanners; and digital consumer products, including HD TVs and digital terrestrial tuners. The company was formerly known as Uniden Corporation and changed its name to Uniden Holdings Corporation in July 2015. Uniden Holdings Corporation was incorporated in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8512",
        "website": "http://www.uniden.co.jp",
        "market_cap": "Large Cap"
    },
    "6820.T": {
        "short_name": "ICOM INCORPORATED",
        "long_name": "Icom Incorporated",
        "summary": "Icom Incorporated, together with its subsidiaries, manufactures and sells telecommunications equipment primarily in Japan, the United States, Canada, Germany, Spain, Australia, Taiwan, and China. The company offers land mobile products, such as digital, conventional and trunked, digital/analog, handheld, mobile, VHF and UHF, VHF and UHF FM, FM, dPMR 446/PMR 446, LTE, wireless LAN, VHF and UHF data, and HF transceivers; repeaters; external controllers; radio over IP gateways, routers, and remote communicator software; and active noise canceling and remote control microphones, automatic tuning antennas, and OTAP and system manager software products. It also provides marine products, including VHF, MF/HF, and HF marine, as well as VHF and HF transceivers; survival craft 2-way radios; radio telephones; remote-control microphones; MarineCommander, a marine navigation system, which integrates various marine modules, such as a fish finder, marine radar, and AIS and VHF transceiver into the multi-function displays; marine radars; and transponders. In addition, the company offers aviation products comprising handheld and mobile air band transceivers; and amateur products consisting of digital, dual band FM, FM, dual band digital, dual band, HF, HF all band, HF/VHF/UHF, and HF/VHF/UHF all mode transceivers, as well as IP remote control software, USB remote encoders, applications, active noise canceling microphones, and external speakers. Further, it provides receiver products, including handheld communications receivers, remote control software, and applications. Icom Incorporated was founded in 1954 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "547-0003",
        "website": "http://www.icom.co.jp",
        "market_cap": "Large Cap"
    },
    "6835.T": {
        "short_name": "ALLIED TELESIS HOLDINGS KK",
        "long_name": "Allied Telesis Holdings K.K.",
        "summary": "Allied Telesis Holdings K.K., a holding company, engages in the planning, development, manufacture, and sale of network devices and solutions worldwide. The company manufactures network products, including hardware and software; and solutions that will expand the possibilities of network infrastructure, such as systems where network infrastructure blocks unauthorized access in collaboration with security software and asset management software, as well as systems where monitoring cameras monitor and detect physical hazards that include acts of terrorism. It also provides support services, which comprise planning and consulting, installation and structuring, operation and monitoring, and education services. The company was incorporated in 1971 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0031",
        "website": "http://www.allied-telesis.co.jp",
        "market_cap": "Large Cap"
    },
    "6904.T": {
        "short_name": "HARADA INDUSTRY CO",
        "long_name": "Harada Industry Co., Ltd.",
        "summary": "Harada Industry Co., Ltd. plans, designs, develops, manufactures, and sells various automotive antennas for radio broadcasting, GPS, phone, DSRC, ETC, TV, and others. It offers fin, rod, screen, film, and integrated type antennas, as well as other antennas. The company also provides cables, such as copper clad aluminum, coaxial, and shielded twisted pair cables, as well as connectors. In addition, Harada Industry Co., Ltd. offers amplifiers and noise filters. It provides products in Japan, Asia, North and Central America, and Europe. The company was formerly known as Harada Electric Manufacturing Co., Ltd. and changed its name to Harada Industry Co., Ltd. in March 1958. Harada Industry Co., Ltd. was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "140-0013",
        "website": "http://www.harada.com",
        "market_cap": "Large Cap"
    },
    "6930.T": {
        "short_name": "NIPPON ANTENNA CO",
        "long_name": "Nippon Antenna Co.,Ltd.",
        "summary": "Nippon Antenna Co.,Ltd. manufactures and sells television reception, telecommunications, security, and information network equipment in Japan and internationally. The company offers antennas and receivers for terrestrial digital broadcasting; CATV equipment; satellite receiving systems; satellite communications receivers and various electronic equipment for TV reception; TV, communications, and marine antennas; filter/duplexers; and portable phone/PHS antennas. It also offers Bluetooth speakers and handsets, neck speakers, AC adapter, mobile batteries, MHL cables and adapters, holders for tablet, and NFC tags; and telecommunications engineering services, as well as undertakes construction of systems. Nippon Antenna Co.,Ltd. was founded in 1953 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "116-8561",
        "website": "http://www.nippon-antenna.co.jp",
        "market_cap": "Mid Cap"
    },
    "7673.T": {
        "short_name": "DAIKO TSUSAN CO LTD",
        "long_name": "Daiko Tsusan Co.,Ltd.",
        "summary": "Daiko Tsusan Co.,Ltd. engages in CATV and information/telecommunications trading and consulting activities. The company is involved in trading of items required for the construction of networks, equipment maintenance, and system sophistication; and provision of consulting services for the design of system arrangement and selection of equipment/materials. Daiko Tsusan Co.,Ltd. was incorporated in 1975 and is headquartered in Matsuyama, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Matsuyama",
        "zipcode": "791-8012",
        "website": "http://www.daiko-tsusan.co.jp",
        "market_cap": "Mid Cap"
    },
    "9422.T": {
        "short_name": "CONEXIO CORPORATION",
        "long_name": "Conexio Corporation",
        "summary": "Conexio Corporation engages in the retail/wholesale of mobile phones in Japan. It also sells prepaid cards and Internet of Things solutions, as well as mobile phones and tablets with various cloud services; and provides after-sale and solution services. Conexio Corporation sells its products through carrier certified shops. The company was formerly known as ITC Networks Corporation and changed its name to Conexio Corporation in October 2013. The company was founded in 1997 and is headquartered in Tokyo, Japan. Conexio Corporation is a subsidiary of ITOCHU Corporation.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-6137",
        "website": "http://www.conexio.co.jp",
        "market_cap": "Large Cap"
    },
    "AYN.SG": {
        "short_name": "AIPHONE CO. LTD. Registered Sha",
        "long_name": "Aiphone Co.,Ltd.",
        "summary": "Aiphone Co.,Ltd. manufactures and sells communication and security devices under the AIPHONE brand name for housing, hospitals, nursing facilities, office buildings, and other uses worldwide. It offers general intercom devices for home and business use; security door intercoms and electronic locking systems; video door intercoms; health care intercom devices, such as nurse call and home care systems; and information transmission devices comprising living information display panels. The company was incorporated in 1947 and is headquartered in Nagoya, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "460-0004",
        "website": "http://www.aiphone.net",
        "market_cap": "Small Cap"
    },
    "OKI.F": {
        "short_name": "OKI EL. IND.",
        "long_name": "Oki Electric Industry Co., Ltd.",
        "summary": "Oki Electric Industry Co., Ltd. manufactures and sells products, technologies, software, and solutions for telecommunication and information systems in Japan and internationally. It operates through Solution Systems Business and Components & Platforms Business segments. The company offers transportation infrastructure systems, disaster prevention related systems, defense related systems, communication equipment for telecommunication carriers, financial branch office systems, administrative centralized systems, reservation ticketing systems, IP-PBX, business phones, contact centers, 920 MHz multi-hop wireless systems, etc. It also provides mechatronics systems, including automated teller machines (ATMs), cash handling machines, bank branch terminals, reservation ticket issuing terminals, check-in terminals, foreign currency exchange machines, ATM monitoring and operations services, etc.; and printers, such as color/monochrome LED printers, color/monochrome LED multifunction printers, large format inkjet printers, dot impact printers, etc. In addition, the company offers EMS services, such as consigned design and manufacturing services, printed wiring boards, etc. Oki Electric Industry Co., Ltd. was founded in 1881 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8460",
        "website": "http://www.oki.com",
        "market_cap": "Small Cap"
    },
    "UMZ.F": {
        "short_name": "UNIDEN HOLDINGS CORP.",
        "long_name": "Uniden Holdings Corporation",
        "summary": "Uniden Holdings Corporation develops, manufactures, and sells telecommunications equipment in Japan, the United States, Europe, Australia, and internationally. It offers cordless telephones for home and office users; CB radios, marine electronics, 2-way radios, and scanners; and digital consumer products, including HD TVs and digital terrestrial tuners. The company was formerly known as Uniden Corporation and changed its name to Uniden Holdings Corporation in July 2015. Uniden Holdings Corporation was incorporated in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8512",
        "website": "http://www.uniden.co.jp",
        "market_cap": "Small Cap"
    },
    "VCU.F": {
        "short_name": "V-CUBE INC.",
        "long_name": "V-cube, Inc.",
        "summary": "V-cube, Inc. develops and provides visual communication services to enterprise customers. The company offers V-CUBE Meeting, a cloud-based Web conferencing service; V-CUBE Seminar, a Web seminar product for seminars, training, and information sessions; V-CUBE Sales, a web conferencing tool for online sales; V-CUBE Learning, a learning management system (LMS) that has incorporated the virtual online platform for training and learning purposes; and V-CUBE Voice, a teleconferencing service. It also provides Telecube, a soundproof smartphone box that can be installed anywhere and there are tables and chairs, and a PC inside that can be used for web conferencing; QUMU, a cloud-type video distribution management system; Agora for implementation of video calls and live distribution on iOS/Android applications and websites; EventIn, an online event platform; V-CUBE Collaboration, a web conferencing service to share video and audio, and PC desktop screens in real-time; and Realwear explosion-proof smart glass. In addition, the company offers hardware related to visual communication, such as web cameras, headsets, microphones with echo cancellers, large LCD displays, etc., as well as post-installation management services. V-cube, Inc. was founded in 1998 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0072",
        "website": "http://www.vcube.com",
        "market_cap": "Small Cap"
    }
}