{
    "MITSN.MX": {
        "short_name": "MITSUBISHI ELECTRIC CORP",
        "long_name": "Mitsubishi Electric Corporation",
        "summary": "Mitsubishi Electric Corporation develops, manufactures, distributes, and sells electrical and electronic equipment worldwide. The company offers turbine generators, hydraulic turbine generators, nuclear power plant and power electronics equipment, motors, transformers, circuit breakers, gas insulated switchgears, switch controls, display devices, surveillance-system control and security systems, transmission and distribution ICT systems, large display devices, locomotive and rolling stock electrical equipment, elevators, escalators, building security and management systems, and others. It also provides programmable logic controllers, inverters, servomotors, human-machine interfaces, hoists, magnetic switches, circuit breakers, time and power meters, uninterruptible power supply, industrial fans, computerized numerical controllers, electrical-discharge and laser processing machines, industrial robots, clutches, automotive electrical equipment, car electronics and mechatronics, car multimedia, and others. In addition, the company offers wireless and wired communications systems, network camera systems, satellite communications and radar equipment, satellites, antennas, missile and fire control systems, broadcasting and information systems equipment, data transmission devices, network security systems, systems integration products, and others; and power modules, high-frequency devices, optical and LCD devices, and others. Further, it provides air conditioners, chillers, showcases, compressors, refrigeration units, air-to-water heat pump boilers, ventilators, hot water supply systems, IH cooking heaters, LED lamps, indoor lighting, LCD televisions, refrigerators, electric fans, dehumidifiers, air purifiers, cleaners, jar rice cookers, microwave ovens, and others. Additionally, the company offers procurement, logistics, real estate, advertising, finance, and other services. Mitsubishi Electric Corporation was founded in 1921 and is headquartered in Tokyo, Japan.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Diversified Electronics",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8310",
        "website": "http://www.mitsubishielectric.com",
        "full_time_employees": null
    },
    "OMRNN.MX": {
        "short_name": "OMRON CORP",
        "long_name": "OMRON Corporation",
        "summary": "OMRON Corporation engages in industrial automation, electronic and mechanical components, social systems, and healthcare businesses worldwide. The company's Industrial Automation Business offers sensors, switches, safety and control components, relays, automation systems, motion/drives, robotics, energy conservation support/environment measure equipment, and power supplies. Its Electronic and Mechanical Components Business provides relays, switches, connectors, sensors, and components/units for amusement equipment. The company's Social Systems, Solutions and Service Business offers terminals and systems, including PV inverters and storage batteries; railway station systems, such as automated ticket gates and ticket vending machines, traffic and road management systems, payment systems, and UPS that protect equipment from unexpected power disruption; and transport management systems and infrastructure monitoring systems, as wells provides a range of solutions comprising software development and maintenance services to support the social infrastructure. Its Healthcare Business offers blood pressure monitors, nebulizers, electrotherapy TENS devices, digital thermometers, body composition monitors, and other products, such as activity monitors, AEDs, etc. The company was formerly known as OMRON Tateisi Electronics Co. and changed its name to OMRON Corporation in January 1990. OMRON Corporation was founded in 1933 and is headquartered in Kyoto, Japan.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Diversified Electronics",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "600-8530",
        "website": "http://www.omron.com",
        "full_time_employees": null
    },
    "YASKYN.MX": {
        "short_name": "YASKAWA ELECTRIC CORP",
        "long_name": "YASKAWA Electric Corporation",
        "summary": "YASKAWA Electric Corporation engages in motion control, robotics, system engineering, and other businesses worldwide. It manufactures and sells various AC drives, including general purpose AC drives, medium-voltage AC drives, system-use AC drives, and power regenerative units for use in cranes, fans, pumps, machine tools, conveyors, automated warehouses, and metal working machinery; and rotary servo motors, direct drive servo motors, linear servo motors, machine controllers, and machine vision systems that are used in chip mounters, robots, and metal working machinery. The company also offers arc and spot welding, handling/assembling, collaborative, biomedical, palletizing, press handling, sealing/cutting/laser machining, deburring, painting, glass substrates transfer, and semiconductor wafer transfer robots for use in semiconductor/liquid crystal manufacturing, arc welding, spot welding, palletizing, painting, and handling and assembly applications. In addition, it provides industrial system electrical products, such as medium-voltage AC drives, system use AC drives, and system controllers for use in iron and steel systems, water and wastewater treatment, and paper-making/film/port cargo handling/fiber/printing applications. Further, the company offers equipment for energy saving and creation comprising PV inverters, systems for large wind turbines, control equipment for small-scale power generation, and motor drive systems for use in photovoltaic power generation and electric vehicles. YASKAWA Electric Corporation was founded in 1915 and is headquartered in Kitakyushu, Japan.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Diversified Electronics",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Japan",
        "state": null,
        "city": "Kitakyushu",
        "zipcode": "806-0004",
        "website": "http://www.yaskawa.co.jp",
        "full_time_employees": null
    }
}