{
  "1723.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Nihon Dengi Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "NIHON DENGI CO",
    "state": null,
    "summary": "Nihon Dengi Co., Ltd. designs, constructs, adjusts, and maintains automatic control systems in Japan. It provides one-stop design, construction management, trial run/adjustment before delivery, handling instructions at the time of delivery, and others for building automation systems, such as air conditioning/water supply/drainage sanitary facilities. The company is also involved in the maintenance of the equipment; and management and analysis of energy consumption, asset conservation, and proposals for equipment repair and renewal. In addition, it provides district heating and cooling, a system that supplies heat media, such as cold water, hot water, and steam from a heat supply facility to a group of buildings. Further, the company offers facility solutions comprising maintenance, cloud, and renewal proposal services; and environmental solutions, such as ESCO, energy management, and eco tuning services. Additionally, it provides automatic control of production equipment in factories and plants. The company was incorporated in 1959 and is headquartered in Tokyo, Japan.",
    "website": "http://www.nihondengi.co.jp",
    "zipcode": "130-8556"
  },
  "1938.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Nippon Rietec Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "NIPPON RIETEC CO LTD",
    "state": null,
    "summary": "Nippon Rietec Co.,Ltd. engages in the railway electrical equipment construction business in Japan. The company's railway electrical equipment includes signal, train line, power generation and transformation, lighting power, distribution line, telecommunication, optical communication cable, and transmission line equipment, as well as information and communication systems and new transportation systems. It also provides road construction equipment, including traffic signals, road information control systems, road signs and markings, landscape signs, sound insulation and soundproof walls, guard fences, backside sound absorbing boards, road lighting equipment, air lighting equipment, and telecommunication equipment. In addition, the company offers electrical equipment of general buildings, optical communication cable equipment, and solar power generation systems; and transmission lines for information communication. Further, it undertakes firefighting/disaster prevention equipment, instrumentation equipment, air conditioning/sanitation equipment, machinery equipment, steel structure, and waterproofing constructions, as well as civil engineering works. Additionally, the company sells road signs, sign markings, information boards, and road security facility supplies. Nippon Rietec Co.,Ltd. was incorporated in 1945 and is headquartered in Tokyo, Japan.",
    "website": "http://www.j-rietec.co.jp",
    "zipcode": "101-0054"
  },
  "2162.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "nms Holdings Corporation",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "NMS HOLDINGS CORPORATION",
    "state": null,
    "summary": "nms Holdings Corporation engages in human resource, electronics manufacturing services, and power supply businesses in Japan and internationally. The company offers worker dispatch services for manufacturing; engineer dispatch service; and substrate repairs and repair customer services. It also provides contract electronics manufacturing services, such as design, installation, assembly, and prototype manufacturing of electric and electronic products, including component procurement, inspection, production, logistics, repairs, and customer services. In addition, the company designs, develops, manufactures, and sells low-voltage power supplies, high-voltage power supplies, high-voltage transformers, and magnet rolls used in various fields, such as office automation, industrial medicine, home appliances, and industrial equipment. The company was formerly known as Nippon Manufacturing Service Corporation and changed its name to nms Holdings Corporation in April 2017. nms Holdings Corporation was founded in 1985 and is headquartered in Tokyo, Japan.",
    "website": "http://www.n-ms.co.jp",
    "zipcode": "163-1445"
  },
  "2479.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "JTEC Corporation",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "JTEC CORP",
    "state": null,
    "summary": "JTEC Corporation engages in technical intellectual property leasing business in Japan and internationally. It offers machinery design and development, electrical and electronic design and development, and employment placement services. The company also engages in the software development, including embedded system software, packaged software, open system, smartphone application, general-purpose machine system, cloud system, communication network, and Web system. In addition, it is involved in the development of integrated core system for business management; Web application development; and Web site construction and other activities. Further, the company offers various technical, technical training, and consulting services. JTEC Corporation was founded in 1996 and is headquartered in Tokyo, Japan.",
    "website": "http://www.j-tec-cor.co.jp",
    "zipcode": "104-0031"
  },
  "3321.T": {
    "city": "Nagoya",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Mitachi Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "MITACHI CO LTD",
    "state": null,
    "summary": "Mitachi Co., Ltd., together with its subsidiaries, operates as an electronics trading company in Japan and internationally. It sells electronics devices, such as semiconductors, LCDs, etc., as well as electronics components and motors for various electronics industries, such as car electronics, amusement equipment, industrial equipment, consumer equipment, communication equipment, and others. The company also manufactures and sells electronic devices and modules; and sells assembly equipment for electronic devices, such as SMT lines, inspection systems, etc. Mitachi Co., Ltd. was founded in 1972 and is headquartered in Nagoya, Japan.",
    "website": "http://www.mitachi.co.jp",
    "zipcode": "460-0026"
  },
  "3891.T": {
    "city": "Kochi",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Nippon Kodoshi Corporation",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "NIPPON KODOSHI",
    "state": null,
    "summary": "Nippon Kodoshi Corporation manufactures and sells separators in Japan and internationally. The company offers aluminum electrolytic capacitors for electronic devices and home appliances; separators for conductive polymer solid capacitors that are used for digital home appliances, such as PC and flat TV; and separators for electric double layer capacitors that are used for OA equipment, industrial machines, eco-car, and clean energy. It also provides battery separators for alkaline battery and lithium ion battery. Nippon Kodoshi Corporation was incorporated in 1941 and is headquartered in Kochi, Japan.",
    "website": "http://www.kodoshi.co.jp",
    "zipcode": "781-0395"
  },
  "4062.T": {
    "city": "Ogaki",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Ibiden Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "IBIDEN CO LTD",
    "state": null,
    "summary": "Ibiden Co.,Ltd. provides electronic and ceramics products in Japan, Asia, North America, Europe, and internationally. It operates through Electronics, Ceramics, and Construction segments. The company offers IC package substrate for use in data centers, personal computers, automotive electronics, and entertainment; printed circuit board for smart phones, data centers, and automotive electronics applications; diesel particulate filters; and automobile exhaust system parts for use in automobiles, buses, trucks, construction vehicles, and agricultural machines. It also provides SCR Catalyst Substrates for diesel vehicles, power stations, marine engines, diesel locomotive, glasswork, and cement works applications; ceramic honeycomb substrates for heat storage media and casting filter applications; high temperature insulating wool; and graphite specialty products. In addition, the company engages in the manufacturing and selling of the decorative interior laminates; design and construction of facilities; environmental engineering technology business; medical software package development; sale of information and communication terminals; and sale of welfare vehicles. The company was formerly known as Ibigawa Electric Power Co., Ltd. and changed its name to Ibiden Co., Ltd. in November 1982. Ibiden Co., Ltd. was founded in 1912 and is headquartered in Ogaki, Japan.",
    "website": "http://www.ibiden.co.jp",
    "zipcode": "503-8604"
  },
  "4186.T": {
    "city": "Kawasaki",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Tokyo Ohka Kogyo Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "TOKYO OHKA KOGYO CO",
    "state": null,
    "summary": "Tokyo Ohka Kogyo Co., Ltd., together with its subsidiaries, manufactures and sells chemical products and process equipment in Japan and internationally. The company offers optimal photoresists and photolithography relative chemicals; and coating, developing, vacuum UV hardening, and UV curing machines. It also provides adhesive materials, thinners for the removing of adhesive materials, structure materials, surface modification materials, micro processing films, and zero Newton bonding and debonding machines for 3D semiconductor packaging. The company's products are used in the production of semiconductor devices, mobile devices, tablet devices, personal computers, servers, supercomputers, game machines, MEMS and image sensors, IoT, AI self-driving vehicles, advanced driver assistance systems, robotics, renewable energy equipment, eco-friendly cars, panel manufacturing, televisions, and various displays. In addition, it offers insurance agency services. Tokyo Ohka Kogyo Co., Ltd. was founded in 1940 and is headquartered in Kawasaki, Japan.",
    "website": "http://www.tok.co.jp",
    "zipcode": "211-0012"
  },
  "4237.T": {
    "city": "Himeji",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Fujipream Corporation",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "FUJIPREAM CORP",
    "state": null,
    "summary": "Fujipream Corporation manufactures and sells optical filters for plasma display panels in Japan and internationally. The company offers optical films, which are used in the display screens of digital products, including LCD monitors, smartphones, tablets, laptop computers, and car navigation systems. It also manufactures ultra-lightweight photovoltaic modules, silicon crystal photovoltaic modules, and photovoltaic modules integrated into building materials; designs, retails, and installs solar power generation systems under the Fujipream brand; and manufactures, sells, and installs shatterproof film laminated glass and insulated glazing. In addition, the company provides packaging lines and equipment, such as wrap-around casers, set-up and robot casers, tray packers, individual cartoners, bagging equipment, carton formers, labelers, pack boxers, palletizers, and pallet conveyors and dispensers for food and beverages, pharmaceuticals and reagents, and other industries. It serves consumer electronics manufacturers and other companies. Fujipream Corporation was founded in 1982 and is headquartered in Himeji, Japan.",
    "website": "http://www.fujipream.co.jp",
    "zipcode": "671-2216"
  },
  "4240.T": {
    "city": "Osaka",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Cluster Technology Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "CLUSTER TECHNOLOGY CO LTD",
    "state": null,
    "summary": "Cluster Technology Co., Ltd. manufactures and sells various resin composite materials in Japan. It also engages in the molding of plastics; assembly processing of plastic molded products; manufacture and sale of molding dies; sale of plastic molding materials; and nanotechnology/micro technology businesses. The company offers Epohard, a resin composite material based on epoxy resin and containing inorganic filler, reinforcement material, colorant, etc.; and Epocluster, a functional resin composite material for precision molded products, as well as pulse injector systems. The company was founded in 1991 and is headquartered in Osaka, Japan.",
    "website": "http://www.cluster-tech.co.jp",
    "zipcode": "577-0836"
  },
  "4251.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "KEIWA Incorporated",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "KEIWA INCORPORATED",
    "state": null,
    "summary": "KEIWA Incorporated manufactures and sells optical sheets and functional products in Japan. The company provides light diffusion sheets used in backlight units of liquid crystal displays of smartphones; components for special optical films, such as protective films of light collecting films, etc.; and advanced functional films and sheets used for display surface protection in the optical systems, as well as other applications. It also offers industrial packaging materials, industrial processing papers, and clean energy materials, as well as other industrial materials, such as construction and agricultural materials. The company was formerly known as KEIWA Commerce and Industry Co., Ltd. and changed its name to KEIWA Incorporated in 1999. KEIWA Incorporated was founded in 1948 and is headquartered in Tokyo, Japan.",
    "website": "http://www.keiwa.co.jp",
    "zipcode": "103-0025"
  },
  "4980.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Dexerials Corporation",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "DEXERIALS CORPORATION",
    "state": null,
    "summary": "Dexerials Corporation manufactures and sells electronic components, bonding materials, optics materials, and other products in Japan. The company offers anisotropic conductive films, industrial adhesives, double and single coated tapes, thermal conductive sheets, architectural window films, optical elasticity resins, inorganic wave plates, optical films, inorganic diffusers and polarizers, and anti-reflection films, as well as UV curable resins for optical disks. It also provides surface mounted type fuses and water treatment agents for inorganic effluent; and solar cell conductive films for photovoltaic modules. The company was formerly known as Sony Chemical & Information Device Corporation and changed its name to Dexerials Corporation in September 2012. Dexerials Corporation was founded in 1962 and is headquartered in Tokyo, Japan.",
    "website": "http://www.dexerials.jp",
    "zipcode": "141-0032"
  },
  "5208.T": {
    "city": "Joetsu",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Arisawa Mfg. Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "ARISAWA MFG CO",
    "state": null,
    "summary": "Arisawa Mfg. Co., Ltd. manufactures and sells electronic, optoelectronic, electrical insulating, and industrial structural materials in Japan and internationally. The company offers flexible printed circuit materials, including PI, photosensitive, and other coverlays; copper-clad laminates; interlayer adhesive sheets; and PI composite and protection films. It also provides optical materials, such as projection screens, UV nanoimprinting products, 3D displays for optical devices, optical retardation elements, and lamination services. In addition, the company offers fabric products comprising glass cloths and tapes, carbon cloths, and braided and other fabric products; general coating products, which include pre-pregs, glass cloth silicon rubber tapes, semi-conductive tapes, adhesive tapes, composite adhesive tapes, and resin impregnated glass-cloth tapes; and glass and carbon fiber filament winding moldings, pultrusion products, compression molding products, and cryogenic cooling vessels. Arisawa Mfg. Co., Ltd. was founded in 1909 and is headquartered in Joetsu, Japan.",
    "website": "http://www.arisawa.co.jp",
    "zipcode": "943-8610"
  },
  "5216.T": {
    "city": "Kurihara",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Kuramoto Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "KURAMOTO SEISAKUSHO CO",
    "state": null,
    "summary": "Kuramoto Co., Ltd. engages in the development, processing, and sale of glass substrates. The company's glass substrates are used in flat panel displays, including TFT-LCD, STN-LCD, TN-LCD, EL, and others. It is also involved in the development, processing, and sale of thin film devices; and sale of smart solution equipment. The company was founded in 1975 and is headquartered in Kurihara, Japan.",
    "website": "http://www.kuramoto.co.jp",
    "zipcode": "989-5508"
  },
  "5218.T": {
    "city": "Sagamihara",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Ohara Inc.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "OHARA INC",
    "state": null,
    "summary": "Ohara Inc. manufactures and sells glass materials for optical and electronics applications in Japan and internationally. It offers optical glass/eco-optical glass, low Tg optical glasses for glass mold lens, and high transmission and low photoelastic constant glass; and electronics products, such as ultra low expansion glass-ceramics, glass-ceramic substrate for DWDM thin-film filters, glass disk for magnetic head flying height testers, lithium-ion conductive glass-ceramics, fiber glasses for light guide, i-line high homogeneity glass, glass for art, measurement service on glasses/ceramics, and quartz glass. The company also provides measurement and analysis services on characteristics of optical materials. Ohara Inc. was founded in 1935 and is headquartered in Sagamihara-Shi, Japan.",
    "website": "http://www.ohara-inc.co.jp",
    "zipcode": "252-5286"
  },
  "5344.T": {
    "city": "Owariasahi",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Maruwa Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "MARUWA CO LTD",
    "state": null,
    "summary": "Maruwa Co., Ltd. produces and sells ceramics and electronic parts in Japan, Europe, the United States, China, Taiwan, Korea, Malaysia, and India. The company offers ceramics, including ceramic substrates and fillers, metalized/multilayer ceramic substrates, and pressed ceramic products, as well as ceramic hermetic seals and SiC components; and electronic components/devices, such as antennas, EMC and RF components, inductors, and capacitors. It also provides quartz glass products; and LED lighting products comprising LED modules and components. The company offers its products for use in mobile and network, LED, automotive electronics, RF, power electronics, IT and consumer electronics, semiconductor equipment, medical, power electronics, 5G, and TIM and TPH applications, as well as insulation parts. The company was formerly known as Maruwa Ceramic Co., Ltd. and changed its name to Maruwa Co., Ltd. in 1999. Maruwa Co., Ltd. was incorporated in 1973 and is headquartered in Owariasahi, Japan.",
    "website": "http://www.maruwa-g.com",
    "zipcode": "488-0044"
  },
  "5953.F": {
    "city": "Fukuoka City",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "FKA",
    "industry": "Electronic Components",
    "long_name": "Showa Manufacturing Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "SHOWA MANUFACTURING CO",
    "state": null,
    "summary": "Showa Manufacturing Co.,Ltd. manufactures and sells heat source and hot water supply products in Japan. It also offers air conditioning, environmental, cityscape, casting, and special heat source products. The company was founded in 1883 and is headquartered in Fukuoka City, Japan.",
    "website": "http://www.showa.co.jp",
    "zipcode": "811-2101"
  },
  "5IA.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Components",
    "long_name": "Tamura Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "TAMURA CORP.",
    "state": null,
    "summary": "Tamura Corporation manufactures and sells electronic components, electronic chemicals/FA systems, and information equipment in Japan, Asia, Europe, and the Americas. The company offers electronic components, including switching and power transformers, reactors, coils, current sensors, AC adaptors, battery chargers, power and gate driver modules, outdoor LED lighting power supplies, piezoelectric ceramic products, LED-related products, vending machine products, and IoT-related products. It also provides electronic chemicals/FA systems, such as solder paste and post-fluxes, self-assembling materials, solder resists, OSPs, white reflective and black absorbing materials, reflow and wave soldering systems, and spray fluxer and other peripheral devices. In addition, the company offers information equipment comprising audio mixing console for broadcast use, sound editor and other equipment, wireless intercom and microphone products, communication network equipment, security-related equipment, and OEM products. Tamura Corporation was founded in 1924 and is headquartered in Tokyo, Japan.",
    "website": "http://www.tamuracorp.com",
    "zipcode": "178-8511"
  },
  "6266.T": {
    "city": "Okayama",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Tazmo Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "TAZMO CO LTD",
    "state": null,
    "summary": "Tazmo Co., Ltd. manufactures and sells semiconductor manufacturing equipment in Japan and internationally. It also provides clean transfer systems, LCD manufacturing equipment, precision molding dies and plastic moldings, and UV irradiation systems, as well as machines and robots for semiconductor equipment. The company was founded in 1972 and is headquartered in Okayama, Japan.",
    "website": "http://www.tazmo.co.jp",
    "zipcode": "701-1221"
  },
  "6298.T": {
    "city": "Akishima",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Y.A.C. Holdings Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "Y.A.C HOLDINGS CO LTD",
    "state": null,
    "summary": "Y.A.C. Holdings Co., Ltd. engages in semiconductor business in Japan. The company produces and sells liquid crystal and semiconductor-related products, including dry etching, and barrel plasma ashing. It also manufactures and sells hard disk related manufacturing equipment, such as burnishers, UV curing machines, hard disk conveyors, automatic machines, conveyor systems for semiconductors, conveyor/handling/automatic machines, factory automation equipment, handlers, solar water and cell manufacturing tools, and research and development tools, as well as laser and Ion beam machines; and cleaning machines consisting of shirt finishing systems, wool and uniform finishers, tumblers, bagging systems, sorters, and apparel equipment for clothing. The company was formerly known as Y.A.C. Co., Ltd. and changed its name to Y.A.C. Holdings Co., Ltd. in April 2017. Y.A.C. Holdings Co., Ltd. was founded in 1973 and is headquartered in Akishima, Japan.",
    "website": "http://www.yac.co.jp",
    "zipcode": "196-0021"
  },
  "6479.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "MinebeaMitsumi Inc.",
    "market": "jp_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "MINEBEA MITSUMI INC",
    "state": null,
    "summary": "MinebeaMitsumi Inc. manufactures and supplies machined components, and electronic devices and components in Japan, Europe, the United States, Asia, and internationally. It operates through three segments: Machined Components, Electronic Devices and Components, and MITSUMI Business. The Machined Components segment offers bearing products, including miniature and small sized ball bearings, rod end and spherical bearings, roller bearings, bushings, precision machined parts for aircraft, and medium- and large-sized ball bearings for aerospace use. It also provides bearing-related products, such as pivot assemblies and precision mechanical assemblies; and fasteners, defense related special components, and magnetic clutches and brakes. The Electronic Devices and Components segment offers rotary components comprising fan motors, blowers, hybrid type stepping motors, PM stepping motors, small diameter/high speed PM stepping motors, brush DC motors, small brushless motors, power brushless motors, polygon mirror scanner motors, HDD spindle motors, high-pressure blowers, rotation angle sensors, fan units, and FDB motors. It also provides lighting devices for LCDs; resonant devices; and measuring components comprising strain gages, force sensors, load cells, pressure sensors, torque transducers, vector sensors, digital indicators, and tensile and compression testing machines. The MITSUMI Business segment provides precision components, optical devices, power supply components, mechanical components, automotive products, and semiconductors. The company offers its products for use in household electrical appliances, information and telecommunications equipment, and automobiles. The company was formerly known as Minebea Co., Ltd. and changed its name to MinebeaMitsumi Inc. in January 2017. MinebeaMitsumi Inc. was founded in 1951 and is headquartered in Tokyo, Japan.",
    "website": "http://www.minebeamitsumi.com",
    "zipcode": "108-8330"
  },
  "6590.T": {
    "city": "Yokohama",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Shibaura Mechatronics Corporation",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "SHIBAURA MECHATRONICS CO",
    "state": null,
    "summary": "Shibaura Mechatronics Corporation, together with its subsidiaries, produces and sells manufacturing equipment for flat panel displays (FPDs), semiconductors, electronic components, and optical thin films in Japan, Northeastern Asia, and internationally. It operates in four segments: Fine Mechatronics, Mechatronics Systems, Vending Machines & Systems, and Real Estate Leasing. The Fine Mechatronics segment offers FPD manufacturing equipment, such as wet cleaning, developing, etching, stripping, and cell assembly equipment, as well as PI inkjet coaters; semiconductor manufacturing equipment, including wafer inspection, etching, aching, and wet cleaning equipment; and railroad maintenance equipment and other items. The Mechatronics Systems segment provides FPD manufacturing equipment consisting of outer lead bonders; semiconductor manufacturing equipment, such as die, flip chip, and inner lead bonders; vacuum equipment comprising sputtering, vacuum bonding, and industrial vacuum evaporation equipment; and rechargeable battery manufacturing equipment, precision parts manufacturing equipment, other automation equipment, and other products. The Vending Machines & Systems segment offers vending machines, ticket vending machines, and others. The Real Estate Leasing segment provides real estate leasing and management services, and other businesses. The company was formerly known as Shibaura Engineering Works Co., Ltd. and changed its name to Shibaura Mechatronics Corporation in October 1998. Shibaura Mechatronics Corporation was founded in 1939 and is headquartered in Yokohama, Japan.",
    "website": "http://www.shibaura.co.jp",
    "zipcode": "247-8610"
  },
  "6626.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "SEMITEC Corporation",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "SEMITEC CORPORATION",
    "state": null,
    "summary": "SEMITEC Corporation manufactures and sells electronic components in Japan and internationally. It offers temperature sensors, such as thermistors, as well as sensor assemblies for use in office automation, automotive, medical, home appliances, industrial appliances, and standard assemblies applications. The company also provides IR sensors, such as NC sensors and thermopiles; pressure sensors for use in endoscopy devices, remote body probes, and catheters; and sensing vision products. In addition, it offers semiconductor devices comprising surge absorbers, such as transient voltage suppressors and Zenamic; current regulating diodes; and power thermistors. The company was formerly known as Ishizuka Electronics Corporation and changed its name to SEMITEC Corporation in 2011. SEMITEC Corporation was founded in 1958 and is headquartered in Tokyo, Japan.",
    "website": "http://www.semitec.co.jp",
    "zipcode": "130-8512"
  },
  "6645.T": {
    "city": "Kyoto",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "OMRON Corporation",
    "market": "jp_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "OMRON CORP",
    "state": null,
    "summary": "OMRON Corporation engages in industrial automation, electronic and mechanical components, social systems, and healthcare businesses worldwide. The company's Industrial Automation Business offers sensors, switches, safety and control components, relays, automation systems, motion/drives, robotics, energy conservation support/environment measure equipment, and power supplies. Its Electronic and Mechanical Components Business provides relays, switches, connectors, sensors, and components/units for amusement equipment. The company's Social Systems, Solutions and Service Business offers terminals and systems, including PV inverters and storage batteries; railway station systems, such as automated ticket gates and ticket vending machines, traffic and road management systems, payment systems, and UPS that protect equipment from unexpected power disruption; and transport management systems and infrastructure monitoring systems, as wells provides a range of solutions comprising software development and maintenance services to support the social infrastructure. Its Healthcare Business offers blood pressure monitors, nebulizers, electrotherapy TENS devices, digital thermometers, body composition monitors, and other products, such as activity monitors, AEDs, etc. The company was formerly known as OMRON Tateisi Electronics Co. and changed its name to OMRON Corporation in January 1990. OMRON Corporation was founded in 1933 and is headquartered in Kyoto, Japan.",
    "website": "http://www.omron.com",
    "zipcode": "600-8530"
  },
  "6658.T": {
    "city": "Kyoto",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Shirai Electronics Industrial Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "SHIRAI ELECTRONICS INDUSTRIAL",
    "state": null,
    "summary": "Shirai Electronics Industrial Co., Ltd. designs, manufactures, and sells printed wiring boards and printed wiring board visual inspection machines in Japan and internationally. It offers transparent flexible substrates; and double-sided/multi-layer printed wiring boards, high-performance boards, and MEMS field related products. The company was founded in 1966 and is headquartered in Kyoto, Japan.",
    "website": "http://www.shiraidenshi.co.jp",
    "zipcode": "615-0901"
  },
  "6666.T": {
    "city": "Nirasaki",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "River Eletec Corporation",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "RIVER ELETEC CORP",
    "state": null,
    "summary": "River Eletec Corporation, together with its subsidiaries, develops, produces, and sells quartz crystal units, crystal oscillators, resistors, and other components in Asia, North America, Europe, and internationally. The company's quartz crystal units include AT-cut and tuning fork products. Its products are used in smartphones, automotive related equipment, wireless communication/IoT, audiovisual equipment, and medical/healthcare fields. The company was formerly known as Fuji Sangyo Company and changed its name to River Eletec Corporation in October 1991. River Eletec Corporation was founded in 1949 and is headquartered in Nirasaki, Japan.",
    "website": "http://www.river-ele.co.jp",
    "zipcode": "407-8502"
  },
  "6728.T": {
    "city": "Chigasaki",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "ULVAC, Inc.",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "ULVAC INC",
    "state": null,
    "summary": "ULVAC, Inc. engages in the development, manufacture, sale, customer support, and import/export of vacuum equipment, peripheral devices, and vacuum components and materials in Japan and internationally. The company offers various equipment, including sputtering, chemical vapor deposition, vacuum evaporation, vapor deposition polymerization, ashing, etching, ion implantation, vacuum furnaces, roll coaters, freeze drying/vacuum drying, vacuum distillation systems, and other products. It also provides components that comprise vacuum pumps, vacuum gauges, process gas monitors, leak detectors, spectroscopic ellipsometers, deposition controllers, vacuum valves, power supplies, vacuum transfer robots, molecular interaction analyzers, microplate paddle mixers, film forming equipment, refrigerators, and heat treatment and thermal properties. In addition, the company offers sputtering targets, high performance materials, and nano-metal inks, as well as deposition and etching technologies used in packaging processes; technical solutions for the production of power devices; delivering systems for SiC and Si; and solutions for micro-powder dry systems and touch screens. It serves display, solar cell, semiconductor, electronics, electrics, metals, machinery, automotive, chemical, food, and pharmaceutical industries, as well as universities and research centers. The company was incorporated in 1929 and is headquartered in Chigasaki, Japan.",
    "website": "http://www.ulvac.co.jp",
    "zipcode": "253-8543"
  },
  "6754.T": {
    "city": "Atsugi",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Anritsu Corporation",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "ANRITSU CORP",
    "state": null,
    "summary": "Anritsu Corporation develops, manufactures, and sells measurement instruments and systems for various communications applications in Japan and internationally. The company operates through Test and Measurement, Products Quality Assurance, and Others segments. The Test and Measurement segment offers measuring instruments for mobile phone acceptance testing by mobile phone service providers; and for design, production, function and performance verification, and maintenance of mobile phone handsets by manufacturers of mobile phones, including smartphones, IC chipsets, and relevant components. This segment also provides network construction, maintenance, monitoring, and service quality assurance solutions for wireline and wireless service operators; and measuring instruments for design, production, and evaluation of electronic devices used in telecommunications network-related communications equipment and other electronic equipment. The Products Quality Assurance segment offers highly precise checkweighers; X-ray and other inspection systems that detect and remove metal fragments, stones, and other alien materials in the food processing process. The Others segment engages in the information and communications, devices, logistics, welfare services, real estate leasing, and other businesses. Anritsu Corporation was founded in 1895 and is headquartered in Atsugi, Japan.",
    "website": "http://www.anritsu.com",
    "zipcode": "243-8555"
  },
  "6762.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "TDK Corporation",
    "market": "jp_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "TDK CORP",
    "state": null,
    "summary": "TDK Corporation, together with its subsidiaries, manufactures and sells electronic components in Japan, Europe, China, Asia, the Americas, and internationally. The company operates through Passive Components, Sensor Application Products, Magnetic Application Products, Film Application Products, and Other segments. The Passive Components segment provides ceramic capacitors, aluminum electrolytic capacitors, film capacitors, inductive devices, high-frequency components, piezoelectric materials, and circuit protection components. The Sensor Application Products segment offers temperature and pressure, magnetic, and MEMS sensors. The Magnetic Application Products segment offers hard disk drives (HDD) heads, HDD suspension assemblies, power supplies, and magnets. The Film Application Products segment provides energy devices, such as rechargeable batteries. The Other segment provides mechatronics production equipment and other products. It also provides inductive devices, ferrite cores, magnetic heads, and transformers; and engages in insurance and real estate agency business. The company was formerly known as Tokyo Denki Kagaku Kogyo K.K. and changed its name to TDK Corporation in 1983. TDK Corporation was founded in 1935 and is headquartered in Tokyo, Japan.",
    "website": "http://www.jp.tdk.com",
    "zipcode": "108-0023"
  },
  "6768.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Tamura Corporation",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "TAMURA CORP",
    "state": null,
    "summary": "Tamura Corporation manufactures and sells electronic components, electronic chemicals/FA systems, and information equipment in Japan, Asia, Europe, and the Americas. The company offers electronic components, including switching and power transformers, reactors, coils, current sensors, AC adaptors, battery chargers, power and gate driver modules, outdoor LED lighting power supplies, piezoelectric ceramic products, LED-related products, vending machine products, and IoT-related products. It also provides electronic chemicals/FA systems, such as solder paste and post-fluxes, self-assembling materials, solder resists, OSPs, white reflective and black absorbing materials, reflow and wave soldering systems, and spray fluxer and other peripheral devices. In addition, the company offers information equipment comprising audio mixing console for broadcast use, sound editor and other equipment, wireless intercom and microphone products, communication network equipment, security-related equipment, and OEM products. Tamura Corporation was founded in 1924 and is headquartered in Tokyo, Japan.",
    "website": "http://www.tamuracorp.com",
    "zipcode": "178-8511"
  },
  "6779.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Nihon Dempa Kogyo Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "NIHON DEMPA KOGYO",
    "state": null,
    "summary": "Nihon Dempa Kogyo Co., Ltd. manufactures and sells quartz crystal devices. The company also offers crystal clock oscillator, simple packaged, temperature compensated, voltage-controlled, frequency controlled, and oven controlled crystal oscillators, as well as high precision oscillators; and crystal units and filters, SAW devices, synthetic quartz crystals/crystal blanks/optical components, ultrasonic probes, bio sensors, outgas sensors, frequency synthesizers, millimeter-wave converters, and signal generators. Its products are used in various applications consisting of IoT products, automotive products, smartphones, network equipment, digital consumer electronics, personal computers, watches, digital cameras, and game consoles, as well as 5G applications. Nihon Dempa Kogyo Co., Ltd. primarily sells its products in Japan, Asia, Europe, and North America. The company was formerly known as Nanbu Shoko Co., Ltd. and changed its name to Nihon Dempa Kogyo Co., Ltd. in 1950. Nihon Dempa Kogyo Co., Ltd. was founded in 1948 and is headquartered in Tokyo, Japan.",
    "website": "http://www.ndk.com",
    "zipcode": "151-8569"
  },
  "6785.T": {
    "city": "Suzaka",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Suzuki Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "SUZUKI CO LTD",
    "state": null,
    "summary": "Suzuki Co.,Ltd. manufactures and sells connectors for car electronics parts in Japan. It also offers precision press and mold dies, connector contacts and housings, connector contacts for automotive wire harnesses, machines for semiconductors, various customized machines, and medical instrument assembly. The company was incorporated in 1933 and is headquartered in Suzaka, Japan.",
    "website": "http://www.suzukinet.co.jp",
    "zipcode": "382-8588"
  },
  "6787.T": {
    "city": "Ayase",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Meiko Electronics Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "MEIKO ELECTRONICS CO",
    "state": null,
    "summary": "Meiko Electronics Co., Ltd. engages in the design, manufacture, and sale of printed circuit boards (PCBs) and auxiliary electronics in Japan, rest of Asia, North America, Europe, and internationally. Its principal products include double-sided/multi-layer through-hole PCBs, HDI PCBs, flexible PCBs, flex-rigid PCBs, high electric current PCBs, heat dissipation PCBs, embedded devices PCBs, solder stencils, PCB testers, and imaging devices and systems. The company also provides circuit design and electronic manufacturing services. Its products have applications in the areas of automobiles, telecommunications, industrial devices, and amusement/home appliances. The company was formerly known as Meiko Denshi Kogyo Co., Ltd. and changed its name to Meiko Electronics Co., Ltd. in April 1991. Meiko Electronics Co., Ltd. was founded in 1975 and is headquartered in Ayase, Japan.",
    "website": "http://www.meiko-elec.com",
    "zipcode": "252-1104"
  },
  "6798.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "SMK Corporation",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "SMK CORP",
    "state": null,
    "summary": "SMK Corporation, together with its subsidiaries, manufactures and sells various parts for electro-communication device and electronic equipment in Japan, rest of Asia, North America, and Europe. The company operates through three divisions: Connection System; Sensing, Communication, and Interface; and Research & Development Center. It offers connectors, including board to board, board to wire, FPC, RF coaxial, interface, card, battery, power, and LED connectors, as well as earth terminals, connectors for photovoltaic modules, fuse clips, DC power supply plug jacks, terminals, and camera module sockets; and plugs/jacks comprising mini, pin, and phone jacks. The company also provides switches, such as push, slide, multi-functional device, and detector switches; remote controls units; touch panels, including resistive, optical, and capacitive touch panels; and Communication Modules comprising Bluetooth and RF modules. Its products are used in various applications, such as home electronics, automotive, wearable devices, renewable energy, housing facility, entertainment, mobile devices, industrial, healthcare, and IoT/LPWA. The company was formerly known as Showa Musen Kogyo Kabushikigaisha and changed its name to SMK Corporation in 1985. SMK Corporation was founded in 1925 and is headquartered in Tokyo, Japan.",
    "website": "http://www.smk.co.jp",
    "zipcode": "142-8511"
  },
  "6800.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Yokowo Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "YOKOWO CO LTD",
    "state": null,
    "summary": "Yokowo Co., Ltd. manufactures and sells components and advanced devices for wireless communication and information transmission worldwide. The company offers antennas for vehicle communication and infrastructure solutions; connectors comprising electronic devices, circuit testing products, and test tool for electrical equipment; and advanced devices, including low temperature co-fired ceramics/high temperature fired ceramics applied devices, medical device components, and semiconductor devices. It also provides test tools for electrical equipment, which include clip connectors, microwave test tools, RF probe-test solutions, and semiconductor testing systems. The company offers its products to manufacturers in the electronics, electrical machinery, and automotive industries. The company was formerly known as Yokowo Mfg. Co., Ltd. and changed its name to Yokowo Co., Ltd. in October 1990. Yokowo Co., Ltd. was founded in 1922 and is headquartered in Tokyo, Japan.",
    "website": "http://www.yokowo.co.jp",
    "zipcode": "114-8515"
  },
  "6806.T": {
    "city": "Yokohama",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Hirose Electric Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "HIROSE ELECTRIC CO",
    "state": null,
    "summary": "Hirose Electric Co.,Ltd. manufactures and sells various types of connectors in Japan and internationally. The company offers multi-pin connectors, including circular and rectangular connectors; connectors for ribbon cables; connectors used for printed circuit boards comprising flexible printed circuit boards; and nylon connectors for use in a range of fields, such as smartphones, communications equipment, and automotive electronics, as well as in industrial fields, such as measuring and control equipment, FA equipment, and medical electronics equipment. It also provides coaxial connectors for microwave and other high-frequency signals; and optical fiber connectors and coaxial switches used in various applications, which include microwave communications devices, satellite communications equipment, electronic measuring instruments, smartphones, switching and transmission equipment, and other electronic equipment. In addition, Hirose Electric Co.,Ltd. provides micro switches and instruments for connectors. The company was formerly known as Hirose Manufacturing Co., Ltd. and changed its name to Hirose Electric Co.,Ltd. in August 1963. Hirose Electric Co.,Ltd. was founded in 1937 and is headquartered in Tokyo, Japan.",
    "website": "http://www.hirose.com",
    "zipcode": "224-8540"
  },
  "6817.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Sumida Corporation",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "SUMIDA CORP",
    "state": null,
    "summary": "Sumida Corporation designs, manufactures, and sells electronic components and modules for consumer electronics, automotive, and industrial application in Japan, rest of Asia, Europe, and North and South America. It offers power and IF inductors, including surface mount, through hole, and LPF coils for digital amplifiers, as well as RF chip inductors; and power transformers, such as surface mount, through hole, and PoE transformers, as well as switching mode power supplies, reactors, and wireless power transfer coils. The company also provides signal magnetics comprising RF/communication, radio frequency identification tags, antennas, and other products; EMC coils consisting of AC and DC power line, normal mode chokes, and common mode chokes; and sensors and actuators, including rotor position sensors, ABS coils, and solenoid coils. In addition, it offers automotive modules comprising xenon ignitors, choke modules for inverters, module components, component carriers, power conversion modules, and components and modules; ceramic based passive components, electronic manufacturing services, and flexible flat cables; and components for medical equipment, such as network isolation and isolation transformers. The company was formerly known as Sumida Electric Co., Ltd and changed its name to Sumida Corporation in June 2000. Sumida Corporation was founded in 1956 and is headquartered in Tokyo, Japan.",
    "website": "http://www.sumida.com",
    "zipcode": "104-8547"
  },
  "6826.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Honda Tsushin Kogyo Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "HONDA TSUSHIN KOGYO",
    "state": null,
    "summary": "Honda Tsushin Kogyo Co., Ltd. manufactures and sells electronic components in Japan and internationally. It offers connectors for use in Internet information infrastructure, such as FA equipment, machine tools, and office equipment; and advanced driving assistant system and automatic driving system connectors used in-vehicle cameras and ECUs in the automotive industry. The company also constructs virtual servers; and develops hardware control programs and IoT, as well as maintains and operates various systems for information and communications technology sector. In addition, it engages in the system design and software development activities. The company was founded in 1947 and is headquartered in Tokyo, Japan.",
    "website": "http://www.htk-jp.com",
    "zipcode": "141-0001"
  },
  "6834.T": {
    "city": "Matsudo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "SEIKOH GIKEN Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "SEIKOH GIKEN CO",
    "state": null,
    "summary": "SEIKOH GIKEN Co., Ltd. designs, manufactures, and sells optical components and radio over fiber products in Japan and internationally. It offers precision and optical disc molds; injection molded components and precise manufacturing technology products; and optical communication components, such as interconnect parts, connectors, ferrules, adaptors, jumper cables, optical packaging parts, attenuators, and crimping tools, as well as uniboot connectors. The company also provides optical manufacturing equipment, interferometers, endface cleaners, and field use equipment; lens; isotropic optical e-field sensor heads/optical probe heads, and optical probes for malfunction noise; and X-ray CT scanners, as well as non-destructive testing services. SEIKOH GIKEN Co., Ltd. was founded in 1972 and is headquartered in Matsudo, Japan.",
    "website": "http://www.seikoh-giken.co.jp",
    "zipcode": "270-2214"
  },
  "6837.T": {
    "city": "Kyoto",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Kyosha Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "KYOSHA CO LTD",
    "state": null,
    "summary": "Kyosha Co., Ltd. manufactures and sells printed wiring boards (PWBs), and carrier jigs for mounting electrical components in Japan, China, East and Southeast Asia, North America, and Mexico. It offers dustless construction method Kyosha-Max; and PWB designing services. The company also provides MagiCarrier, a carrier jig for printed boards and micro-components; MagiCarrier- , a double-sided adhesive sheet that has high heat resistance; MagiCarrier-DIP, a carrier for flow soldering; and MagiFix, a holding jig for printed boards during solder printing and mounting. In addition, it offers metal mask, a jig that is used when printing solder paste on printed boards; laser metal mask for high-precision mounting; COB mask for uneven PWB surfaces; and PH mask for uneven surfaces of FPC and ceramic boards. The company was formerly known as Kyoto Shashingata Co., Ltd. and changed its name to Kyosha Co., Ltd. in November 1982. Kyosha Co., Ltd. was founded in 1951 and is headquartered in Kyoto, Japan.",
    "website": "http://www.kyosha.co.jp",
    "zipcode": "613-0024"
  },
  "6844.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Shindengen Electric Manufacturing Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "SHINDENGEN ELECTRIC MANUFACTURI",
    "state": null,
    "summary": "Shindengen Electric Manufacturing Co., Ltd. manufactures and sells semiconductors, electric equipment, and power supply products in Japan, Indonesia, Vietnam, other Asian countries, and internationally. It operates in three segments: Device Business, Car Electronics Business, and Energy System Energy Business. The Device Business segment produces bridge diodes, high-speed rectifier diodes, thyristors, SIDACs, power MOSFETs, power ICs, power modules, and other for use in four-wheel vehicles, factories, air conditioners, lighting, etc. The Car Electronics Business segment offers motorcycle products, four-wheel vehicle products, and general purpose inverters for motorcycles, four-wheel vehicles, and generators. The Energy System Business segment manufactures power conditioners for photovoltaic generators, power storage systems, recharging stands for electric vehicles, and power supplies for information and communication equipment. The company was founded in 1949 and is headquartered in Tokyo, Japan.",
    "website": "http://www.shindengen.co.jp",
    "zipcode": "100-0004"
  },
  "6881.T": {
    "city": "Nagano",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Kyoden Company, Limited",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "KYODEN COMPANY LIMITED",
    "state": null,
    "summary": "Kyoden Company, Limited designs, develops, manufactures, and sells electronic devices. The company primarily offers PCBs, including build-up and multilayer PCBs. It also engages in component procurement and mounting, and products assembly activities. The company offers PCBs primarily for automobile components, air conditioners, and OA equipment. Kyoden Company, Limited was founded in 1983 and is headquartered in Nagano, Japan.",
    "website": "http://www.kyoden.co.jp",
    "zipcode": "399-4603"
  },
  "6907.T": {
    "city": "Yokohama",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "GEOMATEC Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "GEOMATEC CO LTD",
    "state": null,
    "summary": "GEOMATEC Co., Ltd. manufactures and sells thin film products in Japan. The company offers substrates for flat-panel displays, including liquid crystal displays, EL displays, and touch-panels; and optical equipment components, solid-state laser optical system components, and other vacuum-deposited products. Its products include indium tin oxide (ITO) films for touch panels displays; flat ITO membranes; high-durability transparent conductive films; zinc oxide transparent conductive films; and EMI shield films. The company also provides semiconductors and electronic components, such as fanout panel level packages, laser lift-off release films, IoT/sensors, capacitive non-contact sensors, and capacitive sensor IoT development kits; automotive/in-vehicle equipment, including cover glass, anti-reflection film coatings, and water/oil repellent films; aircraft and ship instruments and displays; transparent heaters; hydrophilic membranes; transparent heaters; decorative coatings; half mirrors; moth-eye structural films; metal electrode films; comb electrodes; and thin films thermocouples. The company was formerly known as Matsuzaki Shinku Co., Ltd. and changed its name to GEOMATEC Co., Ltd. in April 1992. GEOMATEC Co., Ltd. was founded in 1953 and is headquartered in Yokohama, Japan.",
    "website": "http://www.geomatec.co.jp",
    "zipcode": "220-8109"
  },
  "6908.T": {
    "city": "Yokohama",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Iriso Electronics Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "IRISO ELECTRONICS CO",
    "state": null,
    "summary": "Iriso Electronics Co., Ltd. develops, manufactures, and sells connectors. The company offers board to board, FPC/FFC, socket, pin header, input/output, and card edge connectors, as well as compression terminals and ESD protector chips. It serves automotive, industrial, and consumer sectors. The company sells its products primarily in Japan, South Korea, China, Hong Kong, Taiwan, Singapore, Malaysia, Thailand, the Philippines, Germany, the United States, and India. Iriso Electronics Co., Ltd. was founded in 1966 and is headquartered in Yokohama, Japan.",
    "website": "http://www.iriso.co.jp",
    "zipcode": "222-0033"
  },
  "6914.T": {
    "city": "Otsu",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "OPTEX GROUP Company, Limited",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "OPTEX GROUP COMPANY LTD",
    "state": null,
    "summary": "OPTEX GROUP Company, Limited, together with its subsidiaries, develops, manufactures, and sells security sensors and automatic door sensors in Japan and internationally. It operates through Sensing Solution Business, Factory Automation Business, Machine Vision Lighting Business, and Electronic Manufacturing Service Business segments. The company offers sensors and LED lighting for factory automation and image inspections; and industrial computers and systems. It also provides measuring instruments, traffic safety sensors, customer traffic counting systems, and electronic components. In addition, the company develops various systems and applications, such as digital content; provides equipment electronics manufacturing services. The company was incorporated in 1979 and is headquartered in Otsu, Japan.",
    "website": "http://www.optexgroup.co.jp",
    "zipcode": "520-0801"
  },
  "6915.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Chiyoda Integre Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "CHIYODA INTEGRE CO",
    "state": null,
    "summary": "Chiyoda Integre Co.,Ltd. manufactures and sells structural and functional parts for various products in Japan and internationally. The company offers parts for office and factory automation, audio and visual, telecommunication and information, automobile equipment, as well as for amusement and advertisement devices, and home appliances. It also provides a range of interior and exterior goods for equipment, such as insulation, spacers, cushions, shielding components, switch panels, and plaques; and pressed products, as well as engages in skin sewing and covering the process of skins on resin moldings. In addition, the company distributes LED components and heat radiation printed circuit boards; and offers building and living materials, including concrete curing tape, integrated artificial-turf sunagoke sheet, agricultural tape, and LED lighting products. Further, it provides medical and health care services, including various antimicrobial agents/repellents, cut processing of the sponges used for surgical operations, and processing of cotton for health futons. The company was founded in 1955 and is headquartered in Tokyo, Japan.",
    "website": "http://www.chiyoda-i.co.jp",
    "zipcode": "104-0044"
  },
  "6926.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Okaya Electric Industries Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "OKAYA ELECTRIC INDUSTRIES CO",
    "state": null,
    "summary": "Okaya Electric Industries Co., Ltd. manufactures and sells electrical components and equipment in Japan and internationally. The company offers noise suppression products, such as noise suppression capacitors, spark killers, high pulse capacitors, noise filters, and common mode choke coils; module, PCB mounted, and SMD type surge protective devices; LED display devices and lighting source products; and sensors. Its products are used in air conditioner, communication, printer, power conditioner, refrigerator, AV equipment, rapid charger, security camera, and LED lighting. The company was formerly known as Okaya Radio Co., Ltd. and changed its name to Okaya Electric Industries Co., Ltd. in 1967. Okaya Electric Industries Co., Ltd. was founded in 1939 and is headquartered in Tokyo, Japan.",
    "website": "http://www.okayaelec.co.jp",
    "zipcode": "158-8543"
  },
  "6928.T": {
    "city": "Uenohara",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Enomoto Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "ENOMOTO CO LTD",
    "state": null,
    "summary": "Enomoto Co.,Ltd. develops, manufactures, and sells LED lead frames for semiconductors in Japan and internationally. The company provides lead frames for IC, transistor, LED, electronic parts, etc. It also provides pressed parts for connectors, lead frame molded products, and insert molded products and mold parts, as well as connectors and relays. In addition, the company engages in the design, development, and manufacture of various precision automobiles and automatic machinery. Enomoto Co.,Ltd. was founded in 1962 and is headquartered in Uenohara, Japan.",
    "website": "http://www.enomoto.co.jp",
    "zipcode": "409-0198"
  },
  "6941.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Yamaichi Electronics Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "YAMAICHI ELECTRONICS",
    "state": null,
    "summary": "Yamaichi Electronics Co.,Ltd. manufactures and sells test, connector, and optical-related products in Japan and internationally. The company offers IC sockets for burn-in and test, and probe cards, as well as burn-in and board maintenance and repair services. It also provides connectors and production IC sockets, including FPC/FFC, card, coaxial, interface, board, board-to-board, optical transceiver, and board-to-cable connectors for various applications comprising cellular phones and smartphones, game equipment, multi-function and inkjet printer, digital still/digital video cameras, notebook /tablet PCs, semiconductor equipment, measuring instrument, LCD television, network and broadcast equipment, automotive products, industrial, medical equipment, and PV modules. In addition, the company offers flexible printed boards; and optical filters, tunable laser light sources, and optical modules. Yamaichi Electronics Co.,Ltd. was founded in 1956 and is headquartered in Tokyo, Japan.",
    "website": "http://www.yamaichi.co.jp",
    "zipcode": "144-8581"
  },
  "6958.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "CMK Corporation",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "CMK CORP",
    "state": null,
    "summary": "CMK Corporation develops, produces, and markets various printed circuit boards and electronic devices for consumer and industrial use in Japan, China, Southeast Asia, and Europe and North America. The company offers automotive printed wiring boards (PWBs); high heat radiation copper base and metal composite PWBs; semi-flex and rigid-flex PWB series; thinner multi-layer FPC for high density components; high frequency correspondence PWBs; stress easing PWB technology series; PPBU series; through-hole PWBs. It also provides double-sided, multilayer, build-up, and environmentally friendly PWBs. The company's products are used in automobiles; digital still and video cameras; amusements; mobile communications devices; and audio-visual, visual, and digital equipment, as well as in products for housing equipment, medical and healthcare products, aero products, and lighting equipment. The company was formerly known as Chuo Meiban Kogyo Co., Ltd. and changed its name to CMK Corporation in 1984. CMK Corporation was founded in 1959 and is headquartered in Tokyo, Japan.",
    "website": "http://www.cmk-corp.com",
    "zipcode": "163-1388"
  },
  "6961.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Enplas Corporation",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "ENPLAS CORP",
    "state": null,
    "summary": "Enplas Corporation engages in the engineering plastic, semiconductor peripherals, plastic optical businesses in Japan and internationally. It offers mechanical solutions, including gears and fluid control products; semiconductor solutions comprising general-purpose IC sockets; optical solutions, such as optical devices that include lens array for parallel communications and plastic barrels; LED solutions, including controlling LED lights; and life science products comprising microfluidic chips, endotoxin-free products, and other life science-related products. The company was founded in 1962 and is headquartered in Tokyo, Japan.",
    "website": "http://www.enplas.co.jp",
    "zipcode": "100-0005"
  },
  "6962.T": {
    "city": "Kakogawa",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Daishinku Corp.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "DAISHINKU CORP",
    "state": null,
    "summary": "Daishinku Corp. manufactures and sells electronic components and equipment in Japan and internationally. The company offers crystal resonators, crystal and MEMS oscillators, monolithic crystal filters, optical quartz products, and hermetic seal products. Its products are used in various applications, including wearable devices, smart phones/mobile phones, IoT/M2M, wireless communication, network, automotive electronics, information communication equipment, audio and visual equipment, gaming equipment, and FA equipment. Daishinku Corp. was founded in 1959 and is headquartered in Kakogawa, Japan.",
    "website": "http://www.kds.info",
    "zipcode": "675-0194"
  },
  "6964.T": {
    "city": "Shiojiri",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Sanko Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "SANKO CO LTD",
    "state": null,
    "summary": "Sanko Co., Ltd. manufactures and sells automobile, mechatronics, digital home appliances, press, office, and plastic related products in Japan. It offers press related products, including square drawing for automobile airbags, combined cold forging, precision shearing of square shafts, and ultra-precision cold forging in the mold; and hinge related products, such as small 2-axis hinges, parallel 2-axis hinges, double rotation 2-axis hinges, hollow uniaxial hinges, tilt hinges, and impact lock hinges. The company also provides mechanical related products comprising self-propelled thin operation panel for car navigation and opening and closing mechanism products; and insert molding, insulators, resin frame, and high precision resin gears. Sanko Co., Ltd. was founded in 1963 and is headquartered in Shiojiri, Japan.",
    "website": "http://www.sko.co.jp",
    "zipcode": "399-0782"
  },
  "6965.T": {
    "city": "Hamamatsu",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Hamamatsu Photonics K.K.",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "HAMAMATSU PHOTONICS",
    "state": null,
    "summary": "Hamamatsu Photonics K.K. manufactures and sells photomultiplier tubes, imaging devices, light sources, opto-semiconductors, and imaging and analyzing systems in Japan and internationally. The company operates through three segments: Electron Tube, Opto-Semiconductor, and Imaging and Measurement Instruments. The Electron Tube segment provides photomultiplier tubes, electron multipliers, microchannel plates, image intensifiers, X-ray products, and various light sources for use in medical, chemical analysis, measurement, industrial testing, and academic research applications. The Opto-Semiconductor segment offers silicon photodiodes, photo IC components, position sensitive and infrared detectors, image sensors for low-light-level imaging and X-ray imaging, mini-spectrometers, and light emitting devices for applications in medical imaging, high-energy physics, and scientific measurement. The Imaging and Measurement Instruments segment provides a range of cameras for scientific and industrial applications, as well as specialized instruments for use in the fields of pharmaceutical development, semiconductor manufacturing, X-ray nondestructive inspection, spectrophotometry, and optical communications. Hamamatsu Photonics K.K. is also involved in the semiconductor laser and hotel operation businesses. The company was formerly known as Hamamatsu TV Co., Ltd. Hamamatsu Photonics K.K. was founded in 1953 and is headquartered in Hamamatsu, Japan.",
    "website": "http://www.hamamatsu.com",
    "zipcode": "430-8587"
  },
  "6969.T": {
    "city": "Toyonaka",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Matsuo Electric Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "MATSUO ELECTRIC CO",
    "state": null,
    "summary": "Matsuo Electric Co.,Ltd. manufactures and markets tantalum capacitors, film capacitors, and circuit protection components in Japan and internationally. Its products are used in the aerospace, automotive, industrial instrument, fire alarm, power tool, electric assist bicycle, PC, display, electric device, hearing aid, and portable audio player products. The company was incorporated in 1949 and is headquartered in Toyonaka, Japan.",
    "website": "http://www.ncc-matsuo.co.jp",
    "zipcode": "561-8558"
  },
  "6976.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Taiyo Yuden Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "TAIYO YUDEN CO LTD",
    "state": null,
    "summary": "Taiyo Yuden Co., Ltd. develops, manufactures, and sells electronic components worldwide. It offers multilayer ceramic capacitors for use in smartphones, automobiles, and other devices; ferrite and applied products, such as inductors used in electronic equipment power and high-frequency circuits; integrated modules and devices, including film bulk acoustic resonator/surface acoustic wave devices for mobile communications and power supply modules; and other electronic components, such as energy devices used as backup power equipment for smart meters and other similar products, as well as peak current assistance for LED flashes. The company also provides noise suppression parts, such as bead inductors, common-mode choke coils, multilayer EMI suppression filters, and ring varistors; chip antennas; balun transformers; wireless modules; and aluminum electrolytic capacitors. Taiyo Yuden Co., Ltd. was founded in 1950 and is headquartered in Tokyo, Japan.",
    "website": "http://www.ty-top.com",
    "zipcode": "104-0031"
  },
  "6977.T": {
    "city": "Nanto",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Japan Resistor Mfg. Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "JAPAN RESISTOR MANUFACTURING CO",
    "state": null,
    "summary": "Japan Resistor Mfg. Co., Ltd. develops, manufactures, and sells electronic devices, sensor compound apparatuses, hybrid ICs, SMC products, sensors, potentiometers, heaters, and various resistors in Japan and internationally. It offers fixed resistors that include nonflammable PCB mounting type, square cement type, shunt, precision, power type, metal-clad fixed, film, and platinum thin-film temperature sensor, as well as wire-wound variable resistors, and resistors for various industries and car electronics. The company also provides laminate film and silicone-rubber heaters; and wire-wound multi-turn potentiometers, wire-wound single-turn potentiometers, rotary-type potentiometers, printed resistance elements, print resistance sensors, dual signal potentiometers, and contactless potentiometers, as well as hybrid integrated circuits. In addition, it offers circuit boards and units, including household equipment, such as heated toilet seats with heated bidets and warm air dryers; control equipment related to automobile electronics; electrical farm apparatus comprising moisture meters and color selectors for management and selection of rice quality; health and beauty equipment; and power supply equipment for air conditioners, and office and factory automation. The company was founded in 1943 and is based in Nanto, Japan.",
    "website": "http://www.jrm.co.jp",
    "zipcode": "939-1897"
  },
  "6981.T": {
    "city": "Nagaokakyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Murata Manufacturing Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "MURATA MANUFACTURING CO",
    "state": null,
    "summary": "Murata Manufacturing Co., Ltd. designs, manufactures, and sells electronic components and related products in Japan and internationally. It operates through Components, Modules, and Others segments. The company offers capacitors, inductors, noise suppression products/EMI suppression filters/ESD protection devices, resistors, thermistors, sensors, timing devices, quartz devices, sound components, power products, batteries, micro mechatronics, RFID devices, matching devices, baluns, couplers, filters, phase shifters, RF switches, front-end modules, SAW components, connectors, antennas, connectivity modules, wireless connectivity platforms, ionizers/active oxygen modules, and digital panel meters. It provides its products for use in medical and healthcare equipment, mobile communications, industrial equipment, white goods, business machines, personal computers, and AV equipment, as well as smart home, automotive, network, data center, lighting, security and safety, and AI speaker and hearable applications. The company was founded in 1944 and is headquartered in Nagaokakyo, Japan.",
    "website": "http://www.murata.com",
    "zipcode": "617-8555"
  },
  "6986.T": {
    "city": "Mobara",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Futaba Corporation",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "FUTABA CORP",
    "state": null,
    "summary": "Futaba Corporation designs, develops, manufactures, and sells electronic equipment, radio control equipment, and manufacturing equipment in Japan, the United States, Europe, and Asia. It operates through Electronic Devices; and Machinery and Tooling segments. The company provides organic light-emitting diode displays, vacuum fluorescent displays, display modules, and touch panels; and engines and parts for models and robots. It also offers components for press die sets and mold bases, precision plates, and application plates, as well as equipment for automation; and touch sensors and molding rationalization equipment. Futaba Corporation was founded in 1948 and is headquartered in Mobara, Japan.",
    "website": "http://www.futaba.co.jp",
    "zipcode": "297-8588"
  },
  "6989.T": {
    "city": "Toyama",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Hokuriku Electric Industry Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "HOKURIKU ELECTRIC INDUSTRY CO",
    "state": null,
    "summary": "Hokuriku Electric Industry Co., Ltd. develops, manufactures, and sells electronic components in Japan and internationally. The company offers pressure sensors, force sensors, 3-axis acceleration sensors, pressure sensor modules, barometric pressure sensors, humidity sensors elements and modules; circuit modules; high frequency components; piezoelectric products; chip fixed resistors and network chip fixed resistors; and metal plate chip fixed resistors. It also provides fixed metal film, fixed metal oxide film, and fixed carbon film resistors; chip type and miniature cermet trimmer potentiometers; NTC thermistors; tactile switches; and printed circuit boards. The company's products are used in mobile communication, digital appliance/PC, car electronic, and home electronic applications. The company was founded in 1943 and is based in Toyama, Japan.",
    "website": "http://www.hdk.co.jp",
    "zipcode": "939-2292"
  },
  "6996.T": {
    "city": "Kyoto",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Nichicon Corporation",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "NICHICON CORP",
    "state": null,
    "summary": "Nichicon Corporation, together with its subsidiaries, develops, produces, and sells capacitors and circuit products for electric and electronic products in Japan, the U.S.A, Asia, and internationally. It offers chip type, miniature type, and large can type aluminum electrolytic capacitors; conductive polymer aluminum solid electrolytic capacitors; and electric double layer capacitors, plastic film capacitors, positive thermistors, function and power modules, and inverter smoothing capacitors. The company also provides household energy storage systems; vehicle-to-home systems; EV quick chargers; power storage systems for public and industrial use; switching power supplies; power sources for medical accelerators and academic study accelerators; voltage sag compensators; and power outage compensators. Its products have applications in energy, the environment, and medical equipment; automotive and railway-car related appliances; household electrical appliances and industrial inverters; and information and communications equipment. The company was formerly known as Nichicon Capacitor Ltd. and changed its name to Nichicon Corporation in October 1987. Nichicon Corporation was founded in 1950 and is headquartered in Kyoto, Japan.",
    "website": "http://www.nichicon.co.jp",
    "zipcode": "604-0845"
  },
  "6999.T": {
    "city": "Nagano",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "KOA Corporation",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "KOA CORPORATION",
    "state": null,
    "summary": "KOA Corporation develops, manufactures, and sells electronic components in Japan and internationally. The company offers thermistors, thermal sensors, inductors, fuses, varistors, LTCC substrates, hybrid IC, and check terminals, as well as SMD resistors, low resistance/current sense shunt, and leaded resistors. Its products are used in automotive, industrial equipment, ecology and energy saving, telecommunication, AV/home appliance, power supply unit, space/satellite, and medical equipment applications. The company was formerly known as Koa Denko Co., Ltd. and changed its name to KOA Corporation in April 1985. The company was founded in 1940 and is headquartered in Nagano, Japan.",
    "website": "http://www.koaglobal.com",
    "zipcode": null
  },
  "6DX.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Components",
    "long_name": "Dexerials Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "DEXERIALS CORP.",
    "state": null,
    "summary": "Dexerials Corporation manufactures and sells electronic components, bonding materials, optics materials, and other products in Japan. The company offers anisotropic conductive films, industrial adhesives, double and single coated tapes, thermal conductive sheets, architectural window films, optical elasticity resins, inorganic wave plates, optical films, inorganic diffusers and polarizers, and anti-reflection films, as well as UV curable resins for optical disks. It also provides surface mounted type fuses and water treatment agents for inorganic effluent; and solar cell conductive films for photovoltaic modules. The company was formerly known as Sony Chemical & Information Device Corporation and changed its name to Dexerials Corporation in September 2012. Dexerials Corporation was founded in 1962 and is headquartered in Tokyo, Japan.",
    "website": "http://www.dexerials.jp",
    "zipcode": "141-0032"
  },
  "6X5.F": {
    "city": "Owariasahi",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Components",
    "long_name": "Maruwa Co., Ltd.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "MARUWA CO. LTD.",
    "state": null,
    "summary": "Maruwa Co., Ltd. produces and sells ceramics and electronic parts in Japan, Europe, the United States, China, Taiwan, Korea, Malaysia, and India. The company offers ceramics, including ceramic substrates and fillers, metalized/multilayer ceramic substrates, and pressed ceramic products, as well as ceramic hermetic seals and SiC components; and electronic components/devices, such as antennas, EMC and RF components, inductors, and capacitors. It also provides quartz glass products; and LED lighting products comprising LED modules and components. The company offers its products for use in mobile and network, LED, automotive electronics, RF, power electronics, IT and consumer electronics, semiconductor equipment, medical, power electronics, 5G, and TIM and TPH applications, as well as insulation parts. The company was formerly known as Maruwa Ceramic Co., Ltd. and changed its name to Maruwa Co., Ltd. in 1999. Maruwa Co., Ltd. was incorporated in 1973 and is headquartered in Owariasahi, Japan.",
    "website": "http://www.maruwa-g.com",
    "zipcode": "488-0044"
  },
  "6X8.F": {
    "city": "Kyoto",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Components",
    "long_name": "Nissha Co., Ltd.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "NISSHA CO. LTD.",
    "state": null,
    "summary": "Nissha Co., Ltd. engages in industrial materials, devices, medical technologies, and information and communication in Japan and internationally. The company provides in-mold decoration technology, in-mold electronics, transfer foil, printed electronics, molding, CMF design sample book; metallized paper for packaging and labels, wrapping, direct food contact, and innerliners; and material consulting; provide sensing technologies for various markets, such as smartphones and automotive. It also offers force and gas sensors; and finished products. In addition, it design medical device; manufacturing services; healthcare product solutions; custom labeled medical products; and support communication activities. The company was formerly known as Nissha Printing Co., Ltd. and changed its name to Nissha Co., Ltd. in October 2017. Nissha Co., Ltd. was founded in 1929 and is headquartered in Kyoto, Japan.",
    "website": "http://www.nissha.com",
    "zipcode": "604-8551"
  },
  "7213.T": {
    "city": "Motosu",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Lecip Holdings Corporation",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "LECIP HLDG CORP",
    "state": null,
    "summary": "Lecip Holdings Corporation plans, designs, manufactures, and sells lighting, electric power conversion, and information processing equipment for buses, trains, automobiles, and industrial equipment in Japan and internationally. The company offers transport equipment for bus, including automated fare collection system, transit management system, validator, farebox, LCD and LED destination display, and interior light; LED light, light guide panel LEDs, and fluorescent light products for rail; and automobile lighting products. It also provides industrial equipment, such as uninterruptible power supplies, rechargers for battery-driven forklift, power supply units for LED, and neon and ignition transformers; and alpha and engine generator controllers. The company was formerly known as LECIP Corporation and changed its name to Lecip Holdings Corporation in October 2010. Lecip Holdings Corporation was founded in 1948 and is headquartered in Motosu, Japan.",
    "website": "http://www.lecip.co.jp",
    "zipcode": "501-0401"
  },
  "7433.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Hakuto Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "HAKUTO CO LTD",
    "state": null,
    "summary": "Hakuto Co., Ltd. distributes electronic products in Japan and internationally. It provides semiconductor devices; and electronic components comprising photovoltaic panels, connectors, optical measurement and communication products, wireless communication testers, and cable solutions, as well as EMI, thermal, antenna and reception, and wireless M2M and telematics solutions. The company also offers electronic and electric equipment, including photovoltaic manufacturing equipment, semiconductor equipment, compound semiconductor equipment, equipment for FPD, nanotechnology equipment, vacuum systems and components, optical equipment, scientific equipment, physics and water equipment, equipment for PWB and PCB, measurement systems, storage device equipment, and air purifiers. In addition, it provides refinery chemicals, such as corrosion inhibitors, antifoulants, and emulsion breakers; petrochemicals that include polymerization inhibitors; pulp and paper chemicals comprising defoamers, deposit control aids/detergents, felt conditioners, biocides/preservatives, lime mud dewatering aids, and craping aids; cooling water treatment additives; boiler chemicals, such as oxygen scavengers, corrosion inhibitors, and boiler internal treatment chemicals; cosmetics, including alcasealan and smetics; and automotive chemicals comprising over-sprayed detackifiers. Further, the company manufactures and sells high precision plastics; provides administration and logistics services; and develops and sells cosmetic raw materials, and OEM products. Hakuto Co., Ltd. was founded in 1953 and is headquartered in Tokyo, Japan.",
    "website": "http://www.hakuto.co.jp",
    "zipcode": "160-8910"
  },
  "7613.T": {
    "city": "Osaka",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "SIIX Corporation",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "SIIX CORP",
    "state": null,
    "summary": "SIIX Corporation engages in the parts procurement, logistics, trading, and electronics manufacturing services in Japan and internationally. It handles components, modules, circuit board mountings, finished articles, etc. that are incorporated in products used in automobile related equipment, industrial devices, household electrical appliances, information equipment, general electronic parts, and others. The company also offers design for manufacturability technical support services; and design for localization services. In addition, it offers various logistics services, including kitting, vendor managed inventory, and just in time to support the inventory management systems; and joint design and manufacturing services. SIIX Corporation was founded in 1957 and is headquartered in Osaka, Japan.",
    "website": "http://www.siix.co.jp",
    "zipcode": "541-0051"
  },
  "7713.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Sigmakoki Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "SIGMA KOKI CO LTD",
    "state": null,
    "summary": "SigmaKoki Co., Ltd. provides laser components, units, and systems in Japan. The company offers opto-mechanics/manual stages and holders, bases, holders, light sources and laser safety products, actuators and adjusters, etc.; optics/coating products, including mirrors, beam splitters, polarizers, laser crystals and nonlinear crystals, lenses, multi-element optics, filters, prisms, and substrates/windows; motion control application systems comprising automatic positioning devices, optical measurement devices, and software for positioning and measurement; and laser system products, such as laser direct lithographic systems, high-speed laser processing systems for micro-fabrication, and hybrid laser processing systems. It also provides bio-related products, including microabration and micromanipuration systems, and XY motorized stage systems for microscope; and optical application system products, such as laser application system products, and contracted and custom-made products. In addition, the company offers zoom microscopes, auto-focusing systems, interferometers, power supplies, and optical system components. SigmaKoki Co., Ltd. was founded in 1977 and is headquartered in Tokyo, Japan.",
    "website": "http://www.sigma-koki.com",
    "zipcode": "130-0021"
  },
  "7744.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Noritsu Koki Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "NORITSU KOKI CO",
    "state": null,
    "summary": "Noritsu Koki Co., Ltd. engages in manufacturing and healthcare businesses in Japan and internationally. The company provides DJ equipment; pen tips and brush bristles; medical database, remote image diagnosis, preventive medicine, and factoring services, as well as consulting for medical care and nursing care business providers; and systems to manage insurance pharmacies. It also offers its products through internet. The company was formerly known as Noritsu Optical Machinery Works Limited and changed its name to Noritsu Koki Co., Ltd. in 1961. Noritsu Koki Co., Ltd. was founded in 1951 and is headquartered in Tokyo, Japan.",
    "website": "http://www.noritsu.co.jp",
    "zipcode": "106-0045"
  },
  "7746.T": {
    "city": "Kashiwa",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Okamoto Glass Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "OKAMOTO GLASS CO LTD",
    "state": null,
    "summary": "Okamoto Glass Co., Ltd. manufactures and sells special-purpose glass for industrial use and multi-layer film evaporation products. The company offers glass materials, glass molded items, optical/functional coating products, glass bulbs/oceanic spacecraft products, glass frits, and glass winding robots and optical simulation products. Its products are used in mobility, display, telecommunication, sensor/IOT, medical, illumination, energy, and infrastructure/residence applications. Okamoto Glass Co., Ltd. was founded in 1928 and is headquartered in Kashiwa, Japan.",
    "website": "http://ogc-jp.com",
    "zipcode": "277-0872"
  },
  "7836.T": {
    "city": "Yokohama",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "AVIX,Inc.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "AVIX INC",
    "state": null,
    "summary": "AVIX,Inc. develops and sells LED indicators in Japan. It also provides LED display machine leasing and rental services; and video content, maintenance services, etc. The company was incorporated in 1989 and is headquartered in Yokohama, Japan.",
    "website": "http://www.avix.co.jp",
    "zipcode": "220-8129"
  },
  "7859.T": {
    "city": "Kunitachi",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Almedio Inc.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "ALMEDIO INC",
    "state": null,
    "summary": "Almedio Inc. engages in the research, development, manufacture, and sale of test tapes and test discs in Japan. The company is also involved in the manufacture and sale of measuring instruments for optical media; sub-materials for electronic parts, refractory materials, and related products; industrial equipment for the optical disc drives; and nano material products comprising carbon nano and micro fiber for reinforcement and conductivity, and synthetic graphene powder, as well as in selling optical disc archive solutions. In addition, it provides attestation tests for the DVD verification laboratory; and tests for various kinds of discs. The company was formerly known as A-BEX and changed its name to Almedio Inc. in March 1997. Almedio Inc. was incorporated in 1981 and is based in Kunitachi, Japan.",
    "website": "http://www.almedio.co.jp",
    "zipcode": "186-0002"
  },
  "7902.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Sonocom Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "SONOCOM CO LTD",
    "state": null,
    "summary": "Sonocom Co.,Ltd. manufactures and sells screen printing plates, printing materials, and machinery and equipment for electronics industry in Japan. The company offers screen masks, metal masks, photomasks, screen printing equipment, rotary screens, and print experiment products. The company was formerly known as Sowano Industrial Co., Ltd. and changed its name to Sonocom Co.,Ltd. in April 1990. Sonocom Co.,Ltd. was incorporated in 1962 and is headquartered in Tokyo, Japan.",
    "website": "http://www.sonocom.co.jp",
    "zipcode": null
  },
  "7908.T": {
    "city": "Saitama",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Kimoto Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "KIMOTO CO LTD",
    "state": null,
    "summary": "Kimoto Co., Ltd. engages in the manufacture and sale of various film and paper products in Japan and internationally. The company offers hard coat films for use as a surface material for membrane switches; hard coat, optical, shatter-proof decorative, and conductive films for enhancing touch screen functionality; light diffusion and reflection films for LED, OLED, and LCD displays; and separator, resin based processing, process protection, photomask protection, release, and other films for various manufacturing process needs. It also provides window decoration, release, screen printing, large format printer, inkjet output, laser printer output, offset printing, and sandblasting films for various printing and output needs; design films for decorating glass, shatter proof films, sticker films for printers, and transparent roll up screens; and conductive anti-dazzle films for camera lens parts. In addition, the company offers spatial information and image editing/system development services for 3D point group data acquired from laser scanning surveys, and 2D map data utilized for surveys and land registration. Further, it is involved in the processing of computer information, and development and sale of software; production, processing, and sale of agricultural products; sale of alcoholic beverages; and consulting and publishing businesses. Kimoto Co., Ltd. was founded in 1952 and is headquartered in Saitama, Japan.",
    "website": "http://www.kimoto.co.jp",
    "zipcode": "338-0013"
  },
  "7915.T": {
    "city": "Kyoto",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Nissha Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "NISSHA CO LTD",
    "state": null,
    "summary": "Nissha Co., Ltd. engages in industrial materials, devices, medical technologies, and information and communication in Japan and internationally. The company provides in-mold decoration technology, in-mold electronics, transfer foil, printed electronics, molding, CMF design sample book; metallized paper for packaging and labels, wrapping, direct food contact, and innerliners; and material consulting; provide sensing technologies for various markets, such as smartphones and automotive. It also offers force and gas sensors; and finished products. In addition, it design medical device; manufacturing services; healthcare product solutions; custom labeled medical products; and support communication activities. The company was formerly known as Nissha Printing Co., Ltd. and changed its name to Nissha Co., Ltd. in October 2017. Nissha Co., Ltd. was founded in 1929 and is headquartered in Kyoto, Japan.",
    "website": "http://www.nissha.com",
    "zipcode": "604-8551"
  },
  "7927.T": {
    "city": "Kakamigahara",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Muto Seiko Co.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "MUTO SEIKO CO",
    "state": null,
    "summary": "Muto Seiko Co. manufactures and sells plastic parts worldwide. It offers plastic parts for digital home appliances, such as digital and video cameras; and center panel units, including car navigation systems, air conditioners, audio, and automobile-related parts, as well as molds for injection molding and presses. The company was founded in 1956 and is headquartered in Kakamigahara, Japan.",
    "website": "http://www.muto.co.jp",
    "zipcode": "509-0147"
  },
  "8159.T": {
    "city": "Osaka",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Tachibana Eletech Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "TACHIBANA ELETECH CO LTD.",
    "state": null,
    "summary": "Tachibana Eletech Co., Ltd. operates as a technology-driven trading company in Japan and internationally. The company operates through Factory Automation System, Semiconductors and Electronic Devices, Building Services Systems, Manufacturing Services, and Overseas Operations segments. The Factory Automation Systems segment sells programmable controllers, inverters, AC servos, motors, power distribution control equipment and control devices, industrial robots, electric discharge machines, laser beam machines, machine tools, digital connection devices, connectors, embedded systems, industrial computers, and touch panels. The Semiconductors and Electronic Devices segment offers semiconductors comprising microcomputers, ASICs, power devices, memory modules, and analog and logic ICs; and electronic devices, such as memory cards, contact image sensors, and LCDs. The Building Services Systems segment provides package air conditioners and other air-conditioning equipment, LED lightings, photovoltaic power generation systems, electrical appliances, room air-conditioners, elevators, power receiving/transformation equipment, and monitoring and controlling equipment. The Manufacturing Services segment provides metal manufacturing services, such as structural members and pallets for multilevel car parking towers and piping members for ships; and electronics manufacturing services for controllers of water heaters, remote controllers for air-conditioners, etc., as well as passenger car truck closures. The Overseas Operations segment engages in the sale of industrial mechatronics products, including semiconductors, electronic devices, FA equipment, and electric discharge machines. The company was founded in 1921 and is headquartered in Osaka, Japan.",
    "website": "http://www.tachibana.co.jp",
    "zipcode": "550-8555"
  },
  "90G.F": {
    "city": "Kakogawa",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Components",
    "long_name": "Daishinku Corp.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "DAISHINKU CORP.",
    "state": null,
    "summary": "Daishinku Corp. manufactures and sells electronic components and equipment in Japan and internationally. The company offers crystal resonators, crystal and MEMS oscillators, monolithic crystal filters, optical quartz products, and hermetic seal products. Its products are used in various applications, including wearable devices, smart phones/mobile phones, IoT/M2M, wireless communication, network, automotive electronics, information communication equipment, audio and visual equipment, gaming equipment, and FA equipment. Daishinku Corp. was founded in 1959 and is headquartered in Kakogawa, Japan.",
    "website": "http://www.kds.info",
    "zipcode": "675-0194"
  },
  "9867.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Solekia Limited",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "SOLEKIA LIMITED",
    "state": null,
    "summary": "Solekia Limited provides technological solutions for various business fields in Japan and internationally. The company develops and sells semiconductors, other component devices, network storage equipment, and value-added products and services; provides service integration business solutions in consulting, construction, operation, and maintenance; ICT solutions, including ERP, BCP, environment, and energy-saving; and IT infrastructure design, construction, system monitoring, help desk, BCP drafting, and disaster recovery services. It also sells PCs for companies, various servers, networking equipment, etc.; various electronic devices and components; and RFID, sensor devices, smart grid, and related products, as well as various components, ASIC, and general-purpose LSIs. In addition, the company provides business, networking, system, and LSI design consultation services; and develops business applications, control systems, communication software, embedded software, cloud systems, and firmware. Further, it offers application management services, such as web service, legacy migration, maintenance, and training; SI solutions comprising SCM, CRM, ERP, global accounting system, etc.; network solution services that include secure network and VPN; outsourcing services, which comprise help desk, housing, and hosting; and data center and IDC services. Additionally, the company provides field services, including maintenance, infrastructure construction, operative, security, kitting, and data backup and recovery. It primarily serves government municipal offices, local government authorities, agricultural cooperatives, and consumers' cooperative associations, as well as financial, healthcare, manufacturing, distribution, and other industries. The company was formerly known as Kobayashi Denshi Sangyo Co., Ltd. and changed its name to Solekia Limited in April 2002. Solekia Limited was incorporated in 1958 and is headquartered in Tokyo, Japan.",
    "website": "http://www.solekia.com",
    "zipcode": "144-8626"
  },
  "9909.T": {
    "city": "Odawara",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Aiko Corporation",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "AIKO CORP",
    "state": null,
    "summary": "Aiko Corporation engages in the sale and repair of electric material products and machinery in Japan. The company offers lighting fixtures, electric wires/pipes, wiring materials, switchgears, boards, control equipment, home electronics, electric appliances, IT related peripheral equipment, and other products. It also undertakes fixture installation and incidental works; and designs and constructs electrical products, machinery, and equipment. The company was founded in 1951 and is headquartered in Odawara, Japan.",
    "website": "http://www.aiko-denki.co.jp",
    "zipcode": "250-0293"
  },
  "9913.T": {
    "city": "Nagoya",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Nippo Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "NIPPO LTD",
    "state": null,
    "summary": "Nippo Ltd. manufactures and trades in industrial components and materials in Japan and internationally. It operates through Mobility, Electronics, Medical and Precision Device, and Others segments. The company provides functional materials, parts, jigs, and equipment for customers related to electronic parts and clean energy; and IC cards and tags, and affiliated system devices for customers related to radio-frequency identification devices. It also offers resin moldings and assemblies centering on electronic control associated parts for automakers and automobile parts makers. In addition, the company provides resin molding, painting, printing, and assembly products for office automation, drug information, and medical equipment; window shade controls, resin pipe parts, water heaters, and functional materials for housing equipment; electrical and electronic parts; semiconductors; precision equipment, including office automation and audio/video equipment; and industrial motor mechanism elements. Further, it offers mechatronics design, analysis, and assessment services. Nippo Ltd. was founded in 1940 and is headquartered in Nagoya, Japan.",
    "website": "http://www.nip.co.jp",
    "zipcode": "460-0003"
  },
  "9960.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Electronic Components",
    "long_name": "Totech Corporation",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "TOTECH CORP",
    "state": null,
    "summary": "Totech Corporation engages in the sale of air conditioning equipment and control system equipment in Japan. The company offers services for managing facility environment to various customers, including building owners, users, and managers; and equipment facilities and instruments for institutions, as well as creates, accumulates, and serves energy. It also undertakes construction control of various electric equipment and repair works of public institutions, commercial institutions, and factories. The company offers environment systems in the field of public institutions, business offices, factories, shops and houses; and sells and maintains instrumentation devices. The company was founded in 1955 and is headquartered in Tokyo, Japan.",
    "website": "http://www.totech.co.jp",
    "zipcode": "103-0023"
  },
  "9IE.F": {
    "city": "Sagamihara",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Components",
    "long_name": "Ohara Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "OHARA INC.",
    "state": null,
    "summary": "Ohara Inc. manufactures and sells glass materials for optical and electronics applications in Japan and internationally. It offers optical glass/eco-optical glass, low Tg optical glasses for glass mold lens, and high transmission and low photoelastic constant glass; and electronics products, such as ultra low expansion glass-ceramics, glass-ceramic substrate for DWDM thin-film filters, glass disk for magnetic head flying height testers, lithium-ion conductive glass-ceramics, fiber glasses for light guide, i-line high homogeneity glass, glass for art, measurement service on glasses/ceramics, and quartz glass. The company also provides measurement and analysis services on characteristics of optical materials. Ohara Inc. was founded in 1935 and is headquartered in Sagamihara-Shi, Japan.",
    "website": "http://www.ohara-inc.co.jp",
    "zipcode": "252-5286"
  },
  "AN1.F": {
    "city": "Atsugi",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Components",
    "long_name": "Anritsu Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "ANRITSU CORP.",
    "state": null,
    "summary": "Anritsu Corporation develops, manufactures, and sells measurement instruments and systems for various communications applications in Japan and internationally. The company operates through Test and Measurement, Products Quality Assurance, and Others segments. The Test and Measurement segment offers measuring instruments for mobile phone acceptance testing by mobile phone service providers; and for design, production, function and performance verification, and maintenance of mobile phone handsets by manufacturers of mobile phones, including smartphones, IC chipsets, and relevant components. This segment also provides network construction, maintenance, monitoring, and service quality assurance solutions for wireline and wireless service operators; and measuring instruments for design, production, and evaluation of electronic devices used in telecommunications network-related communications equipment and other electronic equipment. The Products Quality Assurance segment offers highly precise checkweighers; X-ray and other inspection systems that detect and remove metal fragments, stones, and other alien materials in the food processing process. The Others segment engages in the information and communications, devices, logistics, welfare services, real estate leasing, and other businesses. Anritsu Corporation was founded in 1895 and is headquartered in Atsugi, Japan.",
    "website": "http://www.anritsu.com",
    "zipcode": "243-8555"
  },
  "EPK.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Components",
    "long_name": "Enplas Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "ENPLAS CORP.",
    "state": null,
    "summary": "Enplas Corporation engages in the engineering plastic, semiconductor peripherals, plastic optical businesses in Japan and internationally. It offers mechanical solutions, including gears and fluid control products; semiconductor solutions comprising general-purpose IC sockets; optical solutions, such as optical devices that include lens array for parallel communications and plastic barrels; LED solutions, including controlling LED lights; and life science products comprising microfluidic chips, endotoxin-free products, and other life science-related products. The company was founded in 1962 and is headquartered in Tokyo, Japan.",
    "website": "http://www.enplas.co.jp",
    "zipcode": "100-0005"
  },
  "GIK.MU": {
    "city": "Matsudo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "MUN",
    "industry": "Electronic Components",
    "long_name": "SEIKOH GIKEN Co., Ltd.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "SEIKOH GIKEN CO.",
    "state": null,
    "summary": "SEIKOH GIKEN Co., Ltd. designs, manufactures, and sells optical components and radio over fiber products in Japan and internationally. It offers precision and optical disc molds; injection molded components and precise manufacturing technology products; and optical communication components, such as interconnect parts, connectors, ferrules, adaptors, jumper cables, optical packaging parts, attenuators, and crimping tools, as well as uniboot connectors. The company also provides optical manufacturing equipment, interferometers, endface cleaners, and field use equipment; lens; isotropic optical e-field sensor heads/optical probe heads, and optical probes for malfunction noise; and X-ray CT scanners, as well as non-destructive testing services. SEIKOH GIKEN Co., Ltd. was founded in 1972 and is headquartered in Matsudo, Japan.",
    "website": "http://www.seikoh-giken.co.jp",
    "zipcode": "270-2214"
  },
  "HPHTF": {
    "city": "Hamamatsu",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Electronic Components",
    "long_name": "Hamamatsu Photonics K.K.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "HAMAMATSU PHOTONICS",
    "state": null,
    "summary": "Hamamatsu Photonics K.K. manufactures and sells photomultiplier tubes, imaging devices, light sources, opto-semiconductors, and imaging and analyzing systems in Japan and internationally. The company operates through three segments: Electron Tube, Opto-Semiconductor, and Imaging and Measurement Instruments. The Electron Tube segment provides photomultiplier tubes, electron multipliers, microchannel plates, image intensifiers, X-ray products, and various light sources for use in medical, chemical analysis, measurement, industrial testing, and academic research applications. The Opto-Semiconductor segment offers silicon photodiodes, photo IC components, position sensitive and infrared detectors, image sensors for low-light-level imaging and X-ray imaging, mini-spectrometers, and light emitting devices for applications in medical imaging, high-energy physics, and scientific measurement. The Imaging and Measurement Instruments segment provides a range of cameras for scientific and industrial applications, as well as specialized instruments for use in the fields of pharmaceutical development, semiconductor manufacturing, X-ray nondestructive inspection, spectrophotometry, and optical communications. Hamamatsu Photonics K.K. is also involved in the semiconductor laser and hotel operation businesses. The company was formerly known as Hamamatsu TV Co., Ltd. Hamamatsu Photonics K.K. was founded in 1953 and is headquartered in Hamamatsu, Japan.",
    "website": "http://www.hamamatsu.com",
    "zipcode": "430-8587"
  },
  "HRO.F": {
    "city": "Yokohama",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Components",
    "long_name": "Hirose Electric Co.,Ltd.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "HIROSE EL.",
    "state": null,
    "summary": "Hirose Electric Co.,Ltd. manufactures and sells various types of connectors in Japan and internationally. The company offers multi-pin connectors, including circular and rectangular connectors; connectors for ribbon cables; connectors used for printed circuit boards comprising flexible printed circuit boards; and nylon connectors for use in a range of fields, such as smartphones, communications equipment, and automotive electronics, as well as in industrial fields, such as measuring and control equipment, FA equipment, and medical electronics equipment. It also provides coaxial connectors for microwave and other high-frequency signals; and optical fiber connectors and coaxial switches used in various applications, which include microwave communications devices, satellite communications equipment, electronic measuring instruments, smartphones, switching and transmission equipment, and other electronic equipment. In addition, Hirose Electric Co.,Ltd. provides micro switches and instruments for connectors. The company was formerly known as Hirose Manufacturing Co., Ltd. and changed its name to Hirose Electric Co.,Ltd. in August 1963. Hirose Electric Co.,Ltd. was founded in 1937 and is headquartered in Tokyo, Japan.",
    "website": "http://www.hirose.com",
    "zipcode": "224-8540"
  },
  "HROEY": {
    "city": "Yokohama",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Electronic Components",
    "long_name": "Hirose Electric Co.,Ltd.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "HIROSE ELECTRIC CO SPON ADS EAC",
    "state": null,
    "summary": "Hirose Electric Co.,Ltd. manufactures and sells various types of connectors in Japan and internationally. The company offers multi-pin connectors, including circular and rectangular connectors; connectors for ribbon cables; connectors used for printed circuit boards comprising flexible printed circuit boards; and nylon connectors for use in a range of fields, such as smartphones, communications equipment, and automotive electronics, as well as in industrial fields, such as measuring and control equipment, FA equipment, and medical electronics equipment. It also provides coaxial connectors for microwave and other high-frequency signals; and optical fiber connectors and coaxial switches used in various applications, which include microwave communications devices, satellite communications equipment, electronic measuring instruments, smartphones, switching and transmission equipment, and other electronic equipment. In addition, Hirose Electric Co.,Ltd. provides micro switches and instruments for connectors. The company was formerly known as Hirose Manufacturing Co., Ltd. and changed its name to Hirose Electric Co.,Ltd. in August 1963. Hirose Electric Co.,Ltd. was founded in 1937 and is headquartered in Tokyo, Japan.",
    "website": "http://www.hirose.com",
    "zipcode": "224-8540"
  },
  "IBI.F": {
    "city": "Ogaki",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Components",
    "long_name": "Ibiden Co.,Ltd.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "IBIDEN CO.LTD",
    "state": null,
    "summary": "Ibiden Co.,Ltd. provides electronic and ceramics products in Japan, Asia, North America, Europe, and internationally. It operates through Electronics, Ceramics, and Construction segments. The company offers IC package substrate for use in data centers, personal computers, automotive electronics, and entertainment; printed circuit board for smart phones, data centers, and automotive electronics applications; diesel particulate filters; and automobile exhaust system parts for use in automobiles, buses, trucks, construction vehicles, and agricultural machines. It also provides SCR Catalyst Substrates for diesel vehicles, power stations, marine engines, diesel locomotive, glasswork, and cement works applications; ceramic honeycomb substrates for heat storage media and casting filter applications; high temperature insulating wool; and graphite specialty products. In addition, the company engages in the manufacturing and selling of the decorative interior laminates; design and construction of facilities; environmental engineering technology business; medical software package development; sale of information and communication terminals; and sale of welfare vehicles. The company was formerly known as Ibigawa Electric Power Co., Ltd. and changed its name to Ibiden Co., Ltd. in November 1982. Ibiden Co., Ltd. was founded in 1912 and is headquartered in Ogaki, Japan.",
    "website": "http://www.ibiden.co.jp",
    "zipcode": "503-8604"
  },
  "IBIDF": {
    "city": "Ogaki",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Electronic Components",
    "long_name": "Ibiden Co.,Ltd.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "IBIDEN CO LTD",
    "state": null,
    "summary": "Ibiden Co.,Ltd. provides electronic and ceramics products in Japan, Asia, North America, Europe, and internationally. It operates through Electronics, Ceramics, and Construction segments. The company offers IC package substrate for use in data centers, personal computers, automotive electronics, and entertainment; printed circuit board for smart phones, data centers, and automotive electronics applications; diesel particulate filters; and automobile exhaust system parts for use in automobiles, buses, trucks, construction vehicles, and agricultural machines. It also provides SCR Catalyst Substrates for diesel vehicles, power stations, marine engines, diesel locomotive, glasswork, and cement works applications; ceramic honeycomb substrates for heat storage media and casting filter applications; high temperature insulating wool; and graphite specialty products. In addition, the company engages in the manufacturing and selling of the decorative interior laminates; design and construction of facilities; environmental engineering technology business; medical software package development; sale of information and communication terminals; and sale of welfare vehicles. The company was formerly known as Ibigawa Electric Power Co., Ltd. and changed its name to Ibiden Co., Ltd. in November 1982. Ibiden Co., Ltd. was founded in 1912 and is headquartered in Ogaki, Japan.",
    "website": "http://www.ibiden.co.jp",
    "zipcode": "503-8604"
  },
  "MAW.L": {
    "city": "Owariasahi",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "LSE",
    "industry": "Electronic Components",
    "long_name": "Maruwa Co., Ltd.",
    "market": "gb_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "MARUWA CO. LTD JPY50",
    "state": null,
    "summary": "Maruwa Co., Ltd. produces and sells ceramics and electronic parts in Japan, Europe, the United States, China, Taiwan, Korea, Malaysia, and India. The company offers ceramics, including ceramic substrates and fillers, metalized/multilayer ceramic substrates, and pressed ceramic products, as well as ceramic hermetic seals and SiC components; and electronic components/devices, such as antennas, EMC and RF components, inductors, and capacitors. It also provides quartz glass products; and LED lighting products comprising LED modules and components. The company offers its products for use in mobile and network, LED, automotive electronics, RF, power electronics, IT and consumer electronics, semiconductor equipment, medical, power electronics, 5G, and TIM and TPH applications, as well as insulation parts. The company was formerly known as Maruwa Ceramic Co., Ltd. and changed its name to Maruwa Co., Ltd. in 1999. Maruwa Co., Ltd. was incorporated in 1973 and is headquartered in Owariasahi, Japan.",
    "website": "http://www.maruwa-g.com",
    "zipcode": "488-0044"
  },
  "MEA.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Components",
    "long_name": "MinebeaMitsumi Inc.",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "MINEBEA MITSUMI INC.",
    "state": null,
    "summary": "MinebeaMitsumi Inc. manufactures and supplies machined components, and electronic devices and components in Japan, Europe, the United States, Asia, and internationally. It operates through three segments: Machined Components, Electronic Devices and Components, and MITSUMI Business. The Machined Components segment offers bearing products, including miniature and small sized ball bearings, rod end and spherical bearings, roller bearings, bushings, precision machined parts for aircraft, and medium- and large-sized ball bearings for aerospace use. It also provides bearing-related products, such as pivot assemblies and precision mechanical assemblies; and fasteners, defense related special components, and magnetic clutches and brakes. The Electronic Devices and Components segment offers rotary components comprising fan motors, blowers, hybrid type stepping motors, PM stepping motors, small diameter/high speed PM stepping motors, brush DC motors, small brushless motors, power brushless motors, polygon mirror scanner motors, HDD spindle motors, high-pressure blowers, rotation angle sensors, fan units, and FDB motors. It also provides lighting devices for LCDs; resonant devices; and measuring components comprising strain gages, force sensors, load cells, pressure sensors, torque transducers, vector sensors, digital indicators, and tensile and compression testing machines. The MITSUMI Business segment provides precision components, optical devices, power supply components, mechanical components, automotive products, and semiconductors. The company offers its products for use in household electrical appliances, information and telecommunications equipment, and automobiles. The company was formerly known as Minebea Co., Ltd. and changed its name to MinebeaMitsumi Inc. in January 2017. MinebeaMitsumi Inc. was founded in 1951 and is headquartered in Tokyo, Japan.",
    "website": "http://www.minebeamitsumi.com",
    "zipcode": "108-8330"
  },
  "MEC.F": {
    "city": "Ayase",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Components",
    "long_name": "Meiko Electronics Co., Ltd.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "MEIKO ELECTRONICS",
    "state": null,
    "summary": "Meiko Electronics Co., Ltd. engages in the design, manufacture, and sale of printed circuit boards (PCBs) and auxiliary electronics in Japan, rest of Asia, North America, Europe, and internationally. Its principal products include double-sided/multi-layer through-hole PCBs, HDI PCBs, flexible PCBs, flex-rigid PCBs, high electric current PCBs, heat dissipation PCBs, embedded devices PCBs, solder stencils, PCB testers, and imaging devices and systems. The company also provides circuit design and electronic manufacturing services. Its products have applications in the areas of automobiles, telecommunications, industrial devices, and amusement/home appliances. The company was formerly known as Meiko Denshi Kogyo Co., Ltd. and changed its name to Meiko Electronics Co., Ltd. in April 1991. Meiko Electronics Co., Ltd. was founded in 1975 and is headquartered in Ayase, Japan.",
    "website": "http://www.meiko-elec.com",
    "zipcode": "252-1104"
  },
  "MNBEY": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Electronic Components",
    "long_name": "MinebeaMitsumi Inc.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "MINEBEA MITSUMI INC",
    "state": null,
    "summary": "MinebeaMitsumi Inc. manufactures and supplies machined components, and electronic devices and components in Japan, Europe, the United States, Asia, and internationally. It operates through three segments: Machined Components, Electronic Devices and Components, and MITSUMI Business. The Machined Components segment offers bearing products, including miniature and small sized ball bearings, rod end and spherical bearings, roller bearings, bushings, precision machined parts for aircraft, and medium- and large-sized ball bearings for aerospace use. It also provides bearing-related products, such as pivot assemblies and precision mechanical assemblies; and fasteners, defense related special components, and magnetic clutches and brakes. The Electronic Devices and Components segment offers rotary components comprising fan motors, blowers, hybrid type stepping motors, PM stepping motors, small diameter/high speed PM stepping motors, brush DC motors, small brushless motors, power brushless motors, polygon mirror scanner motors, HDD spindle motors, high-pressure blowers, rotation angle sensors, fan units, and FDB motors. It also provides lighting devices for LCDs; resonant devices; and measuring components comprising strain gages, force sensors, load cells, pressure sensors, torque transducers, vector sensors, digital indicators, and tensile and compression testing machines. The MITSUMI Business segment provides precision components, optical devices, power supply components, mechanical components, automotive products, and semiconductors. The company offers its products for use in household electrical appliances, information and telecommunications equipment, and automobiles. The company was formerly known as Minebea Co., Ltd. and changed its name to MinebeaMitsumi Inc. in January 2017. MinebeaMitsumi Inc. was founded in 1951 and is headquartered in Tokyo, Japan.",
    "website": "http://www.minebeamitsumi.com",
    "zipcode": "108-8330"
  },
  "MRAAF": {
    "city": "Nagaokakyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Electronic Components",
    "long_name": "Murata Manufacturing Co., Ltd.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "MURATA MANUFACTURING CO",
    "state": null,
    "summary": "Murata Manufacturing Co., Ltd. designs, manufactures, and sells electronic components and related products in Japan and internationally. It operates through Components, Modules, and Others segments. The company offers capacitors, inductors, noise suppression products/EMI suppression filters/ESD protection devices, resistors, thermistors, sensors, timing devices, quartz devices, sound components, power products, batteries, micro mechatronics, RFID devices, matching devices, baluns, couplers, filters, phase shifters, RF switches, front-end modules, SAW components, connectors, antennas, connectivity modules, wireless connectivity platforms, ionizers/active oxygen modules, and digital panel meters. It provides its products for use in medical and healthcare equipment, mobile communications, industrial equipment, white goods, business machines, personal computers, and AV equipment, as well as smart home, automotive, network, data center, lighting, security and safety, and AI speaker and hearable applications. The company was founded in 1944 and is headquartered in Nagaokakyo, Japan.",
    "website": "http://www.murata.com",
    "zipcode": "617-8555"
  },
  "MRAAY": {
    "city": "Nagaokakyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Electronic Components",
    "long_name": "Murata Manufacturing Co., Ltd.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "MURATA MANUFACTURING CO",
    "state": null,
    "summary": "Murata Manufacturing Co., Ltd. designs, manufactures, and sells electronic components and related products in Japan and internationally. It operates through Components, Modules, and Others segments. The company offers capacitors, inductors, noise suppression products/EMI suppression filters/ESD protection devices, resistors, thermistors, sensors, timing devices, quartz devices, sound components, power products, batteries, micro mechatronics, RFID devices, matching devices, baluns, couplers, filters, phase shifters, RF switches, front-end modules, SAW components, connectors, antennas, connectivity modules, wireless connectivity platforms, ionizers/active oxygen modules, and digital panel meters. It provides its products for use in medical and healthcare equipment, mobile communications, industrial equipment, white goods, business machines, personal computers, and AV equipment, as well as smart home, automotive, network, data center, lighting, security and safety, and AI speaker and hearable applications. The company was founded in 1944 and is headquartered in Nagaokakyo, Japan.",
    "website": "http://www.murata.com",
    "zipcode": "617-8555"
  },
  "MUR1.F": {
    "city": "Nagaokakyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Components",
    "long_name": "Murata Manufacturing Co., Ltd.",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "MURATA MFG",
    "state": null,
    "summary": "Murata Manufacturing Co., Ltd. designs, manufactures, and sells electronic components and related products in Japan and internationally. It operates through Components, Modules, and Others segments. The company offers capacitors, inductors, noise suppression products/EMI suppression filters/ESD protection devices, resistors, thermistors, sensors, timing devices, quartz devices, sound components, power products, batteries, micro mechatronics, RFID devices, matching devices, baluns, couplers, filters, phase shifters, RF switches, front-end modules, SAW components, connectors, antennas, connectivity modules, wireless connectivity platforms, ionizers/active oxygen modules, and digital panel meters. It provides its products for use in medical and healthcare equipment, mobile communications, industrial equipment, white goods, business machines, personal computers, and AV equipment, as well as smart home, automotive, network, data center, lighting, security and safety, and AI speaker and hearable applications. The company was founded in 1944 and is headquartered in Nagaokakyo, Japan.",
    "website": "http://www.murata.com",
    "zipcode": "617-8555"
  },
  "NH4.F": {
    "city": "Kyoto",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Components",
    "long_name": "Nichicon Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "NICHICON CORP.",
    "state": null,
    "summary": "Nichicon Corporation, together with its subsidiaries, develops, produces, and sells capacitors and circuit products for electric and electronic products in Japan, the U.S.A, Asia, and internationally. It offers chip type, miniature type, and large can type aluminum electrolytic capacitors; conductive polymer aluminum solid electrolytic capacitors; and electric double layer capacitors, plastic film capacitors, positive thermistors, function and power modules, and inverter smoothing capacitors. The company also provides household energy storage systems; vehicle-to-home systems; EV quick chargers; power storage systems for public and industrial use; switching power supplies; power sources for medical accelerators and academic study accelerators; voltage sag compensators; and power outage compensators. Its products have applications in energy, the environment, and medical equipment; automotive and railway-car related appliances; household electrical appliances and industrial inverters; and information and communications equipment. The company was formerly known as Nichicon Capacitor Ltd. and changed its name to Nichicon Corporation in October 1987. Nichicon Corporation was founded in 1950 and is headquartered in Kyoto, Japan.",
    "website": "http://www.nichicon.co.jp",
    "zipcode": "604-0845"
  },
  "NPG.F": {
    "city": "Otsu",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Components",
    "long_name": "Nippon Electric Glass Co., Ltd.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "NIPPON EL. GLASS",
    "state": null,
    "summary": "Nippon Electric Glass Co., Ltd. manufactures and sells specialty glass products and glassmaking machinery in Japan, China, South Korea, the United States, Europe, and internationally. The company offers glasses substrates for FPD; glasses for chemical strengthening; glass fibers; thin film coatings; and glasses for optical devices and electronic devices. The company also provides heat-resistant glasses; glass tubing for lighting, and pharmaceutical and medical use; and glasses for building materials. Nippon Electric Glass Co., Ltd. was incorporated in 1944 and is headquartered in Otsu, Japan.",
    "website": "http://www.neg.co.jp",
    "zipcode": "520-8639"
  },
  "OMRNY": {
    "city": "Kyoto",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Electronic Components",
    "long_name": "OMRON Corporation",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "OMRON CORP",
    "state": null,
    "summary": "OMRON Corporation engages in industrial automation, electronic and mechanical components, social systems, and healthcare businesses worldwide. The company's Industrial Automation Business offers sensors, switches, safety and control components, relays, automation systems, motion/drives, robotics, energy conservation support/environment measure equipment, and power supplies. Its Electronic and Mechanical Components Business provides relays, switches, connectors, sensors, and components/units for amusement equipment. The company's Social Systems, Solutions and Service Business offers terminals and systems, including PV inverters and storage batteries; railway station systems, such as automated ticket gates and ticket vending machines, traffic and road management systems, payment systems, and UPS that protect equipment from unexpected power disruption; and transport management systems and infrastructure monitoring systems, as wells provides a range of solutions comprising software development and maintenance services to support the social infrastructure. Its Healthcare Business offers blood pressure monitors, nebulizers, electrotherapy TENS devices, digital thermometers, body composition monitors, and other products, such as activity monitors, AEDs, etc. The company was formerly known as OMRON Tateisi Electronics Co. and changed its name to OMRON Corporation in January 1990. OMRON Corporation was founded in 1933 and is headquartered in Kyoto, Japan.",
    "website": "http://www.omron.com",
    "zipcode": "600-8530"
  },
  "TDK.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Components",
    "long_name": "TDK Corporation",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "TDK CORP.",
    "state": null,
    "summary": "TDK Corporation, together with its subsidiaries, manufactures and sells electronic components in Japan, Europe, China, Asia, the Americas, and internationally. The company operates through Passive Components, Sensor Application Products, Magnetic Application Products, Film Application Products, and Other segments. The Passive Components segment provides ceramic capacitors, aluminum electrolytic capacitors, film capacitors, inductive devices, high-frequency components, piezoelectric materials, and circuit protection components. The Sensor Application Products segment offers temperature and pressure, magnetic, and MEMS sensors. The Magnetic Application Products segment offers hard disk drives (HDD) heads, HDD suspension assemblies, power supplies, and magnets. The Film Application Products segment provides energy devices, such as rechargeable batteries. The Other segment provides mechatronics production equipment and other products. It also provides inductive devices, ferrite cores, magnetic heads, and transformers; and engages in insurance and real estate agency business. The company was formerly known as Tokyo Denki Kagaku Kogyo K.K. and changed its name to TDK Corporation in 1983. TDK Corporation was founded in 1935 and is headquartered in Tokyo, Japan.",
    "website": "http://www.jp.tdk.com",
    "zipcode": "108-0023"
  },
  "TTDKF": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Electronic Components",
    "long_name": "TDK Corporation",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "TDK CORP",
    "state": null,
    "summary": "TDK Corporation, together with its subsidiaries, manufactures and sells electronic components in Japan, Europe, China, Asia, the Americas, and internationally. The company operates through Passive Components, Sensor Application Products, Magnetic Application Products, Film Application Products, and Other segments. The Passive Components segment provides ceramic capacitors, aluminum electrolytic capacitors, film capacitors, inductive devices, high-frequency components, piezoelectric materials, and circuit protection components. The Sensor Application Products segment offers temperature and pressure, magnetic, and MEMS sensors. The Magnetic Application Products segment offers hard disk drives (HDD) heads, HDD suspension assemblies, power supplies, and magnets. The Film Application Products segment provides energy devices, such as rechargeable batteries. The Other segment provides mechatronics production equipment and other products. It also provides inductive devices, ferrite cores, magnetic heads, and transformers; and engages in insurance and real estate agency business. The company was formerly known as Tokyo Denki Kagaku Kogyo K.K. and changed its name to TDK Corporation in 1983. TDK Corporation was founded in 1935 and is headquartered in Tokyo, Japan.",
    "website": "http://www.jp.tdk.com",
    "zipcode": "108-0023"
  },
  "TTDKY": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Electronic Components",
    "long_name": "TDK Corporation",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "TDK CORP",
    "state": null,
    "summary": "TDK Corporation, together with its subsidiaries, manufactures and sells electronic components in Japan, Europe, China, Asia, the Americas, and internationally. The company operates through Passive Components, Sensor Application Products, Magnetic Application Products, Film Application Products, and Other segments. The Passive Components segment provides ceramic capacitors, aluminum electrolytic capacitors, film capacitors, inductive devices, high-frequency components, piezoelectric materials, and circuit protection components. The Sensor Application Products segment offers temperature and pressure, magnetic, and MEMS sensors. The Magnetic Application Products segment offers hard disk drives (HDD) heads, HDD suspension assemblies, power supplies, and magnets. The Film Application Products segment provides energy devices, such as rechargeable batteries. The Other segment provides mechatronics production equipment and other products. It also provides inductive devices, ferrite cores, magnetic heads, and transformers; and engages in insurance and real estate agency business. The company was formerly known as Tokyo Denki Kagaku Kogyo K.K. and changed its name to TDK Corporation in 1983. TDK Corporation was founded in 1935 and is headquartered in Tokyo, Japan.",
    "website": "http://www.jp.tdk.com",
    "zipcode": "108-0023"
  },
  "TYC1.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Components",
    "long_name": "Taiyo Yuden Co., Ltd.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "TAIYO YUDEN CO. LTD",
    "state": null,
    "summary": "Taiyo Yuden Co., Ltd. develops, manufactures, and sells electronic components worldwide. It offers multilayer ceramic capacitors for use in smartphones, automobiles, and other devices; ferrite and applied products, such as inductors used in electronic equipment power and high-frequency circuits; integrated modules and devices, including film bulk acoustic resonator/surface acoustic wave devices for mobile communications and power supply modules; and other electronic components, such as energy devices used as backup power equipment for smart meters and other similar products, as well as peak current assistance for LED flashes. The company also provides noise suppression parts, such as bead inductors, common-mode choke coils, multilayer EMI suppression filters, and ring varistors; chip antennas; balun transformers; wireless modules; and aluminum electrolytic capacitors. Taiyo Yuden Co., Ltd. was founded in 1950 and is headquartered in Tokyo, Japan.",
    "website": "http://www.ty-top.com",
    "zipcode": "104-0031"
  },
  "TYOYY": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Electronic Components",
    "long_name": "Taiyo Yuden Co., Ltd.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "TAIYO YUDEN CO LTD",
    "state": null,
    "summary": "Taiyo Yuden Co., Ltd. develops, manufactures, and sells electronic components worldwide. It offers multilayer ceramic capacitors for use in smartphones, automobiles, and other devices; ferrite and applied products, such as inductors used in electronic equipment power and high-frequency circuits; integrated modules and devices, including film bulk acoustic resonator/surface acoustic wave devices for mobile communications and power supply modules; and other electronic components, such as energy devices used as backup power equipment for smart meters and other similar products, as well as peak current assistance for LED flashes. The company also provides noise suppression parts, such as bead inductors, common-mode choke coils, multilayer EMI suppression filters, and ring varistors; chip antennas; balun transformers; wireless modules; and aluminum electrolytic capacitors. Taiyo Yuden Co., Ltd. was founded in 1950 and is headquartered in Tokyo, Japan.",
    "website": "http://www.ty-top.com",
    "zipcode": "104-0031"
  },
  "UM3.F": {
    "city": "Ageo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Components",
    "long_name": "UMC Electronics Co., Ltd.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "UMC ELECTRONICS CO. LTD",
    "state": null,
    "summary": "UMC Electronics Co., Ltd. provides electronic manufacturing services in Japan. The company develops pachinko amusement/pinball games; pachinko/pinball game control units; electronic circuit boards for liquid crystal displays, decorative illumination, power supply, etc.; and devices related to credit/debit cards, such as credit/debit card payment terminals and security code inputting keypads. It also offers car electronic machine parts, including AC inverters, motor drivers, electric steering locks, trunk lid sensors, indicator in the compartments, start stop converters, and other parts. The company was founded in 1968 and is headquartered in Ageo, Japan.",
    "website": "http://www.umc.co.jp",
    "zipcode": "362-0022"
  }
}
