{
    "0OZ.SG": {
        "short_name": "Ohizumi MFG. Co. Ltd. Registere",
        "long_name": "Ohizumi Mfg. Co., Ltd.",
        "summary": "Ohizumi Mfg. Co., Ltd. manufactures and sells electronics components primarily in Japan. The company offers various thermistors, including NBC, a bare chip thermistor for used in semiconductor laser; NSS and NSM, a surface-mounting type chip thermistor used in TCXO, LCD backlight, rechargeable battery overcharging protection, CPU temperature monitor, optical pickup, HDD, and autofocus circuits; NGR, a glass sealed radial leads chip thermistor used for temperature sensing for water heaters, engine control, air conditioners; NDH, a glass sealed axal leads chip thermistor used for automobiles and room air conditioning; NRD, a disc thermistor with lead used in temperature compensation for electronic circuits; NRC, a chip thermistor with lead-wire used for rechargeable battery overcharging protection circuit, element in various temperature sensors, and temperature compensation for electronic circuits; and PTC thermistors for various heaters. It also provides metal oxide non-linear resistor varistors for the protection of semiconductors, electronic equipment, control equipment, and general electronic devices from over-voltage, lighting surge, switching surge of relays, and stabilizing voltage; and thermistor assemblies for automobile industries, household and housing applications, and thermistors and other applications. The company was formerly known as Ohizumi Aircraft Equipment Manufacturing Co., Ltd. and changed its name to Ohizumi Mfg. Co., Ltd. in 1945. Ohizumi Mfg. Co., Ltd. was founded in 1939 and is headquartered in Sayama, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Sayama",
        "zipcode": "350-1387",
        "website": "http://www.ohizumi-mfg.jp",
        "market_cap": 48027168
    },
    "3436.T": {
        "short_name": "SUMCO CORPORATION",
        "long_name": "Sumco Corporation",
        "summary": "Sumco Corporation, together with its subsidiaries, manufactures and sells silicon wafers for the semiconductor industry primarily in Japan, North America, Asia, and Europe. It provides monocrystalline ingots, as well as polished, annealed, epitaxial, junction isolated, silicon-on-insulator, and reclaimed polished wafers. The company was formerly known as Sumitomo Mitsubishi Silicon Corp. and changed its name to Sumco Corporation in August 2005. Sumco Corporation was founded in 1999 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8634",
        "website": "http://www.sumcosi.com",
        "market_cap": 732091383808
    },
    "4238.T": {
        "short_name": "MIRAIAL CO.LTD",
        "long_name": "Miraial Co., Ltd.",
        "summary": "Miraial Co., Ltd. engages in the manufacture and sale of plastic and metal machining for semiconductor, automotive, medical device, and electronic components industries in Japan. The company offers wafer handling products, including wafer shipping and processing; fluid system products, such as fittings; and electrical components that include fluoro terminals. It also manufactures and distributes various vertical molding machines and metal molds; and offers plastic and metal processing services. The company was formerly known as Kakizaki Manufacturing Co., Ltd. and changed its name to Miraial Co., Ltd. in August 2003. Miraial Co., Ltd. was founded in 1968 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "170-0013",
        "website": "http://www.miraial.co.jp",
        "market_cap": 12726805504
    },
    "5217.T": {
        "short_name": "TECHNO QUARTZ",
        "long_name": "Techno Quartz Inc.",
        "summary": "Techno Quartz Inc. provides high-precision quartz glass, silicon, and ceramic products primarily for use in semiconductor and liquid crystal display manufacturing equipment, and analytics equipment in Japan. It offers vertical quartz boats; quartz pedestals; high-precision welded bell jars; gas distribution plates; quartz rings; quartz reaction tubes; and machining solutions. The company also provides single crystal silicon products that are used in semiconductor and flat panel displays manufacturing processes. In addition, it offers CVD Yttria coated parts; and contract cleaning services for ceramic, silicon, metals, and coated products. The company was incorporated in 1976 and is headquartered in Tokyo, Japan. Techno Quartz Inc. is a subsidiary of GL Sciences Inc.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "164-0012",
        "website": "http://www.techno-q.com",
        "market_cap": 23398496256
    },
    "5384.T": {
        "short_name": "FUJIMI INC",
        "long_name": "Fujimi Incorporated",
        "summary": "Fujimi Incorporated manufactures and sells synthetic precision abrasives in Japan, rest of Asia, North America, and Europe. The company offers various products for crystal silicon ingots, lapping, and polishing silicon wafers; abrasives for use in the production of semiconductor devices, such as CMP slurry and other materials; and polishing products for magnetic disks of the hard disk drives. It also provides specialty materials, including lapping, polishing, and diamond products, as well as polishing pads and catalyst carriers for use in electronic components, lighting and LED products, automobiles, lenses, power semiconductors, and other products. In addition, the company offers thermal spray materials for use in aerospace, semiconductor, liquid crystal, steel, energy, chemical, and other industries. Fujimi Incorporated was founded in 1950 and is headquartered in Kiyosu, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kiyosu",
        "zipcode": "452-8502",
        "website": "http://www.fujimiinc.co.jp",
        "market_cap": 110500634624
    },
    "6228.T": {
        "short_name": "JET CO LTD",
        "long_name": "J.E.T. CO., LTD.",
        "summary": "J.E.T.Co.,LTD. engages in the design, development, manufacture, sale, maintenance, and service of semiconductor cleaning equipment in Japan. Its product portfolio includes various types of semiconductors, such as SSD, HTS, BW, SC, QUANTUM, and VRC series products; bevel treatment LIBRA and dryer systems; and quarts tube and manual wet stations, spin dryers, and quarts tube storage products. The company also provides internal short/open event checkers, electrolyte leak checkers, and ultrasonic welding monitoring systems. J.E.T.Co.,LTD. was incorporated in 2009 and is based in Okayama, Japan. J.E.T.Co.,LTD. operates as a subsidiary of Zeus Co.,Ltd.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Asakuchi",
        "zipcode": "719-0302",
        "website": "http://www.globaljet.jp",
        "market_cap": 11086499840
    },
    "6323.T": {
        "short_name": "RORZE CORP",
        "long_name": "Rorze Corporation",
        "summary": "Rorze Corporation engages in the design, development, manufacture, and sale of automation systems for the semiconductor and flat panel display production worldwide. The company offers wafer handling systems, including atmospheric robots, vacuum wafer robots, aligners, load ports, vacuum platforms, EFEMs/sorters, and stockers; and mask/reticle handling systems. It also provides system integration and package service, as well as host online communication, equipment control, and EDA/interface A solutions; and control devices, such as controllers, and stepping motors and drivers. In addition, the company offers life science automation products comprising mechatronics CO2 incubators, cell keepers, twist decappers and incubators, heat sealers, power seals, varistocks, and cell farms and shots. Further, it is involved in manufacturing of robot for semiconductor production equipment; the processing and export of machinery parts for robots; and importing, selling, maintaining, and broking equipment and parts. The company was founded in 1985 and is headquartered in Fukuyama, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuyama",
        "zipcode": "720-2104",
        "website": "http://www.rorze.com",
        "market_cap": 164346118144
    },
    "6337.T": {
        "short_name": "TESEC CORP",
        "long_name": "TESEC Corporation",
        "summary": "TESEC Corporation designs, develops, manufactures, and sells semiconductor test equipment in Japan and internationally. It offers various test systems, including discrete device test systems, thermal resistance testers, inductive load testers, dynamic test systems, IPD/IPM test systems, and internal gate resistance testers. The company also provides various handlers comprising micro electro mechanical systems, film frame test, gravity, pick and place, discrete, and TAB handlers, as well as die sorters. In addition, it offers after-sales services, such as tester calibration, overhaul, and training services, as well as spare parts, warranty, maintenance, and resale services. The company was formerly known as TES Corporation and changed its name to TESEC Corporation in 1980. TESEC Corporation was founded in 1969 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "207-0023",
        "website": "http://www.tesec.co.jp",
        "market_cap": 17878134784
    },
    "6387.T": {
        "short_name": "SAMCO INC",
        "long_name": "SAMCO Inc.",
        "summary": "SAMCO Inc. manufactures and sells operates as a semiconductor and materials company. The company primarily offers thin film deposition, microfabrication, cleaning, and surface treatment products. Its deposition systems include anode and cathode PECVD systems, atomic layer deposition systems, and silicon carbide (SiC) chemical vapor deposition systems; and etching systems comprise reactive ion etching systems, inductively coupled plasma (ICP) etch systems for general purpose, ICP etch systems for SiC etching, ICP etch systems for batch processing, silicon deep reactive ion etching systems, and XeF2 etch systems for MEMS release. The company also provides cleaning systems consisting of plasma cleaners, remote source plasma cleaners, and UV-ozone cleaners; and basic plasma research kits. It serves MEMS, laser diode, high brightness LED, TSV, SAW device, and RF device markets. The company was formerly known as SAMCO International, Inc. and changed its name to SAMCO Inc. in December 2004. SAMCO Inc. was founded in 1979 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "612-8443",
        "website": "http://www.samcointl.com",
        "market_cap": 25866227712
    },
    "6596.T": {
        "short_name": "TSUKUBASEIKO CO LTD",
        "long_name": "Tsukuba Seiko Co., Ltd.",
        "summary": "TSUKUBASEIKO Co,.Ltd. engages in the development, manufacture, and sale of electrostatic clamping systems. The company offers thin hand, cordless holder, thin wafer supporter, wafer hand, electrostatic belt, and soft palm products. Its products are used in liquid crystal panel, organic EL, touch panel, semiconductor wafer, solar cell wafer, HDD, fuel cell, printed circuit board, and printing machine industries. The company was founded in 1985 and is based in Kawachi-gun, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kawachi-gun",
        "zipcode": "329-0617",
        "website": "http://www.tsukubaseiko.co.jp",
        "market_cap": 4657500160
    },
    "6618.T": {
        "short_name": "OHIZUMI MFG CO LTD",
        "long_name": "Ohizumi Mfg. Co., Ltd.",
        "summary": "Ohizumi Mfg. Co., Ltd. manufactures and sells electronics components primarily in Japan. The company offers various thermistors, including NBC, a bare chip thermistor for used in semiconductor laser; NSS and NSM, a surface-mounting type chip thermistor used in TCXO, LCD backlight, rechargeable battery overcharging protection, CPU temperature monitor, optical pickup, HDD, and autofocus circuits; NGR, a glass sealed radial leads chip thermistor used for temperature sensing for water heaters, engine control, air conditioners; NDH, a glass sealed axal leads chip thermistor used for automobiles and room air conditioning; NRD, a disc thermistor with lead used in temperature compensation for electronic circuits; NRC, a chip thermistor with lead-wire used for rechargeable battery overcharging protection circuit, element in various temperature sensors, and temperature compensation for electronic circuits; and PTC thermistors for various heaters. It also provides metal oxide non-linear resistor varistors for the protection of semiconductors, electronic equipment, control equipment, and general electronic devices from over-voltage, lighting surge, switching surge of relays, and stabilizing voltage; and thermistor assemblies for automobile industries, household and housing applications, and thermistors and other applications. The company was formerly known as Ohizumi Aircraft Equipment Manufacturing Co., Ltd. and changed its name to Ohizumi Mfg. Co., Ltd. in 1945. Ohizumi Mfg. Co., Ltd. was founded in 1939 and is headquartered in Sayama, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sayama",
        "zipcode": "350-1387",
        "website": "http://www.ohizumi-mfg.jp",
        "market_cap": 6331030016
    },
    "6627.T": {
        "short_name": "TERA PROBE INC",
        "long_name": "Tera Probe, Inc.",
        "summary": "Tera Probe, Inc. engages in wafer testing, final testing, and test engineering business in Japan and internationally. The company provides testing and test related services for various semiconductor devices, including DRAM, SoC, CPU, image sensors, and analog devices; and test program cross-platform conversion services for debugging, as well as test patterns conversion services to work with testers. It also offers design and development support services, and mass production for various probe cards; and provides card evaluation and parallelism testing services. The company was founded in 2005 and is headquartered in Yokohama, Japan. Tera Probe, Inc. is a subsidiary of Powertech Technology Inc.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": null,
        "website": "http://www.teraprobe.com",
        "market_cap": 17785143296
    },
    "6656.T": {
        "short_name": "INSPEC INC",
        "long_name": "inspec Inc.",
        "summary": "inspec Inc. engages in the research, development, manufacture, and sale of visual inspection and measurement equipment, software, and other equipment for the automatic visual inspection of semiconductor and various IT-related devices. The company's products are used for the inspection and verification of semiconductor package boards, precision printed boards, glass mask and film substrates, high density boards, rectangles, LED boards and frames, flexible boards, and TAB tapes. It also offers offline teaching and verification software products; and verification equipment, vane inspection devices, and inline inspection modules, as well as periodic maintenance and calibration, and operational support services. The company was formerly known as Taiyo Mfg.Co.,Ltd. and changed its name to inspec Inc. in January 2001. inspec Inc. was founded in 1984 and is headquartered in Senboku, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Senboku",
        "zipcode": "014-0341",
        "website": "http://www.inspec21.com",
        "market_cap": 7485526528
    },
    "6857.T": {
        "short_name": "ADVANTEST CORP",
        "long_name": "Advantest Corporation",
        "summary": "Advantest Corporation manufactures and sells semiconductor and component test system products and mechatronics-related products. It operates through three segments: Semiconductor and Component Test System; Mechatronics System; and Services, Support and Others. The Semiconductor and Component Test System segment provides customers with test system products for the semiconductor industry and the electronic parts industry. This segment offers test systems for SoC semiconductor devices; and test systems for memory semiconductors devices. The Mechatronics System segment provides test handlers; mechatronic-applied products for handling semiconductor devices; and device interfaces, which serve as interfaces with the devices that are measured. This segment also engages in the operations related to nano-technology products. The Services, Support and Others segment provides customer solutions for the semiconductor and component test system and mechatronics system segments; and support services. This segment is also involved in the sale of consumables and used products; and equipment lease business and others. In addition, the company engages in the research and development activities measuring and testing technologies. Advantest Corporation serves fabless semiconductor companies, foundries, and test houses, as well as industrial, design, and manufacturing companies in Japan, rest of Asia, the United States, and Europe. Advantest Corporation has collaboration with STMicroelectronics on advanced automated test cell for IC Testing; and partnership with PDF Solutions Inc. for cloud-based software solutions. The company was founded in 1954 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.advantest.com",
        "market_cap": 1891445112832
    },
    "6871.T": {
        "short_name": "MICRONICS JAPAN CO",
        "long_name": "Micronics Japan Co., Ltd.",
        "summary": "Micronics Japan Co., Ltd. develops, manufactures, and sells testing and measurement equipment for semiconductors and LCD testing system worldwide. The company's semiconductor products include probe cards, package probes, semiconductor test equipment, and wafer prober. It also provides flat panel display (FPD) products, such as automated optical inspection equipment under the PIXQUIRE name; and mura inspection and compensation system under the Gaterumph name, as well as probe units, FPD lighting units, manual probers for FPD substrates, and array probers/cell probers. Micronics Japan Co., Ltd. was formerly known as Towa Electric Co., Ltd. and changed to Micronics Japan Co., Ltd. in April 1975. The company was founded in 1970 and is headquartered in Musashino, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Musashino",
        "zipcode": "180-8508",
        "website": "http://www.mjc.co.jp",
        "market_cap": 59029188608
    },
    "7510.T": {
        "short_name": "TAKEBISHI CORPORATION",
        "long_name": "Takebishi Corporation",
        "summary": "Takebishi Corporation, a technological trading company, deals in industrial electric machinery and electronic equipment in Japan. The company provides industrial factory automation (FA) equipment, such as controllers, drive controls, and electricity distribution controls; FA systems that automate the production line and save labor; and industrial equipment, including processing machinery and robots for enhancing productivity and quality. It also offers semiconductor parts to assembly manufacturers and electronic device makers; and machinery and peripheral devices for use in home electronics, such as PCs, controllers for industrial application, and other products for the amusement sector. In addition, the company provides air conditioning units and devices for household equipment; building equipment, including elevators and escalators; electrical substation equipment for local municipalities, as well as emergency power generating equipment; power distribution facilities for systems in factories and buildings; and inspection equipment, such as radiation cancer therapy systems and other therapy equipment, and CT and MRI systems. Further, it sells equipment, including PCs and PC servers; designs, develops, and maintains sales management and production management systems; and security systems, such as surveillance cameras and controls for entering and exiting. The company was formerly known as Takebishi Electric Co., Ltd. and changed its name to Takebishi Corporation in October 2006. Takebishi Corporation was founded in 1926 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "615-8501",
        "website": "http://www.takebishi.co.jp",
        "market_cap": 22940217344
    },
    "7587.T": {
        "short_name": "PALTEK CORP",
        "long_name": "Paltek Corporation",
        "summary": "Paltek Corporation engages in the sale of semiconductors and related products in Japan. Its products include FPGAs, memory ICs, ASSP, analog ICs/power supply ICs, telecom/network applications, wireless ICs, sensor ICs, clock/timing ICs, etc. The company also offers ODM services in the field of medical, industrial, and communication equipment; model-based design services; and in-house products, such as FPGA computing platforms used for video processing and video transmission. In addition, it provides mobility, IoT, AI, video transmission, server and storage, paper packing, and fleet management solutions, as well as body motion sensor for infants, work support wearable robots, chlorus acid water, and space sanitization systems. Paltek Corporation was incorporated in 1977 and is headquartered in Yokohama, Japan. As of May 27, 2021, Paltek Corporation operates as a subsidiary of Restar Holdings Corporation.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "222-0033",
        "website": "http://www.paltek.co.jp",
        "market_cap": 7415858176
    },
    "7609.T": {
        "short_name": "DAITRON CO LTD",
        "long_name": "Daitron Co., Ltd.",
        "summary": "Daitron Co., Ltd., an electronics engineering trading company, primarily imports, exports, and sells electronic components and assembly goods in Japan and internationally. The company also manufactures, imports, exports, and sells semiconductors, embedded systems, power supply equipment, image-related equipment and components, and information systems. In addition, it provides production equipment and inspection requipment for silicon wafers, ICs, LSIs, FPDs, electronic materials, semiconductors, optical devices, energy devices, and OEM products, as well as flat panels, including LCDs, CFs, PDPs, organic Els. Further, the company engages in the development, manufacture, and sale of wafer edge grinding machines and chip sorting machines; LED testers/probers and processing equipment; and original-system low noise switching power supply custom UPS products and transformers. Additionally, it designs, manufactures, assembles, and customizes image device dedicated harness and other electronic equipment. The company was formerly known as Daito Electron Co., Ltd. and changed its name to Daitron Co., Ltd. in 2017. Daitron Co., Ltd. was founded in 1952 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "532-0003",
        "website": "http://www.daitron.co.jp",
        "market_cap": 22716211200
    },
    "7748.T": {
        "short_name": "HOLON CO LTD",
        "long_name": "Holon Co.,Ltd.",
        "summary": "Holon Co.,Ltd. engages in the development, manufacture, marketing, and maintenance of semiconductor circuitry dimension measurement and inspection tools in Japan. The company offers photomask critical dimension-scanning electron microscopes (SEMs), wafer CD-SEMs, defect review SEMs, pattern transfer equipment for LED production, and roller mold measurement tools. Its products are used in fabricating semiconductors. The company was founded in 1985 and is headquartered in Tokorozawa, Japan. As of June 22, 2018, Holon Co.,Ltd. operates as a subsidiary of A&D Company, Limited.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokorozawa",
        "zipcode": "359-0011",
        "website": "http://www.holon-ltd.co.jp",
        "market_cap": 12713203712
    },
    "8035.T": {
        "short_name": "TOKYO ELECTRON",
        "long_name": "Tokyo Electron Limited",
        "summary": "Tokyo Electron Limited, together with its subsidiaries, develops, manufactures, distributes, and sells semiconductor and flat panel display (FPD) production equipment in Japan, North America, Europe, South Korea, Taiwan, China, and internationally. The company's Semiconductor Production Equipment segment offers coaters/developers, plasma etch systems, and single wafer deposition systems and cleaning systems used in wafer processing; wafer probers used in wafer testing process; and wafer bonders/debonders used in packaging processes. Its Flat Panel Display Production Equipment segment provides coaters/developers and plasma etch/ash systems for use in the manufacture of FPDs, as well as inkjet printing systems for manufacturing OLED panels. The company also offers logistic, facility maintenance, and insurance services. Tokyo Electron Limited was incorporated in 1951 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-6325",
        "website": "http://www.tel.com",
        "market_cap": 7446584623104
    },
    "8155.T": {
        "short_name": "MIMASU SEMICONDUCTOR INDUSTRY",
        "long_name": "Mimasu Semiconductor Industry Co., Ltd.",
        "summary": "Mimasu Semiconductor Industry Co., Ltd. engages in the processing and sales of semiconductor materials in Japan. The company's semiconductor materials include prime and recycle wafers. It also offers measuring instruments, testing machines, information equipment, automatic control equipment, and other precision equipment, as well as manufacturing, inspection, and testing systems; and develops and sells in-house products and related systems. In addition, the company manufactures and sells various plants, such as pure water production and wastewater treatment equipment; and semiconductor manufacturing equipment. Mimasu Semiconductor Industry Co., Ltd. was founded in 1963 and is headquartered in Takasaki, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Takasaki",
        "zipcode": "370-3533",
        "website": "http://www.mimasu.co.jp",
        "market_cap": 84202242048
    },
    "ADTTF": {
        "short_name": "ADVANTEST CORP",
        "long_name": "Advantest Corporation",
        "summary": "Advantest Corporation manufactures and sells semiconductor and component test system products and mechatronics-related products. It operates through three segments: Semiconductor and Component Test System; Mechatronics System; and Services, Support and Others. The Semiconductor and Component Test System segment provides customers with test system products for the semiconductor industry and the electronic parts industry. This segment offers test systems for SoC semiconductor devices; and test systems for memory semiconductors devices. The Mechatronics System segment provides test handlers; mechatronic-applied products for handling semiconductor devices; and device interfaces, which serve as interfaces with the devices that are measured. This segment also engages in the operations related to nano-technology products. The Services, Support and Others segment provides customer solutions for the semiconductor and component test system and mechatronics system segments; and support services. This segment is also involved in the sale of consumables and used products; and equipment lease business and others. In addition, the company engages in the research and development activities measuring and testing technologies. Advantest Corporation serves fabless semiconductor companies, foundries, and test houses, as well as industrial, design, and manufacturing companies in Japan, rest of Asia, the United States, and Europe. Advantest Corporation has collaboration with STMicroelectronics on advanced automated test cell for IC Testing; and partnership with PDF Solutions Inc. for cloud-based software solutions. The company was founded in 1954 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.advantest.com",
        "market_cap": 18666643456
    },
    "ATEYY": {
        "short_name": "ADVANTEST CORP",
        "long_name": "Advantest Corporation",
        "summary": "Advantest Corporation manufactures and sells semiconductor and component test system products and mechatronics-related products. It operates through three segments: Semiconductor and Component Test System; Mechatronics System; and Services, Support and Others. The Semiconductor and Component Test System segment provides customers with test system products for the semiconductor industry and the electronic parts industry. This segment offers test systems for SoC semiconductor devices; and test systems for memory semiconductors devices. The Mechatronics System segment provides test handlers; mechatronic-applied products for handling semiconductor devices; and device interfaces, which serve as interfaces with the devices that are measured. This segment also engages in the operations related to nano-technology products. The Services, Support and Others segment provides customer solutions for the semiconductor and component test system and mechatronics system segments; and support services. This segment is also involved in the sale of consumables and used products; and equipment lease business and others. In addition, the company engages in the research and development activities measuring and testing technologies. Advantest Corporation serves fabless semiconductor companies, foundries, and test houses, as well as industrial, design, and manufacturing companies in Japan, rest of Asia, the United States, and Europe. Advantest Corporation has collaboration with STMicroelectronics on advanced automated test cell for IC Testing; and partnership with PDF Solutions Inc. for cloud-based software solutions. The company was founded in 1954 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.advantest.com",
        "market_cap": 18246225920
    },
    "D65.SG": {
        "short_name": "DISCO CORP. Registered Shares o",
        "long_name": "Disco Corporation",
        "summary": "Disco Corporation manufactures and sells precision cutting, grinding, and polishing machines in Japan and internationally. The company's precision machines include dicing saws, laser saws, grinders, polishers, wafer mounters, die separators, surface planers, and waterjet saws, as well as products for dicing before grinding process and package singulation. It also offers precision processing tools comprising dicing blades, grinding wheels, and dry polishing wheels; and other products, such as accessory equipment, as well as frames and cassettes, and additives for cutting waters. In addition, the company is involved in the disassembly and recycling of precision cutting, grinding, and polishing machines, as well as provides training services for the maintenance and operation of its products. Further, it leases precision machines; and purchases and sells used machines. The company was founded in 1937 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "143-8580",
        "website": "http://www.disco.co.jp",
        "market_cap": 8907118592
    },
    "DSCSY": {
        "short_name": "DISCO CORPORATION",
        "long_name": "Disco Corporation",
        "summary": "Disco Corporation manufactures and sells precision cutting, grinding, and polishing machines in Japan and internationally. The company's precision machines include dicing saws, laser saws, grinders, polishers, wafer mounters, die separators, surface planers, and waterjet saws, as well as products for dicing before grinding process and package singulation. It also offers precision processing tools comprising dicing blades, grinding wheels, and dry polishing wheels; and other products, such as accessory equipment, as well as frames and cassettes, and additives for cutting waters. In addition, the company is involved in the disassembly and recycling of precision cutting, grinding, and polishing machines, as well as provides training services for the maintenance and operation of its products. Further, it leases precision machines; and purchases and sells used machines. The company was founded in 1937 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "143-8580",
        "website": "http://www.disco.co.jp",
        "market_cap": 11111560192
    },
    "MJ3.F": {
        "short_name": "MICRONICS JAPAN CO. LTD",
        "long_name": "Micronics Japan Co., Ltd.",
        "summary": "Micronics Japan Co., Ltd. develops, manufactures, and sells testing and measurement equipment for semiconductors and LCD testing system worldwide. The company's semiconductor products include probe cards, package probes, semiconductor test equipment, and wafer prober. It also provides flat panel display (FPD) products, such as automated optical inspection equipment under the PIXQUIRE name; and mura inspection and compensation system under the Gaterumph name, as well as probe units, FPD lighting units, manual probers for FPD substrates, and array probers/cell probers. Micronics Japan Co., Ltd. was formerly known as Towa Electric Co., Ltd. and changed to Micronics Japan Co., Ltd. in April 1975. The company was founded in 1970 and is headquartered in Musashino, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Musashino",
        "zipcode": "180-8508",
        "website": "http://www.mjc.co.jp",
        "market_cap": 446441088
    },
    "MU2.MU": {
        "short_name": "MIMASU SEMICON.IND.",
        "long_name": "Mimasu Semiconductor Industry Co., Ltd.",
        "summary": "Mimasu Semiconductor Industry Co., Ltd. engages in the processing and sales of semiconductor materials in Japan. The company's semiconductor materials include prime and recycle wafers. It also offers measuring instruments, testing machines, information equipment, automatic control equipment, and other precision equipment, as well as manufacturing, inspection, and testing systems; and develops and sells in-house products and related systems. In addition, the company manufactures and sells various plants, such as pure water production and wastewater treatment equipment; and semiconductor manufacturing equipment. Mimasu Semiconductor Industry Co., Ltd. was founded in 1963 and is headquartered in Takasaki, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Takasaki",
        "zipcode": "370-3533",
        "website": "http://www.mimasu.co.jp",
        "market_cap": 634076352
    },
    "S3X.F": {
        "short_name": "SUMCO CORP.",
        "long_name": "Sumco Corporation",
        "summary": "Sumco Corporation, together with its subsidiaries, manufactures and sells silicon wafers for the semiconductor industry primarily in Japan, North America, Asia, and Europe. It provides monocrystalline ingots, as well as polished, annealed, epitaxial, junction isolated, silicon-on-insulator, and reclaimed polished wafers. The company was formerly known as Sumitomo Mitsubishi Silicon Corp. and changed its name to Sumco Corporation in August 2005. Sumco Corporation was founded in 1999 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8634",
        "website": "http://www.sumcosi.com",
        "market_cap": 5452238336
    },
    "SMU.F": {
        "short_name": "SAMCO INC.",
        "long_name": "SAMCO Inc.",
        "summary": "SAMCO Inc. manufactures and sells operates as a semiconductor and materials company. The company primarily offers thin film deposition, microfabrication, cleaning, and surface treatment products. Its deposition systems include anode and cathode PECVD systems, atomic layer deposition systems, and silicon carbide (SiC) chemical vapor deposition systems; and etching systems comprise reactive ion etching systems, inductively coupled plasma (ICP) etch systems for general purpose, ICP etch systems for SiC etching, ICP etch systems for batch processing, silicon deep reactive ion etching systems, and XeF2 etch systems for MEMS release. The company also provides cleaning systems consisting of plasma cleaners, remote source plasma cleaners, and UV-ozone cleaners; and basic plasma research kits. It serves MEMS, laser diode, high brightness LED, TSV, SAW device, and RF device markets. The company was formerly known as SAMCO International, Inc. and changed its name to SAMCO Inc. in December 2004. SAMCO Inc. was founded in 1979 and is headquartered in Kyoto, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "612-8443",
        "website": "http://www.samcointl.com",
        "market_cap": 194036368
    },
    "SUMCF": {
        "short_name": "SUMCO CORPORATION",
        "long_name": "Sumco Corporation",
        "summary": "Sumco Corporation, together with its subsidiaries, manufactures and sells silicon wafers for the semiconductor industry primarily in Japan, North America, Asia, and Europe. It provides monocrystalline ingots, as well as polished, annealed, epitaxial, junction isolated, silicon-on-insulator, and reclaimed polished wafers. The company was formerly known as Sumitomo Mitsubishi Silicon Corp. and changed its name to Sumco Corporation in August 2005. Sumco Corporation was founded in 1999 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8634",
        "website": "http://www.sumcosi.com",
        "market_cap": 6596656640
    },
    "SUOPY": {
        "short_name": "SUMCO CORPORATION",
        "long_name": "Sumco Corporation",
        "summary": "Sumco Corporation, together with its subsidiaries, manufactures and sells silicon wafers for the semiconductor industry primarily in Japan, North America, Asia, and Europe. It provides monocrystalline ingots, as well as polished, annealed, epitaxial, junction isolated, silicon-on-insulator, and reclaimed polished wafers. The company was formerly known as Sumitomo Mitsubishi Silicon Corp. and changed its name to Sumco Corporation in August 2005. Sumco Corporation was founded in 1999 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8634",
        "website": "http://www.sumcosi.com",
        "market_cap": 6897293312
    },
    "TEW.F": {
        "short_name": "TESEC CORP.",
        "long_name": "TESEC Corporation",
        "summary": "TESEC Corporation designs, develops, manufactures, and sells semiconductor test equipment in Japan and internationally. It offers various test systems, including discrete device test systems, thermal resistance testers, inductive load testers, dynamic test systems, IPD/IPM test systems, and internal gate resistance testers. The company also provides various handlers comprising micro electro mechanical systems, film frame test, gravity, pick and place, discrete, and TAB handlers, as well as die sorters. In addition, it offers after-sales services, such as tester calibration, overhaul, and training services, as well as spare parts, warranty, maintenance, and resale services. The company was formerly known as TES Corporation and changed its name to TESEC Corporation in 1980. TESEC Corporation was founded in 1969 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "207-0023",
        "website": "http://www.tesec.co.jp",
        "market_cap": 135145104
    },
    "TKY.F": {
        "short_name": "TOKYO ELECTRON LTD",
        "long_name": "Tokyo Electron Limited",
        "summary": "Tokyo Electron Limited, together with its subsidiaries, develops, manufactures, distributes, and sells semiconductor and flat panel display (FPD) production equipment in Japan, North America, Europe, South Korea, Taiwan, China, and internationally. The company's Semiconductor Production Equipment segment offers coaters/developers, plasma etch systems, and single wafer deposition systems and cleaning systems used in wafer processing; wafer probers used in wafer testing process; and wafer bonders/debonders used in packaging processes. Its Flat Panel Display Production Equipment segment provides coaters/developers and plasma etch/ash systems for use in the manufacture of FPDs, as well as inkjet printing systems for manufacturing OLED panels. The company also offers logistic, facility maintenance, and insurance services. Tokyo Electron Limited was incorporated in 1951 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-6325",
        "website": "http://www.tel.com",
        "market_cap": 56369201152
    },
    "TOELF": {
        "short_name": "TOKYO ELECTRON",
        "long_name": "Tokyo Electron Limited",
        "summary": "Tokyo Electron Limited, together with its subsidiaries, develops, manufactures, distributes, and sells semiconductor and flat panel display (FPD) production equipment in Japan, North America, Europe, South Korea, Taiwan, China, and internationally. The company's Semiconductor Production Equipment segment offers coaters/developers, plasma etch systems, and single wafer deposition systems and cleaning systems used in wafer processing; wafer probers used in wafer testing process; and wafer bonders/debonders used in packaging processes. Its Flat Panel Display Production Equipment segment provides coaters/developers and plasma etch/ash systems for use in the manufacture of FPDs, as well as inkjet printing systems for manufacturing OLED panels. The company also offers logistic, facility maintenance, and insurance services. Tokyo Electron Limited was incorporated in 1951 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-6325",
        "website": "http://www.tel.com",
        "market_cap": 69845483520
    },
    "TOELY": {
        "short_name": "TOKYO ELECTRON",
        "long_name": "Tokyo Electron Limited",
        "summary": "Tokyo Electron Limited, together with its subsidiaries, develops, manufactures, distributes, and sells semiconductor and flat panel display (FPD) production equipment in Japan, North America, Europe, South Korea, Taiwan, China, and internationally. The company's Semiconductor Production Equipment segment offers coaters/developers, plasma etch systems, and single wafer deposition systems and cleaning systems used in wafer processing; wafer probers used in wafer testing process; and wafer bonders/debonders used in packaging processes. Its Flat Panel Display Production Equipment segment provides coaters/developers and plasma etch/ash systems for use in the manufacture of FPDs, as well as inkjet printing systems for manufacturing OLED panels. The company also offers logistic, facility maintenance, and insurance services. Tokyo Electron Limited was incorporated in 1951 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-6325",
        "website": "http://www.tel.com",
        "market_cap": 67755540480
    },
    "VAN.F": {
        "short_name": "ADVANTEST CORP.",
        "long_name": "Advantest Corporation",
        "summary": "Advantest Corporation manufactures and sells semiconductor and component test system products and mechatronics-related products. It operates through three segments: Semiconductor and Component Test System; Mechatronics System; and Services, Support and Others. The Semiconductor and Component Test System segment provides customers with test system products for the semiconductor industry and the electronic parts industry. This segment offers test systems for SoC semiconductor devices; and test systems for memory semiconductors devices. The Mechatronics System segment provides test handlers; mechatronic-applied products for handling semiconductor devices; and device interfaces, which serve as interfaces with the devices that are measured. This segment also engages in the operations related to nano-technology products. The Services, Support and Others segment provides customer solutions for the semiconductor and component test system and mechatronics system segments; and support services. This segment is also involved in the sale of consumables and used products; and equipment lease business and others. In addition, the company engages in the research and development activities measuring and testing technologies. Advantest Corporation serves fabless semiconductor companies, foundries, and test houses, as well as industrial, design, and manufacturing companies in Japan, rest of Asia, the United States, and Europe. Advantest Corporation has collaboration with STMicroelectronics on advanced automated test cell for IC Testing; and partnership with PDF Solutions Inc. for cloud-based software solutions. The company was founded in 1954 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.advantest.com",
        "market_cap": 14679844864
    },
    "VANA.F": {
        "short_name": "ADVANTEST  ADR NEW/1 O.N.",
        "long_name": "Advantest Corporation",
        "summary": "Advantest Corporation manufactures and sells semiconductor and component test system products and mechatronics-related products. It operates through three segments: Semiconductor and Component Test System; Mechatronics System; and Services, Support and Others. The Semiconductor and Component Test System segment provides customers with test system products for the semiconductor industry and the electronic parts industry. This segment offers test systems for SoC semiconductor devices; and test systems for memory semiconductors devices. The Mechatronics System segment provides test handlers; mechatronic-applied products for handling semiconductor devices; and device interfaces, which serve as interfaces with the devices that are measured. This segment also engages in the operations related to nano-technology products. The Services, Support and Others segment provides customer solutions for the semiconductor and component test system and mechatronics system segments; and support services. This segment is also involved in the sale of consumables and used products; and equipment lease business and others. In addition, the company engages in the research and development activities measuring and testing technologies. Advantest Corporation serves fabless semiconductor companies, foundries, and test houses, as well as industrial, design, and manufacturing companies in Japan, rest of Asia, the United States, and Europe. Advantest Corporation has collaboration with STMicroelectronics on advanced automated test cell for IC Testing; and partnership with PDF Solutions Inc. for cloud-based software solutions. The company was founded in 1954 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.advantest.com",
        "market_cap": 14572440576
    }
}