{
    "RNECN.MX": {
        "short_name": "RENESAS ELECTRONICS CORP",
        "long_name": "Renesas Electronics Corporation",
        "summary": "Renesas Electronics Corporation, together with its subsidiaries, researches, develops, designs, manufactures, sells, and services semiconductors in Japan, China, North America, Europe, rest of Asia, and internationally. It operates through Automotive Business and Industrial/Infrastructure/IoT Business segments. The company offers microcontrollers (MCUs) and microprocessors; analog products, such as amplifiers, audio and video, data converters, power line communication, and switches and multiplexer products; automotive products, including battery management, interface, power devices, power management, sensors, video and display, wireless power, system-on-chips, and MCU products; and clock ICs and clock timing solutions, such as specific clocks, clock distribution and generation, jitter attenuators, and crystal oscillator products. It also provides interface and connectivity products, including buffers, wireless modules, data compression, industrial Ethernet, IO-link line driver, memory interface, optical interconnect, photocouplers/optocouplers, power line communication, signal integrity, telecom datacom and interface, USB switches and hubs, video broadcast software and ASICs, VME, and wireless broadband modem products. In addition, the company offers memory and logic products, such as low power static random access memory; power and power management products; RF and microwave products; sensor products; SMD, MIL-STD-883 (/883), and Class-V/Q products. Further, it provides automotive information devices, such as in-vehicle infotainment and instrument panels. The company offers its products for automotive, communication, healthcare, computing, home and building, industrial, personal electronic, technology, and other applications. Renesas Electronics Corporation was founded in 2002 and is headquartered in Tokyo, Japan.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductor - Broad Line",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Japan",
        "city": "Tokyo"
    }
}