{
    "2737.T": {
        "short_name": "TOMEN DEVICES CORPORATION",
        "long_name": "Tomen Devices Corporation",
        "summary": "Tomen Devices Corporation operates as an electronics trading company in Japan. The company sells semiconductors products and electronic components. Its products include memory semiconductors, including DRAM, FLASH, and MCP; system LSI semiconductors, including ASIC, DDI, and CMOS image sensors; and liquid crystal panels, LEDs, and OLEDs. The company was founded in 1992 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3132.T": {
        "short_name": "MACNICA FUJI ELECTRONICS HLDGS ",
        "long_name": "Macnica Fuji Electronics Holdings, Inc.",
        "summary": "Macnica Fuji Electronics Holdings, Inc., through its subsidiaries, engages in the import, export, and distribution of electronic components in Japan and internationally. It offers semiconductor devices and ICs. The company was founded in 2015 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "3156.T": {
        "short_name": "RESTAR HOLDINGS CORP",
        "long_name": "Restar Holdings Corporation",
        "summary": "Restar Holdings Corporation operates as an electronics trading company in Japan and internationally. The company offers semiconductor and electronic components, system engineering, and reliability test services; and electronic and measuring equipment, as well as engages in the EMS, procurement, system equipment, and technology business. It is also involved in vegetable factory business; and renewable energy business, and produces and supplies power. The company was incorporated in 2009 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3640.T": {
        "short_name": "DENSAN CO LTD",
        "long_name": "Densan Co., Ltd.",
        "summary": "Densan Co., Ltd. operates as an information service company in Japan. The company offers business information systems, such as resident's information, welfare, industrial planning, and internal information systems for local governments; and private enterprise information systems, including distribution industry relations, finance business relationship, news media relations, medical care, and other systems. It also provides data center services comprising housing, network, operation and monitoring, individual operation, backup, virtual server, and cloud services; connection, rental server, and homepage creation services; and information systems planning, design, development, and maintenance services. In addition, the company is involved in the development, sales, and rental and maintenance of software; sale of information and communications, and information processing equipment, as well as its peripheral equipment and operational software; rental of information processing equipment and building space; and installation and maintenance of electrical equipment. Further, it engages in planning, research, and development of information network technology, information communication and processing equipment, and peripheral devices; plans, develops, and sells digital content; and provision of information communication and processing technology education and guidance services, and information consulting systems. Additionally, the company is involved in worker dispatch business. Densan Co., Ltd. was founded in 1966 and is headquartered in Nagano, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Nagano"
    },
    "6315.T": {
        "short_name": "TOWA CORP",
        "long_name": "TOWA Corporation",
        "summary": "TOWA Corporation designs, develops, manufactures, and sells semiconductor manufacturing equipment and high-precision molds in Japan and internationally. Its products include molding equipment, singulation equipment, ultra-precision molds, THPL-CBN end mills, and TEN-systems; and laser processing equipment, as well as fine plastic molded products. The company also offers manufacturing systems for electronic components, precision-molded and assembly products, medical-use equipment, electronic-communications equipment; and remodeling/repairing, and contract processing services. In addition, it sells used equipment. The company was formerly known as TOWA Precision Industries Limited and changed its name to TOWA Corporation in December 1988. TOWA Corporation was founded in 1979 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kyoto"
    },
    "6338.T": {
        "short_name": "TAKATORI CORP",
        "long_name": "Takatori Corporation",
        "summary": "Takatori Corporation manufactures and sells semiconductor-related equipment, LCD panel related equipment, multi wire saws and textile machinery, and medical devices primarily in Japan and internationally. It offers precision cutting machinery for sapphire, SiC, and GaN substrates; solar cells; quartz crystals; LT and LN products; GaAs, Gap, and InP products; magnets; ceramics; and materials for research and development. The company also offers semiconductor equipment for LED's, TAIKO processes, wafer protective tape lamination and removal machines, DFR lamination machines, wafer mounters, UV irradiation equipment, film resist lamination machines, package mounters, substrate(H-WSS) processing equipment, and MEMS. In addition, it provides display equipment for LCD panel surface cleaning, polarizer attaching, module production process, and touch panel bonding process machines; carbon fiber/thin film solar cell sheet and apparel-related textile equipment; and medical devices. The company was founded in 1950 and is headquartered in Kashihara, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kashihara"
    },
    "6614.T": {
        "short_name": "SHIKINO HIGH-TECH CO LTD",
        "long_name": "Shikino High-Tech CO.,LTD.",
        "summary": "Shikino High-Tech CO.,LTD engages in the development and manufacture of semiconductor inspection equipment, and product development businesses. The company offers semiconductor testing equipment, which includes monitored burn-in systems, analog IC test systems, and open short leakage systems primarily for the semiconductor post-production process; and image processing cameras, camera modules, and related products for use in various applications, including vending machines, ticketing machines, arcade games, digital signages, character codes, biometrics, various information terminals, robots, and surveillance cameras, as well as FA, transport, packaging, and medical equipment. It also provides embedded cameras and related products, such as USB output camera modules, digital YUV output camera modules, NTSC output camera modules, camera lenses, and customized cameras for industrial use; cameras for shops and related solutions; and IP cores, including MIPI IP core and JPEG IP core products. In addition, it offers intelligent camera module and semiconductor testing equipment; image solutions services support, and camera and related system development services; analog and digital LIS designs; testing and burn-in solutions; and DMS and EMS solutions. The company was formerly known as Shikino Electronics Co. Ltd. and changed its name to Shikino High-Tech CO.,LTD. in January 1992. Shikino High-Tech CO.,LTD. was founded in 1975 and is based in Uozu-shi, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Uozu"
    },
    "6616.T": {
        "short_name": "TOREX SEMICONDUCTOR LTD",
        "long_name": "Torex Semiconductor Ltd.",
        "summary": "Torex Semiconductor Ltd. researches, develops, manufactures, and sells integrated circuits (ICs) and active discrete components in Japan and internationally. The company offers DC/DC converters, voltage regulators and detectors, push button controllers, LED lighting drivers, load switches, power MOSFETs, temperature sensors, PLL clock generators, and transient voltage suppressors; charge pump, battery charge, hall, and oscillator ICs; and Shottky barrier, Zener, switching, bridge, and fast recovery diodes. Its products are used in consumer electronics, automotive products, industrial equipment, medical and healthcare equipment, and computers and communications products. Torex Semiconductor Ltd. was founded in 1995 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6625.T": {
        "short_name": "JALCO HOLDINGS INC",
        "long_name": "JALCO Holdings Inc.",
        "summary": "JALCO Holdings Inc. engages in real estate leasing and loan management businesses. The company provides management, accounting, general affair, and legal affair services, as well as merger and acquisition services. It is also involved in money lending; equipment engineering; and conservation and responsibilities businesses. In addition, the company engages in the manufacture and sale of electronic equipment, medieval travel technology machines, and equipment machines; and provides information processing machines and terminal equipment, other electronic equipment, and communication devices. JALCO Holdings Inc. was founded in 1956 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6707.T": {
        "short_name": "SANKEN ELECTRIC CO",
        "long_name": "Sanken Electric Co., Ltd.",
        "summary": "Sanken Electric Co., Ltd. manufactures, purchases, and sells electric equipment and apparatus. The company operates through two segments, Semiconductor Devices Business and Power System Business. Its Semiconductor Devices Business segment manufactures and sells power modules, power ICs, control ICs, hall-effect ICs, bipolar transistors, MOSFET, IGBT, thyristors, rectifier diodes, and light emitting diodes (LEDs). This segment serves the automobiles, home appliances, industrial machinery, audio visual and office automation equipment, telecommunications equipment, and LED lighting sectors. The company's Power System Business segment manufactures and sells uninterruptible power supplies, inverters, DC power supplies, airway beacon systems, switching mode power supply units and transformers. It also undertakes electronic, telecommunication, and other construction works. The company has operations in Japan, China, Korea, the United States, Europe, and internationally. The company was formerly known as Toho Sanken Electric Co., Ltd. and changed its name to Sanken Electric Co., Ltd. in June 1962. Sanken Electric Co., Ltd. was founded in 1946 and is headquartered in Niiza, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Niiza"
    },
    "6723.T": {
        "short_name": "RENESAS ELECTRONICS CORP",
        "long_name": "Renesas Electronics Corporation",
        "summary": "Renesas Electronics Corporation, together with its subsidiaries, researches, develops, designs, manufactures, sells, and services semiconductors in Japan, China, North America, Europe, rest of Asia, and internationally. It operates through Automotive Business and Industrial/Infrastructure/IoT Business segments. The company offers microcontrollers (MCUs) and microprocessors; analog products, such as amplifiers, audio and video, data converters, power line communication, and switches and multiplexer products; automotive products, including battery management, interface, power devices, power management, sensors, video and display, wireless power, system-on-chips, and MCU products; and clock ICs and clock timing solutions, such as specific clocks, clock distribution and generation, jitter attenuators, and crystal oscillator products. It also provides interface and connectivity products, including buffers, wireless modules, data compression, industrial Ethernet, IO-link line driver, memory interface, optical interconnect, photocouplers/optocouplers, power line communication, signal integrity, telecom datacom and interface, USB switches and hubs, video broadcast software and ASICs, VME, and wireless broadband modem products. In addition, the company offers memory and logic products, such as low power static random access memory; power and power management products; RF and microwave products; sensor products; SMD, MIL-STD-883 (/883), and Class-V/Q products. Further, it provides automotive information devices, such as in-vehicle infotainment and instrument panels. The company offers its products for automotive, communication, healthcare, computing, home and building, industrial, personal electronic, technology, and other applications. Renesas Electronics Corporation was founded in 2002 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6730.T": {
        "short_name": "AXELL CORP",
        "long_name": "AXELL Corporation",
        "summary": "AXELL Corporation designs, manufactures, and sells semiconductor ICs and printed circuit boards with embedded semiconductor ICs in Japan. The company offers multifunction and LED driver LSI products specialized for use in pachinko and pachi slot-machines; and graphics LSIs for industrial embedded systems. It is also involved in the research, development, and sale of elemental technologies related to graphics, sound, machine learning, etc.; information securities; and block chain. In addition, the company offers various informational services using the Internet; develops and sells software; and designs, manufactures, and sells applied equipment, as well as engages in the secondhand articles trading and other businesses. AXELL Corporation was founded in 1996 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6769.T": {
        "short_name": "THINE ELECTRONICS INC",
        "long_name": "THine Electronics, Inc.",
        "summary": "THine Electronics, Inc., a fabless semiconductor company, engages in the planning, designing, and sale of mixed-signal LSIs in Japan and internationally. It offers system modules, V-by-One HS products for flat panel displays that require higher frame rates and resolutions, V-by-One products for EMI and data transmission for long distance, transceivers, repeaters, low voltage differential signaling products, LED and motor drivers, image signal processors, timing controllers, video ADC products, power management ICs, and power modules. The company provides its products for use in cameras, USB cameras, LCD panels, projectors, multifunction printers, smartphones, and tablets, as well as medical, automotive, and gaming applications. THine Electronics, Inc. was founded in 1991 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6832.T": {
        "short_name": "AOI ELECTRONICS",
        "long_name": "AOI Electronics Co., Ltd.",
        "summary": "AOI Electronics Co., Ltd. manufactures and sells electronic parts in Japan. It offers integrated circuits, modules, thick film thermal print heads, optical sensors, LED products, chip resistor networks, and micro electro mechanical system devices. The company was founded in 1969 and is headquartered in Takamatsu, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Takamatsu"
    },
    "6875.T": {
        "short_name": "MEGACHIPS CORP",
        "long_name": "MegaChips Corporation",
        "summary": "MegaChips Corporation provides chip solutions in Japan. The company offers application specific integrated circuits; MEMS timing devices; automotive ethernet PHY; wired communication networks; and LCD timing controllers for various input and output interfaces, such as HDTVs and smart devices. MegaChips Corporation was incorporated in 1967 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "6890.T": {
        "short_name": "FERROTEC HOLDINGS CORPORATION",
        "long_name": "Ferrotec Holdings Corporation",
        "summary": "Ferrotec Holdings Corporation engages in semiconductor equipment-related, electronic device, and other businesses in Japan and internationally. The company offers vacuum seals, silicon wafers, vacuum coating systems, quartz products, ceramics products, CVD-SiC parts, silicon parts, and quartz crucibles, as well as parts cleaning services for semiconductor and FPD manufacturing equipment. It also provides ferrofluids; thermo-electric modules; power semiconductor DCB and AMB substrates; ingots, wafers, and cells for solar modules; industrial cleaning equipment; and machine blades. In addition, the company manufactures and sells automobile related products; manufactures and sells devices, parts, consumables, and consumable components for semiconductor manufacturing equipment; natural energy machinery; and scientific equipment and supplies, as well as imports and exports goods, technology, and systems. Additionally, it offers mechanical cutters for information, steel, paper pulp and meat industry; and industrial machines and parts, as well as landscaping and greening, green space management, and slope construction services. The company was formerly known as Fellow Tech Holdings Co., Ltd. and changed its name to Ferrotec Holdings Corporation in April 2007. Ferrotec Holdings Corporation was founded in 1980 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6938.T": {
        "short_name": "SOSHIN ELECTRIC CO",
        "long_name": "Soshin Electric Co.,Ltd.",
        "summary": "Soshin Electric Co.,Ltd. produces and sells products for use in the industrial, information, and communication equipment. The company offers EMC solutions, such as EMI filters for use in various applications, such as industrial apparatus, telecommunication equipment, and medical systems; EMC noise testers; and ring and cut cores for noise suppression on signal line. It also provides couplers, including hybrid and directional couplers, Doherty combiners, power dividers, and baluns; multilayered dielectric filters comprising RF/IF filters; chip mica capacitors; and LC/coaxial dielectric filters. Soshin Electric Co.,Ltd. was founded in 1938 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6963.T": {
        "short_name": "ROHM CO LTD",
        "long_name": "ROHM Co., Ltd.",
        "summary": "ROHM Co., Ltd. manufactures and sells electronic components worldwide. The company offers ICs, including memory, amplifiers and linear, power management, clocks and timers, switches and multiplexers, logic, data converter, sensors and MEMS, digital power, display drivers, motor/actuator driver, interface, communication and speech synthesis LSI, audio and video, and microcontrollers. It also provides discrete semiconductor products, such as diodes, bipolar transistors, and MOSFETs. In addition, the company offers power devices, including SiC power devices, IGBT, IPM, and power diodes and transistors; passive devices, such as resistors, tantalum capacitors, and conductive polymer capacitors; opto devices comprising LEDs, LED displays, laser diodes, and optical sensors; and modules, including power modules, wireless communication modules, print heads, and battery less radio modules, as well as chipsets. Its products are used for the industry, automotive, consumer electronics, and PC/communications applications. The company was formerly known as Toyo Electronics Industry Corporation and changed its name to ROHM Co., Ltd. in 1981. ROHM Co., Ltd. was founded in 1958 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kyoto"
    },
    "6967.T": {
        "short_name": "SHINKO ELECTRIC INDUSTRIES CO",
        "long_name": "Shinko Electric Industries Co., Ltd.",
        "summary": "Shinko Electric Industries Co., Ltd. manufactures and sells semiconductor packages for semiconductor and electronics manufacturers in Japan and internationally. The company offers IC packages, including plastic-BGA substrates, build-up substrates, and lead frames. It also provides molded core embedded package for substitution of package on package and system in package, and small modules; high heat dissipation and high density flip chip package for automotive infotainment and image processing processors; and module assembly solutions, as well as supports Cu pillar, a terminal that connects an interposer with a semiconductor chip by thermal compression flip chip technology. In addition, the company offers various components, such as glass-to-metal seals, heat spreaders, and ceramic electro static chucks. Further, it provides testing services in the areas of electrical properties, automatic inspection of solder balls, temperature cycle screening, baking, and tray and tape packing. The company was founded in 1946 and is headquartered in Nagano, Japan. Shinko Electric Industries Co., Ltd. is a subsidiary of Fujitsu Limited.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Nagano"
    },
    "6973.T": {
        "short_name": "KYOEI SANGYO CO",
        "long_name": "Kyoei Sangyo Co.,Ltd.",
        "summary": "Kyoei Sangyo Co.,Ltd. sells semiconductors, electric devices, industrial machinery, printed circuit boards, software, and information and communication systems. It supplies semiconductor products, such as microcomputer, memory, ASIC, exclusive and general-purpose IC, and discreet products, as well as power, optical, high frequency, and security device products; and electronic devices comprising fuses, polyswitches, varistors, serge absorbers, thermistors, EMI filters, liquid crystal panels, common/normal mode coils, LED products, and soft ferrites. The company also offers electronic materials, including phosphor bronze, nickel silver, beryllium copper, yellow brass, special alloy, rare earth magnet, PCB materials, semiconductor lead frames, interface cables, synthetic products, and resin products; processing machines, such as laser beam and electrical discharge machines; and CNC units, senser solutions, industrial-use robots, FA-IT solutions, and metal and plastic 3D printers. In addition, it provides FA and cold heating equipment, industrial robots, manufacturing products, inverters, moist processors, air conditioner updates, LED lightnings, and eco pumps, as well as energy saving, solar, video/security, hygiene, and other products; and manufactures build-up construction, metal cored, multi-layer, and flexible printed wiring boards, as well as printed wiring board for modules. Further, the company develops software for construction industry comprising integration, quotation related, execution budget, cost management, ERP, repair plan making, and other systems, as well as embedded systems and hardware products; provides software for various industries; and manufactures printed circuit boards. Additionally, it develops information and communication systems; offers robot AI solutions; and designs IC. The company was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7087.T": {
        "short_name": "WILLTEC CO LTD",
        "long_name": "WILLTEC Co.,Ltd.",
        "summary": "WILLTEC Co., Ltd. primarily provides contracted manufacturing services in Japan and internationally. The company is involved in dispatching construction engineers; the sale of controlled equipment and device components; and system and software development business. It also offers human resources and training consulting, printing, Web creation, shared, repair, and entrusted manufacturing equipment services. The company was founded in 1992 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "7420.T": {
        "short_name": "SATORI ELECTRIC CO",
        "long_name": "Satori Electric Co., Ltd.",
        "summary": "Satori Electric Co., Ltd., together with its subsidiaries, distributes electronic components and equipment in Japan, China, Taiwan, and internationally. The company operates through two segments, Device Solution and System Solution. It offers discrete semiconductors, electrical parts and materials, control components, and factory automation and systems; and IoT and embedded solutions, as well as contract services. The company is also involved in the development and production of information control systems and switching devices, as well as in the design, development, and testing of customized integrated circuits and microprocessors; and promotion and information gathering activities. In addition, it designs, develops, manufactures, and sells switch products for electric tools. The company was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7467.T": {
        "short_name": "HAGIWARA ELECTRIC HLDS CO LTD",
        "long_name": "Hagiwara Electric Holdings Co., Ltd.",
        "summary": "Hagiwara Electric Holdings Co., Ltd. sells electronic devices and equipment in Japan, North America, Europe, and Asia. The company's Electronic Devices business sells microcontrollers, system on chips, power semiconductors, transformers, connectors, aluminum electrolyte capacitors, and LCD Modules. Its Technology Solutions business provides information technology (IT) solutions comprising measurement and factory automation solutions; embedded platforms and devices; security, cloud, and data center solutions, as well as Internet of Things; and IT platforms in the business domains, including factories, social infrastructure, IT infrastructure, and medicine and healthcare. The company was formerly known as Hagiwara Electric Co., Ltd. and changed its name to Hagiwara Electric Holdings Co., Ltd. in April 2018. Hagiwara Electric Holdings Co., Ltd. was founded in 1948 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Nagoya"
    },
    "7729.T": {
        "short_name": "TOKYO SEIMITSU CO",
        "long_name": "Tokyo Seimitsu Co., Ltd.",
        "summary": "Tokyo Seimitsu Co., Ltd. manufactures and sells semiconductor production equipment (SPE) and metrology instruments in Japan, Taiwan, China, and internationally. The company operates through SPE and Metrology Equipment segments. It provides wafer probing machines, wafer dicing machines, polish grinders, wafer manufacturing machines, chemical mechanical planarizers, precision dicing blades, and high rigid grinders. The company also offers multipurpose measuring instruments, including coordinate measuring machines, surface texture and contour measuring instruments, roundness and cylindrical profile measuring instruments, and optical measuring instruments. In addition, it provides automatic measuring instruments, such as in process and post process gauge products, various types of sensors and electric/air micrometers, high precision digital measurement instruments, and laser interferometer/built-in measuring instruments. The company was formerly known as Tokyo Seimitsu Kogu Co., Ltd. and changed its name to Tokyo Seimitsu Co., Ltd. in April 1962. The company was incorporated in 1949 and is headquartered in Hachioji, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Hachioji"
    },
    "7735.T": {
        "short_name": "SCREEN HOLDINGS CO LTD",
        "long_name": "SCREEN Holdings Co., Ltd.",
        "summary": "SCREEN Holdings Co., Ltd. develops, manufactures, sells, and maintains semiconductor production equipment in Japan, Taiwan, South Korea, China, the United States, Europe, and internationally. It operates in four segments: Semiconductor Production Equipment Business, Graphic Arts Equipment Business, Display Production Equipment and Coater Business, and PCB-Related Equipment Business. The company offers coat/develop trackers, wafer cleaning systems, annealing systems, measurement systems, inspection systems, and advanced packaging lithography equipment. It also provides coater systems, vacuum film deposition equipment, wet processors, dryers, heaters, exposures, and laminators/de-laminators. In addition, the company offers direct imaging systems, automatic optical inspection systems, automatic optical photomask inspection systems, and defect verification and repair systems; automatic final visual inspection systems; and setup stations and defect tabulation software. Further, it provides high-speed inkjet, label, wide format, CTP, network support, Hiragino font, and other workflow solutions; offset printing, digital book, manual, direct mail, transpromo, label production, package printing, display, and signage solutions; and artificial intelligence, text mining, augmented reality, image analysis, and congestion analysis solutions. Additionally, the company offers biosciences equipment; compact inkjet printing systems for tablets, UV inkjet printing systems for aluminum rolls, and inkjet printing systems for tablets; in-vehicle components for inspection and measurement; and lithium-ion rechargeable batteries and fuel cells. It also undertakes contract manufacturing and support, and intellectual property services related operations. The company was formerly known as Dainippon Screen Mfg. Co., Ltd. and changed its name to SCREEN Holdings Co., Ltd. in October 2014. SCREEN Holdings Co., Ltd. was founded in 1943 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kyoto"
    },
    "7826.T": {
        "short_name": "FURUYA METAL CO LTD",
        "long_name": "Furuya Metal Co., Ltd.",
        "summary": "Furuya Metal Co., Ltd. manufactures and sells industrial-use precious metal products and temperature sensors in Japan. The company offers various metals processing products, such as iridium products comprising crucibles, seed holders, and after heaters; platinum (Pt) equipment and Pt alloy or reinforced Pt products for melting optical and LCD glass; Pt crucibles, evaporation dishes, and boats; mesh, sheets, foils, pipes, and wire products; and thermocouples, which are used in temperature measurement and control in high temperature processes, as well as high temperature furnace. It also provides precious metal sputtering targets for magnetic recording media, flat panel display, semiconductor, and electronic component applications; evaporation materials; and made-to-order sputtering services for magnetic recording, touch panels, non-volatile semiconductor memory, electric devices, and electric components, as well as offers patterning and thin film analysis services. In addition, the company provides inorganic and organic compounds, SAPd catalyst, and recycling and refining products. Further, it offers vibration testers and parts palletizers under the IDEX brand; and iridium tools for friction stir welding. The company's products have applications in the information and communication, clean energy, semiconductor, environment, and electronic sectors. Furuya Metal Co., Ltd. was founded in 1951 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8068.T": {
        "short_name": "RYOYO ELECTRO CORP",
        "long_name": "Ryoyo Electro Corporation",
        "summary": "Ryoyo Electro Corporation, an electronics trading company, distributes semiconductors, ICT products, and embedded devices in Japan and rest of Asia. The company offers analog and power, logic, and memory semiconductors. It also provides PC/Server/Network, I/O equipment, and software products, as well as engineering support and other services. The company was formerly as Ryoyo Electronics Corporation and changed its name to Ryoyo Electro Corporation in 1985. Ryoyo Electro Corporation was founded in 1961 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8084.T": {
        "short_name": "RYODEN CORPORATION",
        "long_name": "Ryoden Corporation",
        "summary": "Ryoden Corporation sells factory automation (FA) systems, cooling and heating systems, information and communication technologies (ICT) and facilities systems, and electronics in Japan and internationally. The company's FA Systems segment offers sequencers, servo systems, inverters, motors, programmable controllers, various display devices, sensors, circuit breakers for wiring, NC devices, and industrial robots; laser and electric discharge processing machines, as well as industrial sewing machines; and machine vision, traceability, production management, and automation systems. Its Cooling & Heating Systems segment provides packaged air conditioners, room air conditioners, chilling units, EcoCute, low temperature devices, drink coolers, cleanroom thermostatic and humidistatic systems, ventilation devices, and heat countermeasure equipment. The company's ICT & Facilities Systems segment offers elevators, escalators, solar power generation systems, digital signage, PCs, servers, other information processing devices, video and image information systems, RFID devices and systems, surveillance cameras, computer peripheral devices, computer supplies, medical facilities, medical supplies, and plant factory-related equipment. Its Electronics segment provides microcomputers, memory, logic, analog measurement, ASIC, power devices, optical elements, discrete systems, sensors, batteries, connectors, printed circuit boards, other device components, and equipment and machinery; display devices, such as LCD, organic EL, and LED; general electronic components comprising coils, capacitors, resistors, and filters; materials consisting of aluminum, high performance resin materials, etc.; and shaped materials covering processed metals and molded plastics. The company was formerly known as Ryoden Trading Company, Limited and changed its name to Ryoden Corporation in June 2016. Ryoden Corporation was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8150.T": {
        "short_name": "SANSHIN ELECTRONICS CO",
        "long_name": "Sanshin Electronics Co., Ltd.",
        "summary": "Sanshin Electronics Co., Ltd. sells and trades in electronic components and devices in Japan and internationally. The company offers integrated circuits, semiconductor elements, and general electronic components; and electronic devices, such as office-automation equipment, communications equipment, and video equipment. It also develops applied software for microcontrollers and simulations for semi-custom LSIs. In addition, the company offers IT infrastructure solutions, including WAN/LAN/mobile, virtualization, cloud, office communication, security, and operational support; video solutions, such as live relay systems, program transmission systems, IPTV systems, nonlinear editing systems, studio systems, and various video solutions; and various support and services, including call-center services, maintenance-support services, and system-configuration services. Further, it provides application services in the areas of data analysis systems; call-center systems; individual system development; cloud/software as a service; business systems comprising sales, accounting, payroll, attendance, production, etc.; and groupware consisting of e-mail, schedule management, facility reservation, etc. Additionally, the company offers housing, cloud computing, system integration, and operation and maintenance services, as well as support services for construction of networks/circuits. It serves leading electronic makers, newspaper publishing companies, broadcast stations, government offices, schools, etc. The company was incorporated in 1951 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9995.T": {
        "short_name": "GLOSEL CO LTD",
        "long_name": "Glosel Co., Ltd.",
        "summary": "Glosel Co., Ltd. operates as a semiconductor technological trading company in Japan. It sells integrated circuits, semiconductor devices, display devices, and other electric parts and instruments. The company also offers storage products, printed wiring boards, sensors, communication devices, and optic products. In addition, it develops semiconductor strain sensors under the STREAL brand; and develops and designs electric instruments. Further, it provides design and development, and contracted services, including custom LSI development, embedded software development, and EMS. The company was formerly known as RENESAS EASTON Co., Ltd. and changed its name to Glosel Co., Ltd. in July 2019. Glosel Co., Ltd. was founded in 1954 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "DAO.F": {
        "short_name": "SCREEN HOLDINGS CO. LTD.",
        "long_name": "SCREEN Holdings Co., Ltd.",
        "summary": "SCREEN Holdings Co., Ltd. develops, manufactures, sells, and maintains semiconductor production equipment in Japan, Taiwan, South Korea, China, the United States, Europe, and internationally. It operates in four segments: Semiconductor Production Equipment Business, Graphic Arts Equipment Business, Display Production Equipment and Coater Business, and PCB-Related Equipment Business. The company offers coat/develop trackers, wafer cleaning systems, annealing systems, measurement systems, inspection systems, and advanced packaging lithography equipment. It also provides coater systems, vacuum film deposition equipment, wet processors, dryers, heaters, exposures, and laminators/de-laminators. In addition, the company offers direct imaging systems, automatic optical inspection systems, automatic optical photomask inspection systems, and defect verification and repair systems; automatic final visual inspection systems; and setup stations and defect tabulation software. Further, it provides high-speed inkjet, label, wide format, CTP, network support, Hiragino font, and other workflow solutions; offset printing, digital book, manual, direct mail, transpromo, label production, package printing, display, and signage solutions; and artificial intelligence, text mining, augmented reality, image analysis, and congestion analysis solutions. Additionally, the company offers biosciences equipment; compact inkjet printing systems for tablets, UV inkjet printing systems for aluminum rolls, and inkjet printing systems for tablets; in-vehicle components for inspection and measurement; and lithium-ion rechargeable batteries and fuel cells. It also undertakes contract manufacturing and support, and intellectual property services related operations. The company was formerly known as Dainippon Screen Mfg. Co., Ltd. and changed its name to SCREEN Holdings Co., Ltd. in October 2014. SCREEN Holdings Co., Ltd. was founded in 1943 and is headquartered in Kyoto, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Kyoto"
    },
    "FJH.F": {
        "short_name": "MACNICA FUJI ELECTR.HLDGS",
        "long_name": "Macnica Fuji Electronics Holdings, Inc.",
        "summary": "Macnica Fuji Electronics Holdings, Inc., through its subsidiaries, engages in the import, export, and distribution of electronic components in Japan and internationally. It offers semiconductor devices and ICs. The company was founded in 2015 and is headquartered in Yokohama, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "MHC.F": {
        "short_name": "MEGACHIPS CORP.",
        "long_name": "MegaChips Corporation",
        "summary": "MegaChips Corporation provides chip solutions in Japan. The company offers application specific integrated circuits; MEMS timing devices; automotive ethernet PHY; wired communication networks; and LCD timing controllers for various input and output interfaces, such as HDTVs and smart devices. MegaChips Corporation was incorporated in 1967 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "NEN.F": {
        "short_name": "RENESAS ELECTRONICS CORP.",
        "long_name": "Renesas Electronics Corporation",
        "summary": "Renesas Electronics Corporation, together with its subsidiaries, researches, develops, designs, manufactures, sells, and services semiconductors in Japan, China, North America, Europe, rest of Asia, and internationally. It operates through Automotive Business and Industrial/Infrastructure/IoT Business segments. The company offers microcontrollers (MCUs) and microprocessors; analog products, such as amplifiers, audio and video, data converters, power line communication, and switches and multiplexer products; automotive products, including battery management, interface, power devices, power management, sensors, video and display, wireless power, system-on-chips, and MCU products; and clock ICs and clock timing solutions, such as specific clocks, clock distribution and generation, jitter attenuators, and crystal oscillator products. It also provides interface and connectivity products, including buffers, wireless modules, data compression, industrial Ethernet, IO-link line driver, memory interface, optical interconnect, photocouplers/optocouplers, power line communication, signal integrity, telecom datacom and interface, USB switches and hubs, video broadcast software and ASICs, VME, and wireless broadband modem products. In addition, the company offers memory and logic products, such as low power static random access memory; power and power management products; RF and microwave products; sensor products; SMD, MIL-STD-883 (/883), and Class-V/Q products. Further, it provides automotive information devices, such as in-vehicle infotainment and instrument panels. The company offers its products for automotive, communication, healthcare, computing, home and building, industrial, personal electronic, technology, and other applications. Renesas Electronics Corporation was founded in 2002 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "OIA.MU": {
        "short_name": "AOI ELECTRONICS CO.",
        "long_name": "AOI Electronics Co., Ltd.",
        "summary": "AOI Electronics Co., Ltd. manufactures and sells electronic parts in Japan. It offers integrated circuits, modules, thick film thermal print heads, optical sensors, LED products, chip resistor networks, and micro electro mechanical system devices. The company was founded in 1969 and is headquartered in Takamatsu, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Japan",
        "city": "Takamatsu"
    },
    "RNECF": {
        "short_name": "RENESAS ELECTRONICS CORP",
        "long_name": "Renesas Electronics Corporation",
        "summary": "Renesas Electronics Corporation, together with its subsidiaries, researches, develops, designs, manufactures, sells, and services semiconductors in Japan, China, North America, Europe, rest of Asia, and internationally. It operates through Automotive Business and Industrial/Infrastructure/IoT Business segments. The company offers microcontrollers (MCUs) and microprocessors; analog products, such as amplifiers, audio and video, data converters, power line communication, and switches and multiplexer products; automotive products, including battery management, interface, power devices, power management, sensors, video and display, wireless power, system-on-chips, and MCU products; and clock ICs and clock timing solutions, such as specific clocks, clock distribution and generation, jitter attenuators, and crystal oscillator products. It also provides interface and connectivity products, including buffers, wireless modules, data compression, industrial Ethernet, IO-link line driver, memory interface, optical interconnect, photocouplers/optocouplers, power line communication, signal integrity, telecom datacom and interface, USB switches and hubs, video broadcast software and ASICs, VME, and wireless broadband modem products. In addition, the company offers memory and logic products, such as low power static random access memory; power and power management products; RF and microwave products; sensor products; SMD, MIL-STD-883 (/883), and Class-V/Q products. Further, it provides automotive information devices, such as in-vehicle infotainment and instrument panels. The company offers its products for automotive, communication, healthcare, computing, home and building, industrial, personal electronic, technology, and other applications. Renesas Electronics Corporation was founded in 2002 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "RNECY": {
        "short_name": "RENESAS ELECTRONICS CORP",
        "long_name": "Renesas Electronics Corporation",
        "summary": "Renesas Electronics Corporation, together with its subsidiaries, researches, develops, designs, manufactures, sells, and services semiconductors in Japan, China, North America, Europe, rest of Asia, and internationally. It operates through Automotive Business and Industrial/Infrastructure/IoT Business segments. The company offers microcontrollers (MCUs) and microprocessors; analog products, such as amplifiers, audio and video, data converters, power line communication, and switches and multiplexer products; automotive products, including battery management, interface, power devices, power management, sensors, video and display, wireless power, system-on-chips, and MCU products; and clock ICs and clock timing solutions, such as specific clocks, clock distribution and generation, jitter attenuators, and crystal oscillator products. It also provides interface and connectivity products, including buffers, wireless modules, data compression, industrial Ethernet, IO-link line driver, memory interface, optical interconnect, photocouplers/optocouplers, power line communication, signal integrity, telecom datacom and interface, USB switches and hubs, video broadcast software and ASICs, VME, and wireless broadband modem products. In addition, the company offers memory and logic products, such as low power static random access memory; power and power management products; RF and microwave products; sensor products; SMD, MIL-STD-883 (/883), and Class-V/Q products. Further, it provides automotive information devices, such as in-vehicle infotainment and instrument panels. The company offers its products for automotive, communication, healthcare, computing, home and building, industrial, personal electronic, technology, and other applications. Renesas Electronics Corporation was founded in 2002 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "ROHCY": {
        "short_name": "ROHM CO LTD",
        "long_name": "ROHM Co., Ltd.",
        "summary": "ROHM Co., Ltd. manufactures and sells electronic components worldwide. The company offers ICs, including memory, amplifiers and linear, power management, clocks and timers, switches and multiplexers, logic, data converter, sensors and MEMS, digital power, display drivers, motor/actuator driver, interface, communication and speech synthesis LSI, audio and video, and microcontrollers. It also provides discrete semiconductor products, such as diodes, bipolar transistors, and MOSFETs. In addition, the company offers power devices, including SiC power devices, IGBT, IPM, and power diodes and transistors; passive devices, such as resistors, tantalum capacitors, and conductive polymer capacitors; opto devices comprising LEDs, LED displays, laser diodes, and optical sensors; and modules, including power modules, wireless communication modules, print heads, and battery less radio modules, as well as chipsets. Its products are used for the industry, automotive, consumer electronics, and PC/communications applications. The company was formerly known as Toyo Electronics Industry Corporation and changed its name to ROHM Co., Ltd. in 1981. ROHM Co., Ltd. was founded in 1958 and is headquartered in Kyoto, Japan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Kyoto"
    },
    "ROM.F": {
        "short_name": "ROHM CO. LTD",
        "long_name": "ROHM Co., Ltd.",
        "summary": "ROHM Co., Ltd. manufactures and sells electronic components worldwide. The company offers ICs, including memory, amplifiers and linear, power management, clocks and timers, switches and multiplexers, logic, data converter, sensors and MEMS, digital power, display drivers, motor/actuator driver, interface, communication and speech synthesis LSI, audio and video, and microcontrollers. It also provides discrete semiconductor products, such as diodes, bipolar transistors, and MOSFETs. In addition, the company offers power devices, including SiC power devices, IGBT, IPM, and power diodes and transistors; passive devices, such as resistors, tantalum capacitors, and conductive polymer capacitors; opto devices comprising LEDs, LED displays, laser diodes, and optical sensors; and modules, including power modules, wireless communication modules, print heads, and battery less radio modules, as well as chipsets. Its products are used for the industry, automotive, consumer electronics, and PC/communications applications. The company was formerly known as Toyo Electronics Industry Corporation and changed its name to ROHM Co., Ltd. in 1981. ROHM Co., Ltd. was founded in 1958 and is headquartered in Kyoto, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Kyoto"
    },
    "SKS.F": {
        "short_name": "SHINKO EL.IND.LTD",
        "long_name": "Shinko Electric Industries Co., Ltd.",
        "summary": "Shinko Electric Industries Co., Ltd. manufactures and sells semiconductor packages for semiconductor and electronics manufacturers in Japan and internationally. The company offers IC packages, including plastic-BGA substrates, build-up substrates, and lead frames. It also provides molded core embedded package for substitution of package on package and system in package, and small modules; high heat dissipation and high density flip chip package for automotive infotainment and image processing processors; and module assembly solutions, as well as supports Cu pillar, a terminal that connects an interposer with a semiconductor chip by thermal compression flip chip technology. In addition, the company offers various components, such as glass-to-metal seals, heat spreaders, and ceramic electro static chucks. Further, it provides testing services in the areas of electrical properties, automatic inspection of solder balls, temperature cycle screening, baking, and tray and tape packing. The company was founded in 1946 and is headquartered in Nagano, Japan. Shinko Electric Industries Co., Ltd. is a subsidiary of Fujitsu Limited.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Nagano"
    },
    "TWA.F": {
        "short_name": "TOWA CORP.",
        "long_name": "TOWA Corporation",
        "summary": "TOWA Corporation designs, develops, manufactures, and sells semiconductor manufacturing equipment and high-precision molds in Japan and internationally. Its products include molding equipment, singulation equipment, ultra-precision molds, THPL-CBN end mills, and TEN-systems; and semiconductor encapsulating and laser processing equipment, as well as fine plastic molded products. The company also offers manufacturing systems for electronic components, precision-molded and assembly products, medical-use equipment, and precision machining tools. In addition, it sells used equipment. The company was formerly known as TOWA Precision Industries Limited and changed its name to TOWA Corporation in December 1988. TOWA Corporation was incorporated in 1979 and is headquartered in Kyoto, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Kyoto"
    },
    "XSK.F": {
        "short_name": "SANKEN EL.",
        "long_name": "Sanken Electric Co., Ltd.",
        "summary": "Sanken Electric Co., Ltd. manufactures, purchases, and sells electric equipment and apparatus. The company operates through two segments, Semiconductor Devices Business and Power System Business. Its Semiconductor Devices Business segment manufactures and sells power modules, power ICs, control ICs, hall-effect ICs, bipolar transistors, MOSFET, IGBT, thyristors, rectifier diodes, and light emitting diodes (LEDs). This segment serves the automobiles, home appliances, industrial machinery, audio visual and office automation equipment, telecommunications equipment, and LED lighting sectors. The company's Power System Business segment manufactures and sells uninterruptible power supplies, inverters, DC power supplies, airway beacon systems, switching mode power supply units and transformers. It also undertakes electronic, telecommunication, and other construction works. The company has operations in Japan, China, Korea, the United States, Europe, and internationally. The company was formerly known as Toho Sanken Electric Co., Ltd. and changed its name to Sanken Electric Co., Ltd. in June 1962. Sanken Electric Co., Ltd. was founded in 1946 and is headquartered in Niiza, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Niiza"
    }
}