{
    "2138.T": {
        "short_name": "CROOZ INC",
        "long_name": "CROOZ, Inc.",
        "summary": "CROOZ, Inc. engages in the e-commerce, media and advertising, gaming, and investment and financial businesses. The company plans, develops, and operates SHOPLIST.com, a fashion mail order; and offers EC site system construction, operation contract, fulfillment, and other solutions. It also provides advertising agency and media services; plans, develops, and manages games for smartphones; and invests in private equity funds. The company was founded in 2001 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0033",
        "website": "http://www.crooz.co.jp",
        "market_cap": "Large Cap"
    },
    "2186.T": {
        "short_name": "SOBAL CORPORATION",
        "long_name": "Sobal Corporation",
        "summary": "Sobal Corporation engages in the development of embedded software for digital appliances, and research and development of wireless communication technologies primarily in Japan. The company offers various engineering services, including worker dispatching, trustee business, and contract work; and quality evaluation and manual production services, as well as IoT solutions. It also provides firmware and device drivers for digital cameras, video products, televisions, signage products, various recorders, switchers, digital complex machines, laser printers, ink-jet printers, sublimation printers, label printers, scanners, handy terminals, and embedded browsers. In addition, the company offers application software, such as video editing and delivery, poster creation supporting, document management, print management, and car navigation software, as well as graphic library and various simulators; and Web application services for answering machines, portal sites, medical information transmission systems, and various internal systems, as well as employment support for schools. Further, it provides hardware products comprising image filter, display, and analysis circuits, as well as various arithmetic circuits. Sobal Corporation was founded in 1983 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0001",
        "website": "http://www.sobal.co.jp",
        "market_cap": "Mid Cap"
    },
    "2303.T": {
        "short_name": "DAWN CORP",
        "long_name": "Dawn Corp.",
        "summary": "Dawn Corp. engages in the research, development, and sale of GIS engine in Japan. The company also offers GIS consulting, cloud map application, homepage access log analysis, cloud mail delivery, and cloud emergency call services. In addition, it engages in the contract development of GIS applications. Dawn Corp. was founded in 1991 and is headquartered in Kobe, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kobe",
        "zipcode": "651-0086",
        "website": "http://www.dawn-corp.co.jp",
        "market_cap": "Mid Cap"
    },
    "2321.T": {
        "short_name": "SOFTFRONT HOLDINGS",
        "long_name": "Softfront Holdings",
        "summary": "Softfront Holdings develops SIP and VoIP related technologies in the real-time communication field in Japan. It is involved in the communication software and service businesses. The company was formerly known as Softfront Co., Ltd. and changed its name to Softfront Holdings in August 2016. Softfront Holdings was founded in 1997 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0075",
        "website": "http://www.softfront.co.jp",
        "market_cap": "Mid Cap"
    },
    "2334.T": {
        "short_name": "EOLE INC",
        "long_name": "eole Inc.",
        "summary": "eole Inc. manages applications for PCs and smartphones in Japan. The company offers Easy contact network, a free group communication service; contact network application solutions; Gakuba, a part-time job site; and Raku-Raku Part-time Job, a recruitment portal site that allows to search and compare job offers. It is also involved in the Internet advertising business; development and provision of pinpoint, a private data management platform, as well as HR advertisement platform; and sales promotion business. The company was founded in 2001 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0074",
        "website": "http://www.eole.co.jp",
        "market_cap": "Mid Cap"
    },
    "2345.T": {
        "short_name": "KUSHIM INC",
        "long_name": "Kushim, Inc.",
        "summary": "Kushim, Inc. provides learning solutions in Japan. It offers e-learning solutions, such as Smart Learning Accelerator Platform (SLAP), an e-learning system; iStudy LMS for e-learning, training management, learning management, content management, group training management, skill management, etc; e-content services that offers skill acquisition through e-learning, such as AI, blockchain, IoT, new business development, etc.; millvi, a cloud-based video distribution system; and studio services, including video shooting and editing. The company also provides training in the field of IT human resource development and production; system engineering services; security consultation; education instructor dispatch services; virtual shareholders' meeting support; contract research and system contract development; and consulting services. The company was formerly known as iStudy Co., Ltd. and changed its name to Kushim, Inc. in April 2020. Kushim, Inc. was founded in 1997 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0062",
        "website": "http://www.kushim.co.jp",
        "market_cap": "Mid Cap"
    },
    "2352.T": {
        "short_name": "AZIA CO LTD",
        "long_name": "Azia Co., Ltd.",
        "summary": "Azia Co., Ltd. develops and sells application software primarily in Japan. The company offers WEBCAS, a series of CRM application software to build relationship with customers through email and Internet. It also engages in the development of Web sites and corporate business systems; and planning and production of email and Web content. The company was founded in 1995 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.azia.jp",
        "market_cap": "Mid Cap"
    },
    "2432.T": {
        "short_name": "DENA CO LTD",
        "long_name": "DeNA Co., Ltd.",
        "summary": "DeNA Co., Ltd. develops and operates mobile and online services worldwide. The company operates Coopel, a cloud robotic process automation service; Mobage, a platform that hosts free-to-play mobile games; Yahoo! Mobage, which offers games for PC browsers; and AndApp, a platform that allows users to play mobile game apps on PC browsers under the same user account. It also operates Anyca, a mobile app for peer-to-peer car sharing; SOMPO DE NORU, a car leasing service; Easy Ride, a robo-vehicle mobility service; GO, a taxi dispatch app; and DRIVE CHART, an accident reduction support service. In addition, the company offers MYCODE, a direct-to-consumer genetic testing service; kencom, which supports health insurance societies to manage their members' health data; SHOWROOM, a virtual stage where fans can watch their artists perform live while interacting with them in real time; and Pococha, a social live streaming community. Further, it provides Everystar, a mobile website for user-generated novels; Manga Box, a weekly manga magazine app; and Mobaoku that allows users to manage their auction items and bids from their mobile phones. Additionally, the company offers Yokohama DeNA Baystars, Yokohama DeNA Running Club, and Kawasaki Brave Thunders sports services. DeNA Co., Ltd. was founded in 1999 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-8510",
        "website": "http://www.dena.com",
        "market_cap": "Large Cap"
    },
    "2492.T": {
        "short_name": "INFOMART CORPORATION",
        "long_name": "Infomart Corporation",
        "summary": "Infomart Corporation operates an online business to business (BtoB) EC trading platform for the food industry in Japan. It offers BtoB platform matching, BtoB platform ordering, BtoB platform standards database, BtoB platform invoicing, BtoB platform quoting, BtoB platform contract, and BtoB platform industry news and data portal. The company was founded in 1998 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0022",
        "website": "http://www.infomart.co.jp",
        "market_cap": "Large Cap"
    },
    "2497.T": {
        "short_name": "UNITED INC",
        "long_name": "UNITED, Inc.",
        "summary": "UNITED, Inc. engages in the ad-technology, content, and investment businesses in Japan. It offers Bypass, adstir, and Crash Fever ad technology services. The company also operates CHEERZ, a service to help artists activities; produces sports-related websites; plans and develops media; plans and operates gift sites; plans, develops, and operates TechAcademy, a Japan's online programming school; and provides consulting solutions to support digital transformation of companies. It is also involved in the venture capital investment business. UNITED, Inc. was founded in 1998 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0002",
        "website": "http://www.united.jp",
        "market_cap": "Large Cap"
    },
    "3390.T": {
        "short_name": "INEST INC",
        "long_name": "INEST, Inc.",
        "summary": "INEST, Inc. provides smart solutions in Japan. The company sells mobile phones, smart phones, and tablet terminals. It is also involved in the development, sale, operation, and maintenance of Web services. In addition, the company operates as an ASP for stores, such as drinking chains. Further, it operates Otoku Keitai.net, a mobile/smartphone sales site; a retrieval and reservation site to takeout; a visit reservation site; a site for parking reservation in sport and event venues, and airports; and a portal site to search and make reservations for mobile shops, as well as sells specialized digital signage for real estate and ASP remote monitoring systems. The company was formerly known as Universal Solution Systems Inc. INEST, Inc. was founded in 1996 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "170-0013",
        "website": "http://www.inest-inc.co.jp",
        "market_cap": "Mid Cap"
    },
    "3653.T": {
        "short_name": "MORPHO INC",
        "long_name": "Morpho, Inc.",
        "summary": "Morpho, Inc. engages in the research, development, and licensing of image processing technologies in Japan. It offers image and motion stabilization; AI inference software; video processing software package; artificial bokeh effect; flash reduction; noise reduction; HDR and DR-corrected image generation; panorama image generation; high-speed video generation; visual SLAM; and motion vector and face detection. The company also provides imaging effect filters library; rectangle object detection and extraction; image classification and super resolution; focus-adjustable image generation; frame interpolator; and posture estimation technologies. Its solutions are embedded in camera phones, digital cameras, and other mobile devices. Morpho, Inc. was founded in 2004 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0065",
        "website": "http://www.morphoinc.com",
        "market_cap": "Mid Cap"
    },
    "3663.T": {
        "short_name": "ARTSPARK HOLDINGS INC",
        "long_name": "ArtSpark Holdings Inc.",
        "summary": "ArtSpark Holdings Inc. engages in the UI/UX and creator support businesses. It develops UI solutions to manufacturers of mobile devices and digital home appliances primarily in the automotive field. The company also provides illustration, comic, and animation creation software and web services, as well as e-book solutions. The company was founded in 2012 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-0023",
        "website": "http://www.artspark.co.jp",
        "market_cap": "Large Cap"
    },
    "3673.T": {
        "short_name": "BROADLEAF CO LTD",
        "long_name": "Broadleaf Co., Ltd.",
        "summary": "Broadleaf Co., Ltd. develops and provides software, and IT solutions and services for the automotive aftermarket, and other business sectors and industries in Japan. The company offers broadleaf cloud platform; IT solutions, such as customer management, sales management, and inventory management systems; and operations analysis software. It also provides big data analysis related to automobiles and other services to mobile phone distributors, travel agencies, bus operators, and machine tools dealers. Broadleaf Co., Ltd.s was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "140-0002",
        "website": "http://www.broadleaf.co.jp",
        "market_cap": "Large Cap"
    },
    "3683.T": {
        "short_name": "CYBERLINKS CO LTD",
        "long_name": "Cyberlinks Co., Ltd.",
        "summary": "Cyberlinks Co., Ltd. provides IT cloud and mobile network services for the system development, installation, maintenance, and operational support in Japan. The company offers its services for the distribution industry and government agencies, as well as in the areas of medical information system, product information and image database, school education institution, CATV-ISP, hardware maintenance, and specialty store sales management system. It also operates 7 DoCoMo stores that sell smartphones, mobile phones, data cards, etc. to corporate users or general users; and consulting and after-sales services, etc. The company was founded in 1964 and is headquartered in Wakayama, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Wakayama",
        "zipcode": "641-0012",
        "website": "http://www.cyber-l.co.jp",
        "market_cap": "Large Cap"
    },
    "3687.T": {
        "short_name": "FIXSTARS CORPORATION",
        "long_name": "Fixstars Corporation",
        "summary": "Fixstars Corporation operates as a software company in Japan and internationally. The company offers M3 technical support, processor evaluation, software development and optimization, OS firmware development support, system configuration, training for software developers, and other services. It serves in the area of automotive, flash storage, industrial, finance, healthcare, and computing. Fixstars Corporation was founded in 2002 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0032",
        "website": "http://www.fixstars.com",
        "market_cap": "Large Cap"
    },
    "3689.T": {
        "short_name": "IGNIS LTD",
        "long_name": "IGNIS LTD.",
        "summary": "IGNIS LTD. designs, develops, operates, and sells smartphone applications in Japan. It develops tool-based applications, free casual games, and native social games, as well as communication applications. The company was founded in 2010 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0013",
        "website": "http://1923.co.jp",
        "market_cap": "Large Cap"
    },
    "3692.T": {
        "short_name": "FFRI SECURITY INC",
        "long_name": "FFRI Security, Inc.",
        "summary": "FFRI Security, Inc. provides cyber security products in Japan. The company engages in the research, consulting, information provision, and education of computer security and network systems. It is also involved in the planning, development, sale, leasing, maintenance, management, and operation of computer software and programs; and the acquisition, transfer, lending, and management of related property right, such as copyrights, patent rights, utility model rights, trademark rights, and design rights. The company was founded in 2007 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.ffri.jp",
        "market_cap": "Large Cap"
    },
    "3697.T": {
        "short_name": "SHIFT INC",
        "long_name": "SHIFT, Inc.",
        "summary": "SHIFT, Inc. provides software quality assurance and testing solutions in Japan. The company offers CAT, an integrated environment that supports the implementation of testing; CI (Jenkins), an outsourcing service for agile development, such as GUI automatic testing using Jenkins and Selenium Web Driver; test design solutions; non-functional testing solutions, such as load and security tests; and localization solutions. It also provides MinTest, a Website to report bugs of social games and applications. In addition, the company plans, manufactures, and sells electrical and electronics goods, software, and hardware, as well as manufactures, sells, and imports and exports related goods. SHIFT, Inc. offers its solutions in the areas of EPR/groupware, accounting, e-commerce, finance, medical/nursing, aerospace, manufacturing/retail, and real estate, as well as for smart phones and security servers. The company was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "106-0041",
        "website": "http://www.shiftinc.jp",
        "market_cap": "Large Cap"
    },
    "3710.T": {
        "short_name": "JORUDAN CO LTD",
        "long_name": "Jorudan Co.,Ltd.",
        "summary": "Jorudan Co.,Ltd. engages in the development of program products in Japan. It offers Japan Transit Planner, a service that helps to search routes, fares, and schedules of trains and airplanes in Japan. The company is also involved in the planning, designing, development, and maintenance of systems, software, and Fintech solutions; production of digital contents; provision of mobile and Internet contents; travel; advertisement; publishing; sales and maintenance of hardware; development and maintenance of software; and electronic commerce business. The company was founded in 1979 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-0022",
        "website": "http://www.jorudan.co.jp",
        "market_cap": "Mid Cap"
    },
    "3712.T": {
        "short_name": "INFORMATION PLANNING CO",
        "long_name": "Information Planning CO., LTD.",
        "summary": "Information Planning CO., LTD. provides system consulting services primarily for financial institutions. The company offers credit risk management related products, including comprehensive financial statement registration solution, collateral/ real estate management, self-assessment/ delinquency management, and risk weighing solutions. It also provides loan related products, such as loan approval support, contract create support, benchmark aggregation, business feasibility evaluation support, and public relations support map system; general affairs/ accounting related products comprising fixed asset management, settlement business support, anti-social forces information check, equity management, expense payment office work support, and securities management systems; and tax/ accounting related products, such as real-time connection and fixed asset management systems. In addition, the company engages in the real estate leasing and management activities; and provides development, planning, and system data input agency services. Information Planning CO., LTD. was founded in 1986 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": null,
        "website": "http://www.jyohokikaku.co.jp",
        "market_cap": "Mid Cap"
    },
    "3727.T": {
        "short_name": "APLIX CORPORATION",
        "long_name": "Aplix Corporation",
        "summary": "Aplix Corporation engages in the technology business. It develops package software for the NeXT computer system; CD/DVD authoring software; automotive telematics systems; java for consumer electronics; and JBlend software on mobile phones. The company also develops and markets Internet of Things products from hardware and software to cloud service; and develops wireless communication technologies that connect consumer electronic products to mobile devices. In addition, it offers communication modules, Wi-Fi solutions, BLE/Wi-Fi gateways, and embedded water flow sensors. The company was formerly known as Aplix IP Holdings Corporation and changed its name to Aplix Corporation in April 2017. Aplix Corporation was founded in 1986 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "169-0051",
        "website": "http://www.aplix.co.jp",
        "market_cap": "Mid Cap"
    },
    "3744.T": {
        "short_name": "SIOS CORPORATION",
        "long_name": "SIOS Corporation",
        "summary": "SIOS Corporation engages in the open system infrastructure and application businesses. It offers LifeKeeper, a software that automatically recovers system failures in the cloud; OSS-related products; and Sios OSS Yorozu Consultation Office, a service for various inquiries about OSS, and consulting services for various information systems. The company also provides software products for multi-function peripheral, which are management support systems for financial institution; S-S Gluegent series of cloud services; and contract development of corporate information systems, and consulting services for various information systems. In addition, it engages in the development, building, and operation of information systems; software development, sales, and maintenance; and cloud services development. The company was formerly known as SIOS Technology, Inc. and changed its name to SIOS Corporation in October 2017. The company was founded in 1997 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.sios.com",
        "market_cap": "Mid Cap"
    },
    "3787.T": {
        "short_name": "TECHNO MATHEMATICAL CO.LTD",
        "long_name": "Techno Mathematical Co., Ltd.",
        "summary": "Techno Mathematical Co., Ltd. develops software and hardware IPs in Japan. Its products includes LSI/board, audio, video, still image, voice, encryption, multimedia BC, windows media, noise suppression, super resolution, lossless/visually lossless, FPGA, original codec, high compression, frame rate converter, low latency, filter, and Gstreamer. The company develops and licenses image, audio, and voice related software IPs for various types of digital equipment; and hardware IPs used for design data for silicon chips. It also provides and licenses single function LSIs based on IPs and solutions for various multimedia applications. The company was founded in 2000 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0031",
        "website": "http://www.tmath.co.jp",
        "market_cap": "Mid Cap"
    },
    "3800.T": {
        "short_name": "UNIRITA INC",
        "long_name": "Unirita Inc.",
        "summary": "Unirita Inc. provides software and solutions for information technology (IT) systems operation in Japan and internationally. The company offers lifecycle management for IT services; A-AUTO, an advanced automatic job scheduling and monitoring system that automates application scheduling, execution, and control in multi-platform environments; and Sky-Eye Tribune, a monitoring system, which provides resource management, network management, server management, and desktop management services. It also provides TIA Report, a total information analysis report system that enables proactive system management and planning; BSP-RM, an integrated multiplatform report management system, which stores and distributes report data created in application programs; Exentry, a data entry system; and Be.Learning, an e-learning system that specializes in IT system operations management. In addition, the company offers A-SPOOL, an advanced report management system, which stores, separates, bundles, prints, and archives application reports; and A-LOG, a job log and system log management system. Further, it provides professional services and consultation in the management of IT systems operation; Sys-Doc., a service for diagnosing systems operation; and software products and support services. The company serves finance, manufacturing, pharmaceutics, and telecommunications industries, as well as data centers, outsourcers, and system integrators. Unirita Inc. was founded in 1982 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-6029",
        "website": "http://www.unirita.co.jp",
        "market_cap": "Large Cap"
    },
    "3823.T": {
        "short_name": "ACRODEA INC",
        "long_name": "Acrodea, Inc.",
        "summary": "Acrodea, Inc. provides services and solutions for smartphones in Japan. The company offers platform services for smartphones and IoT related solutions; social game and application related development services; Technical Pitch to analyze pitching data; Kisekae touch, a home application to change the design of the home screen background, application icon, drawer, etc.; and intercom IoT systems. It also engages in real estate subleases, trademark rights management, and food businesses; conducting IT seminar business for job seekers and general users; and provision of corporate training services. Acrodea, Inc. was founded in 2004 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-0005",
        "website": "http://www.acrodea.co.jp",
        "market_cap": "Mid Cap"
    },
    "3826.T": {
        "short_name": "SYSTEM INTEGRATOR CORP",
        "long_name": "System Integrator Corp.",
        "summary": "System Integrator Corp. plans, develops, and sells packaging software and cloud services in Japan. It offers ERP, EC, omni channel, project management, database development and design support, application design, and e-learning tools. The company's products include AISIA, a design recognition solution; TOPSIC, an online and in real time cloud solution to evaluate a range of engineers' programming skills from beginner to advanced; SI Object Browser, a database development support tool; SI Object Browser ER, a data modeling tool; and SI Object Browser Designer, an AI design document preparation tool. Its products also comprise SI Object Browser PM, an integrated project management tool; SI Web Shopping, an EC site construction package software; and GRANDIT, a Web-based ERP. In addition, the company offers consulting services. System Integrator Corp. was founded in 1995 and is headquartered in Saitama, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Saitama",
        "zipcode": "330-6032",
        "website": "http://www.sint.co.jp",
        "market_cap": "Mid Cap"
    },
    "3835.T": {
        "short_name": "EBASE CO LTD",
        "long_name": "eBase Co., Ltd.",
        "summary": "eBase Co., Ltd. engages in the planning, development, sale, and maintenance of content management software in Japan. It primarily offers eBASE, an enterprise information exchange platform for product information and various content management software within the company. The company provides various food industry solutions, including food supermarkets, food wholesale, processed food manufacturers, restaurant, claim information management, food labeling countermeasure, i-Tre cooperative, transaction document management, and food traceability solutions. It also offers daily miscellaneous goods industry, residential industry, data pool, printing industry, and sales support solutions, as well as middleware. The company was founded in 2001 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "531-0072",
        "website": "http://www.ebase.co.jp",
        "market_cap": "Large Cap"
    },
    "3836.T": {
        "short_name": "AVANT CORPORATION",
        "long_name": "Avant Corporation",
        "summary": "Avant Corporation, through its subsidiaries, provides business intelligence, data integration, and system engineering services. The company also offers consolidated accounting and business management services; and business outsourcing services. In addition, it provides disclosure information search and financial analysis services; search engine for laws, accounting, and tax practice; and English disclosure document creation services. AVANT Corporation has strategic alliance with Metapraxis Ltd. The company was formerly known as Diva Corporation and changed its name to Avant Corporation in October 2013. Avant Corporation was founded in 1997 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-6113",
        "website": "http://www.avantcorp.com",
        "market_cap": "Large Cap"
    },
    "3841.T": {
        "short_name": "JEDAT INC.",
        "long_name": "Jedat Inc.",
        "summary": "Jedat Inc., a research and development oriented company, develops, sells, and distributes electronic design automation (EDA) software for designing semiconductor devices and chips (LSIs) and liquid crystal display panels worldwide. It offers Alpha-SX, an EDA software that is used in semiconductor design applications, as well as a range of applications, such as flat-panel displays, MEMS, lead frames, and semiconductor packages. The company also provides LSI, flat panel display, and fine pattern design solutions. In addition, it offers training services related to EDA software; development services for custom software, PDK for specific process, and specific Spice model; and analog LSI design consulting services, as well as design environment building and improvement support services. The company was founded in 1980 and is headquartered in Tokyo, Japan. Jedat Inc. is a subsidiary of ARGO GRAPHICS Inc.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0043",
        "website": "http://www.jedat.co.jp",
        "market_cap": "Mid Cap"
    },
    "3853.T": {
        "short_name": "ASTERIA CORPORATION",
        "long_name": "Asteria Corporation",
        "summary": "Asteria Corporation develops and sells software. Its products include ASTERIA Warp, a data integration middleware that supports automation of operations through non-programming technology; SnapCal, which provides seamless integration for Google calendar, tasks, and iOS calendar; and lino, a sticky and canvas service. The company also provides Handbook, a mobile content management platform for tablets and smartphones; and product support, consulting, and training services. Asteria Corporation was founded in 1998 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "140-0014",
        "website": "http://www.asteria.com",
        "market_cap": "Large Cap"
    },
    "3856.T": {
        "short_name": "ABALANCE CORPORATION",
        "long_name": "Abalance Corporation",
        "summary": "Abalance Corporation, together with its subsidiaries, engages in information technology (IT), construction machine sales, and solar power generation businesses in Japan. It offers KnowledgeMarket, an information sharing/knowledge management tool; Robowiser Framework, a tool that realizes automation of tasks; and Nintex Workflow related products, as well as provides outsourcing and consulting services. The company also offers photovoltaic power generation systems; develops, designs, manufactures, and sells Maxar, a solar module; and Eco Smart View, a solar monitoring system for green energy facilities. In addition, it engages in the sale, lease, and rental of new and used construction and equipment. The company was formerly known as REALCOM Inc. and changed its name to Abalance Corporation in March 2017. Abalance Corporation was founded in 2000 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "140-0002",
        "website": "http://www.abalance.co.jp",
        "market_cap": "Large Cap"
    },
    "3905.T": {
        "short_name": "DATASECTION INC",
        "long_name": "Datasection Inc.",
        "summary": "Datasection Inc. provides solutions for social media analysis, retail marketing, and artificial intelligence development in Japan, Chile, and Colombia. Its solutions include product review survey; lifestyle analysis; brand image measurement; public opinion polls; Insight Intelligence Q, a tool that allows to search and analyze consumer voices on the web; and Social Monitor, a risk monitoring tool that constantly checks the consumer voices. The company also offers FollowUP, a tool that analyzes the behavior of the store visitors; and artificial intelligence solutions comprising data crawling, image processing, and social media data analysis. The company was founded in 2000 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0031",
        "website": "http://www.datasection.co.jp",
        "market_cap": "Mid Cap"
    },
    "3909.T": {
        "short_name": "SHOWCASE INC",
        "long_name": "Showcase Inc.",
        "summary": "Showcase Inc. provides Website optimization services in Japan. The company offers NaviCast Form Assist, an entry form optimization (EFO) tool that measures to enhance the input rate in order to maximize the results; NaviCast Form Converter, mobile EFO that optimizes forms for smartphones; and Bitwave, an advertisement distribution service centered on SNS and videos. It also provides online authentication services, such as personal authentication, face authentication, license reading, etc.; ID Checker, a SaaS-type e-KYC tool that performs identity verification through a smartphone browser; and business automation support services, including RPA, industry-specific SaaS, video marketing support, etc. The company was founded in 1996 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "106-0032",
        "website": "http://www.showcase-tv.com",
        "market_cap": "Mid Cap"
    },
    "3910.T": {
        "short_name": "MKSYSTEM CORPORATION",
        "long_name": "MKSystem Corporation",
        "summary": "MKSystem Corporation provides system development and ASP services in Japan. It operates in two segments, Shalom Business and CuBe Business. The company provides DirectHR, a solution for corporate personnel and general affairs divisions. It is also involved in the contracted development of front-end systems for the personnel and general affairs divisions of large companies to enhance their business processes. In addition, the company offers GooooN cloud services. It serves social insurance labor consultant offices, social insurance labor consulting corporations, labor insurance office associations, SR management labor centers, and general companies. MKSystem Corporation was founded in 1989 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0015",
        "website": "http://www.mks.jp",
        "market_cap": "Mid Cap"
    },
    "3913.T": {
        "short_name": "SMEDIO INC",
        "long_name": "sMedio, Inc.",
        "summary": "sMedio, Inc. provides software development and services worldwide. The company offers multimedia and wireless connectivity solutions. It offers sMedio Face Detector, a face recognition solution; sMedio Emotion Recognition, a facial expression recognition solution; sMedio Gender Recognition and sMedio Age Recognition solutions, which estimates gender and age from a detected face; sMedio Motion Recognition that detects moving people in a video, and recognizes their motions as standing, sitting, walking, running, or falling; and sMedio Object Tracker, objects detection and tracking solution in a video. The company also provides sMedio IoT Gateway Solution, a gateway software for IoT devices; sMedio IoT Edge Device SDK, a software development solution for IoT edge devices; JS Backup, a backup tool; JS backup viewer, a photo viewer application; RiskFinder, a web service for vulnerability assessment on Android applications; tourbillon3, a HTML, BML, and IPTV based embedded browser; and Valution BD, a Blu-ray Disc playback software. In addition, it offers sMedio DTCP MOVE, an app for NAS system; sMedio True VR, a multimedia solution for virtual reality; sMedio True VR Sound, an engine to enable monaural sound to be 3D spatialize sound; sMedio pConnect for connecting the iOS/Android smartphone to PC; sMedio TV Suite for Android and Windows; sMedio TrueLink+ Hi-Res Edition, a multifunctional media player that enables Hi-res audio playback; and sMedio Remote Access Solutions for remote access servers and clients. sMedio, Inc. was founded in 2007 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0033",
        "website": "http://www.smedio.co.jp",
        "market_cap": "Mid Cap"
    },
    "3915.T": {
        "short_name": "TERRASKY CO LTD",
        "long_name": "TerraSky Co.,Ltd.",
        "summary": "TerraSky Co.,Ltd. provides cloud products and solutions in Japan and internationally. It offers cloud integration services comprising Salesforce, Amazon Web services, Heroku, contact center solutions, SAP migration, and RPA Total Solutions; cloud consulting services, such as cloud ERP concierge, system planning, AppExchange consulting, IoT consulting, marketing automation operation support, and BI tool introduction support services; and development support tools, such as DataSpider cloud, SkyOnDemand, DCSpider, SkyVisualEditor, SuPICE, and Flosum. The company was formerly known as Head Solutions Co., Ltd. and changed its name to Terasakai Co.,Ltd. in February 2007. TerraSky Co.,Ltd. was founded in 2006 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0027",
        "website": "http://www.terrasky.co.jp",
        "market_cap": "Large Cap"
    },
    "3917.T": {
        "short_name": "IRIDGE INC",
        "long_name": "iRidge, Inc.",
        "summary": "iRidge, Inc. engages in the planning, development, and operation of Internet services in Japan. It develops O2O applications; offers promotion planning, communication design, and business development services; financial technology solutions, including MoneyEasy and BUS PAY; real estate technology/voice user interface solutions, such as digital signage for condominiums, offices, and commercial facilities, as well as NOID, a voice AI assistants solution. The company was founded in 2008 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "106-0041",
        "website": "http://iridge.jp",
        "market_cap": "Mid Cap"
    },
    "3921.T": {
        "short_name": "NEO JAPAN INC",
        "long_name": "NEOJAPAN Inc.",
        "summary": "NEOJAPAN Inc. develops and sells packaged software to small and medium-sized enterprises, large companies, schools, hospitals, local governments, and public agencies primarily in Japan. The company offers desknet's NEO, a groupware software; AppSuite, a tool to create custom business applications; ChatLuck, a chat-based business communication tool; and desknet's DB, an online database system, which enables sharing of information. It also provides Denbun, a Web-based email system for corporate clients that manages, sends, and receives emails through a Web browser; desknet's DAX, a file transfer system; desknet's SSS, a Web-based sales management system, which enables to monitor progress in business negotiations, client info, and sales; desknet's CAMS, a Web-based customer relationship management system; and desknet's Blog, a blog system. It also provides multi-application integration and hosting services; and system integration services, such as e-business system, e-commerce Website, infrastructure and middleware, application service provider Website construction, and online information distribution services, as well as application system construction for business and information purposes. NEOJAPAN Inc. was founded in 1992 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "220-8110",
        "website": "http://www.neo.co.jp",
        "market_cap": "Large Cap"
    },
    "3933.T": {
        "short_name": "CHIERU CO LTD",
        "long_name": "CHIeru Co.,Ltd.",
        "summary": "CHIeru Co.,Ltd. produces ICT environments for teaching and learning in schools in Japan and internationally. Its services include software and system products, teaching and learning resources, and strategic consulting for school ICT environments in primary and higher education. The company offers CaLabo EX, a computer-assisted digital language lab solution; InterCLASS Cloud, a cloud-based classroom management system; CaLabo LX software to support teacher and student activities in PC labs, classrooms, and libraries; and CaLabo TX, a classroom management system for tablet PCs. It also provides S300-AV, a hardware-based screen and audio sharing system; and S300-HD, a digital video/sound transfer system. The company was founded in 2006 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "140-0002",
        "website": "http://www.chieru.com",
        "market_cap": "Large Cap"
    },
    "3936.T": {
        "short_name": "GLOBALWAY INC",
        "long_name": "Globalway, Inc.",
        "summary": "Globalway, Inc. engages in the social web media business in Japan. The company operates calicone, a company reviews information site, which is used by various working people and job hunting students. It also provides career consulting services for the industry people. In addition, the company develops and licenses Voxer, a cloud application that offers CRM, ERP, and OMS solutions;  and offers installation and introduction support services, as well as development and operational support services. Globalway, Inc. was founded in 2004 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0013",
        "website": "http://www.globalway.co.jp",
        "market_cap": "Small Cap"
    },
    "3937.T": {
        "short_name": "UBICOM HOLDINGS INC",
        "long_name": "Ubicom Holdings, Inc.",
        "summary": "Ubicom Holdings, Inc. engages in the development of software in Japan. The company is involved in the application and system development; embedded software, firmware, and drivers development for printers, input/output devices, storage devices, and mobile devices; and software testing business. It also provides medical information systems, such as Mighty checker, a reception inspection software; Mighty Cube, an ordering check software; and Mighty Trace System, a cell culture process support support system, as well as offers data analysis, system development, and consulting services. In addition, the company is involved in the AI application development, proof of concept development, and corpus creation support business; and provision of data analysis, visualization, extraction, conversion, loading, and cleansing services. Further, it engages in the test automation support service; test process automation design, construction, installation support; development and provision of automation tools; and test result analysis business. The company was formerly known as AWS Holdings, Inc. and changed its name to Ubicom Holdings, Inc. in July 2017. Ubicom Holdings, Inc. was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "112-0002",
        "website": "http://www.ubicom-hd.com",
        "market_cap": "Large Cap"
    },
    "3967.T": {
        "short_name": "ELTES CO LTD",
        "long_name": "Eltes Co.,Ltd.",
        "summary": "Eltes Co.,Ltd. provides database risk and storage protection consultation services in Japan. It offers social and internal risk management, online reputation management, digital credit, and security services. The company also support information banks, smart-cities, and e-Government with construction of infrastructures for secure information exchange and heavy transactions based on distributed databases and personal authentication systems. The company was founded in 2004 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.eltes.co.jp",
        "market_cap": "Mid Cap"
    },
    "3969.T": {
        "short_name": "ATLED LTD",
        "long_name": "ATLED CORP.",
        "summary": "ATLED CORP. engages in the development and sale of software solutions in Japan. It offers X-point, a workflow system for medium-sized and small businesses; X-point Cloud, a cloud workflow system for small businesses; and Agile Works, an enterprise workflow system for large and medium-sized enterprises. The company also provides cloud services. ATLED CORP. was incorporated in 2007 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0002",
        "website": "http://www.atled.jp",
        "market_cap": "Large Cap"
    },
    "3976.T": {
        "short_name": "SHANON INC",
        "long_name": "SHANON Inc.",
        "summary": "SHANON Inc. provides cloud solutions for corporate marketing issues. It offers cloud planning and development for marketing, as well as consulting and outsourcing services related to marketing. The company was founded in 2000 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0073",
        "website": "http://www.shanon.co.jp",
        "market_cap": "Mid Cap"
    },
    "3986.T": {
        "short_name": "BBREAK SYSTEM COMPANY LTD",
        "long_name": "bBreak Systems Company, Limited",
        "summary": "bBreak Systems Company, Limited builds and integrates business system solutions. It offers MA-EYES, an accounting management system that allows users to understand profits and losses in real time; GLOBAL EYES, an overseas offices management system, which allows the users to use the local language and to create the accounting data in the local currency; and J-Fusion that provides tools for developing systems, as well as information regarding programming practices, project specifications, and data modeling. The company was founded in 2002 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0031",
        "website": "http://www.bbreak.co.jp",
        "market_cap": "Mid Cap"
    },
    "3ME.F": {
        "short_name": "SMEDIO INC.",
        "long_name": "sMedio, Inc.",
        "summary": "sMedio, Inc. provides software development and services worldwide. The company offers multimedia and wireless connectivity solutions. It offers sMedio Face Detector, a face recognition solution; sMedio Emotion Recognition, a facial expression recognition solution; sMedio Gender Recognition and sMedio Age Recognition solutions, which estimates gender and age from a detected face; sMedio Motion Recognition that detects moving people in a video, and recognizes their motions as standing, sitting, walking, running, or falling; and sMedio Object Tracker, objects detection and tracking solution in a video. The company also provides sMedio IoT Gateway Solution, a gateway software for IoT devices; sMedio IoT Edge Device SDK, a software development solution for IoT edge devices; JS Backup, a backup tool; JS backup viewer, a photo viewer application; RiskFinder, a web service for vulnerability assessment on Android applications; tourbillon3, a HTML, BML, and IPTV based embedded browser; and Valution BD, a Blu-ray Disc playback software. In addition, it offers sMedio DTCP MOVE, an app for NAS system; sMedio True VR, a multimedia solution for virtual reality; sMedio True VR Sound, an engine to enable monaural sound to be 3D spatialize sound; sMedio pConnect for connecting the iOS/Android smartphone to PC; sMedio TV Suite for Android and Windows; sMedio TrueLink+ Hi-Res Edition, a multifunctional media player that enables Hi-res audio playback; and sMedio Remote Access Solutions for remote access servers and clients. sMedio, Inc. was founded in 2007 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0033",
        "website": "http://www.smedio.co.jp",
        "market_cap": "Small Cap"
    },
    "4011.T": {
        "short_name": "HEADWATERS CO LTD",
        "long_name": "Headwaters Co.,Ltd",
        "summary": "Headwaters Co.,Ltd engages in planning and developing artificial intelligence (AI) applications in Japan. It is also involved in the digital transformation, AI platform operation, cloud service operation, cloud robotics service, and robot application production activities. The company was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-0022",
        "website": "http://www.headwaters.co.jp",
        "market_cap": "Mid Cap"
    },
    "4013.T": {
        "short_name": "KINJIRO CO LTD",
        "long_name": "Kinjiro Co.,Ltd.",
        "summary": "Nittsu System Co., Ltd. provides human resource management solutions. The company develops package software, including employment, HR, payroll, healthcare, and labor cost management system solutions. It also offers hardware, such as Linux-equipped time clock/working terminals and time correction devices. In addition, the company offers support services comprising operational consulting, system introduction, and post-installation support; undertakes time clock/working terminal installation, LAN wiring, and electrical facility construction works; and TV conference/rental conference room services. Nittsu System Co., Ltd. was founded in 1981 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0021",
        "website": "http://www.nittsusystem.co.jp",
        "market_cap": "Large Cap"
    },
    "4014.T": {
        "short_name": "KARADANOTE INC",
        "long_name": "Karadanote Inc.",
        "summary": "Karadanote Inc. plans and develops tools related to pregnancy, childbirth, and childcare for medication and health management. It also provides media planning and management services; and insurance agency services. The company was founded in 2008 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0011",
        "website": "http://corp.karadanote.jp",
        "market_cap": "Mid Cap"
    },
    "4015.T": {
        "short_name": "ARARA INC",
        "long_name": "arara inc.",
        "summary": "arara inc. provides various technology solutions in Japan. The company engages in the development and provision of CRM services featuring reward point, e-money, and other functions for promoting Â\u0091point+plus'; P-Pointer' data security solutions; augmented reality services, such as Â\u0091ARAPPLI' and Â\u0091ARAPPLI SIGNAGE'; and QR code related services covering Â\u0091QRQR - QR Code Reader' and Â\u0091QRQR Manager'. It also provides blockchain solutions; and offers and manages Â\u0091arara messaging solutions', which are high-speed email delivery solutions. The company was founded in 2006 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0062",
        "website": "http://www.arara.com",
        "market_cap": "Mid Cap"
    },
    "4019.T": {
        "short_name": "STAMEN CO LTD",
        "long_name": "Stamen Co.,Ltd.",
        "summary": "Stamen Co.,Ltd. engages in the planning, development, and sale of cloud platforms. It offers TUNAG, an engagement management platform; and FANTS, an online subscription fan salon. The company was founded in 2016 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "453-0012",
        "website": "http://stmn.co.jp",
        "market_cap": "Mid Cap"
    },
    "4020.T": {
        "short_name": "BETREND CORPORATION",
        "long_name": "Betrend Corporation",
        "summary": "BeTREND Corporation provides SaaS type mobile marketing services. The company offers Smart CRM platform, as well as Internet store launch and operation support services. It also provides customer information management, information distribution, smartphone application/site construction, and option services. The company was founded in 2000 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0052",
        "website": "http://www.betrend.com",
        "market_cap": "Mid Cap"
    },
    "4052.T": {
        "short_name": "FICHA INC",
        "long_name": "Ficha Inc.",
        "summary": "Ficha Inc. develops and sells image recognition software for car cameras. It provides object detection software for Advanced Driver Assistance System (ADAS). The company also provides Driver Monitoring System (DMS), a system for monitoring the driver's driving condition with an in-vehicle camera to prevent dangerous driving and accidents. Ficha Inc. was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "170-6019",
        "website": "http://ficha.jp",
        "market_cap": "Mid Cap"
    },
    "4054.T": {
        "short_name": "NIHON JYOHO CREATE CO LTD",
        "long_name": "Nihon Jyoho Create Co.,Ltd.",
        "summary": "Nihon Jyoho Create Co., Ltd. engages in developing and providing IT solutions for the real estate industry in Japan. Its products and services include inter-company property distribution service that supports property information sharing and property purchasing to other companies; brokerage support service that supports brokerage works, such as advertisement placement, attracting customers, adding customers, applying for residence, IT critical theory, and electronic contract; management work support service, which supports rental management operations comprising contract conclusion/entrance/exit management, rent payment management, owner remittance, and building repair management; and consumer support service that supports operations, such as contacting tenants and reporting to the owner. Nihon Jyoho Create Co., Ltd. was founded in 1994 and is based in Miyakonojo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Miyakonojo",
        "zipcode": "885-0072",
        "website": "http://www.n-create.co.jp",
        "market_cap": "Large Cap"
    },
    "4058.T": {
        "short_name": "TOYOKUMO INC",
        "long_name": "Toyokumo, Inc.",
        "summary": "Toyokumo, Inc., a service company, engages in the development and provision of cloud services for businesses. It offers safety confirmation service 2, an automatic safety confirmation system; Form Bridge, a service to create forms to be published on the web; Print Creator, a service that uses the data registered in the kintone application to print out forms; kViewer, a linked service for publishing; kMailer, an email sending system that works with kintone; Data collect, a kintone collaboration service; kBackup, a service for data preservation; and Timestamp, a service to save electronic books. The company was founded in 2010 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0031",
        "website": "http://toyokumo.co.jp",
        "market_cap": "Large Cap"
    },
    "4060.T": {
        "short_name": "RAKUMO INC",
        "long_name": "rakumo Inc.",
        "summary": "rakumo Inc. develops and sells cloud-based extension tools in Tokyo, Japan. Its products include rakumo for G Suite, a cloud-type extension tool group that shares the user management, authentication, and security functions of G Suite; and rakumo for Salesforce, a cloud extension tool that includes rakumo Social Scheduler, which changes the behavior of daily schedule to change the next behavior, as well as rakumo Sync that synchronizes with Google Calendar schedule in real time. The company is also involved in the sale of information and communication equipment and software. rakumo Inc. was founded in 2004 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0083",
        "website": "http://rakumo.com",
        "market_cap": "Mid Cap"
    },
    "4165.T": {
        "short_name": "PLAID INC",
        "long_name": "PLAID,Inc.",
        "summary": "PLAID, Inc. develops and operates KARTE, a cloud-based customer experience (CX) platform in Japan. Its CX platform analyzes the behavior of customers who use websites and apps and realizes tailored communication to customers. The company also engages in the planning and management of EC-specialized media, Shopping Tribe; and CX-specialized media, XD. It serves finance/insurance, human resources, wholesale/retail/merchandise, apparel/sports/outdoors, real estate, IT services, media and digital content, travel/transportation, manufacturer, and healthcare and education industries. The company was founded in 2011 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0061",
        "website": "http://plaid.co.jp",
        "market_cap": "Large Cap"
    },
    "4166.T": {
        "short_name": "CACCO INC",
        "long_name": "Cacco Inc.",
        "summary": "Cacco Inc. provides data science based SaaS type algorithms and software solutions, and support services to businesses primarily in Japan. The company offers fraud detection, payment consulting, and data science solutions. Its solutions include O-PLUX, a cloud service to detect fraudulent orders on EC sites; and O-MOTION, a cloud service to detect unauthorized access to clients' sites. The company was founded in 2011 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0051",
        "website": "http://cacco.co.jp",
        "market_cap": "Mid Cap"
    },
    "4167.T": {
        "short_name": "KOKOPELLI INC",
        "long_name": "Kokopelli Inc.",
        "summary": "Kokopelli Inc. provides technology solutions for small and medium-sized enterprises in Japan. The company is developing and providing Big Advance, a management support platform; and FAI, an AI module. It also provides management, task management and productivity, bookkeeping/payroll accounting, and Web production support services. The company was founded in 2007 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0084",
        "website": "http://www.kokopelli-inc.com",
        "market_cap": "Large Cap"
    },
    "4168.T": {
        "short_name": "YAPPLI INC",
        "long_name": "Yappli, Inc.",
        "summary": "Yappli, Inc. engages in smartphone app development activities in Japan. It offers cloud-based platform for mobile application development, management, and analysis. The company was founded in 2013 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "106-0032",
        "website": "http://yappli.co.jp",
        "market_cap": "Large Cap"
    },
    "4169.T": {
        "short_name": "ENECHANGE LTD",
        "long_name": "ENECHANGE Ltd.",
        "summary": "ENECHANGE Ltd. engages in the energy platform and energy data businesses. It offers Energy Marketing Acceleration Platform (EMAP), a cloud-based optimal marketing support service platform for electricity/gas retailers for electricity/gas price simulation, and support for new entrants; EMAP electricity/gas customer acquisition platform; and ENECHANGE Technology for Energy Digitalisation, a cloud-hosted, artificial intelligence (AI) driven technology platform. The company also provides EMAP plan information service, Smart-Meter Analytics Platform (SMAP) profitability analysis; SMAP demand response service. In addition, it offers technology for deregulation in the areas of electricity/gas switching service for the home, AI-based smart-switching, customer acquisition service, balancing group intermediation, and energy usage optimization. The company was founded in 2015 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0004",
        "website": "http://www.enechange.co.jp",
        "market_cap": "Large Cap"
    },
    "4173.T": {
        "short_name": "WACUL INC",
        "long_name": "Wacul. Inc",
        "summary": "WACUL INC. engages in web consulting business in Japan. It offers artificial intelligence (AI) tool that can automatically discover issues in data and propose improvements; provides AI Analyst SEO that offers article content specialized for CV acquisition through the analysis and improvement know-how of AI analysts; and AI Analyst AD that analyses and improves know-how has been used to turn advertising operation know-how into a service. The company was founded in 2010 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0052",
        "website": "http://wacul.co.jp",
        "market_cap": "Large Cap"
    },
    "4174.T": {
        "short_name": "APPIRITS INC",
        "long_name": "Appirits Inc.",
        "summary": "Appirits Inc. develops and sells web services and related consulting services. Its services also cover infrastructure construction, maintenance, and monitoring of various web service systems; contract development of various web service systems; and planning, design, development, and operation of online games. In addition, its solutions include AWS implementation design/development, Smartphone application development, EC order/inventory centralized management ASP, and in-site search ASP. Further, it provides web marketing design services, such as UX and UI design and production, and SEO and SEM consulting services, as well as Google Analytics data solutions, training, and support desk services; smartphone-enabled and app development services; security services, including security, web application, platform, and smartphone application diagnostics services, as well as software testing and cloud based web application firewall services; and dispatch and staffing services. Appirits Inc. was founded in 2000 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0001",
        "website": "http://appirits.com",
        "market_cap": "Mid Cap"
    },
    "4192.T": {
        "short_name": "SPIDERPLUS & CO",
        "long_name": "SpiderPlus & Co.",
        "summary": "SpiderPlus & Co. engages in the development and sale of SPIDERPLUS, a drawing and site management application for the construction and maintenance industry in Japan. The company's solution enables site foreman in construction industry to organize drawings, manage photos, and output forms, as well as to perform various inspections. It also serves equipment and electric companies. The company was formerly known as Regolith, Inc. and changed its name to SpiderPlus & Co. in September 2020. SpiderPlus & Co. was founded in 1997 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "170-0013",
        "website": "http://spiderplus.co.jp",
        "market_cap": "Large Cap"
    },
    "4284.T": {
        "short_name": "SOLXYZ CO LTD",
        "long_name": "SOLXYZ Co., Ltd.",
        "summary": "SOLXYZ Co., Ltd. develops software solutions in Japan. It offers system consulting, outsourcing, and other related services, as well as system integration services for financial, distribution, media business, and public services. The company was founded in 1981 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0023",
        "website": "http://www.solxyz.co.jp",
        "market_cap": "Large Cap"
    },
    "4299.T": {
        "short_name": "HIMACS LTD",
        "long_name": "HIMACS, Ltd.",
        "summary": "HIMACS, Ltd. provides defined valued processes for various system lifecycles in Japan. Its integrated services comprise consulting for computer software system planning, as well as design, development, testing, implementation, and systems maintenance. HIMACS, Ltd. was founded in 1976 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "231-0005",
        "website": "http://www.himacs.jp",
        "market_cap": "Large Cap"
    },
    "4312.T": {
        "short_name": "CYBERNET SYSTEMS CO",
        "long_name": "Cybernet Systems Co., Ltd.",
        "summary": "Cybernet Systems Co., Ltd. provides computer-aided engineering (CAE), and IT solutions and services worldwide. The company offers CAE solutions for structural analysis, control design, mechanical analysis, thermal fluid analysis, optics design, illumination design, electronic circuit design, acoustic analysis, pre-and-post processing, formula manipulation, tolerance optimization, simulation language, general-purpose visualization, and medical image processing; and business solutions for innovation support, host access network security, client security, asset management, and office productivity improvement. It also provides multi-domain solutions, including non-linear model predictive control design, motor drive simulation, digital image reproduction, and optimization solutions; and visualization solutions, which include versatile visualization, healthcare/medical, augmented reality and virtual reality, and special-purpose display and system solutions. In addition, the company offers IT solutions, such as information security management solutions, PC asset and software license asset management, PC/host connections, telephone-based authentication services, and smartphone applications; and design optimization support based on quality engineering and tolerance analysis solutions. Further, it provides engineering services comprising control system design or model-based development, optical design/lighting analysis related, PCB design/simulation, optimization, process integration, tolerance analysis, and visualization for medical, structure, electromagnetic, thermal fluid, civil engineering/environment, and chemistry/molecular fields; and professional services, such as seminars, user education, technical support, contracted analysis support, consulting, and contracted analysis service, as well as develops interfaces, models, and analysis modules for analysis. The company was founded in 1985 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0022",
        "website": "http://www.cybernet.co.jp",
        "market_cap": "Large Cap"
    },
    "4323.T": {
        "short_name": "JAPAN SYSTEM TECHNIQUES CO",
        "long_name": "Japan System Techniques Co., Ltd.",
        "summary": "Japan System Techniques Co., Ltd. engages in the software business in Japan. It operates through four segments: Software Business, Gakuen Business, System Sales Business, and Medical Big Data Business. The company offers software development services; provides business and engineering applications; and operates in medical big data business. It also offers system consultation, integration, and management and administration services; develops and sells software package products; and provides database services. Japan System Techniques Co., Ltd. was founded in 1973 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-8288",
        "website": "http://www.jast.jp",
        "market_cap": "Mid Cap"
    },
    "4333.T": {
        "short_name": "TOHO SYSTEMS SCIENCE CO",
        "long_name": "Toho System Science Co., Ltd.",
        "summary": "Toho System Science Co., Ltd. develops software for general-purpose machines and open systems in Japan. The company develops systems related to the life insurance, non-life insurance, securities, and banking businesses, as well as other financial institutions, and communication and broadcasting institutions. It also provides computer operations management services. The company was founded in 1971 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "112-0002",
        "website": "http://www.tss.co.jp",
        "market_cap": "Large Cap"
    },
    "4344.T": {
        "short_name": "SOURCENEXT CORPORATION",
        "long_name": "Sourcenext Corporation",
        "summary": "Sourcenext Corporation develops and distributes various software products in Japan and internationally. The company offers Internet of Things products, including PC software, smartphone applications, and hardware. It also provides cloud, support, program download, upgrade, and various user discount services. In addition, the company sells POCKETALK, an AI-powered translation device; ROSETTA STONE, a language learning software; ZERO, an antivirus software; IKINARI PDF, a file converter; FUDEMAME, a postcard creation software; security software; and TELEWORK COLLECTION page for telework products. It offers its products through smartphone carriers, home electronics mass retail stores, and app stores, as well as SOURCENEXT eSHOP, an online shop. The company was founded in 1996 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-7133",
        "website": "http://www.sourcenext.com",
        "market_cap": "Large Cap"
    },
    "4381.T": {
        "short_name": "BPLATS INC",
        "long_name": "BPLATS,Inc.",
        "summary": "BPLATS,Inc. develops and sells subscription integration tools for connecting sellers and buyers. It offers Bplats Platform Edition for constructing a flexible and organic ecosystem, which allows providers and users to freely change the position of products that are rising from the Internet of Things; and Bplats Channel Edition, which connects various stakeholders from upstream to downstream with subscription business, as well as ASP-SaaS Navi services. The company was founded in 2006 and is headquartered in Kitakyushu, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kitakyushu",
        "zipcode": "101-0022",
        "website": "http://www.bplats.co.jp",
        "market_cap": "Mid Cap"
    },
    "4382.T": {
        "short_name": "HEROZ INC",
        "long_name": "HEROZ, Inc.",
        "summary": "HEROZ, Inc. plans, develops, and operates intellectual games for smartphones worldwide. The company uses its artificial intelligence technology to develop various smartphone apps, such as Shogi Wars, CHESS HEROZ, and BackgammonAce. HEROZ, Inc. was incorporated in 2009 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0014",
        "website": "http://www.heroz.co.jp",
        "market_cap": "Large Cap"
    },
    "4387.T": {
        "short_name": "ZUU CO LTD",
        "long_name": "ZUU Co.,Ltd.",
        "summary": "ZUU Co.,Ltd. operates financial media platforms in Japan and Singapore. The company operates ZUU online that offers financial information; and ZUU online SINGAPORE, a finance education portal that is bridging the gap between the asymmetry of information between individual investors and the financial industry. It also provides finance and real estate Web marketing support services; and media services. The company was founded in 2012 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "153-0042",
        "website": "http://www.zuu.co.jp/",
        "market_cap": "Mid Cap"
    },
    "4397.T": {
        "short_name": "TEAMSPIRIT INC",
        "long_name": "TeamSpirit Inc.",
        "summary": "TeamSpirit Inc. provides ERP solutions in Japan. It offers solutions in the areas of attendance management, man-hour management, expense, electronic approval, and visualization of how to work. The company was founded in 1996 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0031",
        "website": "http://www.teamspirit.co.jp",
        "market_cap": "Large Cap"
    },
    "4424.T": {
        "short_name": "AMAZIA INC",
        "long_name": "Amazia,inc.",
        "summary": "Amazia,inc. plans, operates, and manages manga applications worldwide. It offers Manga BANG!, a service that accommodates new reading, masterpieces, and works of various genres for users; and Manga Epic!, a manga posting service that allows manga artists to read a work by various people. The company was founded in 2009 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0044",
        "website": "http://www.amazia.co.jp",
        "market_cap": "Mid Cap"
    },
    "4425.T": {
        "short_name": "KUDAN INC",
        "long_name": "Kudan Inc.",
        "summary": "Kudan Inc. develops computer software algorithms classified as artificial perception that are the machine equivalent of human eyes. It offers visual-SLAM, processor optimization, sensor fusion, algorithm fusion, and connected processing solutions, as well as mapping for various use-cases. Kudan Inc. was founded in 2014 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0002",
        "website": "http://www.kudan.io",
        "market_cap": "Large Cap"
    },
    "4428.T": {
        "short_name": "SINOPS INC",
        "long_name": "sinops Inc.",
        "summary": "sinops Inc. engages in the development of automatic ordering systems for retail, wholesale, and manufacturing sectors. It offers sinops-R6, a demand forecasting type automatic ordering system; sinops-Pad, a shelf allocation maintenance app; sinops-Plg, a shelf allocation planning system; sinops-MD, an assortment optimization system; sinops-W, a demand forecasting cash flow optimization system; sinops-IM, a transfer instruction optimization system; and sinops-M, a medium- and long - term demand forecasting system. The company also provides logistics diagnosis and improvement, and shelf allocation consultation services. sinops Inc. was founded in 1987 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0001",
        "website": "http://www.sinops.jp",
        "market_cap": "Mid Cap"
    },
    "4429.T": {
        "short_name": "RICKSOFT CO LTD",
        "long_name": "Ricksoft Co., Ltd.",
        "summary": "Ricksoft Co., Ltd. engages in the provision of system integration, cloud, and software development services in Japan. The company's system integration services include system design, construction, customization, migration, etc.; and operation support, tool training, etc. It also develops project management tool comprising WBS Gantt-Chart for Jira; usability enhancement tool, such as Excel-Like Issue Editor for Jira; digital transformation support tool for Alfresco connector series; and other self-developing and software tools. In addition, the company engages in the sale of licenses. Ricksoft Co., Ltd. was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0004",
        "website": "http://www.ricksoft.jp",
        "market_cap": "Mid Cap"
    },
    "4432.T": {
        "short_name": "WINGARC1ST INC",
        "long_name": "WingArc1st Inc.",
        "summary": "WingArc1st Inc. provides software and services to support enterprise information utilization in Japan, China, and rest of the APAC region. The company offers form products, including Super Visual Formade (SVF), a form based solution; SVF Cloud, a cloud service; and SPA/SPA Cloud, an enterprise application solution. It also provides Dr.Sum, a business intelligence platform; MotionBoard, a BI Dashboard for business managers and users; and VyNDEX, a CRM solution. In addition, the company offers solutions for sales dashboard, manufacturing industry, and distribution retail; and realization of digital administration centered on solution data for local governments. Further, it offers consulting and implementation services; and various training courses in data visualization. The company was founded in 1993 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "106-0032",
        "website": "http://www.wingarc.com",
        "market_cap": "Large Cap"
    },
    "4440.T": {
        "short_name": "WITZ CORPORATION",
        "long_name": "WITZ Corporation",
        "summary": "WITZ Corporation engages in the research, design, and development of the embedded software in Japan. The company is involved in the research and development of real-time operating system; and design of IT solutions software. It also offers data validation/analysis, product and embedded security, consulting, process improvement, and telework support services, as well as teaching material demo kit and hardware products. The company was founded in 1997 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "460-0008",
        "website": "http://www.witz-inc.co.jp",
        "market_cap": "Mid Cap"
    },
    "4443.T": {
        "short_name": "SANSAN INC",
        "long_name": "Sansan, Inc.",
        "summary": "Sansan, Inc. provides information management services to corporations and individual customers in Japan. The company offers a cloud-based contact management tool with a scanner and tablet set that enables customers to digitize business cards, manage and share contacts, send bulk or individual emails, sync contacts with Salesforce and other third party software tools, add reminders, download database as a CSV file, and send instant internal messages, as well as add tags, notes, and meeting reports to contact's information. It also provides Sansan app for iOS and Android platforms that offers mobile access to Sansan database. The company was founded in 2007 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0001",
        "website": "http://www.sansan.com",
        "market_cap": "Large Cap"
    },
    "4447.F": {
        "short_name": "PBSYSTEMS INC",
        "long_name": "PBsystems,Inc.",
        "summary": "PBsystems,Inc. engages in the construction of private cloud systems in Japan. The company offers a virtual system from business system to space. It also manufactures and sells 4D King, a shared 3D VR theater. PBsystems,Inc. was founded in 1997 and is based in Fukuoka, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FKA",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuoka",
        "zipcode": "812-0007",
        "website": "http://www.pbsystems.co.jp",
        "market_cap": "Mid Cap"
    },
    "4448.T": {
        "short_name": "CHATWORK CO LTD",
        "long_name": "Chatwork Co.,Ltd.",
        "summary": "Chatwork Co.,Ltd. provides communication platform solutions to help organizations build creative working cultures worldwide. It offers Chatwork, a software solution to connect individuals and teams of various sizes. The company was incorporated in 2004 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0011",
        "website": "http://www.chatwork.com",
        "market_cap": "Large Cap"
    },
    "4478.T": {
        "short_name": "FREEE K K",
        "long_name": "freee K.K.",
        "summary": "freee K.K. develops and provides cloud accounting and HR/labor software for individual business owners and corporations. It also offers Company establishment freee, a free service that can streamline the creation of documents that are required to be submitted at the time of company establishment; Business opening freee that offers various services related to establish a company or start a business to private business owner; and Declaration freee, a cloud-type tax reporting software for accounting firms. In addition, the company provides freee card, a business credit card for individual business owners, and small and medium-sized enterprises, as well as offer-type financing services; Invoice Finance, an invoice purchase service; and Project Management freee. The company was founded in 2012 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0031",
        "website": "http://www.freee.co.jp",
        "market_cap": "Large Cap"
    },
    "4484.T": {
        "short_name": "LANCERS INC",
        "long_name": "Lancers, Inc.",
        "summary": "Lancers, Inc. provides crowdsourcing services. It engages in the freelance talent platform business. The company offers Lancers, a freelance starrent platform that matches companies who want to work with individuals and who want to receive jobs online; Lancers Pro, a service for selected freelancers; Lancers Agent, a resident IT freelance service; and Lancers Outsourcing, a service to entrust media and content production to a director. It also provides Lancers Assistant, a service that allow to outsource a range of tasks, such as secretarial, sales, public relations, and production to a team of online assistants; and Lancers Enterprise, a centralized external human resources management system for corporations. The company was founded in 2008 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0002",
        "website": "http://www.lancers.co.jp",
        "market_cap": "Mid Cap"
    },
    "4492.T": {
        "short_name": "GENETEC CORPORATION",
        "long_name": "Genetec Corporation",
        "summary": "Genetec Corporation engages in software development business in Japan. It is also involved in the hardware business, which provides systems that combine hardware and software; engineering solution business that sells 3D CAD/CAM software; and IoT/cloud solutions business. The company was founded in 1985 and is headquartered in Shinjuku, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Shinjuku-Ku",
        "zipcode": "160-0-022",
        "website": "http://www.genetec.co.jp",
        "market_cap": "Mid Cap"
    },
    "4684.T": {
        "short_name": "OBIC CO LTD",
        "long_name": "OBIC Co.,Ltd.",
        "summary": "OBIC Co.,Ltd., together with its subsidiaries, provides system integration, system support, office automation, and package software services. The company offers system integration services, including developing ERP software products to provide integrated administrative systems comprising personnel, payroll, working condition management, marketing, and production systems, as well as related training courses. The company also provides system support services, including system operation support and maintenance, and hardware maintenance. In addition, it offers office automation services, such as sale of package software, and peripheral equipment and supplies, as well as processing of printed materials. The company was founded in 1968 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8328",
        "website": "http://www.obic.co.jp",
        "market_cap": "Large Cap"
    },
    "4716.T": {
        "short_name": "ORACLE CORP JAPAN",
        "long_name": "Oracle Corporation Japan",
        "summary": "Oracle Corporation Japan develops software and hardware products and solutions in Japan. It also offers support and consulting services; and education services for information system construction. In addition, the company offers database solutions; developer tools, such as Java EE SDK, Java ME SDK, Java SE SDK, NetBeans, JDeveloper, REST Data Services, and SQL developer; engineered systems, including big data and database appliance, exadata database machines, exalogic elastic cloud, MiniCluster, private cloud appliance, supercluster, and zero data loss recovery appliance products; and IT infrastructure products comprising engineered systems, servers, storage, infrastructure software, and enterprise communications solutions. Further, it provides Java software; middleware solutions for application integration, coherence, content and experience, data integration, digital assistant, enterprise management, and mobile and security; and business analytics solutions, such as analytics for CIO, marketing, HR, and analysts, as well as advanced analytics products. Additionally, the company offers enterprise resource planning, human resource management, customer experience, and supply chain management solutions, as well as NetSuite and cloud products and solutions. The company serves automobile, communication, engineering, construction, financial services, eating and drinking, medical care, higher education institution, hospitality, industrial production, life science, education, retail, and public sectors. Oracle Corporation Japan was founded in 1985 and is based in Tokyo, Japan. Oracle Corporation Japan operates as a subsidiary of Oracle Japan Holding Inc.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0061",
        "website": "http://www.oracle.com/jp",
        "market_cap": "Large Cap"
    },
    "4734.T": {
        "short_name": "BEING CO LTD",
        "long_name": "Being Co., Ltd.",
        "summary": "As of March 24, 2021,  operates as a subsidiary of Truth, Y.K.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tsu",
        "zipcode": "514-0003",
        "website": "http://www.beingcorp.co.jp",
        "market_cap": "Mid Cap"
    },
    "4746.T": {
        "short_name": "TOUKEI COMPUTER",
        "long_name": "Toukei Computer Co., Ltd.",
        "summary": "Toukei Computer Co., Ltd. engages in the system design, development, and operation of solutions for various industries and businesses in Japan. The company offers cloud services and business outsourcing services ranging from cloud services that utilize data to IDC, network construction, and operation services; and business applications related to ERP/HR payroll system, ERP/management accounting system, financial accounting, workflow/document management, attendance payroll integration systems for medical and welfare facilities, groupware, etc. It also provides data entry, contact center (call business), personnel dispatch/outsourcing, and payroll services; and network and cloud services. The company offers its products and services to shipping, apparel SCM, logistics, mail order, distribution/retail, housing/construction, manufacturing, equipment and building maintenance, condominium/real estate management, broadcast/communication/control, education, and finance/payment industries. Toukei Computer Co., Ltd. was founded in 1970 and is headquartered in Kawasaki, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kawasaki",
        "zipcode": "211-8550",
        "website": "http://www.toukei.co.jp",
        "market_cap": "Large Cap"
    },
    "4762.T": {
        "short_name": "XNET CORPORATION",
        "long_name": "XNET Corporation",
        "summary": "XNET Corporation provides software applications outsourcing services in Japan. It offers insurance solutions, such as portfolio management, corporate finance management, and NAV calculation for variable insurance; banking and asset management solutions, including customized loan management, trust for individuals, interbank deposit management, and bond account management for OTC sale; and solutions for other business companies. The company also offers solutions for proxy/engagement management, market information services, reports management, IFRS data management, and STP solutions with brokers and custodians, as well as business process outsourcing services. The company was founded in 1991 and is based in Tokyo, Japan. XNET Corporation is a subsidiary of NTT Data Corporation.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-0007",
        "website": "http://www.xnet.co.jp",
        "market_cap": "Mid Cap"
    },
    "4770.T": {
        "short_name": "ZUKEN ELMIC INC",
        "long_name": "Zuken Elmic, Inc.",
        "summary": "Zuken Elmic, Inc. operates in the information communication and electronic industry. It offers protocol stacks library products; embedded software design consulting services, including firmware, middleware, device driver, and upper application software; system integration services; hardware modules; and smart factory solutions, such as cooperative system between IP camera and FA, and SEMI standard communication software packages. The company was formerly known as Elmic Wescom Inc. and changed its name to Zuken Elmic, Inc. in 2009. Zuken Elmic, Inc. was founded in 1977 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "222-8505",
        "website": "http://www.elwsc.co.jp",
        "market_cap": "Mid Cap"
    },
    "4776.T": {
        "short_name": "CYBOZU INC",
        "long_name": "Cybozu, Inc.",
        "summary": "Cybozu, Inc. develops and sells software solutions in Japan, China, Vietnam, Asia, Europe, and the United States. The company offers web-based groupware software that supports team collaboration for companies and public organizations, as well as for small teams, such as inter-company projects, volunteers, and families. Its products and services include Cybozu Office, a groupware for small and midsize enterprises; Cybozu Garoon, a groupware for midsize to large size enterprises; kintone, a PaaS structured as a business app; Cybozu KUNAI, a smartphone app; Cybozu MailWise, a mail sharing system; and Cybozu Remote Service, a relay service for external lines. The company also operates Cybozu Teamwork Research Institute that explores methods to improve teamwork, as well as provides seminars and training courses on these methods. The company was founded in 1997 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-6027",
        "website": "http://www.cybozu.com",
        "market_cap": "Large Cap"
    },
    "4845.T": {
        "short_name": "SCALA INC",
        "long_name": "Scala, Inc.",
        "summary": "Scala, Inc. engages in the SaaS/ASP, sales force automation, field marketing, and customer support businesses in Japan. It also provides CRM/SFA software; offers education and consulting services; and operates an e-commerce site for buying and selling battle game trading cards. In addition, the company offers licenses for sales support systems; and cloud services, customized development, sales consulting, sales skill training, and business process consulting services. The company was formerly known as Fusion Partners Co. and changed its name to Scala, Inc. in December 2016. Scala, Inc. was founded in 1991 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "1508510",
        "website": "http://www.scalagrp.jp",
        "market_cap": "Large Cap"
    },
    "5ZC.F": {
        "short_name": "CROOZ INC.",
        "long_name": "CROOZ, Inc.",
        "summary": "CROOZ, Inc. engages in the e-commerce, media and advertising, gaming, and investment and financial businesses. The company plans, develops, and operates SHOPLIST.com, a fashion mail order; and offers EC site system construction, operation contract, fulfillment, and other solutions. It also provides advertising agency and media services; plans, develops, and manages games for smartphones; and invests in private equity funds. The company was founded in 2001 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0033",
        "website": "http://www.crooz.co.jp",
        "market_cap": "Small Cap"
    },
    "6047.T": {
        "short_name": "GUNOSY INC",
        "long_name": "Gunosy Inc.",
        "summary": "Gunosy Inc. provides information curation services in Japan. It offers Internet services related to games and hints-and-tips, as well as advertising services. The company was founded in 2012 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://gunosy.co.jp",
        "market_cap": "Large Cap"
    },
    "6172.T": {
        "short_name": "METAPS INC.",
        "long_name": "Metaps Inc.",
        "summary": "Metaps Inc. engages in big data and artificial intelligence businesses worldwide. It offers payment solutions, such as credit card transactions on the Internet, payment using credit card terminals in real stores, convenience store payment, and electronic money payment. The company also provides various blockchain-focused services comprising cryptocurrency exchange and token generating event agency, etc.; users behavior analysis focusing on applications, metapse analytics that can analyze advertisement effect data in detail, and consulting services to support customers' products and promotion action measures; and marketing solutions centered on the utilization of data, as well as operate movie editing application service, such as Filmstory. In addition, it offers services that include distribution of online advertisements, data analysis, and optimization of sales promotion; support global deployment of application games; Timebank, an exchange that enables users to buy, use, sell, possess expert's time, as well as experts can change the spare time into earnings; and a money communication app pring that allows users to complete money transactions, such as send, receive, pay, charge, and return to account. Metaps Inc. was founded in 2007 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.metaps.com",
        "market_cap": "Large Cap"
    },
    "6786.T": {
        "short_name": "RVH INC",
        "long_name": "RVH Inc.",
        "summary": "RVH Inc. provides women care, media consulting, and system development services in Japan. The company operates beauty salons for hair removal; and esthetic salons and day-time hot bath facility, as well as Sakurabuchi Kawaguchiko hotel. It also plans, manufactures, and sells ladies fashion products. In addition, the company is involved in the digital business consulting, marketing consulting, Internet mail order businesses; Web marketing, Web site planning and production, social game production, cross media production, and system development activities; graphics business for various applications; and business application system construction, customer database system construction, temporary staffing business, PC data erasure, and recycling businesses. Further, it engages in the development and sale of cosmetics and beauty products; and e-commerce management, and media planning and development activities, as well as system development, software development, package development, hardware development, contract research, and consulting businesses. The company was formerly known as RealVision Inc. and changed its name to RVH Inc. in April 2015. RVH Inc. was founded in 1996 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0052",
        "website": "http://www.rvh.jp",
        "market_cap": "Small Cap"
    },
    "67I.F": {
        "short_name": "IGNIS LTD.",
        "long_name": "IGNIS LTD.",
        "summary": "IGNIS LTD. designs, develops, operates, and sells smartphone applications in Japan. It develops tool-based applications, free casual games, and native social games, as well as communication applications. The company was founded in 2010 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0013",
        "website": "http://1923.co.jp",
        "market_cap": "Small Cap"
    },
    "6947.T": {
        "short_name": "ZUKEN INC",
        "long_name": "Zuken Inc.",
        "summary": "Zuken Inc., a software company, provides advanced design solutions for the creation and management of printed circuit board (PCB) designs, electrical and fluid systems, and 3D cabinet and wire harness layouts. The company offers CR-8000, a product-centric electronic system design solution that provides the tools to enhance designs at IC and PCB levels. It also provides E3.series solutions for electrical wire harness, control systems, and fluid engineering; DS-2, a data management platform for PCB and electrical/fluid engineering; eCADSTAR, an Internet connected PCB design platform; and CADSTAR, a single-board PCB design software. In addition, the company provides consulting services. It serves customers in the industrial machinery, consumer electronics, electronic components, medical devices, special-purpose vehicles, rail transport, and aerospace sectors in Japan, rest of Asia, the Americas, and Europe. The company was formerly known as Zukei Shori Gijutsu Kenkyusho Inc. and changed its name to Zuken Inc. in June 1985. Zuken Inc. was founded in 1976 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "224-8585",
        "website": "http://www.zuken.com",
        "market_cap": "Large Cap"
    },
    "6CY.F": {
        "short_name": "CYBERLINKS CO. LTD.",
        "long_name": "Cyberlinks Co., Ltd.",
        "summary": "Cyberlinks Co., Ltd. provides IT cloud and mobile network services for the system development, installation, maintenance, and operational support in Japan. The company offers its services for the distribution industry and government agencies, as well as in the areas of medical information system, product information and image database, school education institution, CATV-ISP, hardware maintenance, and specialty store sales management system. It also operates 7 DoCoMo stores that sell smartphones, mobile phones, data cards, etc. to corporate users or general users; and consulting and after-sales services, etc. The company was founded in 1964 and is headquartered in Wakayama, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Wakayama",
        "zipcode": "641-0012",
        "website": "http://www.cyber-l.co.jp",
        "market_cap": "Small Cap"
    },
    "6GU.F": {
        "short_name": "GUNOSY INC.",
        "long_name": "Gunosy Inc.",
        "summary": "Gunosy Inc. provides information curation services in Japan. It offers Internet services related to games and hints-and-tips, as well as advertising services. The company was founded in 2012 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://gunosy.co.jp",
        "market_cap": "Small Cap"
    },
    "7527.T": {
        "short_name": "SYSTEMSOFT CORPORATION",
        "long_name": "SystemSoft Corporation",
        "summary": "SystemSoft Corporation provides system development and Web marketing support services in Japan. It offers services ranging from system development consulting to maintenance and operation, as well as system development services in the areas of customer's business system, information disclosure system, research advanced system, etc. SystemSoft Corporation was founded in 1979 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0004",
        "website": "http://www.systemsoft.co.jp",
        "market_cap": "Large Cap"
    },
    "9640.T": {
        "short_name": "SAISON INFORMATION SYSTEMS",
        "long_name": "Saison Information Systems Co., Ltd.",
        "summary": "Saison Information Systems Co., Ltd. engages in the system development and operation, and software package businesses in Japan. The company offers HULFT, a suite of enterprise middleware that enables secure data transfer, conversion, and integration. It also builds and operates systems for the retail and service industries, including department stores, mass retailers, franchise businesses, supermarkets, and others; and STORES, an integrated solution service for retail chains. In addition, the company offers financial business solutions comprising application development services for customers in the financial industry, including banks, securities, and insurance companies; examination solutions to automate the examination process from credit card applications up to settlement in a system; debt collection solutions for credit card companies or servicers; and security services to fulfill the international security standard of the payment card industry. Further, it provides housing/hosting services; and integrated monitoring and optional services. The company was formerly known as Seibu Information Center Co., Ltd. and changed its name to Saison Information Systems Co., Ltd. in April 1992. The company was founded in 1970 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0052",
        "website": "http://www.saison.co.jp",
        "market_cap": "Large Cap"
    },
    "9685.T": {
        "short_name": "KYCOM HOLDINGS CO LTD",
        "long_name": "Kycom Holdings Co., Ltd.",
        "summary": "Kycom Holdings Co., Ltd. engages in the planning, custom designing, development, testing, and maintenance of information systems. The company also provides security solutions, including sale, maintenance, and customization of access control and attendance recording system using fingerprint recognition technology; introducing and consulting services on software packages; and system operating and help desk supporting engineer services, and outsourcing services. In addition, it provides infrastructure for IT operations; and character/image data entry services. Further, the company engages in employment and education business, real estate business, lease of office equipment, etc. The company was formerly known as Kyodo Computer Holdings Co., Ltd. and changed its name to KYCOM Holdings Co., Ltd. in June 2011. Kycom Holdings Co., Ltd. was incorporated in 1968 and is based in Fukui, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukui",
        "zipcode": "918-8011",
        "website": "http://www.kyd.co.jp",
        "market_cap": "Mid Cap"
    },
    "9687.T": {
        "short_name": "KSK CO LTD",
        "long_name": "KSK Co.,Ltd.",
        "summary": "KSK Co.,Ltd. engages in the LSI, software, hardware, customer service, and data entry businesses. The company develops system LSIs and analog LSIs; designs middleware/firmware; and evaluates LSIs. It is also involved in the development and sale of package-software; and development of custom-made software, and web and CAD systems. In addition, the company integrates network and computer systems, as well as provides services ranging from designing G/A, LSIs, circuits, PCBs, mechanisms, and firmware to manufacturing and evaluating prototypes. Further, it offers customer service solutions, including call center/help desk, maintenance, engineering support, and employment agency services; and data entry solutions. KSK Co.,Ltd. was founded in 1974 and is headquartered in Inagi, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Inagi",
        "zipcode": "206-0804",
        "website": "http://www.ksk.co.jp",
        "market_cap": "Large Cap"
    },
    "9691.T": {
        "short_name": "RYOMO SYSTEMS CO",
        "long_name": "Ryomo Systems Co.,Ltd.",
        "summary": "Ryomo Systems Co.,Ltd. provides software development and system sales, information processing, product-related sales, and other information services in Japan. It offers administrative, family register information comprehensive, financial accounting, counter support, smart city, and collection management solutions; water rate adjustment, public enterprise accounting, fee collection, and image information management systems, as well as toll collection, water supply equipment management, and other services to water supply entities; and educational network construction, school affairs and class support, and library management services. The company also provides customer portals for gas and electricity retailing; customer charge management, gas business management, and deployment solutions for energy industry; and solutions for manufacturing industry, including SAP ERP implementation, consulting, design and development works, system operation and maintenance, business specific template RAICs, and weaving data creation systems. In addition, it offers printing solutions; functional safety solutions; MBD consulting, automation tool, contract development, and education training solutions, as well as HILS support solutions; medical solutions, such as dispensing pharmacy core, medical office, drug management guidance service support, and ordering and electronic medical chart systems; and solutions for sales and customer management, data warehouse, online shopping, e-commerce, and labor scheduling programs in the distribution sector. Further, the company provides secure remote access, client operation management, antivirus, groupware, backup measure, server virtualization and construction, network construction, and security patch management services; and business support and Internet data center services. The company was incorporated in 1970 and is headquartered in Kiryu, Japan. Ryomo Systems Co.,Ltd. is a subsidiary of Mitsuba Co., Ltd.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kiryu",
        "zipcode": "376-8502",
        "website": "http://www.ryomo.co.jp",
        "market_cap": "Mid Cap"
    },
    "9698.T": {
        "short_name": "CREO CO LTD",
        "long_name": "Creo Co.,Ltd.",
        "summary": "Creo Co.,Ltd. develops information systems and provides related services in Japan. The company offers ZeeM, a human resource, payroll, and accounting solution; systems development, maintenance, and management services; contract development support services; and help desk, technical support, and other support and services, as well as call center services. The company was formerly known as Tokai Create CO., LTD. and changed its name to Creo Co.,Ltd. in 1989. Creo Co.,Ltd. was founded in 1974 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "140-0002",
        "website": "http://www.creo.co.jp",
        "market_cap": "Large Cap"
    },
    "9702.T": {
        "short_name": "ISB CORPORATION",
        "long_name": "ISB Corporation",
        "summary": "ISB Corporation provides software development services for mobile, medical, and in-vehicle applications in Japan. It offers cloud infrastructure construction, operation design, and operation maintenance; system operation services; and verification of mobile devices, as well as data center services, including housing and hosting. The company also develops and sells business products, such as packaging; sells equipment associated with system; and manufactures, maintains, and sells exit control systems, electric locks, ten keys, etc. It develops software for core system construction for use in the government, finance, communication, and transportation sectors. ISB Corporation was founded in 1970 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0032",
        "website": "http://www.isb.co.jp",
        "market_cap": "Large Cap"
    },
    "9717.T": {
        "short_name": "JASTEC CO LTD",
        "long_name": "JASTEC Co., Ltd.",
        "summary": "JASTEC Co., Ltd. provides custom software development and system integration services in Japan. It offers business automation solutions, including targeted business service systems; software for purchasing support, sales support, decision support, operation management support, information analysis, etc.; general business service systems; and software for general business applications, such as accounting, financial, human resource, etc. The company also provides process automation software for process control of rationalizing production facilities, communication equipment, technical calculation, etc.; operating system and other software products, such as operating system software, programming language software, utility software, middle-ware, etc.; and package software products for enterprise use. It serves enterprises in raw materials, construction, manufacturing, financial, insurance, securities, distribution, and service industries. JASTEC Co., Ltd. was founded in 1971 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0074",
        "website": "http://www.jastec.co.jp",
        "market_cap": "Large Cap"
    },
    "9759.T": {
        "short_name": "NSD CO.LTD",
        "long_name": "NSD Co., Ltd.",
        "summary": "NSD Co., Ltd., a systems integrator, provides IT solutions in Japan. The company offers system analysis and design services; develops software programs; and administers facilities management, as well as sells packaged software and solutions. It also provides integrated solutions, such as system design, development, operation, and maintenance services; and system solutions. In addition, the company offers various IT infrastructure services, including planning and procurement services comprising consulting and IT infrastructure sales support services; design, development, and installation services, such as cloud, platform, network, storage, virtualization infrastructure, and security infrastructure design and development support services, as well as application development support services; and operation and maintenance services, such as system operation management and maintenance, system operation, lifecycle management, and helpdesk services. Further, it provides all-purpose software and duty-specific software products, as well as software development services. The company serves financing and insurance, commerce, telecommunication, construction, public, manufacturing, transportation, and service sectors. NSD Co., Ltd. was founded in 1969 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0063",
        "website": "http://www.nsd.co.jp",
        "market_cap": "Large Cap"
    },
    "9790.T": {
        "short_name": "FUKUI COMPUTER HOLDINGS INC",
        "long_name": "Fukui Computer Holdings,Inc.",
        "summary": "Fukui Computer Holdings,Inc. primarily develops and sells package CAD products for the construction industry in Japan. It offers ARCHITREND Zero, a 3D architectural CAD system for design works; 3D Catalog.com, a 3D simulation site for building materials / equipment and housing; GLOOBE, a BIM building design and construction support system; TREND-ONE, a surveying CAD system; EX-TREND MUSASHI, a civil engineering construction management system for contractor and the civil engineering construction companies; TREND-POINT, a 3D point cloud processing system; and One Click Counter, an election exit poll system, as well as customer support services. The company was formerly known as Fukui Computer, Inc. and changed its name to Fukui Computer Holdings,Inc. in July 2012. Fukui Computer Holdings,Inc. was incorporated in 1979 and is headquartered in Fukui, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukui",
        "zipcode": "910-8521",
        "website": "http://www.fukuicompu.co.jp",
        "market_cap": "Large Cap"
    },
    "9928.T": {
        "short_name": "MIROKU JYOHO SERVICE CO",
        "long_name": "Miroku Jyoho Service Co., Ltd.",
        "summary": "Miroku Jyoho Service Co., Ltd. provides systems and services to accounting firms and their client companies, and small/mid-sized companies in Japan. The company provides software applications, such as accounting and financial, HR management, ERP systems, etc. consisting of ACELINK NX-Pro, MJSLINK NX- Plus, and Galileopt NX- Plus. It also offers software and hardware support and maintenance services comprising TVS and GOODWILL PLUS; advisory/training services on the usage of products; and hardware and supplies, including computers, PC servers, toners, etc. In addition, the company provides tax services, such as tax documents preparation, tax agency, tax consultation, etc.; account processing services,including bookkeeping agency, self-accounting guidance, preparation of financial statements, etc.; management guidance services comprising cash management measures, management analysis, management plan formulation, etc.; and IT support and management information services, etc. Miroku Jyoho Service Co., Ltd. was founded in 1977 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-0004",
        "website": "http://www.mjs.co.jp",
        "market_cap": "Large Cap"
    },
    "9BL.F": {
        "short_name": "BROADLEAF CO. LTD",
        "long_name": "Broadleaf Co., Ltd.",
        "summary": "Broadleaf Co., Ltd. develops and provides software, and IT solutions and services for the automotive aftermarket, and other business sectors and industries in Japan. The company offers broadleaf cloud platform; IT solutions, such as customer management, sales management, and inventory management systems; and operations analysis software. It also provides big data analysis related to automobiles and other services to mobile phone distributors, travel agencies, bus operators, and machine tools dealers. Broadleaf Co., Ltd.s was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "140-0002",
        "website": "http://www.broadleaf.co.jp",
        "market_cap": "Small Cap"
    },
    "A3X.F": {
        "short_name": "APLIX IP HOLDINGS CORP.",
        "long_name": "Aplix Corporation",
        "summary": "Aplix Corporation engages in the technology business. It develops package software for the NeXT computer system; CD/DVD authoring software; automotive telematics systems; java for consumer electronics; and JBlend software on mobile phones. The company also develops and markets Internet of Things products from hardware and software to cloud service; and develops wireless communication technologies that connect consumer electronic products to mobile devices. In addition, it offers communication modules, Wi-Fi solutions, BLE/Wi-Fi gateways, and embedded water flow sensors. The company was formerly known as Aplix IP Holdings Corporation and changed its name to Aplix Corporation in April 2017. Aplix Corporation was founded in 1986 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "169-0051",
        "website": "http://www.aplix.co.jp",
        "market_cap": "Small Cap"
    },
    "AN5.F": {
        "short_name": "ALPHA SYSTEMS INC.",
        "long_name": "Alpha Systems Inc.",
        "summary": "Alpha Systems Inc. develops software for backbone communications systems in Japan. The company develops software for backbone communication systems, such as node systems, mobile network systems, and network management systems. It also develops open systems, including portal sites for online businesses and related work-process systems; online application systems and databases for public works projects; systems for management of production and distribution; and Intranets for corporate information management. In addition, the company develops embedded systems to control electronic devices, including home appliances, office automation equipment, industrial machines, and in-vehicle systems. Further, it provides system integration, system operation and maintenance, and product sales services. Alpha Systems Inc. was founded in 1972 and is headquartered in Kawasaki, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Kawasaki",
        "zipcode": "211-0053",
        "website": "http://www.alpha.co.jp",
        "market_cap": "Small Cap"
    },
    "BAINF": {
        "short_name": "BASE INC",
        "long_name": "BASE, Inc.",
        "summary": "BASE, Inc. engages in planning, development, and operation of web services in Japan. It operates through three segments: BASE Business, PAY Business, and Other Business. The company offers an online shop opening service and a smartphone shopping app under the BASE name; and YELL BANK, a financial service that allows shop owners who use the online shop opening service BASE to raise funds. It also provides PAY.JP, an online service for developers for implementing credit card payment to web services and e-commerce; and PAY ID, an ID-type payment service for purchasers. BASE, Inc. was incorporated in 2012 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "106-6237",
        "website": "http://binc.jp",
        "market_cap": "Small Cap"
    },
    "D2N.F": {
        "short_name": "DENA CO. LTD.",
        "long_name": "DeNA Co., Ltd.",
        "summary": "DeNA Co., Ltd. develops and operates mobile and online services worldwide. The company operates Coopel, a cloud robotic process automation service; Mobage, a platform that hosts free-to-play mobile games; Yahoo! Mobage, which offers games for PC browsers; and AndApp, a platform that allows users to play mobile game apps on PC browsers under the same user account. It also operates Anyca, a mobile app for peer-to-peer car sharing; SOMPO DE NORU, a car leasing service; Easy Ride, a robo-vehicle mobility service; GO, a taxi dispatch app; and DRIVE CHART, an accident reduction support service. In addition, the company offers MYCODE, a direct-to-consumer genetic testing service; kencom, which supports health insurance societies to manage their members' health data; SHOWROOM, a virtual stage where fans can watch their artists perform live while interacting with them in real time; and Pococha, a social live streaming community. Further, it provides Everystar, a mobile website for user-generated novels; Manga Box, a weekly manga magazine app; and Mobaoku that allows users to manage their auction items and bids from their mobile phones. Additionally, the company offers Yokohama DeNA Baystars, Yokohama DeNA Running Club, and Kawasaki Brave Thunders sports services. DeNA Co., Ltd. was founded in 1999 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-8510",
        "website": "http://www.dena.com",
        "market_cap": "Mid Cap"
    },
    "DNACF": {
        "short_name": "DENA CO LTD",
        "long_name": "DeNA Co., Ltd.",
        "summary": "DeNA Co., Ltd. develops and operates mobile and online services worldwide. The company operates Coopel, a cloud robotic process automation service; Mobage, a platform that hosts free-to-play mobile games; Yahoo! Mobage, which offers games for PC browsers; and AndApp, a platform that allows users to play mobile game apps on PC browsers under the same user account. It also operates Anyca, a mobile app for peer-to-peer car sharing; SOMPO DE NORU, a car leasing service; Easy Ride, a robo-vehicle mobility service; GO, a taxi dispatch app; and DRIVE CHART, an accident reduction support service. In addition, the company offers MYCODE, a direct-to-consumer genetic testing service; kencom, which supports health insurance societies to manage their members' health data; SHOWROOM, a virtual stage where fans can watch their artists perform live while interacting with them in real time; and Pococha, a social live streaming community. Further, it provides Everystar, a mobile website for user-generated novels; Manga Box, a weekly manga magazine app; and Mobaoku that allows users to manage their auction items and bids from their mobile phones. Additionally, the company offers Yokohama DeNA Baystars, Yokohama DeNA Running Club, and Kawasaki Brave Thunders sports services. DeNA Co., Ltd. was founded in 1999 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-8510",
        "website": "http://www.dena.com",
        "market_cap": "Mid Cap"
    },
    "FIX.SG": {
        "short_name": "Fixstars Corp. Registered Share",
        "long_name": "Fixstars Corporation",
        "summary": "Fixstars Corporation operates as a software company in Japan and internationally. The company offers M3 technical support, processor evaluation, software development and optimization, OS firmware development support, system configuration, training for software developers, and other services. It serves in the area of automotive, flash storage, industrial, finance, healthcare, and computing. Fixstars Corporation was founded in 2002 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0032",
        "website": "http://www.fixstars.com",
        "market_cap": "Small Cap"
    },
    "NPY.F": {
        "short_name": "NSD CO. LTD.",
        "long_name": "NSD Co., Ltd.",
        "summary": "NSD Co., Ltd., a systems integrator, provides IT solutions in Japan. The company offers system analysis and design services; develops software programs; and administers facilities management, as well as sells packaged software and solutions. It also provides integrated solutions, such as system design, development, operation, and maintenance services; and system solutions. In addition, the company offers various IT infrastructure services, including planning and procurement services comprising consulting and IT infrastructure sales support services; design, development, and installation services, such as cloud, platform, network, storage, virtualization infrastructure, and security infrastructure design and development support services, as well as application development support services; and operation and maintenance services, such as system operation management and maintenance, system operation, lifecycle management, and helpdesk services. Further, it provides all-purpose software and duty-specific software products, as well as software development services. The company serves financing and insurance, commerce, telecommunication, construction, public, manufacturing, transportation, and service sectors. NSD Co., Ltd. was founded in 1969 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0063",
        "website": "http://www.nsd.co.jp",
        "market_cap": "Small Cap"
    },
    "OBL.F": {
        "short_name": "OBIC CO. LTD",
        "long_name": "OBIC Co.,Ltd.",
        "summary": "OBIC Co.,Ltd., together with its subsidiaries, provides system integration, system support, office automation, and package software services. The company offers system integration services, including developing ERP software products to provide integrated administrative systems comprising personnel, payroll, working condition management, marketing, and production systems, as well as related training courses. The company also provides system support services, including system operation support and maintenance, and hardware maintenance. In addition, it offers office automation services, such as sale of package software, and peripheral equipment and supplies, as well as processing of printed materials. The company was founded in 1968 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8328",
        "website": "http://www.obic.co.jp",
        "market_cap": "Large Cap"
    },
    "OCJ.F": {
        "short_name": "ORACLE CORP. JAPAN",
        "long_name": "Oracle Corporation Japan",
        "summary": "Oracle Corporation Japan develops software and hardware products and solutions in Japan. It also offers support and consulting services; and education services for information system construction. In addition, the company offers database solutions; developer tools, such as Java EE SDK, Java ME SDK, Java SE SDK, NetBeans, JDeveloper, REST Data Services, and SQL developer; engineered systems, including big data and database appliance, exadata database machines, exalogic elastic cloud, MiniCluster, private cloud appliance, supercluster, and zero data loss recovery appliance products; and IT infrastructure products comprising engineered systems, servers, storage, infrastructure software, and enterprise communications solutions. Further, it provides Java software; middleware solutions for application integration, coherence, content and experience, data integration, digital assistant, enterprise management, and mobile and security; and business analytics solutions, such as analytics for CIO, marketing, HR, and analysts, as well as advanced analytics products. Additionally, the company offers enterprise resource planning, human resource management, customer experience, and supply chain management solutions, as well as NetSuite and cloud products and solutions. The company serves automobile, communication, engineering, construction, financial services, eating and drinking, medical care, higher education institution, hospitality, industrial production, life science, education, retail, and public sectors. Oracle Corporation Japan was founded in 1985 and is based in Tokyo, Japan. Oracle Corporation Japan operates as a subsidiary of Oracle Japan Holding Inc.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0061",
        "website": "http://www.oracle.com/jp",
        "market_cap": "Mid Cap"
    },
    "OIDN": {
        "short_name": "OIDON CO LTD",
        "long_name": "Oidon Co., Ltd.",
        "summary": "Oidon Co., Ltd. engages in the planning, development, and supporting of emission trading system. It is also involved in the planning of social infrastructure for low-carbon society. The company was formerly known as Pomsta Group, Inc. and changed its name to Oidon Co., Ltd. in December 2010. Oidon Co., Ltd. was incorporated in 1998 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "542-0073",
        "website": null,
        "market_cap": "Small Cap"
    },
    "TBY.MU": {
        "short_name": "BUSINESS ENGINEERING",
        "long_name": "Business Engineering Corporation",
        "summary": "Business Engineering Corporation plans, develops, sells, and leases information and communications systems in Japan. It provides software products, such as mcframe a business package for the management of production of the manufacturing industry; mcframe cloud, a cloud solution to bring the user experience; mcframe for iPad/iPhone, a tool designed to enhance the possibilities of manufacturing industry; mcframe GA, an ERP package designed for Japanese companies to expand their businesses; mcframe R-PAD, a data entry tool that records, analyses, and utilizes data; GLASIAOUS, a global accounting service for expanding businesses overseas; Global MES, a multisite global manufacturing execution system; mcframe MOTION that converts workers' movements and postures into three-dimensional data; mcframe MOTION VR-learning training systems; and mcframe SIGNAL CHAIN that monitors and analyzes the operational status of manufacturing equipment, as well as for the maintenance of equipment. The company also offers SAP solutions, which cover various types of customer's business processes, including SAP ERP, SCM, CRM, BI, and others; and Oracle solutions, such as Oracle EBS/Oracle Apps. In addition, it is involved in the planning and development of computer networks, as well as provision of consulting services for corporate management, and information and communications systems. The company serves pharmaceuticals, electrical equipment, electronics, oil, chemicals, and machinery, as well as companies in the trading, logistics, information, and service industries. The company was formerly known as Toyo Business Engineering Corporation. Business Engineering Corporation was founded in 1980 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0004",
        "website": "http://www.b-en-g.com",
        "market_cap": "Small Cap"
    }
}