{
    "003560.KS": {
        "short_name": "IHQ",
        "long_name": "IHQ Inc.",
        "summary": "IHQ Inc. operates as an entertainment company in Korea. It produces content in various fields, such as drama, entertainment, and record. The company is also involved in the star management activities; and operation of Comedy TV and Cube TV.IHQ Inc. was founded in 1962 and is based in Seoul, South Korea. As of February 25, 2021, IHQ Inc. operates as a subsidiary of KH Media Co., Ltd.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "006490.KS": {
        "short_name": "INSCOB",
        "long_name": "Inscobee., Inc.",
        "summary": "Inscobee., Inc. engages in the smart grid, mobile virtual network operator (MVNO), bio, and distribution businesses in South Korea and internationally. It offers intelligent power network products, such as K2 chips and data concentration units, as well as PLC bridges, modems, and attenuators; and operates freeT, a mobile network operator for MVNOs of various mobile network operators. The company also provides bio medicines for pain; vaccines for cervical cancer and papillomavirus; and cosmeceuticals and nutraceuticals, as well as distributes watches. In addition, it sells smart lighting solutions, LED products, and lighting fixtures, as well as other electrical products. The company was founded in 1970 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "011420.KS": {
        "short_name": "GALAXIA SM",
        "long_name": "Galaxia SM, Inc.",
        "summary": "Galaxia SM, Inc. engages in broadcast program production, sports marketing, and communication businesses in South Korea. The company produces international signals; organizes and operates international broadcast centers; and provides facilities and services for broadcasting to the rights holders, as well as produces sports presentations of athletics, swimming, and gymnastics. It is also involved in the provision of sports presentation services, such as in-house broadcasting, music, video, and lighting in the stadium; and media broadcasting rights activities. In addition, the company establishes and executes sports marketing strategies; offers channel, digital, and pre-sale marking services, as well as undertakes advertising agency works; develops and operates sports facilities, such as golf courses, fitness centers, ball game, sports, swimming pool, etc.; operates restaurants, cafes, etc.; and operates golf, gymnastics, and baseball academies. Further, it produces mobile videos; and operates and sells channels. Galaxia SM, Inc. was founded in 1975 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "012170.KS": {
        "short_name": "Ascendio",
        "long_name": "Ascendio Co., Ltd.",
        "summary": "Ascendio Co., Ltd. engages in the entertainment business in South Korea and internationally. The company involved in the movie investment and distribution business, entertainment content business, and performance business; book publishing activities; and management consulting activities. The company was formerly known as KIWI Media Group Co.,Ltd. and changed its name to Ascendio Co., Ltd. in March 2021. Ascendio Co., Ltd. was founded in 1977 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "020120.KS": {
        "short_name": "KidariStudio",
        "long_name": "KidariStudio, Inc.",
        "summary": "KidariStudio, Inc., a representative content company, develops various media content worldwide. The company develops e-book, e-learning, and Webtoon content. It publishes e-books in various fields, such as fantasy, martial arts, romance, BL, light novel, sensual novel, and other fields. The company was formerly known as Daouincube, Inc. and changed its name to KidariStudio, Inc. in March 2018. The company was founded in 1987 and is headquartered in Seoul, South Korea. KidariStudio, Inc. is a subsidiary of Daou Data Corp.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "030000.KS": {
        "short_name": "CheilWorldwide",
        "long_name": "Cheil Worldwide Inc.",
        "summary": "Cheil Worldwide Inc. provides various marketing solutions worldwide. It offers strategic, creative, and media solutions; integrated digital marketing solution and social media platform; and experiential marketing solutions, such as events, exhibitions, sports, and retail marketing solutions. The company was founded in 1973 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "032640.KS": {
        "short_name": "LG Uplus",
        "long_name": "LG Uplus Corp.",
        "summary": "LG Uplus Corp. provides various telecommunication services primarily in South Korea. The company provides mobile services, including 5G, telecommunication, and roaming services; and home media services comprising AI and IoT, as well as Internet, IPTV, homeboy, bundle, and Internet phone services. It also provides services to corporate customers comprising drone control systems, telecommunications services for business, business phone services, Internet services, security, business IT services, marketing/customer management services, and industrial IoT services, as well as facilities/services/security solutions and affiliated products. In addition, the company is involved in the handset sale activities; provision of telemarketing and other business support services; investment fund activities; and cable television and broadcasting businesses. LG Uplus Corp. was founded in 1996 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "034120.KS": {
        "short_name": "SBS",
        "long_name": "Seoul Broadcasting System",
        "summary": "Seoul Broadcasting System engages in the broadcasting, cultural service, and advertising businesses in South Korea and internationally. It provides terrestrial TV and radio broadcasting services based on broadcasting law. The company sells TV program contents to cable PP, satellite broadcasting, Internet and IP TV, and other customers. It is also involved in cultural projects, such as exhibitions and entertainment performances. The company was founded in 1990 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "035000.KS": {
        "short_name": "GR",
        "long_name": "GIIR Inc.",
        "summary": "GIIR Inc., together with its subsidiaries, operates as an advertising and marketing communications company in South Korea and internationally. The company was founded in 1962 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "035420.KS": {
        "short_name": "NAVER",
        "long_name": "NAVER Corporation",
        "summary": "NAVER Corporation, together with its subsidiaries, provides internet and online search portal, and mobile messenger platform services in South Korea, Japan, and internationally. The company offers Naver, a search portal that offers various content topic boards; LINE, a messaging application; Naver Clova, an integrated AI platform; Papago, an automated interpretation application; WHALE, a web browser; Naver Map, a navigation application; V LIVE, a celebrities free global live streaming platform; Webtoon, a promotion system for mobile comics; SERIES, a paid content platform; SNOW, a camera; BAND, a mobile community platform; and AudioClip, an audio content platform. It also provides an online information distribution, business support, workforce supply, employee dispatch, software development and distribution, mobile service development, exhibition and performance planning, IT infrastructure, software consulting, mobile billing system planning and development, telecommunication, and mobile advertising services. In addition, NAVER Corporation is involved in the manufacture of cosmetics; electronic financial business; film production and distribution; real estate rental, and investment and information business; and character and doll wholesale and retail activities. The company was formerly known as NHN Corporation. NAVER Corporation was founded in 1999 and is headquartered in Seongnam, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seongnam-si"
    },
    "035720.KS": {
        "short_name": "Kakao",
        "long_name": "Kakao Corp.",
        "summary": "Kakao Corp. operates mobile and other online platforms in South Korea. Its platform operations comprise its talk business, portal business, and other business, which provide users with the ability to communicate, search content, shop, and make payments online, as well as use services, such as mobile transportation applications. The company offers its services under the brands of Kakao, Daum, and Melon. The company was formerly known as Daum Kakao Corp. and changed its name to Kakao Corp. in October 2015. Kakao Corp. was founded in 1995 and is headquartered in Jeju, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Jeju-Si"
    },
    "036420.KS": {
        "short_name": "Jcontentree",
        "long_name": "Jcontentree corp.",
        "summary": "Jcontentree corp., a media company, engages in the production and distribution of broadcasting programs in South Korea and internationally. The company produces and distributes media contents for various wired and wireless platforms. It also produces dramas; and operates movie theaters. The company was founded in 1987 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "036570.KS": {
        "short_name": "NCsoft",
        "long_name": "Ncsoft Corporation",
        "summary": "Ncsoft Corporation develops and publishes multiplayer online games in South Korea and internationally. The company offers casual games, mobile games, and characters games. Ncsoft Corporation was founded in 1997 and is headquartered in Seongnam, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seongnam-si"
    },
    "037560.KS": {
        "short_name": "LG HelloVision",
        "long_name": "LG HelloVision Corp.",
        "summary": "LG HelloVision Corp. home connectivity solutions in South Korea. It offers broadcasting and communication technologies, such as digital cable TV, UHD broadcasting, giga Internet, and cloud broadcasting services; high-speed Internet services; telephone services; mobile services; and rental of home appliances, TVs, PCs, and laptops. The company was formerly known as CJ Hello Co., Ltd. and changed its name to LG HelloVision Corp. in December 2019. LG HelloVision Corp. was founded in 1995 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "053210.KS": {
        "short_name": "KT Skylife",
        "long_name": "KT Skylife Co., Ltd.",
        "summary": "KT Skylife Co., Ltd., a media company, provides digital satellite broadcasting services in South Korea. It offers skylife satellite broadcasting, Internet, mobile, and sky home appliances, as well as UHD TV and PC. The company was founded in 2002 and is headquartered in Seoul, South Korea. KT Skylife Co., Ltd is a subsidiary of KT Corporation.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "058860.KS": {
        "short_name": "KTis",
        "long_name": "KTIS Corporation",
        "summary": "KTIS Corporation engages in the customer service business in South Korea. The company offers general and professional consultation services related to fixed products and solutions; and customer contact services, including call center operation, consulting, facility leasing, construction and AP development support, talent dispatching and education, and contact/outsourcing services, as well as numbering services. It is also involved in the mobile distribution business; and provision of tourist reward services. KTIS Corporation was founded in 2001 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "072130.KS": {
        "short_name": "UANGEL",
        "long_name": "UANGEL Corporation",
        "summary": "UANGEL Corporation provides mobile network, IoT, service platform, and edutech solutions in South Korea and internationally. It develops various commercial core solutions for local mobile communication services, including 4G LTE and IoT services. The company's mobile network solutions include unified IP multimedia subsystem, next generation intelligent network, integrated signaling controller, policy and charging control, convergence billing, and messaging solutions, as well as multimedia broadcast/multicast services for LTE and public safety-LTE. It also provides IoT solutions, such as F.QMS, a quality management solution for smart factories; C.FMS, a facility management solution for smart cities; C.STS, a safety and tracking solution for smart cities; E.EVCS, an electronic vehicle charging and service solution for smart energy; and IoT Service Gateway, which offers mobile communication network function to external service providers as an open API or manages small capacity data communication with the IoT terminal. In addition, the company offers Customized Ring-Back Tone, BizConnect, BizMessaging, Call Manager Office, smart banking, and non-face-to-face real name authentication system services platforms. Further, it provides ToMoKids, a children's play and learn solution; ToMoNOTE, an online-offline integrated teaching activity support program for early childhood education by teachers in the preschool institutes, as well as offers learning curriculum in physical exercise and health, communication, social relations, art experience, and nature exploration areas; and ToMoRING, a smart sharing service for use as a home schooling material that provides school memo function between the institute and parents, album sharing function, and educational contents. The company offers mobile communication solutions to 20 operators in 16 countries. UANGEL Corporation was founded in 1999 and is headquartered in Seongnam, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seongnam-si"
    },
    "078000.KS": {
        "short_name": "TELCOWARE",
        "long_name": "Telcoware Co.,Ltd.",
        "summary": "Telcoware Co.,Ltd. provides wired and wireless communication solutions in South Korea. The company offers 5G core solutions, such as network repository function component, network slicing selection function, unified data repository, unified data management, security edge protection proxy, 5G-EIR (Equipment Identity Register), short message service function, authentication server function, policy control function, and multi-access edge computing systems. It also provides IMS infra solutions, including call session control function that performs SIP-based call control and session handling in the 3G network, and provides various multimedia services; home subscriber servers; interconnection border control functions; media gateway control functions; and session border asptroller, a network boundary node. In addition, the company offers IMS applications, such as telephony application servers, RCS IM systems, and media resource functions; and mobile (3G/4G) solutions, such as home location registers, authentication centers, WCDMA EIRs, IoT-HSS solution, and number portability database products. Further, it provides roaming and other solutions comprising gateway location registers, gateway home location registers, roaming signal monitoring systems, and roaming signal monitoring systems, as well as WiFi network authentication, account, and authorization servers; NFV management and orchestration solution that provides NFV-based network service operation functions; and C4-SSW (Softswitch) systems. Additionally, the company offers video surveillance and intelligent video analysis solutions; and Telcobase main memory database management system, as well as laser detection-based light detection and ranging solution. Telcoware Co.,Ltd. was founded in 2000 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "095720.KS": {
        "short_name": "WOONGJIN THINKBIG",
        "long_name": "Woongjin Thinkbig Co., Ltd.",
        "summary": "Woongjin Thinkbig Co., Ltd. operates as a book publisher for various age groups in South Korea. It develops and offers educational and cultural content for toddlers to adults, including member-only workbooks, complete works series for children, study rooms, learning centers, online and offline book publishing services, etc. The company publishes books in various genres, including literature, humanities, social science, history, economy and business administration, self-development, children education, lifestyle, etc. It also provides children reading, customized reading design, and visiting learning services. Woongjin Thinkbig Co., Ltd. was founded in 1980 and is based in Paju, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Paju-Si"
    },
    "100220.KS": {
        "short_name": "VISANG",
        "long_name": "Visang Education Inc",
        "summary": "Visang Education Inc publishes elementary, middle, and high school textbooks in South Korea. The company offers Wings, an interactive English program; Challenge, an English learning program with AR/MR technology; englisheye, an English academy; JUMPSKY, an edutainment facility for healthy mind; WISECAMP, an integrated subject program; soobakc.com for Internet lectures of various subjects; TESOM, a test and evaluation solutions for Math; VISANG Ivytz educational institutes for English and Mathematics; and VISANG Practice Test, an entrance examination consulting service, as well as EBS Nurisam. It also provides Viva Sam, a service that supports teachers at the elementary, and middle and high schools; VISANG TSCHOOl, a remote education training institute for teachers; Mom & Talk, a community of parents; Soohak Plus Learning, an education institute solutions for customized classes; MasterTOPIK, an Internet lectures for TOPIK; and MasterKOREAN, a customized-type Internet lectures for learning Korean language, as well as digital textbooks, and supplementary books. The company was formerly known as Visang, Inc. and changed its name to Visang Education Inc in 2009. Visang Education Inc was founded in 1997 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "126560.KS": {
        "short_name": "Hyundai Futurenet",
        "long_name": "Hyundai Futurenet Co., Ltd",
        "summary": "Hyundai Futurenet Co., Ltd provides digital cable TV services in South Korea. It offers multi-channel, high-definition, and bi-directional broadcasting services, as well as ultra-speed Internet connection and Internet telephone services; and B2B rental and digital signage services for local communities. The company also distributes content for terrestrial, CATV, satellite, IPTV, and HD broadcasting; and provides cable advertising services. The company was formerly known as Hyundai HCN Co., Ltd. Hyundai Futurenet Co., Ltd was founded in 1995 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "181710.KS": {
        "short_name": "NHN",
        "long_name": "NHN Corporation",
        "summary": "NHN Corporation, an IT company, provides gaming, payment, entertainment, IT, and advertisement solutions in South Korea and internationally. It offers PAYCO, a payment service for online and offline stores; and NHN KCP, an integrated e-payment service. The company also provides comico, a Webtoon platform; Bugs, a music portal operating music streaming and online music distribution business; Ticketlink, a concert, culture, and sports ticket booking service; and Doctortour, a travel service that offers various travel packages. In addition, it offers Shop by, an online shopping mall solution, Godomall 5, an e-commerce solution for small and medium sized markets, TOAST, an integrated cloud solution; TOAST Cam, a smart cloud IP camera; TOAST File, a personal cloud service that helps file storage and management; and TOAST Cloud Center, a cloud data center. Further, the company provides NHN ACE, an integrated advertisement and marketing platform; OPEN Ads, a marketing data curation service; More, an onsite marketing solution; I am School, an education management platform; and Pink Diary, a female health care app for Korean society of obstetricians and gynecologists developed based on consultation by doctors. The company was formerly known as NHN Entertainment Corp. and changed its name to NHN Corporation in April 2019. NHN Corporation was founded in 2013 and is headquartered in Seongnam, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seongnam-si"
    },
    "192080.KS": {
        "short_name": "DoubleUGames",
        "long_name": "DoubleUGames Co., Ltd.",
        "summary": "DoubleUGames Co., Ltd. develops games. The company offers W. Casino, a social casino game, as well as table games and slot machines. It also operates one source multiplatform, as well as offers PC and mobile games. The company operates in approximately 120 countries. DoubleUGames Co., Ltd. was founded in 2012 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "214320.KS": {
        "short_name": "INNOCEAN",
        "long_name": "Innocean Worldwide Inc.",
        "summary": "Innocean Worldwide Inc. provides marketing and communications services worldwide. The company offers advertising services; digital services, including providing campaigns for online, mobile, social, and other means in the media environment and advanced digital platform operations; and experiential services, such as planning and producing content to induce significant consumer behaviors. It also provides marketing services, such as brand diagnosis, problem extraction, discovery of market opportunities, brand positioning, and communication strategy development; and media services. The company was founded in 2005 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "251270.KS": {
        "short_name": "Netmarble",
        "long_name": "Netmarble Corporation",
        "summary": "Netmarble Corporation, along with its subsidiaries, develops and publishes online and mobile games in South Korea and internationally. It also engages in apparel, asset management, real estate development, and advertising and marketing businesses. The company was founded in 2000 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "352820.KS": {
        "short_name": "HYBE",
        "long_name": "HYBE Co., Ltd.",
        "summary": "Big Hit Entertainment Co., Ltd. engages in music production, publishing, and artist development and management businesses. It is also involved in IP and platform activities. The company was founded in 2005 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "GD8A.F": {
        "short_name": "GRAVITY CO.LTD ADR/1SW500",
        "long_name": "Gravity Co., Ltd.",
        "summary": "Gravity Co., Ltd. develops, publishes, and distributes online games mainly in South Korea, Taiwan, Thailand, the Philippines, and internationally. It offers a massively multiplayer online role-playing game, including Ragnarok Online, Requiem, Dragonica, Ragnarok Online II, and Ragnarok Prequel II, as well as Ragnarok Clicker, a Web browser-based role-playing game. The company's mobile games portfolio includes Ragnarok M: Eternal Love; Ragnarok Origin; Ragnarok X: Next Generation; Sacred Blade; Dark Eden; the Labyrinth of Ragnarok; Ragnarok Poring Merge; Action RO2: Spear of Odin; Tera Classic; the Lord; and the Color of Dream Fantasy, Latale. It also provides console games, such as Ragnarok DS for Nintendo DS; Ragnarok: The Princess of Light and Darkness for PlayStation Portable; Ragnarok Odyssey for PlayStation Vita; Double Dragon II for Xbox 360; and Ragnarok Odyssey Ace for PlayStation Vita and PlayStation 3. In addition, the company offers games for IPTV, including Pororo: The Little Penguin; and markets dolls, stationery, food, and other character-based merchandises, as well as game manuals, monthly magazines, and other publications. Further, it provides system development and maintenance services, as well as system integration services to third parties. As of December 31, 2020, it owned 129 registered domain names. The company was incorporated in 2000 and is headquartered in Seoul, South Korea. Gravity Co., Ltd. is a subsidiary of GungHo Online Entertainment, Inc.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "GRVY": {
        "short_name": "GRAVITY Co., Ltd.",
        "long_name": "Gravity Co., Ltd.",
        "summary": "Gravity Co., Ltd. develops, publishes, and distributes online games mainly in South Korea, Taiwan, Thailand, the Philippines, and internationally. It offers a massively multiplayer online role-playing game, including Ragnarok Online, Requiem, Dragonica, Ragnarok Online II, and Ragnarok Prequel II, as well as Ragnarok Clicker, a Web browser-based role-playing game. The company's mobile games portfolio includes Ragnarok M: Eternal Love; Ragnarok Origin; Ragnarok X: Next Generation; Sacred Blade; Dark Eden; the Labyrinth of Ragnarok; Ragnarok Poring Merge; Action RO2: Spear of Odin; Tera Classic; the Lord; and the Color of Dream Fantasy, Latale. It also provides console games, such as Ragnarok DS for Nintendo DS; Ragnarok: The Princess of Light and Darkness for PlayStation Portable; Ragnarok Odyssey for PlayStation Vita; Double Dragon II for Xbox 360; and Ragnarok Odyssey Ace for PlayStation Vita and PlayStation 3. In addition, the company offers games for IPTV, including Pororo: The Little Penguin; and markets dolls, stationery, food, and other character-based merchandises, as well as game manuals, monthly magazines, and other publications. Further, it provides system development and maintenance services, as well as system integration services to third parties. As of December 31, 2020, it owned 129 registered domain names. The company was incorporated in 2000 and is headquartered in Seoul, South Korea. Gravity Co., Ltd. is a subsidiary of GungHo Online Entertainment, Inc.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NMS",
        "market": "us_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "KMB.F": {
        "short_name": "SK TELECOM CO.LTD.ADR 1/9",
        "long_name": "SK Telecom Co.,Ltd",
        "summary": "SK Telecom Co., Ltd. provides wireless telecommunication services in South Korea and internationally. The Cellular Services segment offers wireless voice and data transmission, cellular global roaming, interconnection, Internet of Things, and platform services, as well as sells smartphones, basic phones, tablets and other Internet access devices, and wearable devices. The Fixed-Line Telecommunication Services segment provides local, domestic and international long distance, and voice over Internet protocol services; broadband Internet access; Internet protocol TV and mobile over-the-top; and leased line solutions, Internet data center, and network solution services. The Commerce Services segment operates 11st, an online open marketplace; and T-commerce network that offer assortment of goods and services through pre-recorded television programming. The Other Businesses segment provides marketing platform services, such as Syrup Wallet, a mobile wallet service; OK Cashbag, a loyalty points program; and One Store, a mobile application marketplace. The Security Services segment offers physical security services, which includes centralized monitoring system; information security solutions, such as information security consulting, managed security, and cyber threat intelligence solutions; and operates parking management and security solutions business. In addition, it offers call center management, base station maintenance, information gathering and consulting, system software development and supply, quantum information and communications, data base and internet website, and digital contents sourcing services; manufactures and sells e-book; sells and trades in anti-theft and surveillance devices; and operates information and communications facilities. As of December 31, 2020, the company had 3.8 million fixed-line telephone and 31.4 million wireless subscribers. The company was incorporated in 1984 and is headquartered in Seoul, South Korea.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "KMB.MU": {
        "short_name": "SK TELECOM CO.LTD.ADR 1/9",
        "long_name": "SK Telecom Co.,Ltd",
        "summary": "SK Telecom Co., Ltd. provides wireless telecommunication services in South Korea and internationally. The Cellular Services segment offers wireless voice and data transmission, cellular global roaming, interconnection, Internet of Things, and platform services, as well as sells smartphones, basic phones, tablets and other Internet access devices, and wearable devices. The Fixed-Line Telecommunication Services segment provides local, domestic and international long distance, and voice over Internet protocol services; broadband Internet access; Internet protocol TV and mobile over-the-top; and leased line solutions, Internet data center, and network solution services. The Commerce Services segment operates 11st, an online open marketplace; and T-commerce network that offer assortment of goods and services through pre-recorded television programming. The Other Businesses segment provides marketing platform services, such as Syrup Wallet, a mobile wallet service; OK Cashbag, a loyalty points program; and One Store, a mobile application marketplace. The Security Services segment offers physical security services, which includes centralized monitoring system; information security solutions, such as information security consulting, managed security, and cyber threat intelligence solutions; and operates parking management and security solutions business. In addition, it offers call center management, base station maintenance, information gathering and consulting, system software development and supply, quantum information and communications, data base and internet website, and digital contents sourcing services; manufactures and sells e-book; sells and trades in anti-theft and surveillance devices; and operates information and communications facilities. As of December 31, 2020, the company had 3.8 million fixed-line telephone and 31.4 million wireless subscribers. The company was incorporated in 1984 and is headquartered in Seoul, South Korea.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "KT": {
        "short_name": "KT Corporation",
        "long_name": "KT Corporation",
        "summary": "KT Corporation provides integrated telecommunications and platform services in Korea and internationally. The company offers fixed-line telephone services, including local, domestic long-distance, international long-distance, and voice over Internet protocol telephone services, as well as interconnection services; broadband Internet access service and other Internet-related services; and data communication services, such as fixed-line and leased line services, as well as broadband Internet connection services. It also provides media and content services, including IPTV, satellite TV, digital music, e-commerce, online advertising consulting, and digital comics and novels services; and credit card processing and other financial services. In addition, the company offers information technology and network services, and satellite services; sells handsets and miscellaneous telecommunications equipment; develops and sells residential units and commercial real estate; and rents real estate properties. Further, it maintains public telephones; offers security, B2C and B2B, investment fund, software development and data processing, value added network, system integration and maintenance, mobile marketing, PCS distribution, satellite broadcasting, cloud system implementation, network installation and management, and data center development and related services. Additionally, the company is involved in the Internet banking ASP and security solutions, residential building development and supply, sports group management, technology business finance, software development and supply, submarine cable construction and maintenance, and trunk radio systems businesses. As of December 31, 2020, the company served approximately 22.3 million mobile subscribers and 8.8 million IPTV subscribers. The company was formerly known as Korea Telecom Corp. and changed its name to KT Corporation in March 2002. KT Corporation was founded in 1981 and is headquartered in Seongnam, South Korea.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "South Korea",
        "city": "Seongnam"
    },
    "KTC.F": {
        "short_name": "KT CORP. ADR 1/2/SW 5000",
        "long_name": "KT Corporation",
        "summary": "KT Corporation provides integrated telecommunications and platform services in Korea and internationally. The company offers fixed-line telephone services, including local, domestic long-distance, international long-distance, and voice over Internet protocol telephone services, as well as interconnection services; broadband Internet access service and other Internet-related services; and data communication services, such as fixed-line and leased line services, as well as broadband Internet connection services. It also provides media and content services, including IPTV, satellite TV, digital music, e-commerce, online advertising consulting, and digital comics and novels services; and credit card processing and other financial services. In addition, the company offers information technology and network services, and satellite services; sells handsets and miscellaneous telecommunications equipment; develops and sells residential units and commercial real estate; and rents real estate properties. Further, it maintains public telephones; offers security, B2C and B2B, investment fund, software development and data processing, value added network, system integration and maintenance, mobile marketing, PCS distribution, satellite broadcasting, cloud system implementation, network installation and management, and data center development and related services. Additionally, the company is involved in the Internet banking ASP and security solutions, residential building development and supply, sports group management, technology business finance, software development and supply, submarine cable construction and maintenance, and trunk radio systems businesses. As of December 31, 2020, the company served approximately 22.3 million mobile subscribers and 8.8 million IPTV subscribers. The company was formerly known as Korea Telecom Corp. and changed its name to KT Corporation in March 2002. KT Corporation was founded in 1981 and is headquartered in Seongnam, South Korea.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Korea",
        "city": "Seongnam"
    },
    "SKM": {
        "short_name": "SK Telecom Co., Ltd.",
        "long_name": "SK Telecom Co.,Ltd",
        "summary": "SK Telecom Co., Ltd. provides wireless telecommunication services in South Korea and internationally. The Cellular Services segment offers wireless voice and data transmission, cellular global roaming, interconnection, Internet of Things, and platform services, as well as sells smartphones, basic phones, tablets and other Internet access devices, and wearable devices. The Fixed-Line Telecommunication Services segment provides local, domestic and international long distance, and voice over Internet protocol services; broadband Internet access; Internet protocol TV and mobile over-the-top; and leased line solutions, Internet data center, and network solution services. The Commerce Services segment operates 11st, an online open marketplace; and T-commerce network that offer assortment of goods and services through pre-recorded television programming. The Other Businesses segment provides marketing platform services, such as Syrup Wallet, a mobile wallet service; OK Cashbag, a loyalty points program; and One Store, a mobile application marketplace. The Security Services segment offers physical security services, which includes centralized monitoring system; information security solutions, such as information security consulting, managed security, and cyber threat intelligence solutions; and operates parking management and security solutions business. In addition, it offers call center management, base station maintenance, information gathering and consulting, system software development and supply, quantum information and communications, data base and internet website, and digital contents sourcing services; manufactures and sells e-book; sells and trades in anti-theft and surveillance devices; and operates information and communications facilities. As of December 31, 2020, the company had 3.8 million fixed-line telephone and 31.4 million wireless subscribers. The company was incorporated in 1984 and is headquartered in Seoul, South Korea.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "South Korea",
        "city": "Seoul"
    }
}