{
    "011420.KS": {
        "short_name": "GALAXIA SM",
        "long_name": "Galaxia SM, Inc.",
        "summary": "Galaxia SM, Inc. engages in broadcast program production, sports marketing, and communication businesses in South Korea. The company produces international signals; organizes and operates international broadcast centers; and provides facilities and services for broadcasting to the rights holders, as well as produces sports presentations of athletics, swimming, and gymnastics. It is also involved in the provision of sports presentation services, such as in-house broadcasting, music, video, and lighting in the stadium; and media broadcasting rights activities. In addition, the company establishes and executes sports marketing strategies; offers channel, digital, and pre-sale marking services, as well as undertakes advertising agency works; develops and operates sports facilities, such as golf courses, fitness centers, ball game, sports, swimming pool, etc.; operates restaurants, cafes, etc.; and operates golf, gymnastics, and baseball academies. Further, it produces mobile videos; and operates and sells channels. Galaxia SM, Inc. was founded in 1975 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.galaxiasme.com",
        "market_cap": "Large Cap"
    },
    "037560.KS": {
        "short_name": "LG HelloVision",
        "long_name": "LG HelloVision Corp.",
        "summary": "LG HelloVision Corp. home connectivity solutions in South Korea. It offers broadcasting and communication technologies, such as digital cable TV, UHD broadcasting, giga Internet, and cloud broadcasting services; high-speed Internet services; telephone services; mobile services; and rental of home appliances, TVs, PCs, and laptops. The company was formerly known as CJ Hello Co., Ltd. and changed its name to LG HelloVision Corp. in December 2019. LG HelloVision Corp. was founded in 1995 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "03923",
        "website": "http://www.lghellovision.net",
        "market_cap": "Large Cap"
    },
    "053210.KS": {
        "short_name": "KT Skylife",
        "long_name": "KT Skylife Co., Ltd.",
        "summary": "KT Skylife Co., Ltd., a media company, provides digital satellite broadcasting services in South Korea. It offers skylife satellite broadcasting, Internet, mobile, and sky home appliances, as well as UHD TV and PC. The company was founded in 2002 and is headquartered in Seoul, South Korea. KT Skylife Co., Ltd is a subsidiary of KT Corporation.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "121-830",
        "website": "http://www.skylife.co.kr",
        "market_cap": "Large Cap"
    }
}