{
    "003560.KS": {
        "short_name": "IHQ",
        "long_name": "IHQ Inc.",
        "summary": "IHQ Inc. operates as an entertainment company in Korea. It produces content in various fields, such as drama, entertainment, and record. The company is also involved in the star management activities; and operation of Comedy TV and Cube TV.IHQ Inc. was founded in 1962 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "034120.KS": {
        "short_name": "SBS",
        "long_name": "Seoul Broadcasting System",
        "summary": "Seoul Broadcasting System engages in the broadcasting, cultural service, and advertising businesses in South Korea and internationally. It provides terrestrial TV and radio broadcasting services based on broadcasting law. The company sells TV program contents to cable PP, satellite broadcasting, Internet and IP TV, and other customers. It is also involved in cultural projects, such as exhibitions and entertainment performances. The company was founded in 1990 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "036420.KS": {
        "short_name": "Jcontentree",
        "long_name": "Jcontentree corp.",
        "summary": "Jcontentree corp., a media company, engages in the production and distribution of broadcasting programs in South Korea and internationally. The company produces and distributes media contents for various wired and wireless platforms. It also produces dramas; and operates movie theaters. The company was founded in 1987 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    }
}