{
    "003560.KS": {
        "short_name": "IHQ",
        "long_name": "IHQ Inc.",
        "summary": "IHQ Inc. operates as an entertainment company in Korea. It produces content in various fields, such as drama, entertainment, and record. The company is also involved in the star management activities; and operation of Comedy TV and Cube TV.IHQ Inc. was founded in 1962 and is based in Seoul, South Korea. As of February 25, 2021, IHQ Inc. operates as a subsidiary of KH Media Co., Ltd.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "06014",
        "website": "http://www.ihq.co.kr",
        "market_cap": "Micro Cap"
    },
    "012170.KS": {
        "short_name": "Ascendio",
        "long_name": "Ascendio Co., Ltd.",
        "summary": "Ascendio Co., Ltd. engages in the entertainment business in South Korea and internationally. The company involved in the movie investment and distribution business, entertainment content business, and performance business; book publishing activities; and management consulting activities. The company was formerly known as KIWI Media Group Co.,Ltd. and changed its name to Ascendio Co., Ltd. in March 2021. Ascendio Co., Ltd. was founded in 1977 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "06050",
        "website": "http://www.ascendio.co.kr",
        "market_cap": "Micro Cap"
    },
    "034120.KS": {
        "short_name": "SBS",
        "long_name": "Seoul Broadcasting System",
        "summary": "Seoul Broadcasting System engages in the broadcasting, cultural service, and advertising businesses in South Korea and internationally. It provides terrestrial TV and radio broadcasting services based on broadcasting law. The company sells TV program contents to cable PP, satellite broadcasting, Internet and IP TV, and other customers. It is also involved in cultural projects, such as exhibitions and entertainment performances. The company was founded in 1990 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.sbs.co.kr",
        "market_cap": "Small Cap"
    },
    "036420.KS": {
        "short_name": "Jcontentree",
        "long_name": "Jcontentree corp.",
        "summary": "Jcontentree corp., a media company, engages in the production and distribution of broadcasting programs in South Korea and internationally. The company produces and distributes media contents for various wired and wireless platforms. It also produces dramas; and operates movie theaters. The company was founded in 1987 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.jcontentree.com",
        "market_cap": "Small Cap"
    },
    "126560.KS": {
        "short_name": "Hyundai Futurenet",
        "long_name": "Hyundai Futurenet Co., Ltd",
        "summary": "Hyundai Futurenet Co., Ltd provides digital cable TV services in South Korea. It offers multi-channel, high-definition, and bi-directional broadcasting services, as well as ultra-speed Internet connection and Internet telephone services; and B2B rental and digital signage services for local communities. The company also distributes content for terrestrial, CATV, satellite, IPTV, and HD broadcasting; and provides cable advertising services. The company was formerly known as Hyundai HCN Co., Ltd. Hyundai Futurenet Co., Ltd was founded in 1995 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.hyundaifuturenet.co.kr",
        "market_cap": "Small Cap"
    },
    "352820.KS": {
        "short_name": "HYBE",
        "long_name": "HYBE Co., Ltd.",
        "summary": "Big Hit Entertainment Co., Ltd. engages in music production, publishing, and artist development and management businesses. It is also involved in IP and platform activities. The company was founded in 2005 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.bighitcorp.com",
        "market_cap": "Mid Cap"
    }
}