{
    "020120.KS": {
        "short_name": "KidariStudio",
        "long_name": "KidariStudio, Inc.",
        "summary": "KidariStudio, Inc., a representative content company, develops various media content worldwide. The company develops e-book, e-learning, and Webtoon content. It publishes e-books in various fields, such as fantasy, martial arts, romance, BL, light novel, sensual novel, and other fields. The company was formerly known as Daouincube, Inc. and changed its name to KidariStudio, Inc. in March 2018. The company was founded in 1987 and is headquartered in Seoul, South Korea. KidariStudio, Inc. is a subsidiary of Daou Data Corp.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.kidaristudio.com",
        "market_cap": 513975615488
    },
    "035420.KS": {
        "short_name": "NAVER",
        "long_name": "NAVER Corporation",
        "summary": "NAVER Corporation, together with its subsidiaries, provides internet and online search portal, and mobile messenger platform services in South Korea, Japan, and internationally. The company offers Naver, a search portal that offers various content topic boards; LINE, a messaging application; Naver Clova, an integrated AI platform; Papago, an automated interpretation application; WHALE, a web browser; Naver Map, a navigation application; V LIVE, a celebrities free global live streaming platform; Webtoon, a promotion system for mobile comics; SERIES, a paid content platform; SNOW, a camera; BAND, a mobile community platform; and AudioClip, an audio content platform. It also provides an online information distribution, business support, workforce supply, employee dispatch, software development and distribution, mobile service development, exhibition and performance planning, IT infrastructure, software consulting, mobile billing system planning and development, telecommunication, and mobile advertising services. In addition, NAVER Corporation is involved in the manufacture of cosmetics; electronic financial business; film production and distribution; real estate rental, and investment and information business; and character and doll wholesale and retail activities. The company was formerly known as NHN Corporation. NAVER Corporation was founded in 1999 and is headquartered in Seongnam, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seongnam-si",
        "zipcode": "13561",
        "website": "http://www.navercorp.com",
        "market_cap": 55248831905792
    },
    "035720.KS": {
        "short_name": "Kakao",
        "long_name": "Kakao Corp.",
        "summary": "Kakao Corp. operates mobile and other online platforms in South Korea. Its platform operations comprise its talk business, portal business, and other business, which provide users with the ability to communicate, search content, shop, and make payments online, as well as use services, such as mobile transportation applications. The company offers its services under the brands of Kakao, Daum, and Melon. The company was formerly known as Daum Kakao Corp. and changed its name to Kakao Corp. in October 2015. Kakao Corp. was founded in 1995 and is headquartered in Jeju, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Jeju-Si",
        "zipcode": "63309",
        "website": "http://www.kakaocorp.com",
        "market_cap": 58467033284608
    }
}