{
    "ADR.AX": {
        "short_name": "ADHERIUM FPO",
        "long_name": "Adherium Limited",
        "summary": "Adherium Limited develops, manufactures, and supplies digital health technologies that address sub-optimal medication use in chronic diseases in New Zealand, Australia, Europe, North America, and Asia. It offers Hailie, an asthma and COPD medication adherence solution for patients with chronic respiratory diseases. The company also provides a range of smart device sensors for respiratory medications, such as Bluetooth enabled Hailie sensors wrap around a patient's existing inhalers and automatically send usage data to their smartphone; and Hailie app that enables patients, caregivers, and healthcare professionals to track medication adherence, set daily reminders, and discover insights into their medication usage. It offers its digital health solutions to patients, pharmaceutical companies, healthcare providers, and contract research organizations. The company has a collaboration with HGE Health in COPD. The company was founded in 2001 and is headquartered in Auckland, New Zealand.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.adherium.com",
        "full_time_employees": null
    },
    "AFP.AX": {
        "short_name": "AFT PHARM FPO NZX",
        "long_name": "AFT Pharmaceuticals Limited",
        "summary": "AFT Pharmaceuticals Limited develops, licenses, and sells pharmaceutical products in New Zealand, Australia, Southeast Asia, and internationally. The company offers approximately 130 prescription and non-prescription products for use in the areas of allergy, eye care, first aid, fungal, pain management, and skin care, as well as supplements. It is also involved in the distribution of pharmaceuticals. The company was founded in 1997 and is headquartered in Auckland, New Zealand.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "ASX",
        "market": "au_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "0622",
        "website": "http://www.aftpharm.com",
        "full_time_employees": 86
    },
    "AFT.NZ": {
        "short_name": "AFT Pharmaceuticals Ltd Ordinar",
        "long_name": "AFT Pharmaceuticals Limited",
        "summary": "AFT Pharmaceuticals Limited develops, licenses, distributes, and sells pharmaceutical products in New Zealand, Australia, Southeast Asia, and internationally. The company offers products for use in the areas of allergy, cold and flu, digestive health, eye care, first aid, nail and oral care, pain management, skin care, and other products, as well as supplements. The company was incorporated in 1997 and is headquartered in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "0622",
        "website": "http://www.aftpharm.com",
        "full_time_employees": 94
    },
    "ARV.NZ": {
        "short_name": "Arvida Group Limited Ordinary S",
        "long_name": "Arvida Group Limited",
        "summary": "Arvida Group Limited, together with its subsidiaries, owns, develops, and operates retirement villages and care facilities for the elderly in New Zealand. As of March 31, 2020, it operated approximately 32 retirement villages with 1,688 aged care beds and 2,475 retirement units. The company was formerly known as Hercules Limited. Arvida Group Limited was founded in 2014 and is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.arvida.co.nz",
        "full_time_employees": 2600
    },
    "ARX.AX": {
        "short_name": "AROA BIO FPO",
        "long_name": "Aroa Biosurgery Limited",
        "summary": "Aroa Biosurgery Limited, a regenerative medicine company, develops and manufactures medical devices for wound and tissue repair in the United States and internationally. Its products include Endoform Natural and Endoform Antimicrobia for treating acute and chronic wounds; Myriad, an implant and dermal procedures for soft tissue repair, reinforcement, and complex wounds; and Reinforced Bioscaffolds, a biologics and synthetics product used in surgical ventral hernia repair solutions. The company was founded in 2008 and is based in Auckland, New Zealand.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "2150",
        "website": "http://aroabio.com",
        "full_time_employees": null
    },
    "BLT.NZ": {
        "short_name": "Blis Technologies Limited Ordin",
        "long_name": "BLIS Technologies Limited",
        "summary": "BLIS Technologies Limited develops and sells healthcare products based on strains of bacteria that produce bacteriocin activity. The company markets two strains of probiotic bacteria, which include BLIS K12, a probiotic supplement to support ear, nose, and throat health of infants and children, as well as for improving bad breath; and BLIS M18 for promoting the bacterial balance for dental health. Its product portfolio consists of DailyDefence, a daily probiotic to support throat immunity; DailyDefence Junior, a daily powder formulation to support ear, nose, and throat health of infants and small children; ThroatGuard PRO to give immunity support to help protect against winter ills; ElitePRO, a suite of WADA tested products for athletes; and TravelProtect to help support the immune system when travelling. The company also offers FreshBreath Kit, a regime that re-populates the mouth, thereby replacing the bad smelly bacteria in the mouth; HoneyBlis, a tasting honey lozenge to soothe and protect a scratchy or a sore throat; and ToothGuard and ToothGuard Junior probiotics for the health of teeth and gums helping to prevent cavities in children and gum disease in adults. It has operations in Asia Pacific, Europe, the Middle East, Africa, North America, and internationally. BLIS Technologies Limited was incorporated in 2000 and is headquartered in Dunedin, New Zealand.",
        "currency": "NZD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Dunedin",
        "zipcode": "9012",
        "website": "http://www.blis.co.nz",
        "full_time_employees": null
    },
    "CBD.NZ": {
        "short_name": "Cannasouth Limited Ordinary Sha",
        "long_name": "Cannasouth Limited",
        "summary": "Cannasouth Limited, a biopharmaceutical company, engages in the research, development, production, and supply of cannabis biomass and cannabinoid medicines in New Zealand. The company was incorporated in 2018 and is based in Hamilton, New Zealand.",
        "currency": "NZD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Hamilton",
        "zipcode": "3256",
        "website": "http://www.cannasouth.co.nz",
        "full_time_employees": null
    },
    "CVT.NZ": {
        "short_name": "Comvita Limited Ordinary Shares",
        "long_name": "Comvita Limited",
        "summary": "Comvita Limited, together with its subsidiaries, engages in the manufacturing and marketing of natural health products in Australia, New Zealand, China, rest of Asia, North America, Europe, the Middle East, Africa, and internationally. It offers Manuka honey, propolis, olive leaf extract, medihoney and skincare, gourmet honey, elixirs and lozenges, royal jelly, omega 3, and cider vinegar products, as well as oral, kids, and eye health products. The company also engages in the apiary ownership and management, property ownership, and research and development activities. Comvita Limited was founded in 1974 and is based in Te Puke, New Zealand.",
        "currency": "NZD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Te Puke",
        "zipcode": "3153",
        "website": "http://www.comvita.co.nz",
        "full_time_employees": null
    },
    "FPH.AX": {
        "short_name": "F&P HEALTH FPO NZX",
        "long_name": "Fisher & Paykel Healthcare Corporation Limited",
        "summary": "Fisher & Paykel Healthcare Corporation Limited, together with its subsidiaries, designs, manufactures, markets, and sells medical device products and systems worldwide. It provides its products for use in respiratory care, acute care, and surgery, as well as the treatment of obstructive sleep apnea (OSA) in the home and hospital. The company offers myAIRVO 2, a humidifier with integrated flow source; Optiflow, a nasal high flow therapy; and noninvasive and invasive ventilation systems. It also provides infant respiratory products, such as resuscitation, continuous positive airway pressure (CPAP) therapy, and nasal high flow therapy products. In addition, the company offers hospital products, including humidification products, breathing circuits, chambers, masks, nasal cannulas, surgical, accessories, and interfaces; and homecare products that include masks, CPAP devices, data management products, humidifiers, and accessories. Fisher & Paykel Healthcare Corporation Limited was founded in 1934 and is headquartered in Auckland, New Zealand.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "ASX",
        "market": "au_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "2013",
        "website": "http://www.fphcare.com",
        "full_time_employees": 4710
    },
    "FPH.NZ": {
        "short_name": "Fisher & Paykel Healthcare Corp",
        "long_name": "Fisher & Paykel Healthcare Corporation Limited",
        "summary": "Fisher & Paykel Healthcare Corporation Limited, together with its subsidiaries, designs, manufactures, markets, and sells medical device products and systems worldwide. It provides its products for use in respiratory care, acute care, and surgery, as well as the treatment of obstructive sleep apnea (OSA) in the home and hospital. The company offers myAIRVO 2, a humidifier with integrated flow source; Optiflow, a nasal high flow therapy; and noninvasive and invasive ventilation systems. It also provides infant respiratory products, such as resuscitation, continuous positive airway pressure (CPAP) therapy, and nasal high flow therapy products. In addition, the company offers hospital products, including humidification products, breathing circuits, chambers, masks, nasal cannulas, surgical, accessories, and interfaces; and homecare products that include masks, CPAP devices, data management products, humidifiers, and accessories. Fisher & Paykel Healthcare Corporation Limited was founded in 1934 and is headquartered in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "2013",
        "website": "http://www.fphcare.com",
        "full_time_employees": 4710
    },
    "FSPKF": {
        "short_name": "FISHER & PAYKEL HEALTHCARE CORP",
        "long_name": "Fisher & Paykel Healthcare Corporation Limited",
        "summary": "Fisher & Paykel Healthcare Corporation Limited, together with its subsidiaries, designs, manufactures, markets, and sells medical device products and systems worldwide. It provides its products for use in respiratory care, acute care, and surgery, as well as the treatment of obstructive sleep apnea (OSA) in the home and hospital. The company offers myAIRVO 2, a humidifier with integrated flow source; Optiflow, a nasal high flow therapy; and noninvasive and invasive ventilation systems. It also provides infant respiratory products, such as resuscitation, continuous positive airway pressure (CPAP) therapy, and nasal high flow therapy products. In addition, the company offers hospital products, including humidification products, breathing circuits, chambers, masks, nasal cannulas, surgical, accessories, and interfaces; and homecare products that include masks, CPAP devices, data management products, humidifiers, and accessories. Fisher & Paykel Healthcare Corporation Limited was founded in 1934 and is headquartered in Auckland, New Zealand.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "2013",
        "website": "http://www.fphcare.com",
        "full_time_employees": 4710
    },
    "GXH.NZ": {
        "short_name": "Green Cross Health Limited Ordi",
        "long_name": "Green Cross Health Limited",
        "summary": "Green Cross Health Limited provides health support, care, and advice services to communities in New Zealand. It operates in three segments: Pharmacy Services, Medical Services, and Community Health. The Pharmacy Services segment offers pharmacy services through stores, equity accounted investments, and franchise stores, including services. It operates approximately 350 community pharmacies under the Unichem and Life Pharmacy brands. The Medical Services segment operates owned and equity accounted medical centres; and offers support services provided to its medical centres, as well as medical centres outside the company. It also provides back office and operational services; and offers family healthcare services through GP, accident, and medical centres under The Doctors brand. The Community Health segment offers home health care and community nursing services to support independent living under the Access Community Health brand. The company was formerly known as Pharmacybrands Limited and changed its name to Green Cross Health Limited in April 2014. Green Cross Health Limited was incorporated in 1999 and is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1051",
        "website": "http://www.greencrosshealth.co.nz",
        "full_time_employees": null
    },
    "OCA.AX": {
        "short_name": "OCEA HEALT FPO NZX",
        "long_name": "Oceania Healthcare Limited",
        "summary": "Oceania Healthcare Limited owns and operates various retirement village and aged care centers in New Zealand. The company operates through three segments: Care Operations, Village Operations, and Other. It provides rest home, hospital, dementia, respite, and palliative and end of life care centers; and boutique villages. The company was formerly known as Retirement Care (NZ) Limited and changed its name to Oceania Healthcare Limited in September 2014. Oceania Healthcare Limited was incorporated in 2005 and is based in Auckland, New Zealand.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "ASX",
        "market": "au_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1011",
        "website": "http://www.oceaniahealthcare.co.nz",
        "full_time_employees": 2800
    },
    "OCA.NZ": {
        "short_name": "Oceania Healthcare Limited Ordi",
        "long_name": "Oceania Healthcare Limited",
        "summary": "Oceania Healthcare Limited owns and operates various retirement village and aged care centers in New Zealand. The company operates through three segments: Care Operations, Village Operations, and Other. It provides rest home, hospital, dementia, respite, and palliative and end of life care centers; and boutique villages. The company was formerly known as Retirement Care (NZ) Limited and changed its name to Oceania Healthcare Limited in September 2014. Oceania Healthcare Limited was incorporated in 2005 and is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1011",
        "website": "http://www.oceaniahealthcare.co.nz",
        "full_time_employees": 2800
    },
    "PEB.NZ": {
        "short_name": "Pacific Edge Limited Ordinary S",
        "long_name": "Pacific Edge Limited",
        "summary": "Pacific Edge Limited, a cancer diagnostic company, researches, develops, and commercializes diagnostic and prognostic tools for the early detection and management of cancers in New Zealand, the United States, and internationally. It operates in two segments, Commercial and Research. The company offers Cxbladder, a genomic urine tests for the detection and management of bladder cancer. It is also developing Cxbladder Resolve, a product designed to identify high grade or late stage bladder cancer and provide increased clinical resolution; and Cxcolorectal (prognosis Gen II), a prognostic gene signature for patients diagnosed with stage II or stage III colorectal cancers, which are in clinical and user trials. In addition, the company is developing products for gastric, melanoma, and endometrial cancers, which are in pre-clinical trials. Pacific Edge Limited was founded in 2001 and is headquartered in Dunedin, New Zealand.",
        "currency": "NZD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Dunedin",
        "zipcode": "9016",
        "website": "http://www.pacificedgedx.com",
        "full_time_employees": null
    },
    "RAD.NZ": {
        "short_name": "Radius Residential Care Limited",
        "long_name": "Radius Residential Care Limited",
        "summary": "Radius Residential Care Limited provides health and aged care services for elderly and disabled people in New Zealand. It offers residential, hospital, dementia, respite, and palliative care services. The company also provides rest home and private hospital care services; walking sticks, wheelchairs, rehabilitation chairs, etc. through online shop; and bedroom and bathroom equipment, such as bed protectors and shower aids. It operates 22 aged care facilities in New Zealand, including approximately 1,700 Care Beds. The company was incorporated in 2003 and is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1052",
        "website": "http://radiuscare.co.nz",
        "full_time_employees": null
    },
    "RH7.F": {
        "short_name": "RYMAN HEALTHCARE GRP LTD",
        "long_name": "Ryman Healthcare Limited",
        "summary": "Ryman Healthcare Limited develops, owns, and operates integrated retirement villages, rest homes, and hospitals for the elderly in New Zealand and Australia. Its villages offer a range of retirement living and care options, such as independent townhouses and apartments, and serviced apartments, as well as a care center, which provides rest homes, hospitals, dementia level care, and respite and day care services. The company's villages also offer lounges and bar, indoor swimming pool and spa, gym, beauty salon, bowling green, library, internet cafÃ©, movie theatre, and other facilities. Ryman Healthcare Limited was founded in 1984 and is based in Christchurch, New Zealand.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "New Zealand",
        "state": null,
        "city": "Christchurch",
        "zipcode": "8042",
        "website": "http://www.rymanhealthcare.co.nz",
        "full_time_employees": 6100
    },
    "RUA.NZ": {
        "short_name": "RUA Bioscience Limited Ordinary",
        "long_name": "Rua Bioscience Limited",
        "summary": "Rua Bioscience Limited, a pharmaceutical company, focuses on the research, cultivation, extraction, and manufacturing parts of the medicinal cannabis supply chain in New Zealand. It also exports bioactive extracts and products internationally. Rua Bioscience Limited has research and commercial partnerships with Crown Research Institutes and Universities Collaboration; Medical Research Institute of New Zealand; and Plant and Food New Zealand. The company was formerly known as Hikurangi Cannabis Company Limited and changed its name to Rua Bioscience Limited in October 2019. Rua Bioscience Limited was founded in 2016 and is based in Gisborne, New Zealand.",
        "currency": "NZD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Gisborne",
        "zipcode": "4071",
        "website": "http://www.ruabio.com",
        "full_time_employees": 26
    },
    "RYHTY": {
        "short_name": "RYMAN HEALTHCARE LIMITED",
        "long_name": "Ryman Healthcare Limited",
        "summary": "Ryman Healthcare Limited develops, owns, and operates integrated retirement villages, rest homes, and hospitals for the elderly in New Zealand and Australia. Its villages offer a range of retirement living and care options, such as independent townhouses and apartments, and serviced apartments, as well as a care center, which provides rest homes, hospitals, dementia level care, and respite and day care services. The company's villages also offer lounges and bar, indoor swimming pool and spa, gym, beauty salon, bowling green, library, internet cafÃ©, movie theatre, and other facilities. Ryman Healthcare Limited was founded in 1984 and is based in Christchurch, New Zealand.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "PNK",
        "market": "us_market",
        "country": "New Zealand",
        "state": null,
        "city": "Christchurch",
        "zipcode": "8042",
        "website": "http://www.rymanhealthcare.co.nz",
        "full_time_employees": 6100
    },
    "RYM.NZ": {
        "short_name": "Ryman Healthcare Limited Ordina",
        "long_name": "Ryman Healthcare Limited",
        "summary": "Ryman Healthcare Limited develops, owns, and operates integrated retirement villages, rest homes, and hospitals for the elderly in New Zealand and Australia. Its villages offer a range of retirement living and care options, such as independent townhouses and apartments, and serviced apartments, as well as a care center, which provides rest homes, hospitals, dementia level care, and respite and day care services. The company's villages also offer lounges and bar, indoor swimming pool and spa, gym, beauty salon, bowling green, library, internet cafÃ©, movie theatre, and other facilities. Ryman Healthcare Limited was founded in 1984 and is based in Christchurch, New Zealand.",
        "currency": "NZD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Christchurch",
        "zipcode": "8042",
        "website": "http://www.rymanhealthcare.co.nz",
        "full_time_employees": 6100
    },
    "SNZ.AX": {
        "short_name": "SUMMERSET FPO NZX",
        "long_name": "Summerset Group Holdings Limited",
        "summary": "Summerset Group Holdings Limited, together with its subsidiaries, develops, owns, and operates integrated retirement villages in New Zealand. It provides independent living, care centers with rest home, and hospital-level care and memory care centers, as well as rest home care, and respite and short-term care services. The company also owns land for development of retirement villages in Australia It develops and operates 32 retirement villages for approximately 6,200 residents. The company was founded in 1994 and is headquartered in Wellington, New Zealand. Summerset Group Holdings Limited is a subsidiary of New Zealand Central Securities Depository Limited.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "ASX",
        "market": "au_market",
        "country": "New Zealand",
        "state": null,
        "city": "Wellington",
        "zipcode": "6011",
        "website": "http://www.summerset.co.nz",
        "full_time_employees": 1823
    },
    "SUM.NZ": {
        "short_name": "Summerset Group Holdings Limite",
        "long_name": "Summerset Group Holdings Limited",
        "summary": "Summerset Group Holdings Limited, together with its subsidiaries, develops, owns, and operates integrated retirement villages in New Zealand. It provides independent living, care centers with rest home, and hospital-level care and memory care centers, as well as rest home care, and respite and short-term care services. The company also owns land for development of retirement villages in Australia It develops and operates 32 retirement villages for approximately 6,200 residents. The company was founded in 1994 and is headquartered in Wellington, New Zealand. Summerset Group Holdings Limited is a subsidiary of New Zealand Central Securities Depository Limited.",
        "currency": "NZD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Wellington",
        "zipcode": "6011",
        "website": "http://www.summerset.co.nz",
        "full_time_employees": 1823
    },
    "TAH.NZ": {
        "short_name": "Third Age Health Services Limit",
        "long_name": "Third Age Health Services Limited",
        "summary": "Third Age Health Services Limited, together with its subsidiaries, provides managed health care services for aged residential care facilities, private hospitals, and secure dementia facilities. The company was formerly known as Medplace Limited and changed its name to Third Age Health Services Limited in April 2011. Third Age Health Services Limited was incorporated in 2010 and is based in Napier, New Zealand.",
        "currency": "NZD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Napier",
        "zipcode": "4112",
        "website": "http://www.thirdagehealth.co.nz",
        "full_time_employees": null
    },
    "TRU.AX": {
        "short_name": "TRUSCREEN FPO NZX",
        "long_name": "TruScreen Group Limited",
        "summary": "Truscreen Group Limited, together with its subsidiaries, develops, manufactures, and sells cancer detection devices and systems in New Zealand and internationally. The company offers the TruScreen cervical cancer screening system, a medical device for detecting the presence of precancerous and cancerous tissue on the cervix in real time. The company was formerly known as TruScreen Limited and changed its name to Truscreen Group Limited in August 2020. Truscreen Group Limited was incorporated in 2013 and is headquartered in Auckland, New Zealand.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://truscreen.com",
        "full_time_employees": null
    },
    "TRU.NZ": {
        "short_name": "TruScreen Group Limited Ordinar",
        "long_name": "TruScreen Group Limited",
        "summary": "Truscreen Group Limited, together with its subsidiaries, develops, manufactures, and sells cancer detection devices and systems in New Zealand and internationally. The company offers the TruScreen cervical cancer screening system, a medical device for detecting the presence of precancerous and cancerous tissue on the cervix in real time. The company was formerly known as TruScreen Limited and changed its name to Truscreen Group Limited in August 2020. Truscreen Group Limited was incorporated in 2013 and is headquartered in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://truscreen.com",
        "full_time_employees": null
    },
    "VHT.AX": {
        "short_name": "VOLPARA FPO NZ",
        "long_name": "Volpara Health Technologies Limited",
        "summary": "Volpara Health Technologies Limited provides breast imaging analytics and analysis products for the early detection of breast cancer in the medical device and practice management software industry. The company offers VolparaEnterprise software, a cloud-based breast imaging analytics platform that delivers real-time quality assurance and performance monitoring solutions; and VolparaDensity software, which provides volumetric breast density measurements and a breast density category. It also offers VolparaDose, which compute the personalized x-ray dose to the patient based on breast density; VolparaPressure that computes the compression pressure applied to the breast during a mammogram; VolparaScorecard+, a clinical decision-support tool that provides insights for breast care; VolparaLive, a real-time decision support system, which analyzes patient positioning and compression, and offers real-time feedback; and VolparaRisk, a risk assessment software that delivers objective insight to radiologists for supplemental screening and testing. In addition, the company provides Aspen Breast, a workflow driven tracking and reporting solution; and Aspen Lung, a lung screening workflow tool that facilitates lung CT screening reporting and data system. Volpara Health Technologies Limited operates in North America, Europe, the Middle East, Africa, and the APAC countries. The company was formerly known as Matakina Technology Ltd. and changed its name to Volpara Health Technologies Limited in October 2015. Volpara Health Technologies Limited was founded in 2009 and is headquartered in Wellington, New Zealand.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "New Zealand",
        "state": null,
        "city": "Wellington",
        "zipcode": "6011",
        "website": "http://volparasolutions.com",
        "full_time_employees": 174
    }
}