{"ADR.AX": {"short_name": "ADHERIUM FPO", "long_name": "Adherium Limited", "summary": "Adherium Limited develops, manufactures, and supplies digital health technologies that address sub-optimal medication use in chronic diseases in New Zealand, Australia, Europe, North America, and Asia. It offers Hailie, an asthma and COPD medication adherence solution for patients with chronic respiratory diseases. The company also provides a range of smart device sensors for respiratory medications, such as Bluetooth enabled Hailie sensors wrap around a patient's existing inhalers and automatically send usage data to their smartphone; and Hailie app that enables patients, caregivers, and healthcare professionals to track medication adherence, set daily reminders, and discover insights into their medication usage. It offers its digital health solutions to patients, pharmaceutical companies, healthcare providers, and contract research organizations. The company has a collaboration with HGE Health in COPD. The company was founded in 2001 and is headquartered in Auckland, New Zealand.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "ASX", "market": "au_market", "country": "New Zealand", "city": "Auckland"}, "ARX.AX": {"short_name": "AROA BIO FPO", "long_name": "Aroa Biosurgery Limited", "summary": "Aroa Biosurgery Limited, a regenerative medicine company, develops and manufactures medical devices for wound and tissue repair in the United States and internationally. Its products include Endoform Natural and Endoform Antimicrobia for treating acute and chronic wounds; Myriad, an implant and dermal procedures for soft tissue repair, reinforcement, and complex wounds; and Reinforced Bioscaffolds, a biologics and synthetics product used in surgical ventral hernia repair solutions. The company was founded in 2008 and is based in Auckland, New Zealand.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "ASX", "market": "au_market", "country": "New Zealand", "city": "Auckland"}, "TRU.NZ": {"short_name": "TruScreen Group Limited Ordinar", "long_name": "TruScreen Group Limited", "summary": "Truscreen Group Limited, together with its subsidiaries, develops, manufactures, and sells cancer detection devices and systems in New Zealand, Mexico, China, Russia, Zimbabwe, Papua New Guinea, and internationally. The company offers the TruScreen cervical cancer screening system, a medical device for detecting the presence of precancerous and cancerous tissue on the cervix in real time. The company was formerly known as TruScreen Limited and changed its name to Truscreen Group Limited in August 2020. Truscreen Group Limited was incorporated in 2013 and is headquartered in Auckland, New Zealand.", "currency": "NZD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "NZE", "market": "nz_market", "country": "New Zealand", "city": "Auckland"}}