{
  "DMCHY": {
    "city": "Makati City",
    "country": "Philippines",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Thermal Coal",
    "long_name": "DMCI Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Energy",
    "short_name": "DMCI HLDGS INC",
    "state": null,
    "summary": "DMCI Holdings, Inc., through its subsidiaries, engages in the general construction, coal and nickel mining, power generation, real estate development, water concession, and manufacturing businesses in the Philippines and internationally. It operates through seven segments: Construction and Others, Coal Mining, Nickel Mining, Real Estate, On-Grid Power, Off-Grid Power, and Water. It constructs various projects comprising commercial and residential buildings; bridges, power plants, industrial plants, and water and sewer facilities, as well as chapels, hotels, irrigation dams, power transmission lines, and theaters. The company is also involved in the production and trading of concrete products; and handling steel fabrication, and electrical and foundation works. In addition, it engages in the development of mid-income residential properties under the DMCI Homes brand; generation of power through coal-fired and satellite power plants; exploration, mining, development, and sale of coal resources on Semirara Island in Caluya, Antique; mining, extracting, and selling of nickel, chromite, and iron laterite from Berong, Moorsom, and Ulugan mines in Palawan, as well as from Acoje mines in Zambales; and provision of water distribution and sewer services for the western side of Metro Manila and parts of Cavite. The company was incorporated in 1995 and is headquartered in Makati City, the Philippines.",
    "website": "http://www.dmciholdings.com",
    "zipcode": "1231"
  },
  "OPTBF": {
    "city": "Pasig",
    "country": "Philippines",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Oil & Gas E&P",
    "long_name": "Oriental Petroleum and Minerals Corporation",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Energy",
    "short_name": "ORIENTAL PETROLEUM & MINERALS C",
    "state": null,
    "summary": "Oriental Petroleum and Minerals Corporation, an exploration company, engages in oil exploration and development business in the Philippines. It holds interest in the petroleum exploration areas located in the offshore northwest Palawan. The company was incorporated in 1969 and is based in Pasig, the Philippines.",
    "website": "http://opmc.com.ph",
    "zipcode": "1600"
  }
}
