{
    "ACS.JO": {
        "short_name": "Acsion Limited",
        "long_name": "Acsion Limited",
        "summary": "Acsion Limited engages in property holding and development activities in South Africa. Its investment portfolio includes nine retail properties, including two regional shopping centers. The company develops regional shopping centers, community centers, convenience centers, neighborhood centers, and residential development projects, as well as industrial/commercial properties. Acsion Limited was incorporated in 2014 and is based in Centurion, South Africa.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Centurion",
        "zipcode": "0157",
        "website": "http://www.acsionsa.co.za",
        "market_cap": null
    },
    "AHA.JO": {
        "short_name": "Arrowhead Prop Ltd A",
        "long_name": "Arrowhead Properties Limited",
        "summary": "Arrowhead is a diversified South African Real Estate Investment Trust (Â\u0093REITÂ\u0094) focused on creating long-term shareholder value. Arrowhead holds a diverse portfolio of retail, office and industrial properties valued at R9.7 billion. As at 30 September 2020, Arrowhead also held a 60.0% interest (2019: 59.6 %) in its subsidiary, Indluplace Properties Limited (Â\u0093IndluplaceÂ\u0094), which owns a portfolio of residential properties. The average value per direct property held as at 30 September 2020 was R68.0 million (R57.2 million as at 30 September 2019). Arrowhead has a 15.0% (2019: 17.9%) interest in Rebosis Property Fund Limited (Â\u0093RebosisÂ\u0094) and an 8.6% (2019: 8.6%) interest in Dipula Income Fund Limited (Â\u0093DipulaÂ\u0094) at 30 September 2020.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2196",
        "website": "http://www.arrowheadproperties.co.za",
        "market_cap": null
    },
    "AHB.JO": {
        "short_name": "Arrowhead Prop Ltd B",
        "long_name": "Arrowhead Properties Limited",
        "summary": "Arrowhead is a diversified South African Real Estate Investment Trust (Â\u0093REITÂ\u0094) focused on creating long-term shareholder value. Arrowhead holds a diverse portfolio of retail, office and industrial properties valued at R9.7 billion. As at 30 September 2020, Arrowhead also held a 60.0% interest (2019: 59.6 %) in its subsidiary, Indluplace Properties Limited (Â\u0093IndluplaceÂ\u0094), which owns a portfolio of residential properties. The average value per direct property held as at 30 September 2020 was R68.0 million (R57.2 million as at 30 September 2019). Arrowhead has a 15.0% (2019: 17.9%) interest in Rebosis Property Fund Limited (Â\u0093RebosisÂ\u0094) and an 8.6% (2019: 8.6%) interest in Dipula Income Fund Limited (Â\u0093DipulaÂ\u0094) at 30 September 2020.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2196",
        "website": "http://www.arrowheadproperties.co.za",
        "market_cap": null
    },
    "APF.JO": {
        "short_name": "Accelerate Prop Fund Ltd",
        "long_name": "Accelerate Property Fund Limited",
        "summary": "Accelerate Property Fund is a listed Real Estate Investment Trust (REIT) offering investors the opportunity to share in a portfolio of well-established high-quality properties across South Africa.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2055",
        "website": "http://acceleratepf.co.za",
        "market_cap": null
    },
    "ATT.JO": {
        "short_name": "Attacq Limited",
        "long_name": "Attacq Limited",
        "summary": "Attacq is a South African-based Real Estate Investment Trust (REIT), with a vision of delivering total returns comprising sustainable income return and long-term capital growth through a focused approach in real estate investments and developments. Attacq's diversified South African portfolio provides sustainable community spaces in its respective nodes, aimed at being the destination of choice and setting Attacq apart from its peers. The group's business model is based on four drivers, namely the South African portfolio, Developments at Waterfall, Investment in MAS Real Estate Inc. (MAS) and the Rest of Africa retail investments. Attacq's strategic intent is to exit the Rest of Africa retail investments in an orderly manner. Attacq is listed on the Johannesburg Stock Exchange (JSE) and is included in the FTSE/JSE SAPY Index and FTSE/JSE SA REIT Index. FTSE Russell has rated Attacq's environmental, social and governance (ESG) exposure to, and management of ESG issues as 4.2 (2019: 4.1) out of 5.0, showing year-on-year improvement and ranking Attacq as one of the best rated SA REITs.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Waterfall City",
        "zipcode": "2090",
        "website": "http://www.attacq.co.za",
        "market_cap": null
    },
    "BWN.JO": {
        "short_name": "Balwin Properties Ltd",
        "long_name": "Balwin Properties Limited",
        "summary": "Balwin Properties Limited develops and sells residential properties in the low-to-middle market segments in South Africa. The company offers sectional title apartments. It also operates as a network infrastructure provider of electronic communication services; and rents electronic communication products. The company was formerly known as Balwin Properties Proprietary Limited. Balwin Properties Limited was founded in 1996 and is based in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": null,
        "website": "http://www.balwin.co.za",
        "market_cap": null
    },
    "DIA.JO": {
        "short_name": "Dipula Income Fund A",
        "long_name": "Dipula Income Fund Limited",
        "summary": "Dipula is an internally managed, South African focused Real Estate Investment Trust (Â\u0093REITÂ\u0094) with a sectorally and geographically diversified portfolio of primarily retail, office and industrial assets in all nine provinces of South Africa. The majority of assets are located in Gauteng. The fund further selectively invests in the residential rental sector. Dipula is listed on the Johannesburg Stock Exchange (Â\u0093JSEÂ\u0094) and has A and B shares in issue, trading under the codes DIA and DIB. DIAs are entitled to a preferred dividend growth of the lower of 5% or the consumer price inflation (Â\u0093CPIÂ\u0094), while DIBs receive the remaining distributable income. DIAs and DIBs rank equally in all other respects.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Rosebank",
        "zipcode": "2196",
        "website": "http://www.dipula.co.za",
        "market_cap": null
    },
    "DIB.JO": {
        "short_name": "Dipula Income Fund B",
        "long_name": "Dipula Income Fund Limited",
        "summary": "Dipula is an internally managed, South African focused Real Estate Investment Trust (Â\u0093REITÂ\u0094) with a sectorally and geographically diversified portfolio of primarily retail, office and industrial assets in all nine provinces of South Africa. The majority of assets are located in Gauteng. The fund further selectively invests in the residential rental sector. Dipula is listed on the Johannesburg Stock Exchange (Â\u0093JSEÂ\u0094) and has A and B shares in issue, trading under the codes DIA and DIB. DIAs are entitled to a preferred dividend growth of the lower of 5% or the consumer price inflation (Â\u0093CPIÂ\u0094), while DIBs receive the remaining distributable income. DIAs and DIBs rank equally in all other respects.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Rosebank",
        "zipcode": "2196",
        "website": "http://www.dipula.co.za",
        "market_cap": null
    },
    "EMI.JO": {
        "short_name": "Emira Property Fund Ltd",
        "long_name": "Emira Property Fund Limited",
        "summary": "Emira is a diversified real estate investment trust (Â\u0093REITÂ\u0094) company, with a property portfolio of predominantly South African assets, and a growing component of offshore assets. The Company listed on the JSE in November 2003, in the real estate investment trusts sector. In line with its strategic objectives, Emira's property portfolio spans multiple sectors, namely office, retail and industrial, with a new element of residential. The Company is focused on growing the quality and value of its property portfolio, in order to sustain and enhance its distribution growth to shareholders. This is achieved via selective acquisitions and disposals, as well as refurbishments, upgrades and the redevelopment of specific properties. To this end, all investment decisions are reinforced by Emira's stringent investment criteria to enhance yields and improve the performance of the portfolio.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Bryanston",
        "zipcode": "2191",
        "website": "http://www.emira.co.za",
        "market_cap": null
    },
    "EQU.JO": {
        "short_name": "Equites Prop Fund Ltd",
        "long_name": "Equites Property Fund Limited",
        "summary": "Equites is a listed Real Estate Investment Trust (Â\u0093REITÂ\u0094) with a focus on owning and developing modern, well-located logistics properties let to A-grade tenants on long-dated leases. Equites has established itself as a leading owner and developer of high-quality logistics assets in SA and the UK and is the only specialist logistics REIT listed on the JSE. This gives shareholders pure exposure to an asset class that is expected to outperform over time.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "8001",
        "website": "http://www.equites.co.za",
        "market_cap": null
    },
    "FFA.JO": {
        "short_name": "Fortress REIT Ltd A",
        "long_name": "Fortress REIT Limited",
        "summary": "Fortress was listed on 22 October 2009 on the main board of the Johannesburg Stock Exchange Limited as a property loan stock company. It listed with an initial market capitalisation of R1.8 billion, making it the largest initial listing in the listed property sector. Fortress converted to a Real Estate Investment Trust REIT on 1 July 2013. Fortress is a hybrid fund, investing in both direct property as well as other listed property stocks and REITs. It focusses on the development of prime real estate logistics assets as well as investments into its retail portfolio. Currently Fortress portfolio includes industrial, logistics, office, retail and other properties.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Morningside",
        "zipcode": "2196",
        "website": "http://www.fortressfund.co.za",
        "market_cap": null
    },
    "FVT.JO": {
        "short_name": "Fairvest Property Hldgs",
        "long_name": "Fairvest Property Holdings Limited",
        "summary": "Fairvest Property Holdings Limited is a property investment holding company and Real Estate Investment Trust (\"REIT\"), with a unique focus on retail assets weighted toward non-metropolitan and rural shopping centres, as well as convenience and community shopping centres servicing the lower-LSM market, in high-growth nodes close to commuter networks.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "8001",
        "website": "http://fairvest.co.za",
        "market_cap": null
    },
    "GRT.JO": {
        "short_name": "Growthpoint Prop Ltd",
        "long_name": "Growthpoint Properties Limited",
        "summary": "Growthpoint is the largest South African primary JSE-listed REIT with a quality portfolio of 440 directly owned properties in South Africa (RSA) valued at R73.4bn, including four hospitals and one medical chambers valued at R2.6bn owned by Growthpoint Healthcare Property Holdings (RF) Limited (GHPH). Growthpoint has a 61.8% shareholding in GHPH. We have a 62.2% interest in ASX-listed Growthpoint Properties Australia Limited (GOZ), which owns 58 properties in Australia valued at R51.8bn and a 52.1% interest in LSE-listed Capital & Regional Plc (C&R), which owns seven properties in the United Kingdom valued at R14.8bn.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2196",
        "website": "http://www.growthpoint.co.za",
        "market_cap": null
    },
    "HYP.JO": {
        "short_name": "Hyprop Inv Ltd",
        "long_name": "Hyprop Investments Limited",
        "summary": "Hyprop is a retail-focused REIT listed on the JSE with interests in a R48.5 billion portfolio of shopping centres in South Africa, Eastern Europe and sub-Saharan Africa. The Company's focus is on creating environments and opportunities for people to connect and have authentic and meaningful experiences. It does so by owning and managing dominant retail centres in mixed-used precincts, in key economic nodes in South Africa and Eastern Europe.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Rosebank",
        "zipcode": "2196",
        "website": "http://www.hyprop.co.za",
        "market_cap": null
    },
    "ILU.JO": {
        "short_name": "Indluplace Properties Ltd",
        "long_name": "Indluplace Properties Limited",
        "summary": "IIndluplace is a proud South African property investor owning a portfolio primarily focused on the affordable end of the residential rental market. The company was listed on the Main Board of the JSE in June 2015 and currently owns a portfolio of 9,668 residential units and 18, 870m2 of associated retail space. The portfolio is valued at R 3,8 billion. By utilising specialist outsourced property managers for the different portfolios, Indluplace ensures that its portfolio remains professionally managed to provide positive investment returns, while providing value for money accommodation and service to all its tenants. Indluplace is mindful of the increasing role and impact of Environmental, Social, and Governance (ESG) on sustainability as well as the societal impact of an investment in the company.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Residential",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2196",
        "website": "http://www.indluplace.co.za",
        "market_cap": null
    },
    "IPF.JO": {
        "short_name": "Investec Property Fund Ltd",
        "long_name": "Investec Property Fund Limited",
        "summary": "Investec Property Fund Limited (IPF) is a South African Real Estate Investment Trust (REIT) which listed on the Johannesburg Stock Exchange (JSE) in 2011. The Fund's investment portfolio comprises R27 billion of direct and indirect real estate investments in South Africa, the UK and Europe. In South Africa, the Fund directly owns a sizeable portfolio of 92 properties in the retail, industrial and office sectors valued at R15.7 billion and a 35% interest in Izandla valued at R0.3 billion. c.50% of the Fund's balance sheet and 45% of earnings are derived from offshore investments. This comprises strategic property investments, mainly in logistics, in the developed markets of Europe and the UK where the Manager has a presence on-the-ground with in-country expertise. These investments include an interest in Argo UK Fund (Â\u0093UK FundÂ\u0094) of R1.0bn, an investment into a Pan-European logistics portfolio of R6.8bn and an investment into a Pan-European light industrial portfolio of R0.3bn. The Fund's best of breed portfolio has been built based on adhering to its investment philosophy of acquiring quality assets with compelling property fundamentals in targeted sectors in selected geographies where it has in-country expertise. More recently, the Fund has strategically shifted its focus towards the logistics sector, as a result of which, logistics assets now comprise 46% of IPF's investments globally. IPF is a company incorporated in South Africa with registration number 2008/011366/06, listed in the Real Estate Holdings and Development sector and obtained REIT status on 1 April 2013.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Sandton",
        "zipcode": "2196",
        "website": "http://www.investecproperty.com/en_za/investec-property-fund.html",
        "market_cap": null
    },
    "L2D.JO": {
        "short_name": "Liberty Two Degrees LTD",
        "long_name": "Liberty Two Degrees Limited",
        "summary": "Liberty Two Degrees was converted and relisted as a corporate REIT on the JSE main board on 1 November 2018 as Liberty Two Degrees Limited (L2D Limited) following the conversion from a CISIP. The new structure cancels the Liberty Group PUT option for no consideration and internalises the management company. The structure also introduces a conservative level of debt to the capital structure of L2D Limited, which will assist in reducing the weighted average cost of capital over time.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2196",
        "website": "http://www.liberty2degrees.co.za",
        "market_cap": null
    },
    "OAS.JO": {
        "short_name": "Oasis Crescent Prop Fund",
        "long_name": "Oasis Crescent Property Fund",
        "summary": "The objective of the fund is to provide investors with a source of sustainable income through a listed and regulated Shari'ah compliant property fund. The portfolio of the fund is focused on quality, value and capital protection, thereby reducing the volatility of returns to create an investment product that is consistent with the tried and tested investment philosophy of the Oasis Group. The majority of rental income is generated from high quality national, multi-national or government tenants and rental income is secured through long term leases. This tenant quality and certainty of cash flows are key drivers of capital protection and delivering sustainable income to meet the requirements of investors. The Crescent Property Equity Fund is a collective scheme in property and was created in terms of the Collective Investment Schemes Control Act. The Fund is managed in accordance with the investment guidelines of the Oasis Group Shari'ah Advisory Board, by Oasis Crescent Property Fund Managers Limited.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7925",
        "website": "http://www.oasiscrescent.com/default/content.aspx?initial=true&moveto=609",
        "market_cap": null
    },
    "OCT.JO": {
        "short_name": "Octodec Invest Ltd",
        "long_name": "Octodec Investments Limited",
        "summary": "Octodec, a real estate investment trust (REIT) listed on the Johannesburg Stock Exhange and one of the largest owners of property in the Tshwane and Johannesburg CBDs,is committed to delivering long-term stakeholder value through an innovative and visionary perspective on property investment.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Tshwane",
        "zipcode": "0002",
        "website": "http://www.octodec.co.za",
        "market_cap": null
    },
    "PPR.JO": {
        "short_name": "Putprop Ltd",
        "long_name": "Putprop Limited",
        "summary": "Putprop Limited operates as a property investment company in South Africa. The company operates through Industrial, Retail, and Commercial segments. It invests in industrial, commercial, and retail properties. As of June 30, 2020, the company had a portfolio of 14 properties with a gross lettable area of 68,553 square meters located primarily in the Johannesburg and Pretoria metropolitan areas of Gauteng. The company was formerly known as Putco Properties Limited and changed its name to Putprop Limited in 2006. Putprop Limited is based in Johannesburg, South Africa. Putprop Limited is a subsidiary of Carleo Enterprises Proprietary Limited.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2196",
        "website": "http://www.putprop.co.za",
        "market_cap": null
    },
    "RDF.JO": {
        "short_name": "Redefine Properties Ltd",
        "long_name": "Redefine Properties Limited",
        "summary": "Redefine is a leading South African-based, internally managed Real Estate Investment Trust (REIT), with the primary goal of growing and improving cash flow to deliver quality earnings that will underpin growth in distributions and sustained value creation for all stakeholders. We are listed on the Johannesburg Stock Exchange (JSE). We actively manage a diversified property asset platform with a value of R81.0 billion, comprising local and international property assets. Our shares are among the most actively traded on the JSE, making them a highly liquid, single-entry point for gaining the exposure to quality domestic properties, and a spread of international commercial real estate markets. We differentiate ourselves by placing people at the heart of what we do.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2196",
        "website": "http://www.redefine.co.za",
        "market_cap": null
    },
    "REA.JO": {
        "short_name": "Rebosis Property Fund Ltd A",
        "long_name": "Rebosis Property Fund Limited",
        "summary": "Rebosis is a JSE listed real estate investment trust (REIT) with a high quality diversified portfolio across commercial and retail assets. The majority of the commercial income enjoys a sovereign underpin from leases to national government departments across 36 buildings. Its retail portfolio has a mix of shopping centres including Port Elizabeth (Baywest Mall) and Centurion (Forest Hill City).",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Bryanston",
        "zipcode": "2191",
        "website": "http://www.rebosis.co.za",
        "market_cap": null
    },
    "REB.JO": {
        "short_name": "Rebosis Property Fund Ltd",
        "long_name": "Rebosis Property Fund Limited",
        "summary": "Rebosis is a JSE listed real estate investment trust (REIT) with a high quality diversified portfolio across commercial and retail assets. The majority of the commercial income enjoys a sovereign underpin from leases to national government departments across 36 buildings. Its retail portfolio has a mix of shopping centres including Port Elizabeth (Baywest Mall) and Centurion (Forest Hill City).",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Bryanston",
        "zipcode": "2191",
        "website": "http://www.rebosis.co.za",
        "market_cap": null
    },
    "RES.JO": {
        "short_name": "Resilient REIT Limited",
        "long_name": "Resilient REIT Limited",
        "summary": "Resilient is a Real Estate Investment Trust (REIT) which has been listed on the Johannesburg stock exchange since December 2002. It owns a portfolio of dominant regional malls and shopping centres tenanted predominantly by national retailers. Resilient continues to develop retail centres which are both quality and yield enhancing. Strict criteria are applied in evaluating target investments including the presence of at least three national anchor tenants and major national retail groups occupying in excess of 70% of the lettable area. In addition, Resilient owns a portfolio of listed and offshore property-related assets. Resilient is internally asset managed with property management being outsourced to independent property management companies.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Rivonia",
        "zipcode": "2191",
        "website": "http://www.resilient.co.za",
        "market_cap": null
    },
    "SAC.JO": {
        "short_name": "SA Corp Real Estate Ltd",
        "long_name": "SA Corporate Real Estate Limited",
        "summary": "SA Corporate Real Estate Limited is a JSE-listed Real Estate Investment Trust (Â\u0093REITÂ\u0094) which owns a diversified portfolio of quality industrial, retail, commercial and residential buildings located primarily in the major metropolitan areas of South Africa with a secondary node in Zambia. The property, excluding investment in listed shares and loans advanced, consists of 192 properties, with 1 629 105 m2 of lettable area, valued at R16.6 billion, and a 50% joint venture in three Zambian properties valued at R1.1 billion.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Century City",
        "zipcode": "7441",
        "website": "http://www.sacorporatefund.co.za",
        "market_cap": null
    },
    "SAR.JO": {
        "short_name": "Safari Investments RSA Ltd",
        "long_name": "Safari Investments RSA Limited",
        "summary": "SAFARI is a property investment company listed on the JSE as a Real Estate Investment Trust that specialises in quality commercial investments. Through selective investments in property we create value for all our stakeholders as we strive for sustainable growth and earnings.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Pretoria",
        "zipcode": "0081",
        "website": "http://www.safari-investments.com",
        "market_cap": null
    },
    "SSS.JO": {
        "short_name": "Stor-Age Prop REIT Ltd",
        "long_name": "Stor-Age Property REIT Limited",
        "summary": "Stor-Age Property REIT Ltd is a real estate investment trust. The firm invests in the real estate markets of South Africa. It is focused on the ownership, acquisition, development and management of prime self storage assets. Stor-Age Property REIT Ltd was founded in 2006 and is based in South Africa.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7708",
        "website": "http://www.stor-age.co.za/cape-town",
        "market_cap": null
    },
    "TEX.JO": {
        "short_name": "Texton Property Fund Ltd",
        "long_name": "Texton Property Fund Limited",
        "summary": "Texton Property Fund Limited is a Real Estate Investment Trust (Â\u0093REITÂ\u0094) listed on the JSE Limited. The company internally manages its R4,5 billion portfolio of retail, office and industrial property assets located in South Africa (Â\u0093SAÂ\u0094) and the United Kingdom (Â\u0093UKÂ\u0094). The Fund was formed in 2006 and listed on the JSE in August 2011. The overall objective of the Fund is to grow its asset base, by investing in well priced, income and quality enhancing investment properties, to optimise returns over time for shareholders Â\u0096 in short, to become Â\u0091the investment of choice'. The strategic focus is diversification in order to maximise the growth in value for stakeholders. Diversification serves to limit risk and enhance the consistency of returns, ensuring that investors are best able to meet their investment performance objectives.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2196",
        "website": "http://www.texton.co.za",
        "market_cap": null
    },
    "TMT.JO": {
        "short_name": "Trematon Capital Inv Ltd",
        "long_name": "Trematon Capital Investments Limited",
        "summary": "Trematon Capital Investments Limited is a private equity firm. The firm seeks to invest in property, gaming, leisure, and construction. It seeks to invest in South Africa with a focus on Western Cape and Gauteng. The firm also engages in investment and trading in listed and unlisted shares which are not specific to any industry and potential investments are not necessarily limited by industry or geography. Trematon Capital Investments Limited is based in Cape Town, South Africa.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "8001",
        "website": "http://www.trematon.co.za",
        "market_cap": null
    },
    "TPF.JO": {
        "short_name": "Transcend Res Prop Fd Ld",
        "long_name": "Transcend Residential Property Fund Limited",
        "summary": "Transcend Residential Property Fund Limited focuses on acquiring and managing residential properties in South Africa. It holds 13 properties comprising 2 472 units located primarily in Gauteng, as well as the Western Cape and Mpumalanga. The company qualifies as a real estate investment trust for federal income tax purposes. It generally would not be subject to federal corporate income taxes if it distributes at least 90% of its taxable income to its stockholders. Transcend Residential Property Fund Limited was incorporated in 2016 and is based in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Residential",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2191",
        "website": "http://transcendproperty.co.za",
        "market_cap": null
    },
    "TWR.JO": {
        "short_name": "Tower Property Fund Ltd",
        "long_name": "Tower Property Fund Limited",
        "summary": "Tower is an internally managed real estate investment trust (REIT) which owns a diversified portfolio of 42 convenience retail, office and industrial properties valued at R4.8 billion, located in South Africa and Croatia. The South African portfolio is located in the country's major metropoles with 47% by value in Cape Town, 41% in Gauteng and 12% in KwaZulu Natal. The five Croatian properties represent 37% of the fund's total value. The fund currently has a sectoral spread by value of 46% convenience retail, 46% office, 7% industrial and inventory 1%. Tower's near-term focus remains (i) to do all things necessary to ensure that the company and its tenants weather the current worldwide crisis caused by the Covid-19 pandemic, (ii) the redevelopment of the Old Cape Quarter, including the development of the fifty-five new residential units, (iii) the sale of non-core properties in South Africa; and (iv) the unlocking of additional value and income growth in the Croatian portfolio through its shareholding in TPF International.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Claremont",
        "zipcode": "7708",
        "website": "http://www.towerpropertyfund.co.za",
        "market_cap": null
    },
    "VKE.JO": {
        "short_name": "Vukile Property Fund Ltd",
        "long_name": "Vukile Property Fund Limited",
        "summary": "Vukile Property Fund Limited is a property company, which was listed on the JSE Limited on 24 June 2004 ( JSE code : VKE ) and on the Namibian Stock Exchange on 11 July 2007 ( NSX code : VKN ). Vukile's market capitalisation was approximately R11.0 billion at 31 March 2015 and its property portfolio was valued at R13.3 billion at year-end. There were 572 747 744 shares in issue at year-end. on 1 April 2013, Vukile became the first property company to be awarded Real Estate Investment Trust (REIT) status by the JSE Limited.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2198",
        "website": "http://www.vukile.co.za",
        "market_cap": null
    }
}