{
    "ILU.JO": {
        "short_name": "Indluplace Properties Ltd",
        "long_name": "Indluplace Properties Limited",
        "summary": "IIndluplace is a proud South African property investor owning a portfolio primarily focused on the affordable end of the residential rental market. The company was listed on the Main Board of the JSE in June 2015 and currently owns a portfolio of 9,668 residential units and 18, 870m2 of associated retail space. The portfolio is valued at R 3,8 billion. By utilising specialist outsourced property managers for the different portfolios, Indluplace ensures that its portfolio remains professionally managed to provide positive investment returns, while providing value for money accommodation and service to all its tenants. Indluplace is mindful of the increasing role and impact of Environmental, Social, and Governance (ESG) on sustainability as well as the societal impact of an investment in the company.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Residential",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2196",
        "website": "http://www.indluplace.co.za",
        "market_cap": null
    },
    "TPF.JO": {
        "short_name": "Transcend Res Prop Fd Ld",
        "long_name": "Transcend Residential Property Fund Limited",
        "summary": "Transcend Residential Property Fund Limited focuses on acquiring and managing residential properties in South Africa. It holds 13 properties comprising 2 472 units located primarily in Gauteng, as well as the Western Cape and Mpumalanga. The company qualifies as a real estate investment trust for federal income tax purposes. It generally would not be subject to federal corporate income taxes if it distributes at least 90% of its taxable income to its stockholders. Transcend Residential Property Fund Limited was incorporated in 2016 and is based in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Residential",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2191",
        "website": "http://transcendproperty.co.za",
        "market_cap": null
    }
}