{"ABQK.QA": {"short_name": "Ahli BanK QPSC", "long_name": "Ahli Bank Q.P.S.C.", "summary": "Ahli Bank Q.P.S.C., together with its subsidiaries, provides corporate and retail banking services in Qatar. The company operates through two segments, Retail and Private Banking and Wealth Management; and Corporate Banking Treasury, Investments and Brokerage Subsidiary. It also provides brokerage services. The company offers account products, such as savings, current, and call accounts; loan products that include salary advance, overdrafts, auto loans, personal loans, and mortgage loans; term deposits; and card products, such as credit, debit, cash back, contactless, and payroll cards. It also provides insurance services and various savings and investment products and services. In addition, the company offers financing solutions that include medium and long term loans, syndicated loans, contractor, working capital, equipment and fleet, real estate and project, and structured finances; wage protection systems; and corporate solutions, such as hedging solutions, forwards, swaps, options, interest rate hedging's, interest rate swaps, interest caps and floors, ISDA agreements, investment solutions, fixed income products, and structured deposits and notes. Further, it provides import services that include documentary credits and collections, and shipping guarantees; export services, such as LC advising and confirmation, and documentary collections; and guarantee services that include big bonds, performance bonds, advance payment and payment guarantees, counter guarantees for other banks, and avalisation of promissory notes/checks. Additionally, the company offers financing products, such as pre and post shipment finance, open account finance, and invoice discounting. It serves customers through 14 branches and ATMs comprising 20 in branches and 55 off-site ATMs, as well as contact centers, mobile and online banking. The company was founded in 1983 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "AHCS.QA": {"short_name": "Aamal QPSC", "long_name": "Aamal Company Q.P.S.C.", "summary": "Aamal Company Q.P.S.C., together with its subsidiaries, engages in the property, trading and distribution, industrial manufacturing, and managed services businesses in Qatar and internationally. The company's Property segment is involved in leasing the facilities of retail outlet complex, real estate investments, and property rental businesses. Its Trading and Distribution segment engages in wholesale and/or retail distribution of pharmaceutical and consumable items, automotive goods, home appliances, medical equipment, tires, lubricants, batteries, car spare parts, and office supplies products. This segment also provides industrial printing and laminating solutions; supplies, installs, commissions, and maintains air conditioning and refrigeration equipment; offers hospital information systems; and operates a chain of pharmacies, as well as sells footwear and general commercial trading products, and engages in clinical activities. The company's Industrial Manufacturing segment is involved in the manufacture, wholesale, and/or retail distribution of electric cables and tools, aggregates, ready-mix concrete, cement blocks and bricks, interlocking slabs, curb stone, and concrete pipes; provision of services in relation to industrial investment, repair, and construction of power plants; purchasing and leasing of ships; trading electromechanical equipment and cables; and management of industrial enterprises. Its Managed Services segment offers housekeeping and cleaning, facilities and support, energy, and entertainment and amusement services; and IT support, business process outsourcing, travel agency, and call center services. The company also trades in light emitting diode lamps and other lighting products; and provides facilities management, energy, and building maintenance and cleaning services. Aamal Company Q.P.S.C. was founded in 2001 and is headquartered in Doha, Qatar. Aamal Company Q.P.S.C. is a subsidiary of Al Faisal Holding Company W.L.L.", "currency": "QAR", "sector": "Industrials", "industry": "Conglomerates", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "AKHI.QA": {"short_name": "Al Khaleej Takaful Insurance QP", "long_name": "Al Khaleej Takaful Insurance Company Q.P.S.C.", "summary": "Al Khaleej Takaful Insurance Company Q.P.S.C. engages in insurance, reinsurance, and Takaful insurance businesses in Qatar. The company offers comprehensive and third party motor insurance products; and property insurance products, such as fire and special perils, property all risks, business interruption, terrorism, and jewelers block insurance. It also provides engineering insurance products, including contractor's all risk, erection all risk, equipment, machinery breakdown, deterioration of stock in cold storage, and electronic equipment insurance; and workmen's compensation, personal accident, fidelity guarantee, and money insurance. In addition, the company offers public liability/third party liability, product liability, event liability, directors & officers liability and company reimbursement, professional indemnity, medical malpractice, bankers blanket bond, and cyber liability insurance products. Further, it provides freight forwarders liability, marine hull, and aviation insurance; and medical, group life, and travel insurance products. Additionally, it is involved in real estate and financial investments activities. Al Khaleej Takaful Insurance Company Q.P.S.C. was founded in 1978 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Financial Services", "industry": "Insurance—Diversified", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "BLDN.QA": {"short_name": "Baladna QPSC", "long_name": "Baladna Q.P.S.C.", "summary": "Baladna Q.P.S.C. produces and sells dairy products in the State of Qatar. The company operates through Dairy, Farm, and Other Activities segments. The Dairy segment offers fresh milk, yoghurt, cheese, labneh, cream, dessert, ghee, long life milk, and other dairy products, as well as Laban and Ayran milk drinks. The Farm segment is involved in slaughtering cows and selling beef meat. The Other Activities segment produces and sells sweet and frozen products, as well as sells livestock feed and medicines. It also offers fruit juices and related products; fertilizer compost; and plastic packaging materials to external parties. In addition, the company engages in the trade of food materials; retail of dairy products, eggs, olives, and pickles in specialized stores; and wholesale of soft drinks, juices, and mineral water. It serves retail outlet, as well as hotel, restaurant, and catering customers. The company was incorporated in 2014 and is headquartered in Al Khor, Qatar.", "currency": "QAR", "sector": "Consumer Defensive", "industry": "Packaged Foods", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Al Khor"}, "BRES.QA": {"short_name": "Barwa Real Estate QPSC", "long_name": "Barwa Real Estate Company Q.P.S.C.", "summary": "Barwa Real Estate Company is a real estate investment firm specializing in real estate projects which include residential facilities, a motor city, warehouses, and complementary commercial and retail spaces. The firm engages in investment, development, and management of properties with a focus on Qatar and Saudi Arabia. It also invests in stocks of real estate firms. The firm invests in the real estate markets across the globe. Its portfolio includes residential and commercial property and hotels. Barwa Real Estate Company was founded on January 19, 2006 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "CBQK.QA": {"short_name": "The Commercial Bank PSQC", "long_name": "The Commercial Bank (P.S.Q.C.)", "summary": "The Commercial Bank (P.S.Q.C.), together with its subsidiaries, engages in the conventional banking, brokerage services, and credit card businesses. The company operates through four segments Wholesale Banking, Retail Banking, Alternatifbank A.S. (ABank), and Other Principal Subsidiaries. The Wholesale Banking segment provides demand and time deposit services; various conventional funded and non-funded credit facilities; currency exchange facilities; interest rate swaps and other derivative trading services; loan syndication and structured financing services; corporate lending; trade finance; other deposits; and letters of credit and guarantees, as well as manages money market funds and proprietary investment portfolio. This segment serves corporate, commercial, and multinational customers, as well as large, medium, and small enterprises. The Retail Banking segment offers personal current, savings, time, and investment account services; credit card and debit card services; consumer, personal, and vehicle loans, and residential mortgage services; and custodial and wealth management services to retail and individual customers. The ABank segment provides corporate, commercial, and retail banking products and services through a network of 48 branches in Turkey. The Other Principal Subsidiaries segment offers brokerage services; and issues debts for banks. The company also provides insurance products. It operates in Qatar, other GCC countries, rest of the Middle East, Europe, North America, and internationally. The company operates a network of 29 full service branches and 173 ATMs. The Commercial Bank (P.S.Q.C.) was incorporated in 1974 and is headquartered in Doha, Qatar.", "currency": "QAR", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "DBIS.QA": {"short_name": "Dlala Brokerage and Investment ", "long_name": "Dlala Brokerage and Investment Holding Company Q.P.S.C.", "summary": "Dlala Brokerage and Investment Holding Company Q.P.S.C., together with its subsidiaries, engages in the brokerage activities at the Qatar Exchange. The company operates through Stock Broking, Real Estate, and Information Technology segments. It offers brokerage services in equity markets for companies listed on various financial markets, as well as for Shari'a-compliant listed companies. The company also provides property management services, including monthly rent collection, maintenance, and general services; residential, commercial, and industrial property rental services; marketing and sales services for properties through sales points, exhibitions, and database; and acts as a broker to find buyers for properties, as well as finalizes registrations and settlements. In addition, it engages in the provision of information technology management and consultation services; and developing and programming of programs, as well as investment activities. Dlala Brokerage and Investment Holding Company Q.P.S.C. was founded in 2005 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "DHBK.QA": {"short_name": "Doha Bank QPSC", "long_name": "Doha Bank Q.P.S.C.", "summary": "Doha Bank Q.P.S.C. provides various banking products and services to individual, commercial, corporate, and institutional clients. The company operates in two segments, Conventional Banking and Insurance Activities. The Conventional Banking segment offers a range of products and services to business and corporate customers, including funded and non-funded credit facilitates deposits to corporate customers. It also undertakes funding and centralized risk management activities through borrowings; issues debt securities; uses derivatives for risk management purposes; and invests in liquid assets, such as short-term placements, and corporate and government debt securities. In addition, this segment provides loans, credit cards, deposits, and other transactions to individuals. The Insurance Activities segment offers contracts of insurance, arranges deals in investments, and advises on investments. The company operates 24 branches in Qatar; and six overseas branches in the United Arab Emirates, State of Kuwait, and the Republic of India, as well as representative offices in the United Kingdom, Singapore, Turkey, China, Japan, South Korea, Germany, Australia, Hong Kong, Canada, Bangladesh, South Africa, Sri Lanka, and Nepal. Doha Bank Q.P.S.C. was founded in 1979 and is headquartered in Doha, Qatar.", "currency": "QAR", "sector": "Financial Services", "industry": "Banks—Diversified", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "DOHI.QA": {"short_name": "Doha Insurance Group QPSC", "long_name": "Doha Insurance Group Q.P.S.C.", "summary": "Doha Insurance Group Q.P.S.C., together with its subsidiaries, engages in insurance and reinsurance businesses. It operates through three segments: Marine and Aviation, Motor, and Fire and General Accidents. The company's personal insurance products include car, travel, and yacht insurance products; and corporate insurance products comprise motor fleet, aviation, engineering, fire, health, and marine insurance products. It provides insurance and reinsurance services according to Islamic Sharia principles under the Doha Takaful name. In addition, the company engages in the insurance intermediation and management; information technology solutions; real estate and investment; and real estate holding and leasing operations. It operates in the state of Qatar, the United Arab Emirates, Lebanon, Germany, and Jordan. The company was formerly known as Doha Insurance Company Q.S.C. and changed its name to Doha Insurance Group Q.P.S.C. in March 2017. Doha Insurance Group Q.P.S.C. was incorporated in 1999 and is headquartered in Doha, Qatar.", "currency": "QAR", "sector": "Financial Services", "industry": "Insurance—Diversified", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "ERES.QA": {"short_name": "Ezdan Holding Group QPSC", "long_name": "Ezdan Holding Group Q.P.S.C.", "summary": "Ezdan Holding Group Q.P.S.C., together with its subsidiaries, manages and rents real estate properties in Qatar. It operates through four segments: Residential and Commercial Properties, Investments, Hotel and Suites, and Malls segments. The Residential and Commercial Properties segment develops, owns, and rents real estate properties. The Investments segment invests in shares and sukuk investments. The Hotel and Suites segment manages hotels, suites, and restaurants. The Mall segment manages shopping malls. The company was formerly known as Ezdan Real Estate Company Q.S.C. and changed its name to Ezdan Holding Group Q.P.S.C. Ezdan Holding Group Q.P.S.C. was founded in 1960 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "GISS.QA": {"short_name": "Gulf International Services QPS", "long_name": "Gulf International Services Q.P.S.C.", "summary": "Gulf International Services Q.P.S.C., through its subsidiaries, provides insurance and reinsurance, drilling, helicopter transportation, and catering services in Qatar and internationally. It operates through Drilling, Insurance, Aviation, and Catering segments. The company owns 8 offshore and onshore drilling rigs that are used for drilling wells for oil and natural gas extraction; 1 jack-up accommodation barge; and 2 lift boats. It also offers helicopter transportation services, including offshore/ onshore transporting, long and short-line load lifting, seismic support, VIP executive transport, ad-hoc shortterm contracts, simulator training, and component maintenance services. In addition, the company also provides a range of insurance and reinsurance services in the field of construction, operations, marine, and medical; and catering, cleaning, pest control, manpower supply, facilities management, camp management, janitorial and laundry, and corporate hospitality and VIP dining services. Gulf International Services Q.P.S.C. was founded in 2008 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Energy", "industry": "Oil & Gas Drilling", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "GWCS.QA": {"short_name": "Gulf Warehousing QPSC", "long_name": "Gulf Warehousing Company Q.P.S.C.", "summary": "Gulf Warehousing Company Q.P.S.C., together with its subsidiaries, provides logistics and freight forwarding services in Qatar and internationally. The company operates through four segments: Logistics Operation, Freight Forwarding, Rentals, and Others. It offers handling, packaging and repackaging, inventory management, international moving and relocation, express courier, retail distribution, and consulting services, as well as inland transportation of goods for storage; and freight forwarding services through land, sea or air. The company also provides transportation and information technology services; and records management services, including digitization of documents, storage of physical and digital documents, time-bound document retrieval, indexing and cataloging accessed by document management systems, and secure destruction of physical and digital documents, as well as develops, operates, and manages warehouses. In addition, it is involved in chemical, food, and other consumables trading businesses; and the provision of marine services, such as yard operations, liner representation, port agency services, cruise ship hosting, and husbandry service. It serves aviation, telecommunication, manufacturing, government, banking and financial, oil and gas, sports and event management, fine arts, records management, healthcare, and small and medium enterprises. Gulf Warehousing Company Q.P.S.C. was founded in 2003 and is headquartered in Doha, Qatar.", "currency": "QAR", "sector": "Industrials", "industry": "Integrated Freight & Logistics", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "IGRD.QA": {"short_name": "Investment Holding Group QPSC", "long_name": "Investment Holding Group - Q.P.S.C.", "summary": "Investment Holding Group - Q.P.S.C., together with its subsidiaries, engages in various trading and investment activities in Qatar. It operates through four segments: Contracting, Specialized Contracting, Trading, and Water Treatment & Related Maintenance. The company undertakes projects related to hotels, airports, conference centers, and educational facilities, as well as offers civil contracting services. It also engages in the trading of fire alarms, security systems, and related contracting activities; contracting for wellness and pools, water features, water treatments, and after sale maintenance and services; and installation and maintenance of electro mechanical works. In addition, the company is involved in the trading of electrical equipment, switch gears, light and instrument electrical tools, and electrical and construction materials; and wood, steel, food, chemical, and building materials, as well as engages in electromechanical equipment installation and maintenance works. Further, it offers mechanical, electrical, and plumbing contracting services. The company was founded in 1975 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "IHGS.QA": {"short_name": "Inma Holding QPSC", "long_name": "Islamic Holding Group (Q.P.S.C)", "summary": "Islamic Holding Group (Q.P.S.C) invests in shares and bonds in Qatar. It operates through Brokerage and Real Estate segments. The company provides financial brokerage services. It provides property management, marketing, and sales services for real estate. The company was formerly known as Islamic Financial Securities Company (Q.S.C) and changed its name to Islamic Holding Group (Q.P.S.C) in July 2010. Islamic Holding Group (Q.P.S.C) was founded in 2003 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "IQCD.QA": {"short_name": "Industries Qatar QPSC", "long_name": "Industries Qatar Q.P.S.C.", "summary": "Industries Qatar Q.P.S.C., through its subsidiaries, engages in the petrochemical, fertilizer, and steel businesses primarily in Qatar. Its Petrochemicals segment produces and sells ethylene, polyethylene, methyl-tertiary-butyl-ether, methanol, and other petrochemical products. The company's Fertilizers segment produces and sells urea, ammonia, and other by-products. Its Steel segment produces and sells steel pellets, bars, billets, and other products. Industries Qatar Q.P.S.C. also exports its products. The company was founded in 1969 and is headquartered in Doha, Qatar. Industries Qatar Q.P.S.C. is a subsidiary of Qatar Petroleum.", "currency": "QAR", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "KCBK.QA": {"short_name": "Al Khalij Commercial Bank PQSC", "long_name": "Al Khalij Commercial Bank (al khaliji) P.Q.S.C.", "summary": "Al Khalij Commercial Bank (al khaliji) P.Q.S.C., together with its subsidiaries, provides commercial banking products and services in Qatar, the United Arab Emirates, and France. It operates through Wholesale Banking and Personal Banking segments. The company offers personal banking products, such as current, savings, and fusion accounts; fixed deposit accounts; personal, mortgage, and auto loans; ATMs; credit life insurance; credit cards; and cross mortgage services. It also provides corporate banking products and services, such as corporate lending products comprising working capital finance, overdrafts, short term loans, and medium and long term loans; club and syndicated loans; structured finance products that include project finance and contract financing; and trade finance products, such as documentary credit, documentary collections, and guarantees. The company's corporate banking products and services also include cash management; and advisory services in the areas of risk management, liquidity management, and treasury and debt capital markets. In addition, the company offers treasury services, such as funding and liquidity, and treasury sales; and premium and private banking, and debt issuance services, as well as Internet, phone, and SMS banking services. It operates 40 ATMs and 9 branches. The company serves premium, business, corporate, and international customers. Al Khalij Commercial Bank (al khaliji) P.Q.S.C. was founded in 2007 and is headquartered in Lusail, Qatar.", "currency": "QAR", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Lusail"}, "MARK.QA": {"short_name": "Masraf Al Rayan QPSC", "long_name": "Masraf Al Rayan (Q.P.S.C.)", "summary": "Masraf Al Rayan (Q.P.S.C.) engages in the Islamic banking, financing, investing, and brokerage activities in Qatar and internationally. It operates through four segments: Corporate Banking, Retail Banking, Asset Management, and International Operations segments. The company's corporate banking products and services include corporate finance and advisory services, such as capital restructuring, capital raising, corporate valuation, transformation of business products, mergers and acquisitions, specialized investment, structured finance, project finance, and IPO; financing products comprising Murabaha, Ijarah, Ijarah Muntahia Bittamleek, Istisna'a, and Mudaraba; cash management services; treasury services; profit rate swaps, financing syndication, and other services; and trade finance products, such as letters of credit and guarantee, as well as deposit services, currency exchange, and other services. Its retail banking products and services comprise current, savings, investment, term deposit, and kids accounts, as well as other investment products; personal, car, and home finance products; and credit cards and prepaid cards. The company also provides private banking products and services, such as investment planning and asset management, wealth protection, credit planning and management, cash management, and business planning. In addition, it offers investment banking and financial brokerage services; and real estate consulting services. The company serves retail and individual customers, as well as corporate, commercial, and multinational customers. It operates through 17 branches and 96 ATMs in Qatar. Masraf Al Rayan (Q.P.S.C.) was incorporated in 2006 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "MCCS.QA": {"short_name": "Mannai Corporation QPSC", "long_name": "Mannai Corporation Q.P.S.C.", "summary": "Mannai Corporation Q.P.S.C., together with its subsidiaries, operates as a conglomerate worldwide. The company operates through Information Technology, Auto Group, Energy and Industrial Markets, Geotechnical Services, Logistics, Travel, Engineering, Jewellery Trading, Telecom Retail, and Others segments. It offers a range of IT services, including application implementation, bespoke application development, systems integration, mobility, master data management, enterprise content management, data warehousing, enterprise resource planning, and customer relationship management; hardware, software, security, networking, compute, and print solutions; digital business and technology services; office equipment solutions; distribution, technology, payment, and other solutions; and healthcare, research, and scientific technology solutions and services. The company also sells small compacts, passenger cars, commercial vehicles, and used cars; sells and markets heavy equipment and construction machinery to the construction and industrial sectors; and car rental, lease hire, chauffeur, and shuttle services. In addition, it supplies equipment and services to the oil and gas, construction, infrastructure, and utilities sector. Further, the company provides geotechnical, geological, and material testing services to civil engineering, water resource, and development projects; engineering services; travel agency services; and air, sea, and road freight transportation, as well as warehousing and customs clearance services. Additionally, it supplies home, white goods, and small kitchen appliances, electronics, video and audio systems; retails and wholesales jewelry and watch products through its 251 stores; and provides facilities maintenance and management services. The company was founded in 1951 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "MCGS.QA": {"short_name": "Medicare Group QPSC", "long_name": "Medicare Group Q.P.S.C.", "summary": "Medicare Group Q.P.S.C. provides health care services in Qatar. The company operates a hospital and medical clinic center; and promotes medical services. It also provides home nursing and physical therapy services, as well as specializes in nutrition services. The company was formerly known as Al Ahli Specialised Hospital Company Q.P.S.C. Medicare Group Q.P.S.C. was founded in 1996 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "MERS.QA": {"short_name": "Al Meera Consumer Goods QPSC", "long_name": "Al Meera Consumer Goods Company Q.P.S.C.", "summary": "Al Meera Consumer Goods Company Q.P.S.C., together with its subsidiaries, engages in the wholesale and retail trade of consumer goods commodities in Qatar and the Sultanate of Oman. It operates through three segments: Retail, Investment, and Leasing. The company sells foodstuff, household items and garments, stationery, computer accessories, books, and toys; owns and manages consumer outlets; holds equity and funds in the form of investment securities and fixed deposits; and rents shops in various malls. It also establishes and operates shopping centers, supermarkets, and hypermarkets; manufactures and sells bakery products; and offers warehousing and delivery truck services. The company operates through 60 supermarkets and convenience stores. Al Meera Consumer Goods Company Q.P.S.C. was founded in 2005 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Consumer Cyclical", "industry": "Department Stores", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "MPHC.QA": {"short_name": "Mesaieed Petrochemical Holding ", "long_name": "Mesaieed Petrochemical Holding Company Q.P.S.C.", "summary": "Mesaieed Petrochemical Holding Company Q.P.S.C., through its subsidiaries, manufactures and sells petrochemical products in Qatar, the Middle East, Asia, Africa, Indian sub-continent, and Europe. The company operates through two segments, Petrochemicals and Chlor-Alkali. It is involved in the production and sale of ethylene, polyolefins, 1-hexene, C4+, polyethylene, normal alpha olefins, pyrolysis gasoline, C3 and C4, caustic soda, ethylene dichloride, vinyl chloride monomer, and hydrochloric acid. The company was founded in 2013 and is headquarterd in Doha, Qatar. Mesaieed Petrochemical Holding Company Q.P.S.C. is a subsidiary of Qatar Petroleum.", "currency": "QAR", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "MRDS.QA": {"short_name": "Mazaya Real Estate Development ", "long_name": "Mazaya Real Estate Development Q.P.S.C.", "summary": "Mazaya Real Estate Development Q.P.S.C. engages in the real estate investment and development businesses. It develops real estate properties, such as master developments to individual projects in the residential, commercial, and industrial sectors. The company also provides project management and consultancy, property valuation, strategic partnership, real estate brokerage, master developments, assets and facility management division, marketing management and consultancy, real estate portfolio and fund management, and real estate market research services, as well as real estate management and maintenance services. In addition, it trades in mechanical electrical and construction equipment. The company was founded in 2008 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "NLCS.QA": {"short_name": "National Leasing Holding QPSC", "long_name": "Alijarah Holding (Q.P.S.C.)", "summary": "Alijarah Holding (Q.P.S.C.), together with its subsidiaries, engages in leasing, real estate, property development, transportation, taxi service, and driving school businesses in Qatar. It operates through five segments: Financial Leasing, Transportation, Property Development, Driving School, and Taxi Services. The company operates a fleet of 147 trucks and trailers that transport raw sand and gabbro materials, as well as supplies equipment for the infrastructure; and provides taxi and limousine services with a fleet of approximately 1000 taxis for transportation needs of individuals, corporate houses, and governments, as well as offers driving school services. It also offers Islamic leasing and infrastructure development services; and leases and manages properties. The company was founded in 2003 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "ORDS.QA": {"short_name": "Ooredoo QPSC", "long_name": "Ooredoo Q.P.S.C.", "summary": "Ooredoo Q.P.S.C., together with its subsidiaries, provides telecommunications services and related products to small companies, start-ups, and enterprises. It operates through six segments: Ooredoo Qatar, Asiacell, NMTC, Indosat Ooredoo, Ooredoo Oman, and Ooredoo Myanmar. The company offers cellular, wireless, mobile and fixed telecommunication, multimedia, data communication, broadband, Internet leased lines, intra city and inter city leased lines, MPLS IPVPN, and Internet services. It also provides machine to machine, cloud, and mobile applications. The company offers its services primarily in Qatar, Iraq, Kuwait, Indonesia, Oman, and other parts of the Middle East, and North African region. The company was formerly known as Qatar Telecom (Qtel) Q.S.C. and changed its name to Ooredoo Q.P.S.C. in June 2013. Ooredoo Q.P.S.C. was founded in 1987 and is headquartered in Doha, Qatar.", "currency": "QAR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "QAMC.QA": {"short_name": "Qatar Aluminium Manufacturing Q", "long_name": "Qatar Aluminium Manufacturing Company Q.P.S.C.", "summary": "Qatar Aluminium Manufacturing Company Q.P.S.C. produces and sells aluminum products in Asia, Europe, and the United States. It offers extrusion ingots and foundry alloys for the use in automotive, construction, and engineering industries, as well as in the manufacturing of consumer goods. The company was founded in 2018 and is headquartered in Doha, Qatar. Qatar Aluminium Manufacturing Company Q.P.S.C. is a subsidiary of Qatar Petroleum.", "currency": "QAR", "sector": "Basic Materials", "industry": "Aluminum", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "QATI.QA": {"short_name": "Qatar Insurance QSPC", "long_name": "Qatar Insurance Company Q.S.P.C.", "summary": "Qatar Insurance Company Q.S.P.C., together with its subsidiaries, provides insurance, reinsurance, real estate, and financial advisory services. It operates through six segments: Marine & Aviation Insurance, Property & Casualty Insurance, Health & Life Insurance, Real Estate, Advisory, and Investments. The company offers personal insurance products, including car, home, travel, boat, motor cycle, life and medical, and personal accident insurances; and commercial insurance products, such as energy, marine and aviation, property and commercial, motor fleet, and medical and motor insurance products. It operates in the State of Qatar, the United Arab Emirates, the Sultanate of Oman, the State of Kuwait, the United Kingdom, Switzerland, Bermuda, Singapore, Malaysia, and Malta. Qatar Insurance Company Q.S.P.C. was founded in 1964 and is headquartered in Doha, Qatar.", "currency": "QAR", "sector": "Financial Services", "industry": "Insurance—Diversified", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "QCFS.QA": {"short_name": "Qatar Cinema and Film Distribut", "long_name": "Qatar Cinema and Film Distribution Company - Q.S.C", "summary": "Qatar Cinema and Film Distribution Company - Q.S.C distributes cinema films and videos in Qatar. It also trades in television films and programs, and tools for the operation of cinema and projectors. In addition, the company offers commercial advertisement services. Further, it invests in shares, bonds, funds, and real estate business. Qatar Cinema and Film Distribution Company - Q.S.C was incorporated in 1970 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Communication Services", "industry": "Entertainment", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "QEWS.QA": {"short_name": "Qatar Electricity and Water QPS", "long_name": "Qatar Electricity & Water Company Q.P.S.C.", "summary": "Qatar Electricity and Water Company Q.P.S.C., together with its subsidiaries, develops, owns, and operates plants for the production of electricity and desalinated water in Qatar. The company also invests in electricity and desalinated water projects; identifies, evaluates, and develops solar power projects; and operates and maintains plants. It has an electricity generation capacity of 10,590 megawatts and a water production capacity of 481.5 million gallons of water per day. The company was founded in 1990 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "QFBQ.QA": {"short_name": "Qatar First Bank LLC", "long_name": "Qatar First Bank L.L.C (Public)", "summary": "Qatar First Bank L.L.C (Public), an Islamic bank, provides alternative investment, private banking and wealth management, corporate and institutional banking, and treasury and investment management services to individuals and corporates in Qatar and internationally. The company operates through three segments: Alternative Investments, Private Bank, and Other. It offers deposit accounts, treasury forex products, and plain vanilla and specialized financing solutions; and advisory, brokerage, fund and investment, credit facilities, and custody services. The company also engages in the direct investment in venture capital business and real estate asset classes. In addition, it engages in financing, catering, construction, and money market fund businesses, as well as owns and leases real estate properties. The company was formerly known as Qatar First Investment Bank L.L.C. Qatar First Bank L.L.C (Public) was founded in 2008 and is headquartered in Doha, Qatar.", "currency": "QAR", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "QFLS.QA": {"short_name": "Qatar Fuel QPSC", "long_name": "Qatar Fuel Company Q.P.S.C.(\"WOQOD\")", "summary": "Qatar Fuel Company Q.P.S.C.(Â\u0091WOQOD'), together with its subsidiaries, sells, markets, and distributes oil, gas, and refined petroleum products in Qatar. It distributes gasoline and aviation fuels; operates 105 fuel stations, as well as convenience store under the SIDRA name; supplies bulk fuels; and offers ship -to- ship fuels bunkering services. The company also provides auto care services, such as oil change, brakes and mechanical works, tire rotation and wheel alignment, car accessories and spare parts, batteries and electrical works, manual wash, auto car wash, minor repairs, etc. In addition, it offers commercial LPG to restaurants, bakeries, catering businesses, and hotel owners; compressed natural gas; and industrial LPG. Further, the company produces bituminous products, including polymer modified bitumen, cutbacks, and emulsions. Additionally, it offers vehicle inspection, marine bunkering, oil and gas transportation, and real estate services. The company was founded in 2002 and is headquartered in Doha, Qatar.", "currency": "QAR", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "QGMD.QA": {"short_name": "Qatari German for Medical Devic", "long_name": "Qatari German Company for Medical Devices Q.P.S.C.", "summary": "Qatari German Company for Medical Devices Q.P.S.C. manufactures and sells single use disposable syringes in the Middle East. The company offers Q JectUltra, an insulin syringe serving as a tool in diabetic care; Q Flow for infusion therapy; Q Need, a single use hypodermic needle; Q Ject, a single use syringe for the curative medications; and Q Safe, a re-use prevention syringe. It also trades in medical consumables, medical equipment, and medical furniture. The company was founded in 2007 and is headquartered in Doha, Qatar.", "currency": "QAR", "sector": "Healthcare", "industry": "Medical Instruments & Supplies", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "QGRI.QA": {"short_name": "Qatar General Insurance and Rei", "long_name": "Qatar General Insurance & Reinsurance Company QPSC", "summary": "Qatar General Insurance & Reinsurance Company QPSC, together with its subsidiaries, provides general insurance and reinsurance products for individuals, families, and businesses. The company offers personal insurance products, such as motor, villa/home owner, accident, medical, jewelry, and travel insurance products. It also provides corporate insurance products comprising energy, motor, engineering, casualty, property, medical and life, and marine; and specialized insurance products for restaurants, education institutes, supermarkets, pharmacies, beauty salons, and car show rooms, as well as office, jewelry, and Islamic Takaful insurance products. In addition, the company is involved in the investment, development, and management of real estate properties; repair of automobiles; insurance marketing services; water bottling and beverage trading; hospitality, exhibition, and events management; and contracting and construction activities, as well as manufacture of rebars and insulation materials. It operates through seven branches in Qatar. The company was founded in 1979 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Financial Services", "industry": "Insurance—Diversified", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "QGTS.QA": {"short_name": "Qatar Gas Transport Ltd QPSC", "long_name": "Qatar Gas Transport Company Limited (Nakilat) (QPSC)", "summary": "Qatar Gas Transport Company Limited (Nakilat) (QPSC), together with its subsidiaries, operates as a shipping and maritime company in Qatar. The company is involved in the chartering of vessels; ship repair and offshore construction activities; and construction of steel, and aluminum and fiber reinforced plastic boats. It also provides various commercial vessels, such as tugs, boats, cargo and naval vessels, and yachts. In addition, the company offers towage services through owned and operated tug boats, pilot boats, line boats, crew boats, and other harbor crafts, as well as towing, escorting, berthing, pilot support, afloat and ashore line handling services, emergency response, and marine maintenance support. Further, it provides agency and logistic support services, custom formalities, husbandry services, bunker coordination services, crew change and administration services, spare and supply services, and drydocking support services; and various support services to vessels, such as chandlery services, storage facilities, logistics and related services. Its fleet consists of 69 wholly and jointly-owned liquefied natural gas carriers, one FSRU vessel, and four LPG vessels. The company was founded in 2004 and is headquartered in Doha, Qatar.", "currency": "QAR", "sector": "Industrials", "industry": "Marine Shipping", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "QIBK.QA": {"short_name": "Qatar Islamic Bank QPSC", "long_name": "Qatar Islamic Bank (Q.P.S.C.)", "summary": "Qatar Islamic Bank (Q.P.S.C.), together with its subsidiaries, offers banking products and services in Qatar and internationally. The company operates through four segments: Corporate Banking, Retail Banking, Other Group Units, and Local & International Subsidiaries. It offers current, savings/call, multicurrency, and time deposit accounts; certificate of deposit; and credit and debit cards. The company also provides personal, car, home, working capital, asset, mortgage and real estate, project, contracting, start-up business, trade, luxury goods, and fleet and heavy equipment finance, as well as finance for general corporate purposes. In addition, it offers trade finance services, such as letters of credit, letters of guarantee, documentary/bills collection, shipping guarantees, and tariff trade services; and treasury services, including liquidity management, Sukuk, foreign exchange, and hedging services, as well as investment products. Further, the company provides education, auto, family shield, travel, group credit life, and saving Takaful programs; payroll, cash and cheque collection, overnight vaulting, and wealth management services; and Internet, phone, SMS, mobile, and automated teller machines and cash deposit machines banking services, as well as invests in real estate. It serves individual customers, institutional investors, corporates, small and medium enterprises, financial institutions, and investment entities. The company operates 29 branches in Qatar and 1 branch in Sudan. Qatar Islamic Bank (Q.P.S.C.) was founded in 1982 and is headquartered in Doha, Qatar.", "currency": "QAR", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "QIGD.QA": {"short_name": "Qatari Investors Group QPSC", "long_name": "Qatari Investors Group Q.S.C.", "summary": "Qatari Investors Group Q.S.C. engages in cement manufacturing, investments, real estate, security systems, trading, and retail businesses primarily in Qatar. The company offers project engineering, fabrication and erection, commissioning, and post-commissioning services; administrative management and consultation services for construction, elevator, normal adjustment and central, showroom, building material, marble, and ceramic projects; and design, manufacturing supply, and erection services for steel structures and pre-engineered steel buildings. It also provides container line, air and sea freight, custom and project cargo clearance, heavy lift movement, break and dry bulk cargo carriers, freight forwarding, project logistics, warehousing, and distribution; invests in, develops, and rents properties; and provides real estate consultancy services. In addition, the company restores and renovates buildings; arranges indoor areas; provides garden landscaping services; constructs swimming pools; and designs, engineers, assembles, installs, commissions, and maintains integrated security, safety, closed circuit television, access control, fire alarm, industrial surveillance and monitoring, public address and voice evacuation, perimeter protection, road blocking, and X-ray systems. Further, it offers electronics displays and LED video screens for the sports industry; display signage for the hotel and hospitality industry, clubs, schools, sports venues, airport, and traffic installations; and specialized vehicles for civil defense, construction, road sweeping, and other government institutions. Additionally, it builds tennis and volleyball courts, and other sports-related fields; supplies and installs sports and fitness equipment; brokerages shares; provides management and investment funds; manages and markets shares and securities; and trades in construction material, equipment, and trucks. The company was founded in 2006 and is headquartered in Doha, Qatar.", "currency": "QAR", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "QIIK.QA": {"short_name": "Qatar International Islamic Ban", "long_name": "Qatar International Islamic Bank (Q.P.S.C)", "summary": "Qatar International Islamic Bank (Q.P.S.C) engages in banking, financing, and investing activities. The company operates through three segments: Corporate Banking, Personal Banking, and Treasury & Investments. It offers current, saving, and term deposit accounts; personal, vehicle, and home finance; debit and credit cards; mobile, Internet, and phone banking; call center; ATM; safe deposit; and credit life and vehicle insurance products and services. The company also provides working capital, real estate, contracting, and project finance, as well as corporate finance and syndication services; and treasury and investment banking services, including equity participation, private equity, investment funds, Sukuk, and international finance and syndications. It operates 19 branches in Qatar. The company serves corporate and retail customers, government and semi government institutions, and small and medium-sized enterprises. It operates in Qatar, the Middle East, other Gulf Cooperation Council countries, Europe, North America, and internationally. Qatar International Islamic Bank (Q.P.S.C) was incorporated in 1990 and is headquartered in Doha, Qatar.", "currency": "QAR", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "QIMD.QA": {"short_name": "Qatar Industrial Manufacturing ", "long_name": "Qatar Industrial Manufacturing Company Q.P.S.C.", "summary": "Qatar Industrial Manufacturing Company Q.P.S.C., together with its subsidiaries, engages in the industrial manufacturing and various types of industrial investments in Qatar and internationally. The company manufactures and exports facial tissues, toilet rolls, kitchen rolls, and M Tork rolls to other GCC countries; produces treated sand for construction and agricultural uses; offers sulphuric acid for local and export markets; and produces paving and Kerb stones. Qatar Industrial Manufacturing Company Q.P.S.C. was founded in 1990 and is headquartered in Doha, Qatar.", "currency": "QAR", "sector": "Industrials", "industry": "Conglomerates", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "QISI.QA": {"short_name": "Qatar Islamic Insurance Group Q", "long_name": "Qatar Islamic Insurance Group  Q.P.S.C.", "summary": "Qatar Islamic Insurance Group Q.P.S.C. provides a range of insurance products and services in Qatar. The company primarily offers property, motor, marine, fire, engineering, liability, life, medical, money-bankers, electronics and computer, energy, travel, takaful, and health insurance products; and general insurance products, including burglary, plate glass, office multicover, and accident insurance products. It serves private and public sectors, including government offices, banking institutions, hotels, and other organizations, as well as infrastructure projects. The company was formerly known as Qatar Islamic Insurance Company Q.P.S.C. Qatar Islamic Insurance Group Q.P.S.C. was incorporated in 1993 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Financial Services", "industry": "Insurance—Diversified", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "QLMI.QA": {"short_name": "QLM Life and Medical Insurance ", "long_name": "QLM Life & Medical Insurance Company Q.P.S.C.", "summary": "QLM Life & Medical Insurance Company W.L.L. provides life and medical insurance services. It operates in two segments, Medical, and Group and Credit Life Insurance. The company was incorporated in 2018 and is based in Doha, Qatar. QLM Life & Medical Insurance Company W.L.L. is a subsidiary of Qatar Insurance Company Q.S.P.C.", "currency": "QAR", "sector": "Financial Services", "industry": "Insurance—Diversified", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "QNBK.QA": {"short_name": "Qatar National Bank QPSC", "long_name": "Qatar National Bank (Q.P.S.C.)", "summary": "Qatar National Bank (Q.P.S.C.), together with its subsidiaries, provides commercial and Islamic banking products and services in Qatar and internationally. The company operates through four segments: Corporate Banking, Consumer banking, Asset and Wealth Management, and International Banking. It offers personal banking products and services, such as current, savings, fixed deposit, and call-notice deposit accounts; credit, debit, and pre-paid cards; personal, top-up, vehicle, vehicle lease, and mortgage loans; insurance products, including life, salary continuation, critical illness, motor, mortgage, and travel insurance; asset management services; and mobile, Internet, ATM, SMS, and USSD banking services. The company also provides business banking products and services, including current, call, fixed deposit, and non-resident accounts; working capital, project, and vehicle loans; structured and project finance; transaction banking services; and credit cards. In addition, it offers financial institutions, treasury, investment banking, and advisory services; and brokerage and custody services. The company serves individuals and corporates, as well as high net worth customers. It has a network of approximately 1,113 branches and approximately 4,335 ATMs. The company was formerly known as Qatar National Bank S.A.Q. and changed its name to Qatar National Bank (Q.P.S.C.) in January 2016. Qatar National Bank (Q.P.S.C.) was founded in 1964 and is headquartered in Doha, Qatar.", "currency": "QAR", "sector": "Financial Services", "industry": "Banks—Diversified", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "QNCD.QA": {"short_name": "Qatar National Cement QPSC", "long_name": "Qatar National Cement Company (Q.P.S.C.)", "summary": "Qatar National Cement Company (Q.P.S.C.) manufactures and sells cement and washed sand in Qatar. It offers ordinary Portland cement, sulphate resistant cement, hydrated and calcined lime, Portland pulverized fuel ash cement, and calcium carbonate. The company was founded in 1965 and is headquartered in Doha, Qatar.", "currency": "QAR", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "QNNS.QA": {"short_name": "Qatar Navigation QPSC", "long_name": "Qatar Navigation Q.P.S.C.", "summary": "Qatar Navigation Q.P.S.C. operates as a diversified maritime and logistics company in the Middle East. The company's Milaha Capital segment provides corporate finance advisory services; and manages the portfolio of financial and real estate investments. Its Milaha Maritime & Logistics segment offers logistics, container feeder shipping, non-vessel operating common carrier operation, bulk shipping, shipping agency, port management and operation, and shipyard and steel fabrication services to importers, exporters, and shipping companies. Its Milaha Offshore segment provides offshore support services to the oil and gas industry through a fleet of offshore service vessels, which include safety standby vessels, anchor handling tugs, crew and work boats, and dynamic positioning vessels, as well as saturation diving services. The company's Milaha Trading segment trades in trucks, heavy equipment, machinery, and lubrication brands; offers after sales service; and owns and operates a travel agency. Its Milaha Gas and Petrochem segment owns, manages, and operates a fleet of LPG and liquefied natural gas carriers; and provides ocean transportation services to international energy and industrial companies. This segment also owns and manages a fleet of product tankers and one crude carrier, as well as operates various product tankers in partnership with international trading and shipping companies. The company also engages in heavy vehicle selling, cargo handling, fabrication and installation of offshore structures, land transport, vessel chartering, real estate maintenance, warehousing, and securities investment activities; trading building and industrial materials, and aggregates; and foreign shipping agency activities. In addition, it owns, hires, purchases, sells, operates, manages, and repairs various ships. The company operates in the State of Qatar, the United Arab Emirates, and Germany. Qatar Navigation Q.P.S.C. was founded in 1957 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Industrials", "industry": "Marine Shipping", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "QOIS.QA": {"short_name": "Qatar Oman Investment QPSC", "long_name": "Qatar Oman Investment Company Q.S.C.", "summary": "Qatar Oman Investment Company Q.S.C. is a private equity firm specializing in investments in acquisitions. The firm generally invests in shares, loan certificates, promissory notes, negotiable bonds, and any other titles or commercial papers. It seeks to invest in oil and gas, real estate and infrastructure, health care, and financial services in the State of Qatar and in tourism, real estate and infrastructure, health care, and education in the Sultanate of Oman. The firm also seeks to establish industrial, commercial, agricultural, real estate, tourist, and service projects in the State of Qatar and the Sultanate of Oman. Qatar Oman Investment Company Q.S.C. was founded on July 12, 2006 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Financial Services", "industry": "Asset Management", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "SIIS.QA": {"short_name": "Salam International Investment ", "long_name": "Salam International Investment Limited Q.P.S.C.", "summary": "Salam International Investment Limited Q.P.S.C. establishes, incorporates, acquires, and owns enterprises in contracting, energy and industry, consumer and luxury products, technology, real estate, and development sectors in Qatar and internationally. It provides information technology, electronic system installation and maintenance, and mechanical services; and facility management, investments, and oil and gas services. The company also engages in civil contracting and furniture trading activities; the trading and maintenance of refrigerators, water coolers, and air conditioners; consulting and managerial studies; and the manufacture of switchgears and transformers. In addition, it is involved in trading chemical materials and furniture; the maintenance of oil equipment; steel works; furniture and interior, and aluminum works; managing restaurants and bakeries; real estate activities; and water equipment trading, interior design, and furniture and interiors manufacturing businesses. Further, the company engages in the retail and wholesale of luxury consumer products; marketing and offices facility, and photography trading and related services businesses; construction and supply of landscaping related materials; and manufacture of bowls and boxes of cardboards. Salam International Investment Limited Q.P.S.C. was incorporated in 1998 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Industrials", "industry": "Conglomerates", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "UDCD.QA": {"short_name": "United Development QPSC", "long_name": "United Development Company Q.P.S.C.", "summary": "United Development Company Q.P.S.C., together with its subsidiaries, identifies and invests in long-term projects in the State of Qatar. It operates through four segments: Urban Development, Hospitality and Leisure, Infrastructure and Utilities, and Other Operations. The company engages in the reclamation of land covering an area of 985 acres into a manmade island; and the development of the island into various districts comprising housing beachfront villas, town homes, luxury apartments, retail shopping complexes, penthouses, five star hotels, marinas, and schools and hospitals with related infrastructure and community facilities. It is also involved in the construction, ownership, and operation of district cooling systems; operation of a marinas; sale of marine related equipment; and investment in and management of restaurants, as well as purchase and sale of fast-moving consumer goods in the hospitality sector. In addition, the company invests in and develops real estate properties; and operates and develops hotels and resorts, as well as engages in the provision of advertising, insurance agency, technical and risk related, and cleaning related services. Further, it provides registry and master community, and property management support, as well as information technology solutions. The company was founded in 1999 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "VFQS.QA": {"short_name": "Vodafone Qatar PQSC", "long_name": "Vodafone Qatar P.Q.S.C.", "summary": "Vodafone Qatar P.Q.S.C. provides cellular mobile telecommunication and fixed line services in Qatar. It offers prepaid and postpaid services; access charges, airtime usage, messaging, interconnect fees, voice and data roaming, connection fees; and sells mobile related equipment and accessories. The company also provides mobile Internet and broadband services; Internet of things solutions, which enable businesses to develop new service-based customer propositions and revenue streams, as well as address compliance and sustainability requirements; and dedicated APNs for corporate organizations. In addition, it offers fixed line solutions, such as corporate Internet; DDoS mitigation services, which help to defend organizations against cyber-attacks; Ethernet VPN, a multi-site data service for corporate and government organizations; leased lines that provide reliable and secure transmission links between business sites; Vodafone Corporate Voice, a fixed-mobile convergence and unified communication service; and Vodafone IP-VPN, a private and MPLS based WAN service, as well as support services. The company was incorporated in 2008 and is headquartered in Doha, Qatar. Vodafone Qatar P.Q.S.C. is a subsidiary of Vodafone & Qatar Foundation LLC.", "currency": "QAR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "WDAM.QA": {"short_name": "Widam Food QPSC", "long_name": "Widam Food Company Q.P.S.C.", "summary": "Widam Food Company Q.P.S.C. engages in slaughtering sheep and cattle in the State of Qatar. It is also involved in the import and trade of livestock, meat, and feed products; supply of fresh meat and related products; and sale of live and frozen meats. The company was formerly known as Qatar Company for Meat and Livestock Trading (MAWASHI) Q.S.C. and changed its name to Widam Food Company Q.P.S.C. in March 2013. Widam Food Company Q.P.S.C. was founded in 2003 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}}