{
    "AAKASH.NS": {
        "short_name": "AAKASH EXPLORATION",
        "long_name": "Aakash Exploration Services Limited",
        "summary": "Aakash Exploration Services Limited provides support services for oil and gas extraction in India. It offers services using machineries, such as mobile work over rigs, hot oil circulation units, heating units, indirect bath heaters, mobile sucker rod pumping units, utility services for return lines, mobile steaming units, mobile high pressure air compressors, mobile high and low pressure pumping units, and FRAC/ insulated tanks. The company was founded in 2007 and is headquartered in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Ahmedabad"
    },
    "ABAN.NS": {
        "short_name": "ABAN OFFSHORE",
        "long_name": "Aban Offshore Limited",
        "summary": "Aban Offshore Limited, together with its subsidiaries, provides offshore drilling and production services to companies engaged in the exploration, development, and production of oil and gas in India and internationally. It offers exploratory, drilling, hydrocarbons production, and manning and management services. The company owns and operates a portfolio of assets, including jack-ups, floaters/drill ships, and floating production units. It also engages in the ownership and operation of wind turbines for the generation of wind power. The company's wind farms are located at Radhapuram, Pazhavoor, and Kavalkinaru in Tirunelveli District, Tamil Nadu. Aban Offshore Limited was incorporated in 1986 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "ADANIENT.NS": {
        "short_name": "ADANI ENTERPRISES",
        "long_name": "Adani Enterprises Limited",
        "summary": "Adani Enterprises Limited, together with its subsidiaries, engages in the coal trading, coal mining, oil and gas exploration, ports, multi-modal logistics, power generation and transmission, gas distribution, and edible oil and agro commodities businesses in India and internationally. The company trades in coal; offers bunkering and integrated coal management services; imports fruits, apple, pear, kiwi, oranges, and grapes; and markets its apple under the FARM-PIK brand, as well as food grains. It is also involved in the mining, processing, acquisition, exploration, and development of various coal properties, including Parsa East and Kanta Basan coal block, Kente Extension coal block, Parsa coal block, and Jitpur coal block; a coal mining concession in Indonesia; and the Carmichael Coal mine in the Galilee Basin in Queensland, Australia, as well as solar PV manufacturing business. In addition, company offers edible oils, basmati rice, pulses, soya chunks, and besan and atta, as well as lauric and bakery fats, castor oil derivatives, oleo chemicals, and soya value added products under the Fortune, King's, Bullet, Raag, Avsar, Pilaf, Jubilee, Fryola, Alpha, and Aadhar brands. Further, it manufactures fighter aircraft, unmanned aerial systems, and helicopters; develops avionics and systems, aero structures and components, aerospace composites, and radar and electronic warfare systems, as well as constructs rail transit systems; and engages in the mining of minerals and ores activities. The company was founded in 1988 and is based in Ahmedabad, India. Adani Enterprises Limited is a subsidiary of S.B. Adani Family Trust.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Ahmedabad"
    },
    "AEGISCHEM.NS": {
        "short_name": "AEGIS LOGISTICS",
        "long_name": "Aegis Logistics Limited",
        "summary": "Aegis Logistics Limited, together with its subsidiaries, operates as an oil, gas, and chemical logistics company in the downstream oil and gas sector primarily in India. It operates through Liquid Terminal Division and Gas Terminal Division segments. The company operates a network of bulk liquid handling terminals, liquefied petroleum gas (LPG) terminals, filling plants, pipelines, and gas stations to deliver products and services. It also owns and operates a network of shore based tank farm installations for the receipt and handling of bulk liquids, including hazardous chemicals, petroleum products, and petrochemicals. In addition, the company engages in sourcing, shipping, and distribution of LPG and propane; offers supply chain management services from product planning, sourcing, and shipping to receipt, storage, and dispatch by pipeline and tankers to the point of consumption; delivers pressurized and refrigerated cargoes to various ports on the coastline of India; markets LPG and propane in bulk to industrial clients; provides clean energy solutions to companies for their various processes and applications; and offers conversion services to switch from other energy sources to LPG. Further, it provides engineering, procurement, and construction services in the oil and gas sector; and refueling services to ship owners and charterers. The company serves industrial companies, as well as individual retail customers at its Aegis Autogas stations. Aegis Logistics Limited was incorporated in 1956 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "ALPHAGEO.NS": {
        "short_name": "ALPHAGEO(INDIA)",
        "long_name": "Alphageo (India) Limited",
        "summary": "Alphageo (India) Limited offers geophysical seismic data acquisition, processing, and interpretation services for exploration of hydrocarbons and minerals in India and internationally. The company provides various services, including designing and preplanning of 2D/3D/4D/3C surveys; seismic data acquisition in 2D/3D/4D/3C; seismic data processing and reprocessing/special processing comprising pre-stack imaging, AVO inversion, etc.; and seismic data interpretation consisting of structural and stratigraphic interpretation, and evaluation of blocks for exploration, as well as generation, evaluation, and ranking of prospects. Its services also include consultancy on 3D/4D/3C surveys; API of EM and GM surveys; reservoir data acquisition and analysis; tape transcription and digitization of hard copies of maps, seismic sections, and well logs into CGM/SEGY/LAS formats; third party quality control for 2D/3D seismic data acquisition and processing; topographic surveys with GPS/RTK; Airborne surveys; and geophysical mapping surveys through gravity and magnetic methods for identification of potential areas from mineral prognostication point of view. In addition, the company offers onshore and offshore oil and gas field services; renting of drilling equipment and machinery; and marine and aerial geophysical services. Alphageo (India) Limited was incorporated in 1987 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "BPCL.NS": {
        "short_name": "BHARAT PETROL CORP",
        "long_name": "Bharat Petroleum Corporation Limited",
        "summary": "Bharat Petroleum Corporation Limited refines crude oil and markets petroleum products in India. The company operates through two segments, Downstream Petroleum; and Exploration and Production of Hydrocarbons. It operates fuel stations that sell petrol, diesel, automotive liquefied petroleum gas (LPG), and compressed natural gas. The company has a network of 15,402 fuel stations with 13,648 fully automated fuel stations. The company also provides Bharatgasfuels to approximately 40 million homes; MAK Lubricants, such as automotive engine oils, gear oils, greases, and specialties; and jet fuel and services to airlines, as well as operates oil refineries in Mumbai, Bina, Numaligarh, and Kochi. In addition, it offers industrial fuels products, such as gases, naphtha, diesel, kerosene, white oil, black oil, furnace oil, bitumen, sulphur, and solvents and special products, as well as industrial lubricants. Further, the company has participating interests in 27 blocks, including 15 blocks in India and 12 blocks in other countries; imports and exports of other petroleum products; and owns a network of 2,241 km of multi-product pipelines, as well as engages in the natural gas business. The company was formerly known as Bharat Refineries Limited and changed its name to Bharat Petroleum Corporation Limited in August 1977. Bharat Petroleum Corporation Limited was incorporated in 1952 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "CHENNPETRO.NS": {
        "short_name": "CHENNAI PETRO CP",
        "long_name": "Chennai Petroleum Corporation Limited",
        "summary": "Chennai Petroleum Corporation Limited produces and sells petroleum products in India. Its principal products include liquefied petroleum gas, motor spirit, superior kerosene oil, aviation turbine fuel, high speed diesel, naphtha, bitumen, lube base stocks, paraffin wax, fuel oil, hexane, and petrochemical feed stocks. The company also provides furnace oil, LSHS, and light diesel oil; and non-fertilizer naptha, light and heavy extracts, LVI spindle, propylene, polybutyne feed-stock, butane, and linear alkyl benzene feedstock. It serves roadways, railways, and airways requirement of transportation fuel, as well as the fertilizer, power, and petrochemical industries. The company was formerly known as Madras Refineries Limited and changed its name to Chennai Petroleum Corporation Limited in June 2000. The company was founded in 1965 and is based in Chennai, India. Chennai Petroleum Corporation Limited is a subsidiary of Indian Oil Corporation Limited.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "COALINDIA.NS": {
        "short_name": "COAL INDIA LTD",
        "long_name": "Coal India Limited",
        "summary": "Coal India Limited, together with its subsidiaries, produces and sells coal worldwide. It offers coking coal primarily for use in steel making and metallurgical industries, and for hard coke manufacturing; and semi coking coal that is used as blend-able coal in steel making, merchant coke manufacturing, and other metallurgical industries. The company also provides non-coking coal for use as thermal grade coal for power generation, as well as for cement, fertilizer, glass, ceramic, paper, chemical, and brick manufacturing, and other heating purposes. In addition, it offers beneficiated and washed non-coking coal for use in power generation; beneficiated non-coking coal, which is used in cement, sponge iron, and other industrial plants; and middling products for use in power generation, domestic fuel plants, brick manufacturing units, cement plants, industrial plants, etc. Further, the company provides rejects for use in fluidized bed combustion boilers for power generation, road repairs, briquette making, land filling, etc.; CIL/LTC coke that is used in furnaces and kilns of industrial units, as well as for use as domestic fuel by halwais, hotels, etc.; and coal/coke fines that are used in industrial furnaces, and for domestic purposes. Additionally, it offers tar/heavy oil/light oil/soft pitches, which are used in furnaces and boilers of industrial plants, as well as power houses, oil, dye, pharmaceutical industries, etc. The company was formerly known as Coal Mines Authority Limited and changed its name to Coal India Limited in November 1975. The company was incorporated in 1973 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "CONFIPET.NS": {
        "short_name": "Confidence Petro Ind Ltd.",
        "long_name": "Confidence Petroleum India Limited",
        "summary": "Confidence Petroleum India Limited manufactures and sells liquefied petroleum gas (LPG) cylinders in India. It operates through LPG/CNG Cylinder Manufacturing and LPG Bottling & Marketing segments. The company also offers CNG and packed cylinders. It also provides LPG bottling services; and supplies LPG for commercial usage. The company serves commercial and industrial customers under the GoGas, and retail customer under the GoGas Elite brand names. It operates approximately 209 auto LPG dispensing stations. Confidence Petroleum India Limited was founded in 1993 and is based in Nagpur, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Nagpur"
    },
    "D5T1.F": {
        "short_name": "GT EASTRN ENERGY GDR 1/2",
        "long_name": "Great Eastern Energy Corporation Limited",
        "summary": "Great Eastern Energy Corporation Limited engages in exploring, developing, extracting, distributing, and marketing coal bed methane and compressed natural gas in India. It owns interests in the Raniganj (South) block that covers an area of approximately 210 square kilometers located in West Bengal; and Mannargudi block, which covers an area of approximately 667 square kilometers situated in Mannargudi, Tamil Nadu. The company was incorporated in 1992 and is based in Gurugram, India.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "city": "Gurugram"
    },
    "DEEPENR.NS": {
        "short_name": "DEEP ENE RESOURCES LTD",
        "long_name": "Deep Energy Resources Limited",
        "summary": "Deep Energy Resources Limited engages in the oil and gas exploration and production business India. It focuses on exploring oil and gas resources and coal bed methane, and related engineering solutions. The company was formerly known as Deep Industries Limited and changed its name to Deep Energy Resources Limited in September 2020. Deep Energy Resources Limited was founded in 1991 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Ahmedabad"
    },
    "DEEPINDS.NS": {
        "short_name": "Deep Industries Limited",
        "long_name": "Deep Industries Limited",
        "summary": "Deep Industries Limited engages in the oil and gas services business. The company is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Ahmedabad"
    },
    "GEEC.L": {
        "short_name": "GREAT EASTERN ENERGY CORPORATIO",
        "long_name": "Great Eastern Energy Corporation Limited",
        "summary": "Great Eastern Energy Corporation Limited engages in exploring, developing, extracting, distributing, and marketing coal bed methane and compressed natural gas in India. It owns interests in the Raniganj (South) block that covers an area of approximately 210 square kilometers located in West Bengal; and Mannargudi block, which covers an area of approximately 667 square kilometers situated in Mannargudi, Tamil Nadu. The company was incorporated in 1992 and is based in Gurugram, India.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "India",
        "city": "Gurugram"
    },
    "GMDCLTD.NS": {
        "short_name": "GUJARAT MINERAL DE",
        "long_name": "Gujarat Mineral Development Corporation Limited",
        "summary": "Gujarat Mineral Development Corporation Limited engages in mining business in India. It operates in two segments, Mining and Power. The company explores for lignite, bauxite, fluorspar, manganese, silica sand, limestone, bentonite, and ball clay. It also generates power using thermal, wind, and solar sources. The company was incorporated in 1963 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Ahmedabad"
    },
    "GULFPETRO.NS": {
        "short_name": "GP PETROLEUMS LTD",
        "long_name": "GP Petroleums Limited",
        "summary": "GP Petroleums Limited engages in formulating, manufacturing, and marketing industrial and automotive lubricants, process oils, transformer oils, greases, and other specialties in India and internationally. It offers automotive lubricants, including automotive engine oils, gear and transmission oils, greases, engine coolant and brake fluids, and diesel exhaust fluids. The company also provides industrial lubricants and specialties comprising industrial lubricating and specialty oils; metal working fluids, corrosion preventive oils, cleaners and quenching oils; industrial greases; and horticultural orchard spray oils, as well as process oils and specialties consisting of rubber process oils, white oils and specialties, and transformer oils. GP Petroleums Limited markets its lubricants under the IPOL and REPSOL brand names through distributors and dealers. The company was formerly known as Sah Petroleums Limited and changed its name to GP Petroleums Limited in April 2015. The company was incorporated in 1983 and is headquartered in Mumbai, India. GP Petroleums Limited is a subsidiary of GP Global APAC Pte. Ltd.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "HINDOILEXP.NS": {
        "short_name": "HINDUSTAN OIL EXPL",
        "long_name": "Hindustan Oil Exploration Company Limited",
        "summary": "Hindustan Oil Exploration Company Limited engages in the exploration, development, and production of onshore and offshore crude oil and natural gas in India. It holds interests in various oil and gas blocks/fields. The company's oil and gas assets portfolio consist of operated and non-operated acreages in Assam, Cauvery, and Cambay basins. As of March 31, 2020, its estimated proved and probable reserves on working interest basis were 26.65 million barrels of oil equivalent. The company, through its subsidiary, Hindage Oilfield Services Limited, focuses on oil field equipment and service sector. Hindustan Oil Exploration Company Limited was incorporated in 1983 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "HINDPETRO.NS": {
        "short_name": "HINDUSTAN PETROL",
        "long_name": "Hindustan Petroleum Corporation Limited",
        "summary": "Hindustan Petroleum Corporation Limited refines and markets petroleum products in India and internationally. The company operates through Downstream Petroleum and Others segments. It offers petrol, diesel, kerosene, liquefied petroleum gas, naphtha lubricants, specialties, and greases, as well as aviation turbine fuel; and markets and exports bulk fuels, bitumen, solvents, jet and marine fuel, marine lubes, household insecticides, hexane, propylene, jute batch oil, turpentine oil, carbon black feed stock, molten sulphur, and superior kerosene oil (SKO). The company is also involved in international trade activities, including crude oil imports, petroleum product imports/exports, import/export registration, shipping, supplies for domestic markets, and product exchange with other Indian oil marketing companies and oil price risk management. In addition, it offers LPG products under the HP Gas brand, as well as markets LPG cylinders for commercial and industrial purposes, and bulk LPG products for industries; and operates retail petrol pumps and pipelines for the transportation of petroleum products. Further, the company explores for and produces hydrocarbons, as well as provides management services for exploration and production blocks; and operates sugar ethanol-cogen plants in Bihar, wind power plants in Maharashtra and Rajasthan, and solar power plant in Karnataka. As of March 31, 2020, it operated through a marketing network of 133 regional offices; 68 depots; 50 LPG bottling plants; 44 aviation service facilities; 16,476 retail outlets; 1,638 SKO and light diesel oil dealers; and 6,110 LPG distributors, as well as 43 terminal, installation, and tap off points. The company was incorporated in 1952 and is headquartered in Mumbai, India. Hindustan Petroleum Corporation Limited is a subsidiary of Oil and Natural Gas Corporation Limited.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "IOC.NS": {
        "short_name": "INDIAN OIL CORP",
        "long_name": "Indian Oil Corporation Limited",
        "summary": "Indian Oil Corporation Limited, together with its subsidiaries, engages in the refining, pipeline transportation, and marketing of petroleum products in India. It is also involved in the exploration and production of crude oil and gas; and marketing of natural gas and petrochemicals. The company's products include petrol/gasoline, diesel/gas oil, lubricants and greases, auto gas, cooking gas, kerosene, LPG, bulk/industrial fuels, aviation fuel, marine oils, and bitumen. In addition, it offers special products, such as carbon black feedstock, raw petroleum coke, Sulphur, paraffin wax, raw petroleum coke, jute batching oil, micro crystalline wax, mineral turpentine oil, toluene, propylene, benzene, and petcoke. The company operates through a network of approximately 9 refineries; 14,231 kilometers of crude/product and gas pipelines; approximately 27,702 fuel stations, including 7,857 Kisan Seva Kendra outlets; 125 terminals and depots; 91 LPG bottling plants; 116 aviation fuel stations; 6,960 consumer pumps; and approximately 11,964 LPG distributors. Indian Oil Corporation Limited's exploration and production portfolio comprises 10 oil and gas blocks in India; and 12 blocks in Canada, Gabon, Israel, Libya, Nigeria, Oman, Russia, the United Arab Emirates, the United States, and Venezuela. Further, it engages in the explosives and cryogenic; wind and solar power generation; lube blending; and lubricants and base oil marketing activities. The company also exports its products. It has strategic alliance with ENOC Group. The company was founded in 1959 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "JINDRILL.NS": {
        "short_name": "JINDAL DRILLING",
        "long_name": "Jindal Drilling & Industries Limited",
        "summary": "Jindal Drilling & Industries Limited provides drilling services to the oil and gas sector in India. It provides offshore drilling, horizontal and directional drilling, and mud logging services, as well as measurement while drilling services. The company was incorporated in 1983 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "LIKHITHA.NS": {
        "short_name": "Likhitha Infrastruc Ltd",
        "long_name": "Likhitha Infrastructure Limited",
        "summary": "Likhitha Infrastructure Limited engages in laying, testing, and commissioning of oil and gas pipe lines in India. The company is also involved in laying of oil and gas supply pipe lines and irrigation canals, building bridges over the canals, and related maintenance works; and the provision of operations and maintenance services for city gas distribution companies. Likhitha Infrastructure Limited was founded in 1998 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "MERCATOR.NS": {
        "short_name": "MERCATOR LTD",
        "long_name": "Mercator Limited",
        "summary": "Mercator Limited, together with its subsidiaries, engages in shipping, dredging, oil and gas, and coal businesses. It operates in two segments, Shipping; and Coal Mining, Trading and Logistics. The company is involved in coal mining, procurement, and logistics activities. It owns and operates coal mines in Indonesia; and a mining license in Mozambique. The company also explores for petroleum in two blocks located in Cambay basin, Gujarat in India. In addition, it has a fleet of oil tankers and dredgers; and rents and leases water-transport equipment. The company was formerly known as Mercator Lines Limited and changed its name to Mercator Limited in November 2011. Mercator Limited was founded in 1983 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "MRPL.NS": {
        "short_name": "MANGALORE REF &PET",
        "long_name": "Mangalore Refinery and Petrochemicals Limited",
        "summary": "Mangalore Refinery and Petrochemicals Limited manufactures and sells refined petroleum products in India. The company produces and sells hydrogen, liquefied petroleum gas, fuel gas, motor spirit, xylol, naphtha, SKO, high speed diesel, aviation turbine fuel, furnace oil, asphalt, CRMB, LSWR, sulphur, and pet coke, as well as bitumen, polypropylene, and other products. It operates 7 retail outlets. The company serves mining, construction, power, agriculture, fertilizer, and paint industries. It also exports its products. The company was founded in 1988 and is based in Mangalore, India. Mangalore Refinery and Petrochemicals Limited is a subsidiary of Oil and Natural Gas Corporation Limited.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mangalore"
    },
    "OIL.NS": {
        "short_name": "OIL INDIA LTD",
        "long_name": "Oil India Limited",
        "summary": "Oil India Limited explores for, develops, and produces crude oil and natural gas in India and internationally. The company operates through Crude Oil, Natural Gas, Liquefied Petroleum Gas (LPG), Pipeline Transportation, and Renewal Energy segments. It is also involved in the transportation of crude oil and natural gas; and production of LPG, as well as in the provision of exploration and production related services. The company owns and operates 1,157 kilometers of cross-country crude oil pipelines; and 13 drilling rigs and 14 work-over rigs, as well as owns 10 crude oil pumping stations and 17 repeater stations in Assam, West Bengal, and Bihar states. It also generates energy through wind and solar power projects. In addition, the company has participating interests in NELP exploration blocks in Mahanadi Offshore, Mumbai Deepwater, Krishna Godavari Deepwater, etc., as well as in various projects in Libya, Gabon, the United States, Nigeria, Sudan, Yemen, Venezuela, Mozambique, Myanmar, Bangladesh, Russia, and Israel. Oil India Limited was founded in 1889 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "OILCOUNTUB.NS": {
        "short_name": "OIL COUNTRY TUBULR",
        "long_name": "Oil Country Tubular Limited",
        "summary": "Oil Country Tubular Limited manufactures and sells drill pipes and allied products, and oil country tubular goods and related services for the oil drilling and exploration industry in India and internationally. The company offers heavy weight drill pipes and drill collars, as well as tubing, casing, and high collapse casing products. It also provides accessories, such as lift plugs and subs, lifting bails, pup joints, rotary subs, sleeve stabilizers, tool joints, welded blade stabilizers, and couplings, as well as drill rods. In addition, the company offers services comprising tool joint hardfacing, tool joints make and break, internal plastic coating of drill pipe and tubing, drill pipe reconditioning, drill pipe re-threading, tubing and casing, and field inspection. Oil Country Tubular Limited was incorporated in 1985 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "ONGC.NS": {
        "short_name": "OIL & NATURAL GAS",
        "long_name": "Oil and Natural Gas Corporation Limited",
        "summary": "Oil and Natural Gas Corporation Limited explores for, develops, and produces crude oil and natural gas in India and internationally. It operates through Exploration and Production, and Refining & Marketing segments. The company also engages in the refining and marketing of petroleum products; transportation of oil and natural gas; and production of liquefied petroleum gas, ethane/propane, naphtha, superior kerosene oil, low sulphur high stock, aviation turbine fuel, and high speed diesel. In addition, it generates electric power through 726 megawatts (MW) gas based power project in Tripura; 51 MW wind power project in Surajbari, Gujarat; and 102 MW wind power project in Rajasthan, as well as generates solar power through a total installed capacity of 23 MW. The company was incorporated in 1993 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "PANAMAPET.NS": {
        "short_name": "PANAMA PETROCHEM L",
        "long_name": "Panama Petrochem Limited",
        "summary": "Panama Petrochem Limited manufactures and sells specialty petroleum products in India. The company offers white/liquid paraffin oil; petroleum jellies; transformer oil; ink and coating oils; rubber process oil; industrial oils and lubricants; lithium and lithium complex, calcium based, sodium based, and aluminum greases; automotive engine, and gear and transmission oils, as well as other automotive lubricants; drilling fluids; and fully- and semi-refined paraffin, slack, and micro waxes. It serves printing, textile, rubber, pharmaceutical, cosmetic, power, and other industrial oil industries. The company also exports its products to various countries, including the United States, the United Kingdom, Europe, the Middle East, Australia, Africa, Southeast Asia, etc. Panama Petrochem Limited was founded in 1975 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "PETRONET.NS": {
        "short_name": "PETRONET LNG",
        "long_name": "Petronet LNG Limited",
        "summary": "Petronet LNG Limited engages in the import, regasification, and supply of liquefied natural gas (LNG) in India. The company owns and operates a LNG import and regasification terminal with name plate capacity of 17.5 MMTPA located in Dahej, Gujarat; and a LNG terminal with name plate capacity of 5 MMTPA located in Kochi, Kerala. Petronet LNG Limited was founded in 1998 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "REFEX.NS": {
        "short_name": "REFEX INDUSTRIES L",
        "long_name": "Refex Industries Limited",
        "summary": "Refex Industries Limited engages in handling and disposal of fly ash from power plants in India. It operates through Coal & Ash Handling Business, Solar Power-Generation and Related Activities, Refrigerant Gases-Manufacturing (Refilling), and Sale of Service segments. The company primarily refills hydrofluorocarbons, which are used in automobile and room air-conditioners, and refrigerating equipment. It also generates and distributes solar power; trades in coal and solar accessories; provides coal crushing and coal yard management services; and consultancy services, such as techo-commercial feasibility study for power evacuation systems, labor services for EPC contracts with respect to the solar business. The company was formerly known as Refex Refrigerants Limited and changed its name to Refex Industries Limited in November 2013. Refex Industries Limited was incorporated in 2002 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "RELIANCE.NS": {
        "short_name": "RELIANCE INDS",
        "long_name": "Reliance Industries Limited",
        "summary": "Reliance Industries Limited engages in the hydrocarbon exploration and production, petroleum refining and marketing, petrochemicals, retail, digital, and financial services worldwide. The company produces and markets petroleum products, such as liquefied petroleum gas, propylene, naphtha, gasoline, jet/aviation turbine fuel, kerosene oil, diesel, sulphur, petroleum coke, and alkylate. It also provides petrochemicals, such as high-density and low-density polyethylene, linear low density polyethylene, polypropylene, polyvinyl chloride, polyester yarn, polyester fibres, purified terephthalic acid, paraxylene, ethylene glycol, olefins, aromatics, linear alkyl benzene, butadiene, acrylonitrile, poly butadiene rubber, styrene butadiene rubber, caustic soda, and polyethylene terephthalate. In addition, the company explores, develops, and produces crude oil and natural gas; and operates various stores comprising neighbourhood, supermarket, hypermarket, wholesale cash and carry, specialty, and online stores, as well as stores that offer apparel, beauty and cosmetics, accessories, footwear, in-store salon, and a cafÃ©. As of March 31, 2020, it operated 11,784 retail stores. Further, it provides range of digital services under Jio brand name, as well as involved in the investment in telecom infrastructure business; provides non-banking financial services, insurance broking, and other services; offers fabrics, apparel, and auto furnishing products; and operates various television channels. Further, it operates news and entertainment portals, finance portals, fashion and lifestyle portals, and online ticket booking platforms; publishes magazines; and provides fleet management and highway hospitality services, as well as is involved in content asset monetization, filmed entertainment, and investment arm of Network18 businesses. The company was incorporated in 1973 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "RLI.F": {
        "short_name": "RELIANCE INDS GDR 144A/2",
        "long_name": "Reliance Industries Limited",
        "summary": "Reliance Industries Limited engages in the hydrocarbon exploration and production, petroleum refining and marketing, petrochemicals, retail, digital, and financial services worldwide. The company produces and markets petroleum products, such as liquefied petroleum gas, propylene, naphtha, gasoline, jet/aviation turbine fuel, kerosene oil, diesel, sulphur, petroleum coke, and alkylate. It also provides petrochemicals, such as high-density and low-density polyethylene, linear low density polyethylene, polypropylene, polyvinyl chloride, polyester yarn, polyester fibres, purified terephthalic acid, paraxylene, ethylene glycol, olefins, aromatics, linear alkyl benzene, butadiene, acrylonitrile, poly butadiene rubber, styrene butadiene rubber, caustic soda, and polyethylene terephthalate. In addition, the company explores, develops, and produces crude oil and natural gas; and operates various stores comprising neighbourhood, supermarket, hypermarket, wholesale cash and carry, specialty, and online stores, as well as stores that offer apparel, beauty and cosmetics, accessories, footwear, in-store salon, and a cafÃ©. As of March 31, 2020, it operated 11,784 retail stores. Further, it provides range of digital services under Jio brand name, as well as involved in the investment in telecom infrastructure business; provides non-banking financial services, insurance broking, and other services; offers fabrics, apparel, and auto furnishing products; and operates various television channels. Further, it operates news and entertainment portals, finance portals, fashion and lifestyle portals, and online ticket booking platforms; publishes magazines; and provides fleet management and highway hospitality services, as well as is involved in content asset monetization, filmed entertainment, and investment arm of Network18 businesses. The company was incorporated in 1973 and is based in Mumbai, India.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "city": "Mumbai"
    },
    "RLI.VI": {
        "short_name": "RELIANCE INDS-SPONS GDR 144A",
        "long_name": "Reliance Industries Limited",
        "summary": "Reliance Industries Limited engages in the hydrocarbon exploration and production, petroleum refining and marketing, petrochemicals, retail, digital, and financial services worldwide. The company produces and markets petroleum products, such as liquefied petroleum gas, propylene, naphtha, gasoline, jet/aviation turbine fuel, kerosene oil, diesel, sulphur, petroleum coke, and alkylate. It also provides petrochemicals, such as high-density and low-density polyethylene, linear low density polyethylene, polypropylene, polyvinyl chloride, polyester yarn, polyester fibres, purified terephthalic acid, paraxylene, ethylene glycol, olefins, aromatics, linear alkyl benzene, butadiene, acrylonitrile, poly butadiene rubber, styrene butadiene rubber, caustic soda, and polyethylene terephthalate. In addition, the company explores, develops, and produces crude oil and natural gas; and operates various stores comprising neighbourhood, supermarket, hypermarket, wholesale cash and carry, specialty, and online stores, as well as stores that offer apparel, beauty and cosmetics, accessories, footwear, in-store salon, and a cafÃ©. As of March 31, 2020, it operated 11,784 retail stores. Further, it provides range of digital services under Jio brand name, as well as involved in the investment in telecom infrastructure business; provides non-banking financial services, insurance broking, and other services; offers fabrics, apparel, and auto furnishing products; and operates various television channels. Further, it operates news and entertainment portals, finance portals, fashion and lifestyle portals, and online ticket booking platforms; publishes magazines; and provides fleet management and highway hospitality services, as well as is involved in content asset monetization, filmed entertainment, and investment arm of Network18 businesses. The company was incorporated in 1973 and is based in Mumbai, India.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "VIE",
        "market": "at_market",
        "country": "India",
        "city": "Mumbai"
    },
    "SELAN.NS": {
        "short_name": "SELAN EXPLORATION",
        "long_name": "Selan Exploration Technology Limited",
        "summary": "Selan Exploration Technology Limited explores for and produces crude oil and natural gas in India. It holds rights to develop oilfields situated in Bakrol and Lohar, Gujarat; and Ognaj oil field and Karjisan gas field in Gujarat. Selan Exploration Technology Limited was founded in 1985 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gurugram"
    },
    "SOUTHWEST.NS": {
        "short_name": "SOUTH WEST PINNACL",
        "long_name": "South West Pinnacle Exploration Limited",
        "summary": "South West Pinnacle Exploration Limited provides drilling, exploration, and allied services to coal, ferrous, nonferrous, and atomic and base metal mining; and water and unconventional energy industries in India. It offers coal and mineral exploration services, such as wireline core drilling, reverse circulation drilling, large diameter drilling, directional drilling; and coal bed methane exploration and production drilling services. The company also provides aquifer mapping services for hydro-geological companies; geological and geophysical, workover rig, and 2D/3D seismic exploration services; and integrated exploration services, including geophysical logging, surface geophysical, and topographic surveys, as well as geological field consultancy and allied services. It owns 34 operational rigs. The company was founded in 2006 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gurugram"
    },
    "UNIDT.NS": {
        "short_name": "United Drilling Tools Ltd",
        "long_name": "United Drilling Tools Limited",
        "summary": "United Drilling Tools Limited manufactures and sells wire line and well service equipment, gas lift equipment, downhole tools, and OD casing pipes and connectors worldwide. The company offers wireline winch units, including slimsplit, flyline, surveyline, truckline, landline, and wireline accessories; down hole tools, such as interchangeable sleeve stabilizers, integral blade stabilizers, rotary reamers, subs, and lifting subs and plugs; and fast make up high performance connectors. It also provides artificial gas lift equipment comprising wireline retrievable gas lift valves, orifice valves, side pocket mandrels, dummy and equalizing valves, latches, standing valves and seating nipples, running and pulling tools, conventional casing pressure operated gas lift valves, conventional tubing pressure operated gas lift valves, conventional check valves, and conventional gas lift mandrels. The company serves oil and gas industries. United Drilling Tools Limited was founded in 1985 and is headquartered in Noida, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    }
}