{
    "AAKASH.NS": {
        "short_name": "AAKASH EXPLORATION",
        "long_name": "Aakash Exploration Services Limited",
        "summary": "Aakash Exploration Services Limited provides support services for oil and gas extraction in India. It offers services using machineries, such as mobile work over rigs, hot oil circulation units, heating units, indirect bath heaters, mobile sucker rod pumping units, utility services for return lines, mobile steaming units, mobile high pressure air compressors, mobile high and low pressure pumping units, and FRAC/ insulated tanks. The company was founded in 2007 and is headquartered in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380005",
        "website": "http://www.aakashexploration.com",
        "market_cap": "Small Cap"
    },
    "ALPHAGEO.NS": {
        "short_name": "ALPHAGEO(INDIA)",
        "long_name": "Alphageo (India) Limited",
        "summary": "Alphageo (India) Limited offers geophysical seismic data acquisition, processing, and interpretation services for exploration of hydrocarbons and minerals in India and internationally. The company provides various services, including designing and preplanning of 2D/3D/4D/3C surveys; seismic data acquisition in 2D/3D/4D/3C; seismic data processing and reprocessing/special processing comprising pre-stack imaging, AVO inversion, etc.; and seismic data interpretation consisting of structural and stratigraphic interpretation, and evaluation of blocks for exploration, as well as generation, evaluation, and ranking of prospects. Its services also include consultancy on 3D/4D/3C surveys; API of EM and GM surveys; reservoir data acquisition and analysis; tape transcription and digitization of hard copies of maps, seismic sections, and well logs into CGM/SEGY/LAS formats; third party quality control for 2D/3D seismic data acquisition and processing; topographic surveys with GPS/RTK; Airborne surveys; and geophysical mapping surveys through gravity and magnetic methods for identification of potential areas from mineral prognostication point of view. In addition, the company offers onshore and offshore oil and gas field services; renting of drilling equipment and machinery; and marine and aerial geophysical services. Alphageo (India) Limited was incorporated in 1987 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500034",
        "website": "http://www.alphageoindia.com",
        "market_cap": "Small Cap"
    },
    "DEEPENR.NS": {
        "short_name": "DEEP ENE RESOURCES LTD",
        "long_name": "Deep Energy Resources Limited",
        "summary": "Deep Energy Resources Limited engages in the oil and gas exploration and production business India. It focuses on exploring oil and gas resources and coal bed methane, and related engineering solutions. The company was formerly known as Deep Industries Limited and changed its name to Deep Energy Resources Limited in September 2020. Deep Energy Resources Limited was founded in 1991 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380058",
        "website": "http://www.deepindustries.com",
        "market_cap": "Small Cap"
    },
    "JINDRILL.NS": {
        "short_name": "JINDAL DRILLING",
        "long_name": "Jindal Drilling & Industries Limited",
        "summary": "Jindal Drilling & Industries Limited provides drilling services to the oil and gas sector in India. It provides offshore drilling, horizontal and directional drilling, and mud logging services, as well as measurement while drilling services. The company was incorporated in 1983 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110005",
        "website": "http://www.jindal.com/jdil/index.html",
        "market_cap": "Small Cap"
    },
    "LIKHITHA.NS": {
        "short_name": "Likhitha Infrastruc Ltd",
        "long_name": "Likhitha Infrastructure Limited",
        "summary": "Likhitha Infrastructure Limited engages in laying, testing, and commissioning of oil and gas pipe lines in India. The company is also involved in laying of oil and gas supply pipe lines and irrigation canals, building bridges over the canals, and related maintenance works; and the provision of operations and maintenance services for city gas distribution companies. Likhitha Infrastructure Limited was founded in 1998 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500073",
        "website": "http://www.likhitha.co.in",
        "market_cap": "Small Cap"
    },
    "OILCOUNTUB.NS": {
        "short_name": "OIL COUNTRY TUBULR",
        "long_name": "Oil Country Tubular Limited",
        "summary": "Oil Country Tubular Limited manufactures and sells drill pipes and allied products, and oil country tubular goods and related services for the oil drilling and exploration industry in India and internationally. The company offers heavy weight drill pipes and drill collars, as well as tubing, casing, and high collapse casing products. It also provides accessories, such as lift plugs and subs, lifting bails, pup joints, rotary subs, sleeve stabilizers, tool joints, welded blade stabilizers, and couplings, as well as drill rods. In addition, the company offers services comprising tool joint hardfacing, tool joints make and break, internal plastic coating of drill pipe and tubing, drill pipe reconditioning, drill pipe re-threading, tubing and casing, and field inspection. Oil Country Tubular Limited was incorporated in 1985 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500001",
        "website": "http://www.octlindia.com",
        "market_cap": "Small Cap"
    },
    "SOUTHWEST.NS": {
        "short_name": "SOUTH WEST PINNACL",
        "long_name": "South West Pinnacle Exploration Limited",
        "summary": "South West Pinnacle Exploration Limited provides drilling, exploration, and allied services to coal, ferrous, nonferrous, and atomic and base metal mining; and water and unconventional energy industries in India. It offers coal and mineral exploration services, such as wireline core drilling, reverse circulation drilling, large diameter drilling, directional drilling; and coal bed methane exploration and production drilling services. The company also provides aquifer mapping services for hydro-geological companies; geological and geophysical, workover rig, and 2D/3D seismic exploration services; and integrated exploration services, including geophysical logging, surface geophysical, and topographic surveys, as well as geological field consultancy and allied services. It owns 34 operational rigs. The company was founded in 2006 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122003",
        "website": "http://www.southwestpinnacle.com",
        "market_cap": "Small Cap"
    },
    "UNIDT.NS": {
        "short_name": "United Drilling Tools Ltd",
        "long_name": "United Drilling Tools Limited",
        "summary": "United Drilling Tools Limited manufactures and sells wire line and well service equipment, gas lift equipment, downhole tools, and OD casing pipes and connectors worldwide. The company offers wireline winch units, including slimsplit, flyline, surveyline, truckline, landline, and wireline accessories; down hole tools, such as interchangeable sleeve stabilizers, integral blade stabilizers, rotary reamers, subs, and lifting subs and plugs; and fast make up high performance connectors. It also provides artificial gas lift equipment comprising wireline retrievable gas lift valves, orifice valves, side pocket mandrels, dummy and equalizing valves, latches, standing valves and seating nipples, running and pulling tools, conventional casing pressure operated gas lift valves, conventional tubing pressure operated gas lift valves, conventional check valves, and conventional gas lift mandrels. The company serves oil and gas industries. United Drilling Tools Limited was founded in 1985 and is headquartered in Noida, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201305",
        "website": "http://www.udtltd.com",
        "market_cap": "Small Cap"
    }
}