{
  "000820.SZ": {
    "city": "Nanjing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Shenwu Energy Saving Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "SHENWU ENERGY SAVI",
    "state": null,
    "summary": "Shenwu Energy Saving Co., Ltd. act as a technical proposal supplier and engineering contractor in the energy conservation, environmental protection, and utilization of resources. It engages in the treatment and recovery of solid wastes and dust in the steel industry; and smelting slags from the non-ferrous industry. The company is based in Nanjing, China.",
    "website": "http://www.sw-es.cn",
    "zipcode": "210019"
  },
  "002499.SZ": {
    "city": "Suzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Kelin Environmental Protection Equipment, Inc.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "KELIN ENVIRONMENTA",
    "state": null,
    "summary": "Kelin Environmental Protection Equipment, Inc. manufactures and sells environmental protection equipment in China. It offers bag filters, bag and electrical filters, desulfurization and denitration equipment, dry and wet electrostatic precipitators, ultra-high temperature filters, cyclone equipment, small filters, furnace shell equipment, cooling equipment, electrical and control equipment, conveying equipment, and auxiliary products. The company also provides EPC services. Its products are used in metallurgical, power, solid waste incineration, grain, building material, light industry chemical, non-ferrous metal, and other industries. The company was formerly known as Wujiang Baodai Dedusting Co., Ltd. and changed its name to Kelin Environmental Protection Equipment, Inc. in 2007. Kelin Environmental Protection Equipment, Inc. was founded in 1979 and is headquartered in Suzhou, China.",
    "website": "http://www.kelin-china.com",
    "zipcode": "215200"
  },
  "0586.HK": {
    "city": "Wuhu",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Pollution & Treatment Controls",
    "long_name": "China Conch Venture Holdings Limited",
    "market": "hk_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "CONCH VENTURE",
    "state": null,
    "summary": "China Conch Venture Holdings Limited, an investment holding company, provides energy preservation and environmental protection solutions in Mainland China, rest of Asia, Africa, and North America. The company operates through Energy Preservation and Environmental Protection Solutions, Port Logistics Services, and New Building Materials segments. It manufactures and sells residual heat power generation, vertical mill, waste incineration, and solid waste solutions, as well as offers related after sales services. The company also provides port logistics services, including cargo handling, trans-shipment, and warehousing services; and alternative wall building materials, such as cellulose fiber cement sheets, and autoclaved and wood wool cement boards. In addition, it designs and constructs energy preservation and environmental protection projects. China Conch Venture Holdings Limited was founded in 2013 and is headquartered in Wuhu, China.",
    "website": "http://www.conchventure.com",
    "zipcode": "241070"
  },
  "0807.HK": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Pollution & Treatment Controls",
    "long_name": "SIIC Environment Holdings Ltd.",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "SIICENVIRONMENT",
    "state": null,
    "summary": "SIIC Environment Holdings Ltd., an investment holding company, engages in the wastewater treatment, water supply, sludge treatment, solid waste incineration, and other environment related businesses primarily in the People's Republic of China. It operates through three segments: Water and Sludge Treatment; Water Supply; and Waste Incineration. The Water and Sludge Treatment segment constructs, manages, and operates water and sludge related infrastructure under service concession arrangements; and manages and operates water and sludge related infrastructure under non-service concession arrangements, as well as provides financial income under service concession arrangements. The Water Supply segment engages in the construction, management, and operation of water supply related infrastructure under service concession arrangements. The Waste Incineration segment constructs, manages, and operates waste incineration related infrastructure under service concession arrangements. The company has a portfolio of approximately 200 water treatment and supply projects, 8 waste incineration projects, and 10 sludge treatment projects in 19 municipalities and provinces in China. It also provides management and consultancy services; treats and supplies potable water; and installs water meters. The company was formerly known as Asia Water Technology Ltd. and changed its name to SIIC Environment Holdings Ltd. in November 2012. SIIC Environment Holdings Ltd. was incorporated in 2002 and is headquartered in Singapore.",
    "website": "http://www.siicenv.com",
    "zipcode": "039192"
  },
  "119650.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Pollution & Treatment Controls",
    "long_name": "KC Cottrell Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "KC COTTRELL",
    "state": null,
    "summary": "KC Cottrell Co., Ltd. engages in the research and development, engineering, construction, operation, supply, and post-management of environmental equipment and technology. It provides flue gas cleaning systems, dust collecting and desulfurization equipment, air quality control systems, dry electrostatic precipitators, wet electrostatic precipitators, bag filters, ash handling systems, tunnel ESPs, hybrid module type precipitators, wet flue gas desulfurization systems, gas suspension absorber systems, and dry sorbent injection systems. The company also offers selective catalytic reduction systems, VOC and odour control systems, exhaust gas cleaning systems, solar power systems, biomass and waste to energy systems, dampers, AQCS and industrial equipment, ESP casing systems, B/F casing systems, steel structure systems, round ducts, square ducts, hoppers, stacks, GGHs, tanks, gas scrubbers, wet ESP casing systems, gas cooler systems, VBF systems, and vessel scrubbers. In addition, it provides retrofit and maintenance services. KC Cottrell Co., Ltd. was founded in 1973 and is headquartered in Seoul, South Korea.",
    "website": "http://www.kc-cottrell.com",
    "zipcode": null
  },
  "1257.HK": {
    "city": "Admiralty",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Pollution & Treatment Controls",
    "long_name": "China Everbright Greentech Limited",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "CEB GREENTECH",
    "state": null,
    "summary": "China Everbright Greentech Limited, an investment holding company, engages in the design, construction, operation, and maintenance of integrated biomass and waste-to-energy projects in China. It is involved in the construction and operation of biomass direct combustion power generation projects, biomass heat supply projects, biomass electricity and heat cogeneration projects, waste-to-energy projects, and integrated biomass and waste-to-energy projects; and hazardous waste landfill projects, hazardous waste incineration projects, and physicochemical and resources recycling projects. The company is also involved in the environmental remediation for restoration of industrial contaminated sites, contaminated farmland, mines and landfills; treatment of industrial gas emission, oil sludge, river/lake sediments, and industrial sludge; and construction and operation of wetland parks, environmental stewardship services, and anti-seepage at landfill sites. In addition, it operates 7 solar energy projects and 2 wind power projects with a generation capacity of 125.9 megawatts for local power grid companies in Jiangsu Province, Anhui Province, Shanxi Province, and Germany. The company was founded in 2006 and is headquartered in Admiralty, Hong Kong. China Everbright Greentech Limited is a subsidiary of China Everbright Green Holdings Limited.",
    "website": "http://www.ebgreentech.com",
    "zipcode": null
  },
  "1296.HK": {
    "city": "Beijing",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Guodian Technology & Environment Group Corporation Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "GUODIAN TECH",
    "state": null,
    "summary": "Guodian Technology & Environment Group Corporation Limited provides environmental protection and energy conservation solutions, and renewable energy equipment manufacturing and services in the People's Republic of China. It operates through four segments: Environmental Protection, Energy Conservation Solutions, Wind Power Products and Services, and All Others. The Environmental Protection segment offers sulphur oxide and nitrogen oxide control technologies, desulphurization and denitrification facilities rental, ash removal with filer bag, and water treatment related technologies and products. The Energy Conservation Solutions segment offers energy saving products and services, including plasma and micro-oil ignition equipment; gas turbine improvement services; and energy-efficient power plants construction services. The Wind Power Products and Services segment produces and sells wind turbine and its components; and offers system solutions and services to wind power operators. The All Others segment generates wind and solar power; and sells other electric power control system related products. The company also offers desulphurization and other environmental protection engineering services; produces and sells selective catalytic reduction catalyst; constructs and operates water treatment projects; designs and installs sewage treatment equipment; researches, develops, and sells wind turbine technology; and provides energy conservation engineering services. In addition, it produces and sells steam turbines and other electric equipment, variable pitch control systems for wind turbine, and electric power related products; and researches and develops technology. The company was formerly known as Guodian Technology & Environment Group Limited Liability Company and was changed to Guodian Technology & Environment Group Corporation Limited. The company was founded in 2001 and is headquartered in Beijing, the People's Republic of China.",
    "website": "http://www.01296.hk",
    "zipcode": "100039"
  },
  "1452.HK": {
    "city": "Beijing",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Denox Environmental & Technology Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "DENOX ENV",
    "state": null,
    "summary": "Denox Environmental & Technology Holdings Limited, an investment holding company, designs, manufactures, and sells plate-type DeNOx catalysts in the People's Republic of China and internationally. The company sells its plate-type DeNOx catalysts to coal-fired power plants; engineering, procurement, and construction services providers; and boiler manufacturers. It also produces stainless steel mesh. In addition, the company develops catalysts for diesel-powered vehicles and vessels. Denox Environmental & Technology Holdings Limited was founded in 2010 and is headquartered in Beijing, the People's Republic of China.",
    "website": "http://www.china-denox.com",
    "zipcode": "100070"
  },
  "1527.HK": {
    "city": "Zhuji",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Zhejiang Tengy Environmental Technology Co., Ltd",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "TENGY ENV",
    "state": null,
    "summary": "Zhejiang Tengy Environmental Technology Co., Ltd, together with its subsidiaries, designs, develops, manufactures, installs, and sells environmental pollution prevention equipment and electronic products in Mainland China and internationally. The company offers electrostatic precipitators, bag filter precipitators, and electrostatic-bag composite precipitators. Its precipitators are installed at coal-fired power plants, metallurgical plants, paper mills, and other industrial production plants. The company also offers installation services. Its customers include project owners of power plants and industrial production plants, or contractors who undertake the construction work of power plants and industrial production plants. The company was founded in 2009 and is headquartered in Zhuji, China.",
    "website": "http://www.tengy.com",
    "zipcode": null
  },
  "1535.TW": {
    "city": "Kaohsiung",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Pollution & Treatment Controls",
    "long_name": "China Ecotek Corporation",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "CHINA ECOTEK",
    "state": null,
    "summary": "China Ecotek Corporation operates as an engineering company in Taiwan. The company provides planning, design, manufacturing, construction/installation, maintenance, and trading services for the steel industry; plans, designs, fabricates, and erects piping and vessels, and steel structures for plant buildings and facilities; and plans, designs, constructs/installs, and maintains instrumentation and electrical engineering projects. It also designs/constructs civil and structure engineering projects; designs, fabricates, constructs, and commissions air pollution control systems, such as bag house and electric static precipitators, De-SOx systems, De-NOx systems, and acid gas cleaning systems; plans, designs, installs, and maintains water treatment and recycling systems; and offers water treatment chemicals and firefighting systems. In addition, it is involved in the planning, design, construction, equipment procurement, installation, and validation of biotech and pharmaceutical plants; construction, operation, and maintenance of incineration plants; construction and maintenance of co-generation and power plants; undertaking of refractory works; sale and construction of fire resistance products; and equipment/materials trading activities. China Ecotek Corporation was founded in 1993 and is headquartered in Kaohsiung, Taiwan.",
    "website": "http://www.ecotek.com.tw",
    "zipcode": "80661"
  },
  "1MS.F": {
    "city": "Kista",
    "country": "Sweden",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Munters Group AB (publ)",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "MUNTERS GROUP AB B",
    "state": null,
    "summary": "Munters Group AB (publ) provides energy efficient air treatment and climate solutions for commercial and industrial applications in Sweden, the United States, Germany, China, and internationally. The company operates through two segments, AirTech and FoodTech. It offers air intakes/air inlets, temperature and humidity control products, coolers and humidifiers, dehumidifiers, fans and light traps, heaters, heat exchangers, mist eliminators, mass transfer equipment, and pollution control and VOC abatement products. The company also provides installation support, startup and commissioning, training, maintenance, rotor performance check, and reconditioning and repair services, as well as upgrades and spare parts, and rental solutions. It serves agriculture, automotive, chemical processing, construction, data center, defense and aerospace, education, electronics, food and beverage, general and production, greenhouse, healthcare, pharmaceutical, power generation and distribution, recreation and leisure, retail and supermarket, shipbuilding and marine, steel, temporary structure, and water and waste water; oil, gas, and petroleum; pulp, paper, and printing; and storage, preservation, and archives industries. Munters Group AB (publ) was founded in 1955 and is headquartered in Kista, Sweden.",
    "website": "http://www.munters.com",
    "zipcode": "164 26"
  },
  "2014.HK": {
    "city": "Shanghai",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Ozner Water International Holding Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "OZNER WATER",
    "state": null,
    "summary": "Ozner Water International Holding Limited, an investment holding company, engages in the water purification, air sanitization, supply chain, and other businesses in the People's Republic of China. The company's Water Purification segment sells and leases water purification machines; and provides training services to distributors. The Air Sanitisation segment engages in the provision of air sanitization construction, and related consulting and training services; and sale of air sanitization products. The Supply Chain segment sells micro motor products. The Other segment provides financing services in lending loans to distributors. It is also involved in the development and manufacture of water purification and air sanitization products, as well as micro motor products; and provision of finance leasing/leasing/factoring, and water purifying services. Ozner Water International Holding Limited was incorporated in 2013 and is headquartered in Shanghai, the People's Republic of China.",
    "website": "http://www.ozner.net",
    "zipcode": null
  },
  "2377.HK": {
    "city": "Beijing",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Pollution & Treatment Controls",
    "long_name": "China Boqi Environmental (Holding) Co., Ltd.",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "BOQI ENV",
    "state": null,
    "summary": "China Boqi Environmental (Holding) Co., Ltd., an investment holding company, offers flue gas treatment services and environmental protection solutions in the People's Republic of China and internationally. The company operates through Environmental Protection Facility Engineering (EPC), Operation and Maintenance (O&M), Build-Operate-Transfer (BOT) & Transfer-Operate-Transfer (TOT), and Others segments. The EPC segment offers project engineering and design, equipment and materials procurement, project construction, and equipment installment and testing services. The O&M segment provides operation and regular maintenance services for the desulfurization, denitrification, and dust removal facilities. The BOT & TOT segment engages in the construction of infrastructure or acquisition of existing infrastructure from grantor, operation and maintenance of flue gas treatment projects to the concession contract, and transferring the ownership of the infrastructure to the grantor. The Others segment sells by-products and others. It also engages in the provision of technical support, facilities testing, and spare parts replacement services. In addition, the company sells coal and chemicals; and offers technology and exploration services. China Boqi Environmental (Holding) Co., Ltd., was incorporated in 2015 and is headquartered in Beijing, the People's Republic of China.",
    "website": "http://www.chinaboqi.com",
    "zipcode": null
  },
  "2MW.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "METAWATER Co., Ltd.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "METAWATER CO.LTD",
    "state": null,
    "summary": "METAWATER Co., Ltd. designs and constructs equipment for water treatment plants, sewage treatment plants, and waste treatment facilities in Japan and internationally. The company also designs, manufactures, and sells various devices; implements repair work; and installs machine and equipment, and telecommunication work, as well as provision for services, including operation management. In addition, it offers civil engineering, building, electrical, plumbing, tile, brick, and block works; and provides water and sewage, and sanitation facilities works. The company was founded in 2007 and is headquartered in Tokyo, Japan.",
    "website": "http://www.metawater.co.jp",
    "zipcode": "101-0041"
  },
  "300137.SZ": {
    "city": "Shijiazhuang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Hebei Sailhero Environmental Protection High-tech Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "HEBEI SAILHERO ENV",
    "state": null,
    "summary": "Hebei Sailhero Environmental Protection High-tech Co.,Ltd researches, develops, manufactures, and sells online and automatic environmental monitoring instruments in China. It offers ambient air monitoring and early warning systems, surface and underground water monitoring systems, drinking water monitoring and early warning systems, acid rain online monitoring systems, and pollution source online monitoring systems, as well as emergency monitoring, decision-making, and command systems. The company also provides operation services for environmental monitoring instruments. Hebei Sailhero Environmental Protection High-tech Co.,Ltd was founded in 1996 and is based in Shijiazhuang, China.",
    "website": "http://www.sailhero.com",
    "zipcode": "050035"
  },
  "300152.SZ": {
    "city": "Baoding",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Xiongan Kerong Environment Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "XIONGAN KERONG ENV",
    "state": null,
    "summary": "Xiongan Kerong Environment Technology Co., Ltd. designs, manufactures, and sells boiler ignition and combustion sets of equipment and control systems. It operates water conservancy and water environment governance, ecological environment governance, energy-saving combustion, thermal power cogeneration and engineering, distributed energy management, solid waste treatment, soil governance, environmental monitoring, clean combustion, and integrated environmental governance businesses. The company was formerly known as Xuzhou Kerong Environmental Resources Co., Ltd. and changed its name to Xiongan Kerong Environment Technology Co., Ltd. in July 2019. The company was founded in 1980 and is based in Baoding, China.",
    "website": "http://www.kre.cn",
    "zipcode": null
  },
  "300272.SZ": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Canature Health Technology Group Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "CANATURE HEALTH TE",
    "state": null,
    "summary": "Canature Health Technology Group Co., Ltd. manufactures and sells residential and commercial water treatment systems and components worldwide. It provides control valves, pressure tanks, water softeners, water filters, reverse osmosis products, brine tanks, and commercial and industrial water systems. The company sells its products under the Canature brand name. The company was formerly known as Shanghai Canature Environmental Products Co., Ltd. and changed its name to Canature Health Technology Group Co., Ltd. in July 2018. Canature Health Technology Group Co., Ltd. was founded in 2001 and is based in Shanghai, the People's Republic of China.",
    "website": "http://www.canature-global.com",
    "zipcode": "201299"
  },
  "300425.SZ": {
    "city": "Chengdu",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Cscec Scimee Sci. and Tech. Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "CSCEC SCIMEE SCI&T",
    "state": null,
    "summary": "Cscec Scimee Sci. and Tech. Co., Ltd. develops environment protection equipment in China. The company offers magnetic separation water purification equipment in metallurgy, coal, river, oil, car, sanitation, sludge treatment, and other fields. It also engages in sludge treatment activities. The company was formerly known as Scimee Sci.&Tech. Co.,Ltd and changed its name to Cscec Scimee Sci. and Tech. Co., Ltd. in October 2019. Cscec Scimee Sci. and Tech. Co., Ltd. was founded in 2002 and is based in Chengdu, China.",
    "website": "http://www.scimee.com",
    "zipcode": "610045"
  },
  "300664.SZ": {
    "city": "Yixing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Penyao Environmental Protection Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "PENGYAO ENVIRONMEN",
    "state": null,
    "summary": "Penyao Environmental Protection Co., Ltd. engages in the environmental protection equipment business in China. It manufactures and sells sewage treatment, water purification, environmental protection, and sludge treatment and disposal equipment. The company was founded in 1984 and is headquartered in Yixing, China.",
    "website": "http://www.penyao.com.cn",
    "zipcode": "214214"
  },
  "300929.SZ": {
    "city": "Maanshan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Anhui Huaqi Environmental Protection Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "ANHUI HUAQI ENVIRO",
    "state": null,
    "summary": "Anhui Huaqi Environmental Protection Technology Co., Ltd. offers sewage treatment plants. It engages in the technical research of biological aerated filter, engineering design, EPC, pollution control facility operation, BOT investment, and development and production of the matched products. It provides integrated sewage treatment equipment; vehicle-mounted treatment equipment; decontamination desanding products comprising micro-filter for BAFrotary and BAF special microfiltration machine-flat; methanol dosing; and BAF pool equipment. The company was founded in 2002 and is based in Maanshan, China.",
    "website": "http://www.hqhb.com",
    "zipcode": "243061"
  },
  "39J.F": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Sinotrans Shipping Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "LIQTECH INTL INC. DL-,001",
    "state": null,
    "summary": "Sinotrans Shipping Limited, a shipping company, owns, manages, and operates dry bulk and container fleet worldwide. It operates through Dry Bulk Shipping, Container Shipping, and Others segments. The company is involved in dry bulk vessel time chartering and cargo voyage chartering businesses; container vessel time chartering, container line service, freight forwarding, and other related businesses; and shipping agency, ship management, and liquefied natural gas shipping business. Its dry bulk fleet is used for the transportation of bulk cargoes, such as iron ore, coal, grains, steel, and other break-bulk cargoes. The company also provides agency services for shipping forwarding and air cargo. As of December 31, 2017, it controlled a fleet of 113 vessels, including 36 dry bulk vessels with an aggregate capacity of approximately 3.37 million deadweight tons and 14 container vessels with an aggregate capacity of 16,733 twenty-foot equivalent unit. The company was founded in 2003 and is headquartered in Wan Chai, Hong Kong. Sinotrans Shipping Limited operates as a subsidiary of Sinomarine Limited",
    "website": "http://www.sinotranship.com",
    "zipcode": null
  },
  "3EN.F": {
    "city": "Guelph",
    "country": "Canada",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Current Water Technologies Inc.",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "CURRENT WATER TECHS",
    "state": "ON",
    "summary": "Current Water Technologies Inc. develops environmental technologies in Canada, Europe, Asia, and the United States. The company provides patented and proprietary technologies for the treatment of waste water and drinking water that are contaminated by metals or nutrients, such as arsenic and nitrate/ammonia associated with the mining, metal processing, chemical, agricultural, municipal, and waste management sectors; and for the recovery of nickel and other valuable metals from waste mill sulphide tailings associated with the mining sector. Its technologies comprise electro-static deionization, a electrochemical process that lowers the concentration of total dissolved solids in water; ammonia removal technology, a technology used for the removal of dissolved ammonia from industrial and municipal water, including wastewater, storm water, sewage effluent, and mine waste water; NitrEL system, an electrochemical water treatment process that reduces nitrate concentrations in contaminated drinking water, groundwater, and industrial process wastewater streams; AmdEl an electrochemical system that prevents the oxidation of sulphide minerals in tailings or waste rock; and ExtrEL for the recovery of metals from sulphide tailings and ore. The company was formerly known as ENPAR Technologies Inc. and changed its name to Current Water Technologies Inc. in January 2018. Current Water Technologies Inc. was incorporated in 1996 and is headquartered in Guelph, Canada.",
    "website": "http://www.currentwatertechnologies.com",
    "zipcode": "N1G 4P5"
  },
  "4556.TWO": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Bright Sheland International Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "BRIGHT SHELAND INTERNATIONAL CO",
    "state": null,
    "summary": "Bright Sheland International Co., Ltd. researches, develops, manufactures, markets, and sells industrial filtration and separation systems under the Filtrafine brand in Taiwan and internationally. The company offers melt-blown, wound-fine, activated carbon, membrane, high flow, and glass fiber filter cartridges, as well as pleated cartridges; and plastic-type, single round, single-bag, multi-bag, sanitary, high flow, and multi-round filter housings. It also provides filter bags and bag filter housings; modular bag housing skids; and UV disinfection and TOC reduction units, and spare parts, as well as technical support and after-sales services. The company serves chemical processing, microelectronics industry, oil and gas filtration, water treatment, food and beverage industry, and pharmaceutical industry sectors. Bright Sheland International Co., Ltd. was founded in 1985 and is based in New Taipei City, Taiwan.",
    "website": "http://www.filtrafine.com.tw",
    "zipcode": "22101"
  },
  "46Q.F": {
    "city": "Chestnut Ridge",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "BioHiTech Global, Inc.",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "BIOHITECH GLOBAL DL-,0001",
    "state": "NY",
    "summary": "BioHiTech Global, Inc., through its subsidiaries, provides technological, biological, and mechanical engineering solutions of organic and municipal waste worldwide. Its suite of technologies includes on-site biological processing equipment for food waste, patented processing facilities for the conversion of municipal solid waste into renewable fuel, and proprietary real-time data analytics tools to reduce food waste generation. The company also markets Revolution Series Digesters, an aerobic digestion technology solution for the disposal of food waste at the point of generation; and High Efficiency Biological Treatment Resource Recovery Technology to process waste at the municipal or enterprise level. In addition, it offers BioHiTech Cloud and Cirrus mobile applications for digester customers. Its principal customers include producers of food waste. The company serves healthcare, grocery, prison, retail food service, education, and hospitality sectors, as well as food distributors, convention centers, hotels, restaurants, stadiums, municipalities and academic institutions, and stadiums. BioHiTech Global, Inc. is headquartered in Chestnut Ridge, New York.",
    "website": "http://www.biohitech.com",
    "zipcode": "10977"
  },
  "4CC.F": {
    "city": "Seattle",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "ClearSign Technologies Corporation",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "CLEARSIGN TECHNO.DL-,0001",
    "state": "WA",
    "summary": "ClearSign Technologies Corporation designs and develops products and technologies to enhance operational performance, energy efficiency, emission reduction, safety, and overall cost-effectiveness of industrial and commercial systems in the United States and the People's Republic of China. Its ClearSign Core Burner Technology consists of an industrial burner body and a downstream porous ceramic structure or metal flame stabilizing device; ClearSign Core Plug & Play technology provides direct burner replacement for traditional refinery process heaters; and ClearSign Eye Flame Sensor, an electrical flame sensor for industrial applications. The company also provides ClearSign Core Boiler Burner; and ClearSign Core Flaring Burners technologies. It serves energy, institutional, commercial and industrial boiler, chemical, and petrochemical industries. The company was formerly known as ClearSign Combustion Corporation and changed its name ClearSign Technologies Corporation in November 2019. ClearSign Technologies Corporation was incorporated in 2008 and is headquartered in Seattle, Washington.",
    "website": "http://www.clearsign.com",
    "zipcode": "98168"
  },
  "4SVE.F": {
    "city": "White Plains",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Fluence Corporation Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "FLUENCE CORP. LTD",
    "state": "NY",
    "summary": "Fluence Corporation Limited provides water and wastewater treatment, and reuse solutions for the municipal, commercial, and industrial markets worldwide. The company offers NIROBOX for desalination of seawater and brackish water, as well as for the treatment of fresh and wastewater; NIROFLEX systems for desalination; ultrafiltration systems; and reverse osmosis systems. It also provides wastewater treatment products, such as Aspiral, a wastewater treatment solution; SUBRE membrane aerated biofilm reactor modules; EcoBox water reuse systems; Tipton packaged wastewater treatment plants; aeration equipment comprising aerators, mixers, and diffusers; and dissolved air flotation systems. In addition, the company offers food processing and recovery solutions; and waste-to-energy solutions. Further, it provides project finance, Smart Operations data analytics software, and after-sale support services. Fluence Corporation Limited was founded in 2017 and is headquartered in White Plains, New York.",
    "website": "http://www.fluencecorp.com",
    "zipcode": "10606"
  },
  "4YQ.F": {
    "city": "Zola Predosa",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "GVS S.p.A.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "GVS S.P.A.",
    "state": "BO",
    "summary": "GVS S.p.A., together with its subsidiaries, produces and sells plastic filters and components for healthcare, life science, automotive, appliance, safety, and commercial and industrial filtration applications in Italy and internationally. It offers health care products, such as healthcare gas/air and liquid filtration products for anesthesia, surgery insufflation, ventilation, blood filtration, transfusion, infusion, and hemodialysis; and syringe and capsule filters, liquid sample microbiology products, and protein microarray products, as well as microporous filtration, protein transfer, and nucleic acid binding membranes for laboratory solutions. The company also offers automotive products, including fuel and diesel injector, ABS/ESP-braking, steering and transmission, fuel tank, and SCR technology-urea filters, as well as ventilation membranes and throttle bodies; and sheet and panel filters, bag and cartridge filters, HEPA and high capacity HEPA products, carbon and molecular filtration products, and accessories and housings for commercial and industrial applications. In addition, it provides cylinder and conical, circular, radial or standard, square or rectangular, and pad and pre-filters for use in appliances; respiratory safety and bio-safety products for personal protection applications; and OEM membranes comprising polyethersulfone, polycarbonate track etched, polyester track etched, polyvinylidene difluoride, nylon, nitrocellulose, cellulose acetate, and rigenerated cellulose membranes. GVS S.p.A. was formerly known as GVS S.r.l. and changed its name to GVS S.p.A. in 20001. The company was founded in 1979 and is based in Zola Predosa, Italy. GVS S.p.A. operates as a subsidiary of GVS Group S.p.A.",
    "website": "http://www.gvs.com",
    "zipcode": "40069"
  },
  "5292.TWO": {
    "city": "Zhongli",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Desiccant Technology Corporation",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "DTC",
    "state": null,
    "summary": "Desiccant Technology Corporation, through its subsidiary, Shanghai Huajing Environmental Protection and Energy Saving Equipment Limited Company, produces and sells air purification and treatment equipment, plastic processing peripherals equipment, energy-saving equipment, and spare parts. The company was founded in 1978 and is headquartered in Zhongli, Taiwan.",
    "website": "http://www.dtech.com.tw",
    "zipcode": "320"
  },
  "52G.F": {
    "city": "Burnaby",
    "country": "Canada",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Greenlane Renewables Inc.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "GREENLANE RENEWABLES INC.",
    "state": "BC",
    "summary": "Greenlane Renewables Inc. designs, develops, sells, and services a range of biogas upgrading systems worldwide. The company's systems remove impurities and separate carbon dioxide from biomethane in the raw biogas created from anaerobic decomposition of organic waste at landfills, wastewater treatment plants, and farms and for injection food waste facilities into the natural gas grid or for direct use as vehicle fuel. It offers water wash, pressure swing adsorption, and membrane separation technologies. The company markets and sells its upgrading systems under the Greenlane Biogas brand. The company was formerly known as Creation Capital Corp. and changed its name to Greenlane Renewables Inc. in June 2019. Greenlane Renewables Inc. was founded in 1986 and is headquartered in Burnaby, Canada.",
    "website": "http://www.greenlanerenewables.com",
    "zipcode": "V5G 4X5"
  },
  "5GD.SI": {
    "city": "Nanjing",
    "country": "China",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Sunpower Group Ltd.",
    "market": "sg_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Sunpower",
    "state": null,
    "summary": "Sunpower Group Ltd. provides environmental protection solutions in the People's Republic of China, Canada, the United States, Asia, South East Asia, the Middle East, and Europe. The company operates through two segments, Manufacturing & Services and Green Investments. The Manufacturing & Services segment designs, researches, develops, and manufactures heat exchangers and pressure vessels that are used for completing the reaction, heat transfer, separation, and storage processes of industrial production; and pipeline energy saving products, such as steam distribution pipelines, pipe and spring supports, and hangers that provide heat isolation from environmental temperature changes and minimize temperature loss during transmission. This segment also offers heat pipes and heat pipe exchangers that are used in the petrochemical, steel and chemical industries; heat pipes, which are used in the construction of roads, railways, and oil pipelines; and related environmental protection products. It also offers flare and flare gas recovery systems to recover petrochemical by-products from flare or waste gas; zero liquid discharge systems for high salinity wastewater; and petrochemical engineering, which provides sulfur recovery solutions, skid-mounted equipment, and formaldehyde devices; waste heat recovery and pipeline energy saving engineering solutions; and thermal power engineering comprising engineering, procurement, and construction services for thermal power projects. The Green Investments segment invests, develops, and operates centralized steam, heat, and electricity cogeneration plants. The company also installs and commissions various projects; provides design, technical and consultation, technology, sales, and after-sale services; produces and sells foam glass products; researches new energy-saving materials; and supplies heat and electricity to enterprises. Sunpower Group Ltd. was founded in 1997 and is headquartered in Nanjing, the People's Republic of China.",
    "website": "http://www.sunpower.com.cn",
    "zipcode": "211112"
  },
  "600388.SS": {
    "city": "Longyan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Fujian Longking Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "FUJIAN LONGKING CO LTD",
    "state": null,
    "summary": "Fujian Longking Co., Ltd. manufactures and sells air pollution protection equipment worldwide. The company's products include flue gas dust collection, FGD, SNCR, bulk material conveying, and electrical control equipment, as well as package solutions for flue gas pollutants. Its products are used in various industries, including electric power, metallurgy, building materials, light industry, and chemical industry. The company exports its products to 40 countries and regions, including Japan, Russia, Brazil, Thailand, Philippine, Indonesia, Iran, Serbia, and Turkey. Fujian Longking Co., Ltd. was founded in 1971 and is based in Longyan, China.",
    "website": "http://www.longking.com.cn",
    "zipcode": "364000"
  },
  "6013.T": {
    "city": "Amagasaki",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Takuma Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "TAKUMA CO LTD",
    "state": null,
    "summary": "Takuma Co., Ltd. engages in the design, construction, and superintendence of various boilers, plant machineries, pollution prevention and environmental equipment plants, heating and cooling equipment, and feed water/drainage sanitation equipment and facilities in Japan and internationally. It operates through four segments: Domestic Environment and Energy Business, Overseas Environment and Energy Business, Package Boiler Business, and Equipment and System Business. The Domestic Environment and Energy segment offers general waste treatment, industrial waste treatment, waste recycling, wastewater treatment, sludge combustion, and biomass power plants, as well as gas turbine cogeneration systems. The Overseas Environment and Energy Business segment provides waste combusting and biomass power plants. The Package Boiler segment offers compact through-flow boilers and vacuum water heating systems. The Equipment and System Business segment provides construction equipment, and equipment for semiconductor industry and cleaning systems. It is also involved in the design, construction, and superintendence of civil, architecture, and other works. The company was formerly known as Takuma Boiler Manufacturing Co., Ltd. and changed its name to Takuma Co., Ltd. in 1972. Takuma Co., Ltd. was founded in 1915 and is headquartered in Amagasaki, Japan.",
    "website": "http://www.takuma.co.jp",
    "zipcode": "660-0806"
  },
  "603177.SS": {
    "city": "Shaoxing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Zhejiang Tuna Environmental Science & TechnologyCo.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "ZHEJIANG TUNA ENVIRONMENTAL SCI",
    "state": null,
    "summary": "Zhejiang Tuna Environmental Science & TechnologyCo.,Ltd. engages in the research and development, manufacture, and turnkey contract of flue gas purification technologies in China and internationally. The company undertakes engineering projects, such as wet lime-stone, semi-dry, and ammonia flue gas desulphurization, as well as SCR flue gas denitration, bag\\electric precipitator, and other projects on EPC and BOT basis. It also offers desulfurization products, including MST series wet-type limestone ball mills, rubber lined pipes, TBF-DU belt type vacuum filters, TLD single-shaft double louver series dampers, TME mist eliminators, and TSP-I spray banks; dedusting equipment comprising wet electro-static precipitators and electric-bag composite dust collectors, as well as dry dust remover technology; and cellular and plate catalysts. The company was founded in 2005 and is headquartered in Shaoxing, China.",
    "website": "http://www.zj-tuna.com",
    "zipcode": "312000"
  },
  "603200.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Shanghai Emperor of Cleaning Hi-Tech Co., Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "SHANGHAI EMPEROR OF CLEANING HI",
    "state": null,
    "summary": "Shanghai Emperor of Cleaning Hi-Tech Co., Ltd provides water treatment and air duct cleaning services. It offers process water, sewage, boiler water, circulating water, and other water treatment services for various industries, such as iron and steel metallurgy, petrochemical, pulp and paper, automobile manufacturing, electronics, and medicine; and civil water treatment technology services, including commercial air conditioning water treatment, rainwater harvesting, water reuse, landscape water treatment, and water saving services in commercial buildings, airport stations, urban complexes, etc. The company's duct cleaning services comprise central air-conditioning duct cleaning and disinfection, closed space environment disinfection, and other services for hotel business buildings, airport, high-speed rail stations, urban complexes, and other places. Shanghai Emperor of Cleaning Hi-Tech Co., Ltd was founded in 1994 and is based in Shanghai, China.",
    "website": "http://www.china-xiba.com",
    "zipcode": "200437"
  },
  "603408.SS": {
    "city": "Xiamen",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Runner (Xiamen) Corp.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "RUNNER (XIAMEN) CORP",
    "state": null,
    "summary": "Runner (Xiamen) Corp. manufactures and sells kitchen and bathroom, water purification, fresh air purification, health care, and other home furnishing produts in China and internationally. It offers faucets, showers, bathroom accessories, showerdoors, and toilet parts; household, commercial, whole house, and replacement filters; and wall mount fresh air ventilation systems, cabinet type fresh air ventilation systems, fresh air ventilation systems, and empty machine series. The company also provides gerontic care and health care products; and intelligent equipment and auto parts. Runner (Xiamen) Corp. was founded in 1990 and is headquartered in Xiamen, China.",
    "website": "http://runner-corp.com",
    "zipcode": "361021"
  },
  "603686.SS": {
    "city": "Longyan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Fujian Longma Environmental Sanitation Equipment Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "FUJIAN LONGMA ENVIR SANITATION ",
    "state": null,
    "summary": "Fujian Longma Environmental Sanitation Equipment Co., Ltd. manufactures sanitation equipment in China. The company offers road cleaning equipment, such as road sweepers, vacuum sweepers, road washing and cleaning trucks, sprinklers, high-pressure sprinklers, multi-functional dust suppression trucks, pavement maintaining trucks, guardrail cleaning trucks, sewer dredging and cleaning trucks, and snow sweepers. It also provides garbage transfer equipment, including suction-type sewer, compression garbage, dock with self-discharging garbage, detachable container garbage, kitchen garbage, self-loading and discharging garbage trucks, as well as garbage compression and transfer stations, garbage bin carriers, and movable refuse compactor. In addition, the company offers waste disposal equipment; EV power products; and road cleaning and garbage transfer spare parts, as well as municipal services. Further, it is involved in various activities comprising city cleaning, garbage collecting and transferring, public toilet operating, landscaping, etc. The company markets its products under the FULONGMA brand. Fujian Longma Environmental Sanitation Equipment Co., Ltd. is headquartered in Longyan, China.",
    "website": "http://www.fjlm.com.cn",
    "zipcode": "364012"
  },
  "6328.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Ebara Jitsugyo Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "EBARA JITSUGYO CO",
    "state": null,
    "summary": "Ebara Jitsugyo Co.,Ltd. manufactures and sells environment and related products in Japan. It is also involved in the engineering operations for waterworks and sewerage. In addition, the company sells various industrial machines, such as a pump and air-conditioning/heating and cooling equipment, etc. Ebara Jitsugyo Co.,Ltd. was founded in 1946 and is headquartered in Tokyo, Japan.",
    "website": "http://www.ejk.co.jp",
    "zipcode": "104-8174"
  },
  "6332.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Tsukishima Kikai Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "TSUKISHIMA KIKAI CO",
    "state": null,
    "summary": "Tsukishima Kikai Co., Ltd. provides systems and plant facilities for the industry, water, and wastewater facilities in Japan, rest of Asia, and internationally. The company's Water Environmental Business segment designs, manufactures, and sells equipment and machinery used in water purification plants and wastewater treatment plants. This segment is also involved in the private finance initiatives and design-build-operate businesses; design, construction, operation, and maintenance of water purification plants and wastewater treatment plants; and generation of electric power in wastewater treatment plants. Its Industrial Business segment designs and constructs chemical plants, iron and steel plants, food plants, waste liquid plants, wastewater plants, solid waste treatment plants, etc.; and designs, manufactures, and sells process equipment. This segment also engages in the industrial general waste treatment business. The company was formerly known as Tokyo Tsukishima Kikai Seisakusho and changed its name to Tsukishima Kikai Co., Ltd. in May 1917. Tsukishima Kikai Co., Ltd. was founded in 1905 and is headquartered in Tokyo, Japan.",
    "website": "http://www.tsk-g.co.jp",
    "zipcode": "104-0053"
  },
  "6368.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Organo Corporation",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "ORGANO CORP",
    "state": null,
    "summary": "Organo Corporation operates as a water treatment engineering company in Japan and internationally. The company operates through two segments, Water Treatment Engineering Business Unit and Performance Products Business Unit. It offers pure water systems, such as reverse osmosis (RO) systems, regenerative automatic and manual pure water systems, electric regeneration pure water systems, desktop-type pure water systems, cabinet-type pure water systems, electrode ionization high-purity water systems, cartridge water purifiers, and 2-stage RO systems; ultrapure water systems, including desktop and cabinet-type ultrapure water systems, and final polishing unit; and other equipment comprising alkaline electrolyzed water production equipment, homogenizers, electro conductivity meters, resistivity meters, and ion exchange filters. The company also provides water, wastewater, and RO water treatment chemicals; industrial filters consisting of micro filter, sanitary, polypropylene, and plastic housings, as well as micro, RO wound, PF cartridge, capsule, and PF carbon; and commercial water purifiers. In addition, it offers ultrapure and multi-functional water production systems, wastewater treatment systems, valuable resource recovery systems, and organic solvent refining systems for the electronics industry; water supply and sewage treatment facilities; purified water production and supply systems, UF water production and supply systems, and water for injection production and supply systems, as well as pharmaceutical water system consulting services; condensate filter, condensate demineralizer, reactor water cleanup, fuel pool cleanup, makeup water, and waste water treatment systems; and sugar refining systems and equipment. The company was formerly known as Japan Organo Co., Ltd. and changed its name to Organo Corporation in 1966. Organo Corporation was founded in 1946 and is headquartered in Tokyo, Japan.",
    "website": "http://www.organo.co.jp",
    "zipcode": "136-8631"
  },
  "6370.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Kurita Water Industries Ltd.",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "KURITA WATER INDUSTRIES",
    "state": null,
    "summary": "Kurita Water Industries Ltd. provides various water treatment solutions in Japan, rest of Asia, North America, Europe, the Middle East, Africa, and internationally. The Water Treatment Chemicals segment offers boiler water treatment chemicals, cooling water treatment chemicals, wastewater treatment chemicals, process treatment chemicals, reverse osmosis membrane water treatment chemicals, automobile paint booth chemicals, biomass generation related chemicals, civil engineering and construction related chemicals, marine vessel related water treatment chemicals, chemical dosing systems/chemical dosing control systems, and packaged contract services. The Water Treatment Facilities segment offers water treatment equipment and facilities; ultrapure water supply, tool cleaning, chemical cleaning, and soil and groundwater remediation services; and maintenance services. This segment also provides ultrapure water production systems, wastewater reclamation systems, and wastewater treatment systems and equipment. The company also offers soil and groundwater contamination remediation, plant facilities cleaning, and precision tool cleaning services, as well as water treatment equipment for professional use, products for general household's, and swimming pool-related equipment. Kurita Water Industries Ltd. was founded in 1949 and is headquartered in Tokyo, Japan.",
    "website": "http://www.kurita.co.jp",
    "zipcode": "164-0001"
  },
  "6489.T": {
    "city": "Kawaguchi",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Maezawa Industries, Inc.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "MAEZAWA INDUSTRIES INC",
    "state": null,
    "summary": "Maezawa Industries, Inc. designs, manufactures, sells, and installs equipment and apparatus for water supply and sewage systems in Japan and internationally. It offers valve products, such as gate, control, butterfly, check, eccentric, air, hydrant, maintenance, emergency shutoff, and sluice gate and weir valves; and environmental systems, including water purification and sewage treatment soil purification systems, as well as system consultation services. The company also provides water supply systems consisting of hybrid MF membrane systems; water purification systems, such as advanced oxidation systems, membrane filtration systems, and water intake and sedimentation equipment; wastewater treatment systems comprising oxidation ditch nitrogen removal systems, membrane bioreactors, and LANDOX OD systems, as well as multi mesh screens; and industrial environment products that comprise UF membrane filtration equipment, PTFE membranes with activated carbon powder for water reuse, and dissolved air floatation equipment, as well as chelate fiber. Maezawa Industries, Inc. was founded in 1937 and is headquartered in Kawaguchi, Japan.",
    "website": "http://www.maezawa.co.jp",
    "zipcode": "332-8556"
  },
  "6788.T": {
    "city": "Osaka",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Nihon Trim Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "NIHON TRIM CO LTD",
    "state": null,
    "summary": "Nihon Trim Co., Ltd. develops and sells electrolyzed hydrogen water systems in Japan and internationally. The company also offers cartridges and electrolyzed hydrogen water apparatuses for agriculture and livestock industries, as well as households; and electrolyzed water hemodialysis systems for medical care. In addition, it manufactures and sells bottled water; and undertakes research and development works of electrolyzed hydrogen water. Nihon Trim Co., Ltd. was founded in 1982 and is headquartered in Osaka, Japan.",
    "website": "http://www.nihon-trim.co.jp",
    "zipcode": "530-0001"
  },
  "688069.SS": {
    "city": "Wuxi",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Wuxi Delinhai Environmental Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "WUXI DELINHAI ENVIRONMENTA TECH",
    "state": null,
    "summary": "Wuxi Delinhai Environmental Technology Co., Ltd. engages in the cyanobacteria treatment technology business in China. It develops, sells, integrates, operates, and maintains cyanobacteria treatment equipment for the treatment of lake and reservoir cyanobacteria blooms; and the prevention and control of cyanobacteria blooms. The company was founded in 2009 and is based in Wuxi, China.",
    "website": "http://www.wxdlh.com",
    "zipcode": null
  },
  "688309.SS": {
    "city": "Jinan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Niutech Environment Technology Corporation",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "NIUTECH ENVIRONMENT TECHNOLOGY ",
    "state": null,
    "summary": "Niutech Environment Technology Corporation engages in the research and development, production, and sale of environment protection equipment worldwide. It offers tire to oil, plastic to oil, oil purification, CB processing, biomass pyrolysis, and oil sludge systems. The company is based in Jinan, China.",
    "website": "http://niutech.com",
    "zipcode": "250002"
  },
  "68C.F": {
    "city": "Wuhu",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "China Conch Venture Holdings Limited",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "CHINA CONCH VENT. HD -,01",
    "state": null,
    "summary": "China Conch Venture Holdings Limited, an investment holding company, provides energy preservation and environmental protection solutions in Mainland China, rest of Asia, Africa, and North America. The company operates through Energy Preservation and Environmental Protection Solutions, Port Logistics Services, and New Building Materials segments. It manufactures and sells residual heat power generation, vertical mill, waste incineration, and solid waste solutions, as well as offers related after sales services. The company also provides port logistics services, including cargo handling, trans-shipment, and warehousing services; and alternative wall building materials, such as cellulose fiber cement sheets, and autoclaved and wood wool cement boards. In addition, it designs and constructs energy preservation and environmental protection projects. China Conch Venture Holdings Limited was founded in 2013 and is headquartered in Wuhu, China.",
    "website": "http://www.conchventure.com",
    "zipcode": "241070"
  },
  "6WZ.F": {
    "city": "Nacka",
    "country": "Sweden",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Saxlund Group AB (publ)",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SAXLUND GROUP AB",
    "state": null,
    "summary": "Saxlund Group AB (publ), an environmental technology group, develops, manufactures, and services plants and equipment for the production of environmentally-friendly and resource-efficient energy. The company provides bulk materials handling systems, such as bar feeders, tube feeders, hydraulic rotors, and sliding frames for forest residues, sawmill waste, chips, pellets, sludge, etc.; combustion systems; fixed and transportable heating plants; and purification products, including scrubbers, lamella or tubes, wet electrostatic precipitators (WESP), filter cassettes, hose filters, ESP electrostatic precipitators, injection of lime and activated carbon, and cyclones, as well as plant operator training. It serves electricity; heat and power production; wood and forest; water and waste management; process, recycling, and mining; and other industries. The company was formerly known as Pilum AB (publ.) and changed its name to Saxlund Group AB (publ) in July 2017. Saxlund Group AB (publ) is headquartered in Nacka, Sweden.",
    "website": "http://www.saxlund.se",
    "zipcode": "13154"
  },
  "7004.T": {
    "city": "Osaka",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Hitachi Zosen Corporation",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "HITACHI ZOSEN CORP",
    "state": null,
    "summary": "Hitachi Zosen Corporation engages in the engineering, procurement, construction, and after-sales services, as well as operation and maintenance of energy-from-waste plants in Japan and internationally. It operates through three segments: Environmental Systems & Industrial Plants, Machinery, and Infrastructure. The Environmental Systems & Industrial Plants segment builds various water-related facilities, including sludge recycling centers and desalination plants, and energy-related facilities, including biomass plants. The Machinery segment provides marine diesel engines, press machines for automobiles, pressure vessels for petrochemical plants, and other process equipment, as well as various types of precision machinery, such as semiconductor, food, and medical related equipment; and hydrogen generation systems. This segment also offers solutions in various industries, such as mitigating environmental burdens and streamlining manufacturing processes for higher efficiency, as well as support services ranging from development to servicing. The Infrastructure segment engages in building, monitoring, maintenance, repair, and strengthening of bridges and hydraulic gates for dams and rivers; developing shield tunneling machines for the construction of underground motorways and subway tracks, and flap-gate type seawalls against flood disaster due to tsunamis or storm surges. The company was founded in 1881 and is headquartered in Osaka, Japan.",
    "website": "http://www.hitachizosen.co.jp",
    "zipcode": "559-8559"
  },
  "7265.T": {
    "city": "Omaezaki",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Eiken Industries Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "EIKEN INDUSTRIES CO",
    "state": null,
    "summary": "Eiken Industries Co.,Ltd. manufactures and sells filters for internal combustion engines and special filters for industrial use primarily in Japan. It offers air filter clogging, fuel filters, and cabin filters. The company was formerly known as Ehken Kogyo Corporation and changed its name to Eiken Industries Co.,Ltd. in July 1972. Eiken Industries Co.,Ltd. was founded in 1967 and is headquartered in Omaezaki, Japan.",
    "website": "http://www.eiken-kk.co.jp",
    "zipcode": "437-1698"
  },
  "7443.TWO": {
    "city": "Pingtung City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Fluxtek International Corp.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "FLUXTEK",
    "state": null,
    "summary": "Fluxtek International Corp. manufactures and sells RO water purification equipment in Taiwan and internationally. The company offers compact systems, residential systems, purifier systems, commercial systems, dispensers, filters/membranes, housing caps, pumps/transformers, tanks/faucets, fittings, and coconut shell carbon products. It also provides accessories, such as leak detectors, housing wrenches, shut off valves, pressure regulators, flow restrictors, mini digital TDS meters, pressure gauges, high and low pressure switches, solenoid and needle valves, and control boxes. The company was founded in 2000 and is based in Pingtung City, Taiwan.",
    "website": "http://www.fluxtek.com",
    "zipcode": "90093"
  },
  "79Q.F": {
    "city": "Calgary",
    "country": "Canada",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Questor Technology Inc.",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "QUESTOR TECHNOLOGY INC.",
    "state": "AB",
    "summary": "Questor Technology Inc., an environmental clean technology company, designs, manufactures, and services waste gas combustion systems in Canada and the United States. The company sells, rents, and services waste gas incineration systems. It offers its solutions for various oil and gas projects, as well as for landfill biogas, syngas, waste engine exhaust, geothermal and solar, and cement plant waste heat. The company was formerly known as Interglobe Gas Technology Inc. and changed its name to Questor Technology Inc. in September 1995. Questor Technology Inc. was founded in 1994 and is headquartered in Calgary, Canada.",
    "website": "http://www.questortech.com",
    "zipcode": "T2P 3N3"
  },
  "9551.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pollution & Treatment Controls",
    "long_name": "METAWATER Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "METAWATER CO LTD",
    "state": null,
    "summary": "METAWATER Co., Ltd. designs and constructs equipment for water treatment plants, sewage treatment plants, and waste treatment facilities in Japan and internationally. The company also designs, manufactures, and sells various devices; implements repair work; and installs machine and equipment, and telecommunication work, as well as provision for services, including operation management. In addition, it offers civil engineering, building, electrical, plumbing, tile, brick, and block works; and provides water and sewage, and sanitation facilities works. The company was founded in 2007 and is headquartered in Tokyo, Japan.",
    "website": "http://www.metawater.co.jp",
    "zipcode": "101-0041"
  },
  "9GT.F": {
    "city": "Beijing",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Guodian Technology & Environment Group Corporation Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "GUODIAN TECH.+ENV.GR.HYC1",
    "state": null,
    "summary": "Guodian Technology & Environment Group Corporation Limited provides environmental protection and energy conservation solutions, and renewable energy equipment manufacturing and services in the People's Republic of China. It operates through four segments: Environmental Protection, Energy Conservation Solutions, Wind Power Products and Services, and All Others. The Environmental Protection segment offers sulphur oxide and nitrogen oxide control technologies, desulphurization and denitrification facilities rental, ash removal with filer bag, and water treatment related technologies and products. The Energy Conservation Solutions segment offers energy saving products and services, including plasma and micro-oil ignition equipment; gas turbine improvement services; and energy-efficient power plants construction services. The Wind Power Products and Services segment produces and sells wind turbine and its components; and offers system solutions and services to wind power operators. The All Others segment generates wind and solar power; and sells other electric power control system related products. The company also offers desulphurization and other environmental protection engineering services; produces and sells selective catalytic reduction catalyst; constructs and operates water treatment projects; designs and installs sewage treatment equipment; researches, develops, and sells wind turbine technology; and provides energy conservation engineering services. In addition, it produces and sells steam turbines and other electric equipment, variable pitch control systems for wind turbine, and electric power related products; and researches and develops technology. The company was formerly known as Guodian Technology & Environment Group Limited Liability Company and was changed to Guodian Technology & Environment Group Corporation Limited. The company was founded in 2001 and is headquartered in Beijing, the People's Republic of China.",
    "website": "http://www.01296.hk",
    "zipcode": "100039"
  },
  "A5F.F": {
    "city": "Upper Galilee",
    "country": "Israel",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Amiad Water Systems Ltd.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "AMIAD WATER SYS.LTD.IS-50",
    "state": null,
    "summary": "Amiad Water Systems Ltd., together with its subsidiaries, produces and supplies water filters and filtration systems for the industrial, municipal, ballast water, oil and gas, and irrigation markets worldwide. It offers automatic, semi-automatic, and manual filters, as well as fertigation injectors for farmers and large agricultural co-ops; automatic filters for industrial sector; and develops, manufactures, and distributes water treatment and filtration solutions for potable water and wastewater in various applications, such as pre-filtration for UV and tertiary treatment, and polishing, as well as for MF, UF, NF, and RO membranes. The company was formerly known as Amiad Filtration Systems Ltd. and changed its name to Amiad Water Systems Ltd. in September 2011. Amiad Water Systems Ltd. was founded in 1962 and is headquartered in Upper Galilee, Israel.",
    "website": "http://www.amiad.com",
    "zipcode": "12335"
  },
  "A9W1.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "SIIC Environment Holdings Ltd.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "SIIC ENVIRONM. HLDS",
    "state": null,
    "summary": "SIIC Environment Holdings Ltd., an investment holding company, engages in the wastewater treatment, water supply, sludge treatment, solid waste incineration, and other environment related businesses primarily in the People's Republic of China. It operates through three segments: Water and Sludge Treatment; Water Supply; and Waste Incineration. The Water and Sludge Treatment segment constructs, manages, and operates water and sludge related infrastructure under service concession arrangements; and manages and operates water and sludge related infrastructure under non-service concession arrangements, as well as provides financial income under service concession arrangements. The Water Supply segment engages in the construction, management, and operation of water supply related infrastructure under service concession arrangements. The Waste Incineration segment constructs, manages, and operates waste incineration related infrastructure under service concession arrangements. The company has a portfolio of approximately 200 water treatment and supply projects, 8 waste incineration projects, and 10 sludge treatment projects in 19 municipalities and provinces in China. It also provides management and consultancy services; treats and supplies potable water; and installs water meters. The company was formerly known as Asia Water Technology Ltd. and changed its name to SIIC Environment Holdings Ltd. in November 2012. SIIC Environment Holdings Ltd. was incorporated in 2002 and is headquartered in Singapore.",
    "website": "http://www.siicenv.com",
    "zipcode": "039192"
  },
  "ACC.OL": {
    "city": "Lysaker",
    "country": "Norway",
    "currency": "NOK",
    "exchange": "OSL",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Aker Carbon Capture AS",
    "market": "no_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "AKER CARBON CAPTUR",
    "state": null,
    "summary": "Aker Carbon Capture AS provides products, technology, and solutions within the field of carbon capture technologies, utilization, and storage. The company's carbon capture process uses a mixture of water and organic amine solvents to absorb the CO2 that can be applied on emissions from various sources, including gas, cement, refineries, and waste-to-energy through to hydrogen and other process industries. Its products include Just Catch, Big Catch, and Offshore Just Catch, as well as mobile test units. The company was incorporated in 2020 and is based in Lysaker, Norway. Aker Carbon Capture AS is a subsidiary of Aker Horizons Holding AS.",
    "website": "http://www.akercarboncapture.com",
    "zipcode": "1366"
  },
  "ACT.CN": {
    "city": "London",
    "country": "Canada",
    "currency": "CAD",
    "exchange": "CNQ",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Aduro Clean Technologies Inc.",
    "market": "ca_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "AduroCleanTech",
    "state": "ON",
    "summary": "Aduro Energy Inc. develops water-based solutions to transform corn distillers oil and other waste lipids into drop-in diesel, petroleum, specialty chemicals, and bio-jet fuel. The company was founded in 2011 and is based in London, Canada.",
    "website": "http://www.aduroenergy.com",
    "zipcode": "N6G 0J3"
  },
  "ADCV": {
    "city": "Burnaby",
    "country": "Canada",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "ADCapital US Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "AD CAPITAL US INC",
    "state": "BC",
    "summary": "ADCapital US Inc. engages in the research, testing, and development of products that reduce emissions from vehicle exhaust. Its principal product includes Auto Emission Post Regulator (AEPR), which reduces the vehicle emission (NOx) by approximately 97%. ADCapital US Inc. is based in Burnaby, Canada.",
    "website": null,
    "zipcode": "V3N 2Z4"
  },
  "ADES": {
    "city": "Greenwood Village",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Advanced Emissions Solutions, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "Advanced Emissions Solutions, I",
    "state": "CO",
    "summary": "Advanced Emissions Solutions, Inc., together with its subsidiaries, provides environmental technologies and specialty chemicals in the United States. It operates through two segments, Refined Coal and Advanced Purification Technologies. The company offers CyClean technology, a pre-combustion coal treatment process to enhance combustion, as well as to reduce emissions of nitrogen oxide and mercury from coals burned in cyclone boilers; and M-45 and M-45-PC technologies, which are pre-combustion coal treatment technologies used to control emissions from circulating fluidized bed boilers and pulverized coal boilers. It also provides mercury and other air contaminants controls; and activated carbon products, such as powdered activated carbon and granular activated carbon, as well as owns an associated lignite mine that supplies the raw material for the powdered activated carbon plant. The company's products are used in removal of heavy metal pollutants; treatment of drinking and waste waters; industrial acid gas and odor removal; automotive gasoline emission control; soil and ground water remediation; and food and beverage process and product purifications. It serves customers in the coal-fired power generation and industrial boiler processes. The company was founded in 1996 and is headquartered in Greenwood Village, Colorado.",
    "website": "http://www.advancedemissionssolutions.com",
    "zipcode": "80111"
  },
  "AEG.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Active Energy Group PLC",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "ACTIVE ENERGY GROUP PLC ORD 0.0",
    "state": null,
    "summary": "Active Energy Group PLC engages in the development and commercialization of biomass into renewable energy pellet products in the United Kingdom and internationally. The company operates through two segments, Forestry & Natural Resources and CoalSwitch. It offers CoalSwitch, a biomass-based fuel that utilizes low-value forestry, and agricultural residues and energy crops; and PeatSwitch, a steam beneficiated and soil substrate product, which is made from waste fiber. The company's products include lumber products, such as rail ties and lumber; hardwood and softwood logs; and energy products comprising wood chips and biomass pellets. It also engages in the development of timber resources; and wood processing activities. The company was formerly known as Cinpart plc and changed its name to Active Energy Group PLC in July 2010. Active Energy Group PLC was incorporated in 1996 and is headquartered in London, the United Kingdom.",
    "website": "http://www.aegplc.com",
    "zipcode": "W1J 8NR"
  },
  "AEI.AX": {
    "city": "Rosebery",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Aeris Environmental Ltd",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "AERIS ENV FPO",
    "state": "NSW",
    "summary": "Aeris Environmental Ltd engages in the research, development, and commercialization of proprietary technologies in Australia and internationally. It provides HVAC/R hygiene and remediation technology; and energy efficiency services. The company also offers indoor surface clean and treatment solutions; heavy duty cleaning, treatments, and odour control technologies for the HVAC/R, remediation and restoration, and facilities maintenance industries; bioactive filter treatment and pan tablets; corrosion protection solutions; duct treatment to prevent colonization by mould and bacteria; and hood coating for commercial kitchen range hoods. In addition, it provides ice machine/dairy and beverages cleaners and sanitizers; and cooling tower cleaners. The company is headquartered in Rosebery, Australia.",
    "website": "http://www.aeris.com.au",
    "zipcode": "2018"
  },
  "AFS.L": {
    "city": "Upper Galilee",
    "country": "Israel",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Amiad Water Systems Ltd.",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "AMIAD WATER SYSTEMS LTD ORD ILS",
    "state": null,
    "summary": "Amiad Water Systems Ltd., together with its subsidiaries, produces and supplies water filters and filtration systems for the industrial, municipal, ballast water, oil and gas, and irrigation markets worldwide. It offers automatic, semi-automatic, and manual filters, as well as fertigation injectors for farmers and large agricultural co-ops; automatic filters for industrial sector; and develops, manufactures, and distributes water treatment and filtration solutions for potable water and wastewater in various applications, such as pre-filtration for UV and tertiary treatment, and polishing, as well as for MF, UF, NF, and RO membranes. The company was formerly known as Amiad Filtration Systems Ltd. and changed its name to Amiad Water Systems Ltd. in September 2011. Amiad Water Systems Ltd. was founded in 1962 and is headquartered in Upper Galilee, Israel.",
    "website": "http://www.amiad.com",
    "zipcode": "12335"
  },
  "AGUA.MX": {
    "city": "Mexico City",
    "country": "Mexico",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Grupo Rotoplas S.A.B. de C.V.",
    "market": "mx_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "GRUPO ROTOPLAS SAB DE CV",
    "state": "DF",
    "summary": "Grupo Rotoplas S.A.B. de C.V., together with its subsidiaries, manufactures, purchases, sells, and installs plastic containers and accessories for water storage, conduction, and improvement solutions in Mexico and internationally. It operates through Individual Solutions and Comprehensive Solutions segments. The company offers storage solutions, water tanks, cisterns, storage tanks for water and chemicals, inductor tanks, horizontal tanks, and feeders. It also provides hydraulic tuboplus pipes; plastic bolts and connectors; valves; centrifugal, peripheral, submersible, and circulation pump, as well as hydro pneumatic systems; sanitary catch pits; water heaters and heaters, and electric showers; self-cleaning biodigester; standard and jumbo filters; refrigerator and tap water filters; and water filter jugs. In addition, the company offers rural rainwater harvesting systems, urban water harvesting, and outdoor toilets with bio digester solutions. Further, it provides water treatment and recycling, and purified drinking water services. Additionally, the company offers financial, administrative, and real estate services, as well as exports, imports, and distributes water storage plastic tanks; and engages in residual water treatment activities. Grupo Rotoplas S.A.B. de C.V. was founded in 1978 and is headquartered in Mexico City, Mexico.",
    "website": "http://www.rotoplas.com",
    "zipcode": "11040"
  },
  "AKCCF": {
    "city": "Lysaker",
    "country": "Norway",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Aker Carbon Capture AS",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "AKER CARBON CAPTURE ASA",
    "state": null,
    "summary": "Aker Carbon Capture AS provides products, technology, and solutions within the field of carbon capture technologies, utilization, and storage. The company's carbon capture process uses a mixture of water and organic amine solvents to absorb the CO2 that can be applied on emissions from various sources, including gas, cement, refineries, and waste-to-energy through to hydrogen and other process industries. Its products include Just Catch, Big Catch, and Offshore Just Catch, as well as mobile test units. The company was incorporated in 2020 and is based in Lysaker, Norway. Aker Carbon Capture AS is a subsidiary of Aker Horizons Holding AS.",
    "website": "http://www.akercarboncapture.com",
    "zipcode": "1366"
  },
  "AKMY.V": {
    "city": "Beit Shean",
    "country": "Israel",
    "currency": "CAD",
    "exchange": "VAN",
    "industry": "Pollution & Treatment Controls",
    "long_name": "K.B. Recycling Industries Ltd.",
    "market": "ca_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "K B RECYCLING INDUSTRIES LTD",
    "state": null,
    "summary": "K.B. Recycling Industries Ltd. recycles and manufactures polyethylene sheets products from the post-consumed plastic bags and sheets in Israel. Its products include polyethylene geomembrane, which is used in building and infrastructure underground sealing systems; polyethylene sheet that is laminated with PET and cotton mixed non-woven fabric, which provides heavy-duty surface protection during construction work and renovations; polyethylene geomembrane root barrier, which is used in underground installations and helps in preventing roots from growing into certain soil; and polyethylene geomembrane gas barrier, a laminated polyethylene sheet with a BOPP sheet that is used for prevention of underground gasses leaks into the building spaces. The company offers its products under Rhino, Armadillo, Cricket, and Elephant brands. K.B. Recycling Industries Ltd. was incorporated in 2008 and is headquartered in Beit Shean, Israel.",
    "website": "http://kb-recycling.com",
    "zipcode": "11715"
  },
  "ALUVI.PA": {
    "city": "Saint-Viance",
    "country": "France",
    "currency": "EUR",
    "exchange": "PAR",
    "industry": "Pollution & Treatment Controls",
    "long_name": "UV Germi SA",
    "market": "fr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "UV GERMI",
    "state": null,
    "summary": "UV Germi SA develops and manufactures UV sterilizers for water treatment applications in France, rest of Europe, the Middle-East, and North Africa. The company offers its products for applications in the areas of drinking water, waste water, water in public swimming pools, rain water, air, and surfaces, as well as industrial water in food processing, pharmaceutical, and cosmetic industries. It also provides after sales services, such as technical support for the installation of the equipment, as well as follow up on maintenance. UV Germi SA is based in Saint-Viance, France.",
    "website": "http://www.uvgermi.fr",
    "zipcode": "19240"
  },
  "AMSU": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Amanasu Environment Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "AMANASU ENVIRONMENT CORPORATION",
    "state": "NY",
    "summary": "Amanasu Environment Corporation, a development stage company, engages in the research and development, marketing, and sale of environmental technologies. It provides Amanasu Furnace, a technology that disposes toxic and hazardous wastes through a high temperature combustion system; hot water boiler technology, which incinerates waste tires in a non-polluting manner and extracts heat energy from the incineration process; and ring-tube desalination methodology that purifies seawater and removes hazardous pollutants from wastewater. The company was formerly known as Amanasu Energy Corporation and changed its name to Amanasu Environment Corporation in November 2002. The company was incorporated in 1999 and is headquartered in New York, New York. Amanasu Environment Corporation is a subsidiary of Amanasu Corporation.",
    "website": "http://www.amanasu.net/en/business/environment/index.html",
    "zipcode": "10022"
  },
  "APL.V": {
    "city": "Calgary",
    "country": "Canada",
    "currency": "CAD",
    "exchange": "VAN",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Appulse Corporation",
    "market": "ca_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "APPULSE CORP.",
    "state": "AB",
    "summary": "Appulse Corporation, through its subsidiaries, provides new and refurbished centrifuge machines and parts in North America and internationally. It is also involved in the rental of centrifuge equipment; provision of maintenance services, and consulting and design advisory services to industries, as well as machining services for equipment repairs; and manufacture of parts using machining and milling equipment. In addition, the company offers value added services, including a balancing service for large equipment, such as centrifuge bowls. It provides its products and services for food and beverage processing, and environmental applications, as well as serves other industries comprising the oil and gas service, refinery, marine processing, and pharmaceutical industries. The company is based in Calgary, Canada.",
    "website": "http://www.appulsecorp.net",
    "zipcode": "T2C 1P4"
  },
  "AQUA": {
    "city": "Pittsburgh",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Evoqua Water Technologies Corp.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "Evoqua Water Technologies Corp.",
    "state": "PA",
    "summary": "Evoqua Water Technologies Corp. provides water and wastewater treatment systems and technologies, and mobile and emergency water supply solutions and services for industrial, commercial, and municipal water treatment markets. It operates in two segments, Integrated Solutions and Services, and Applied Product Technologies. The Integrated Solutions and Services segment offers capital systems and related recurring aftermarket services, parts, and consumables, as well as long-term and short-term service contracts, and emergency services for treating industrial process water, utility water, and wastewater. This segment also provides odor and corrosion control services for municipalities. It serves healthcare, pharmaceutical, light manufacturing, microelectronics, food and beverage, and power and chemical processing industries. The Applied Product Technologies segment offers advanced filtration and separation products, such as VAF self-cleaning filters, Ionpure technologies, and Vortisand systems; wastewater treatment technologies, including the BioMag systems, clarification systems, and odor control and sludge management solutions; disinfection solutions from chlorine to ultraviolet light and ozone technologies; electrocatalytic and materials, which include electro chlorination, cathodic protection, and anode products; and aquatics technologies and solutions. This segment serves recreational and commercial pool market. The company has operations in the United States, Canada, the United Kingdom, the Netherlands, Germany, Australia, China, Singapore, Korea, and India. Evoqua Water Technologies Corp. was incorporated in 2013 and is headquartered in Pittsburgh, Pennsylvania.",
    "website": "http://www.evoqua.com",
    "zipcode": "15222"
  },
  "ARTS.TA": {
    "city": "Bet Shemesh",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Airtouch Solar Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "AIRTOUCH SOLAR LTD",
    "state": null,
    "summary": "Airtouch Solar Ltd provides autonomous water-free robotic cleaning solutions for solar panels. The company is based in Bet Shemesh, Israel.",
    "website": "http://www.airtouchsolar.com",
    "zipcode": "9905503"
  },
  "ATGVF": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Active Energy Group PLC",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ACTIVE ENERGY GROUP",
    "state": null,
    "summary": "Active Energy Group PLC engages in the development and commercialization of biomass into renewable energy pellet products in the United Kingdom and internationally. The company operates through two segments, Forestry & Natural Resources and CoalSwitch. It offers CoalSwitch, a biomass-based fuel that utilizes low-value forestry, and agricultural residues and energy crops; and PeatSwitch, a steam beneficiated and soil substrate product, which is made from waste fiber. The company's products include lumber products, such as rail ties and lumber; hardwood and softwood logs; and energy products comprising wood chips and biomass pellets. It also engages in the development of timber resources; and wood processing activities. The company was formerly known as Cinpart plc and changed its name to Active Energy Group PLC in July 2010. Active Energy Group PLC was incorporated in 1996 and is headquartered in London, the United Kingdom.",
    "website": "http://www.aegplc.com",
    "zipcode": "W1J 8NR"
  },
  "AWGI": {
    "city": "Spokane Valley",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Ambient Water Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "AMBIENT WATER CORP",
    "state": "WA",
    "summary": "Ambient Water Corporation designs and builds air-to-water appliances for residential and commercial drinking water applications based on patented, patent pending, and proprietary technologies in the United States. The company's air-to-water technology systems produce water from the atmosphere by using a condensing surface and a proprietary filtration system that removes dust, airborne particles, and bacteria to generate drinking water. It serves businesses, governments, and individuals. The company was formerly known as AWG International Water Corporation and changed its name to Ambient Water Corporation in June 2014. Ambient Water Corporation was founded in 2010 and is headquartered in Spokane Valley, Washington.",
    "website": null,
    "zipcode": "99212"
  },
  "BACTIQ.CO": {
    "city": "Horsholm",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Bactiquant A/S",
    "market": "dk_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "BactiQuant A/S",
    "state": null,
    "summary": "Bactiquant A/S develops and provides technology for the mobile and online surveillance of bacterial contamination levels in water. The company is based in 1998 and is based in Horsholm, Denmark.",
    "website": "http://www.mycometer.com",
    "zipcode": "DK-2970"
  },
  "BANKA.NS": {
    "city": "Hyderabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Banka BioLoo Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "Banka BioLoo Limited",
    "state": null,
    "summary": "Banka BioLoo Limited provides products and services for human waste management system in India. It manufactures, supplies, and installs bio-tanks for digestion of human waste. The company is also involved in the operation and maintenance of bio-toilets and CDTS; sale of spares of control discharge toilet system to Indian railways; and treatment and management of fecal sludge, as well as waste water treatment and recycling solutions. The company was founded in 2008 and is based in Hyderabad, India.",
    "website": "http://www.bankabio.com",
    "zipcode": "500082"
  },
  "BHK.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Pollution & Treatment Controls",
    "long_name": "SIIC Environment Holdings Ltd.",
    "market": "sg_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "SIIC Environment",
    "state": null,
    "summary": "SIIC Environment Holdings Ltd., an investment holding company, engages in the wastewater treatment, water supply, sludge treatment, solid waste incineration, and other environment related businesses primarily in the People's Republic of China. It operates through three segments: Water and Sludge Treatment; Water Supply; and Waste Incineration. The Water and Sludge Treatment segment constructs, manages, and operates water and sludge related infrastructure under service concession arrangements; and manages and operates water and sludge related infrastructure under non-service concession arrangements, as well as provides financial income under service concession arrangements. The Water Supply segment engages in the construction, management, and operation of water supply related infrastructure under service concession arrangements. The Waste Incineration segment constructs, manages, and operates waste incineration related infrastructure under service concession arrangements. The company has a portfolio of approximately 200 water treatment and supply projects, 8 waste incineration projects, and 10 sludge treatment projects in 19 municipalities and provinces in China. It also provides management and consultancy services; treats and supplies potable water; and installs water meters. The company was formerly known as Asia Water Technology Ltd. and changed its name to SIIC Environment Holdings Ltd. in November 2012. SIIC Environment Holdings Ltd. was incorporated in 2002 and is headquartered in Singapore.",
    "website": "http://www.siicenv.com",
    "zipcode": "039192"
  },
  "BHTG": {
    "city": "Chestnut Ridge",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Pollution & Treatment Controls",
    "long_name": "BioHiTech Global, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "BioHiTech Global, Inc.",
    "state": "NY",
    "summary": "BioHiTech Global, Inc., through its subsidiaries, provides technological, biological, and mechanical engineering solutions of organic and municipal waste worldwide. Its suite of technologies includes on-site biological processing equipment for food waste, patented processing facilities for the conversion of municipal solid waste into renewable fuel, and proprietary real-time data analytics tools to reduce food waste generation. The company also markets Revolution Series Digesters, an aerobic digestion technology solution for the disposal of food waste at the point of generation; and High Efficiency Biological Treatment Resource Recovery Technology to process waste at the municipal or enterprise level. In addition, it offers BioHiTech Cloud and Cirrus mobile applications for digester customers. Its principal customers include producers of food waste. The company serves healthcare, grocery, prison, retail food service, education, and hospitality sectors, as well as food distributors, convention centers, hotels, restaurants, stadiums, municipalities and academic institutions, and stadiums. BioHiTech Global, Inc. is headquartered in Chestnut Ridge, New York.",
    "website": "http://www.biohitech.com",
    "zipcode": "10977"
  },
  "BLR.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Darco Water Technologies Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "Darco Water Tech",
    "state": null,
    "summary": "Darco Water Technologies Limited, an investment holding company, designs, builds, operates, and maintains water and wastewater treatment systems. It operates through three segments: Engineered Environmental Systems, Water Management Services, and Trading. The Engineered Environmental Systems segment designs, fabricates, assembles, installs, and commissions engineered water systems for industrial applications. The Water Management Services segment services and maintains water and wastewater treatment plants. The Trading segment trades in and supplies chemicals, electrical controls, and related instruments used in water treatment systems. The company also designs and supplies environmental related equipment, centralized vacuum systems, refuse conveying systems, and other engineering systems; designs, installs, sets up, and maintains industrial waste treatment plant ultra-pure systems; and tests waste water and processed water, as well as renders other related waste treatment plant services. In addition, it provides integrated engineering solutions for water purification, water supply, and wastewater treatment; and related consultancy and industrial services, as well as solid waste disposal treatment and incineration services. Further, the company designs, fabricates, and constructs pure and waste water treatment plants. It serves electronics, petrochemicals, pharmaceuticals, and food and beverage industries in Singapore, Taiwan, Malaysia, the People's Republic of China, Vietnam, and internationally. Darco Water Technologies Limited was founded in 1999 and is headquartered in Singapore.",
    "website": "http://www.darcowater.com",
    "zipcode": "757322"
  },
  "BNET": {
    "city": "Old Bethpage",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Bion Environmental Technologies, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "BION ENVIRONMENTAL TECHNOLOGIES",
    "state": "NY",
    "summary": "Bion Environmental Technologies, Inc. develops patented and proprietary technology that provides environmental solutions to water air and water quality problems and concentrated animal feeding operations (CAFOs) in the United States and internationally. The company's technology remediates environmental problems and improve operational/resource efficiencies through recovering co-products from the CAFOs' waste stream, including renewable energy and water, and nutrients comprising ammonia nitrogen and phosphorus. It focuses on the installation of its systems to retrofit and environmentally remediate existing CAFOs; development of waste treatment facilities; and licensing and/or joint venturing of its technology and applications. The company was founded in 1987 and is based in Old Bethpage, New York.",
    "website": "http://www.biontech.com",
    "zipcode": "11804"
  },
  "BRM.V": {
    "city": "Guelph",
    "country": "Canada",
    "currency": "CAD",
    "exchange": "VAN",
    "industry": "Pollution & Treatment Controls",
    "long_name": "BIOREM Inc.",
    "market": "ca_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "BIOREM INC.",
    "state": "ON",
    "summary": "BIOREM Inc., an environmental biotechnology company, designs, manufactures, and sells air emissions control systems that are used to eliminate odors, volatile organic compounds (VOCs), and hazardous air pollutants (HAPs). It offers biofilters for the removal of odors, H2S, VOCs and HAPs; and biotrickling filters for applications of high concentrations of H2S or other water soluble compounds. The company also provides multi-stage systems to treat odors associated with various municipal wastewater treatment processes; biogas conditioning systems; ultrafiltration membranes to treat water sources; biological odor control systems; and filter media products to treat air emissions. In addition, it offers biological processes and testing services; media sampling and analysis; system review and inspections; and media replacements and spare parts. The company operates in Canada, the United States, China, and internationally. BIOREM Inc. is headquartered in Guelph, Canada.",
    "website": "http://www.biorem.biz",
    "zipcode": "N1H 6H9"
  },
  "BZHA.F": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Active Energy Group PLC",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ACTIVE ENER.GRP LS-,0001",
    "state": null,
    "summary": "Active Energy Group PLC engages in the development and commercialization of biomass into renewable energy pellet products in the United Kingdom and internationally. The company operates through two segments, Forestry & Natural Resources and CoalSwitch. It offers CoalSwitch, a biomass-based fuel that utilizes low-value forestry, and agricultural residues and energy crops; and PeatSwitch, a steam beneficiated and soil substrate product, which is made from waste fiber. The company's products include lumber products, such as rail ties and lumber; hardwood and softwood logs; and energy products comprising wood chips and biomass pellets. It also engages in the development of timber resources; and wood processing activities. The company was formerly known as Cinpart plc and changed its name to Active Energy Group PLC in July 2010. Active Energy Group PLC was incorporated in 1996 and is headquartered in London, the United Kingdom.",
    "website": "http://www.aegplc.com",
    "zipcode": "W1J 8NR"
  },
  "C3X2.F": {
    "city": "Montreal",
    "country": "Canada",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Dundee Sustainable Technologies Inc.",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "DUNDEE SUSTAINABLE TECHN.",
    "state": "QC",
    "summary": "Dundee Sustainable Technologies Inc. engages in the development and commercialization of technologies for the treatment of refractory materials in the mining industry in Canada and internationally. It focuses on the commercialization of CLEVR process, which extracts precious metals, as well as removes and stabilizes contaminants, such as arsenic, antimony, and cadmium; and GlassLock process, which stabilizes arsenic, forms scorodite, and produces an insoluble glass residue that meets environmental requirements. The company extracts precious and base metals from ores, concentrates, and tailings. It also provides technical services to customers in the mining industry to evaluate processing alternatives. The company was formerly known as Nichromet Extraction Inc. and changed its name to Dundee Sustainable Technologies Inc. in January 2014. Dundee Sustainable Technologies Inc. was incorporated in 1997 and is headquartered in Montreal, Canada. Dundee Sustainable Technologies Inc. is a subsidiary of Dundee Corporation.",
    "website": "http://www.dundeetechnologies.com",
    "zipcode": "H3A 2W5"
  },
  "CECE": {
    "city": "Dallas",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Pollution & Treatment Controls",
    "long_name": "CECO Environmental Corp.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "CECO Environmental Corp.",
    "state": "TX",
    "summary": "CECO Environmental Corp. provides industrial air quality and fluid handling systems for the energy, industrial, and other niche markets worldwide. It operates through three segments: Energy Solutions, Industrial Solutions, and Fluid Handling Solutions. The company engineers, designs, builds, and installs systems that capture, clean, and destroy airborne contaminants from industrial facilities, as well as equipment that control emissions from such facilities; and fluid handling and filtration systems. Its products and services include dampers and diverters, selective catalytic reduction and selective non-catalytic reduction systems, cyclonic technology, thermal oxidizers, filtration systems, scrubbers, and fluid handling equipment, as well as plant engineering services and engineered design build fabrication. The company markets its products and services to natural gas processors, transmission and distribution companies, refineries, power generators, industrial manufacturing, engineering and construction companies, semiconductor manufacturers, compressor manufacturers, metals and minerals, and electric vehicle producer companies. CECO Environmental Corp. was incorporated in 1966 and is headquartered in Dallas, Texas.",
    "website": "http://www.cecoenviro.com",
    "zipcode": "75254"
  },
  "CGYV": {
    "city": "Shanghai",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "China Energy Recovery, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "CHINA ENERGY RECOVERY INC",
    "state": null,
    "summary": "China Energy Recovery, Inc. designs, manufactures, installs, and services waste heat recovery systems in China. The company's energy recovery systems capture industrial waste energy to produce electrical power, which enables industrial manufacturers to reduce their energy costs, shrink their emissions footprint, and generate saleable emissions credits. It serves petrochemical, paper manufacturing, refining/power generation, coke processing, cement, and steel industries. The company is headquartered in Shanghai, China.",
    "website": null,
    "zipcode": "201203"
  },
  "CIRCHE.ST": {
    "city": "Vargön",
    "country": "Sweden",
    "currency": "SEK",
    "exchange": "STO",
    "industry": "Pollution & Treatment Controls",
    "long_name": "CirChem AB (publ)",
    "market": "se_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "CirChem AB",
    "state": null,
    "summary": "CirChem AB (publ) engages in recycling of used solvents in Sweden. It collects and purify used industrial solvents for reuse; and produces other chemical products, such as washer fluid and rubbing alcohol. The company was founded in 2013 and is based in Vargon, Sweden.",
    "website": "http://www.circhem.com",
    "zipcode": "468 30"
  },
  "CK7.F": {
    "city": "Admiralty",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "China Everbright Greentech Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": " CHINA EVERBRIGHT GREENT.",
    "state": null,
    "summary": "China Everbright Greentech Limited, an investment holding company, engages in the design, construction, operation, and maintenance of integrated biomass and waste-to-energy projects in China. It is involved in the construction and operation of biomass direct combustion power generation projects, biomass heat supply projects, biomass electricity and heat cogeneration projects, waste-to-energy projects, and integrated biomass and waste-to-energy projects; and hazardous waste landfill projects, hazardous waste incineration projects, and physicochemical and resources recycling projects. The company is also involved in the environmental remediation for restoration of industrial contaminated sites, contaminated farmland, mines and landfills; treatment of industrial gas emission, oil sludge, river/lake sediments, and industrial sludge; and construction and operation of wetland parks, environmental stewardship services, and anti-seepage at landfill sites. In addition, it operates 7 solar energy projects and 2 wind power projects with a generation capacity of 125.9 megawatts for local power grid companies in Jiangsu Province, Anhui Province, Shanxi Province, and Germany. The company was founded in 2006 and is headquartered in Admiralty, Hong Kong. China Everbright Greentech Limited is a subsidiary of China Everbright Green Holdings Limited.",
    "website": "http://www.ebgreentech.com",
    "zipcode": null
  },
  "CLIR": {
    "city": "Seattle",
    "country": "United States",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Pollution & Treatment Controls",
    "long_name": "ClearSign Technologies Corporation",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "ClearSign Technologies Corporat",
    "state": "WA",
    "summary": "ClearSign Technologies Corporation designs and develops products and technologies to enhance operational performance, energy efficiency, emission reduction, safety, and overall cost-effectiveness of industrial and commercial systems in the United States and the People's Republic of China. Its ClearSign Core Burner Technology consists of an industrial burner body and a downstream porous ceramic structure or metal flame stabilizing device; ClearSign Core Plug & Play technology provides direct burner replacement for traditional refinery process heaters; and ClearSign Eye Flame Sensor, an electrical flame sensor for industrial applications. The company also provides ClearSign Core Boiler Burner; and ClearSign Core Flaring Burners technologies. It serves energy, institutional, commercial and industrial boiler, chemical, and petrochemical industries. The company was formerly known as ClearSign Combustion Corporation and changed its name ClearSign Technologies Corporation in November 2019. ClearSign Technologies Corporation was incorporated in 2008 and is headquartered in Seattle, Washington.",
    "website": "http://www.clearsign.com",
    "zipcode": "98168"
  },
  "CLWT": {
    "city": "Hong Kong",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Euro Tech Holdings Company Limited",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "Euro Tech Holdings Company Limi",
    "state": null,
    "summary": "Euro Tech Holdings Company Limited distributes water treatment equipment, laboratory instruments, analyzers, test kits and related supplies, and power generation equipment to commercial customers, and governmental agencies in Hong Kong and the People's Republic of China. The company operates in two segments, Trading and Manufacturing, and Engineering. It sells analytical instruments, such as chromatographs, mass spectrometers, flow injector analyzers, automated sample preparation workstations, and atomic spectrometers; environmental monitoring instruments comprising air and water quality monitoring instruments; sample pre-treatment equipment; and general purpose laboratory instruments consisting of water quality monitoring and analysis equipment. The company also distributes general testing and measuring equipment comprising multi-channel digital and analogue recorders, signal amplifiers, and calibration equipment for energy conservation, renewable energy equipment, power quality analyzers, and continuous emissions monitoring systems; and air pollution control systems to power plants, railway and aero-space industries, utilities, educational institutions, and telecommunications companies. In addition, it offers process control systems, including sensors, temperature gauges, pressure gauges, power and energy consumption meters, flow meters, valves, temperature and pressure transmitters and control devices, and temperature and pressure calibrators, as well as moisture, power, energy, and harmonic analyzers; systems engineering services; and maintenance, installation assistance, and calibration services. Further, the company distributes programmable logic controllers, telemetry units, and supervisory control and data acquisition systems and software; and designs, operates, and manages various waste-water, water, and power generation projects. It also sell its products through Website. The company was founded in 1971 and is headquartered in Hong Kong, Hong Kong.",
    "website": "http://www.euro-tech.com",
    "zipcode": null
  },
  "COSLF": {
    "city": "Quebec City",
    "country": "Canada",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "CO2 Solutions Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "CO2 SOLUTIONS INC",
    "state": "QC",
    "summary": "CO2 Solutions Inc. develops proprietary technologies for the capture and production of carbon dioxide (CO2) in Canada, the United States, and Europe. It focuses on commercializing an enzyme-based technology for efficient CO2 capture from various industrial flue gasses for reuse or sequestration. The company's technology has various industrial applications, such as enhanced oil recovery, oil and gas, pulp and paper, water treatment, cement, beverage carbonation, greenhouses, and other uses. It has a collaboration agreement with Hatch Ltd. to deliver carbon capture systems. CO2 Solutions Inc. was founded in 1997 and is headquartered in Quebec City, Canada.",
    "website": "http://www.co2solutions.com",
    "zipcode": "G2C 1T9"
  },
  "CPSL": {
    "city": "Cranston",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Catapult Solutions, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "CATAPULT SOLUTIONS INC",
    "state": "RI",
    "summary": "Catapult Solutions, Inc. focuses on effecting an asset acquisition, merger, exchange of capital stock, or other business combination with a domestic or foreign business. The company was founded in 2010 and is based in Cranston, Rhode Island.",
    "website": null,
    "zipcode": "02910"
  },
  "CRB.F": {
    "city": "Vargön",
    "country": "Sweden",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "CirChem AB (publ)",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "CIRCHEM AB",
    "state": null,
    "summary": "CirChem AB (publ) engages in recycling of used solvents in Sweden. It collects and purify used industrial solvents for reuse; and produces other chemical products, such as washer fluid and rubbing alcohol. The company was founded in 2013 and is based in Vargon, Sweden.",
    "website": "http://www.circhem.com",
    "zipcode": "468 30"
  },
  "D3XA.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Darco Water Technologies Limited",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "DARCO WATER TECH. O.N.",
    "state": null,
    "summary": "Darco Water Technologies Limited, an investment holding company, designs, builds, operates, and maintains water and wastewater treatment systems. It operates through three segments: Engineered Environmental Systems, Water Management Services, and Trading. The Engineered Environmental Systems segment designs, fabricates, assembles, installs, and commissions engineered water systems for industrial applications. The Water Management Services segment services and maintains water and wastewater treatment plants. The Trading segment trades in and supplies chemicals, electrical controls, and related instruments used in water treatment systems. The company also designs and supplies environmental related equipment, centralized vacuum systems, refuse conveying systems, and other engineering systems; designs, installs, sets up, and maintains industrial waste treatment plant ultra-pure systems; and tests waste water and processed water, as well as renders other related waste treatment plant services. In addition, it provides integrated engineering solutions for water purification, water supply, and wastewater treatment; and related consultancy and industrial services, as well as solid waste disposal treatment and incineration services. Further, the company designs, fabricates, and constructs pure and waste water treatment plants. It serves electronics, petrochemicals, pharmaceuticals, and food and beverage industries in Singapore, Taiwan, Malaysia, the People's Republic of China, Vietnam, and internationally. Darco Water Technologies Limited was founded in 1999 and is headquartered in Singapore.",
    "website": "http://www.darcowater.com",
    "zipcode": "757322"
  },
  "DEM.AX": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Pollution & Treatment Controls",
    "long_name": "De.mem Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "DEMEM LTD FPO",
    "state": "VIC",
    "summary": "De.mem Limited designs, builds, owns, and operates de-centralized water and waste water treatment systems for its customers in industrial, municipal, and residential sectors in Singapore, Australia, and Germany. The company offers disinfection systems, such as chlorination and ultraviolet systems; biological treatments that include aerobic and anaerobic treatments; chemical dosing systems and chemical treatments; membrane based water treatment systems, including microfiltration, ultrafiltration, hollow fiber nano filtration, reverse osmosis, membrane bioreactors, and hollow fire forward osmosis; and other specialized treatment processes, such as dissolved air filtration, media filtration, and ion exchange. It also provides programmable logic controller and automation tools; and sludge management services. In addition, the company offers potable water supply, sewage treatment, industrial waste water, recycling, desalination, and process water solutions. Further, it provides operation and maintenance of water or waste water treatment systems; consulting, engineering, and optimization services; and technical advisory services. The company serves mining, infrastructure, electronics, chemicals, oil and gas, and food and beverage industries. De.mem Limited was founded in 2013 and is based in South Melbourne, Australia.",
    "website": "http://www.demembranes.com",
    "zipcode": "3205"
  },
  "DM2.F": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "De.mem Limited",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "DE.MEM LTD O.N.",
    "state": "VIC",
    "summary": "De.mem Limited designs, builds, owns, and operates de-centralized water and waste water treatment systems for its customers in industrial, municipal, and residential sectors in Singapore, Australia, and Germany. The company offers disinfection systems, such as chlorination and ultraviolet systems; biological treatments that include aerobic and anaerobic treatments; chemical dosing systems and chemical treatments; membrane based water treatment systems, including microfiltration, ultrafiltration, hollow fiber nano filtration, reverse osmosis, membrane bioreactors, and hollow fire forward osmosis; and other specialized treatment processes, such as dissolved air filtration, media filtration, and ion exchange. It also provides programmable logic controller and automation tools; and sludge management services. In addition, the company offers potable water supply, sewage treatment, industrial waste water, recycling, desalination, and process water solutions. Further, it provides operation and maintenance of water or waste water treatment systems; consulting, engineering, and optimization services; and technical advisory services. The company serves mining, infrastructure, electronics, chemicals, oil and gas, and food and beverage industries. De.mem Limited was founded in 2013 and is based in South Melbourne, Australia.",
    "website": "http://www.demembranes.com",
    "zipcode": "3205"
  },
  "DOCKF": {
    "city": "Vancouver",
    "country": "Canada",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Beyond Medical Technologies Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "BEYOND MEDICAL TECHNOLOGIES INC",
    "state": "BC",
    "summary": "Beyond Medical Technologies Inc., an industrial/technology company, develops waste digester systems for food and pharmaceuticals industries in Canada. Its Organivore and Pharmavore waste digester systems turns organic waste into clean water. The company also engages in the manufacturing and distribution of personal protective equipment, including medical grade face masks. In addition, it offers health communications platform that facilitates doctors to streamline communications with their patients and remotely monitor them. The company was formerly known as Micron Waste Technologies Inc. The company was incorporated in 2006 and is headquartered in Vancouver, Canada.",
    "website": "http://beyondmd.ca",
    "zipcode": "V6C 1G8"
  },
  "DOCT.CN": {
    "city": "Vancouver",
    "country": "Canada",
    "currency": "CAD",
    "exchange": "CNQ",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Beyond Medical Technologies Inc.",
    "market": "ca_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "BeyondMedTech",
    "state": "BC",
    "summary": "Beyond Medical Technologies Inc., an industrial/technology company, develops waste digester systems for food and pharmaceuticals industries in Canada. Its Organivore and Pharmavore waste digester systems turns organic waste into clean water. The company also engages in the manufacturing and distribution of personal protective equipment, including medical grade face masks. In addition, it offers health communications platform that facilitates doctors to streamline communications with their patients and remotely monitor them. The company was formerly known as Micron Waste Technologies Inc. The company was incorporated in 2006 and is headquartered in Vancouver, Canada.",
    "website": "http://beyondmd.ca",
    "zipcode": "V6C 1G8"
  },
  "DSOX": {
    "city": "Vancouver",
    "country": "Canada",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Triton Emission Solutions Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "TRITON EMISSION SOLUTIONS INC",
    "state": "BC",
    "summary": "Triton Emission Solutions Inc. develops and markets emission abatement technologies for the marine industry worldwide. It offers bio scrubber technology, a system designed to reduce the maintenance cost and premature failure of gas turbine engines by removing alkali metals; and DSOX-20, a pre-combustion fuel purification system that is designed to remove alkali metals, such as sulfur and sodium from heavy marine fuel. It also provides Njord exhaust gas scrubber system that clean the exhaust gases from excess sulfur released from the internal combustion process within ships engine. The company was formerly known as Poly Shield Technologies Inc. and changed its name to Triton Emission Solutions Inc. in August 2014. Triton Emission Solutions Inc. was incorporated in 2000 and is based in Vancouver, Canada.",
    "website": "http://www.tritoninc.com",
    "zipcode": "V6E 4A4"
  },
  "DST.CN": {
    "city": "Montreal",
    "country": "Canada",
    "currency": "CAD",
    "exchange": "CNQ",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Dundee Sustainable Technologies Inc.",
    "market": "ca_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "DundeeSustain",
    "state": "QC",
    "summary": "Dundee Sustainable Technologies Inc. engages in the development and commercialization of technologies for the treatment of refractory materials in the mining industry in Canada and internationally. It focuses on the commercialization of CLEVR process, which extracts precious metals, as well as removes and stabilizes contaminants, such as arsenic, antimony, and cadmium; and GlassLock process, which stabilizes arsenic, forms scorodite, and produces an insoluble glass residue that meets environmental requirements. The company extracts precious and base metals from ores, concentrates, and tailings. It also provides technical services to customers in the mining industry to evaluate processing alternatives. The company was formerly known as Nichromet Extraction Inc. and changed its name to Dundee Sustainable Technologies Inc. in January 2014. Dundee Sustainable Technologies Inc. was incorporated in 1997 and is headquartered in Montreal, Canada. Dundee Sustainable Technologies Inc. is a subsidiary of Dundee Corporation.",
    "website": "http://www.dundeetechnologies.com",
    "zipcode": "H3A 2W5"
  },
  "E0W.F": {
    "city": "Pittsburgh",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Evoqua Water Technologies Corp.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "EVOQUA WATER TECHN.DL-,01",
    "state": "PA",
    "summary": "Evoqua Water Technologies Corp. provides water and wastewater treatment systems and technologies, and mobile and emergency water supply solutions and services for industrial, commercial, and municipal water treatment markets. It operates in two segments, Integrated Solutions and Services, and Applied Product Technologies. The Integrated Solutions and Services segment offers capital systems and related recurring aftermarket services, parts, and consumables, as well as long-term and short-term service contracts, and emergency services for treating industrial process water, utility water, and wastewater. This segment also provides odor and corrosion control services for municipalities. It serves healthcare, pharmaceutical, light manufacturing, microelectronics, food and beverage, and power and chemical processing industries. The Applied Product Technologies segment offers advanced filtration and separation products, such as VAF self-cleaning filters, Ionpure technologies, and Vortisand systems; wastewater treatment technologies, including the BioMag systems, clarification systems, and odor control and sludge management solutions; disinfection solutions from chlorine to ultraviolet light and ozone technologies; electrocatalytic and materials, which include electro chlorination, cathodic protection, and anode products; and aquatics technologies and solutions. This segment serves recreational and commercial pool market. The company has operations in the United States, Canada, the United Kingdom, the Netherlands, Germany, Australia, China, Singapore, Korea, and India. Evoqua Water Technologies Corp. was incorporated in 2013 and is headquartered in Pittsburgh, Pennsylvania.",
    "website": "http://www.evoqua.com",
    "zipcode": "15222"
  },
  "EAUI": {
    "city": "Kennesaw",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "EAU Technologies, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "EAU TECHNOLOGIES INC",
    "state": "GA",
    "summary": "EAU Technologies, Inc. develops, manufactures, and markets equipment that uses water electrolysis to create non-toxic cleaning and disinfecting fluids for food safety applications and dairy drinking water in the United States. Its products include Primacide A, a disinfecting and sanitizing fluid that kills bacteria, yeast, molds, viruses, and other organisms; Primacide B, an alkaline based cleaner; and Primacide C, which is used to stabilize acid water. The company's fluids are used in commercial food processing, and organic or non-organic agricultural and consumer products that clean, disinfect, remediate, hydrate, and moisturize. It markets its products primarily for food and beverage processing, dairy production and processing, meat and poultry processing, and agricultural grow-out and processing industries, as well as environmental remediation, medical, seafood processing, and grocery store produce and meat departments. The company was formerly known as Electric Aquagenics Unlimited, Inc. and changed its name to EAU Technologies, Inc. in January 2007. EAU Technologies, Inc. was founded in 1998 and is headquartered in Kennesaw, Georgia.",
    "website": "http://www.eautechnologies.com",
    "zipcode": "30152"
  },
  "EAWD": {
    "city": "St. Petersburg",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Energy and Water Development Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ENERGY AND WATER DEVELOPMENT CO",
    "state": "FL",
    "summary": "Energy and Water Development Corp., a green-tech engineering solutions company, focuses on delivering water generation, water purification, and green energy production technologies. The company provides atmosphere water generators and aqua mission systems to produce pure potable water from the air's humidity; solar power water purification systems for water purification utilizing solar, photovoltaic, wind, and renewable energy; and steam energy generators. It also offers plasma converter system, a closed-loop elemental recycling system that destroys waste and produces commodity products; and Plasma Arc Flow, a patented technology that converts most liquid waste into a clean fuel called syngas. In addition, the company provides engineering and technical services; and design, construction, maintenance, and specialty consulting services to private companies, government entities, and non-government organizations. Further, it builds water and energy systems. The company was formerly known as Eurosport Active World Corp. and changed its name to Energy and Water Development Corp. in October 2019. Energy and Water Development Corp. is based in St. Petersburg, Florida.",
    "website": "http://www.eawctechnologies.com",
    "zipcode": "33702"
  },
  "ECT.AX": {
    "city": "South Yarra",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Environmental Clean Technologies Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ENVIRON FPO",
    "state": "VIC",
    "summary": "Environmental Clean Technologies Limited invests in, researches, develops, and commercializes technologies in the environmental and energy industries in Australia. Its technologies include Coldry, a method to dewater brown coal and transform this resource into a black coal equivalent; and HydroMOR, a process for producing iron product from low-rank coal with brown coal and iron oxide bearing material, such as mill scale, nickel tailings, and high or low-grade iron ore. The company also offers catalytic de-polymerization technology that enables the production of automotive diesel from a range of hydrocarbon-based inputs, including various waste and hydrocarbon streams, such as waste timber, end-of-life plastics, and low-rank coal; and catalytic organic hydrogen generation technology for producing hydrogen from lignite. It also provides equity lending facility loans. Environmental Clean Technologies Limited was founded in 1985 and is based in South Yarra, Australia.",
    "website": "http://www.ectltd.com.au",
    "zipcode": "3141"
  },
  "EESH": {
    "city": "Chino Valley",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "EESTech, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "EESTECH INC",
    "state": "AZ",
    "summary": "EESTech, Inc. provides waste management solutions to the mining and resource industries worldwide. It promotes modular waste to energy platforms that can be fuelled by waste combustibles to generate electrical energy; and offers water systems for the treatment and purification of waste water streams. The company was formerly known as Aqua Dyne, Inc. and changed its name to EESTech, Inc. in June 2006. EESTech, Inc. was founded in 2000 and is based in Chino Valley, Arizona.",
    "website": "http://www.eestechinc.com",
    "zipcode": "86323"
  },
  "EGL.AX": {
    "city": "Notting Hill",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Pollution & Treatment Controls",
    "long_name": "The Environmental Group Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ENVN GROUP FPO",
    "state": "VIC",
    "summary": "The Environmental Group Limited engages in the design, application, and servicing of gas and vapor emission control systems, and inlet and exhaust systems for gas turbines in Australia and internationally. Its products include gas turbine inlet filtration systems (filter houses), inlet cooling/fogging systems, acoustical components, expansion joints, and complete exhaust systems with guillotine and diverter dampers; and a range of air pollution control equipment and services for the removal of pollutants from industrial gas and air streams. The company also provides engineering, and water treatment services to various industries; and installation, commissioning, service, and maintenance of steam boilers, inert gas generators, hot water boilers, valves, thermal oil heaters, economizers, and burners. The Environmental Group Limited was incorporated in 1923 and is headquartered in Notting Hill, Australia.",
    "website": "http://www.environmental.com.au",
    "zipcode": "3168"
  },
  "EIHC": {
    "city": "West Conshohocken",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Environmental Infrastructure Holdings Corp",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ENVIRONMENTAL INFRASTRUCTURE HL",
    "state": "PA",
    "summary": "Environmental Infrastructure Holdings Corp., an equipment solutions provider, through its subsidiary, Equisol, LLC, provides environmentally friendly products, services, and engineering solutions. It designs, fabricates, and sells equipment systems, including water treatment systems; sells equipment systems and spare parts, as well as basic maintenance, repair, and operations components; offers optimization, calibration, installation, and maintenance services; and provides environmental engineering and consulting services. It primarily serves refineries, power plants, engineering firms, and manufacturing facilities, as well as supports commercial, municipal, and governmental facilities principally in the United States. The company is headquartered in West Conshohocken, Pennsylvania.",
    "website": "http://www.environmentalinfrastructureholdings.com",
    "zipcode": "19428"
  },
  "EJI.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Ebara Jitsugyo Co.,Ltd.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "EBARA JITSUGYO",
    "state": null,
    "summary": "Ebara Jitsugyo Co.,Ltd. manufactures and sells environment and related products in Japan. It is also involved in the engineering operations for waterworks and sewerage. In addition, the company sells various industrial machines, such as a pump and air-conditioning/heating and cooling equipment, etc. Ebara Jitsugyo Co.,Ltd. was founded in 1946 and is headquartered in Tokyo, Japan.",
    "website": "http://www.ejk.co.jp",
    "zipcode": "104-8174"
  },
  "EMFGF": {
    "city": "White Plains",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Fluence Corporation Limited",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "FLUENCE CORPORATION LTD",
    "state": "NY",
    "summary": "Fluence Corporation Limited provides water and wastewater treatment, and reuse solutions for the municipal, commercial, and industrial markets worldwide. The company offers NIROBOX for desalination of seawater and brackish water, as well as for the treatment of fresh and wastewater; NIROFLEX systems for desalination; ultrafiltration systems; and reverse osmosis systems. It also provides wastewater treatment products, such as Aspiral, a wastewater treatment solution; SUBRE membrane aerated biofilm reactor modules; EcoBox water reuse systems; Tipton packaged wastewater treatment plants; aeration equipment comprising aerators, mixers, and diffusers; and dissolved air flotation systems. In addition, the company offers food processing and recovery solutions; and waste-to-energy solutions. Further, it provides project finance, Smart Operations data analytics software, and after-sale support services. Fluence Corporation Limited was founded in 2017 and is headquartered in White Plains, New York.",
    "website": "http://www.fluencecorp.com",
    "zipcode": "10606"
  },
  "EMHI": {
    "city": "Lakewood",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "East Morgan Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "EAST MORGAN HOLDINGS INC",
    "state": "NJ",
    "summary": "East Morgan Holdings, Inc. provides environmental technologies in the United States. The company offers Air Emissions Control Technology, a mercury control technology, for the treatment of mercury and other heavy metals in contaminated soils, sludges, and other solid waste streams, as well as to remediate the ash, sludge, and effluent by-products generated in the coal-fired power plants. Its technologies also include chemical systems for self-remediating batteries. The company was founded in 2001 and is based in Lakewood, New Jersey.",
    "website": "http://www.eastmorgan.com",
    "zipcode": "08701"
  },
  "ENVI.AS": {
    "city": "Amersfoort",
    "country": "Netherlands",
    "currency": "EUR",
    "exchange": "AMS",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Envipco Holding N.V.",
    "market": "nl_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "ENVIPCO",
    "state": null,
    "summary": "Envipco Holding N.V., together with its subsidiaries, designs, develops, manufactures, and sells or leases reverse vending machines (RVM) for the collection and processing of used beverage containers in the North America, Europe, and internationally. The company also provides technical support, RVM maintenance, and accounting services to the retail stores, bottlers, and distributors for containers redeemed through its machines. In addition, it offers deposit, handling fees, scrap reconciliations, commodity brokerage, clearing house functions, and accounting services. Further, the company provides materials handling services primarily in the northeastern part of the United States. The company was founded in 1998 and is headquartered in Amersfoort, the Netherlands.",
    "website": "http://www.envipco.com",
    "zipcode": "3817 CH"
  },
  "ENVIP.OL": {
    "city": "Amersfoort",
    "country": "Netherlands",
    "currency": "NOK",
    "exchange": "OSL",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Envipco Holding N.V.",
    "market": "no_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "ENVIPCO HOLDING NV",
    "state": null,
    "summary": "Envipco Holding N.V., together with its subsidiaries, designs, develops, manufactures, and sells or leases reverse vending machines (RVM) for the collection and processing of used beverage containers in the North America, Europe, and internationally. The company also provides technical support, RVM maintenance, and accounting services to the retail stores, bottlers, and distributors for containers redeemed through its machines. In addition, it offers deposit, handling fees, scrap reconciliations, commodity brokerage, clearing house functions, and accounting services. Further, the company provides materials handling services primarily in the northeastern part of the United States. The company was founded in 1998 and is headquartered in Amersfoort, the Netherlands.",
    "website": "http://www.envipco.com",
    "zipcode": "3817 CH"
  },
  "ERII": {
    "city": "San Leandro",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Energy Recovery, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Energy Recovery, Inc.",
    "state": "CA",
    "summary": "Energy Recovery, Inc., together with its subsidiaries, designs, manufactures, and sells various solutions for industrial fluid-flow markets worldwide. The company operates through Water, and Oil & Gas segments. It designs, engineers, manufactures, and supplies various energy recovery devices (ERDs), including positive displacement isobaric ERDs and centrifugal-type ERDs, such as our hydraulic turbochargers; and high-pressure feed and circulation pumps. The company also provides spare parts, as well as repair, field, and commissioning services. In addition, it offers a solution to reduce energy consumption in natural gas processing, as well as to reduce waste, redundancy, and indirectly lower emissions associated with hydraulic fracturing; and products for use in the gas processing, chemical processing, and hydraulic fracturing applications. The company provides its products under the ERI, Ultra PX, PX, Pressure Exchanger, PX Pressure Exchanger (PX), PX PowerTrain, VorTeq, IsoBoost, AT, and AquaBold trademarks to large engineering, procurement, and construction (EPC) firms; end-users and industry consultants; original equipment manufacturers (OEMs); and aftermarket customers. Energy Recovery, Inc. was incorporated in 1992 and is headquartered in San Leandro, California.",
    "website": "http://www.energyrecovery.com",
    "zipcode": "94577"
  },
  "ESFS": {
    "city": "Tarzana",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Eco Safe Systems USA, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ECO-SAFE SYSTEMS USA INC",
    "state": "CA",
    "summary": "Eco Safe Systems USA, Inc. manufactures water treatment and water reclamation systems. It offers R-1000-HS Home Units for food and surface disinfection, and general cleanup in homes; R-1000 Restaurant Single Sink System for food and surface disinfection, and general cleanup in restaurants; R-1000-3S Restaurant Systems for restaurants or supermarkets; and MD-1500 System and MD-1500-C System to handle various departments of supermarkets or restaurants. The company also offers MD-2000 System for use on produce, meat, poultry, and seafood products to reduce bacteria counts, extend the shelf life, and reduce the risk of salmonella or any other bacteria or virus; and Ozone Hazmat Disinfection Systems for emergency first-responders to disinfect and decontaminate personnel and equipment after exposure to various biohazards and pathogens. In addition, it provides leasing services. The company serves various industries, including supermarkets, health care, food processing, restaurants, golf courses, laundry, animal care, and home system. Eco Safe Systems USA, Inc. was incorporated in 1998 and is headquartered in Tarzana, California.",
    "website": "http://www.ecosafeusa.com",
    "zipcode": "91356"
  },
  "ETII": {
    "city": "Pleasant Grove",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "EnviroTechnologies International, Inc",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ENVIROTECHNOLOGIES INTL INC",
    "state": "UT",
    "summary": "EnviroTechnologies International, Inc. develops and markets various environmentally safe technologies and products primarily in the oil and gas, food, and agriculture industries worldwide. Its food and product processing technologies include Cleaner Answer and Powered Water products that provide nontoxic and anti-microbial solutions for cleaning and sanitizing fruits and vegetables, meats, and fish for food packing and retail operations. The company also offers Powered Water, Bio-N-Liven, and Carbon and Greener Answer, which are non-toxic solutions to clean and remediate soils and water bodies damaged by oil exploration and retrieval, and to help extract natural products from rock formations in the oil and gas industry. EnviroTechnologies International, Inc. was incorporated in 2013 and is headquartered in Pleasant Grove, Utah.",
    "website": "http://www.envirotechnologiesinternational.com",
    "zipcode": "84062"
  },
  "EUW.F": {
    "city": "Ottawa",
    "country": "Canada",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Thermal Energy International Inc.",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "THERMAL ENERGY INTL",
    "state": "ON",
    "summary": "Thermal Energy International Inc. engages in the development, engineering, and supply of pollution control products, heat recovery systems, and condensate return solutions in North America, Europe, China, and internationally. Its products include GEM steam traps; FLU-ACE, a direct contact condensing heat recovery system that recycles the heat lost through the boiler flue gas exhaust; and DRY-REX, a low temperature biomass drying system. The company also provides turn-key thermal energy solutions; and sells water treatment products and services. It serves pharmaceutical, food and beverage, pulp and paper, hospital, chemical and petrochemical, and other industry sectors. Thermal Energy International Inc. was founded in 1991 and is headquartered in Ottawa, Canada.",
    "website": "http://www.thermalenergy.com",
    "zipcode": "K2E 7W5"
  },
  "EWS.V": {
    "city": "Ajax",
    "country": "Canada",
    "currency": "CAD",
    "exchange": "VAN",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Environmental Waste International Inc.",
    "market": "ca_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ENVIRONMENTAL WASTE INTERNATION",
    "state": "ON",
    "summary": "Environmental Waste International Inc., together with its subsidiaries, designs and develops environmental products for waste treatment and disposal in Canada and the United States. It researches, designs, develops, sells, and maintains systems based on the patented Reverse Polymerization process and related delivery system. The company offers systems for feed tire reduction, biological wastewater sterilization, shipboard food waste sterilization/dehydration, and batch-based infectious medical waste sterilization. Its tire system breaks the molecular bonds in tires and other rubber products and reduces them to their base components of carbon black, steel, and hydrocarbon vapors. The company also offers FS-6000 and FS-POD biocontainment and wastewater sterilization units; MD-1000, a three-stage, three chamber, medical waste reduction unit that produces a sterilized carbon residue; and AW-1000 to process and reduce animal waste into its constituents. Environmental Waste International Inc. was founded in 1987 and is based in Ajax, Canada.",
    "website": "http://www.ewi.ca",
    "zipcode": "L1S 1R5"
  },
  "FLC.AX": {
    "city": "White Plains",
    "country": "United States",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Fluence Corporation Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "FLUENCE FPO",
    "state": "NY",
    "summary": "Fluence Corporation Limited provides water and wastewater treatment, and reuse solutions for the municipal, commercial, and industrial markets worldwide. The company offers NIROBOX for desalination of seawater and brackish water, as well as for the treatment of fresh and wastewater; NIROFLEX systems for desalination; ultrafiltration systems; and reverse osmosis systems. It also provides wastewater treatment products, such as Aspiral, a wastewater treatment solution; SUBRE membrane aerated biofilm reactor modules; EcoBox water reuse systems; Tipton packaged wastewater treatment plants; aeration equipment comprising aerators, mixers, and diffusers; and dissolved air flotation systems. In addition, the company offers food processing and recovery solutions; and waste-to-energy solutions. Further, it provides project finance, Smart Operations data analytics software, and after-sale support services. Fluence Corporation Limited was founded in 2017 and is headquartered in White Plains, New York.",
    "website": "http://www.fluencecorp.com",
    "zipcode": "10606"
  },
  "FQCC": {
    "city": "Malvern",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Fuquan Capital Management, Inc.",
    "market": "us_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "FUQUAN CAPITAL MANAGEMENT INC",
    "state": "PA",
    "summary": "International Sustainability Group, Inc. manufactures and markets algae-based nutritional and algae-containing products. The company offers algae-based biomass for human, fish, and animal consumption; algae cakes for livestock and aquaculture products; astaxanthin for use in joint pain relief and treatments of muscular degeneration; omega-3 to prevent heart disease/cancer and boost the immune system; algae oils for producing bio-fuel; and bio-oil, bio-plastic, and carbon reduction and sequestration solutions. It provides nutraceutical and natural products that prevent and treat diseases; and spirulina, a nutrient and protein solution for human dietary functions and malnutrition. The company also offers sports medicine devices to increase mobility and balance, decrease joint pain, define muscle tone, and promote weight loss. It serves nutraceutical, pharmaceutical, and health and wellness markets. The company is based in Malvern, Pennsylvania. As of September 28, 2017, International Sustainability Group, Inc. operates as a subsidiary of Fuquan Capital Corporation, Inc.",
    "website": "http://www.isgpglobal.com",
    "zipcode": "19355"
  },
  "FSG.F": {
    "city": "Oak Brook",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Federal Signal Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "FED. SIGNAL CORP.  DL 1",
    "state": "IL",
    "summary": "Federal Signal Corporation, together with its subsidiaries, designs, manufactures, and supplies a suite of products and integrated solutions for municipal, governmental, industrial, and commercial customers in the United States, Canada, Europe, and internationally. It operates through two segments, Environmental Solutions Group, and Safety and Security Systems Group. The Environmental Solutions Group segment offers a range of street sweepers, sewer cleaners, industrial vacuum loaders, safe-digging trucks, waterblasting equipment, road-marking and line-removal equipment, dump truck bodies, and trailers under the Elgin, Vactor, Guzzler, TRUVAC, Westech, Jetstream, Mark Rite Lines, Ox Bodies, Crysteel, J-Craft, Duraclass, Rugby, and Travis brand names. It also offers refuse and recycling collection vehicles, camera systems, ice resurfacing equipment, and snow-removal equipment. In addition, this segment engages in the sale of parts, service and repair, equipment rental, and training activities. The Safety and Security Systems Group segment provides systems and products for community alerting, emergency vehicles, first responder interoperable communications, and industrial communications. Its products include vehicle lightbars and sirens, industrial signaling equipment, public warning systems, general alarm systems, and public address systems. This segment sells its products under the Federal Signal, Federal Signal VAMA, and Victor brand names. The company sells its products through wholesaler, distributor, independent manufacturer representative, original equipment manufacturer, and direct sales force, as well as independent foreign distributor. Federal Signal Corporation was founded in 1901 and is headquartered in Oak Brook, Illinois.",
    "website": "http://www.federalsignal.com",
    "zipcode": "60523"
  },
  "FSS": {
    "city": "Oak Brook",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Federal Signal Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "Federal Signal Corporation",
    "state": "IL",
    "summary": "Federal Signal Corporation, together with its subsidiaries, designs, manufactures, and supplies a suite of products and integrated solutions for municipal, governmental, industrial, and commercial customers in the United States, Canada, Europe, and internationally. It operates through two segments, Environmental Solutions Group, and Safety and Security Systems Group. The Environmental Solutions Group segment offers a range of street sweepers, sewer cleaners, industrial vacuum loaders, safe-digging trucks, waterblasting equipment, road-marking and line-removal equipment, dump truck bodies, and trailers under the Elgin, Vactor, Guzzler, TRUVAC, Westech, Jetstream, Mark Rite Lines, Ox Bodies, Crysteel, J-Craft, Duraclass, Rugby, and Travis brand names. It also offers refuse and recycling collection vehicles, camera systems, ice resurfacing equipment, and snow-removal equipment. In addition, this segment engages in the sale of parts, service and repair, equipment rental, and training activities. The Safety and Security Systems Group segment provides systems and products for community alerting, emergency vehicles, first responder interoperable communications, and industrial communications. Its products include vehicle lightbars and sirens, industrial signaling equipment, public warning systems, general alarm systems, and public address systems. This segment sells its products under the Federal Signal, Federal Signal VAMA, and Victor brand names. The company sells its products through wholesaler, distributor, independent manufacturer representative, original equipment manufacturer, and direct sales force, as well as independent foreign distributor. Federal Signal Corporation was founded in 1901 and is headquartered in Oak Brook, Illinois.",
    "website": "http://www.federalsignal.com",
    "zipcode": "60523"
  },
  "FTEK": {
    "city": "Warrenville",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Fuel Tech, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "Fuel Tech, Inc.",
    "state": "IL",
    "summary": "Fuel Tech, Inc. provides boiler optimization, efficiency improvement, and air pollution reduction and control solutions to utility and industrial customers worldwide. It operates through two segments, Air Pollution Control Technology and FUEL CHEM Technology. The Air Pollution Control Technology segment offers technologies to reduce nitrogen oxide (NOx) emissions in flue gas from boilers, incinerators, furnaces, and other stationary combustion sources by low and ultra-low NOx burners; over-fire air systems; NOxOUT and HERT selective non-catalytic reduction systems; advanced selective catalytic reduction systems comprising ULNB, OFA, and SNCR components, as well as downsized SCR catalyst, ammonia injection grid, and graduated straightening grid systems; NOxOUT CASCADE and NOxOUT-SCR processes; ULTRA technology; and flue gas conditioning systems. The FUEL CHEM Technology segment provides programs to improve the efficiency, reliability, fuel flexibility, boiler heat rate, and environmental status of combustion units by controlling slagging, fouling, corrosion, opacity, and acid plume, as well as the formation of sulfur trioxide, ammonium bisulfate, particulate matter, sulfur dioxide, and carbon dioxide through the addition of chemicals into the furnace using TIFI targeted in-furnace injection technology. This segment offers its FUEL CHEM program for plants operating in the electric utility, industrial, pulp and paper, waste-to-energy, and university, and district heating markets; and the owners of boilers, furnaces, and other combustion units. The company was incorporated in 1987 and is headquartered in Warrenville, Illinois.",
    "website": "http://www.ftek.com",
    "zipcode": "60555-1617"
  },
  "FUE1.F": {
    "city": "Warrenville",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Fuel Tech, Inc.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "FUEL TECHS INC.  DL-,01",
    "state": "IL",
    "summary": "Fuel Tech, Inc. provides boiler optimization, efficiency improvement, and air pollution reduction and control solutions to utility and industrial customers worldwide. It operates through two segments, Air Pollution Control Technology and FUEL CHEM Technology. The Air Pollution Control Technology segment offers technologies to reduce nitrogen oxide (NOx) emissions in flue gas from boilers, incinerators, furnaces, and other stationary combustion sources by low and ultra-low NOx burners; over-fire air systems; NOxOUT and HERT selective non-catalytic reduction systems; advanced selective catalytic reduction systems comprising ULNB, OFA, and SNCR components, as well as downsized SCR catalyst, ammonia injection grid, and graduated straightening grid systems; NOxOUT CASCADE and NOxOUT-SCR processes; ULTRA technology; and flue gas conditioning systems. The FUEL CHEM Technology segment provides programs to improve the efficiency, reliability, fuel flexibility, boiler heat rate, and environmental status of combustion units by controlling slagging, fouling, corrosion, opacity, and acid plume, as well as the formation of sulfur trioxide, ammonium bisulfate, particulate matter, sulfur dioxide, and carbon dioxide through the addition of chemicals into the furnace using TIFI targeted in-furnace injection technology. This segment offers its FUEL CHEM program for plants operating in the electric utility, industrial, pulp and paper, waste-to-energy, and university, and district heating markets; and the owners of boilers, furnaces, and other combustion units. The company was incorporated in 1987 and is headquartered in Warrenville, Illinois.",
    "website": "http://www.ftek.com",
    "zipcode": "60555-1617"
  },
  "FVC-R.BK": {
    "city": "Bangkok",
    "country": "Thailand",
    "currency": "THB",
    "exchange": "SET",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Filter Vision Public Company Limited",
    "market": "th_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "FILTER VISION PUBLIC COMPANY LI",
    "state": null,
    "summary": "Filter Vision Public Company Limited engages in the design, assembly, installation, maintenance, and distribution of pure water treatment systems in Thailand. It offers filter cartridges and filter housings, softeners, and vessel assemblies; water filtration systems, rainwater harvesting systems, water injection PAD, ozone spray bottles, and infection control hydro ozonizers; soup kettles, sandwich makers, food warmers, and fryers; and fiberglass filtration tanks, automatic filtration heads, ultraviolet disinfection machines, bun steamers, beverage dispensers, ice making machines, fountain drink dispensers, and pneumatic tube systems, as well as other products. The company also operates clinical centers for providing hemodialysis services for patients in end-stage chronic kidney disease; and rents, distributes, and maintains tools and diagnosis equipment for medical services, including medical supplies and appliances. In addition, it provides medical services and medical beauty treatment services. The company serves the commercial and residential, industrial and original equipment manufacturing, medical service, and medical beauty treatment service sectors. Filter Vision Public Company Limited was founded in 1995 and is headquartered in Bangkok, Thailand.",
    "website": "http://www.filtervision.co.th",
    "zipcode": "10510"
  },
  "FVC.BK": {
    "city": "Bangkok",
    "country": "Thailand",
    "currency": "THB",
    "exchange": "SET",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Filter Vision Public Company Limited",
    "market": "th_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "FILTER VISION PUBLIC COMPANY LI",
    "state": null,
    "summary": "Filter Vision Public Company Limited engages in the design, assembly, installation, maintenance, and distribution of pure water treatment systems in Thailand. It offers filter cartridges and filter housings, softeners, and vessel assemblies; water filtration systems, rainwater harvesting systems, water injection PAD, ozone spray bottles, and infection control hydro ozonizers; soup kettles, sandwich makers, food warmers, and fryers; and fiberglass filtration tanks, automatic filtration heads, ultraviolet disinfection machines, bun steamers, beverage dispensers, ice making machines, fountain drink dispensers, and pneumatic tube systems, as well as other products. The company also operates clinical centers for providing hemodialysis services for patients in end-stage chronic kidney disease; and rents, distributes, and maintains tools and diagnosis equipment for medical services, including medical supplies and appliances. In addition, it provides medical services and medical beauty treatment services. The company serves the commercial and residential, industrial and original equipment manufacturing, medical service, and medical beauty treatment service sectors. Filter Vision Public Company Limited was founded in 1995 and is headquartered in Bangkok, Thailand.",
    "website": "http://www.filtervision.co.th",
    "zipcode": "10510"
  },
  "GCHK": {
    "city": "San Francisco",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "GreenChek Technology Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "GREENCHEK TECHNOLOGY INC",
    "state": "CA",
    "summary": "GreenChek Technology Inc., a development stage company, focuses on manufacturing, marketing, and distributing hydrogen technology products that are designed to reduce gas emissions by motor vehicles. The company develops emission reduction device (ERD-3.0) for installation on various vehicles with an internal combustion engine. Its ERD-3.0 product generates hydrogen by means of electrolysis. The company was formerly known as Ridgestone Resources, Inc. and changed its name to GreenChek Technology Inc. in August 2008. GreenChek Technology Inc. was founded in 2006 and is based in San Francisco, California.",
    "website": "http://www.greenchektech.com",
    "zipcode": "94111"
  },
  "GEL.MI": {
    "city": "Castelfidardo",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Gel S.p.A.",
    "market": "it_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "GEL",
    "state": "AN",
    "summary": "Gel S.p.A. engages in the design, manufacture, and sale of water treatment products in Italy. The company offers filters, water softeners, dosing units, reverse osmosis, and conditioning products for private users; and leachate, medical water, mobile plants, food and beverage, drinking water, and desalination solutions for industrial users. It also provides magnetic scale reducers, column filters, metering pumps, antilegionella systems, UV sterilizers, water purifiers, measuring and control instruments, and neutralizing filters for acidic condensates; descaling chemicals, technical products, and equipment for flushing and filling; and conditioners, such as heating, cooling, solar thermal, and water systems, as well as steam generators for professional users. GEL S.p.A. was founded in 1979 and is based in Castelfidardo, Italy.",
    "website": "http://www.gel.it",
    "zipcode": "60022"
  },
  "GLEC": {
    "city": "Montclair",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Global Ecology Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "GLOBAL ECOLOGY COR",
    "state": "NJ",
    "summary": "Global Ecology Corporation, through its subsidiary and joint ventures, engages in the production and sale of soil and water remediation technologies. Its products include Mobile PureWater System, a mobile water purification system for use in areas where safe and clean drinking water is scarce or affected by natural disasters; and IMS1000, an ionized mineral solution for treating reservoirs, lakes, and other large bodies of water, as well as for large HVAC systems, waste water systems, drilling water de-contamination, and various agricultural applications. The company's products also comprise soil remediation products, including natural fertilizers/soil additives and compost products for enhancing crop yield and turf growth. It has a strategic partnership with International Renewable Energy Organization. The company was formerly known as Homeland Security Network, Inc. and changed its name to Global Ecology Corporation in August 2009. Global Ecology Corporation was founded in 1986 and is based in Montclair, New Jersey.",
    "website": "http://www.geco.us",
    "zipcode": "07042"
  },
  "GMEV": {
    "city": "Hong Kong",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "GME Innotainment, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "GME INNOTAINMENT INC",
    "state": null,
    "summary": "GME Innotainment, Inc. engages in artist management and event management businesses in Hong Kong, China, and the Asia-Pacific. The company's activities include movie production, distribution, and licensing; music production; talent acquisition and management; concert and event management; and social media management for artists and celebrities. It offers artist management services to adolescents and young adults, brand owners, and institutional customers; and entertainment services to cinema-goers, movie investors, cinema circuits, and broadcasting channel providers. The company was formerly known as Great China Mania Holdings, Inc. and changed its name to GME Innotainment, Inc. in June 2015. GME Innotainment, Inc. was incorporated in 1983 and is headquartered in Hong Kong, Hong Kong.",
    "website": "http://www.gmeinnotainment.com",
    "zipcode": null
  },
  "GOGR": {
    "city": "Monroe",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Go Green Global Technologies Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "GO GREEN GLOBAL TECHNOLOGIES CO",
    "state": "CT",
    "summary": "Go Green Global Technologies Corp. operates as a water and fuel technology licensing, marketing, manufacturing, and development company worldwide. The company, through its wholly owned subsidiary, Go Green Technologies Corp., provides solutions utilizing the proprietary patented Sonical technology for non-chemical water treatment and fuel combustion applications. It offers Sonical Water Treatment System for food, coffee, home and restaurant, pharma, and other industries, including paper, textile, electronics, petrochemical, plastics molding, glass trade, and tanneries; and Sonical Fuel Charger, an electro-physical device, which is installed in the fuel supply circuit feeding motors, burners, and boilers that are used in cars, trucks, boats, and boilers. The company was founded in 2009 and is based in Monroe, Connecticut.",
    "website": "http://www.gogreentechcorp.com",
    "zipcode": "06468"
  },
  "GRN.TO": {
    "city": "Burnaby",
    "country": "Canada",
    "currency": "CAD",
    "exchange": "TOR",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Greenlane Renewables Inc.",
    "market": "ca_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "GREENLANE RENEWABLES INC",
    "state": "BC",
    "summary": "Greenlane Renewables Inc. designs, develops, sells, and services a range of biogas upgrading systems worldwide. The company's systems remove impurities and separate carbon dioxide from biomethane in the raw biogas created from anaerobic decomposition of organic waste at landfills, wastewater treatment plants, and farms and for injection food waste facilities into the natural gas grid or for direct use as vehicle fuel. It offers water wash, pressure swing adsorption, and membrane separation technologies. The company markets and sells its upgrading systems under the Greenlane Biogas brand. The company was formerly known as Creation Capital Corp. and changed its name to Greenlane Renewables Inc. in June 2019. Greenlane Renewables Inc. was founded in 1986 and is headquartered in Burnaby, Canada.",
    "website": "http://www.greenlanerenewables.com",
    "zipcode": "V5G 4X5"
  },
  "GRNWF": {
    "city": "Burnaby",
    "country": "Canada",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Greenlane Renewables Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "GREENLANE RENEWABLES INC",
    "state": "BC",
    "summary": "Greenlane Renewables Inc. designs, develops, sells, and services a range of biogas upgrading systems worldwide. The company's systems remove impurities and separate carbon dioxide from biomethane in the raw biogas created from anaerobic decomposition of organic waste at landfills, wastewater treatment plants, and farms and for injection food waste facilities into the natural gas grid or for direct use as vehicle fuel. It offers water wash, pressure swing adsorption, and membrane separation technologies. The company markets and sells its upgrading systems under the Greenlane Biogas brand. The company was formerly known as Creation Capital Corp. and changed its name to Greenlane Renewables Inc. in June 2019. Greenlane Renewables Inc. was founded in 1986 and is headquartered in Burnaby, Canada.",
    "website": "http://www.greenlanerenewables.com",
    "zipcode": "V5G 4X5"
  },
  "GVS.MI": {
    "city": "Zola Predosa",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Pollution & Treatment Controls",
    "long_name": "GVS S.p.A.",
    "market": "it_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "GVS",
    "state": "BO",
    "summary": "GVS S.p.A., together with its subsidiaries, produces and sells plastic filters and components for healthcare, life science, automotive, appliance, safety, and commercial and industrial filtration applications in Italy and internationally. It offers health care products, such as healthcare gas/air and liquid filtration products for anesthesia, surgery insufflation, ventilation, blood filtration, transfusion, infusion, and hemodialysis; and syringe and capsule filters, liquid sample microbiology products, and protein microarray products, as well as microporous filtration, protein transfer, and nucleic acid binding membranes for laboratory solutions. The company also offers automotive products, including fuel and diesel injector, ABS/ESP-braking, steering and transmission, fuel tank, and SCR technology-urea filters, as well as ventilation membranes and throttle bodies; and sheet and panel filters, bag and cartridge filters, HEPA and high capacity HEPA products, carbon and molecular filtration products, and accessories and housings for commercial and industrial applications. In addition, it provides cylinder and conical, circular, radial or standard, square or rectangular, and pad and pre-filters for use in appliances; respiratory safety and bio-safety products for personal protection applications; and OEM membranes comprising polyethersulfone, polycarbonate track etched, polyester track etched, polyvinylidene difluoride, nylon, nitrocellulose, cellulose acetate, and rigenerated cellulose membranes. GVS S.p.A. was formerly known as GVS S.r.l. and changed its name to GVS S.p.A. in 20001. The company was founded in 1979 and is based in Zola Predosa, Italy. GVS S.p.A. operates as a subsidiary of GVS Group S.p.A.",
    "website": "http://www.gvs.com",
    "zipcode": "40069"
  },
  "GWTR": {
    "city": "Indianapolis",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Global Water Technologies, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "GLOBAL WATER TECHNOLOGIES",
    "state": "IN",
    "summary": "Global Water Technologies, Inc., through its subsidiary, Electric H2O, Inc., identifies, develops, and commercializes non-chemical, filtration, and other technologies to improve water efficiency in the United States. The company utilizes non-chemical water treatment to prevent scaling in cooling towers through its line of ED2000, ED2000PLUS, and AquaPhysics systems. Its technologies address scale, microbiological growth, corrosion, and fouling in cooling water systems. The company also engages in developing software-as-a-service platform to provide usage data, analysis, education, and rewards to the customers of utilities; and reviewing and commercializing underground pipeline technologies. The company was formerly known as Fi-Tek VI, Inc. and changed its name to Global Water Technologies, Inc. in November 1997. Global Water Technologies, Inc. was incorporated in 1990 and is based in Indianapolis, Indiana.",
    "website": "http://www.gwtr.com",
    "zipcode": "46202"
  },
  "HZS.F": {
    "city": "Osaka",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Hitachi Zosen Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "HITACHI ZOSEN CORP.",
    "state": null,
    "summary": "Hitachi Zosen Corporation engages in the engineering, procurement, construction, and after-sales services, as well as operation and maintenance of energy-from-waste plants in Japan and internationally. It operates through three segments: Environmental Systems & Industrial Plants, Machinery, and Infrastructure. The Environmental Systems & Industrial Plants segment builds various water-related facilities, including sludge recycling centers and desalination plants, and energy-related facilities, including biomass plants. The Machinery segment provides marine diesel engines, press machines for automobiles, pressure vessels for petrochemical plants, and other process equipment, as well as various types of precision machinery, such as semiconductor, food, and medical related equipment; and hydrogen generation systems. This segment also offers solutions in various industries, such as mitigating environmental burdens and streamlining manufacturing processes for higher efficiency, as well as support services ranging from development to servicing. The Infrastructure segment engages in building, monitoring, maintenance, repair, and strengthening of bridges and hydraulic gates for dams and rivers; developing shield tunneling machines for the construction of underground motorways and subway tracks, and flap-gate type seawalls against flood disaster due to tsunamis or storm surges. The company was founded in 1881 and is headquartered in Osaka, Japan.",
    "website": "http://www.hitachizosen.co.jp",
    "zipcode": "559-8559"
  },
  "INTWF": {
    "city": "Port Coquitlam",
    "country": "Canada",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Sharc International Systems Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SHARC INTERNATIONAL SYSTEMS INC",
    "state": "BC",
    "summary": "Sharc International Systems Inc. provides wastewater heat exchange products and services for commercial, industrial, public utilities, and residential development projects in Canada, the United Kingdom, and internationally. It offers PIRANHA and SHARC systems that provide energy savings and reduce carbon emissions from multi-unit and district heating and cooling network. The company was formerly known as International Wastewater Systems Inc. and changed its name to Sharc International Systems Inc. in September 2017. Sharc International Systems Inc. is based in Port Coquitlam, Canada.",
    "website": "http://www.sharcenergy.com",
    "zipcode": "V3C 6L4"
  },
  "IWIA.F": {
    "city": "Port Coquitlam",
    "country": "Canada",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Sharc International Systems Inc.",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SHARC INTL SYS INC.",
    "state": "BC",
    "summary": "Sharc International Systems Inc. provides wastewater heat exchange products and services for commercial, industrial, public utilities, and residential development projects in Canada, the United Kingdom, and internationally. It offers PIRANHA and SHARC systems that provide energy savings and reduce carbon emissions from multi-unit and district heating and cooling network. The company was formerly known as International Wastewater Systems Inc. and changed its name to Sharc International Systems Inc. in September 2017. Sharc International Systems Inc. is based in Port Coquitlam, Canada.",
    "website": "http://www.sharcenergy.com",
    "zipcode": "V3C 6L4"
  },
  "KNOS": {
    "city": "Lake Oswego",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Kronos Advanced Technologies Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "KRONOS ADVANCED TECH INC",
    "state": "OR",
    "summary": "Kronos Advanced Technologies Inc. manufactures and distributes air movement and purification equipment. The company was formerly known as TSET, Inc. and changed its name to Kronos Advanced Technologies Inc. in January 2001. Kronos Advanced Technologies Inc. was incorporated in 1980 and is based in Lake Oswego, Oregon.",
    "website": "http://silentnightairfilter.com",
    "zipcode": "97034"
  },
  "KTWIF": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Kurita Water Industries Ltd.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "KURITA WATER INDUSTRIES",
    "state": null,
    "summary": "Kurita Water Industries Ltd. provides various water treatment solutions in Japan, rest of Asia, North America, Europe, the Middle East, Africa, and internationally. The Water Treatment Chemicals segment offers boiler water treatment chemicals, cooling water treatment chemicals, wastewater treatment chemicals, process treatment chemicals, reverse osmosis membrane water treatment chemicals, automobile paint booth chemicals, biomass generation related chemicals, civil engineering and construction related chemicals, marine vessel related water treatment chemicals, chemical dosing systems/chemical dosing control systems, and packaged contract services. The Water Treatment Facilities segment offers water treatment equipment and facilities; ultrapure water supply, tool cleaning, chemical cleaning, and soil and groundwater remediation services; and maintenance services. This segment also provides ultrapure water production systems, wastewater reclamation systems, and wastewater treatment systems and equipment. The company also offers soil and groundwater contamination remediation, plant facilities cleaning, and precision tool cleaning services, as well as water treatment equipment for professional use, products for general household's, and swimming pool-related equipment. Kurita Water Industries Ltd. was founded in 1949 and is headquartered in Tokyo, Japan.",
    "website": "http://www.kurita.co.jp",
    "zipcode": "164-0001"
  },
  "KWI.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Kurita Water Industries Ltd.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "KURITA WATER IND.",
    "state": null,
    "summary": "Kurita Water Industries Ltd. provides various water treatment solutions in Japan, rest of Asia, North America, Europe, the Middle East, Africa, and internationally. The Water Treatment Chemicals segment offers boiler water treatment chemicals, cooling water treatment chemicals, wastewater treatment chemicals, process treatment chemicals, reverse osmosis membrane water treatment chemicals, automobile paint booth chemicals, biomass generation related chemicals, civil engineering and construction related chemicals, marine vessel related water treatment chemicals, chemical dosing systems/chemical dosing control systems, and packaged contract services. The Water Treatment Facilities segment offers water treatment equipment and facilities; ultrapure water supply, tool cleaning, chemical cleaning, and soil and groundwater remediation services; and maintenance services. This segment also provides ultrapure water production systems, wastewater reclamation systems, and wastewater treatment systems and equipment. The company also offers soil and groundwater contamination remediation, plant facilities cleaning, and precision tool cleaning services, as well as water treatment equipment for professional use, products for general household's, and swimming pool-related equipment. Kurita Water Industries Ltd. was founded in 1949 and is headquartered in Tokyo, Japan.",
    "website": "http://www.kurita.co.jp",
    "zipcode": "164-0001"
  },
  "LIQT": {
    "city": "Ballerup",
    "country": "Denmark",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Pollution & Treatment Controls",
    "long_name": "LiqTech International, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "LiqTech International, Inc.",
    "state": null,
    "summary": "LiqTech International, Inc., a clean technology company, designs, develops, produces, markets, and sells automated filtering systems, and ceramic silicon carbide liquid applications and diesel particulate air filters in the United States, Canada, Europe, Asia, and South America. The company manufactures and sells ceramic silicon carbide filters and membranes for liquid filtration under the LiqTech, Cometas, and Provital brand names, which are used for the filtration of produced water, pre-filtration of reverse osmosis drinking water, industrial applications, producing clean drinking water, and pool and spa water, as well as marine scrubber wash water. It also offers diesel particulate filters for exhaust emission control solutions to the verified retrofit and the original equipment manufacturer market; and plastics, which provide machined and welded plastic parts for the prepress, UV, and aquaculture market segments. LiqTech International, Inc. sells its products primarily to industrial customers through direct sales, systems integrators, distributors, agents, and partners. The company was formerly known as Blue Moose Media, Inc. and changed its name to LiqTech International, Inc. in October 2011. LiqTech International, Inc. was incorporated in 2004 and is headquartered in Ballerup, Denmark.",
    "website": "http://www.liqtech.com",
    "zipcode": "2750"
  },
  "LQWC": {
    "city": "Ridgefield Park",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "LifeQuest World Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "LIFEQUEST WORLD CORP",
    "state": "NJ",
    "summary": "LifeQuest World Corporation, through its subsidiaries, provides effluent treatment and sewage treatment solutions. The company develops onsite sewage wastewater treatment system, which treats grey and black water that can be reused for irrigation, flushing, and cleaning. It also focuses on providing solutions for treatment of effluents in textile, tannery, fisheries, dairy, and processed water industries. The company offers Biopipe, a biological wastewater treatment system that could be used in detached houses, commercial and multi-family buildings, hotels, hospitals, industrial complexes, campgrounds, and parks; and Abrimix, a water treatment technology for treating wastewater, processed water, or raw water. In addition, it provides Glanris, a non-toxic filtration media for water filtration for municipalities, businesses, homeowners, and consumers; and Goslyn, a grease recovery device to remove fats, oils, and grease from wastewater effluent. The company was incorporated in 1997 and is based in Ridgefield Park, New Jersey.",
    "website": "http://lifequestcorp.com",
    "zipcode": "07660"
  },
  "LS9.SI": {
    "city": "Changchun",
    "country": "China",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Leader Environmental Technologies Limited",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "Leader Env",
    "state": null,
    "summary": "Leader Environmental Technologies Limited, an investment holding company, engages in the research and development, design, fabrication, assembly, and installation of environmental protection systems primarily for industrial waste gas and wastewater treatments in the People's Republic of China. The company also provides technical consulting and support services for environmental protection technologies and systems. In addition, it offers industrial waste gas treatment solutions for the elimination of dust and desulphurization from the emission of industrial waste gas, as well as for the elimination of nitrogen oxides from the emission of waste gas; and industrial wastewater treatment solutions for the removal and reduction of pollutants in the wastewater from the emission of industrial wastewater, as well as undertakes operation and maintenance works. Further, the company invests in the construction and operation of new energy generation, water management, and other related environmental projects. The company was incorporated in 2006 and is headquartered in Changchun, the People's Republic of China.",
    "website": "http://www.anjie.cc",
    "zipcode": "130033"
  },
  "MEEC": {
    "city": "Corsicana",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Midwest Energy Emissions Corp.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "MIDWEST ENERGY EMISSIONS CORP",
    "state": "TX",
    "summary": "Midwest Energy Emissions Corp. operates as an environmental services and technology company. It focuses on the delivery of mercury capture technologies to coal-fired power plants in the United States, Canada, Europe, and Asia. The company was incorporated in 1983 and is headquartered in Corsicana, Texas.",
    "website": "http://www.me2cenvironmental.com",
    "zipcode": "75109"
  },
  "MGON": {
    "city": "Point Edward",
    "country": "Canada",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Megola, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "MEGOLA INC",
    "state": "ON",
    "summary": "Megola, Inc. develops and sells various physical water treatment devices. It has operations in Canada, China, Indonesia, and the United States. The company is based in Point Edward, Canada.",
    "website": null,
    "zipcode": "N7V 1X4"
  },
  "MPML": {
    "city": "Spokane Valley",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "MPM Technologies, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "MPM TECHNOLOGIES INC",
    "state": "WA",
    "summary": "MPM Technologies, Inc., through its subsidiaries, designs, engineers, supplies, and services air pollution control systems for environmental and industrial companies in the United States and internationally. The company provides air pollution control systems by utilizing wet and dry scrubbers, wet electrostatic precipitators, and venturi absorbers that control air pollution. It also involves in the development and commercialization of Skygas, a waste-to-energy process that converts solid and semi-solid wastes into a clean-burning medium BTU gas that can be used for steam production for electric power generation, as well as for downstream conversion into chemicals. The company's Skygas technology is used for the disposal and gasification of carbonaceous wastes, such as municipal solid waste, municipal sewage sludge, pulp and paper mill sludge, auto fluff, medical waste, and used tires. It has a strategic alliance with Foton Technologies, LLC to develop projects to produce power, chemicals, and liquid fuels utilizing Skygas gasification-derived syngas. The company was formerly known as Montana Precision Mining, Ltd. and changed its name to MPM Technologies, Inc. in August 1995. MPM Technologies, Inc. was founded in 1983 and is based in Spokane Valley, Washington. MPM Technologies, Inc. operates as a subsidiary of Carbon Cycle Investments, LLC.",
    "website": null,
    "zipcode": "99216"
  },
  "MTRS.ST": {
    "city": "Kista",
    "country": "Sweden",
    "currency": "SEK",
    "exchange": "STO",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Munters Group AB (publ)",
    "market": "se_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Munters Group AB",
    "state": null,
    "summary": "Munters Group AB (publ) provides energy efficient air treatment and climate solutions for commercial and industrial applications in Sweden, the United States, Germany, China, and internationally. The company operates through two segments, AirTech and FoodTech. It offers air intakes/air inlets, temperature and humidity control products, coolers and humidifiers, dehumidifiers, fans and light traps, heaters, heat exchangers, mist eliminators, mass transfer equipment, and pollution control and VOC abatement products. The company also provides installation support, startup and commissioning, training, maintenance, rotor performance check, and reconditioning and repair services, as well as upgrades and spare parts, and rental solutions. It serves agriculture, automotive, chemical processing, construction, data center, defense and aerospace, education, electronics, food and beverage, general and production, greenhouse, healthcare, pharmaceutical, power generation and distribution, recreation and leisure, retail and supermarket, shipbuilding and marine, steel, temporary structure, and water and waste water; oil, gas, and petroleum; pulp, paper, and printing; and storage, preservation, and archives industries. Munters Group AB (publ) was founded in 1955 and is headquartered in Kista, Sweden.",
    "website": "http://www.munters.com",
    "zipcode": "164 26"
  },
  "MYX.L": {
    "city": "Duluth",
    "country": "United States",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Pollution & Treatment Controls",
    "long_name": "MYCELX Technologies Corporation",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "MYCELX TECHNOLOGIES CORPORATION",
    "state": "GA",
    "summary": "MYCELX Technologies Corporation, a clean water technology company, provides water treatment solutions to the oil and gas, power, marine, and heavy manufacturing sectors in the Middle East, the United States, and internationally. The company offers oil removal solutions for upstream produced water to oil companies; and hydrocarbons removal services from downstream process wastewater that are used in petrochemical facilities and refineries. It also sells or leases its equipment; and sells consumable filtration media. The company was incorporated in 1994 is headquartered in Duluth, Georgia.",
    "website": "http://www.mycelx.com",
    "zipcode": "30096"
  },
  "NEWA": {
    "city": "Yantai",
    "country": "China",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Newater Technology, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "Newater Technology, Inc.",
    "state": null,
    "summary": "Newater Technology, Inc. operates as a wastewater purification treatment company in the People's Republic of China. The company focuses on the development, manufacture, and sale of disk tube reverse osmosis and disk tube Nano-filtration membrane filtration products that are used in the treatment, recycling, and discharge of wastewater. It also offers engineering support and installation, technical advice and service, and other project-related solutions to turn wastewater into clean water. In addition, the company offers landfill leachate treatment and purification services; and traditional wastewater treatment solutions, such as activated carbon and resins. It primarily serves energy, garbage and waste, and chemical industries. Newater Technology, Inc. was founded in 2012 and is headquartered in Yantai, the People's Republic of China.",
    "website": "http://dtnewa.com",
    "zipcode": "264000"
  },
  "NH8.F": {
    "city": "Osaka",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Nihon Trim Co., Ltd.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "NIHON TRIM CO. LTD.",
    "state": null,
    "summary": "Nihon Trim Co., Ltd. develops and sells electrolyzed hydrogen water systems in Japan and internationally. The company also offers cartridges and electrolyzed hydrogen water apparatuses for agriculture and livestock industries, as well as households; and electrolyzed water hemodialysis systems for medical care. In addition, it manufactures and sells bottled water; and undertakes research and development works of electrolyzed hydrogen water. Nihon Trim Co., Ltd. was founded in 1982 and is headquartered in Osaka, Japan.",
    "website": "http://www.nihon-trim.co.jp",
    "zipcode": "530-0001"
  },
  "NVJP.F": {
    "city": "Brussels",
    "country": "Belgium",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Umicore SA",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "UMICORE S.A.",
    "state": null,
    "summary": "Umicore SA operates as a materials technology and recycling company worldwide. The company operates through Catalysis, Energy & Surface Technologies, and Recycling segments. The Catalysis segment produces automotive catalysts for gasoline, and diesel light and heavy-duty diesel applications; stationary catalysis for industrial emissions control; and precious metals-based compounds and catalysts for use in the pharmaceutical and fine chemicals industries, as well as fuel cell applications. The Energy & Surface Technologies segment offers cobalt and specialty materials, rechargeable battery materials, electroplating products, and electro-optic materials. The Recycling segment treats waste streams containing precious and other specialty metals from a range of industrial residues and end-of-life materials. This segment also produces precious metals-based materials for glass production, electric, and electronic applications. The company was formerly known as Union Minière du Haut Katanga and changed its name to Umicore SA in 2001. Umicore SA was founded in 1805 and is headquartered in Brussels, Belgium.",
    "website": "http://www.umicore.com",
    "zipcode": "1000"
  },
  "OWUV": {
    "city": "Lafayette",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "One World Universe Inc.",
    "market": "us_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "ONE WORLD UNIVERSE INC",
    "state": "LA",
    "summary": "One World Universe Inc. engages in the manufacture, sale, and rental of water purification equipment utilizing reverse osmosis filtration processes and water vending equipment. Its products are used in various water treatment applications for commercial, residential, industrial, and institutional purposes. The company was formerly known as Ultra Pure Water Technologies, Inc. and changed its name to One World Universe Inc. in October 2020. One World Universe Inc. was incorporated in 1989 and is based in Lafayette, Louisiana.",
    "website": null,
    "zipcode": "70507"
  },
  "OXQ1.F": {
    "city": "Greenwood Village",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Advanced Emissions Solutions, Inc.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "ADVANCED EMISS. SOL.",
    "state": "CO",
    "summary": "Advanced Emissions Solutions, Inc., together with its subsidiaries, provides environmental technologies and specialty chemicals in the United States. It operates through two segments, Refined Coal and Advanced Purification Technologies. The company offers CyClean technology, a pre-combustion coal treatment process to enhance combustion, as well as to reduce emissions of nitrogen oxide and mercury from coals burned in cyclone boilers; and M-45 and M-45-PC technologies, which are pre-combustion coal treatment technologies used to control emissions from circulating fluidized bed boilers and pulverized coal boilers. It also provides mercury and other air contaminants controls; and activated carbon products, such as powdered activated carbon and granular activated carbon, as well as owns an associated lignite mine that supplies the raw material for the powdered activated carbon plant. The company's products are used in removal of heavy metal pollutants; treatment of drinking and waste waters; industrial acid gas and odor removal; automotive gasoline emission control; soil and ground water remediation; and food and beverage process and product purifications. It serves customers in the coal-fired power generation and industrial boiler processes. The company was founded in 1996 and is headquartered in Greenwood Village, Colorado.",
    "website": "http://www.advancedemissionssolutions.com",
    "zipcode": "80111"
  },
  "OZ1.F": {
    "city": "Shanghai",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Ozner Water International Holding Limited",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "OZNER WAT.INTL HLDG HD-01",
    "state": null,
    "summary": "Ozner Water International Holding Limited, an investment holding company, engages in the water purification, air sanitization, supply chain, and other businesses in the People's Republic of China. The company's Water Purification segment sells and leases water purification machines; and provides training services to distributors. The Air Sanitisation segment engages in the provision of air sanitization construction, and related consulting and training services; and sale of air sanitization products. The Supply Chain segment sells micro motor products. The Other segment provides financing services in lending loans to distributors. It is also involved in the development and manufacture of water purification and air sanitization products, as well as micro motor products; and provision of finance leasing/leasing/factoring, and water purifying services. Ozner Water International Holding Limited was incorporated in 2013 and is headquartered in Shanghai, the People's Republic of China.",
    "website": "http://www.ozner.net",
    "zipcode": null
  },
  "PCT": {
    "city": "Orlando",
    "country": "United States",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Pollution & Treatment Controls",
    "long_name": "PureCycle Technologies, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "PureCycle Technologies, Inc.",
    "state": "FL",
    "summary": "PureCycle Technologies LLC produces recycled polypropylene. It uses a recycling process that separates color, odor, and contaminants from plastic waste feedstock into recycled polypropylene. Its recycling service converts waste plastic into virgin-like plastic. The company was founded in 2015 and is based in Orlando, Florida.",
    "website": "http://purecycletech.com",
    "zipcode": "32817"
  },
  "PCTL": {
    "city": "Little River",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "PCT Ltd",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "PCT LTD",
    "state": "SC",
    "summary": "PCT Ltd, through its subsidiary, Paradigm Convergence Technologies Corporation, designs, develops manufactures, and licenses environmentally safe solutions worldwide. The company offers Hydrolyte, a sanitizer/disinfectant microbiocide for use in institutional facilities, including hospitals, nursing homes, hotels, correctional facilities, and schools; agriculture industry for pre- and post-harvest disinfection of crops, sanitization in food processing, and applications in animal husbandry; oil and gas industry to disinfect water and to kill sulfate reducing bacteria in oil and gas wells; and disinfecting and sanitizing water in public and private water systems and industrial waste-water systems. It also provides Catholyte, a mild detergent, degreaser, and surfactant that is used for janitorial cleaning purposes. The company was formerly known as Bingham Canyon Corporation and changed its name to PCT LTD in February 2018. PCT Ltd was incorporated in 1986 and is headquartered in Little River, South Carolina.",
    "website": "http://www.para-con.com",
    "zipcode": "29566"
  },
  "PCTTU": {
    "city": "Orlando",
    "country": "United States",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Pollution & Treatment Controls",
    "long_name": "PureCycle Technologies, Inc.",
    "market": "us_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "PureCycle Technologies, Inc.",
    "state": "FL",
    "summary": "PureCycle Technologies LLC produces recycled polypropylene. It uses a recycling process that separates color, odor, and contaminants from plastic waste feedstock into recycled polypropylene. Its recycling service converts waste plastic into virgin-like plastic. The company was founded in 2015 and is based in Orlando, Florida.",
    "website": "http://purecycletech.com",
    "zipcode": "32817"
  },
  "PGTK": {
    "city": "Dover",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Pacific Green Technologies Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "PACIFIC GREEN TECHNOLOGIES INC",
    "state": "DE",
    "summary": "Pacific Green Technologies Inc. acquires, develops, and markets emission control technologies in North America, Europe, and Asia. The company offers ENVI-Clean, a system that removes sulphur dioxides, particulate matters, greenhouse gases, and other hazardous air pollutants; and ENVI-Pure, which removes acid gases, particulate matter, dioxins, VOCs, and other regulated hazardous air pollutants from the flue gases produced by the combustion of coal, biomass, municipal solid waste, diesel, and other fuels. It also provides ENVI-Marine, a scrubber for application in diesel exhaust emissions. The company was founded incorporated in 1994 and is based in Dover, Delaware.",
    "website": "http://www.pacificgreentechnologies.com",
    "zipcode": "19901"
  },
  "PPP-R.BK": {
    "city": "Bangkok",
    "country": "Thailand",
    "currency": "THB",
    "exchange": "SET",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Premier Products Public Company Limited",
    "market": "th_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "PREMIER PRODUCTS PUBLIC COMPANY",
    "state": null,
    "summary": "Premier Products Public Company Limited manufactures and distributes environmental products, construction materials, and industrial products in Thailand. It operates through three segments: Water Treatment Solution, Environmental Preservation Products, and Clean energy business. The company offers wastewater treatment systems; wastewater equipment; water storage systems; integrated water management systems; air pollution treatment system; and wastewater treatment system monitoring and maintenance services. It also provides environmental preservation products, such as precast lightweight wall panels and building decoration materials, noise barrier systems, chemical corrosion resistant tanks and components; and solar PV systems. In addition, the company produces electricity from solar power. Further, it exports its products. The company was founded in 1975 and is headquartered in Bangkok, Thailand.",
    "website": "http://www.premier-products.co.th",
    "zipcode": "10250"
  },
  "PPP.BK": {
    "city": "Bangkok",
    "country": "Thailand",
    "currency": "THB",
    "exchange": "SET",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Premier Products Public Company Limited",
    "market": "th_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "PREMIER PRODUCTS PUBLIC COMPANY",
    "state": null,
    "summary": "Premier Products Public Company Limited manufactures and distributes environmental products, construction materials, and industrial products in Thailand. It operates through three segments: Water Treatment Solution, Environmental Preservation Products, and Clean energy business. The company offers wastewater treatment systems; wastewater equipment; water storage systems; integrated water management systems; air pollution treatment system; and wastewater treatment system monitoring and maintenance services. It also provides environmental preservation products, such as precast lightweight wall panels and building decoration materials, noise barrier systems, chemical corrosion resistant tanks and components; and solar PV systems. In addition, the company produces electricity from solar power. Further, it exports its products. The company was founded in 1975 and is headquartered in Bangkok, Thailand.",
    "website": "http://www.premier-products.co.th",
    "zipcode": "10250"
  },
  "PRV.L": {
    "city": "King's Lynn",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Porvair plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "PORVAIR PLC ORD 2P",
    "state": null,
    "summary": "Porvair plc, a filtration and environmental technology company, designs, manufactures, and sells filtration and separation equipment primarily in the United Kingdom. It operates in three segments: Aerospace & Industrial, Laboratory, and Metal Melt Quality. The Aerospace & Industrial segment designs and manufactures a range of specialist filtration equipment for aerospace, energy, and industrial applications. The Laboratory segment is involved in the design and manufacture of instruments and consumables for use in environmental and bioscience laboratories with a focus on water analysis instruments, diagnostics, and sample preparation equipment. This segment also produces a range of laboratory microplates, filters, tubing, and associated consumables for use in diagnostics, sample preparation and chromatography applications; and water analysis equipment. The Metal Melt Quality segment designs and manufactures porous ceramic filters for the filtration of molten metals. It provides patent protected filters for the aluminum cast house industry; and the filtration of gray and ductile iron, as well as filtration of super alloy filters used in the manufacture of turbine blades. The company is also involved in trading activities. It also operates in Continental Europe, the United States, South America, Asia, and Africa, as well as other NAFTA countries. The company was incorporated in 1982 and is headquartered in King's Lynn, the United Kingdom.",
    "website": "http://www.porvair.com",
    "zipcode": "PE30 2JN"
  },
  "PURA": {
    "city": "Farmers Branch",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Puration, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "PURATION INC",
    "state": "TX",
    "summary": "Puration, Inc. engages in the design, development, production, marketing, and distribution of personal or individual water purification products. The company's personal water filtration systems include personal water filter bottles, sports bottles, collapsible water pouches, portable purification devices, portable biological filtration devices, replacement filters, and travel filters. Its products also include water filter pitchers, canteens, shower head filters, water filter pumps, and air-to-water machines. Puration, Inc. sells its products under the Filter 2GO brand. The company has a partnership with Alkame Holdings Inc. to produce and test market a CBD infused liquid sugar, a CBD infused pet food supplement and a CBD sexual wellness flavored lubricant. Puration, Inc. was founded in 2011 and is based in Farmers Branch, Texas.",
    "website": "http://www.purationinc.com",
    "zipcode": "75244"
  },
  "QAIR.ST": {
    "city": "Solna",
    "country": "Sweden",
    "currency": "SEK",
    "exchange": "STO",
    "industry": "Pollution & Treatment Controls",
    "long_name": "QleanAir Holding AB (publ)",
    "market": "se_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "QleanAir Holding AB",
    "state": null,
    "summary": "QleanAir Holding AB (publ) provides air cleaners, cleanrooms, and solutions for protection against passive smoking worldwide. It offers products and solutions for air cleaning, including ceiling mounted and floor standing air filtration systems; smoking cabins; and room solutions, such as adaptable cleanroom solutions, and indoor and outdoor smoking-room solutions. The company was founded in 1988 and is headquartered in Solna, Sweden.",
    "website": "http://www.qleanair.com",
    "zipcode": "171 54"
  },
  "QST.V": {
    "city": "Calgary",
    "country": "Canada",
    "currency": "CAD",
    "exchange": "VAN",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Questor Technology Inc.",
    "market": "ca_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "Questor Technology Inc.",
    "state": "AB",
    "summary": "Questor Technology Inc., an environmental clean technology company, designs, manufactures, and services waste gas combustion systems in Canada and the United States. The company sells, rents, and services waste gas incineration systems. It offers its solutions for various oil and gas projects, as well as for landfill biogas, syngas, waste engine exhaust, geothermal and solar, and cement plant waste heat. The company was formerly known as Interglobe Gas Technology Inc. and changed its name to Questor Technology Inc. in September 1995. Questor Technology Inc. was founded in 1994 and is headquartered in Calgary, Canada.",
    "website": "http://www.questortech.com",
    "zipcode": "T2P 3N3"
  },
  "QUTIF": {
    "city": "Calgary",
    "country": "Canada",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Questor Technology Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "QUESTOR TECHNOLOGY INC",
    "state": "AB",
    "summary": "Questor Technology Inc., an environmental clean technology company, designs, manufactures, and services waste gas combustion systems in Canada and the United States. The company sells, rents, and services waste gas incineration systems. It offers its solutions for various oil and gas projects, as well as for landfill biogas, syngas, waste engine exhaust, geothermal and solar, and cement plant waste heat. The company was formerly known as Interglobe Gas Technology Inc. and changed its name to Questor Technology Inc. in September 1995. Questor Technology Inc. was founded in 1994 and is headquartered in Calgary, Canada.",
    "website": "http://www.questortech.com",
    "zipcode": "T2P 3N3"
  },
  "QWTR": {
    "city": "West Vancouver",
    "country": "Canada",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Quest Water Global, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "QUEST WATER GLOBAL INC",
    "state": "BC",
    "summary": "Quest Water Global, Inc., a water technology company, provides solutions that address the shortage of clean drinking water in developing countries. The company focuses on manufacturing and selling AQUAtap community drinking water station, a solar-powered water purification and distribution system; and WEPS, a water extraction and purification system that produces clean drinking water from humidity in the atmosphere. The company's systems have applications in rural and urban community water supply, water supply for household needs, remote work site camps, and water supply for disaster relief. It offers its community drinking water station to various markets, including non-governmental organizations, governmental agencies, land developers, local communities, and local water suppliers in Angola; and water extraction and purification system to commercial bottled water operations, agricultural irrigation, industrial capture and reuse, and bulk residential supply markets. The company was founded in 2008 and is headquartered in West Vancouver, Canada.",
    "website": "http://www.questwatersolutions.com",
    "zipcode": "V7V 1A7"
  },
  "RAKR": {
    "city": "Peterborough",
    "country": "Canada",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Rainmaker Worldwide Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "RAINMAKER WORLDWIDE INC",
    "state": "ON",
    "summary": "Rainmaker Worldwide Inc. produces drinking water for communities. It offers water-producing technologies, including air-to-water technology, which harvests fresh water from the air; water-to-water technology that transforms seawater or polluted water into drinking water; and commercial water-to-water technology. The company is headquartered in Peterborough, Canada.",
    "website": "http://rainmakerww.com",
    "zipcode": "K9H 2P8"
  },
  "ROBXF": {
    "city": "Calgary",
    "country": "Canada",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Robix Environmental Technologies, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ROBIX ENVIRONMENTAL TECHNOLOGIE",
    "state": "AB",
    "summary": "Robix Environmental Technologies, Inc., an investment holding company, develops and sells oil spill response and recovery equipment, oil-water separation equipment, and cleaning and purification equipment in Canada. The company operates through Clean Ocean Vessel Technology and Clean Water Technology segments. Its products include C series clean ocean vessel that recover oil in rough ocean waters, lakes, rivers, and tailings ponds; and P series platform, which accelerates oil recovery from settling ponds at production facilities, as well as hydro cycle water systems. Robix Environmental Technologies, Inc. also provides contaminated water clean-up treatment services. The company was formerly known as Robix Alternative Fuels, Inc. and changed its name to Robix Environmental Technologies, Inc. in March 2016. Robix Environmental Technologies, Inc. was founded in 2011 and is headquartered in Calgary, Canada. Robix Environmental Technologies, Inc. is a subsidiary of Blue Horizon Industries Inc.",
    "website": "http://www.robixfuels.com",
    "zipcode": "T2E 7T8"
  },
  "SAXG.ST": {
    "city": "Nacka",
    "country": "Sweden",
    "currency": "SEK",
    "exchange": "STO",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Saxlund Group AB (publ)",
    "market": "se_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "Saxlund Group AB",
    "state": null,
    "summary": "Saxlund Group AB (publ), an environmental technology group, develops, manufactures, and services plants and equipment for the production of environmentally-friendly and resource-efficient energy. The company provides bulk materials handling systems, such as bar feeders, tube feeders, hydraulic rotors, and sliding frames for forest residues, sawmill waste, chips, pellets, sludge, etc.; combustion systems; fixed and transportable heating plants; and purification products, including scrubbers, lamella or tubes, wet electrostatic precipitators (WESP), filter cassettes, hose filters, ESP electrostatic precipitators, injection of lime and activated carbon, and cyclones, as well as plant operator training. It serves electricity; heat and power production; wood and forest; water and waste management; process, recycling, and mining; and other industries. The company was formerly known as Pilum AB (publ.) and changed its name to Saxlund Group AB (publ) in July 2017. Saxlund Group AB (publ) is headquartered in Nacka, Sweden.",
    "website": "http://www.saxlund.se",
    "zipcode": "13154"
  },
  "SAY.V": {
    "city": "Toronto",
    "country": "Canada",
    "currency": "CAD",
    "exchange": "VAN",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Sparta Capital Ltd.",
    "market": "ca_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SPARTA CAPITAL LTD",
    "state": "ON",
    "summary": "Sparta Capital Ltd. provides specialized energy capturing, converting, optimizing, and related services to the commercial sector. It is involved in the conversion of biomass with a focus on sequestering CO2 emissions through waste diversion and converting biomass waste into consumables, such as waste-to-energy products; and electronics recycling business that converts and remarkets old electronic components. The company also distributes specialized photoluminescent exit signs and egress pathway marking to reduce the consumption of carbon based electricity; and measures and monitors energy use in commercial buildings and manufacturing facilities, as well as offers turnkey solutions and ongoing support. In addition, it delivers energy management and power quality solutions and services, including harmonic mitigation and power factor correction in industrial and commercial areas. Further, the company offers TruckSuite that provides fleet owners/operators with comprehensive maintenance, including roadside emergency assistance; emergency repair with competitive pricing, and complete warranty coverage; and TripVision, an integrated vehicle health and safety management system. Sparta Capital Ltd. was incorporated in 1988 and is headquartered in Toronto, Canada.",
    "website": "http://www.spartagroup.ca",
    "zipcode": "M5H 2Y2"
  },
  "SFBE": {
    "city": "Wanchai",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Sino Bioenergy Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SINO BIOENERGY CORP",
    "state": null,
    "summary": "Sino Bioenergy Corp., a technology company, builds, owns, and operates plasma conversion biomass gas system facilities to convert municipal solid waste into green power and other valuable products. The company process municipal household waste, construction waste, kitchen waste, and sludge to produce and sell organic, as well as mixed organic and inorganic fertilizers. It also produces other end products, such as plastic wood products, building materials, and bio-fuel blocks. The company was formerly known as Sino Fibre Communications, Inc. and changed its name to Sino Bioenergy Corp. in December 2010. Sino Bioenergy Corp. was incorporated in 1999 and is based in Wanchai, Hong Kong.",
    "website": "http://www.sfbe2016.com",
    "zipcode": null
  },
  "SHRC.CN": {
    "city": "Port Coquitlam",
    "country": "Canada",
    "currency": "CAD",
    "exchange": "CNQ",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Sharc International Systems Inc.",
    "market": "ca_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SharcIntlSysInc",
    "state": "BC",
    "summary": "Sharc International Systems Inc. provides wastewater heat exchange products and services for commercial, industrial, public utilities, and residential development projects in Canada, the United Kingdom, and internationally. It offers PIRANHA and SHARC systems that provide energy savings and reduce carbon emissions from multi-unit and district heating and cooling network. The company was formerly known as International Wastewater Systems Inc. and changed its name to Sharc International Systems Inc. in September 2017. Sharc International Systems Inc. is based in Port Coquitlam, Canada.",
    "website": "http://www.sharcenergy.com",
    "zipcode": "V3C 6L4"
  },
  "SINX": {
    "city": "Houston",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Sionix Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SIONIX CORP",
    "state": "TX",
    "summary": "Sionix Corp. designs, constructs, and operates mobile water treatment systems based on its proprietary dissolved air flotation (DAF) technology. Its systems are used in energy applications; government facilities; healthcare facilities; emergency water supplies during natural disasters; housing development projects; and various industrial processes, including subterranean fracturing used in oil and gas drilling, as well as for pre-treatment of desalination and other membrane filtration applications. The company's system is also used to remove organic and inorganic compounds, including hydrocarbons, insoluble metals, infectious bacteria from contaminated water, algae, color, and more, as well as serves dairy, agribusiness, meat processing, mining, poultry operations, and other industries that uses water in the manufacture of their products or delivery of their services. Sionix Corp. was founded in 1985 and is based in Houston, Texas.",
    "website": null,
    "zipcode": "77018"
  },
  "SREMF": {
    "city": "Notting Hill",
    "country": "Australia",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Sunrise Energy Metals Limited",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "SUNRISE ENERGY METALS LTD",
    "state": "VIC",
    "summary": "Sunrise Energy Metals Limited, together with its subsidiaries, provides metals recovery and industrial water treatment services primarily in Australia. It operates in two segments, Water and Metals. The Water segment offers Continuous Ionic Filtration, Macroporous Polymer Adsorption, and Graphene Oxide and BIOCLENS resin technologies to filter, separate, purify, and recycle polluted water for drinking, agricultural, recreational, and industrial uses. The Metals segment provides Clean-iX resin technology for the extraction and purification of a range of resources, including base and precious metals, as well as radioactive elements, such as uranium. This segment is also involved in the development of the Sunrise project in New South Wales. The company was formerly known as Clean TeQ Holdings Limited and changed its name to Sunrise Energy Metals Limited in March 2021. Sunrise Energy Metals Limited was founded in 1990 and is based in Notting Hill, Australia.",
    "website": "http://sunriseem.com",
    "zipcode": "3168"
  },
  "SRL.AX": {
    "city": "Notting Hill",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Sunrise Energy Metals Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "SUNRISE FPO",
    "state": "VIC",
    "summary": "Sunrise Energy Metals Limited, together with its subsidiaries, provides metals recovery and industrial water treatment services primarily in Australia. It operates in two segments, Water and Metals. The Water segment offers Continuous Ionic Filtration, Macroporous Polymer Adsorption, and Graphene Oxide and BIOCLENS resin technologies to filter, separate, purify, and recycle polluted water for drinking, agricultural, recreational, and industrial uses. The Metals segment provides Clean-iX resin technology for the extraction and purification of a range of resources, including base and precious metals, as well as radioactive elements, such as uranium. This segment is also involved in the development of the Sunrise project in New South Wales. The company was formerly known as Clean TeQ Holdings Limited and changed its name to Sunrise Energy Metals Limited in March 2021. Sunrise Energy Metals Limited was founded in 1990 and is based in Notting Hill, Australia.",
    "website": "http://sunriseem.com",
    "zipcode": "3168"
  },
  "SSHPF": {
    "city": "Lysaker",
    "country": "Norway",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "VOW ASA",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "VOW ASA",
    "state": null,
    "summary": "VOW ASA, together with its subsidiaries, manufactures and supplies systems for processing and purifying waste water, food waste, solid waste, and bio sludge. It operates through Projects and After Sales segments. The company offers advanced wastewater purification systems to treat various types of maritime wastewater; incinerator systems for burning sludge from food waste and waste water; vacuum systems for collecting, transporting, and further processing of food waste; and waste recycling systems. It also provides waste destruction systems; custom water treatment systems; and bio-sludge system, a treatment system for sludge from waste water and food waste, and to reduce volume by dewatering and drying, as well as to disinfect. In addition, the company offers water reuse units that are used to polish and prolong the use of recreational waters; and solutions for garbage handling, waste to energy, and scrubber wash water. Further, it provides chemical products used in the wastewater purification systems; and spare parts and consumables, as well as service and operational assistance related to these products. The company sells its products to cruise liners. It has a strategic partnership agreement with Repsol, S.A. to explore applications and solutions to produce clean and renewable energy for CO2 emission reduction. The company was formerly known as Scanship Holding ASA and changed its name to VOW ASA in January 2020. VOW ASA was founded in 2011 and is headquartered in Lysaker, Norway.",
    "website": "http://www.vowasa.com",
    "zipcode": "1366"
  },
  "SWUT.VI": {
    "city": "Klagenfurt",
    "country": "Austria",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Pollution & Treatment Controls",
    "long_name": "SW Umwelttechnik Stoiser & Wolschner AG",
    "market": "at_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SW UMWELTTECHNIK AG",
    "state": null,
    "summary": "SW Umwelttechnik Stoiser & Wolschner AG develops and produces precast concrete elements for infrastructure construction in Austria, Hungary, and Romania, Slovakia, and Bulgaria. It offers mineral oil separators, rainwater utilization systems, small sewage treatment plants, and prestressed concrete tanks; drinking water tanks; retaining wall systems; manholes; and pump wells. The company was founded in 1910 and is based in Klagenfurt, Austria.",
    "website": "http://de.sw-umwelttechnik.com",
    "zipcode": "9020"
  },
  "SYEV": {
    "city": "Aliso Viejo",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Seychelle Environmental Technologies, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SEYCHELLE ENVIRONMENTAL TECHNOL",
    "state": "CA",
    "summary": "Seychelle Environmental Technologies, Inc. designs, assembles, and distributes absorption micron filters for portable filter devices worldwide. Its products include flip-top and pull top bottles, canteens, water pitchers, pure water pumps, stainless steel bottles, in-line filters, pure water bags, pure water pouches, and pure water straws, as well as Pump N' Pure. The company sells its products to individuals, dealers, distributors, multilevel marketing companies and missionaries, non-governmental organizations, and emergency relief organizations. It also sells its products as a private label supplier. The company was formerly known as Royal Net, Inc. and changed its name to Seychelle Environmental Technologies, Inc. in January 1998. Seychelle Environmental Technologies, Inc. was incorporated in 1986 and is based in Aliso Viejo, California.",
    "website": "http://www.seychelle.com",
    "zipcode": "92656"
  },
  "TEGY": {
    "city": "Bellingham",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "TransAct Energy Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "TRANSACT ENERGY CORPORATION",
    "state": "WA",
    "summary": "TransAct Energy Corp. develops and manages zero emissions waste to value plants worldwide. The company principal products are carbon black, phenol resins, and levoglucosan. It also produces fertilizers for the agricultural industry; a brick mix for the construction industry; reclaimed metals and purified water; and acetic acid and furfural for industrial chemical manufacturers. The company target service customers include corporations or municipalities, airlines, shipping companies, bus companies, trucking companies, or fuel retailers; friction and wood product manufacturers; manufacturers of biodegradable plastics and pharmaceuticals; and tire and rubber manufacturers, lithographers, and printers. TransAct Energy Corp. was incorporated in 2006 and is headquartered in Bellingham, Washington.",
    "website": "http://www.transactenergycorp.com",
    "zipcode": "98226"
  },
  "TGTMF": {
    "city": "Vancouver",
    "country": "Canada",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Targeted Microwave Solutions Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "TARGETED MICROWAVE SOLUTIONS IN",
    "state": "BC",
    "summary": "Targeted Microwave Solutions Inc. operates as an industrial clean technology company in Canada. The company is developing microwave based application technologies to dry, decontaminate, physically upgrade, and eliminate or reduce environment harming emissions. Its technology has applications to mass-scale use of industrial aggregates, energy producing biomass and low-rank coals, and other materials for use by power utilities and industrial companies. The company was incorporated in 2015 and is headquartered in Vancouver, Canada.",
    "website": null,
    "zipcode": "V6B 0M9"
  },
  "TLGN": {
    "city": "Toronto",
    "country": "Canada",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Totally Green, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "TOTALLY GREEN INC",
    "state": "ON",
    "summary": "Totally Green, Inc. develops and distributes the organic refuse conversion alternative (OGCA) green machines in the United States and Canada. The OGCA green machines use an aerobic composting process to convert food waste into nutrient rich water that safely discharges into the sanitary sewer system. The company was founded in 2003 and is based in Toronto, Canada.",
    "website": "http://www.feedtheorca.com",
    "zipcode": "M3B 2M3"
  },
  "TMG.V": {
    "city": "Ottawa",
    "country": "Canada",
    "currency": "CAD",
    "exchange": "VAN",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Thermal Energy International Inc.",
    "market": "ca_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "Thermal Energy International In",
    "state": "ON",
    "summary": "Thermal Energy International Inc. engages in the development, engineering, and supply of pollution control products, heat recovery systems, and condensate return solutions in North America, Europe, China, and internationally. Its products include GEM steam traps; FLU-ACE, a direct contact condensing heat recovery system that recycles the heat lost through the boiler flue gas exhaust; and DRY-REX, a low temperature biomass drying system. The company also provides turn-key thermal energy solutions; and sells water treatment products and services. It serves pharmaceutical, food and beverage, pulp and paper, hospital, chemical and petrochemical, and other industry sectors. Thermal Energy International Inc. was founded in 1991 and is headquartered in Ottawa, Canada.",
    "website": "http://www.thermalenergy.com",
    "zipcode": "K2E 7W5"
  },
  "TMGEF": {
    "city": "Ottawa",
    "country": "Canada",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Thermal Energy International Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "THERMAL ENERGY INTERNATIONAL IN",
    "state": "ON",
    "summary": "Thermal Energy International Inc. engages in the development, engineering, and supply of pollution control products, heat recovery systems, and condensate return solutions in North America, Europe, China, and internationally. Its products include GEM steam traps; FLU-ACE, a direct contact condensing heat recovery system that recycles the heat lost through the boiler flue gas exhaust; and DRY-REX, a low temperature biomass drying system. The company also provides turn-key thermal energy solutions; and sells water treatment products and services. It serves pharmaceutical, food and beverage, pulp and paper, hospital, chemical and petrochemical, and other industry sectors. Thermal Energy International Inc. was founded in 1991 and is headquartered in Ottawa, Canada.",
    "website": "http://www.thermalenergy.com",
    "zipcode": "K2E 7W5"
  },
  "TMS-H.V": {
    "city": "Vancouver",
    "country": "Canada",
    "currency": "CAD",
    "exchange": "VAN",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Targeted Microwave Solutions Inc.",
    "market": "ca_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "TARGETED MICROWAVE SOLUTIONS IN",
    "state": "BC",
    "summary": "Targeted Microwave Solutions Inc. operates as an industrial clean technology company in Canada. The company is developing microwave based application technologies to dry, decontaminate, physically upgrade, and eliminate or reduce environment harming emissions. Its technology has applications to mass-scale use of industrial aggregates, energy producing biomass and low-rank coals, and other materials for use by power utilities and industrial companies. Targeted Microwave Solutions Inc. was incorporated in 2015 and is headquartered in Vancouver, Canada.",
    "website": null,
    "zipcode": "V6B 0M9"
  },
  "TNKE": {
    "city": "Las Vegas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Tanke, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "TANKE INCORPORATED",
    "state": "NV",
    "summary": "Tanke, Inc., through its subsidiaries, develops and markets environmental and water technologies. The company offers Tripple R Water Recycling for the reclamation, treatment, and recycling of wastewater or storm water collected from homes, commercial buildings and industrial facilities; and Tripple R Water Recycling, a water recycling system for hotels, dry kitchens, and buildings. It also provides uSMART, a Software-as-a-Service enterprise resource planning proprietary software technology. Tanke, Inc. was formerly known as LP Holdings Inc. and changed its name to Tanke, Inc. in 2007. The company was incorporated in 1984 and is based in Las Vegas, Nevada.",
    "website": null,
    "zipcode": "89101"
  },
  "TOMZ": {
    "city": "Frederick",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Pollution & Treatment Controls",
    "long_name": "TOMI Environmental Solutions, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "TOMI Environmental Solutions, I",
    "state": "MD",
    "summary": "TOMI Environmental Solutions, Inc., a bacteria decontamination and infectious disease control company, provides environmental solutions for indoor surface decontamination in the United States and internationally. Its products and services include SteraMist Surface Unit, a fully portable, handheld, point and spray disinfection/decontamination system intended to provide quick turnover of any affected space; SteraMist Environment System, a transportable, remotely controlled system that provides complete room disinfection/decontamination of a sealed space up to 103.8 m3; and The SteraMist Hospital Disinfection Cart, a solution to aid its hospital-healthcare customers in providing the quality of care and safety to their patients by disinfecting patient and operating rooms, pharmacies, ambulances, and emergency environments in a hospital or healthcare facility. The company also offers SteraMist Select Surface Unit; Stainless Steel 90-Degree Applicator; iHP Plasma Decontamination Chamber; SteraMist Custom Engineered System; and iHP Corporate Service Decontamination. In addition, it provides full room, equipment, facility, and emergency disinfection and decontamination services. The company manufactures, sells, services, and licenses SteraMist Binary Ionization Technology, a hydrogen peroxide-based mist and fog. Its products and services are used in pharmaceutical companies, clean rooms, hospitals and medical facilities, ambulances, bio-safety labs, tissue and blood labs, pharmaceutical labs, vivariums, research universities military and government agencies, office buildings, schools, athletic facilities, single-family homes and multi-unit residences, cruise ships, schools, and entertainment establishments; patient medical transport airline, hospitality, and transportation industries; and cannabis market. The company was incorporated in 1979 and is headquartered in Frederick, Maryland.",
    "website": "http://tomimist.com",
    "zipcode": "21701"
  },
  "UMI.BR": {
    "city": "Brussels",
    "country": "Belgium",
    "currency": "EUR",
    "exchange": "BRU",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Umicore SA",
    "market": "be_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "UMICORE",
    "state": null,
    "summary": "Umicore SA operates as a materials technology and recycling company worldwide. The company operates through Catalysis, Energy & Surface Technologies, and Recycling segments. The Catalysis segment produces automotive catalysts for gasoline, and diesel light and heavy-duty diesel applications; stationary catalysis for industrial emissions control; and precious metals-based compounds and catalysts for use in the pharmaceutical and fine chemicals industries, as well as fuel cell applications. The Energy & Surface Technologies segment offers cobalt and specialty materials, rechargeable battery materials, electroplating products, and electro-optic materials. The Recycling segment treats waste streams containing precious and other specialty metals from a range of industrial residues and end-of-life materials. This segment also produces precious metals-based materials for glass production, electric, and electronic applications. The company was formerly known as Union Minière du Haut Katanga and changed its name to Umicore SA in 2001. Umicore SA was founded in 1805 and is headquartered in Brussels, Belgium.",
    "website": "http://www.umicore.com",
    "zipcode": "1000"
  },
  "UMI.VI": {
    "city": "Brussels",
    "country": "Belgium",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Umicore SA",
    "market": "at_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "UMICORE",
    "state": null,
    "summary": "Umicore SA operates as a materials technology and recycling company worldwide. The company operates through Catalysis, Energy & Surface Technologies, and Recycling segments. The Catalysis segment produces automotive catalysts for gasoline, and diesel light and heavy-duty diesel applications; stationary catalysis for industrial emissions control; and precious metals-based compounds and catalysts for use in the pharmaceutical and fine chemicals industries, as well as fuel cell applications. The Energy & Surface Technologies segment offers cobalt and specialty materials, rechargeable battery materials, electroplating products, and electro-optic materials. The Recycling segment treats waste streams containing precious and other specialty metals from a range of industrial residues and end-of-life materials. This segment also produces precious metals-based materials for glass production, electric, and electronic applications. The company was formerly known as Union Minière du Haut Katanga and changed its name to Umicore SA in 2001. Umicore SA was founded in 1805 and is headquartered in Brussels, Belgium.",
    "website": "http://www.umicore.com",
    "zipcode": "1000"
  },
  "UMICF": {
    "city": "Brussels",
    "country": "Belgium",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Umicore SA",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "UMICORE",
    "state": null,
    "summary": "Umicore SA operates as a materials technology and recycling company worldwide. The company operates through Catalysis, Energy & Surface Technologies, and Recycling segments. The Catalysis segment produces automotive catalysts for gasoline, and diesel light and heavy-duty diesel applications; stationary catalysis for industrial emissions control; and precious metals-based compounds and catalysts for use in the pharmaceutical and fine chemicals industries, as well as fuel cell applications. The Energy & Surface Technologies segment offers cobalt and specialty materials, rechargeable battery materials, electroplating products, and electro-optic materials. The Recycling segment treats waste streams containing precious and other specialty metals from a range of industrial residues and end-of-life materials. This segment also produces precious metals-based materials for glass production, electric, and electronic applications. The company was formerly known as Union Minière du Haut Katanga and changed its name to Umicore SA in 2001. Umicore SA was founded in 1805 and is headquartered in Brussels, Belgium.",
    "website": "http://www.umicore.com",
    "zipcode": "1000"
  },
  "UMICY": {
    "city": "Brussels",
    "country": "Belgium",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Umicore SA",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "UMICORE",
    "state": null,
    "summary": "Umicore SA operates as a materials technology and recycling company worldwide. The company operates through Catalysis, Energy & Surface Technologies, and Recycling segments. The Catalysis segment produces automotive catalysts for gasoline, and diesel light and heavy-duty diesel applications; stationary catalysis for industrial emissions control; and precious metals-based compounds and catalysts for use in the pharmaceutical and fine chemicals industries, as well as fuel cell applications. The Energy & Surface Technologies segment offers cobalt and specialty materials, rechargeable battery materials, electroplating products, and electro-optic materials. The Recycling segment treats waste streams containing precious and other specialty metals from a range of industrial residues and end-of-life materials. This segment also produces precious metals-based materials for glass production, electric, and electronic applications. The company was formerly known as Union Minière du Haut Katanga and changed its name to Umicore SA in 2001. Umicore SA was founded in 1805 and is headquartered in Brussels, Belgium.",
    "website": "http://www.umicore.com",
    "zipcode": "1000"
  },
  "UVFT": {
    "city": "Lincolnshire",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "UV Flu Technologies, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "UV FLU TECHNOLOGIES INC",
    "state": "IL",
    "summary": "UV Flu Technologies, Inc. engages in the research, development, manufacture, and sale of air purification systems and products primarily in the United States. Its flagship product is the ViraTech UV-400, which utilizes high-intensity germicidal ultraviolet radiation inside a killing chamber that goes beyond filtering to trap and destroy harmful microbes. The company also offers RX Air product line, which include HEPA based air purifiers. Its products are used in hotels, hair and nail salons, pet kennels, test labs, hospitals, restaurants, casinos, and military installations. The company was formerly known as Northwest Chariots Incorporated and changed its name to UV Flu Technologies, Inc. in November 2009. UV Flu Technologies, Inc. was founded in 2006 and is based in Lincolnshire, Illinois.",
    "website": "http://www.uvflutech.com",
    "zipcode": "60069"
  },
  "VOW.OL": {
    "city": "Lysaker",
    "country": "Norway",
    "currency": "NOK",
    "exchange": "OSL",
    "industry": "Pollution & Treatment Controls",
    "long_name": "VOW ASA",
    "market": "no_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "VOW ASA",
    "state": null,
    "summary": "VOW ASA, together with its subsidiaries, manufactures and supplies systems for processing and purifying waste water, food waste, solid waste, and bio sludge. It operates through Projects and After Sales segments. The company offers advanced wastewater purification systems to treat various types of maritime wastewater; incinerator systems for burning sludge from food waste and waste water; vacuum systems for collecting, transporting, and further processing of food waste; and waste recycling systems. It also provides waste destruction systems; custom water treatment systems; and bio-sludge system, a treatment system for sludge from waste water and food waste, and to reduce volume by dewatering and drying, as well as to disinfect. In addition, the company offers water reuse units that are used to polish and prolong the use of recreational waters; and solutions for garbage handling, waste to energy, and scrubber wash water. Further, it provides chemical products used in the wastewater purification systems; and spare parts and consumables, as well as service and operational assistance related to these products. The company sells its products to cruise liners. It has a strategic partnership agreement with Repsol, S.A. to explore applications and solutions to produce clean and renewable energy for CO2 emission reduction. The company was formerly known as Scanship Holding ASA and changed its name to VOW ASA in January 2020. VOW ASA was founded in 2011 and is headquartered in Lysaker, Norway.",
    "website": "http://www.vowasa.com",
    "zipcode": "1366"
  },
  "WAH.DE": {
    "city": "Innsbruck",
    "country": "Austria",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Wolftank-Adisa Holding AG",
    "market": "de_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "WOLFTANK-ADISA HLDG O.N.",
    "state": null,
    "summary": "Wolftank-Adisa Holding AG offers engineering and environmental protection services for contaminated soils and facilities, including remediation and monitoring of tank farms. It also designs, builds, refurbishes, extends and dismantles petrol stations. It also provides general contractor services to petrol stations. It provides double-walled renovation of flat bottom tanks and soil and groundwater purification. Wolftank-Adisa Holding AG is headquartered in Innsbruck, Austria and has additional locations in Italy, Austria, Germany, France, Russia, and China.",
    "website": "http://wolftank-adisa.com",
    "zipcode": "6020"
  },
  "WAH.MU": {
    "city": "Innsbruck",
    "country": "Austria",
    "currency": "EUR",
    "exchange": "MUN",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Wolftank-Adisa Holding AG",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "WOLFTANK-ADISA HLDG O.N.",
    "state": null,
    "summary": "Wolftank-Adisa Holding AG offers engineering and environmental protection services for contaminated soils and facilities, including remediation and monitoring of tank farms. It also designs, builds, refurbishes, extends and dismantles petrol stations. It also provides general contractor services to petrol stations. It provides double-walled renovation of flat bottom tanks and soil and groundwater purification. Wolftank-Adisa Holding AG is headquartered in Innsbruck, Austria and has additional locations in Italy, Austria, Germany, France, Russia, and China.",
    "website": "http://wolftank-adisa.com",
    "zipcode": "6020"
  },
  "WAT.AX": {
    "city": "Rydalmere",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Waterco Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "WATERCO FPO",
    "state": "NSW",
    "summary": "Waterco Limited engages in the manufacture, wholesale, and export of equipment and accessories in the swimming pool, spa pool, spa bath, rural pump, and water treatment industries in Australia, New Zealand, Asia, North America, and Europe. It also manufactures and sells solar heating systems for swimming pools and pre-heat industrial solar systems. The company's pool and spa products comprise infloor cleaning systems, mineral crystals, swimming pool pumps, filtration systems, pool heating products, chlorine free spa products, controllers and automation products, pool lighting products, sunction and robotic pool cleaners, and commercial products. Its pool and spa products also include pool filter media products, recirculation and maintenance accessories, blowers, values, spa equipment, chemical pool products, sensation and enviropro eco range products, ozone mineral pool products, and test kits. The company's water treatment products include commercial filter media and cooling water filtration products, cartridge and bag filters, centrifugal filters, and fiberglass media filters; and residential pressure pumps, centrifugal filters, water filters, water softeners, and drinking water purifiers. It also provides aquaculture equipment, such as aquabiome mechanical and biological filters, aquaculture heating and pup ranges, bio-mec bead media, multicyclones, and spa airflo blowers. In addition, the company franchises retail outlets for swimming pool equipment and accessories. Further, it engages in formulating, packing, and distributing swimming pool chemicals to independent pool stores and stores in its Swimart franchise network. It operates 68 stores and 9 mobile franchises under the Swimart names, and 15 WaterShoppe stores. Waterco Limited was founded in 1981 and is headquartered in Rydalmere, Australia.",
    "website": "http://www.waterco.com",
    "zipcode": "2116"
  },
  "WATR.V": {
    "city": "Guelph",
    "country": "Canada",
    "currency": "CAD",
    "exchange": "VAN",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Current Water Technologies Inc.",
    "market": "ca_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "CURRENT WATER TECHNOLOGIES INC",
    "state": "ON",
    "summary": "Current Water Technologies Inc. develops environmental technologies in Canada, Europe, Asia, and the United States. The company provides patented and proprietary technologies for the treatment of waste water and drinking water that are contaminated by metals or nutrients, such as arsenic and nitrate/ammonia associated with the mining, metal processing, chemical, agricultural, municipal, and waste management sectors; and for the recovery of nickel and other valuable metals from waste mill sulphide tailings associated with the mining sector. Its technologies comprise electro-static deionization, a electrochemical process that lowers the concentration of total dissolved solids in water; ammonia removal technology, a technology used for the removal of dissolved ammonia from industrial and municipal water, including wastewater, storm water, sewage effluent, and mine waste water; NitrEL system, an electrochemical water treatment process that reduces nitrate concentrations in contaminated drinking water, groundwater, and industrial process wastewater streams; AmdEl an electrochemical system that prevents the oxidation of sulphide minerals in tailings or waste rock; and ExtrEL for the recovery of metals from sulphide tailings and ore. The company was formerly known as ENPAR Technologies Inc. and changed its name to Current Water Technologies Inc. in January 2018. Current Water Technologies Inc. was incorporated in 1996 and is headquartered in Guelph, Canada.",
    "website": "http://www.currentwatertechnologies.com",
    "zipcode": "N1G 4P5"
  },
  "WCE.F": {
    "city": "Dallas",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "CECO Environmental Corp.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "CECO ENVIRONMTL  DL-,01",
    "state": "TX",
    "summary": "CECO Environmental Corp. provides industrial air quality and fluid handling systems for the energy, industrial, and other niche markets worldwide. It operates through three segments: Energy Solutions, Industrial Solutions, and Fluid Handling Solutions. The company engineers, designs, builds, and installs systems that capture, clean, and destroy airborne contaminants from industrial facilities, as well as equipment that control emissions from such facilities; and fluid handling and filtration systems. Its products and services include dampers and diverters, selective catalytic reduction and selective non-catalytic reduction systems, cyclonic technology, thermal oxidizers, filtration systems, scrubbers, and fluid handling equipment, as well as plant engineering services and engineered design build fabrication. The company markets its products and services to natural gas processors, transmission and distribution companies, refineries, power generators, industrial manufacturing, engineering and construction companies, semiconductor manufacturers, compressor manufacturers, metals and minerals, and electric vehicle producer companies. CECO Environmental Corp. was incorporated in 1966 and is headquartered in Dallas, Texas.",
    "website": "http://www.cecoenviro.com",
    "zipcode": "75254"
  },
  "WTII": {
    "city": "Port St. Lucie",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Water Technologies International, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "WATER TECHNOLOGIES INTERNATIONA",
    "state": "FL",
    "summary": "Water Technologies International, Inc. engages in designing, manufacturing, and distributing atmospheric water generators and related products (AWG) in the United States. Its AWGs produce drinking water from humidity in the atmosphere, as well as provide air conditioning during the use. The company also provides packaged wastewater plants for the wastewater treatment. In addition, it provides filtration devices for AWGs. Further, the company produces and sells CBD and non-THC products, including CBD, hemp derived cannabidiol specialty water. It serves restaurants, hospitals, schools, hotels/motels, restaurants, large institutions, and military/emergency and disaster deployments. The company is based in Port St. Lucie, Florida.",
    "website": "http://www.gr8water.net",
    "zipcode": "34952"
  },
  "WTNW": {
    "city": "Fort Worth",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Water Now, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "WATER NOW INC",
    "state": "TX",
    "summary": "Water Now, Inc. develops and commercializes gas/diesel or electric powered portable devices for processing and purifying contaminated water. Its products include The Aqua 125 model for purifying fresh water that is contaminated primarily with partially dissolved solid materials, microorganisms, and other pathogens; The Aqua 1000 model to desalinate salt water with a capacity of up to 800 gallons per day; and an upgraded Aqua 1000 unit that is complemented with a reservoir mounted on a trailer with a capacity of purifying up to 800 gallons of water per day. The company also engages in the installation and operation of oil recovery systems. The company offers its products for disaster relief, military, and agricultural applications. Water Now, Inc. was founded in 2016 and is based in Fort Worth, Texas.",
    "website": "http://www.waternowinc.com",
    "zipcode": "76115"
  },
  "YEWTF": {
    "city": "Ajax",
    "country": "Canada",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Environmental Waste International Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "ENVIRONMENTAL WASTE INTERNATION",
    "state": "ON",
    "summary": "Environmental Waste International Inc., together with its subsidiaries, designs and develops environmental products for waste treatment and disposal in Canada and the United States. It researches, designs, develops, sells, and maintains systems based on the patented Reverse Polymerization process and related delivery system. The company offers systems for feed tire reduction, biological wastewater sterilization, shipboard food waste sterilization/dehydration, and batch-based infectious medical waste sterilization. Its tire system breaks the molecular bonds in tires and other rubber products and reduces them to their base components of carbon black, steel, and hydrocarbon vapors. The company also offers FS-6000 and FS-POD biocontainment and wastewater sterilization units; MD-1000, a three-stage, three chamber, medical waste reduction unit that produces a sterilized carbon residue; and AW-1000 to process and reduce animal waste into its constituents. Environmental Waste International Inc. was founded in 1987 and is based in Ajax, Canada.",
    "website": "http://www.ewi.ca",
    "zipcode": "L1S 1R5"
  }
}
