{"1831.SR": {"short_name": "Maharah Human Resources Co.", "long_name": "Maharah for Human Resources Company", "summary": "Maharah for Human Resources Company offers recruitment services for public and private sectors in the Kingdom of Saudi Arabia and the United Arab Emirates. It operates in two segments, Corporate and Individual. The Corporate segment provides labor force services to various industries comprising retail, hospitality, healthcare, operation and maintenance, and banking. The Individual segment offers worker rental services; and khidma, a program for providing part-time housekeepers and home care nurses on an hourly basis, as well as full-time home care nurses. Maharah for Human Resources Company also offers building cleaning services; and operates an online recruitment platform. The company was formerly known as Maharah Foreign Recruitment Company and changed its name to Maharah for Human Resources Company in April 2017. Maharah for Human Resources Company was founded in 2013 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.", "currency": "SAR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "SAU", "market": "sr_market", "country": "Saudi Arabia", "city": "Riyadh"}, "19U1.F": {"short_name": "SHIFTPIXY INC. DL-,0001", "long_name": "ShiftPixy, Inc.", "summary": "ShiftPixy, Inc. provides staffing services in the United States. It offers employment administrative services, such as administrative and processing services, payroll processor, human resources consultant, and administrator of workers' compensation coverages and claims. The Company also operates human resources information systems platform to assist in customer acquisition for the onboarding of new clients into the company's closed proprietary operating and processing information system. It primarily serves restaurant and hospitality service industries. The company was founded in 2015 and is headquartered in Miami, Florida.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Miami"}, "1RH.F": {"short_name": "RECRUIT HOLDINGS CO.LTD", "long_name": "Recruit Holdings Co., Ltd.", "summary": "Recruit Holdings Co., Ltd. provides employment information services in Japan and internationally. It operates through three segments: HR Technology, Media & Solutions, and Staffing. The company operates Indeed.com, a job aggregator search engine; and Glassdoor, an online job platform and company information site. It also operates Suumo, an online platform and print media, which provides information related to home purchases, sales, rentals, and renovation services; Zexy, a magazine and online platform providing information to organize customized wedding events; Study Sapuri Shinro, an online platform and print media, which provides higher education and career information primarily for high school students; Study Sapuri, an online learning support platform for students and adults; and Car Sensor that provides information on pre-owned automobiles for potential buyers. In addition, the company operates Jalan, a site offering travel information and accommodation booking for travel; Hot Pepper Gourmet, an online booking site information about restaurants and discount coupons, as well as online reservations and a scheduling function for invited guests; Hot Pepper Beauty, a domestic search and booking site for hair, relaxation, and beauty salons; AirRegi and AirPAY provides support services to dining and beauty enterprise clients; Rikunabi, a job information site for soon-to-be graduates; Rikunabi Next, a job portal site for people looking to change jobs; Recruit Agent, an employment agency staffed with career advisors; and Townwork, a magazine that provides information on job openings to part-time job seekers. Further, it offers clerical and IT staffing agency; light industrial staffing; human capital outsourcing; IT and digital recruitment services specializing in contracting and permanent recruitment; and human resources services, products, and technologies to organizations and individuals. The company was founded in 1960 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "2124.T": {"short_name": "JAC RECRUITMENT CO LTD", "long_name": "JAC Recruitment Co., Ltd.", "summary": "JAC Recruitment Co., Ltd. operates as a recruitment consultancy in Japan and internationally. It provides recruitment services for medium-to-high-income job positions, such as specialists, middle management positions, and executives. The company provides its services under the JAC Recruitment, JAC Digital, JAC International, JAC Executive, and CareerCross brands. It also provides recruitment support services to job seekers. The company was formerly known as JAC Japan Co., Ltd. and changed its name to JAC Recruitment Co., Ltd. in 2009. JAC Recruitment Co., Ltd. was founded in 1975 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2154.T": {"short_name": "BENEXT GROUP INC", "long_name": "BeNEXT Group Inc.", "summary": "BeNEXT Group Inc. engages in engineer dispatching, subcontracting, outsourcing, and recruiting business for the technology and manufacturing fields in Japan and internationally. It is also involved in the development of automotive software; and dispatching, placement, and introduction of personnel. In addition, the company offers employment for disabled people. The company was formerly known as Trust Tech Inc. and changed its name to BeNEXT Group Inc. in January 2020. BeNEXT Group Inc. was founded in 1959 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2163.T": {"short_name": "ARTNER CO LTD", "long_name": "Artner Co.,Ltd.", "summary": "Artner Co.,Ltd. provides worker dispatching and employment placement services in Japan. The company is also involved in the design and development of machinery, electronic devices, and electric circuits; and development of software. It serves engineers and corporate clients. Artner Co.,Ltd. was founded in 1962 and is headquartered in Yokohama, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Yokohama"}, "2168.T": {"short_name": "PASONA GROUP INC", "long_name": "Pasona Group Inc.", "summary": "Pasona Group Inc. provides human resource-related support services in Japan. It offers temporary staffing, contracting, HR consulting, education and training, global sourcing, placement/recruiting, outplacement, outsourcing, and other services, as well as life and public solutions. The company was founded in 1976 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2180.HK": {"short_name": "MANPOWER GRC", "long_name": "ManpowerGroup Greater China Limited", "summary": "ManpowerGroup Greater China Limited, an investment holding company, provides workforce solutions and other HR services to clients in the People's Republic of China, Hong Kong, Macau, and Taiwan. The company operates through Workforce Solutions and Other Human Resource (HR) Services segments. It offers flexible staffing solutions to provide contingent workers to manage headcount or only require workers for a limited time or a specific project; headhunting services that help enterprises in selecting various senior-level talents; recruitment process outsourcing services to manage the recruiting and on-boarding process for its clients; recruiting process outsourcing management services and recruitment services; and candidate assessments, screening, conducting candidate interviews, sourcing technology, and marketing and recruiting expertise. The company offers HR services, including HR consultancy services, training and development services, career transition services, payroll services, and government services; as well as develops leadership, career management, and talent assessment. The company was founded in 1997 and is headquartered in Shanghai, the People's Republic of China.", "currency": "HKD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Shanghai"}, "2225.HK": {"short_name": "JINHAI INTL", "long_name": "Jinhai International Group Holdings Limited", "summary": "Jinhai International Group Holdings Limited, an investment holding company, primarily provides manpower outsourcing and ancillary services to building and construction contractors in Singapore. The company offers labor dispatching and supporting services. It also provides dormitory services; information technology services, such as support and maintenance; and construction ancillary services comprising warehousing, cleaning, and building maintenance works. The company was formerly known as Kakiko Group Limited and changed its name to Jinhai International Group Holdings Limited in October 2019. Jinhai International Group Holdings Limited was incorporated in 2017 and is based in Sheung Wan, Hong Kong.", "currency": "HKD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Sheung Wan"}, "2301.T": {"short_name": "GAKUJO CO LTD", "long_name": "Gakujo Co., Ltd.", "summary": "Gakujo Co., Ltd. provides human resource and recruitment services in Japan. The company engages in the new graduate and mid-career recruitment, employment support, career change events, and job-hunting support activities. It also provides internship career support, training, and recruitment tool production services, as well as recruitment outsourcing and advertising services. The company was founded in 1976 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2410.T": {"short_name": "CAREER DESIGN CENTER CO.LTD.", "long_name": "Career Design Center Co., Ltd.", "summary": "Career Design Center Co., Ltd. provides human resource services in Japan. It operates job change sites; and provides job fair, recruitment, IT dispatch, new graduate recruitment support, and career change services, as well as information magazines and events for job hunting. The company was founded in 1993 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2427.T": {"short_name": "OUTSOURCING INC", "long_name": "OUTSOURCING Inc.", "summary": "OUTSOURCING Inc., together with its subsidiaries, provides engineering, manufacturing, and service operations outsourcing services in Japan and internationally. It operates through Domestic Engineering Outsourcing Business; Domestic Manufacturing Outsourcing Business; Domestic Service Operations Outsourcing Business; Overseas Engineering Outsourcing Business; Overseas Manufacturing and Service Operations Outsourcing Business; and Other segments. The company engages in the design, development, and experiment/evaluation process; development of telecommunication-related applications for websites/smartphones, and ecommerce websites; development of foundational IT systems and infrastructure networks; provision of outsourcing services for research and development operations in medical-and chemical-related areas operation of construction plans and design planning, and construction; and operation of IT schools, etc. It also offers construction management services; production technologies and management services for outsourcing manufacturing operations; outsourcing services for recruiting fixed-term employees; administrative work outsourcing services, including labor management and housing management for foreign technical interns, etc.; and job hunting support for employees. In addition, the company provides outsourcing services to government offices, such as U.S. military facilities, as well as convenience stores, call centers, etc.; dispatch services for IT engineers and finance-related experts; human resource services for manufacturing-related production; outsourcing, dispatching and recruiting of personnel services for administrative and service-related work; payroll services; BPO services and temporary worker dispatching for public institutions; and cross-border employment services. Additionally, it develops, manufactures, and markets products. The company was founded in 1997 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2429.T": {"short_name": "WORLD HOLDINGS CO LTD", "long_name": "World Holdings Co., Ltd.", "summary": "World Holdings Co., Ltd. engages in the human resources and education, information and telecommunications, and real estate businesses. It offers temporary staffing, business contracting, and personnel introduction services; and manufacturing, office, construction engineer, and sales staff dispatch services. It also provides geographic information system development, discipline education and training, administrative consignment, and clinical trial consignment services; and cameras and digital equipment, and precision instruments repair services. In addition, the company is also involved in the software outsourcing and development business; condominium sales and management, residential land sales, building management, real estate consulting and brokerage, real estate development, renovation, and leasing management businesses; design, construction, and sale of single-family detached homes; and design, development, sales, and rental of prefabricated houses. Further, it provides telemarketing and corporate solutions; operates cellphone shops; offers Web production and creative services; and manages agricultural parks. The company was formerly known as World Intec Co., Ltd. and changed its name to World Holdings Co., Ltd. in July 2014. World Holdings Co., Ltd. was founded in 1993 and is headquartered in Fukuoka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Fukuoka"}, "2471.T": {"short_name": "S-POOL INC", "long_name": "S-Pool, Inc.", "summary": "S-Pool, Inc. provides human resources and outsourcing business solutions in Japan. It offers temporary staffing and recruitment services primarily focuses on operations that require communication skills. The company also provides outsourcing services, such as share-based outsourcing services, employment services, logistics outsourcing services, and part-time job application reception outsourcing services. S-Pool, Inc. was founded in 1999 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2475.T": {"short_name": "WDB HOLDINGS CO LTD", "long_name": "WDB Holdings Co., Ltd.", "summary": "WDB Holdings Co., Ltd. provides human resource services in Japan. The company offers placement and dispatching services for research and development in the biopharma and chemical sectors; and specified dispatching services for research and development in the engineering sectors. It also provides safety information management support services; data management and statistical analysis for clinical trials/post marketing surveillance; and consulting services and dossier preparation for product-registrarion services. In addition, the company offers clinical trial services in pharmacovigilance and analytics; clinical monitoring, data management, statistical analysis, and safety information management support services; research and development services in drug discovery research; and custom synthetic services for drug discovery research. Further, it develops and manufactures an assortment of devices, including gas-assist injection molding machines, nitrogen generators, and bio-related devices. WDB Holdings Co., Ltd. was founded in 1985 and is headquartered in Himeji, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Himeji"}, "24X.F": {"short_name": "LIVEHIRE LIMITED O.N.", "long_name": "LiveHire Limited", "summary": "LiveHire Limited provides online talent acquisition software solutions to enterprises in Australia. It operates LiveHire, a talent acquisition and engagement platform for recruitment process, such as sourcing, engaging, hiring, analyzing, and integrating, as well as for internal mobility and outplacement. The company was founded in 2011 and is based in Melbourne, Australia.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Melbourne"}, "28S.SG": {"short_name": "Staffing 360 Solutions Inc. Reg", "long_name": "Staffing 360 Solutions, Inc.", "summary": "Staffing 360 Solutions, Inc., a staffing company, engages in the acquisition of staffing companies in the United States and the United Kingdom. The company operates through three segments: Commercial Â\u0096 US, Professional Â\u0096 US, and Professional - UK. Its services primarily comprise the provision of temporary contractors; and the recruitment of candidates for permanent placement. It focuses primarily on the staffing companies supporting accounting and finance, information technology, engineering, administration, and commercial disciplines. The company was formerly known as Golden Fork Corporation and changed its name to Staffing 360 Solutions, Inc. in April 2012. Staffing 360 Solutions, Inc. was incorporated in 2009 and is headquartered in New York, New York.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "STU", "market": "dr_market", "country": "United States", "city": "New York"}, "300662.SZ": {"short_name": "BEIJING CAREER INT", "long_name": "Beijing Career International Co., Ltd.", "summary": "Beijing Career International Co., Ltd. provides recruitment solutions. The company offers executive search services; recruitment process outsourcing services; flexible staffing services, including short-term to long-term dispatcher hires, and project and staffing outsourcing services; recruitment consulting services; and talent assessment consultancy services. It also provides recruitment training services; campus talent search, campus recruitment event, and employer branding services; layoff design, compensation consulting, and labor dispute processing services; and knowledge-sharing think tank expert services, as well as payroll and tax solutions. The company serves multinational corporations, listed companies, fast-growing firms, non-profit organizations, government, etc. in Mainland China, Hong Kong, India, Singapore, Malaysia, the United States, the United Kingdom, and Australia. Beijing Career International Co., Ltd. is headquartered in Beijing, China.", "currency": "CNY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Beijing"}, "3991.T": {"short_name": "WANTEDLY INC", "long_name": "Wantedly, Inc.", "summary": "Wantedly, Inc. engages in the planning, development, and management of business SNS services. It offers business card management applications. The company was founded in 2010 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3MI.F": {"short_name": "PAGEGROUP PLC  LS -,01", "long_name": "PageGroup plc", "summary": "PageGroup plc, together with its subsidiaries, provides recruitment consultancy and support services. The company offers executive search services; recruitment services for qualified professional on permanent, temporary, and contract or interim basis; recruitment services to organizations requiring permanent employees and temporary or contract staff at technical and administrative support, professional clerical, and junior management levels; and flexible recruitment outsourcing services under the Page Executive, Michael Page, Page Personnel, and Page Outsourcing primary brands. It also provides assessment, consulting, and talent services under the Page Assessment, Page Consulting, and Page Talent supplementary brands. The company operates in the United Kingdom, rest of Europe, the Middle East, Africa, the Asia Pacific, and the Americas. The company was formerly known as Michael Page International plc and changed its name to PageGroup plc in June 2016. PageGroup plc was founded in 1976 and is based in Addlestone, the United Kingdom.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Addlestone"}, "3OM.F": {"short_name": "OPENJOBMETIS S.P.A.  EO 1", "long_name": "Openjobmetis S.p.A.", "summary": "Openjobmetis S.p.A. operates as an employment agency in Italy. It offers temporary or permanent placement, staff leasing, personnel recruitment and selection, training, and outplacement services, as well as manages employment relationship from the bureaucratic-administrative aspects to training. The company also provides digital head hunting services; family assistants for elderly and non-self-sufficient; and online recruitment services for people with disabilities. It offers its services to the naval, industrial, health, large-scale retail trade, bank and finance, information and communication technology, agro-industrial, hotel, restaurant, and catering sectors. Openjobmetis S.p.A. was founded in 2011 and is headquartered in Gallarate, Italy.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "Italy", "city": "Gallarate"}, "4290.T": {"short_name": "PRESTIGE INTERNATIONAL INC", "long_name": "Prestige International Inc.", "summary": "Prestige International Inc. provides business process outsourcing services in Japan and internationally. It offers roadside assistance services for nonlife insurance companies, car manufacturers, and car dealerships; and property assistance services, such as home and parking assistance services for real estate management companies, parking lot operators, and car sharing service operators. The company also provides insurance BPO services, including travel insurance claim agent services and health care programs; and extended warranties for automobiles, rental guarantees, household equipment warranties, and nursing care expense guarantees. In addition, it offers contact service-related IT infrastructure; CRM, accident reception, and credit card issuance and operation services; and temporary worker services. Further, the company provides support for implementing supply-chain management; offers co-signing, rental property businesses management, living support, rent guarantee, towing, and rehabilitation day services; and develops and provides sales promotion systems and value-added services. Prestige International Inc. was founded in 1986 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4318.T": {"short_name": "QUICK CO LTD", "long_name": "Quick Co.,Ltd.", "summary": "QUICK CO.,LTD. provides human resource and information services in Japan and internationally. The company offers recruitment advertisement planning, and handling services, as well as human resources consultancy, education and training, and other services; personnel placement, temporary staffing, temporary-to-permanent staffing, and business contracting services; and personnel and labor consulting, advisory, and other services. It also publishes and posts information magazines; offers posting and concierge services; and operates Nihon no Jinjibu, a human resources department Website with information related to personnel and other labor-related subjects. QUICK CO.,LTD. was founded in 1980 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "4336.T": {"short_name": "CRIE ANABUKI INC", "long_name": "Crie Anabuki Inc.", "summary": "Crie Anabuki Inc. operates as a human resources service company in Japan. It offers temporary staffing, temporary to permanent placement, recruitment support, human resources consulting, training and assessment, and outplacement services, as well as business management or personnel management outsourcing services. The company was founded in 1986 and is headquartered in Takamatsu, Japan. Crie Anabuki Inc. is a subsidiary of Anabuki Kosan Inc.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Takamatsu"}, "4433.T": {"short_name": "HITO-COMMUNICATIONS HOLDINGS IN", "long_name": "HITO-Communications Holdings,Inc.", "summary": "HITO-Communications Holdings,Inc., through its subsidiary, HITO-Communications,Inc., provides outsourcing, temporary staffing, and placement services; and engages in the e-commerce/television commerce support business, wholesale business, etc., in Japan. It offers sales and marketing services for various products from consumables to durables. The company also provides sales promotion services, including store and booth design; in-store point of purchase design and production; planning, design, and administration for domestic and international exhibitions; and planning and implementation of action plans to attract customers. In addition, it offers temporary and permanent staffing, training and employment agency services; call center services, including inbound and outbound services and multilingual support in Chinese, English, Korean, Thai, and others; and inbound service for visitors from abroad. Further, the company provides staffing services for the tourism industry, which include tour conductor staffing, bus tour guide staffing, hotel and resort facility staffing, interpreter staffing, licensed interpreter/guide staffing, document translation, and tourism business-related clerical work. Additionally, it offers miscellaneous support services, such as meeting/seminars for companies; company trips/training trips; international meetings/society meetings, and summit meetings; and culture/sporting events, and exhibition/trade fair. The company was founded in 1998 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4641.T": {"short_name": "ALTECH CORPORATION", "long_name": "Altech Corporation", "summary": "Altech Corporation provides technical and engineer assignment services in Japan and internationally. The company offers staffing solutions, including assignment/contracting in technical/administrative fields; welfare solutions, such as the cultivation of nursing care staff, assignment/introduction of staff to nursing care facilities, and introduction of residents to nursing care facilities; and education solutions comprising working professional/technical training for new and mid-career employees. It also provides engineering solutions/technical support services comprising engineers staffing service; contracting/outsourcing services; and contract partners/total business solutions. In addition, the company designs, manufactures, and installs plant and factory equipment; offers installation and electric wiring services for transportation systems inside clean room factories; and provides staff assignment, staff introduction, and total staffing services. Further, it provides agriculture staffing services; business solutions for nursing care; and training care person services. The company serves manufacturing companies of machinery, electricity and precision instrument, and information processing and communication businesses, as well as listed and blue-chip companies. Altech Corporation was founded in 1968 and is headquartered in Yokohama, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Yokohama"}, "4834.S": {"short_name": "CAREER BANK", "long_name": "CAREER BANK Co., Ltd.", "summary": "CAREER BANK Co., Ltd. primarily engages in the dispatching of general workers and fee-charging employment placement business. It operates through Manpower Dispatching, Manpower Dispatching (Kanto), Recruitment, Re-employment Support, Payroll, and Others segments. The company also provides sales outsourcing services; counselling and training services for re-employment; payroll services; and language training services. CAREER BANK Co., Ltd. was founded in 1987 and is headquartered in Sapporo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "SAP", "market": "jp_market", "country": "Japan", "city": "Sapporo"}, "4848.T": {"short_name": "FULLCAST HOLDINGS", "long_name": "Fullcast Holdings Co., Ltd.", "summary": "Fullcast Holdings Co., Ltd. provides human resource solutions in Japan. It operates through Short-Term Operational Support Business; Sales Support Business; and Security, Other Businesses segments. The company offers short-term personnel services; security services primarily for public facilities and ordinary corporations; short-term human resources services in various business fields, including distribution, warehouses, retail, services, and call centers; and charged employment placement services. It also provides human resources services to an active senior primarily in the Tokyo metropolitan area; human resources services specializing in drivers; and staffing services primarily for foreign nationals. In addition, the company offers data entry, order management contracting, credit screening agency services, invoice agency and processing, payment management operations, order management, and book keeping and accounting contracting services. Further, it provides housekeeping, manned guarding, street and traffic security services, etc.; and human resources services for reception, as well as real estate leasing, payroll management outsourcing, and management advisory services. Additionally, the company engages in the sales support of telecommunications products and call center operations. The company was founded in 1990 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4849.T": {"short_name": "EN-JAPAN INC.", "long_name": "en-japan inc.", "summary": "en-japan inc. provides online recruitment, recruiting and staffing, employee training, and HR consulting and aptitude test services in Japan and internationally. The company operates job information sites, including en TENSHOKU for various recruitment and career change support services; en TENSHOKU WOMAN, a career-change support services for women; AMBI, a career change site designed for young people; MIDDLE NO TENSHOKU, a recruitment website; en HAKEN, a job-search site for temporary employment; en BAITO, a recruitment website for part-time and casual job information; en WOMEN WORK, a recruitment site for women professionals; and ONNA NO KYUJIN MART, a centralized recruitment site for female professionals. It also provides recruiting services, such as en AGENTS that offers professional and specialized support services; en Lighthouse, a word-of-mouth site; CAREER HACK, a career information site for professionals in web and IT industries; and SMART GYOKAI MAP, an industry research site that explains various companies and trends in specific industries. In addition, the company operates en JINJI NO MIKATA, a recruitment support services for HR professionals; en COLLEGE for employee education services; engage, a website for recruitment support tool; HR OnBoard, an employee retention risk identification tool; and 3E TEST for assessing the talent pool, as well as provides evaluation and education consulting services. The company was founded in 2000 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6070.T": {"short_name": "CAREERLINK CO LTD", "long_name": "Careerlink Co., Ltd.", "summary": "Careerlink Co., Ltd. provides human resource services in Japan. It offers human resource services for business process outsourcing, customer relationship management, and sales support related businesses; and general office works. The company also provides temporary staffing, recruitment, and contracting human resource services for food processing and manufacturing/processing businesses, and cleaning of buildings and hotels, etc. The company was founded in 1996 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6098.T": {"short_name": "RECRUIT HOLDINGS CO LTD", "long_name": "Recruit Holdings Co., Ltd.", "summary": "Recruit Holdings Co., Ltd. provides employment information services in Japan and internationally. It operates through three segments: HR Technology, Media & Solutions, and Staffing. The company operates Indeed.com, a job aggregator search engine; and Glassdoor, an online job platform and company information site. It also operates Suumo, an online platform and print media, which provides information related to home purchases, sales, rentals, and renovation services; Zexy, a magazine and online platform providing information to organize customized wedding events; Study Sapuri Shinro, an online platform and print media, which provides higher education and career information primarily for high school students; Study Sapuri, an online learning support platform for students and adults; and Car Sensor that provides information on pre-owned automobiles for potential buyers. In addition, the company operates Jalan, a site offering travel information and accommodation booking for travel; Hot Pepper Gourmet, an online booking site information about restaurants and discount coupons, as well as online reservations and a scheduling function for invited guests; Hot Pepper Beauty, a domestic search and booking site for hair, relaxation, and beauty salons; AirRegi and AirPAY provides support services to dining and beauty enterprise clients; Rikunabi, a job information site for soon-to-be graduates; Rikunabi Next, a job portal site for people looking to change jobs; Recruit Agent, an employment agency staffed with career advisors; and Townwork, a magazine that provides information on job openings to part-time job seekers. Further, it offers clerical and IT staffing agency; light industrial staffing; human capital outsourcing; IT and digital recruitment services specializing in contracting and permanent recruitment; and human resources services, products, and technologies to organizations and individuals. The company was founded in 1960 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6100.HK": {"short_name": "TONGDAO LIEPIN", "long_name": "Tongdao Liepin Group", "summary": "Tongdao Liepin Group, an investment holding company, operates an online talent services platform in the People's Republic of China. The company offers various talent services, including professional profile, job and headhunter recommendations, professional social network and career-related content, premium membership, career coaching, and CV advisory services to individual users through its liepin.com Website, mobile app Liepin Tongdao, and WeChat official accounts. It also provides subscription-based and headhunter-assisted closed loop talent acquisition services for business customers to accurately identify and acquire active job seekers and suitable passive candidates for an opportunity primarily through Liepintong, a one-stop online software-as-a-solution (SaaS) interface. In addition, it offers Chenglietong, a SaaS solution that enables professional recruiting firms and individual headhunters to source candidates and manage their headhunting process; and offline talent services. The company was formerly known as Wise Talent Information Technology Co., Ltd and changed its name to Tongdao Liepin Group in July 2020. Tongdao Liepin Group was incorporated in 2018 and is headquartered in Beijing, the People's Republic of China.", "currency": "HKD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Beijing"}, "6194.T": {"short_name": "ATRAE INC", "long_name": "Atrae, Inc.", "summary": "Atrae, Inc. plans, develops, and manages job information Websites in Japan. It operates Green, a job site that provides a proposal of job offers to job seekers and talents to companies; yenta, a matching app that connects business professionals utilizing AI technology; and wevox, an engagement analysis tool, as well as provides stress check test services. Atrae, Inc. was founded in 2003 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6198.T": {"short_name": "CAREER CO LTD", "long_name": "CAREER CO., LTD.", "summary": "CAREER CO., LTD. provides human resources services in Japan. The company engages in general worker dispatch, outsourcing, job consulting and advertisement, and paid employment placement businesses. It also offers temporary staffing services. CAREER CO., LTD. was founded in 2009 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6539.T": {"short_name": "MATCHING SERVICE JAPAN CO LTD", "long_name": "Matching Service Japan Co., Ltd.", "summary": "Matching Service Japan Co., Ltd. engages in the recruitment business in Japan. The company offers services in the areas of accounting, finance, human resources, general affairs, legal affairs, accounting office, lawyer, certified public accountant, tax accountant, etc. The company was founded in 1990 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6551.T": {"short_name": "TSUNAGU GROUP HOLDINGS INC", "long_name": "Tsunagu Group Holdings, Inc.", "summary": "Tsunagu Group Holdings, Inc. provides career consulting services primarily for part-time jobs in Japan. It is involved in the recruitment agency activities; various consulting activities in the areas of general human resources, and personnel and general affairs; and human resource development/training, personnel placement and paid employment placement, general worker dispatching, and promotion support businesses. The company was formerly known as Tsunagu Solutions Inc. and changed its name to Tsunagu Group Holdings, Inc. in November 2018. Tsunagu Group Holdings, Inc. was founded in 2007 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6558.T": {"short_name": "COOKBIZ CO LTD", "long_name": "Cookbiz Co.,Ltd.", "summary": "Cookbiz Co.,Ltd. provides human resource services specializing in the food industry. The company offers paid employment, recruitment site management, and training services. It also provides job advertisement, talent agency, and scout services. In addition, the company operates Cook Biz Food College, which supports skill improvement. Cookbiz Co.,Ltd. was founded in 2007 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "6563.T": {"short_name": "MIRAI WORKS INC", "long_name": "Mirai Works Inc.", "summary": "Mirai Works Inc. provides hiring recruitment/procurement support services in Japan. It offers Freeconsultant.jp, a business matching service for freelance consultants; Professional career, a job change support; Glocal Mission Jobs, a local career change support platform for professional human resources and local areas; Adult intern, a re-employment support service with trial operation for freelancer; and Skill Shift, a side business matching platform that connects professional human resources in urban areas with local companies. The company was founded in 2012 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6569.T": {"short_name": "NISSO CORPORATION", "long_name": "Nisso Corporation", "summary": "Nisso Corporation provides human resources services in Japan. The company operates in two segments, General Human Resources Service Business and Other Businesses. It offers contracting services, such as manufacturing, and maintenance and design work contracting; human resources and employment placement dispatching services, including skilled staff, employment placement, supervisor, general, engineer, and manufacturing dispatching; recruitment services comprising operators, office workers, managers, specialist, etc.; and temporary staffing services. The company also provides labor management support services consisting of recruitment, labor management, company housing management, and vehicle operation management agent services; contracting consulting services; and education and training services. In addition, it offers nursing care and home nursing care facility services; and light work contracting services, as well as engages in the sale of goods. The company was founded in 1971 and is headquartered in Yokohama, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Yokohama"}, "6919.HK": {"short_name": "RENRUI HR", "long_name": "Renrui Human Resources Technology Holdings Limited", "summary": "Renrui Human Resources Technology Holdings Limited, an investment holding company, provides human resource solutions in China. The company operates through Flexible Staffing, Professional Recruitment, and Other HR Solutions segments. It operates online to offline recruitment platform in flexible staffing market. The company offers talent outsourcing; senior talent management; and professional recruitment services, including membership, negotiation, on-boarding management, and on-site recruitment. It also provides business process outsourcing services, such as performance management, operations management, training management, information security, and scheduling management, as well as labor dispatch and corporate training services. The company was founded in 2010 and is headquartered in Chengdu, China.", "currency": "HKD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Chengdu"}, "6M8.F": {"short_name": "MORNEAU SHEPELL", "long_name": "Morneau Shepell Inc.", "summary": "Morneau Shepell Inc. operates as a human resources (HR) consulting and technology company in Canada, the United States, and internationally. The company provides health and productivity, administrative, and retirement solutions to assist employers in managing the financial security, health, and productivity of their employees. It offers health and productivity services, including absence and disability management, Internet-based cognitive behavioral therapy, safety groups, health and benefits consulting, and workers' compensation services; and administrative solutions, such as defined benefit and contribution pension administration, employee self-service, health and benefits administration, and human resources contact centers, as well as pension and benefits software. The company also provides modern employee assistance, wellness, news feed and recognition, perks and savings, workplace learning, total health index assessment, workplace mental health, children's support, traumatic event support, targeted health program, domestic and international student support, and HR support solutions. In addition, it offers retirement solutions comprising actuarial; compensation consulting; defined contribution consulting; international pension regulatory; investment consulting; governance, legal, and compliance; pension sustainability and design; pension regulatory; pooled registered pension plans and voluntary retirement savings plans; and retirement planning and total plan solutions. Further, the company provides asset and risk management, and communication and change management solutions. Additionally, it develops and implements customized investment strategies for pension funds, high-net-worth individuals, endowments, and others. It serves corporations, not-for-profit organizations and government organizations and institutions. The company was formerly known as Morneau Sobeco Income Fund and changed its name to Morneau Shepell Inc. in January 2011. Morneau Shepell Inc. was founded in 1962 and is headquartered in Toronto, Canada.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "6WT.F": {"short_name": "TONGDAO LIEP.GR. DL-,0001", "long_name": "Tongdao Liepin Group", "summary": "Tongdao Liepin Group, an investment holding company, operates an online talent services platform in the People's Republic of China. The company offers various talent services, including professional profile, job and headhunter recommendations, professional social network and career-related content, premium membership, career coaching, and CV advisory services to individual users through its liepin.com Website, mobile app Liepin Tongdao, and WeChat official accounts. It also provides subscription-based and headhunter-assisted closed loop talent acquisition services for business customers to accurately identify and acquire active job seekers and suitable passive candidates for an opportunity primarily through Liepintong, a one-stop online software-as-a-solution (SaaS) interface. In addition, it offers Chenglietong, a SaaS solution that enables professional recruiting firms and individual headhunters to source candidates and manage their headhunting process; and offline talent services. The company was formerly known as Wise Talent Information Technology Co., Ltd and changed its name to Tongdao Liepin Group in July 2020. Tongdao Liepin Group was incorporated in 2018 and is headquartered in Beijing, the People's Republic of China.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "China", "city": "Beijing"}, "7043.T": {"short_name": "ALUE CO LTD", "long_name": "Alue Co.,Ltd.", "summary": "Alue Co.,Ltd. provides human resources development, employee training, and HR consulting services to companies within the IT, manufacturing, and financial fields in Japan. The company was founded in 2003 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7045.T": {"short_name": "TSUKUI STAFF CORP", "long_name": "Tsukui Staff Corporation", "summary": "Tsukui Staff Corporation engages in worker dispatch projects, paid employment introduction business, and education and training projects in Japan. The company was founded in 2016 and is headquartered in Yokohama, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Yokohama"}, "7059.T": {"short_name": "COPRO-HOLDINGS CO LTD", "long_name": "COPRO-HOLDINGS. Co., Ltd.", "summary": "COPRO-HOLDINGS. Co., Ltd., a temporary staffing agency, dispatches construction engineers in Japan. The company was founded in 2006 and is headquartered in Nagoya, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Nagoya"}, "7064.T": {"short_name": "HOWTELEVISION INC", "long_name": "Howtelevision, Inc.", "summary": "Howtelevision,Inc. operates and manages a carrier platform in Japan. The company's carrier platform offers students a growth environment through internships and job hunting activities; and provides content, such as company information, and recruitment information. It also provides Liiga, a career improvement support service for working people. The company was founded in 2010 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7089.T": {"short_name": "FOR STARTUPS INC", "long_name": "for Startups, Inc.", "summary": "for Startups, Inc. operates growth industry support platform in Japan. The company was founded in 2016 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7781.T": {"short_name": "HIRAYAMA HOLDINGS CO LTD", "long_name": "HIRAYAMA HOLDINGS Co.,Ltd.", "summary": "HIRAYAMA HOLDINGS Co.,Ltd. operates as a manufacturing support company in Japan. The company provides in-sourcing and temporary staffing services, including manufacturing outsourcing, and manufacturing temporary staffing and personnel placement services; and engineer placement and entrusted development engineer services, such as dispatching its engineer staff to the engineering section of its clients. It also offers GENBA KAIZEN consulting, and human resources development and education/management services. The company was formerly known as HIRAYAMA Co.,Ltd. and changed its name to HIRAYAMA HOLDINGS Co.,Ltd. in March 2017. HIRAYAMA HOLDINGS Co.,Ltd. was founded in 1955 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8462.HK": {"short_name": "OMNIBRIDGE HLDG", "long_name": "Omnibridge Holdings Limited", "summary": "Omnibridge Holdings Limited, an investment holding company, provides human resources outsourcing and recruitment services in Singapore and Hong Kong. The company sources and employs suitable candidates that match the job descriptions specified by its clients; and human resources recruitment services to employers seeking suitable candidates for positions at various levels, including administrative, executive, managerial, and professional. It also offers other human resources support services, such as referral and parking services. The company serves public and private sector clients, including Singapore government agencies and non-profit organizations. Omnibridge Holdings Limited was founded in 2005 and is headquartered in Singapore. Omnibridge Holdings Limited is a subsidiary of Omnipartners Holdings Limited.", "currency": "HKD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "HKG", "market": "hk_market", "country": "Singapore", "city": "Singapore"}, "9610.T": {"short_name": "WILSON LEARNING WORLDWIDE INC", "long_name": "Wilson Learning Worldwide Inc.", "summary": "Wilson Learning Worldwide Inc. provides human performance improvement solutions for various organizations. It consults, assesses, designs, develops, delivers, reinforces, and sustains learning solutions. The company offers a suite of program solutions in sales, leadership, and workforce development capabilities, as well as learning services, including consulting, instructional design, customization, facilitator and coach, measurement and evaluation, and learning transfer services. It serves clients in 50 countries and 30 languages worldwide. The company was founded in 1965 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9744.T": {"short_name": "MEITEC CORPORATION", "long_name": "Meitec Corporation", "summary": "Meitec Corporation provides dispatch engineering solutions to manufacturing companies in Japan. It offers engineering solutions, including mechanical design, electrical/electronic design, software development, chemical engineering, and analysis/evaluation. The company was formerly known as Nagoya Technical Center Co., Ltd. and changed its name to Meitec Corporation in 1985. Meitec Corporation was founded in 1974 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9D4.F": {"short_name": "PASONA GROUP INC.", "long_name": "Pasona Group Inc.", "summary": "Pasona Group Inc. provides human resource-related support services in Japan. It offers temporary staffing, contracting, HR consulting, education and training, global sourcing, placement/recruiting, outplacement, outsourcing, and other services, as well as life and public solutions. The company was founded in 1976 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "AAD.DE": {"short_name": "AMADEUS FIRE AG", "long_name": "Amadeus FiRe AG", "summary": "Amadeus FiRe AG provides specialized personnel services in Germany. The company operates in two segments, Temporary Staffing/Interim and Project Management/Permanent Placement; and Training. It offers personnel services for professionals and executives in the fields of accounting, office, banking, and IT. The company also provides training in preparation for state examinations for tax advisors and specialists, accountants, and financial controllers; professional training in the fields of tax, accounting, and financial control; and education and training in IAS/IFRS and US-GAAP. In addition, it runs recognized private certificate courses primarily designed to prepare participants for professional practice in the field of accounting. The company was founded in 1986 and is headquartered in Frankfurt am Main, Germany.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "GER", "market": "de_market", "country": "Germany", "city": "Frankfurt am Main"}, "AAD.F": {"short_name": "AMADEUS FIRE AG", "long_name": "Amadeus FiRe AG", "summary": "Amadeus FiRe AG provides specialized personnel services in Germany. The company operates in two segments, Temporary Staffing/Interim and Project Management/Permanent Placement; and Training. It offers personnel services for professionals and executives in the fields of accounting, office, banking, and IT. The company also provides training in preparation for state examinations for tax advisors and specialists, accountants, and financial controllers; professional training in the fields of tax, accounting, and financial control; and education and training in IAS/IFRS and US-GAAP. In addition, it runs recognized private certificate courses primarily designed to prepare participants for professional practice in the field of accounting. The company was founded in 1986 and is headquartered in Frankfurt am Main, Germany.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "Germany", "city": "Frankfurt am Main"}, "AARVI.NS": {"short_name": "Aarvi Encon Limited", "long_name": "Aarvi Encon Limited", "summary": "Aarvi Encon Limited provides manpower outsourcing and consultancy services in India and the United Arab Emirates. The company offers information technology (IT) staffing, manpower outsourcing/technical staffing, project management, construction supervision, procurement assistance/expediting, inspection, pre-commissioning and commissioning, operation and maintenance, and shutdown, as well as engineering services. It serves the IT, engineering/EPC, oil and gas, LNG, PNG, metal and mineral, fertilizer, telecom, refinery/petrochemical, pipeline, infrastructure, power, renewable energy, cement, automobile, ports and terminals, and CGD/CNG, as well as metro and mono rail/railway industries. The company was founded in 1987 and is headquartered in Mumbai, India.", "currency": "INR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "ADEN.SW": {"short_name": "ADECCO N", "long_name": "Adecco Group AG", "summary": "Adecco Group AG, together with its subsidiaries, provides human resource services worldwide. It provides temporary staffing, permanent placement, and other services. The company offers workplace solutions for candidates in skilled and unskilled roles across industrial and service sectors under the Adecco brand names, as well as recruitment on demand and online staffing platform for hospitality and events under the Adia brand name. It also offers professional solutions in the information technology, engineering and technical, finance and legal, and medical and science-related industries under the Badenoch & Clark, Modis, and Spring Professional brand names; professional permanent recruitment under the Vettery brand name; and online freelance solutions under the YOSS brand name. In addition, the company provides talent solutions, which consists talent development and career transition services under the Lee Hecht Harrison and General Assembly brand names; and managed service programs and recruitment process outsourcing solutions under the Pontoon name. As of December 31, 2019, it operated approximately 5,100 branches in 59 countries and territories. The company was formerly known as Adecco S.A. Adecco Group AG was founded in 1957 and is headquartered in Zurich, Switzerland.", "currency": "CHF", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "EBS", "market": "ch_market", "country": "Switzerland", "city": "Zurich"}, "ADIA.F": {"short_name": "ADECCO GRP AG ADR 1/2/SF1", "long_name": "Adecco Group AG", "summary": "Adecco Group AG, together with its subsidiaries, provides human resource services worldwide. It provides temporary staffing, permanent placement, and other services. The company offers workplace solutions for candidates in skilled and unskilled roles across industrial and service sectors under the Adecco brand names, as well as recruitment on demand and online staffing platform for hospitality and events under the Adia brand name. It also offers professional solutions in the information technology, engineering and technical, finance and legal, and medical and science-related industries under the Badenoch & Clark, Modis, and Spring Professional brand names; professional permanent recruitment under the Vettery brand name; and online freelance solutions under the YOSS brand name. In addition, the company provides talent solutions, which consists talent development and career transition services under the Lee Hecht Harrison and General Assembly brand names; and managed service programs and recruitment process outsourcing solutions under the Pontoon name. As of December 31, 2019, it operated approximately 5,100 branches in 59 countries and territories. The company was formerly known as Adecco S.A. Adecco Group AG was founded in 1957 and is headquartered in Zurich, Switzerland.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "Switzerland", "city": "Zurich"}, "ADP": {"short_name": "Automatic Data Processing, Inc.", "long_name": "Automatic Data Processing, Inc.", "summary": "Automatic Data Processing, Inc. provides cloud-based human capital management solutions worldwide. It operates through two segments, Employer Services and Professional Employer Organization (PEO). The Employer Services segment offers strategic, cloud-based platforms, and human resources (HR) outsourcing solutions. Its offerings include payroll, benefits administration, talent management, HR management, workforce management, insurance, retirement, and compliance services. The PEO Services segment provides HR outsourcing solutions to small and mid-sized businesses through a co-employment model. This segment offers benefits package, protection and compliance, talent engagement, comprehensive outsourcing, and recruitment process outsourcing services. The company was founded in 1949 and is headquartered in Roseland, New Jersey.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Roseland"}, "ADP.F": {"short_name": "AUTOM. DATA PROC. DL -,10", "long_name": "Automatic Data Processing, Inc.", "summary": "Automatic Data Processing, Inc. provides cloud-based human capital management solutions worldwide. It operates through two segments, Employer Services and Professional Employer Organization (PEO). The Employer Services segment offers strategic, cloud-based platforms, and human resources (HR) outsourcing solutions. Its offerings include payroll, benefits administration, talent management, HR management, workforce management, insurance, retirement, and compliance services. The PEO Services segment provides HR outsourcing solutions to small and mid-sized businesses through a co-employment model. This segment offers benefits package, protection and compliance, talent engagement, comprehensive outsourcing, and recruitment process outsourcing services. The company was founded in 1949 and is headquartered in Roseland, New Jersey.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Roseland"}, "ADPR34.SA": {"short_name": "AUTOMATIC DTDRN", "long_name": "Automatic Data Processing, Inc.", "summary": "Automatic Data Processing, Inc. provides cloud-based human capital management solutions worldwide. It operates through two segments, Employer Services and Professional Employer Organization (PEO). The Employer Services segment offers strategic, cloud-based platforms, and human resources (HR) outsourcing solutions. Its offerings include payroll, benefits administration, talent management, HR management, workforce management, insurance, retirement, and compliance services. The PEO Services segment provides HR outsourcing solutions to small and mid-sized businesses through a co-employment model. This segment offers benefits package, protection and compliance, talent engagement, comprehensive outsourcing, and recruitment process outsourcing services. The company was founded in 1949 and is headquartered in Roseland, New Jersey.", "currency": "BRL", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "SAO", "market": "br_market", "country": "United States", "city": "Roseland"}, "ADR.JO": {"short_name": "Adcorp Holdings Limited", "long_name": "Adcorp Holdings Limited", "summary": "Adcorp Holdings Limited provides workplace solutions in South Africa and Australia. It operates through Industrial Services, Support Services, Professional Services, Financial Services, and Training Services segments. The company offers permanent recruitment and flexible staffing, professional IT, business process outsourcing, training, and financial services; and agency agreement, shared, managed, emergent business, payroll card, and project management products and services. Adcorp Holdings Limited was founded in 1968 and is headquartered in Johannesburg, South Africa.", "currency": "ZAc", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Johannesburg"}, "AHEXF": {"short_name": "ADECCO GROUP AG", "long_name": "Adecco Group AG", "summary": "Adecco Group AG, together with its subsidiaries, provides human resource services worldwide. It provides temporary staffing, permanent placement, and other services. The company offers workplace solutions for candidates in skilled and unskilled roles across industrial and service sectors under the Adecco brand names, as well as recruitment on demand and online staffing platform for hospitality and events under the Adia brand name. It also offers professional solutions in the information technology, engineering and technical, finance and legal, and medical and science-related industries under the Badenoch & Clark, Modis, and Spring Professional brand names; professional permanent recruitment under the Vettery brand name; and online freelance solutions under the YOSS brand name. In addition, the company provides talent solutions, which consists talent development and career transition services under the Lee Hecht Harrison and General Assembly brand names; and managed service programs and recruitment process outsourcing solutions under the Pontoon name. As of December 31, 2019, it operated approximately 5,100 branches in 59 countries and territories. The company was formerly known as Adecco S.A. Adecco Group AG was founded in 1957 and is headquartered in Zurich, Switzerland.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "Switzerland", "city": "Zurich"}, "AHEXY": {"short_name": "ADECCO GROUP AG", "long_name": "Adecco Group AG", "summary": "Adecco Group AG, together with its subsidiaries, provides human resource services worldwide. It provides temporary staffing, permanent placement, and other services. The company offers workplace solutions for candidates in skilled and unskilled roles across industrial and service sectors under the Adecco brand names, as well as recruitment on demand and online staffing platform for hospitality and events under the Adia brand name. It also offers professional solutions in the information technology, engineering and technical, finance and legal, and medical and science-related industries under the Badenoch & Clark, Modis, and Spring Professional brand names; professional permanent recruitment under the Vettery brand name; and online freelance solutions under the YOSS brand name. In addition, the company provides talent solutions, which consists talent development and career transition services under the Lee Hecht Harrison and General Assembly brand names; and managed service programs and recruitment process outsourcing solutions under the Pontoon name. As of December 31, 2019, it operated approximately 5,100 branches in 59 countries and territories. The company was formerly known as Adecco S.A. Adecco Group AG was founded in 1957 and is headquartered in Zurich, Switzerland.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "Switzerland", "city": "Zurich"}, "ALDLS.PA": {"short_name": "D.L.S.I.", "long_name": "DLSI", "summary": "DLSI provides human resource management services in France, Luxembourg, Germany, Poland, and Switzerland. The company also offers call center services. It provides its services under the DLSI, PEMSA, and TERCIO brands. The company was founded in 1992 and is based in Forbach, France.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Forbach"}, "ALFRE.PA": {"short_name": "FREELANCE.COM", "long_name": "Freelance.com SA", "summary": "Freelance.com SA provides intermediation between companies and intellectual providers in France, Germany, Britain, Morocco, Switzerland, and Singapore. It offers outsourcing managing, talent acquisition and umbrella company arrangement, and verifying service provider compliance services. The company was founded in 1995 and is headquartered in Paris, France.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Paris"}, "ALMAR.PA": {"short_name": "MARE NOSTRUM", "long_name": "Mare Nostrum Société anonyme", "summary": "Mare Nostrum SociÃ©tÃ© anonyme provides human resources management services to SMEs in France and internationally. It offers temporary employment, recruitment consultancy, training, and wage portage and professional mobility services. The company was founded in 1994 and is headquartered in Grenoble, France.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Grenoble"}, "ASF.F": {"short_name": "INSPERITY INC.  DL-,01", "long_name": "Insperity, Inc.", "summary": "Insperity, Inc. provides human resources (HR) and business solutions to improve business performance for small and medium-sized businesses. The company offers its HR services through its Workforce Optimization and Workforce Synchronization solutions, which include a range of human resources functions, such as payroll and employment administration, employee benefits, workers' compensation, government compliance, performance management, and training and development services. It also provides Insperity Premier, a cloud-based human capital management platform that offers professional employer organization HR outsourcing solutions to its clients; various personnel management services; and employer liability management services, as well as solutions for middle market. In addition, the company offers MarketPlace, an e-commerce portal that offers a range of products and services; and Workforce Acceleration, a human capital management and payroll services solution; time and attendance; performance management; organizational planning; recruiting; employment screening; expense management; retirement; and insurance services. The company operates through 82 offices in the United States. The company was formerly known as Administaff, Inc. and changed its name to Insperity, Inc. in March 2011. Insperity, Inc. was founded in 1986 and is headquartered in Kingwood, Texas.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Kingwood"}, "ASGN": {"short_name": "ASGN Incorporated", "long_name": "ASGN Incorporated", "summary": "ASGN Incorporated provides professional staffing and IT solutions in the technology, digital, creative, engineering and life sciences fields across commercial and government sectors in the United States and internationally. The company operates through Apex, Oxford, and ECS segments. The Apex segment offers technology, digital, creative, scientific, and engineering professionals for contract, contract-to-hire, and permanent placement positions to Fortune 1000 and mid-market clients. The Oxford segment provides hard-to-find technology, digital, engineering, and life sciences staffing and consulting services in various skill and geographic markets. The ECS Segment delivers advanced solutions in cloud, cyber security, artificial intelligence, machine learning, application and IT modernization, and science and engineering. The company was formerly known as On Assignment, Inc. and changed its name to ASGN Incorporated in April 2018. ASGN Incorporated was founded in 1985 and is headquartered in Glen Allen, Virginia.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Glen Allen"}, "ASH.AX": {"short_name": "ASHLEYSERV FPO", "long_name": "Ashley Services Group Limited", "summary": "Ashley Services Group Limited provides labor hire, recruitment, and training services in Australia. It operates through two segments, Labor Hire and Training. The company offers white-collar recruitment services, including permanent, temporary, and contract placements through multi-specialist providers under the Blackadder brand name; and labor hire and workforce solutions under the Action Workforce and Concept Engineering brands. It also provides nationally accredited qualifications training and assessment services under the Ashley Institute of Training, Integracom, Australian Institute of Vocational Development, National Institute of Training, Tracmin, and Qualitas Education brands. The company was founded in 1968 and is headquartered in Sydney, Australia.", "currency": "AUD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "BB1.F": {"short_name": "BARRETT BUS. SVCS  DL-,01", "long_name": "Barrett Business Services, Inc.", "summary": "Barrett Business Services, Inc. provides business management solutions for small and mid-sized companies in the United States. It develops a management platform that integrates a knowledge-based approach from the management consulting industry with tools from the human resource outsourcing industry. The company offers professional employer services under which it enters into a client services agreement to establish a co-employment relationship with each client company, assuming responsibility for payroll, payroll taxes, workers' compensation coverage, and other administration functions for the client's existing workforce. It also provides staffing and recruiting services, such as on-demand or short-term staffing assignment, contract staffing, direct placement, and long-term or indefinite-term on-site management services. The company serves electronics manufacturers, various light-manufacturing industries, agriculture-based companies, transportation and shipping enterprises, food processors, telecommunications companies, public utilities, general contractors in various construction-related fields, and professional services firms. Barrett Business Services, Inc. was incorporated in 1965 and is headquartered in Vancouver, Washington.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Vancouver"}, "BBSI": {"short_name": "Barrett Business Services, Inc.", "long_name": "Barrett Business Services, Inc.", "summary": "Barrett Business Services, Inc. provides business management solutions for small and mid-sized companies in the United States. It develops a management platform that integrates a knowledge-based approach from the management consulting industry with tools from the human resource outsourcing industry. The company offers professional employer services under which it enters into a client services agreement to establish a co-employment relationship with each client company, assuming responsibility for payroll, payroll taxes, workers' compensation coverage, and other administration functions for the client's existing workforce. It also provides staffing and recruiting services, such as on-demand or short-term staffing assignment, contract staffing, direct placement, and long-term or indefinite-term on-site management services. The company serves electronics manufacturers, various light-manufacturing industries, agriculture-based companies, transportation and shipping enterprises, food processors, telecommunications companies, public utilities, general contractors in various construction-related fields, and professional services firms. Barrett Business Services, Inc. was incorporated in 1965 and is headquartered in Vancouver, Washington.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Vancouver"}, "BGK.F": {"short_name": "BG STAFFING INC.  DL-,01", "long_name": "BG Staffing, Inc.", "summary": "BG Staffing, Inc. provides workforce solutions and placement services in the United States. It operates through three segments: Real Estate, Professional, and Light Industrial. The Real Estate segment provides office and maintenance field talent to various apartment communities and commercial buildings through 56 branch offices in 29 states. The Professional segment offers skilled IT professionals with expertise in SAP, Workday, Olik View, Hyperion, Oracle, One Stream, cyber, project management, and other IT workforce solutions to client partners; and finance, accounting, legal, human resource, and related support personnel. Its client partners include Fortune 500 companies, and medium and small companies, as well as consulting firms that engage in systems integration projects. The Light Industrial segment offers skilled and unskilled field talent to manufacturing, distribution, logistics, and call center client partners. It has 12 branch offices and 15 on-site locations operating in 7 states. The company was formerly known as LTN Staffing, LLC and changed its name to BG Staffing, Inc. in November 2013. BG Staffing, Inc. is headquartered in Plano, Texas.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Plano"}, "BGSF": {"short_name": "BG Staffing Inc", "long_name": "BG Staffing, Inc.", "summary": "BG Staffing, Inc. provides workforce solutions and placement services in the United States. It operates through three segments: Real Estate, Professional, and Light Industrial. The Real Estate segment provides office and maintenance field talent to various apartment communities and commercial buildings through 56 branch offices in 29 states. The Professional segment offers skilled IT professionals with expertise in SAP, Workday, Olik View, Hyperion, Oracle, One Stream, cyber, project management, and other IT workforce solutions to client partners; and finance, accounting, legal, human resource, and related support personnel. Its client partners include Fortune 500 companies, and medium and small companies, as well as consulting firms that engage in systems integration projects. The Light Industrial segment offers skilled and unskilled field talent to manufacturing, distribution, logistics, and call center client partners. It has 12 branch offices and 15 on-site locations operating in 7 states. The company was formerly known as LTN Staffing, LLC and changed its name to BG Staffing, Inc. in November 2013. BG Staffing, Inc. is headquartered in Plano, Texas.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Plano"}, "BRNL.AS": {"short_name": "BRUNEL INTERNAT", "long_name": "Brunel International N.V.", "summary": "Brunel International N.V., a professional staffing and recruitment services company, provides secondment, project management, recruitment, and consultancy services worldwide. The company offers contract staffing services, such as project-based contract staffing, contract to permanent placements, international recruitment and relocation, and work permit and Visa assistance; permanent recruitment solutions; and HR consultancy services, including work permit and visa assistance, benefits administration, and dedicated HR support for contract employees. It also provides payroll and employment solutions comprising employee payment, employee liability assumption, contract employee support, payroll, cost savings, administration, invoice and purchase order processing, and regulations dealing. In addition, the company offers IT co-sourcing services; training and work contracts services; HSE and emergency response services; medical, liability, and travel insurance products and services; and project resourcing services comprising vendor inspection, commissioning, and operations and maintenance services. It serves the engineering, aerospace, automotive, ICT, finance, legal, insurance and banking, oil and gas, rail, telecoms, and pharmaceutical sectors. The company was founded in 1975 and is headquartered in Amsterdam, the Netherlands.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "AMS", "market": "nl_market", "country": "Netherlands", "city": "Amsterdam"}, "CEN.PA": {"short_name": "GROUPE CRIT", "long_name": "Groupe CRIT SA", "summary": "Groupe CRIT SA provides temporary staffing and recruitment services to the small and medium-sized businesses and industries in France, the United States, the United Kingdom, Spain, Portugal, Africa, and internationally. It operates through three segments: Temporary Staffing and Recruitment, Airport Services, and Other Services. The company offers services for recruitment; job placement; consulting; HR management digitization; and first-time employment support, including support and advice to job seekers, redeployment and retraining for workers made redundant, engineering consulting for finding employment for recent graduates, employment support and advice for disabled workers, audits and advice for companies, etc. It also provides airport services, such as check-in, boarding, and ticketing; aircraft assistance services consisting of towing, parking, chocking, electrical connections, baggage and cargo handling, checking tanks, cleaning, and aircraft pushouts; traffic services comprising monitoring flight plans, drawing up weight and balance forms, weather monitoring, etc.; and cargo services that include transfer of cargo and mail from runway and storage. In addition, the company offers engineering and industrial maintenance, and hospitality and training services. The company was founded in 1962 and is headquartered in Paris, France.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Paris"}, "CHZ.SI": {"short_name": "HRnetGroup", "long_name": "HRnetGroup Limited", "summary": "HRnetGroup Limited, an investment holding company, engages in the recruitment and staffing business in Singapore, Hong Kong, Taiwan, the People's Republic of China, Japan, South Korea, Malaysia, Thailand, and Indonesia. The company operates through Professional Recruitment, Flexible Staffing, and Others segments. It offers personnel recruitment and human resource related services; employment, recruitment, and personnel placement agency services; executive search services; permanent recruitment, payroll, and temporary and contracted staffing services; and executive and management recruitment services, as well as management consultancy services. The company serves financial institutions, information technology and telecommunications, retail and consumer, healthcare life science, manufacturing, insurance, logistics, services, education, and other industries. It provides its services under the HRnet One, Recruit Express, PeopleSearch, SearchAsia, RecruitFirst, PeopleFirst, RecruitLegal, YesPay!, Performance Consulting, HRnetRimbun, REForce, CENTER Point PERSONNEL, and Young Talent brands. The company was founded in 1992 and is headquartered in Singapore. HRnetGroup Limited is a subsidiary of SIMCO Ltd.", "currency": "SGD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "COM.MC": {"short_name": "CATENON, S.A.", "long_name": "Catenon, S.A.", "summary": "Catenon, S.A., a technology-based company, provides recruitment services in Europe, Asia, the United States, Oceania, and Africa. Its platform engages in searching, attracting, assessing, and introducing candidates to the clients, as well as presents the candidates to clients over the web through tools, such as the technical filmed interview. The company also provides real-time information services. Catenon, S.A. was founded in 2000 and is based in Madrid, Spain.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "MCE", "market": "es_market", "country": "Spain", "city": "Madrid"}, "CRRSQ": {"short_name": "CORPORATE RESOURCE SERVICES INC", "long_name": "Corporate Resource Services, Inc.", "summary": "Corporate Resource Services, Inc. provides diversified technology, staffing, recruiting, and consulting services in the United States. It offers trained employees in the areas of insurance, information technology, accounting, legal, engineering, science, healthcare, life sciences, creative services, hospitality, retail, general business, and light industrial work. The company's staffing solutions include customized employee pre-training and testing, on-site facilities management, vendor management, risk assessment and management, market analyses, and productivity/occupational engineering studies. It provides administrative and light industrial staffing solutions; permanent and temporary professional, administrative, and clerical solutions to financial services, entertainment, media, advertising, fashion, and other companies; software and related hosting and technology services; and professional insurance industry staffing solutions for personnel in claims processing, customer services, and related fields. The company operates 250 staffing and on-site facilities. Corporate Resource Services, Inc. offers its services to various clients ranging from sole proprietorships to Fortune 1000 companies. The company is headquartered in New York, New York. On July 23, 2015, Corporate Resource Services, Inc., along with its affiliates, filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the District of Delaware.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "New York"}, "CTPR": {"short_name": "CTPARTNERS EXECUTIVE SEARCH INC", "long_name": "CTPartners Executive Search Inc.", "summary": "CTPartners Executive Search Inc., together with its subsidiaries, provides retained executive search services worldwide. It facilitates the recruitment and hiring of C-level executives, such as chief executive officers, chief financial officers, chief legal officers, chief marketing officers, and chief human resource officers, as well as other senior executives and board members. The company also offers board advisory services. It primarily serves various industry practice groups, including financial services, professional services, life sciences, technology/media/telecom, consumer/retail, and industrial. The company was founded in 1980 and is based in New York, New York.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "New York"}, "CWL.TO": {"short_name": "CALDWELL PARTNERS INTERNATIONAL", "long_name": "The Caldwell Partners International Inc.", "summary": "The Caldwell Partners International Inc. provides executive search consulting services in Canada, the United States, and Europe. The company offers consulting advice on the identification, evaluation, assessment, and recommendation of qualified candidates for specific positions. It also provides executive search and board services; Caldwell Analytics, a talent optimization solution; and Caldwell Advance, an integrated recruitment solution. In addition, the company offers Agile talent solutions, such as Blockchain, cyber, diversity and inclusion, and value creation advisory, as well as Grow a CXO, an internal recruitment solution. It serves the consumer, retail, e-commerce, education, not-for-profit, government, financial services, industrial, life sciences and healthcare, private equity, venture capital, professional services, and technology sectors. The company was founded in 1970 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "DEDI.ST": {"short_name": "Dedicare AB ser. B", "long_name": "Dedicare AB (publ)", "summary": "Dedicare AB (publ) operates as a staffing company in the healthcare industry primarily in Sweden, Norway, Finland, and Denmark. The company hires and recruits doctors, nurses, social workers, and managers, as well as other staff in health and social work. It provides individual temporary staffing, as well as department, unit, or operations team staffing services. The company was founded in 1996 and is headquartered in Stockholm, Sweden.", "currency": "SEK", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "STO", "market": "se_market", "country": "Sweden", "city": "Stockholm"}, "DHX": {"short_name": "DHI Group, Inc.", "long_name": "DHI Group, Inc.", "summary": "DHI Group, Inc. provides data, insights, and employment connections through specialized services for technology professionals in the United States, the United Kingdom, rest of Europe, the Middles East, Africa, Asia-Pacific regions, and internationally. The company operates Dice that offers job postings of technology and non-technology companies for industries, such as positions for software engineers, big data professionals, systems administrators, database specialists, project managers, and other technology and engineering professionals; and ClearanceJobs, an Internet-based career network, which matches security-cleared professionals with hiring companies searching for employees. It also provides eFinancialCareers, a financial services careers Website for financial services industry professionals from various sectors, including asset management, risk management, investment banking, and information technology. The company serves small, mid-sized, and large direct employers; staffing companies; recruiting agencies; consulting firms; and marketing departments of companies. The company was formerly known as Dice Holdings, Inc. and changed its name to DHI Group, Inc. in April 2015. DHI Group, Inc. was founded in 1991 and is headquartered in New York, New York.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "New York"}, "DP6.F": {"short_name": "DPA GROUP NV  EO-,10", "long_name": "DPA Group N.V.", "summary": "DPA Group N.V. provides professionals secondment, consultancy, and recruitment services. The company offers professional services in the banking and insurance, compliance and risk, engineering, facility, finance and control, IT, legal, marketing, privacy and information security, procurement, recruitment and sales, social domain, supply chain and logistic, and tax fields. DPA Group N.V. was founded in 1990 and is based in Amsterdam, the Netherlands.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "Netherlands", "city": "Amsterdam"}, "DPA.AS": {"short_name": "DPA GROUP", "long_name": "DPA Group N.V.", "summary": "DPA Group N.V. provides professionals secondment, consultancy, and recruitment services. The company offers professional services in the banking and insurance, compliance and risk, engineering, facility, finance and control, IT, legal, marketing, privacy and information security, procurement, recruitment and sales, social domain, supply chain and logistic, and tax fields. DPA Group N.V. was founded in 1990 and is based in Amsterdam, the Netherlands.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "AMS", "market": "nl_market", "country": "Netherlands", "city": "Amsterdam"}, "EEZY.HE": {"short_name": "Eezy Oyj", "long_name": "Eezy Oyj", "summary": "Eezy Oyj operates as a HR services company primarily in Finland. It offers staffing services, including temporary labour to corporate customers through its own units and franchisees. The company also provides recruitment and organizational development services, such as permanent staffing, as well as research, training, and development services to company's personnel. In addition, it offers self-employment services. The company was formerly known as VMP Oyj and changed its name to Eezy Oyj in December 2019. Eezy Oyj was founded in 1988 and is based in Turku, Finland.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "HEL", "market": "fi_market", "country": "Finland", "city": "Turku"}, "ESENSE.HE": {"short_name": "Enersense International Oyj", "long_name": "Enersense International Oyj", "summary": "Enersense International Oyj provides recruitment and resource management services for various industrial projects in Finland. The company offers administrative and consultancy, project management, occupational safety, quality assurance, information management, and resources and subcontracting services. It also develops individual digital solutions in the areas of mobile services, the Internet of Things, cloud services, and system integration assistance. The company was founded in 2005 and is headquartered in Pori, Finland.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "HEL", "market": "fi_market", "country": "Finland", "city": "Pori"}, "FRSI": {"short_name": "FIRST RATE STAFFING CORP", "long_name": "First Rate Staffing Corporation", "summary": "First Rate Staffing Corporation provides recruiting and staffing services for temporary positions in light industrial, distribution center, assembly, and clerical businesses in California, Arizona, and Nevada. The company also offers payroll services, state and federal taxation services, worker's compensation services, and work force screening and managing services. In addition, it conducts reference checks of employees; and offers risk management services. The company was formerly known as Moosewood Acquisition Corporation and changed its name to First Rate Staffing Corporation in May 2012. First Rate Staffing Corporation was incorporated in 2011 and is based in Phoenix, Arizona.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Phoenix"}, "FTRS": {"short_name": "FUTURIS CO", "long_name": "Mission Mining Company", "summary": "Mission Mining Company, a human capital management (HCM) company, focuses on the acquisition and operation of executive search, staffing, and consulting companies that specialize in professional service verticals, such as medical, accounting/finance, information technology, recruitment process outsourcing (RPO), and human resources. Futuris Co. is based in Sheridan, Wyoming.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Sheridan"}, "GATC.L": {"short_name": "GATTACA PLC ORD 1P", "long_name": "Gattaca plc", "summary": "Gattaca plc, a human capital resources company, provides contract and permanent recruitment services in the private and public sectors. The company operates through three segments: UK Engineering, UK Technology, and International. It offers flexible, permanent, and total workforce solutions; professional outsourced engineering and technology support solutions; and traditional staffing, market insight reporting, packaged campaign, recruitment process outsourcing, and employer branding agency services. The company provides its services for the infrastructure, defence, technology, media and telecoms, energy, life sciences, consumer and logistics, finance, banking and insurance, and mobility markets under the Matchtech, Networkers, Barclay Meade, Alderwood, Cappo, and Resourcing Solutions brands. It has operations in the United Kingdom, rest of Europe, the Middle East, Africa, the Americas, and the Asia Pacific. The company was formerly known as Matchtech Group plc and changed its name to Gattaca plc in September 2016. Gattaca plc was founded in 1984 and is headquartered in Fareham, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Fareham"}, "GXXM": {"short_name": "GEX MANAGEMENT INC", "long_name": "GEX Management, Inc.", "summary": "GEX Management, Inc. provides business services and consulting and staffing solutions to corporations. It offers payroll processing services, including tax filling and remittance, and quarterly payroll tax reporting; and staffing services comprising interview vetting, background check, drug screening, onboarding and termination guidance, and company operation troubleshooting. The company also provides human resources (HR) services, such as performance evaluation and discipline system, consulting on sensitive HR issues, paperwork audit, employee handbook, benefit plan administration, worker's compensation programs, and risk and compliance services; and general business consulting services that comprise strategic planning, mission statement and values discovery, goal sessions, and company operation troubleshooting. GEX Management, Inc. was founded in 2004 and is based in Grapevine, Texas.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Grapevine"}, "HAS.L": {"short_name": "HAYS PLC ORD 1P", "long_name": "Hays plc", "summary": "Hays plc operates as a recruitment company in Australia, New Zealand, Germany, the United Kingdom, Ireland, and internationally. The company offers permanent, temporary, and contractor recruitment services, such as qualified, professional, and skilled recruitment to public and private sector. It specializes in offering recruitment services in the areas of accountancy and finance, construction and property, information technology, life sciences, sales and marketing, banking and capital markets, contact centers, education, engineering and manufacturing, executive, financial services, health and social care, human resources, legal, office professionals, energy, oil and gas, procurement, retail, resources and mining, and telecoms. Hays plc was founded in 1968 and is based in London, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "HAY.F": {"short_name": "HAYS PLC  LS-,01", "long_name": "Hays plc", "summary": "Hays plc operates as a recruitment company in Australia, New Zealand, Germany, the United Kingdom, Ireland, and internationally. The company offers permanent, temporary, and contractor recruitment services, such as qualified, professional, and skilled recruitment to public and private sector. It specializes in offering recruitment services in the areas of accountancy and finance, construction and property, information technology, life sciences, sales and marketing, banking and capital markets, contact centers, education, engineering and manufacturing, executive, financial services, health and social care, human resources, legal, office professionals, energy, oil and gas, procurement, retail, resources and mining, and telecoms. Hays plc was founded in 1968 and is based in London, the United Kingdom.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "HAYPY": {"short_name": "HAYS PLC", "long_name": "Hays plc", "summary": "Hays plc operates as a recruitment company in Australia, New Zealand, Germany, the United Kingdom, Ireland, and internationally. The company offers permanent, temporary, and contractor recruitment services, such as qualified, professional, and skilled recruitment to public and private sector. It specializes in offering recruitment services in the areas of accountancy and finance, construction and property, information technology, life sciences, sales and marketing, banking and capital markets, contact centers, education, engineering and manufacturing, executive, financial services, health and social care, human resources, legal, office professionals, energy, oil and gas, procurement, retail, resources and mining, and telecoms. Hays plc was founded in 1968 and is based in London, the United Kingdom.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "HDH1.F": {"short_name": "HUDSON GLOBAL INC.DL-,001", "long_name": "Hudson Global, Inc.", "summary": "Hudson Global, Inc. provides talent solutions for mid-to-large-cap multinational companies and government agencies under the Hudson RPO brand in the Americas, the Asia Pacific, and Europe. It offers recruitment process outsourcing (RPO) services, such as complete recruitment outsourcing, project-based outsourcing, contingent workforce solutions, and recruitment consulting for clients' permanent staff hires; and RPO contracting services, including outsourced professional contract staffing and managed services. The company was formerly known as Hudson Highland Group, Inc. and changed its name to Hudson Global, Inc. in April 2012. Hudson Global, Inc. is headquartered in Old Greenwich, Connecticut.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Old Greenwich"}, "HEGR.ST": {"short_name": "Hedera Group AB", "long_name": "Hedera Group AB (publ)", "summary": "Hedera Group AB (publ), together with its subsidiaries, engages in the staffing and recruitment of doctors and nurses to primary cares, municipalities, and hospitals in Sweden. It offers consulting services. The company is based in Stockholm, Sweden. Hedera Group AB (publ) is a subsidiary of Bertil Haglund med bolag.", "currency": "SEK", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "STO", "market": "se_market", "country": "Sweden", "city": "Stockholm"}, "HHR": {"short_name": "HeadHunter Group PLC", "long_name": "HeadHunter Group PLC", "summary": "HeadHunter Group PLC operates an online recruitment platform in Russia, Kazakhstan, Belarus, Baltic countries, and internationally. It offers employers and recruiters paid access to its curriculum vitae database and job postings platform; and job seekers and employers with a range of value added services. The company provides its services for businesses that are looking for job seekers to fill vacancies inside their organizations. The company was formerly known as Zemenik Trading Limited and changed its name to HeadHunter Group PLC in March 2018. HeadHunter Group PLC was founded in 2000 and is headquartered in Moscow, Russia.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NMS", "market": "us_market", "country": "Russia", "city": "Moscow"}, "HHRU.ME": {"short_name": "HEADHUNTER GROUP P", "long_name": "HeadHunter Group PLC", "summary": "HeadHunter Group PLC operates an online recruitment platform in Russia, Kazakhstan, Belarus, Baltic countries, and internationally. It offers employers and recruiters paid access to its curriculum vitae database and job postings platform; and job seekers and employers with a range of value added services. The company provides its services for businesses that are looking for job seekers to fill vacancies inside their organizations. The company was formerly known as Zemenik Trading Limited and changed its name to HeadHunter Group PLC in March 2018. HeadHunter Group PLC was founded in 2000 and is headquartered in Moscow, Russia.", "currency": "RUB", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "MCX", "market": "ru_market", "country": "Russia", "city": "Moscow"}, "HIRE.V": {"short_name": "HIRE TECHNOLOGIES INC", "long_name": "Hire Technologies Inc.", "summary": "Hire Technologies Inc., through its subsidiaries, provides human resources services in Canada. The company offers temporary and permanent placement services. It also acquires information technology, staffing, and HR consulting firms. In addition, the company cross-selling opportunities, access to proprietary operational tools, and centralized back-office system. Hire Technologies Inc. was incorporated in 2018 and is based in Toronto, Canada.", "currency": "CAD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "HQI": {"short_name": "HireQuest, Inc.", "long_name": "HireQuest, Inc.", "summary": "HireQuest, Inc. provides on-demand and temporary staffing solutions in the United States. The company provides temporary staffing services, including skilled and semi-skilled labour and industrial personnel, clerical and administrative personnel, and construction personnel. As of December 31, 2019, the company had 147 franchisee-owned offices in 32 states and the District of Columbia. It serves small businesses and large corporate enterprises in the manufacturing, warehousing, construction, disaster recovery, hospitality, recycling, logistics, auctioneering, landscaping, and retail industries. The company was formerly known as Command Center, Inc. and changed its name to HireQuest, Inc. in September 2019. HireQuest, Inc. was founded in 2002 and is headquartered in Goose Creek, South Carolina.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NCM", "market": "us_market", "country": "United States", "city": "Goose Creek"}, "HSI.F": {"short_name": "HEIDRICK+STRUG.INTL DL-01", "long_name": "Heidrick & Struggles International, Inc.", "summary": "Heidrick & Struggles International, Inc., together with its subsidiaries, provides executive search and consulting services to businesses and business leaders worldwide. The company enables its clients to build leadership teams by facilitating the recruitment, management, and development of senior executives. It also offers consulting services, including leadership assessment, leadership, team and board development, succession planning, talent strategy, people performance, inter-team collaboration, culture shaping, and organizational transformation. The company provides its services to Fortune 1000 companies; Major U.S. and non-U.S. companies; middle market and emerging growth companies; governmental, higher education, and not-for-profit organizations; and other private and public entities. It serves range of clients through approximately 450 consultants. Heidrick & Struggles International, Inc. was founded in 1953 and is headquartered in Chicago, Illinois.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Chicago"}, "HSII": {"short_name": "Heidrick & Struggles Internatio", "long_name": "Heidrick & Struggles International, Inc.", "summary": "Heidrick & Struggles International, Inc., together with its subsidiaries, provides executive search and consulting services to businesses and business leaders worldwide. The company enables its clients to build leadership teams by facilitating the recruitment, management, and development of senior executives. It also offers consulting services, including leadership assessment, leadership, team and board development, succession planning, talent strategy, people performance, inter-team collaboration, culture shaping, and organizational transformation. The company provides its services to Fortune 1000 companies; Major U.S. and non-U.S. companies; middle market and emerging growth companies; governmental, higher education, and not-for-profit organizations; and other private and public entities. It serves range of clients through approximately 450 consultants. Heidrick & Struggles International, Inc. was founded in 1953 and is headquartered in Chicago, Illinois.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Chicago"}, "HSON": {"short_name": "Hudson Global, Inc.", "long_name": "Hudson Global, Inc.", "summary": "Hudson Global, Inc. provides talent solutions for mid-to-large-cap multinational companies and government agencies under the Hudson RPO brand in the Americas, the Asia Pacific, and Europe. It offers recruitment process outsourcing (RPO) services, such as complete recruitment outsourcing, project-based outsourcing, contingent workforce solutions, and recruitment consulting for clients' permanent staff hires; and RPO contracting services, including outsourced professional contract staffing and managed services. The company was formerly known as Hudson Highland Group, Inc. and changed its name to Hudson Global, Inc. in April 2012. Hudson Global, Inc. is headquartered in Old Greenwich, Connecticut.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Old Greenwich"}, "IDEAS.IS": {"short_name": "IDEALIST DANISMANLIK", "long_name": "Idealist Danismanlik A.S.", "summary": "Idealist Danismanlik A.S. operates as a management consulting company in Turkey. The company provides consultancy services in the fields of organizational development and human resources. It also offers competency development, management development, leadership development, change and loyalty, sales management, and smart management development solutions. In addition, the company organizes summits on human resources and marketing activities. It serves the finance, pharmaceutical, fast moving consumer goods, telecommunications, and holding and other sectors. The company was formerly known as MCT Danismanlik A.S. Idealist Danismanlik A.S. was founded in 1992 and is based in Istanbul, Turkey.", "currency": "TRY", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "IST", "market": "tr_market", "country": "Turkey", "city": "Istanbul"}, "IGN.AX": {"short_name": "IGNITE FPO", "long_name": "Ignite Limited", "summary": "Ignite Limited, together with its subsidiaries, provides specialist recruitment, on-demand information technology, and people services in Australia and New Zealand. The company offers permanent and contingent labour recruitment, and payroll services; and outsourced recruitment and human resource consulting services. It is also involved in the provision of pre-qualified information technology resources to deliver on demand solutions. The company provides its services under the Ignite and Lloyd Morgan brand names. It serves accounting, finance, architecture, construction, engineering, property, business support, human resources, legal, information management, IT, digital, and sales and marketing industries. The company was formerly known as Clarius Group Limited. Ignite Limited was founded in 1984 and is headquartered in Sydney, Australia.", "currency": "AUD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "IPDN": {"short_name": "Professional Diversity Network,", "long_name": "Professional Diversity Network, Inc.", "summary": "Professional Diversity Network, Inc. operates online professional networking communities with career resources in the United States. It operates in two segments, Professional Diversity Network (PDN Network) and National Association of Professional Women (NAPW Network). The PDN Network segment offers single and multiple job postings, recruitment media, talent recruitment communities, corporate memberships, hiring campaign marketing and advertising, e-newsletter marketing, and research and outreach services to various cultural groups and employers. It also provides consumer advertising and consumer marketing solutions through advertising and job postings on its Websites. The NAPW Network segment operates a women-only professional networking organization. As of December 31, 2019, the company had approximately 10.8 million registered users in the PDN Network and approximately 949,000 registered users or members in the NAPW Network. It has a partnership agreement with Phala Network to develop privacy-protecting blockchain application. Professional Diversity Network, Inc. was founded in 2003 and is headquartered in Chicago, Illinois.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NCM", "market": "us_market", "country": "United States", "city": "Chicago"}, "IPEL.L": {"short_name": "IMPELLAM GROUP PLC ORD 1P", "long_name": "Impellam Group PLC", "summary": "Impellam Group Plc provides staffing, human capital management, and outsourced people-related services in the United Kingdom, Ireland, North America, mainland Europe, Australasia, New Zealand, Singapore, and the Middle East. It operates through Global Talent Acquisition and Managed Workforce Solutions; Global Specialist Staffing; Regional Specialist Staffing; and Healthcare segments. The Global Talent Acquisition and Managed Workforce Solutions segment offers managed service programs, professional services solution, recruitment outsourcing programmes (RPO), contingent RPO, and direct sourcing models and adaptive services under the Comensura and Guidant Global brand names. The Global Specialist Staffing segment provides specialist staffing services to recruit scientific, clinical, technology, telecommunications, and digital specialists under the Lorien, onezeero, s.com, and SRG brand names. The Regional Specialist Staffing segment offers staffing services for technicians, secretaries, call center operatives, mechanical and product engineers, IT specialists, lawyers, teachers, aviation, and chefs under the Blue Arrow, Tate, Carbon60, Celsian, Career Teachers, Flexy, Chadwick Nott, Bartech Staffing, and Corestaf brands. The Healthcare segment provides healthcare workforce solutions, including healthcare staffing, managed services, staff bank, occupational health, social care, and home care services, as well as eHealth solutions under the Medacs Healthcare, Global Medics, Doctors on Call, Fast Response Healthcare, Litmus Workforce Solutions, and ignosys brand names. This segment also recruits temporary and permanent doctors, nurses and, allied health professionals. The company was incorporated in 2008 and is based in Luton, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Luton"}, "IWQ.F": {"short_name": "51JOB INC.  ADR", "long_name": "51job, Inc.", "summary": "51job, Inc., through its subsidiaries, provides integrated human resource services in the People's Republic of China. The company offers online recruitment services through its Websites comprising 51job.com, yingjiesheng.com, 51jingying.com, lagou.com, and 51mdd.com; and mobile applications that enable job seekers to access their accounts through mobile devices and utilize functions available on their Websites. It also provides other human resource related services, such as business process outsourcing that consist of social insurance, benefits, and payroll processing, as well as compliance services with local governmental employment regulations; and conducts training seminars in the business management, leadership, sales and marketing, human resource, negotiation skills, financial planning and analysis, public administration, manufacturing, secretarial, and other skills. In addition, the company offers campus recruitment services to corporations that seek to recruit college and university students; and placement and executive search services to employers seeking to attract talent and fill job vacancies. Further, it provides professional and scientific assessment tools that assist human resource departments in evaluating capabilities and dispositions of job candidates and existing employees, as well as offers talent assessment services; conducts general and customized surveys on salary, employee retention, and other human resource related topics; organizes and hosts annual human resource conferences and events; and provides support and administrative services to employers on select recruitment projects. The company serves multinational corporations, large national Chinese corporations, and the local Chinese enterprises. It offers its services through sales offices, and a national sales and customer service call center in Wuhan. 51job, Inc. was founded in 1998 and is headquartered in Shanghai, the People's Republic of China.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "China", "city": "Shanghai"}, "JOB": {"short_name": "GEE Group Inc.", "long_name": "GEE Group, Inc.", "summary": "GEE Group, Inc. provides permanent and temporary professional, industrial, and physician assistant staffing and placement services in the United States. It operates in two segments, Industrial Staffing Services and Professional Staffing Services. The company offers professional placement services comprising placement of information technology, engineering, medical, and accounting professionals on regular placement basis or a temporary contract basis; and temporary staffing services for light industrial clients. The company provides medical data entry assistants, who offer electronic medical record services for emergency departments, specialty physician practices, and clinics. It offers professional and commercial staffing services under the names of Access Data Consulting, Agile Resources, Ashley Ellis, General Employment, Omni-One, Paladin Consulting, and Triad; medical staffing services under the Scribe Solutions brand; and contract and direct hire professional staffing services under the Accounting Now, SNI Technology, Legal Now, SNI Financial, Staffing Now, SNI Energy, and SNI Certes brands. The company was formerly known as General Employment Enterprises, Inc. and changed its name to GEE Group, Inc. in July 2016. GEE Group, Inc. was founded in 1893 and is headquartered in Jacksonville, Florida.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Jacksonville"}, "JOBNDX.CO": {"short_name": "Jobindex A/S", "long_name": "Jobindex A/S", "summary": "Jobindex A/S operates as a recruitment company in Denmark. It operates a job search engine that searches through job advertisement from approximately 500 job databases and sites, including Jobnet. The company also provides job advertisement, recruitment, and branding solutions. The company was founded in 1996 and is based in Frederiksberg, Denmark. Jobindex A/S is a subsidiary of Danielsen.Com ApS.", "currency": "DKK", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "CPH", "market": "dk_market", "country": "Denmark", "city": "Frederiksberg"}, "JOBS": {"short_name": "51job, Inc.", "long_name": "51job, Inc.", "summary": "51job, Inc., through its subsidiaries, provides integrated human resource services in the People's Republic of China. The company offers online recruitment services through its Websites comprising 51job.com, yingjiesheng.com, 51jingying.com, lagou.com, and 51mdd.com; and mobile applications that enable job seekers to access their accounts through mobile devices and utilize functions available on their Websites. It also provides other human resource related services, such as business process outsourcing that consist of social insurance, benefits, and payroll processing, as well as compliance services with local governmental employment regulations; and conducts training seminars in the business management, leadership, sales and marketing, human resource, negotiation skills, financial planning and analysis, public administration, manufacturing, secretarial, and other skills. In addition, the company offers campus recruitment services to corporations that seek to recruit college and university students; and placement and executive search services to employers seeking to attract talent and fill job vacancies. Further, it provides professional and scientific assessment tools that assist human resource departments in evaluating capabilities and dispositions of job candidates and existing employees, as well as offers talent assessment services; conducts general and customized surveys on salary, employee retention, and other human resource related topics; organizes and hosts annual human resource conferences and events; and provides support and administrative services to employers on select recruitment projects. The company serves multinational corporations, large national Chinese corporations, and the local Chinese enterprises. It offers its services through sales offices, and a national sales and customer service call center in Wuhan. 51job, Inc. was founded in 1998 and is headquartered in Shanghai, the People's Republic of China.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NMS", "market": "us_market", "country": "China", "city": "Shanghai"}, "KELYA": {"short_name": "Kelly Services, Inc.", "long_name": "Kelly Services, Inc.", "summary": "Kelly Services, Inc., together with its subsidiaries, provides workforce solutions to various industries worldwide. The company operates through three segments: Americas Staffing, Global Talent Solutions, and International Staffing. It provides trained employees for data entry, clerical, and administrative support roles across various industries; schools with instructional and non-instructional employees; support staff for seminars, sales, and trade shows; assemblers, quality control inspectors, and technicians for electronic assembly; maintenance workers, material handlers, and assemblers for light industrial works; scientists, and scientific and clinical research workforce solutions; engineering professionals across various disciplines, including 5G, aeronautical, chemical, civil/structural, electrical/instrumentation, environmental, industrial, mechanical, petroleum, pharmaceutical, quality, and telecommunications. The company also provides temporary staffing and direct-hire placement services across various disciplines, such as corporate finance departments, accounting firms, and financial institutions with various levels of financial professionals, as well as places creative talent in the spectrum of creative services positions. In addition, it provides chefs, porters, and hospitality representatives; and manual workers and semi-skilled professionals in various trade, non-trade, and operational positions. Further, the company provides centrally delivered staffing for large accounts; contingent workforce outsourcing, recruitment process outsourcing, business process outsourcing, and payroll process outsourcing services; contact center staffing solutions; and executive placement, career transition/outplacement, and talent advisory services. Kelly Services, Inc. was founded in 1946 and is headquartered in Troy, Michigan.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Troy"}, "KELYB": {"short_name": "Kelly Services, Inc.", "long_name": "Kelly Services, Inc.", "summary": "Kelly Services, Inc., together with its subsidiaries, provides workforce solutions to various industries worldwide. The company operates through three segments: Americas Staffing, Global Talent Solutions, and International Staffing. It provides trained employees for data entry, clerical, and administrative support roles across various industries; schools with instructional and non-instructional employees; support staff for seminars, sales, and trade shows; assemblers, quality control inspectors, and technicians for electronic assembly; maintenance workers, material handlers, and assemblers for light industrial works; scientists, and scientific and clinical research workforce solutions; engineering professionals across various disciplines, including 5G, aeronautical, chemical, civil/structural, electrical/instrumentation, environmental, industrial, mechanical, petroleum, pharmaceutical, quality, and telecommunications. The company also provides temporary staffing and direct-hire placement services across various disciplines, such as corporate finance departments, accounting firms, and financial institutions with various levels of financial professionals, as well as places creative talent in the spectrum of creative services positions. In addition, it provides chefs, porters, and hospitality representatives; and manual workers and semi-skilled professionals in various trade, non-trade, and operational positions. Further, the company provides centrally delivered staffing for large accounts; contingent workforce outsourcing, recruitment process outsourcing, business process outsourcing, and payroll process outsourcing services; contact center staffing solutions; and executive placement, career transition/outplacement, and talent advisory services. Kelly Services, Inc. was founded in 1946 and is headquartered in Troy, Michigan.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Troy"}, "KFRC": {"short_name": "Kforce, Inc.", "long_name": "Kforce Inc.", "summary": "Kforce Inc. provides professional staffing services and solutions in the United States and internationally. It operates through Technology (Tech) and Finance and Accounting (FA) segments. The Tech segment provides temporary staffing and permanent placement services to its clients primarily in the areas of information technology, such as systems/applications architecture and development, business and artificial intelligence, machine learning, network architecture, security, enterprise data, and project management. This segment serves clients in various industries comprising financial and business services, communications, and technology industries. The FA segment offers temporary staffing and permanent placement services to its clients in areas, including general accounting, business and cost analysis, financial analysis and reporting, taxation, budgeting, loan servicing, professional administration, audit services, and systems and controls analysis and documentation. This segment also provides transactional services, which include accounts payable and receivable, billing, payroll, credit and collections, and cash application; decision making services; and operational and technical services. This segment serves clients in various industries, including financial services, healthcare, and manufacturing sectors. Kforce Inc. was founded in 1962 and is headquartered in Tampa, Florida.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Tampa"}, "KFY": {"short_name": "Korn Ferry", "long_name": "Korn Ferry", "summary": "Korn Ferry, together with its subsidiaries, provides organizational consulting services worldwide. It operates through four segments: Consulting, Digital, Executive Search, and RPO (Recruitment Process Outsourcing) & Professional Search. The company provides executive search services to fill executive-level positions, such as board directors, chief executive officers, chief financial officers, chief operating officers, chief information officers, chief human resource officers, and other senior executive officers for clients in the industrial, financial services, life sciences/healthcare provider, consumer, technology, and educational/not-for-profit market sectors. It also offers organizational strategy, assessment and succession, and leadership development, as well as rewards and benefits to assist clients. In addition, the company provides RPO, project recruitment, and individual professional search and outsource recruiting solutions. It serves public and private companies, and middle market and emerging growth companies, as well as government and non-profit organizations. The company was formerly known as Korn/Ferry International and changed its name to Korn Ferry in January 2019. Korn Ferry was founded in 1969 and is based in Los Angeles, California.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Los Angeles"}, "KFY.F": {"short_name": "KORN FERRY  DL -,01", "long_name": "Korn Ferry", "summary": "Korn Ferry, together with its subsidiaries, provides organizational consulting services worldwide. It operates through four segments: Consulting, Digital, Executive Search, and RPO (Recruitment Process Outsourcing) & Professional Search. The company provides executive search services to fill executive-level positions, such as board directors, chief executive officers, chief financial officers, chief operating officers, chief information officers, chief human resource officers, and other senior executive officers for clients in the industrial, financial services, life sciences/healthcare provider, consumer, technology, and educational/not-for-profit market sectors. It also offers organizational strategy, assessment and succession, and leadership development, as well as rewards and benefits to assist clients. In addition, the company provides RPO, project recruitment, and individual professional search and outsource recruiting solutions. It serves public and private companies, and middle market and emerging growth companies, as well as government and non-profit organizations. The company was formerly known as Korn/Ferry International and changed its name to Korn Ferry in January 2019. Korn Ferry was founded in 1969 and is based in Los Angeles, California.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Los Angeles"}, "KYSA.F": {"short_name": "KELLY SERVS INC. A DL 1", "long_name": "Kelly Services, Inc.", "summary": "Kelly Services, Inc., together with its subsidiaries, provides workforce solutions to various industries worldwide. The company operates through three segments: Americas Staffing, Global Talent Solutions, and International Staffing. It provides trained employees for data entry, clerical, and administrative support roles across various industries; schools with instructional and non-instructional employees; support staff for seminars, sales, and trade shows; assemblers, quality control inspectors, and technicians for electronic assembly; maintenance workers, material handlers, and assemblers for light industrial works; scientists, and scientific and clinical research workforce solutions; engineering professionals across various disciplines, including 5G, aeronautical, chemical, civil/structural, electrical/instrumentation, environmental, industrial, mechanical, petroleum, pharmaceutical, quality, and telecommunications. The company also provides temporary staffing and direct-hire placement services across various disciplines, such as corporate finance departments, accounting firms, and financial institutions with various levels of financial professionals, as well as places creative talent in the spectrum of creative services positions. In addition, it provides chefs, porters, and hospitality representatives; and manual workers and semi-skilled professionals in various trade, non-trade, and operational positions. Further, the company provides centrally delivered staffing for large accounts; contingent workforce outsourcing, recruitment process outsourcing, business process outsourcing, and payroll process outsourcing services; contact center staffing solutions; and executive placement, career transition/outplacement, and talent advisory services. Kelly Services, Inc. was founded in 1946 and is headquartered in Troy, Michigan.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Troy"}, "LRY.F": {"short_name": "TRUEBLUE INC.", "long_name": "TrueBlue, Inc.", "summary": "TrueBlue, Inc., together with its subsidiaries, provides specialized workforce solutions in the United States, Canada, and Puerto Rico. It operates through three segments: PeopleReady, PeopleManagement, and PeopleScout. The PeopleReady segment offers a range of contingent staffing solutions for blue-collar, on-demand, and skilled labor in construction, manufacturing and logistics, warehousing and distribution, waste and recycling, energy, retail, hospitality, general labor, and other industries. The PeopleManagement segment provides contingent labor and outsourced industrial workforce solutions. It offers on-site management and recruitment for the contingent industrial workforce of manufacturing, warehouse, and distribution facilities; and recruitment and management of contingent and dedicated commercial drivers to the transportation and distribution industries under the Staff Management, SIMOS Insourcing Solutions, and Centerline Drivers brands. The PeopleScout segment offers permanent employee recruitment process outsourcing services; and manages clients' contingent labor programs comprising vendor selection, performance management, compliance monitoring, and risk management. The company was formerly known as Labor Ready, Inc. and changed its name to TrueBlue, Inc. in December 2007. TrueBlue, Inc. was incorporated in 1985 and is headquartered in Tacoma, Washington.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Tacoma"}, "LTNC": {"short_name": "LABOR SMART INC", "long_name": "Labor Smart, Inc.", "summary": "Labor Smart, Inc. provides temporary blue-collar staffing services primarily in the United States. The company supplies general laborers on demand to the light industries, including manufacturing, logistics, and warehousing; and skilled trades' people and general laborers to commercial construction industries. It serves customers primarily engaged in construction, freight handling, landscaping, warehousing, janitorial, disaster response, light manufacturing, retail, or wholesale operations. The company was founded in 2011 and is based in Powder Springs, Georgia.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Powder Springs"}, "LVH.AX": {"short_name": "LIVEHIRE FPO", "long_name": "LiveHire Limited", "summary": "LiveHire Limited provides online talent acquisition software solutions to enterprises in Australia. It operates LiveHire, a talent acquisition and engagement platform for recruitment process, such as sourcing, engaging, hiring, analyzing, and integrating, as well as for internal mobility and outplacement. The company was founded in 2011 and is based in Melbourne, Australia.", "currency": "AUD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "MAN": {"short_name": "ManpowerGroup", "long_name": "ManpowerGroup Inc.", "summary": "ManpowerGroup Inc. provides workforce solutions and services in the Americas, Southern Europe, Northern Europe, and the Asia Pacific Middle East region. The company offers recruitment services, including permanent, temporary, and contract recruitment of professionals, as well as administrative and industrial positions under the Manpower and Experis brands. It also offers various assessment services; training and development services; career management; and outsourcing services related to human resources functions primarily in the areas of large-scale recruiting and workforce-intensive initiatives. In addition, the company provides workforce consulting services; contingent staffing and permanent recruitment services; professional resourcing and project-based solutions in information technology, engineering, and finance fields; solutions in the areas of organizational efficiency, individual development, and career mobility; and recruitment process outsourcing, TAPFIN managed, and talent based outsourcing services, as well as Proservia services in the areas of digital services market and IT infrastructure sector. It operates through a network of approximately 2,500 offices in 75 countries and territories. The company was founded in 1948 and is headquartered in Milwaukee, Wisconsin.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Milwaukee"}, "MCTH": {"short_name": "MEDICAL CONNECTIONS HOLDINGS IN", "long_name": "Medical Connections Holdings, Inc.", "summary": "Medical Connections Holdings, Inc., through its subsidiary, Medical Connections, Inc., a healthcare staffing company, provides staffing services for allied professionals and nurses in the United States. The company offers recruiting and staffing services for permanent and temporary positions, with an option for the clients and candidates to choose the working arrangements. It serves hospitals and other healthcare facilities, such as physician practice groups, skilled nursing facilities, nursing homes, and sports medicine clinics with a range of staffing specialties that include various allied health professionals comprising rehabilitation therapists, speech language therapists, respiratory therapists, and radiation therapy technicians and nurses. The company was founded in 2002 and is headquartered in Boca Raton, Florida.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Boca Raton"}, "MHH": {"short_name": "Mastech Digital, Inc", "long_name": "Mastech Digital, Inc.", "summary": "Mastech Digital, Inc. provides digital transformation IT services to large, medium-sized, and small companies in the United States. It operates through two segments, Data and Analytics Services, and IT Staffing Services. The company offers data management and analytics services, including project-based consulting services in the areas of master data management, enterprise data integration, big data and analytics, and digital transformation by using onsite and offshore resources. It also provides a range of IT staffing services in the areas of data management and analytics, cloud, mobility, social, automation, business intelligence/data warehousing, web services, enterprise resource planning and customer resource management, and e-business solutions. In addition, the company offers digital transformation services through Salesforce.com and digital learning methods. It provides its services across various industry verticals, including financial services, government, healthcare, manufacturing, retail, technology, telecommunications, and transportation. The company was formerly known as Mastech Holdings, Inc. and changed its name to Mastech Digital, Inc. in September 2016. Mastech Digital, Inc. was founded in 1986 and is headquartered in Pittsburgh, Pennsylvania.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Pittsburgh"}, "MJ1.MU": {"short_name": "MEITEC CORP.", "long_name": "Meitec Corporation", "summary": "Meitec Corporation provides dispatch engineering solutions to manufacturing companies in Japan. It offers engineering solutions, including mechanical design, electrical/electronic design, software development, chemical engineering, and analysis/evaluation. The company was formerly known as Nagoya Technical Center Co., Ltd. and changed its name to Meitec Corporation in 1985. Meitec Corporation was founded in 1974 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "MUN", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "MLGEL.PA": {"short_name": "D2L GROUP", "long_name": "Gel Groupe SA", "summary": "Gel Groupe SA offers recruitment and staffing services for the logistics sector. The company was founded in 2009 and is based in Saint Andre De Corcy, France.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Saint Andre De Corcy"}, "MLUMG.PA": {"short_name": "UMALIS GROUP", "long_name": "Umalis Group", "summary": "Umalis Group provides wage portage services for consultants working in the various fields of IT sector and new technologies in France and internationally. The company was founded in 2008 and is based in Paris, France.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Paris"}, "MMS.AX": {"short_name": "MCMILLAN FPO", "long_name": "McMillan Shakespeare Limited", "summary": "McMillan Shakespeare Limited provides salary packaging, novated leasing, disability plan management, asset management, and related financial products and services in Australia, the United Kingdom, and New Zealand. It operates through three segments: Group Remuneration Services, Asset Management, and Retail Financial Services. The Group Remuneration Services segment offers employee benefits administration services for salary packaging and ancillary services, including novated leasing asset and finance procurement, motor vehicle administration, and other services. The Asset Management segment provides financing and ancillary management services related with motor vehicles, commercial vehicles, and equipment. The Retail Financial Services segment offers retail brokerage services; and engages in the aggregation of finance originations and extended warranty cover. The company also provides fleet management and software development services. It serves federal and state governments, health groups, not-for-profit organizations, and private corporations. The company was founded in 1988 and is headquartered in Melbourne, Australia.", "currency": "AUD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "MNTR.OL": {"short_name": "MINTRA HOLDING AS", "long_name": "Mintra Holding AS", "summary": "Mintra Holding AS, through its subsidiaries, provides workforce management systems worldwide. It delivers services covering human resources (HR), competence management, and training to customers in various business environments. The company offers OCS HR, a suite of software covering HR, crewing, and payroll needs of shipping and offshore companies; OCS HR Self-Service solution that connects employees directly to the HR-system; OCS HR Payroll, which enables payroll processes and handles various currencies and payrolls; OCS HR Crew On Board, a tool that enables personnel on board vessels and installations to manage its crew and crew related data with synchronization to onshore systems; and TRAININGPORTAL, a learning management system. It also provides Publisher, a web-based solution to develop, edit, and publish high quality interactive e-Learning content; Lesson Learned, a platform for sharing learned lessons from unwanted incidents across industries; and Virtual Classrooms with training portal. In addition, the company offers payroll outsourcing services; and OCS and TRAININGPORTAL consultancy, OCS HR course, competence management, content production, and support services. Further, it offers online courses for maritime, oil and gas, construction, and renewable energy industries; international minimum industry safety training standard online courses; and standards of training, certification, and watchkeeping online courses. The company is based in Bergen, Norway.", "currency": "NOK", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "OSL", "market": "no_market", "country": "Norway", "city": "Bergen"}, "MNZ.F": {"short_name": "GATTACA PLC  LS -,01", "long_name": "Gattaca plc", "summary": "Gattaca plc, a human capital resources company, provides contract and permanent recruitment services in the private and public sectors. The company operates through three segments: UK Engineering, UK Technology, and International. It offers flexible, permanent, and total workforce solutions; professional outsourced engineering and technology support solutions; and traditional staffing, market insight reporting, packaged campaign, recruitment process outsourcing, and employer branding agency services. The company provides its services for the infrastructure, defence, technology, media and telecoms, energy, life sciences, consumer and logistics, finance, banking and insurance, and mobility markets under the Matchtech, Networkers, Barclay Meade, Alderwood, Cappo, and Resourcing Solutions brands. It has operations in the United Kingdom, rest of Europe, the Middle East, Africa, the Americas, and the Asia Pacific. The company was formerly known as Matchtech Group plc and changed its name to Gattaca plc in September 2016. Gattaca plc was founded in 1984 and is headquartered in Fareham, the United Kingdom.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Fareham"}, "MORE.AS": {"short_name": "MOREFIELD GROUP", "long_name": "Morefield Group N.V.", "summary": "Morefield Group N.V. does not have significant operations. Previously, it was involved in the external professionals hiring activities. The company was formerly known as HeadFirst Source Group N.V. and changed its name to Morefield Group N.V. in January 2019. The company was founded in 1999 and is based in Willemstad, CuraÃ§ao.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "AMS", "market": "nl_market", "country": "Netherlands Antilles", "city": "Willemstad"}, "MPGPF": {"short_name": "PAGEGROUP PLC", "long_name": "PageGroup plc", "summary": "PageGroup plc, together with its subsidiaries, provides recruitment consultancy and support services. The company offers executive search services; recruitment services for qualified professional on permanent, temporary, and contract or interim basis; recruitment services to organizations requiring permanent employees and temporary or contract staff at technical and administrative support, professional clerical, and junior management levels; and flexible recruitment outsourcing services under the Page Executive, Michael Page, Page Personnel, and Page Outsourcing primary brands. It also provides assessment, consulting, and talent services under the Page Assessment, Page Consulting, and Page Talent supplementary brands. The company operates in the United Kingdom, rest of Europe, the Middle East, Africa, the Asia Pacific, and the Americas. The company was formerly known as Michael Page International plc and changed its name to PageGroup plc in June 2016. PageGroup plc was founded in 1976 and is based in Addlestone, the United Kingdom.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Addlestone"}, "MPW.F": {"short_name": "MANPOWERGROUP INC. DL-,01", "long_name": "ManpowerGroup Inc.", "summary": "ManpowerGroup Inc. provides workforce solutions and services in the Americas, Southern Europe, Northern Europe, and the Asia Pacific Middle East region. The company offers recruitment services, including permanent, temporary, and contract recruitment of professionals, as well as administrative and industrial positions under the Manpower and Experis brands. It also offers various assessment services; training and development services; career management; and outsourcing services related to human resources functions primarily in the areas of large-scale recruiting and workforce-intensive initiatives. In addition, the company provides workforce consulting services; contingent staffing and permanent recruitment services; professional resourcing and project-based solutions in information technology, engineering, and finance fields; solutions in the areas of organizational efficiency, individual development, and career mobility; and recruitment process outsourcing, TAPFIN managed, and talent based outsourcing services, as well as Proservia services in the areas of digital services market and IT infrastructure sector. It operates through a network of approximately 2,500 offices in 75 countries and territories. The company was founded in 1948 and is headquartered in Milwaukee, Wisconsin.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Milwaukee"}, "MSI.TO": {"short_name": "MORNEAU SHEPELL INC.", "long_name": "Morneau Shepell Inc.", "summary": "Morneau Shepell Inc. operates as a human resources (HR) consulting and technology company in Canada, the United States, and internationally. The company provides health and productivity, administrative, and retirement solutions to assist employers in managing the financial security, health, and productivity of their employees. It offers health and productivity services, including absence and disability management, Internet-based cognitive behavioral therapy, safety groups, health and benefits consulting, and workers' compensation services; and administrative solutions, such as defined benefit and contribution pension administration, employee self-service, health and benefits administration, and human resources contact centers, as well as pension and benefits software. The company also provides modern employee assistance, wellness, news feed and recognition, perks and savings, workplace learning, total health index assessment, workplace mental health, children's support, traumatic event support, targeted health program, domestic and international student support, and HR support solutions. In addition, it offers retirement solutions comprising actuarial; compensation consulting; defined contribution consulting; international pension regulatory; investment consulting; governance, legal, and compliance; pension sustainability and design; pension regulatory; pooled registered pension plans and voluntary retirement savings plans; and retirement planning and total plan solutions. Further, the company provides asset and risk management, and communication and change management solutions. Additionally, it develops and implements customized investment strategies for pension funds, high-net-worth individuals, endowments, and others. It serves corporations, not-for-profit organizations and government organizations and institutions. The company was formerly known as Morneau Sobeco Income Fund and changed its name to Morneau Shepell Inc. in January 2011. Morneau Shepell Inc. was founded in 1962 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "N0D.MU": {"short_name": "MINTRA HOLDING AS NK -,03", "long_name": "Mintra Holding AS", "summary": "Mintra Holding AS, through its subsidiaries, provides workforce management systems worldwide. It delivers services covering human resources (HR), competence management, and training to customers in various business environments. The company offers OCS HR, a suite of software covering HR, crewing, and payroll needs of shipping and offshore companies; OCS HR Self-Service solution that connects employees directly to the HR-system; OCS HR Payroll, which enables payroll processes and handles various currencies and payrolls; OCS HR Crew On Board, a tool that enables personnel on board vessels and installations to manage its crew and crew related data with synchronization to onshore systems; and TRAININGPORTAL, a learning management system. It also provides Publisher, a web-based solution to develop, edit, and publish high quality interactive e-Learning content; Lesson Learned, a platform for sharing learned lessons from unwanted incidents across industries; and Virtual Classrooms with training portal. In addition, the company offers payroll outsourcing services; and OCS and TRAININGPORTAL consultancy, OCS HR course, competence management, content production, and support services. Further, it offers online courses for maritime, oil and gas, construction, and renewable energy industries; international minimum industry safety training standard online courses; and standards of training, certification, and watchkeeping online courses. The company is based in Bergen, Norway.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "MUN", "market": "dr_market", "country": "Norway", "city": "Bergen"}, "NBB.L": {"short_name": "NORMAN BROADBENT PLC ORD 1P", "long_name": "Norman Broadbent plc", "summary": "Norman Broadbent plc, together with its subsidiaries, provides professional services in the United Kingdom and internationally. The company offers a portfolio of integrated leadership acquisition and advisory services, including board and leadership search, senior interim management, research and insight, leadership consulting and assessment, mezzanine level search, and coaching and talent management, as well as executive level talent solutions. Norman Broadbent plc was incorporated in 1936 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "NGS.ST": {"short_name": "NGS Group AB", "long_name": "NGS Group AB (publ)", "summary": "NGS Group AB (publ) provides recruitment and staffing services in the healthcare, school, social services, and finance areas in Sweden, Norway, and Finland. The company is based in Stockholm, Sweden.", "currency": "SEK", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "STO", "market": "se_market", "country": "Sweden", "city": "Stockholm"}, "NJOB.ST": {"short_name": "NetJobs Group AB", "long_name": "NetJobs Group AB (publ)", "summary": "NetJobs Group AB (publ) provides specific career sites. It owns and operates 42 job sites in Sweden, Germany, Norway, Finland, and Denmark. The company was formerly known as Svensk Internetrekrytering AB and changed its name to NetJobs Group AB (publ) in March 2011. NetJobs Group AB (publ) was founded in 2004 and is based in Stockholm, Sweden.", "currency": "SEK", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "STO", "market": "se_market", "country": "Sweden", "city": "Stockholm"}, "NMN.F": {"short_name": "MCMILLAN SHAKESPEARE LTD", "long_name": "McMillan Shakespeare Limited", "summary": "McMillan Shakespeare Limited provides salary packaging, novated leasing, disability plan management, asset management, and related financial products and services in Australia, the United Kingdom, and New Zealand. It operates through three segments: Group Remuneration Services, Asset Management, and Retail Financial Services. The Group Remuneration Services segment offers employee benefits administration services for salary packaging and ancillary services, including novated leasing asset and finance procurement, motor vehicle administration, and other services. The Asset Management segment provides financing and ancillary management services related with motor vehicles, commercial vehicles, and equipment. The Retail Financial Services segment offers retail brokerage services; and engages in the aggregation of finance originations and extended warranty cover. The company also provides fleet management and software development services. It serves federal and state governments, health groups, not-for-profit organizations, and private corporations. The company was founded in 1988 and is headquartered in Melbourne, Australia.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Melbourne"}, "NSP": {"short_name": "Insperity, Inc.", "long_name": "Insperity, Inc.", "summary": "Insperity, Inc. provides human resources (HR) and business solutions to improve business performance for small and medium-sized businesses. The company offers its HR services through its Workforce Optimization and Workforce Synchronization solutions, which include a range of human resources functions, such as payroll and employment administration, employee benefits, workers' compensation, government compliance, performance management, and training and development services. It also provides Insperity Premier, a cloud-based human capital management platform that offers professional employer organization HR outsourcing solutions to its clients; various personnel management services; and employer liability management services, as well as solutions for middle market. In addition, the company offers MarketPlace, an e-commerce portal that offers a range of products and services; and Workforce Acceleration, a human capital management and payroll services solution; time and attendance; performance management; organizational planning; recruiting; employment screening; expense management; retirement; and insurance services. The company operates through 82 offices in the United States. The company was formerly known as Administaff, Inc. and changed its name to Insperity, Inc. in March 2011. Insperity, Inc. was founded in 1986 and is headquartered in Kingwood, Texas.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Kingwood"}, "NZIH": {"short_name": "NZJ HLDGS INC", "long_name": "NZJ Holdings Inc.", "summary": "NZJ Holdings Inc., through its subsidiary SearchPath International, Inc., operates as a franchisor of talent acquisition services in the United States. It involves in the identification, qualification, acquisition, and retention of human capital. The company engages in corporate placement activities, including talent acquisition, business development, and the creation of a national accounts program. It offers services in the areas, such as sales, recruiting, marketing, operations, human resources, administration, and information systems through approximately 139 offices. The company was formerly known as SearchPath HCS, Inc. and changed its name to NZJ Holdings Inc. in July 2019. NZJ Holdings Inc. was founded in 2005 and is headquartered in Cleveland, Ohio.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Cleveland"}, "OA2.F": {"short_name": "ASGN INC.  DL-,01", "long_name": "ASGN Incorporated", "summary": "ASGN Incorporated provides professional staffing and IT solutions in the technology, digital, creative, engineering and life sciences fields across commercial and government sectors in the United States and internationally. The company operates through Apex, Oxford, and ECS segments. The Apex segment offers technology, digital, creative, scientific, and engineering professionals for contract, contract-to-hire, and permanent placement positions to Fortune 1000 and mid-market clients. The Oxford segment provides hard-to-find technology, digital, engineering, and life sciences staffing and consulting services in various skill and geographic markets. The ECS Segment delivers advanced solutions in cloud, cyber security, artificial intelligence, machine learning, application and IT modernization, and science and engineering. The company was formerly known as On Assignment, Inc. and changed its name to ASGN Incorporated in April 2018. ASGN Incorporated was founded in 1985 and is headquartered in Glen Allen, Virginia.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Glen Allen"}, "OJM.MI": {"short_name": "OPENJOBMETIS", "long_name": "Openjobmetis S.p.A.", "summary": "Openjobmetis S.p.A. operates as an employment agency in Italy. It offers temporary or permanent placement, staff leasing, personnel recruitment and selection, training, and outplacement services, as well as manages employment relationship from the bureaucratic-administrative aspects to training. The company also provides digital head hunting services; family assistants for elderly and non-self-sufficient; and online recruitment services for people with disabilities. It offers its services to the naval, industrial, health, large-scale retail trade, bank and finance, information and communication technology, agro-industrial, hotel, restaurant, and catering sectors. Openjobmetis S.p.A. was founded in 2011 and is headquartered in Gallarate, Italy.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "MIL", "market": "it_market", "country": "Italy", "city": "Gallarate"}, "OSU.F": {"short_name": "STAFFLINE GROUP  LS-10", "long_name": "Staffline Group plc", "summary": "Staffline Group plc, together with its subsidiaries, provides recruitment and outsourced human resource services, and skills training and probationary services in the United Kingdom. The company operates through three segments: Recruitment GB, Recruitment Ireland, and PeoplePlus. It provides labour solutions to the agriculture, drinks, food processing, manufacturing, e-retail, driving, and logistics sectors. The company also offers adult skills, adult and prison education, skills-based employability, and apprenticeship services, as well as health and well-being programs, and individual support services for carers and people with disabilities. The company provides its services to government and commercial sectors under the Staffline, Express, Vital, Brightwork, and Diamond Recruitment brand names. Staffline Group plc was founded in 1986 and is based in Nottingham, the United Kingdom.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Nottingham"}, "PAGE.L": {"short_name": "PAGEGROUP PLC ORD 1P", "long_name": "PageGroup plc", "summary": "PageGroup plc, together with its subsidiaries, provides recruitment consultancy and support services. The company offers executive search services; recruitment services for qualified professional on permanent, temporary, and contract or interim basis; recruitment services to organizations requiring permanent employees and temporary or contract staff at technical and administrative support, professional clerical, and junior management levels; and flexible recruitment outsourcing services under the Page Executive, Michael Page, Page Personnel, and Page Outsourcing primary brands. It also provides assessment, consulting, and talent services under the Page Assessment, Page Consulting, and Page Talent supplementary brands. The company operates in the United Kingdom, rest of Europe, the Middle East, Africa, the Asia Pacific, and the Americas. The company was formerly known as Michael Page International plc and changed its name to PageGroup plc in June 2016. PageGroup plc was founded in 1976 and is based in Addlestone, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Addlestone"}, "PAYX": {"short_name": "Paychex, Inc.", "long_name": "Paychex, Inc.", "summary": "Paychex, Inc. provides integrated human capital management solutions for human resources (HR), payroll, benefits, and insurance services for small- to medium-sized businesses in the United States and Europe. The company offers payroll processing services; payroll tax administration services; employee payment services; and regulatory compliance services, such as new-hire reporting and garnishment processing. It also provides HR solutions, including payroll, employer compliance, HR and employee benefits administration, risk management outsourcing, and the on-site availability of a professionally trained HR representative; and retirement services administration, including plan implementation, ongoing compliance with government regulations, employee and employer reporting, participant and employer online access, electronic funds transfer, and other administrative services. In addition, the company offers cloud-based HR administration software products for employee benefits management and administration, time and attendance, recruiting, and onboarding solutions; plan administration outsourcing and state unemployment insurance services; various business services to small to medium-sized businesses comprising payroll funding and outsourcing services, which include payroll processing, invoicing, and tax preparation; and payment processing services, financial fitness programs, and a small-business loan resource center. Further, it provides insurance services for property and casualty coverage, such as workers' compensation, business-owner policies, cyber security protection, and commercial auto, as well as health and benefits coverage, including health, dental, vision, and life. The company markets and sells its services primarily through its direct sales force. Paychex, Inc. was founded in 1979 and is headquartered in Rochester, New York.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Rochester"}, "PAYX.VI": {"short_name": "PAYCHEX INC", "long_name": "Paychex, Inc.", "summary": "Paychex, Inc. provides integrated human capital management solutions for human resources (HR), payroll, benefits, and insurance services for small- to medium-sized businesses in the United States and Europe. The company offers payroll processing services; payroll tax administration services; employee payment services; and regulatory compliance services, such as new-hire reporting and garnishment processing. It also provides HR solutions, including payroll, employer compliance, HR and employee benefits administration, risk management outsourcing, and the on-site availability of a professionally trained HR representative; and retirement services administration, including plan implementation, ongoing compliance with government regulations, employee and employer reporting, participant and employer online access, electronic funds transfer, and other administrative services. In addition, the company offers cloud-based HR administration software products for employee benefits management and administration, time and attendance, recruiting, and onboarding solutions; plan administration outsourcing and state unemployment insurance services; various business services to small to medium-sized businesses comprising payroll funding and outsourcing services, which include payroll processing, invoicing, and tax preparation; and payment processing services, financial fitness programs, and a small-business loan resource center. Further, it provides insurance services for property and casualty coverage, such as workers' compensation, business-owner policies, cyber security protection, and commercial auto, as well as health and benefits coverage, including health, dental, vision, and life. The company markets and sells its services primarily through its direct sales force. Paychex, Inc. was founded in 1979 and is headquartered in Rochester, New York.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "VIE", "market": "at_market", "country": "United States", "city": "Rochester"}, "PBHG": {"short_name": "PBS HOLDING INC", "long_name": "PBS Holding, Inc.", "summary": "PBS Holding Inc., through its subsidiaries, provides human resource outsourcing services in the United States. The company offers professional employer organization (PEO) services and temporary staffing services to PEO and temporary staffing services industries. Its products and services include benefits and payroll administration, health and workers compensation insurance, personnel record management, employer liability management, and employee training and development services. The company was incorporated in 1996 and is based in Garden Ridge, Texas. PBS Holding Inc. is a subsidiary of Artfest International, Inc.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Garden Ridge"}, "PCX.DE": {"short_name": "PAYCHEX INC.  DL-,01", "long_name": "Paychex, Inc.", "summary": "Paychex, Inc. provides integrated human capital management solutions for human resources (HR), payroll, benefits, and insurance services for small- to medium-sized businesses in the United States and Europe. The company offers payroll processing services; payroll tax administration services; employee payment services; and regulatory compliance services, such as new-hire reporting and garnishment processing. It also provides HR solutions, including payroll, employer compliance, HR and employee benefits administration, risk management outsourcing, and the on-site availability of a professionally trained HR representative; and retirement services administration, including plan implementation, ongoing compliance with government regulations, employee and employer reporting, participant and employer online access, electronic funds transfer, and other administrative services. In addition, the company offers cloud-based HR administration software products for employee benefits management and administration, time and attendance, recruiting, and onboarding solutions; plan administration outsourcing and state unemployment insurance services; various business services to small to medium-sized businesses comprising payroll funding and outsourcing services, which include payroll processing, invoicing, and tax preparation; and payment processing services, financial fitness programs, and a small-business loan resource center. Further, it provides insurance services for property and casualty coverage, such as workers' compensation, business-owner policies, cyber security protection, and commercial auto, as well as health and benefits coverage, including health, dental, vision, and life. The company markets and sells its services primarily through its direct sales force. Paychex, Inc. was founded in 1979 and is headquartered in Rochester, New York.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "GER", "market": "de_market", "country": "United States", "city": "Rochester"}, "PCX.F": {"short_name": "PAYCHEX INC.  DL-,01", "long_name": "Paychex, Inc.", "summary": "Paychex, Inc. provides integrated human capital management solutions for human resources (HR), payroll, benefits, and insurance services for small- to medium-sized businesses in the United States and Europe. The company offers payroll processing services; payroll tax administration services; employee payment services; and regulatory compliance services, such as new-hire reporting and garnishment processing. It also provides HR solutions, including payroll, employer compliance, HR and employee benefits administration, risk management outsourcing, and the on-site availability of a professionally trained HR representative; and retirement services administration, including plan implementation, ongoing compliance with government regulations, employee and employer reporting, participant and employer online access, electronic funds transfer, and other administrative services. In addition, the company offers cloud-based HR administration software products for employee benefits management and administration, time and attendance, recruiting, and onboarding solutions; plan administration outsourcing and state unemployment insurance services; various business services to small to medium-sized businesses comprising payroll funding and outsourcing services, which include payroll processing, invoicing, and tax preparation; and payment processing services, financial fitness programs, and a small-business loan resource center. Further, it provides insurance services for property and casualty coverage, such as workers' compensation, business-owner policies, cyber security protection, and commercial auto, as well as health and benefits coverage, including health, dental, vision, and life. The company markets and sells its services primarily through its direct sales force. Paychex, Inc. was founded in 1979 and is headquartered in Rochester, New York.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Rochester"}, "PIXY": {"short_name": "ShiftPixy, Inc.", "long_name": "ShiftPixy, Inc.", "summary": "ShiftPixy, Inc. provides staffing services in the United States. It offers employment administrative services, such as administrative and processing services, payroll processor, human resources consultant, and administrator of workers' compensation coverages and claims. The Company also operates human resources information systems platform to assist in customer acquisition for the onboarding of new clients into the company's closed proprietary operating and processing information system. It primarily serves restaurant and hospitality service industries. The company was founded in 2015 and is headquartered in Miami, Florida.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Miami"}, "POOL-B.ST": {"short_name": "Poolia AB ser. B", "long_name": "Poolia AB (publ)", "summary": "Poolia AB (publ) engages in the temporary staffing and permanent placement of qualified professionals in Sweden, Finland, and Germany. The company also provides executive search services. It specializes in the areas of bank and finance, economics, HR and payroll, administration, engineering, legal, life science, IT, purchasing and logistics, and sales and marketing. The company was founded in 1989 and is headquartered in Stockholm, Sweden.", "currency": "SEK", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "STO", "market": "se_market", "country": "Sweden", "city": "Stockholm"}, "PPE.AX": {"short_name": "PEOPLEINFR FPO", "long_name": "People Infrastructure Ltd", "summary": "People Infrastructure Ltd, a workforce management company, provides contracted staffing and human resources outsourcing services in Australia and New Zealand. The company offers recruiting, on-boarding, rostering, timesheet management, pay rolling, and workplace health and safety management services. It serves community service, childcare, infrastructure, construction, industrial, landscaping, food processing, mining, and hospitality sectors. The company was founded in 1996 and is based in Albion, Australia.", "currency": "AUD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Albion"}, "PTY.L": {"short_name": "PARITY GROUP PLC ORD 2P", "long_name": "Parity Group plc", "summary": "Parity Group plc, together with its subsidiaries, provides a range of recruitment, and data and technology solutions in the United Kingdom and rest of Europe. The company operates through two segments, Recruitment and Consultancy. The Recruitment segment provides interim recruitment and graduate placement services to various clients. It serves central and local government in the public sector; and retail, housing, utilities, and education customers in the private sector. The Consultancy segment offers data consultancy services and business intelligence solutions. This segment serves central government departments in the public sector; and FMCG, health, and food services clients in the private sector. Parity Group plc was founded in 1993 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "PXO.SG": {"short_name": "POOLIA AB Namn-Aktier B SK -,20", "long_name": "Poolia AB (publ)", "summary": "Poolia AB (publ) engages in the temporary staffing and permanent placement of qualified professionals in Sweden, Finland, and Germany. The company also provides executive search services. It specializes in the areas of bank and finance, economics, HR and payroll, administration, engineering, legal, life science, IT, purchasing and logistics, and sales and marketing. The company was founded in 1989 and is headquartered in Stockholm, Sweden.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "STU", "market": "dr_market", "country": "Sweden", "city": "Stockholm"}, "QUESS.NS": {"short_name": "QUESS CORP LTD", "long_name": "Quess Corp Limited", "summary": "Quess Corp Limited operates as a business services provider in India, South East Asia, and North America. It operates through Workforce Management, Operating Asset Management, and Tech services segments. The Workforce Management segment provides staffing services and solutions, including general staffing, IT staffing, recruitment and executive search, and recruitment process outsourcing, as well as payroll, compliance and background verification services, training and skill development, and logistic services. The Operating Asset Management segment offers services, such as janitorial services, security services, electro-mechanical services, pest control, food and hospitality services, and industrial operations and maintenance services, as well as related asset record maintenance services. The Tech Services segment provides BPO services, break fix services, and technology solutions and products. The company was formerly known as Ikya Human Capital Solutions Limited and changed its name to Quess Corp Limited in January 2015. Quess Corp Limited was founded in 2007 and is headquartered in Bengaluru, India.", "currency": "INR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Bengaluru"}, "RAND.AS": {"short_name": "RANDSTAD NV", "long_name": "Randstad N.V.", "summary": "Randstad N.V. provides solutions in the field of work and human resources (HR) services. It offers temporary staffing and permanent placement services for the light industrial, office and administrative, manufacturing and logistics, and other specialty areas, as well as provides payroll services. The company also offers on-site solution for managing a client's workforce with specific skill sets and a fluctuating level of demand for the fast-moving consumer goods, automotive, life sciences, contact centers, manufacturing, and logistics, as well as the administrative and professionals segments. In addition, it recruits experienced staff for managerial and professional roles in a range of sectors and disciplines, including IT, engineering, finance and accounting, healthcare, HR, education, legal, and marketing and communications. Further, the company provides managed services programs, recruitment process outsourcing, outplacement and career development, and online talent acquisition. It has operations in North America, France, the Netherlands, Germany, Belgium, Luxembourg, Italy, Iberia, other European countries, and internationally. The company was formerly known as Randstad Holding NV and changed its name to Randstad N.V. in April 2018. Randstad N.V. was founded in 1960 and is headquartered in Diemen, the Netherlands.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "AMS", "market": "nl_market", "country": "Netherlands", "city": "Diemen"}, "RAND.VI": {"short_name": "RANDSTAD NV", "long_name": "Randstad N.V.", "summary": "Randstad N.V. provides solutions in the field of work and human resources (HR) services. It offers temporary staffing and permanent placement services for the light industrial, office and administrative, manufacturing and logistics, and other specialty areas, as well as provides payroll services. The company also offers on-site solution for managing a client's workforce with specific skill sets and a fluctuating level of demand for the fast-moving consumer goods, automotive, life sciences, contact centers, manufacturing, and logistics, as well as the administrative and professionals segments. In addition, it recruits experienced staff for managerial and professional roles in a range of sectors and disciplines, including IT, engineering, finance and accounting, healthcare, HR, education, legal, and marketing and communications. Further, the company provides managed services programs, recruitment process outsourcing, outplacement and career development, and online talent acquisition. It has operations in North America, France, the Netherlands, Germany, Belgium, Luxembourg, Italy, Iberia, other European countries, and internationally. The company was formerly known as Randstad Holding NV and changed its name to Randstad N.V. in April 2018. Randstad N.V. was founded in 1960 and is headquartered in Diemen, the Netherlands.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "VIE", "market": "at_market", "country": "Netherlands", "city": "Diemen"}, "RANJF": {"short_name": "RANDSTAD N.V.", "long_name": "Randstad N.V.", "summary": "Randstad N.V. provides solutions in the field of work and human resources (HR) services. It offers temporary staffing and permanent placement services for the light industrial, office and administrative, manufacturing and logistics, and other specialty areas, as well as provides payroll services. The company also offers on-site solution for managing a client's workforce with specific skill sets and a fluctuating level of demand for the fast-moving consumer goods, automotive, life sciences, contact centers, manufacturing, and logistics, as well as the administrative and professionals segments. In addition, it recruits experienced staff for managerial and professional roles in a range of sectors and disciplines, including IT, engineering, finance and accounting, healthcare, HR, education, legal, and marketing and communications. Further, the company provides managed services programs, recruitment process outsourcing, outplacement and career development, and online talent acquisition. It has operations in North America, France, the Netherlands, Germany, Belgium, Luxembourg, Italy, Iberia, other European countries, and internationally. The company was formerly known as Randstad Holding NV and changed its name to Randstad N.V. in April 2018. Randstad N.V. was founded in 1960 and is headquartered in Diemen, the Netherlands.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "Netherlands", "city": "Diemen"}, "RANJY": {"short_name": "RANDSTAD N.V.", "long_name": "Randstad N.V.", "summary": "Randstad N.V. provides solutions in the field of work and human resources (HR) services. It offers temporary staffing and permanent placement services for the light industrial, office and administrative, manufacturing and logistics, and other specialty areas, as well as provides payroll services. The company also offers on-site solution for managing a client's workforce with specific skill sets and a fluctuating level of demand for the fast-moving consumer goods, automotive, life sciences, contact centers, manufacturing, and logistics, as well as the administrative and professionals segments. In addition, it recruits experienced staff for managerial and professional roles in a range of sectors and disciplines, including IT, engineering, finance and accounting, healthcare, HR, education, legal, and marketing and communications. Further, the company provides managed services programs, recruitment process outsourcing, outplacement and career development, and online talent acquisition. It has operations in North America, France, the Netherlands, Germany, Belgium, Luxembourg, Italy, Iberia, other European countries, and internationally. The company was formerly known as Randstad Holding NV and changed its name to Randstad N.V. in April 2018. Randstad N.V. was founded in 1960 and is headquartered in Diemen, the Netherlands.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "Netherlands", "city": "Diemen"}, "RCRRF": {"short_name": "RECRUIT HOLDINGS CO LTD", "long_name": "Recruit Holdings Co., Ltd.", "summary": "Recruit Holdings Co., Ltd. provides employment information services in Japan and internationally. It operates through three segments: HR Technology, Media & Solutions, and Staffing. The company operates Indeed.com, a job aggregator search engine; and Glassdoor, an online job platform and company information site. It also operates Suumo, an online platform and print media, which provides information related to home purchases, sales, rentals, and renovation services; Zexy, a magazine and online platform providing information to organize customized wedding events; Study Sapuri Shinro, an online platform and print media, which provides higher education and career information primarily for high school students; Study Sapuri, an online learning support platform for students and adults; and Car Sensor that provides information on pre-owned automobiles for potential buyers. In addition, the company operates Jalan, a site offering travel information and accommodation booking for travel; Hot Pepper Gourmet, an online booking site information about restaurants and discount coupons, as well as online reservations and a scheduling function for invited guests; Hot Pepper Beauty, a domestic search and booking site for hair, relaxation, and beauty salons; AirRegi and AirPAY provides support services to dining and beauty enterprise clients; Rikunabi, a job information site for soon-to-be graduates; Rikunabi Next, a job portal site for people looking to change jobs; Recruit Agent, an employment agency staffed with career advisors; and Townwork, a magazine that provides information on job openings to part-time job seekers. Further, it offers clerical and IT staffing agency; light industrial staffing; human capital outsourcing; IT and digital recruitment services specializing in contracting and permanent recruitment; and human resources services, products, and technologies to organizations and individuals. The company was founded in 1960 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "RCRT": {"short_name": "RECRUITER COM GROUP INC", "long_name": "Recruiter.com Group, Inc.", "summary": "Recruiter.com Group, Inc. operates an online hiring platform that connects recruiters and employers worldwide. The company offers consulting and staffing personnel services to employers for long- and short-term consulting and temporary employee needs; specialized personnel placement services for employers; resume distribution services; and recruiter certification programs. It also provides web portal monetization, lead generation, and digital publication advertising services for specialized B2B software companies. The company was incorporated in 2008 and is based in Houston, Texas.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "RCRUY": {"short_name": "RECRUIT HOLDINGS CO LTD", "long_name": "Recruit Holdings Co., Ltd.", "summary": "Recruit Holdings Co., Ltd. provides employment information services in Japan and internationally. It operates through three segments: HR Technology, Media & Solutions, and Staffing. The company operates Indeed.com, a job aggregator search engine; and Glassdoor, an online job platform and company information site. It also operates Suumo, an online platform and print media, which provides information related to home purchases, sales, rentals, and renovation services; Zexy, a magazine and online platform providing information to organize customized wedding events; Study Sapuri Shinro, an online platform and print media, which provides higher education and career information primarily for high school students; Study Sapuri, an online learning support platform for students and adults; and Car Sensor that provides information on pre-owned automobiles for potential buyers. In addition, the company operates Jalan, a site offering travel information and accommodation booking for travel; Hot Pepper Gourmet, an online booking site information about restaurants and discount coupons, as well as online reservations and a scheduling function for invited guests; Hot Pepper Beauty, a domestic search and booking site for hair, relaxation, and beauty salons; AirRegi and AirPAY provides support services to dining and beauty enterprise clients; Rikunabi, a job information site for soon-to-be graduates; Rikunabi Next, a job portal site for people looking to change jobs; Recruit Agent, an employment agency staffed with career advisors; and Townwork, a magazine that provides information on job openings to part-time job seekers. Further, it offers clerical and IT staffing agency; light industrial staffing; human capital outsourcing; IT and digital recruitment services specializing in contracting and permanent recruitment; and human resources services, products, and technologies to organizations and individuals. The company was founded in 1960 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "RDGC.L": {"short_name": "RIDGECREST PLC ORD 0.01P", "long_name": "Ridgecrest Plc", "summary": "Ridgecrest Plc does not have significant business operations. Previously, it offered recruitment consultancy services for digital technology and interactive media industries in the Asia Pacific, the United Kingdom, Europe, and the United States. The company was formerly known as Nakama Group plc and changed its name to Ridgecrest Plc in January 2021. Ridgecrest Plc was founded in 1983 and is headquartered in Whyteleafe, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Whyteleafe"}, "RHI": {"short_name": "Robert Half International Inc.", "long_name": "Robert Half International Inc.", "summary": "Robert Half International Inc. provides staffing and risk consulting services in North America, South America, Europe, Asia, and Australia. The company operates through three segments: Temporary and Consultant Staffing, Permanent Placement Staffing, and Risk Consulting and Internal Audit Services. It places temporary services for accounting, finance, and bookkeeping; temporary and full-time office and administrative personnel consisting of executive and administrative assistants, receptionists, and customer service representatives; full-time accounting, financial, tax, and accounting operations personnel; and information technology contract consultants and full-time employees in the areas of platform systems integration to end-user technical and desktop support, including specialists in application development, networking, systems integration and deployment, database design and administration, and security and business continuity. The company also offers temporary and full-time employees in attorney, paralegal, legal administrative, and legal secretarial positions; and senior level project professionals in the accounting and finance fields for financial systems conversions, expansion into new markets, business process reengineering, business systems performance improvement, and post-merger financial consolidation. In addition, it is involved in serving professionals in the areas of interactive media, design, marketing, advertising, and public relations; and placing freelance and project consultants in various positions, such as creative directors, graphics designers, Web content developers, Web designers, media buyers, brand managers, and public relations specialists. Further, the company provides business and technology risk consulting, and internal audit services. It serves clients and employment candidates. Robert Half International Inc. was founded in 1948 and is headquartered in Menlo Park, California.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Menlo Park"}, "RHJ.F": {"short_name": "ROBERT HALF INTL  DL-,001", "long_name": "Robert Half International Inc.", "summary": "Robert Half International Inc. provides staffing and risk consulting services in North America, South America, Europe, Asia, and Australia. The company operates through three segments: Temporary and Consultant Staffing, Permanent Placement Staffing, and Risk Consulting and Internal Audit Services. It places temporary services for accounting, finance, and bookkeeping; temporary and full-time office and administrative personnel consisting of executive and administrative assistants, receptionists, and customer service representatives; full-time accounting, financial, tax, and accounting operations personnel; and information technology contract consultants and full-time employees in the areas of platform systems integration to end-user technical and desktop support, including specialists in application development, networking, systems integration and deployment, database design and administration, and security and business continuity. The company also offers temporary and full-time employees in attorney, paralegal, legal administrative, and legal secretarial positions; and senior level project professionals in the accounting and finance fields for financial systems conversions, expansion into new markets, business process reengineering, business systems performance improvement, and post-merger financial consolidation. In addition, it is involved in serving professionals in the areas of interactive media, design, marketing, advertising, and public relations; and placing freelance and project consultants in various positions, such as creative directors, graphics designers, Web content developers, Web designers, media buyers, brand managers, and public relations specialists. Further, the company provides business and technology risk consulting, and internal audit services. It serves clients and employment candidates. Robert Half International Inc. was founded in 1948 and is headquartered in Menlo Park, California.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Menlo Park"}, "RLBY": {"short_name": "RELIABILITY INC", "long_name": "Reliability Incorporated", "summary": "Reliability Incorporated, through its subsidiary, The Maslow Media Group, Inc., provides workforce solutions in the United States. The company operates through Employer of Record, Recruiting and Staffing, and Video and Multimedia Production segments. It offers employer of record services, including sourcing/recruiting qualified workers; state employment registration, background checks and drug screening, employee onboarding/offboarding, payroll processing, benefits offerings and administration, workers compensation claim management, employee relations, regulatory compliance, state/city mandated sick leave tracking, and on site workforce management. The company also provides recruiting and staffing services, such as on-demand or short-term staffing assignments, contract staffing, and on-site management administration. In addition, it offers video and multimedia production solutions, which include pre-production conceptualization of final video; project consultation; budget development and management; booking and managing logistics for field and studio teams; broadcast level HD camera crews and field support comprising makeup artists, AV support, field producers, and full equipment rental; post- production facilities and freelance support consisting of non-linear editors, graphic artists, narrators, and actors; animation and graphic design development, including whiteboard animation; live transmission services from satellite to streaming; and management of fully staffed client studios. The company serves media, financial services, banking, medical devices, pharmaceuticals, telecommunications, energy, healthcare, photography, and chain restaurants industries. Reliability Incorporated was founded in 1988 and is headquartered in Rockville, Maryland.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Rockville"}, "ROF.F": {"short_name": "KFORCE INC.  DL-,01", "long_name": "Kforce Inc.", "summary": "Kforce Inc. provides professional staffing services and solutions in the United States and internationally. It operates through Technology (Tech) and Finance and Accounting (FA) segments. The Tech segment provides temporary staffing and permanent placement services to its clients primarily in the areas of information technology, such as systems/applications architecture and development, business and artificial intelligence, machine learning, network architecture, security, enterprise data, and project management. This segment serves clients in various industries comprising financial and business services, communications, and technology industries. The FA segment offers temporary staffing and permanent placement services to its clients in areas, including general accounting, business and cost analysis, financial analysis and reporting, taxation, budgeting, loan servicing, professional administration, audit services, and systems and controls analysis and documentation. This segment also provides transactional services, which include accounts payable and receivable, billing, payroll, credit and collections, and cash application; decision making services; and operational and technical services. This segment serves clients in various industries, including financial services, healthcare, and manufacturing sectors. Kforce Inc. was founded in 1962 and is headquartered in Tampa, Florida.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Tampa"}, "RSH.F": {"short_name": "RANDSTAD NV  EO -,10", "long_name": "Randstad N.V.", "summary": "Randstad N.V. provides solutions in the field of work and human resources (HR) services. It offers temporary staffing and permanent placement services for the light industrial, office and administrative, manufacturing and logistics, and other specialty areas, as well as provides payroll services. The company also offers on-site solution for managing a client's workforce with specific skill sets and a fluctuating level of demand for the fast-moving consumer goods, automotive, life sciences, contact centers, manufacturing, and logistics, as well as the administrative and professionals segments. In addition, it recruits experienced staff for managerial and professional roles in a range of sectors and disciplines, including IT, engineering, finance and accounting, healthcare, HR, education, legal, and marketing and communications. Further, the company provides managed services programs, recruitment process outsourcing, outplacement and career development, and online talent acquisition. It has operations in North America, France, the Netherlands, Germany, Belgium, Luxembourg, Italy, Iberia, other European countries, and internationally. The company was formerly known as Randstad Holding NV and changed its name to Randstad N.V. in April 2018. Randstad N.V. was founded in 1960 and is headquartered in Diemen, the Netherlands.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "Netherlands", "city": "Diemen"}, "RTC.L": {"short_name": "RTC GROUP PLC ORD 1P", "long_name": "RTC Group plc", "summary": "RTC Group PLC, through its subsidiaries, provides recruitment services in the United Kingdom and internationally. It offers technical recruitment solutions to the general engineering, manufacturing, transport, build environment, infrastructure, commercial disciplines, sales and technical sales, scientific, chemical, energy and utilities, and defense and aerospace sectors; technical and engineering workforce solutions, such as recruitment, training, account management, contingent labor, and fleet provision to the rail, energy, construction, highways, and transportation sectors; and staffing services. The company also provides conferencing rooms of various sizes to accommodate meetings, en-suite hotel bedrooms, and bar and dining facilities to accommodate business and leisure guests; and office space. RTC Group PLC was founded in 1963 and is headquartered in Derby, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Derby"}, "RVLTF": {"short_name": "REVOLUTION TECHNOLOGIES INC", "long_name": "Revolution Technologies, Inc.", "summary": "Revolution Technologies Inc. engages in the exploration business. The company was formerly known as Canada Iron Group Inc. and changed its name to Revolution Technologies Inc. in February 2010. Revolution Technologies Inc. was incorporated in 1979 and is based in North York, Canada.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "North York"}, "RWA.L": {"short_name": "ROBERT WALTERS PLC ORD 20P", "long_name": "Robert Walters plc", "summary": "Robert Walters plc, together with its subsidiaries, provides professional recruitment consultancy services worldwide. The company offers permanent, contract, and interim recruitment services in the fields of accounting and finance, banking and financial services, engineering, human resources, information technology, legal, sales and marketing, secretarial and support, and supply chain and procurement. It also provides recruitment process outsourcing and managed services. The company was founded in 1985 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "S8T.F": {"short_name": "STHREE PLC  LS -,01", "long_name": "SThree plc", "summary": "SThree plc provides permanent and contract specialist staffing services for information and communication technology, banking and finance, energy, engineering, and the life science sectors. It offers permanent, contract, project, retained, and executive search recruitment solutions, as well as support and mobility services. The company offers its services under the Computer Futures, Progressive, Huxley Associates, Real Staffing Group, Enterprise Partners, JP Gray, Madison Black, Newington International, and Orgtel brands. It has operations primarily in the United Kingdom and Ireland, Continental Europe, the United States, and the Asia Pacific and the Middle East. SThree plc was founded in 1986 and is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "SDG.PA": {"short_name": "SYNERGIE", "long_name": "Synergie SE", "summary": "Synergie SE provides human resources management and development services for companies and institutions in Europe, Canada, Australia, and China. It offers temporary employment, recruitment, out-placement, social engineering, consultancy, and training services. The company serves various specialized tertiary sectors and industries, such as aeronautics and renewable energy, construction and public works, retail, information technology and IT services, and communications. Synergie SE operates through a network of 750 agencies. The company was founded in 1984 and is headquartered in Paris, France.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Paris"}, "SEK.AX": {"short_name": "SEEK FPO", "long_name": "SEEK Limited", "summary": "SEEK Limited, together with its subsidiaries, provides online employment marketplace services in Australia and internationally. It operates through Asia Pacific & Americas and SEEK Investments segments. The company engages in online matching of hirers and candidates with career opportunities and other related services; investing in early stage businesses and technologies, which are in the human capital management market; and the distribution and provision of higher education courses. It also provides online education courses and other offline services. The company was founded in 1997 and is headquartered in Melbourne, Australia.", "currency": "AUD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "SJR-B.ST": {"short_name": "SJR in Scandinavia AB ser. B", "long_name": "SJR in Scandinavia AB (publ)", "summary": "SJR in Scandinavia AB (publ) provides recruitment and consultancy services for IT, finance, HR, and supply chain sectors in Sweden. SJR in Scandinavia AB (publ) was founded in 1993 and is based in Stockholm, Sweden.", "currency": "SEK", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "STO", "market": "se_market", "country": "Sweden", "city": "Stockholm"}, "SKLTY": {"short_name": "SEEK LIMITED", "long_name": "SEEK Limited", "summary": "SEEK Limited, together with its subsidiaries, provides online employment marketplace services in Australia and internationally. It operates through Asia Pacific & Americas and SEEK Investments segments. The company engages in online matching of hirers and candidates with career opportunities and other related services; investing in early stage businesses and technologies, which are in the human capital management market; and the distribution and provision of higher education courses. It also provides online education courses and other offline services. The company was founded in 1997 and is headquartered in Melbourne, Australia.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Melbourne"}, "SLD.F": {"short_name": "SEEK LTD", "long_name": "SEEK Limited", "summary": "SEEK Limited, together with its subsidiaries, provides online employment marketplace services in Australia and internationally. It operates through Asia Pacific & Americas and SEEK Investments segments. The company engages in online matching of hirers and candidates with career opportunities and other related services; investing in early stage businesses and technologies, which are in the human capital management market; and the distribution and provision of higher education courses. It also provides online education courses and other offline services. The company was founded in 1997 and is headquartered in Melbourne, Australia.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Melbourne"}, "SOSS.JK": {"short_name": "Shield On Service Tbk.", "long_name": "PT Shield on Service Tbk", "summary": "PT Shield on Service Tbk, together with its subsidiaries, provides outsourcing services in Indonesia. It operates through Security Services, Cleaning Services, Human Resource Provider, Parking Services, and Others segments. The company offers security services comprising security management and guarding, security consultancy, corporate and personnel review, and security personnel training services; and cleaning and maintenance services, including daily, full-package, special, and mobile cleaning, as well as landscape/garden maintenance services. It also provides human resource solutions that include talent development, recruitment assessment, and compensation and benefit services; and parking management services, such as parking, valet, car park management, traffic design consultancy, and parking equipment maintenance services. The company was founded in 2004 and is headquartered in Jakarta Pusat, Indonesia.", "currency": "IDR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Pusat"}, "SSET": {"short_name": "STARSTREAM ENT INC", "long_name": "Starstream Entertainment, Inc.", "summary": "Starstream Entertainment, Inc., an independent entertainment production company, is engaged in the development, production, marketing, and distribution of feature-length motion pictures and entertainment projects. It exploits motion pictures and entertainment projects, and their ancillary rights through various avenues, including theatrical releases, video-on-demand, digital distribution, and television outlets. The company is based in Monterey, California.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Monterey"}, "STAF": {"short_name": "Staffing 360 Solutions, Inc.", "long_name": "Staffing 360 Solutions, Inc.", "summary": "Staffing 360 Solutions, Inc., a staffing company, engages in the acquisition of staffing companies in the United States and the United Kingdom. The company operates through three segments: Commercial Â\u0096 US, Professional Â\u0096 US, and Professional - UK. Its services primarily comprise the provision of temporary contractors; and the recruitment of candidates for permanent placement. It focuses primarily on the staffing companies supporting accounting and finance, information technology, engineering, administration, and commercial disciplines. The company was formerly known as Golden Fork Corporation and changed its name to Staffing 360 Solutions, Inc. in April 2012. Staffing 360 Solutions, Inc. was incorporated in 2009 and is headquartered in New York, New York.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "New York"}, "STAF.L": {"short_name": "STAFFLINE GROUP PLC ORD 10P", "long_name": "Staffline Group plc", "summary": "Staffline Group plc, together with its subsidiaries, provides recruitment and outsourced human resource services, and skills training and probationary services in the United Kingdom. The company operates through three segments: Recruitment GB, Recruitment Ireland, and PeoplePlus. It provides labour solutions to the agriculture, drinks, food processing, manufacturing, e-retail, driving, and logistics sectors. The company also offers adult skills, adult and prison education, skills-based employability, and apprenticeship services, as well as health and well-being programs, and individual support services for carers and people with disabilities. The company provides its services to government and commercial sectors under the Staffline, Express, Vital, Brightwork, and Diamond Recruitment brand names. Staffline Group plc was founded in 1986 and is based in Nottingham, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Nottingham"}, "STEM.L": {"short_name": "STHREE PLC ORD 1P", "long_name": "SThree plc", "summary": "SThree plc provides permanent and contract specialist staffing services for information and communication technology, banking and finance, energy, engineering, and the life science sectors. It offers permanent, contract, project, retained, and executive search recruitment solutions, as well as support and mobility services. The company offers its services under the Computer Futures, Progressive, Huxley Associates, Real Staffing Group, Enterprise Partners, JP Gray, Madison Black, Newington International, and Orgtel brands. It has operations primarily in the United Kingdom and Ireland, Continental Europe, the United States, and the Asia Pacific and the Middle East. SThree plc was founded in 1986 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "STJO": {"short_name": "ST.JOSEPH INC", "long_name": "St. Joseph, Inc.", "summary": "St. Joseph, Inc., through its subsidiary, Staf*Tek Services, Inc., engages in the recruitment and placement of professional technical personnel, as well as finance and accounting personnel on a temporary and permanent basis primarily in the Tulsa, Oklahoma area. It provides its customers with employee candidates with information technology skills in areas ranging from multiple platform systems integration to end-user support, including specialists in programming, networking, systems integration, and database design, as well as help desk support comprising senior and entry level finance and accounting candidates. The company also offers computer training, online assessments, and certification in approximately 50 skill sets. It provides its services to a range of assignments from technical one-person assignments to major projects, such as Internet/Intranet development, desktop applications development, project management, enterprise systems development, SAP implementation, and mainframe projects. The company was formerly known as St. Joseph Energy, Inc. and changed its name to St. Joseph, Inc. in November 2003. St. Joseph, Inc. was founded in 1997 and is based in McKinney, Texas.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "McKinney"}, "TBI": {"short_name": "TrueBlue, Inc.", "long_name": "TrueBlue, Inc.", "summary": "TrueBlue, Inc., together with its subsidiaries, provides specialized workforce solutions in the United States, Canada, and Puerto Rico. It operates through three segments: PeopleReady, PeopleManagement, and PeopleScout. The PeopleReady segment offers a range of contingent staffing solutions for blue-collar, on-demand, and skilled labor in construction, manufacturing and logistics, warehousing and distribution, waste and recycling, energy, retail, hospitality, general labor, and other industries. The PeopleManagement segment provides contingent labor and outsourced industrial workforce solutions. It offers on-site management and recruitment for the contingent industrial workforce of manufacturing, warehouse, and distribution facilities; and recruitment and management of contingent and dedicated commercial drivers to the transportation and distribution industries under the Staff Management, SIMOS Insourcing Solutions, and Centerline Drivers brands. The PeopleScout segment offers permanent employee recruitment process outsourcing services; and manages clients' contingent labor programs comprising vendor selection, performance management, compliance monitoring, and risk management. The company was formerly known as Labor Ready, Inc. and changed its name to TrueBlue, Inc. in December 2007. TrueBlue, Inc. was incorporated in 1985 and is headquartered in Tacoma, Washington.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Tacoma"}, "TEAMLEASE.NS": {"short_name": "TEAMLEASE SERVICES", "long_name": "TeamLease Services Limited", "summary": "TeamLease Services Limited provides human resource services to various industries in India. The company offers temporary staffing, permanent recruitment, payroll process outsourcing, regulatory compliance, vocational training/education and assessment, and IT and telecom staffing services; apprenticeship program and property leasing services; and online service for software product engineering. It provides its solutions primarily to consumer goods and durables, chemicals, manufacturing, media and telecom, retail, banking, financial services, insurance, e-commerce, pharmaceuticals and healthcare sectors. The company was incorporated in 2000 and is headquartered in Bengaluru, India.", "currency": "INR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Bengaluru"}, "TFAS.JK": {"short_name": "Telefast Indonesia Tbk.", "long_name": "PT Telefast Indonesia Tbk", "summary": "PT Telefast Indonesia Tbk, together with its subsidiaries, provides human resources and telecommunications solutions in Indonesia. It operates through Telco Products and Nontelco Products segments. The company offers HR-KU, a human resources information system application, which facilitates all human resources activities and offers a management system for human resource management for developing companies. Its HR-KU provide various modules, such as attendance, leaves, reimbursement, TAS, employee database and information, internal bulletin, and digital store modules. The company also offers manpower supply solutions; and BILIK KERJA, an application for job providers to recruit and manage employees. In addition, it engages in the trading, services, and tourism businesses. PT Telefast Indonesia Tbk was founded in 2008 and is based in Jakarta, Indonesia.", "currency": "IDR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "TGDLF": {"short_name": "TONGDAO LIEPIN GROUP", "long_name": "Tongdao Liepin Group", "summary": "Tongdao Liepin Group, an investment holding company, operates an online talent services platform in the People's Republic of China. The company offers various talent services, including professional profile, job and headhunter recommendations, professional social network and career-related content, premium membership, career coaching, and CV advisory services to individual users through its liepin.com Website, mobile app Liepin Tongdao, and WeChat official accounts. It also provides subscription-based and headhunter-assisted closed loop talent acquisition services for business customers to accurately identify and acquire active job seekers and suitable passive candidates for an opportunity primarily through Liepintong, a one-stop online software-as-a-solution (SaaS) interface. In addition, it offers Chenglietong, a SaaS solution that enables professional recruiting firms and individual headhunters to source candidates and manage their headhunting process; and offline talent services. The company was formerly known as Wise Talent Information Technology Co., Ltd and changed its name to Tongdao Liepin Group in July 2020. Tongdao Liepin Group was incorporated in 2018 and is headquartered in Beijing, the People's Republic of China.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "China", "city": "Beijing"}, "TNET": {"short_name": "TriNet Group, Inc.", "long_name": "TriNet Group, Inc.", "summary": "TriNet Group, Inc. provides human resources (HR) solutions for small and midsize businesses in the United States. The company offers multi-state payroll processing and tax administration; employee benefits programs, including health insurance and retirement plans; workers compensation insurance and claims management; employment and benefit law compliance; and other HR related services. It serves clients in various industries, including technology, professional services, financial services, life sciences, not-for-profit, property management, retail, manufacturing, and hospitality. The company sells its solutions through its direct sales organization. TriNet Group, Inc. was founded in 1988 and is headquartered in Dublin, California.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Dublin"}, "TREP": {"short_name": "TRUCEPT INC", "long_name": "Trucept, Inc.", "summary": "Trucept, Inc., through its subsidiaries, provides professional employer organization staffing and business processing services to small and medium-size businesses in the United States. Its services allow customers to out source human resources tasks, including payroll processing, workers' compensation insurance, health insurance, employee benefits, 401k investment services, personal financial management, and income tax consultation primarily related to staffing comprising staff leasing, temporary staffing, and co-employment. These services also relieve existing and potential customers of the burdens associated with personnel management and control. It also provides healthcare staffing services. The company was formerly known as Smart-Tek Solutions, Inc. and changed its name to Trucept, Inc. in January 2013. Trucept, Inc. is headquartered in Tampa, Florida.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Escondido"}, "TXHPF": {"short_name": "TECHNOPRO HOLDINGS INC", "long_name": "TechnoPro Holdings, Inc.", "summary": "TechnoPro Holdings, Inc., through its subsidiaries, operates as a technology-focused staffing and services company in Japan and internationally. The company offers engineer dispatch, contract assignment, outsourced development, placement, and offshoring services in the machinery, electrics and electronics, embedded controls, information systems, IT infrastructure, software development and maintenance, civil engineering, production plant, architecture, chemistry, biotechnology, and construction areas. It also offers IT system integration and package products; application development and IT consulting services; assessment, inspection, design, and supervision services of buildings; employment services for people with disabilities; and education and training services for CAD, programming, network construction, web design, PC operation, Microsoft office, etc. In addition, the company provides engineering consultancy and offshore development services; and recruitment process outsourcing services, as well as operates as a recruitment agency. The company was formerly known as Prompt Holdings, Inc. and changed its name to TechnoPro Holdings, Inc. in April 2012. TechnoPro Holdings, Inc. was founded in 1995 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "UPWK": {"short_name": "Upwork Inc.", "long_name": "Upwork Inc.", "summary": "Upwork Inc. operates an online talent marketplace that enables businesses (clients) to find and work with various independent professionals and agencies (freelancers) in the United States, India, the Philippines, and internationally. The company's platform provides access to talent with approximately 8,000 skills across approximately 70 categories, including content marketing, customer service, data science and analytics, graphic design, mobile development, sales, and web development. Its platform also enables clients to streamline workflows, such as talent sourcing, outreach, and contracting. The company's platform offers access to various functionalities for remote engagements with freelancers comprising communication and collaboration, time tracking, invoicing, and payment. Its marketplace offerings include Upwork Basic, Upwork Plus, Upwork Business, Upwork Enterprise, and Upwork Payroll, as well as managed and internet escrow agency services. The company was formerly known as Elance-oDesk, Inc. and changed its name to Upwork Inc. in May 2015. Upwork Inc. was incorporated in 2013 and is headquartered in Santa Clara, California.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Santa Clara"}, "UPWK.MX": {"short_name": "UPWORK INC", "long_name": "Upwork Inc.", "summary": "Upwork Inc. operates an online talent marketplace that enables businesses (clients) to find and work with various independent professionals and agencies (freelancers) in the United States, India, the Philippines, and internationally. The company's platform provides access to talent with approximately 8,000 skills across approximately 70 categories, including content marketing, customer service, data science and analytics, graphic design, mobile development, sales, and web development. Its platform also enables clients to streamline workflows, such as talent sourcing, outreach, and contracting. The company's platform offers access to various functionalities for remote engagements with freelancers comprising communication and collaboration, time tracking, invoicing, and payment. Its marketplace offerings include Upwork Basic, Upwork Plus, Upwork Business, Upwork Enterprise, and Upwork Payroll, as well as managed and internet escrow agency services. The company was formerly known as Elance-oDesk, Inc. and changed its name to Upwork Inc. in May 2015. Upwork Inc. was incorporated in 2013 and is headquartered in Santa Clara, California.", "currency": "MXN", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Santa Clara"}, "VOLT": {"short_name": "Volt Information Sciences, Inc.", "long_name": "Volt Information Sciences, Inc.", "summary": "Volt Information Sciences, Inc. provides traditional time, materials-based, and project-based staffing services in the United States, Europe, Canada, and the Asia Pacific. The company operates through North American Staffing, International Staffing, and North American MSP segments. It provides contingent staffing, direct placement, personnel recruitment, staffing management, and other employment services; and managed service programs consisting of managing the procurement, on-boarding of contingent workers, and specialized solutions, such as managing suppliers, sourcing and recruiting support, statement of work management, supplier performance measurement, optimization and analysis, benchmarking of spend demographics and market rate analysis, consolidated customer billing, and supplier payment management solutions. The company also offers call center and payroll services; recruitment process outsourcing; and customized talent and supplier management solutions, as well as act as a subcontractor or associate vendor to other national providers in their MSPs. It serves multinational, national, and local customers in various industries, including aerospace, automotive, banking and finance, consumer electronics, information technology, insurance, life science, manufacturing, media and entertainment, pharmaceutical, software, telecommunication, transportation, and utilities. The company was founded in 1950 and is headquartered in Orange, California.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Orange"}, "WDHR": {"short_name": "WEEDHIRE INTERNATIONAL INC", "long_name": "WeedHire International, Inc.", "summary": "WeedHire International, Inc. provides green technology solutions. It manages the equipment disposition needs of government and commercial clients by buying, reselling, or recycling computers and other technology hardware. The company provides a suite of information technology asset disposition services. It offers various programs comprising RecycleToday, an immediate environmentally compliant downstream disposition program; and RecycleTomorrow, a budgeting for the disposal of equipment in conjunction with new product purchases that would become obsolete. The company also provides a range of services that support redeployment/remarketing programs, such as conducting a detailed analysis of retired equipment, customized business intelligence-based reporting, and recommending a course of action. In addition, it offers logistics and transportation services, including Web-based E-waste pickup request tool; onsite packaging and removal; data erasure or destruction; onsite per system software padlock to ensure safe transport of customer data; IT asset serial number scanning; transport with optional global positing satellite tracking; and armored truck transport, as well as data security services, which focus on data erasure, destruction, and on-site destruction techniques. The company also operates WeedHire.com, an online portal and social media source for job seekers and providers within the legal cannabis industry. Its Website provides job postings for cannabis jobs, such as recommending physicians, physician's assistants, growers, budtenders, dispensary operators, security guards, dispensary administrators, lighting specialist, delivery drivers, lab techs, marketing specialists, lawyers, insurance agents, and government jobs. The company was formerly known as AnythingIT, Inc. and changed its name to WeedHire International, Inc. in November 2014. WeedHire International, Inc. was founded in 1992 and is headquartered in Fair Lawn, New Jersey.", "currency": "USD", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Fair Lawn"}, "WKF.JO": {"short_name": "Workforce Holdings Ltd", "long_name": "Workforce Holdings Limited", "summary": "Workforce Holdings Limited, an investment holding company, provides human capital solutions in South Africa, Mozambique, Namibia, Botswana, and Mauritius. The company operates through four segments: Staffing and Outsourcing, Training, Financial Services, and Healthcare. The company offers temporary employment, functional outsourcing, permanent placement recruitment, executive search, specialist staffing, short-and long-term hires, payroll and other systems management, and HR and IR consulting services, as well as disability and turnkey staffing, and business process outsourcing solutions. It also provides accredited short courses, online courses and bursaries, skills programs, full qualifications, and adult education training services, as well as contractor on-boarding services; and learnerships and apprenticeships programs. In addition, the company offers death and disability cover, funeral cover, hospital cover, day-to-day medical insurance, and financial and mobile products and services, as well as lending services. Further, it offers recruitment and placement of medical professionals for hospitals and frail-care homes, primary and occupational healthcare, employee health and wellness programs, and health risk assessments, as well as lifestyle benefits. Workforce Holdings Limited was founded in 1972 and is headquartered in Johannesburg, South Africa.", "currency": "ZAc", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Johannesburg"}, "XXY.F": {"short_name": "CROSS COUNT.HEAL.DL-,0001", "long_name": "Cross Country Healthcare, Inc.", "summary": "Cross Country Healthcare, Inc. provides talent management and other consultative services for healthcare clients in the United States. The company operates in three segments: Nurse and Allied Staffing, Physician Staffing, and Search. The Nurse and Allied Staffing segment offers traditional staffing, including temporary and permanent placement of travel nurses and allied professionals, branch-based local nurses, and allied staffing; short-term staffing of registered nurses, licensed practical nurses, certified nurse assistants, practitioners, pharmacists, and other allied professionals on per diem and short-term assignments; and travel allied professionals on long-term contract assignments, as well as workforce solutions, including MSP, OWS, RPO, IRP, EMR, and consulting services. It serves public and private acute care and non-acute care hospitals, government facilities, public and charter schools, outpatient clinics, ambulatory care facilities, physician practice groups, retailers, and other healthcare providers under the Cross Country brand. The Physician Staffing segment provides physicians in various specialties, certified registered nurse anesthetists, nurse practitioners, and physician assistants under the Cross Country Locums brand as independent contractors on temporary assignments at various healthcare facilities, such as acute and non-acute care facilities, medical group practices, government facilities, and managed care organizations. The Search segment offers retained and contingent search services for physicians, healthcare executives, and other healthcare professionals, as well as recruitment process outsourcing. The company was founded in 1986 and is headquartered in Boca Raton, Florida.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Boca Raton"}, "YSY.SG": {"short_name": "Synergie SE Actions Port. EO 5", "long_name": "Synergie SE", "summary": "Synergie SE provides human resources management and development services for companies and institutions in Europe, Canada, Australia, and China. It offers temporary employment, recruitment, out-placement, social engineering, consultancy, and training services. The company serves various specialized tertiary sectors and industries, such as aeronautics and renewable energy, construction and public works, retail, information technology and IT services, and communications. Synergie SE operates through a network of 750 agencies. The company was founded in 1984 and is headquartered in Paris, France.", "currency": "EUR", "sector": "Industrials", "industry": "Staffing & Employment Services", "exchange": "STU", "market": "dr_market", "country": "France", "city": "Paris"}}