{
    "1VG.F": {
        "short_name": "DASEKE INC.  DL-,0001",
        "long_name": "Daseke, Inc.",
        "summary": "Daseke, Inc. provides transportation and logistics solutions with a focus on flatbed and specialized freight in the United States, Canada, and Mexico. It operates through two segments, Flatbed Solutions and Specialized Solutions. The company transports aircraft parts, manufacturing equipment, structural steel, pressure vessels, wind turbine blades, commercial glass, high security cargo, arms, ammunition and explosives, lumber, and building and construction materials, as well as heavy machinery, such as construction, mining, and agriculture. It also offers logistical planning and warehousing services. As of December 31, 2020, it operated 2,953 company-owned tractors and 2,099 independent owned contractors tractors; and 11,579 trailers. Daseke, Inc. was founded in 2008 and is headquartered in Addison, Texas.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Addison",
        "zipcode": "75001",
        "website": "http://www.daseke.com",
        "market_cap": "Small Cap"
    },
    "2129.HK": {
        "short_name": "LEGION CONSO",
        "long_name": "Legion Consortium Limited",
        "summary": "Legion Consortium Limited offers truck transportation, freight forwarding, value-added transportation, and related logistics services. The company was founded in 1995 and is based in Singapore.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "089053",
        "website": "http://www.legionconsortium.com",
        "market_cap": "Small Cap"
    },
    "3WB.SG": {
        "short_name": "Waberers International PLC Name",
        "long_name": "Waberer's International Nyrt.",
        "summary": "Waberer's International Nyrt. provides full truckload (FTL) transportation services in Europe. The company operates through three segments: International Transportation, Regional Contractual Logistics, and Other. Its activities include long-haul international transport of standard pallet goods, domestic transportation, and storage and distribution of dry and refrigerated goods, as well as international brokerage, and freight and other logistics services. The company also provides international FTL transportation and freight forwarding, and collective transportation services; less than truckload transportation services; warehousing and vehicle repair services to third parties; and insurance services. It operates a fleet of approximately 4,100 truck-trailers. The company was founded in 1948 and is headquartered in Budapest, Hungary.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hungary",
        "state": null,
        "city": "Budapest",
        "zipcode": "1239",
        "website": "http://www.waberers.com",
        "market_cap": "Small Cap"
    },
    "4110.SR": {
        "short_name": "Batic Investments and Logistics",
        "long_name": "Batic Investments and Logistics Company",
        "summary": "Batic Investments and Logistics Co. invests in logistic, private security, and related technologies in the Kingdom of Saudi Arabia. It provides ground and refrigerated transport. The company was founded in 1984 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11472",
        "website": "http://www.batic.com.sa",
        "market_cap": "Small Cap"
    },
    "5604.TWO": {
        "short_name": "CHUNG LIEN TRANSPORTATION CO",
        "long_name": "Chung Lien Transportation Co., Ltd",
        "summary": "Chung Lien Transportation Co., Ltd engages in the real estate rental business. Chung Lien Transportation Co., Ltd was founded in 1954 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "407",
        "website": "http://www.cltc.com.tw",
        "market_cap": "Small Cap"
    },
    "600611.SS": {
        "short_name": "DAZHONG TRANSPORTATION GROUP",
        "long_name": "Dazhong Transportation (Group) Co., Ltd.",
        "summary": "Dazhong Transportation (Group) Co., Ltd. engages in the passenger transport business in China. It provides taxi and cars rental services; mobile Internet services for travel; taxi pricing devices; various vehicle intelligent dispatching platform; GPS/GPRS vehicle equipment; and call center system, as well as is involved in the research, development, production, sales, and service of traffic information application. The company also offers inter-provincial passenger cars and chartered flights; advertisement services; financial loans; and auction services for real estate, motor vehicles, equity, materials and equipment, art, and other services. In addition, it engages in the real estate and hotel businesses; provides travel and logistics services; operates motor vehicle driving training and conference centers; and trades in used cars, as well as involved in the market management; and repair and maintenance services. The company was formerly known as Shanghai Dazhong Taxi Co., Ltd. and changed its name to Dazhong Transportation (Group) Co., Ltd. in August 1988. The company was founded in 1988 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200235",
        "website": "http://www.96822.com",
        "market_cap": "Small Cap"
    },
    "600662.SS": {
        "short_name": "SHANGHAI QIANGSHENG HOLDING CO.",
        "long_name": "Shanghai Qiangsheng Holding Co., Ltd.",
        "summary": "Shanghai Qiangsheng Holding Co., Ltd. operates taxis in China. The company operates a fleet of approximately 13,000 taxis in Shanghai. It is also involved in the rental of cars; sale of new and used cars; and the provision of car decoration and repair, and vehicle advertising services. In addition, the company engages in tourism activities; and develops commercial properties. The company was founded in 1919 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200041",
        "website": "http://www.62580000.com.cn",
        "market_cap": "Small Cap"
    },
    "603056.SS": {
        "short_name": "DEPPON LOGISTICS CO LTD",
        "long_name": "DEPPON LOGISTICS Co., LTD.",
        "summary": "DEPPON LOGISTICS Co., LTD. operates as a logistics company in China, Korea, Japan, Thailand, Singapore, Malaysia, Vietnam, and internationally. It offers less-than-truckload transportation, full truck load transportation, delivery, and warehousing management services, as well as supply chain management and cross-border services. The company was founded in 1996 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201702",
        "website": "http://www.deppon.com/newwebsite",
        "market_cap": "Small Cap"
    },
    "603223.SS": {
        "short_name": "HENGTONG LOGISTIC CO LTD",
        "long_name": "Hengtong Logistics Co., Ltd.",
        "summary": "Hengtong Logistics Co., Ltd. engages in the logistics business in China. The company is involved in the LNG and LPG logistics transportation and sales, gas station construction and operation, gasification peaking station construction and operation, gas pipeline investment operation, distributed energy development and operation, and gas industry personnel technical training businesses. It also engages in road transportation, port warehousing, shipping agency, large equipment hoisting, car rental, vehicle sales and maintenance, driving skills training, qualification training business, and agricultural machinery sales and service. In addition, the company focuses on smart logistics research and development and big data application. The company was formerly known as Longkou Hengtong Transportation Co., Ltd. and changed its name to Hengtong Logistics Co., Ltd. in December 2011. Hengtong Logistics Co., Ltd. was founded in 2007 and is based in Yantai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yantai",
        "zipcode": "265700",
        "website": "http://www.hengtonggf.com",
        "market_cap": "Small Cap"
    },
    "603569.SS": {
        "short_name": "BEIJING CHANGJIU LOGISTICS CO",
        "long_name": "Beijing Changjiu Logistics Co.,Ltd",
        "summary": "Beijing Changjiu Logistics Co.,Ltd provides supply chain logistics solutions for the automotive industry in China. The company offers specialized professional logistics planning, transportation, warehousing, distribution, and other related services. Its services include to passenger car, commercial vehicle, used car, parts, after-sale, and international logistics. The company offers its services to OEMs and distributors. Beijing Changjiu Logistics Co.,Ltd was founded in 2003 and is headquartered in Beijing, China. Beijing Changjiu Logistics Co.,Ltd is a subsidiary of Jilin Changjiu Industry Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.changjiulogistics.com.cn",
        "market_cap": "Small Cap"
    },
    "603813.SS": {
        "short_name": "GUANGDONG GENSHO LOGISTICS CO L",
        "long_name": "GuangDong GenSho Logistics Co.,LTD",
        "summary": "GuangDong GenSho Logistics Co.,LTD engages in the integrated logistics of auto parts supply chain in China. It offers warehousing management, loading and unloading transportation, and distribution and shipping services. The company was founded in 2005 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "511340",
        "website": "http://www.gsl.cc",
        "market_cap": "Small Cap"
    },
    "900903.SS": {
        "short_name": "DAZHONG TRANSPORTATION GROUP",
        "long_name": "Dazhong Transportation (Group) Co., Ltd.",
        "summary": "Dazhong Transportation (Group) Co., Ltd. engages in the passenger transport business in China. It provides taxi and cars rental services; mobile Internet services for travel; taxi pricing devices; various vehicle intelligent dispatching platform; GPS/GPRS vehicle equipment; and call center system, as well as is involved in the research, development, production, sales, and service of traffic information application. The company also offers inter-provincial passenger cars and chartered flights; advertisement services; financial loans; and auction services for real estate, motor vehicles, equity, materials and equipment, art, and other services. In addition, it engages in the real estate and hotel businesses; provides travel and logistics services; operates motor vehicle driving training and conference centers; and trades in used cars, as well as involved in the market management; and repair and maintenance services. The company was formerly known as Shanghai Dazhong Taxi Co., Ltd. and changed its name to Dazhong Transportation (Group) Co., Ltd. in August 1988. The company was founded in 1988 and is based in Shanghai, China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200235",
        "website": "http://www.96822.com",
        "market_cap": "Mid Cap"
    },
    "9039.T": {
        "short_name": "SAKAI MOVING SERVICE",
        "long_name": "Sakai Moving Service Co.,Ltd.",
        "summary": "Sakai Moving Service Co.,Ltd. provides moving transportation services in Japan. It also offers moving incidental services. The company was formerly known as Sakai Hikkoshi Center and changed its name to Sakai Moving Service Co.,Ltd. in October 1990. Sakai Moving Service Co.,Ltd. was incorporated in 1956 and is headquartered in Sakai, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sakai",
        "zipcode": "590-0823",
        "website": "http://www.hikkoshi-sakai.co.jp",
        "market_cap": "Small Cap"
    },
    "9057.T": {
        "short_name": "ENSHU TRUCK CO",
        "long_name": "Enshu Truck Co.,Ltd.",
        "summary": "Enshu Truck Co.,Ltd. provides logistics services in Japan. It is involved in the general freight vehicle and freight transportation; delivery; logistics consulting and management; supply chain management; warehousing; real estate buying and selling, brokerage, and leasing; civil engineering and construction; car maintenance; industrial waste treatment; worker dispatch; and customs clearance businesses, as well as in the research and development on information processing, and sale of software products. The company was founded in 1965 and is headquartered in Fukuroi, Japan. Enshu Truck Co.,Ltd. is a subsidiary of The Sumitomo Warehouse Co., Ltd.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuroi",
        "zipcode": "437-0046",
        "website": "http://www.enshu-truck.co.jp",
        "market_cap": "Small Cap"
    },
    "9059.T": {
        "short_name": "KANDA HOLDINGS CO LTD",
        "long_name": "Kanda Holdings Co.,Ltd.",
        "summary": "Kanda Holdings Co.,Ltd., through its subsidiaries, provides integrated logistics services in Japan and internationally. The company engages in the general freight vehicle transportation, special assortment freight forwarding, freight light and specified vehicle transportation, freight transportation, and luggage packing storage businesses. It also provides car maintenance, security, warehousing, information provision service and consulting, finance/leasing, custom clearance, and port/marine transportation services. In addition, the company is involved in the leasing, brokerage, consulting, management, and sale of real estate properties; non-life and life insurance agency businesses; industrial waste collection, transportation, and treatment activities; vehicle operation management and inspection activities, as well as maintenance contract works; software and its related equipment development contracts; and systems consulting, sales, leasing, rental, and brokerage activities. Further, the company manages dispensing pharmacies, restaurants, and parking lots; generates and sells electricity; manufactures and sells equipment, sanitary ware, etc.; and operates a car diving agency. Additionally, it engages in the civil engineering and construction planning and designing, enforcement, supervision and beauty, and cleaning of structure activities; and provides automobiles, electronic computing equipment, communication equipment, clothing, daily necessities, groceries, pharmaceuticals/quasi-drugs, cosmetics, pharmaceutical equipment, medical consumables, industry chemicals, pesticides, fuel, and air conditioning equipment, as well as imports and exports kitchen products. The company was founded in 1943 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.kanda-web.co.jp",
        "market_cap": "Small Cap"
    },
    "9063.T": {
        "short_name": "OKAYAMAKEN FREIGHT TRANSPORTATI",
        "long_name": "Okayamaken Freight Transportation Co., Ltd.",
        "summary": "Okayamaken Freight Transportation Co., Ltd. engages in the logistics and transportation business in Japan. It offers freight vehicle; and freight use transportation services through air, rail, and truck. The company also provides warehousing, air transport agency, customs clearance, industrial waste collection and transportation, and communication and database services. In addition, it offers packaging, insurance agency, and worker dispatch services; and computer information processing services, as well as develops and sells software. The company was founded in 1943 and is headquartered in Okayama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Okayama",
        "zipcode": "700-0027",
        "website": "http://www.okaken.co.jp",
        "market_cap": "Small Cap"
    },
    "9064.T": {
        "short_name": "YAMATO HOLDINGS CO LTD",
        "long_name": "Yamato Holdings Co., Ltd.",
        "summary": "Yamato Holdings Co., Ltd. provides delivery, logistics, home convenience, e-business, financial, auto works, and other related services in Japan and internationally. The company's Delivery segment offers small parcel delivery services for the general public and corporations centering on TA-Q-BIN; and value-added services, such as Cool TA-Q-BIN and TA-Q-BIN Collect. Its BIZ-Logistics segment handles logistics and other B2B distribution operations. The company's Home Convenience segment offers lifestyle support services; and installs electrical appliances for customers. Its e-Business segment provides information services for corporations, including ASP services and information system development. The company's Financial segment offers settlement and other financial services to consumers and business customers; and various settlement methods, including payment on delivery and payment by credit card. Its Autoworks segment provides trucks and other vehicles maintenance services for transport companies. The company also provides various shared services, including highway transportation and personnel placement services. Yamato Holdings Co., Ltd. was founded in 1919 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8125",
        "website": "http://www.yamato-hd.co.jp",
        "market_cap": "Mid Cap"
    },
    "9067.T": {
        "short_name": "MARUWN CORPORATION",
        "long_name": "Maruwn Corporation",
        "summary": "Maruwn Corporation provides logistics solutions in Japan and internationally. It offers international logistics services; general cargo warehouse, hazardous materials, and bonded storage services; general cargo delivery services, including truck, railway, and air transportation; and energy transportation services comprising oil/high pressure gas transportation, as well as lubricant and chemical products logistics. The company also provides chilled and frozen logistics services; distribution processing services; heavy cargo transport and installation services; industrial waste collection and transportation services; and relocation/removal services. Maruwn Corporation was founded in 1892 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0016",
        "website": "http://www.maruwn.co.jp",
        "market_cap": "Small Cap"
    },
    "9073.T": {
        "short_name": "KYOGOKU UNYU SHOJI CO",
        "long_name": "Kyogoku unyu shoji Co., Ltd",
        "summary": "Kyogoku unyu shoji Co., Ltd engages in the transportation business in Japan. Its business covers goods automated vehicle transport, cargo, petroleum-chemical-liquefied gas, harbor transport, clearance, warehouses, goods bales package, containers, shipping agency, human resources dispatch, and electric and other related businesses. Kyogoku unyu shoji Co., Ltd was founded in 1884 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0007",
        "website": "http://www.kyogoku.co.jp",
        "market_cap": "Small Cap"
    },
    "9075.T": {
        "short_name": "FUKUYAMA TRANSPORTING CO",
        "long_name": "Fukuyama Transporting Co., Ltd.",
        "summary": "Fukuyama Transporting Co., Ltd. operates as a logistics company in Japan, China, Hong Kong, Cambodia, Vietnam, Indonesia, Malaysia, and Thailand. The company offers freight transportation services using approximately 16,000 vehicles, including tractors, trailers, and trucks, as well as through sea, rail, and air sources. It also provides bonded warehouse and customs clearance services. In addition, it operates convenience stores; and offers vehicle maintenance, packaging, real estate rental, port operations, sports and recreational facilities management, personnel dispatch, security, industrial and household waste collection and disposal, printing, travel and insurance agency, products sale, and other services. The company also offers packaging, port operation, and other services. Fukuyama Transporting Co., Ltd. was founded in 1948 and is headquartered in Fukuyama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuyama",
        "zipcode": null,
        "website": "http://www.fukutsu.co.jp",
        "market_cap": "Small Cap"
    },
    "9076.T": {
        "short_name": "SEINO HOLDINGS",
        "long_name": "Seino Holdings Co., Ltd.",
        "summary": "Seino Holdings Co., Ltd. provides transportation services in Japan and internationally. The company operates through Transportation Services, Vehicle Sales, Merchandise Sales, and Real Estate Leasing Services segments. It offers timed, cash on delivery/settlement, delivery, bicycle event flight/transportation, and group services; and moving, shopping, and logistics services. The company also provides freight vehicle transportation, warehousing, air transport agency, customs clearance, international intermodal transportation services, etc. In addition, it engages in the sale of passenger vehicles and used parts; provision of vehicle inspection, and vehicle maintenance and garage services; and sale of maintenance packages and automotive coatings. Additionally, the company sells fuel, paper and paper products, and other products; and engages in the information services, housing sales, construction contract, real estate leasing, passenger transportation, and personnel services businesses. The company was formerly known as Seino Transportation Co., Ltd. Seino Holdings Co., Ltd. was founded in 1930 and is headquartered in Ogaki, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Ogaki",
        "zipcode": "503-8501",
        "website": "http://www.seino.co.jp",
        "market_cap": "Mid Cap"
    },
    "9MU.F": {
        "short_name": "MULLEN GROUP LTD",
        "long_name": "Mullen Group Ltd.",
        "summary": "Mullen Group Ltd. provides trucking and logistics services in Canada and the United States. The company operates through three segments: Less-Than-Truckload, Logistics & Warehousing, and Specialized & Industrial Services. The Less-Than-Truckload segment delivers general freight consisting of smaller shipments, packages, and parcels; and pharmaceutical and package products. The Logistics & Warehousing segment offers multimode transportation services, such as full truckload, specialized trucking, intermodal, and transload to customers through a network of terminals and transload facilities; and warehousing and distribution services. The Specialized & Industrial Services segment provides production services, such as well servicing, production fluid transportation, transportation of fluids for disposal, frac support, and industrial cleaning and turnaround services; and specialized services comprising dredging and dewatering services, large diameter pipe stockpiling and stringing services, water management, environmental services, civil construction, municipal development and emergency services, hydrovac excavation services, hydrostatic testing services to the pipeline industry and midstream sector, and transporting of oversize and overweight shipments. This segment also offers drilling and drilling related services, consisting of transportation, handling, and storage of oilfield fluids, tubulars, and drilling mud; drilling rig relocation; general oilfield hauling; well disposal facility; core drilling; setting surface casing; and conductor pipe setting services. Mullen Group Ltd. was founded in 1949 and is headquartered in Okotoks, Canada.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "AB",
        "city": "Okotoks",
        "zipcode": "T1S 2N3",
        "website": "http://www.mullen-group.com",
        "market_cap": "Small Cap"
    },
    "AHOLA.HE": {
        "short_name": "Oyj Ahola Transport Abp ser. A",
        "long_name": "Oyj Ahola Transport Abp",
        "summary": "Oyj Ahola Transport Abp provides transport services in the Nordic and Baltic countries, Poland, the Czech Republic, and Slovakia. The company offers road transport, special transport, vehicle transport, and IT and logistics services, as well as other services, such as warehousing and customs. Oyj Ahola Transport Abp was founded in 1955 and is headquartered in Kokkola, Finland.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "state": null,
        "city": "Kokkola",
        "zipcode": "67701",
        "website": "http://www.aholatransport.com",
        "market_cap": "Small Cap"
    },
    "AQY.F": {
        "short_name": "ARCBEST CORP.  DL-,01",
        "long_name": "ArcBest Corporation",
        "summary": "ArcBest Corporation provides freight transportation and integrated logistics services. It operates through three segments: Asset-Based, ArcBest, and FleetNet. The Asset-Based segment transports general commodities, such as food, textiles, apparel, furniture, appliances, chemicals, nonbulk petroleum products, rubber, plastics, metal and metal products, wood, glass, automotive parts, machinery, and miscellaneous manufactured products through less-than-truckload services. It also offers motor carrier freight transportation services to customers in Mexico through arrangements with trucking companies. The ArcBest segment provides expedite freight transportation services to commercial and government customers; premium logistics services, such as deployment of specialized equipment to meet linehaul requirements; and international freight transportation with air, ocean, and ground services. It also offers third-party transportation brokerage services by sourcing various capacity solutions, including dry van over the road and intermodal, temperature-controlled and refrigerated, flatbed, intermodal or container shipping, and specialized equipment; full-container and less-than-container load ocean transportation services; warehousing and distribution services; managed transportation services; and moving services to Â\u0091do-it-yourself' consumer, as well as provides final mile, time critical, product launch, warehousing, retail logistics, supply chain optimization, and trade show shipping services. The FleetNet segment provides roadside repair solutions and vehicle maintenance management services for commercial and private fleets through a network of third-party service providers. The company was formerly known as Arkansas Best Corporation and changed its name to ArcBest Corporation in May 2014. ArcBest Corporation was founded in 1923 and is headquartered in Fort Smith, Arkansas.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "AR",
        "city": "Fort Smith",
        "zipcode": "72916",
        "website": "http://www.arcb.com",
        "market_cap": "Mid Cap"
    },
    "ARCB": {
        "short_name": "ArcBest Corporation",
        "long_name": "ArcBest Corporation",
        "summary": "ArcBest Corporation provides freight transportation and integrated logistics services. It operates through three segments: Asset-Based, ArcBest, and FleetNet. The Asset-Based segment transports general commodities, such as food, textiles, apparel, furniture, appliances, chemicals, nonbulk petroleum products, rubber, plastics, metal and metal products, wood, glass, automotive parts, machinery, and miscellaneous manufactured products through less-than-truckload services. It also offers motor carrier freight transportation services to customers in Mexico through arrangements with trucking companies. The ArcBest segment provides expedite freight transportation services to commercial and government customers; premium logistics services, such as deployment of specialized equipment to meet linehaul requirements; and international freight transportation with air, ocean, and ground services. It also offers third-party transportation brokerage services by sourcing various capacity solutions, including dry van over the road and intermodal, temperature-controlled and refrigerated, flatbed, intermodal or container shipping, and specialized equipment; full-container and less-than-container load ocean transportation services; warehousing and distribution services; managed transportation services; and moving services to Â\u0091do-it-yourself' consumer, as well as provides final mile, time critical, product launch, warehousing, retail logistics, supply chain optimization, and trade show shipping services. The FleetNet segment provides roadside repair solutions and vehicle maintenance management services for commercial and private fleets through a network of third-party service providers. The company was formerly known as Arkansas Best Corporation and changed its name to ArcBest Corporation in May 2014. ArcBest Corporation was founded in 1923 and is headquartered in Fort Smith, Arkansas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "AR",
        "city": "Fort Smith",
        "zipcode": "72916",
        "website": "http://www.arcb.com",
        "market_cap": "Mid Cap"
    },
    "BEST": {
        "short_name": "BEST Inc.",
        "long_name": "BEST Inc.",
        "summary": "BEST Inc. operates as a smart supply chain service provider in the People's Republic of China. Its proprietary technology platform BEST Cloud enables its ecosystem participants to operate their businesses through various SaaS-based applications. The company applies its technologies to a range of applications, such as network and route optimization, swap bodies, sorting line automation, smart warehouses, and store management. It offers integrated services and solutions across the supply chain, including warehouse management, order fulfillment, express delivery, freight, and other services for multinational and corporate customers, as well as small and medium enterprises. The company also provides express delivery services; and door-to-door integrated cross-border supply chain services to and from China, including international express, less-than-truckload, fulfillment, and freight forwarding through its network, and transportation and warehouse partners. In addition, it operates real-time bidding platform to source truckload capacity from independent transportation service providers and agents; and offers online merchandise sourcing and store management services for convenience stores, as well as B2C services, such as parcel pick-up and drop-off, and bill payment services. Further, BEST Inc. provides various value-added services, including customized financial services, including fleet and equipment leases; and centralized sourcing of products and services, such as bulk procurement of trucks and accessories. The company was founded in 2007 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310013",
        "website": "http://www.best-inc.com",
        "market_cap": "Small Cap"
    },
    "CG2.F": {
        "short_name": "CELADON GRP INC.  DL-,033",
        "long_name": "Celadon Group, Inc.",
        "summary": "Celadon Group, Inc., through its subsidiaries, provides transportation services between the United States, Canada, and Mexico. It operates through three segments: Asset-Based, Asset-Light, and Equipment Leasing and Services. The Asset-Based segment offers dry van, refrigerated, and flatbed services; cross-border services between the United States and each of Mexico and Canada; intra-Mexico and intra-Canada services; contract services; regional and specialized short haul services; and rail intermodal services. The Asset-Light segment provides freight brokerage, warehousing, less-than truckload consolidation, and supply chain logistics services. The Equipment Leasing and Services segment offers tractor and trailer sales and leasing services, as well as insurance, maintenance, and other ancillary services primarily to the independent contractors and other trucking fleets. The company transports various types of freight, including tobacco, consumer goods, automotive parts, various home products and fixtures, lawn tractors and assorted equipment, light bulbs, and various parts for engines. Celadon Group, Inc. was founded in 1985 and is headquartered in Indianapolis, Indiana.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "IN",
        "city": "Indianapolis",
        "zipcode": "46235",
        "website": "http://www.celadontrucking.com",
        "market_cap": "Small Cap"
    },
    "CGIP": {
        "short_name": "CELADON GROUP",
        "long_name": "Celadon Group, Inc.",
        "summary": "Celadon Group, Inc., through its subsidiaries, provides transportation services between the United States, Canada, and Mexico. It operates through three segments: Asset-Based, Asset-Light, and Equipment Leasing and Services. The Asset-Based segment offers dry van, refrigerated, and flatbed services; cross-border services between the United States and each of Mexico and Canada; intra-Mexico and intra-Canada services; contract services; regional and specialized short haul services; and rail intermodal services. The Asset-Light segment provides freight brokerage, warehousing, less-than truckload consolidation, and supply chain logistics services. The Equipment Leasing and Services segment offers tractor and trailer sales and leasing services, as well as insurance, maintenance, and other ancillary services primarily to the independent contractors and other trucking fleets. The company transports various types of freight, including tobacco, consumer goods, automotive parts, various home products and fixtures, lawn tractors and assorted equipment, light bulbs, and various parts for engines. Celadon Group, Inc. was founded in 1985 and is headquartered in Indianapolis, Indiana.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "IN",
        "city": "Indianapolis",
        "zipcode": "46235",
        "website": "http://www.celadontrucking.com",
        "market_cap": "Small Cap"
    },
    "CV5.F": {
        "short_name": "COVENANT LOG.GRP.A DL-,01",
        "long_name": "Covenant Logistics Group, Inc.",
        "summary": "Covenant Logistics Group, Inc., together with its subsidiaries, provides transportation and logistics services in the United States. It operates through four segments: Expedited, Dedicated, Managed Freight, and Warehousing. The Expedited segment primarily provides truckload services to customers with high service freight and delivery standards, such as 1,000 miles in 22 hours or 15-minute delivery windows. The Dedicated segment provides customers with committed truckload capacity over contracted periods using equipment either owned or leased by the company. The Managed Freight segment offers brokerage services, including logistics capacity by outsourcing the carriage of customers' freight to third parties; and transport management services, such as logistics services on a contractual basis to customers who prefer to outsource their logistics needs. The Warehousing segment provides day-to-day warehouse management services to customers. The segment also provides shuttle and switching services to shuttling containers and trailers. The company also engages in used equipment sales and leasing business. It serves transportation companies, such as parcel freight forwarders, less-than-truckload carriers, and third-party logistics providers; and traditional truckload customers, including manufacturers, retailers, and food and beverage shippers. As of December 31, 2020, it operated 2,461 tractors and 5,647 trailers. The company was formerly known as Covenant Transportation Group, Inc. and changed its name to Covenant Logistics Group, Inc. in July 2020. Covenant Logistics Group, Inc. was founded in 1986 and is based in Chattanooga, Tennessee.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TN",
        "city": "Chattanooga",
        "zipcode": "37419",
        "website": "http://www.covenanttransport.com",
        "market_cap": "Small Cap"
    },
    "CVLG": {
        "short_name": "Covenant Logistics Group, Inc.",
        "long_name": "Covenant Logistics Group, Inc.",
        "summary": "Covenant Logistics Group, Inc., together with its subsidiaries, provides transportation and logistics services in the United States. It operates through four segments: Expedited, Dedicated, Managed Freight, and Warehousing. The Expedited segment primarily provides truckload services to customers with high service freight and delivery standards, such as 1,000 miles in 22 hours or 15-minute delivery windows. The Dedicated segment provides customers with committed truckload capacity over contracted periods using equipment either owned or leased by the company. The Managed Freight segment offers brokerage services, including logistics capacity by outsourcing the carriage of customers' freight to third parties; and transport management services, such as logistics services on a contractual basis to customers who prefer to outsource their logistics needs. The Warehousing segment provides day-to-day warehouse management services to customers. The segment also provides shuttle and switching services to shuttling containers and trailers. The company also engages in used equipment sales and leasing business. It serves transportation companies, such as parcel freight forwarders, less-than-truckload carriers, and third-party logistics providers; and traditional truckload customers, including manufacturers, retailers, and food and beverage shippers. As of December 31, 2020, it operated 2,461 tractors and 5,647 trailers. The company was formerly known as Covenant Transportation Group, Inc. and changed its name to Covenant Logistics Group, Inc. in July 2020. Covenant Logistics Group, Inc. was founded in 1986 and is based in Chattanooga, Tennessee.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TN",
        "city": "Chattanooga",
        "zipcode": "37419",
        "website": "http://www.covenanttransport.com",
        "market_cap": "Small Cap"
    },
    "DSKE": {
        "short_name": "Daseke, Inc.",
        "long_name": "Daseke, Inc.",
        "summary": "Daseke, Inc. provides transportation and logistics solutions with a focus on flatbed and specialized freight in the United States, Canada, and Mexico. It operates through two segments, Flatbed Solutions and Specialized Solutions. The company transports aircraft parts, manufacturing equipment, structural steel, pressure vessels, wind turbine blades, commercial glass, high security cargo, arms, ammunition and explosives, lumber, and building and construction materials, as well as heavy machinery, such as construction, mining, and agriculture. It also offers logistical planning and warehousing services. As of December 31, 2020, it operated 2,953 company-owned tractors and 2,099 independent owned contractors tractors; and 11,579 trailers. Daseke, Inc. was founded in 2008 and is headquartered in Addison, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Addison",
        "zipcode": "75001",
        "website": "http://www.daseke.com",
        "market_cap": "Small Cap"
    },
    "FUY.F": {
        "short_name": "FUKUYAMA TRANSP.",
        "long_name": "Fukuyama Transporting Co., Ltd.",
        "summary": "Fukuyama Transporting Co., Ltd. operates as a logistics company in Japan, China, Hong Kong, Cambodia, Vietnam, Indonesia, Malaysia, and Thailand. The company offers freight transportation services using approximately 16,000 vehicles, including tractors, trailers, and trucks, as well as through sea, rail, and air sources. It also provides bonded warehouse and customs clearance services. In addition, it operates convenience stores; and offers vehicle maintenance, packaging, real estate rental, port operations, sports and recreational facilities management, personnel dispatch, security, industrial and household waste collection and disposal, printing, travel and insurance agency, products sale, and other services. The company also offers packaging, port operation, and other services. Fukuyama Transporting Co., Ltd. was founded in 1948 and is headquartered in Fukuyama, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuyama",
        "zipcode": null,
        "website": "http://www.fukutsu.co.jp",
        "market_cap": "Small Cap"
    },
    "GTRK.ME": {
        "short_name": "GLOBALTRUCK MGMT",
        "long_name": "Public Joint Stock Company Globaltruck Management",
        "summary": "Public Joint Stock Company Globaltruck Management provides full truck load trucking services in Russia and internationally. It offers standard transportation services using full truck load long-haul trucks; and temperature-controlled transportation services. As of June 30, 2017, the company operated a fleet of 1,090 trucks, as well as 1,170 trailers, including 768 tents and 402 refrigerator trailers. It serves retail, fast-moving consumer goods, manufacturing, bulk, e-commerce, and parcel industry sectors. The company was founded in 2016 and is based in Moscow, Russia. Public Joint Stock Company Globaltruck Management is a subsidiary of GT Globaltruck Limited.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "105082",
        "website": "http://www.gt-m.ru",
        "market_cap": "Small Cap"
    },
    "HLX.F": {
        "short_name": "HEARTLAND EXPRESS  DL-,01",
        "long_name": "Heartland Express, Inc.",
        "summary": "Heartland Express, Inc., together with its subsidiaries, operates as a short-to-medium haul truckload carrier in the United States and Canada. It primarily provides nationwide asset-based dry van truckload service for shippers from Washington to Florida and New England to California; and temperature-controlled truckload services. The company offers its services under Heartland Express and Millis Transfer brand names. It provides traffic appliances, automotive parts, consumer products, paper products, packaged foodstuffs, and retail goods. The company principally serves retailers and manufacturers. Heartland Express, Inc. was founded in 1978 and is headquartered in North Liberty, Iowa.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "IA",
        "city": "North Liberty",
        "zipcode": "52317",
        "website": "http://www.heartlandexpress.com",
        "market_cap": "Small Cap"
    },
    "HTLD": {
        "short_name": "Heartland Express, Inc.",
        "long_name": "Heartland Express, Inc.",
        "summary": "Heartland Express, Inc., together with its subsidiaries, operates as a short-to-medium haul truckload carrier in the United States and Canada. It primarily provides nationwide asset-based dry van truckload service for shippers from Washington to Florida and New England to California; and temperature-controlled truckload services. The company offers its services under Heartland Express and Millis Transfer brand names. It provides traffic appliances, automotive parts, consumer products, paper products, packaged foodstuffs, and retail goods. The company principally serves retailers and manufacturers. Heartland Express, Inc. was founded in 1978 and is headquartered in North Liberty, Iowa.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "IA",
        "city": "North Liberty",
        "zipcode": "52317",
        "website": "http://www.heartlandexpress.com",
        "market_cap": "Small Cap"
    },
    "INPS.JK": {
        "short_name": "Indah Prakasa Sentosa Tbk.",
        "long_name": "PT. Indah Prakasa Sentosa Tbk",
        "summary": "PT Indah Prakasa Sentosa Tbk. engages in integrated logistics, transportation, distribution, and retail business in fuel, lubricant, chemical, gasses, and FMCG in Indonesia. The company operates in three segments: Agents of Fuel, Lubricant and Gas; SPPBE; and Transportation and Logistic. Its services include land transportation, warehousing, container depot, and forwarding. The company provides services for industrial and marine fuels, industrial lubricants, and industrial and retail LPG. PT Indah Prakasa Sentosa Tbk. was founded in 1960 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "14350",
        "website": "http://www.inprasegroup.co.id",
        "market_cap": "Small Cap"
    },
    "JAYA.JK": {
        "short_name": "Armada Berjaya Trans Tbk.",
        "long_name": "PT Armada Berjaya Trans Tbk",
        "summary": "PT Armada Berjaya Trans Tbk engages in the transportation business in Indonesia. It offers land transportation services, such as loose cargo and container transportation; and export and import customs clearance for cargoes. The company also provides multi-modal transport services, including freight forwarding and load consolidation, as well as storage and warehousing services. It operates a fleet of 135 vehicles. The company was formerly known as PT Armada Beton. PT Armada Berjaya Trans Tbk was founded in 2012 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "14350",
        "website": "http://www.armadaberjaya.com",
        "market_cap": "Small Cap"
    },
    "KIAT-R.BK": {
        "short_name": "KIATTANA TRANSPORT PUBLIC COMPA",
        "long_name": "Kiattana Transport Public Company Limited",
        "summary": "Kiattana Transport Public Company Limited provides transportation services in Thailand and internationally. The company offers integrated logistics services for dangerous goods, including chemicals, petroleum products, and specialty products through a fleet of approximately 700 trucks. It also provides warehousing, product sourcing, customs clearance and documentation, transportation management, and goods custodial services, as well as trades in chemicals used in industry. In addition, the company distributes and rents hardware and software accessories relating to IT systems and various types of global positioning systems; and offers rail freight services. Further, it also provides rental of cars and tanks and accessories installation services. Kiattana Transport Public Company Limited was incorporated in 1994 and is based in Nonthaburi, Thailand.",
        "currency": "THB",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Nonthaburi",
        "zipcode": "11120",
        "website": "http://www.kiattana.co.th",
        "market_cap": "Small Cap"
    },
    "KIAT.BK": {
        "short_name": "KIATTANA TRANSPORT PUBLIC COMPA",
        "long_name": "Kiattana Transport Public Company Limited",
        "summary": "Kiattana Transport Public Company Limited provides transportation services in Thailand and internationally. The company offers integrated logistics services for dangerous goods, including chemicals, petroleum products, and specialty products through a fleet of approximately 700 trucks. It also provides warehousing, product sourcing, customs clearance and documentation, transportation management, and goods custodial services, as well as trades in chemicals used in industry. In addition, the company distributes and rents hardware and software accessories relating to IT systems and various types of global positioning systems; and offers rail freight services. Further, it also provides rental of cars and tanks and accessories installation services. Kiattana Transport Public Company Limited was incorporated in 1994 and is based in Nonthaburi, Thailand.",
        "currency": "THB",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Nonthaburi",
        "zipcode": "11120",
        "website": "http://www.kiattana.co.th",
        "market_cap": "Small Cap"
    },
    "KNX": {
        "short_name": "Knight-Swift Transportation Hol",
        "long_name": "Knight-Swift Transportation Holdings Inc.",
        "summary": "Knight-Swift Transportation Holdings Inc., together with its subsidiaries, provides truckload transportation services in the United States, Mexico, and Canada. The company operates through three segments: Trucking, Logistics, and Intermodal. Its trucking services include irregular route, dedicated, refrigerated, flatbed, expedited, dry van, drayage, and cross-border transportation of various products, goods, and materials. The company also provides logistics and intermodal services, such as brokerage, intermodal, and certain logistics; freight management; and non-trucking services. In addition, it offers various support services, including repair and maintenance shop services, warranty, insurance, and equipment leasing; and trailer parts manufacturing and warehousing services, as well as engages in the driving academy activities. The company operates a total of 18,448 tractors, which comprises 16,379 company tractors and 2,069 independent contractor tractors, as well as 57,722 trailers; and 577 tractors and 10,604 intermodal containers. It serves retail, food and beverage, consumer products, paper products, transportation and logistics, housing and building, automotive, and manufacturing industries. Knight-Swift Transportation Holdings Inc. was founded in 1989 and is headquartered in Phoenix, Arizona.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85027",
        "website": "http://knight-swift.com",
        "market_cap": "Mid Cap"
    },
    "KSX.F": {
        "short_name": "KNIGHT-SWIFT TR. HLDGS A",
        "long_name": "Knight-Swift Transportation Holdings Inc.",
        "summary": "Knight-Swift Transportation Holdings Inc., together with its subsidiaries, provides truckload transportation services in the United States, Mexico, and Canada. The company operates through three segments: Trucking, Logistics, and Intermodal. Its trucking services include irregular route, dedicated, refrigerated, flatbed, expedited, dry van, drayage, and cross-border transportation of various products, goods, and materials. The company also provides logistics and intermodal services, such as brokerage, intermodal, and certain logistics; freight management; and non-trucking services. In addition, it offers various support services, including repair and maintenance shop services, warranty, insurance, and equipment leasing; and trailer parts manufacturing and warehousing services, as well as engages in the driving academy activities. The company operates a total of 18,448 tractors, which comprises 16,379 company tractors and 2,069 independent contractor tractors, as well as 57,722 trailers; and 577 tractors and 10,604 intermodal containers. It serves retail, food and beverage, consumer products, paper products, transportation and logistics, housing and building, automotive, and manufacturing industries. Knight-Swift Transportation Holdings Inc. was founded in 1989 and is headquartered in Phoenix, Arizona.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85027",
        "website": "http://knight-swift.com",
        "market_cap": "Mid Cap"
    },
    "LAU.AX": {
        "short_name": "LINDSAY AU FPO",
        "long_name": "Lindsay Australia Limited",
        "summary": "Lindsay Australia Limited, together with its subsidiaries, provides integrated transport, logistics, and rural supply services to the food processing, food service, fresh produce, rural, agriculture, and horticultural industries in Australia. It operates through Transport and Rural segments. The Transport segment is involved in the cartage of general and refrigerated products, and ancillary sales, as well as warehouse and distribution activities. The Rural segment sells and distributes a range of agricultural supply products. Lindsay Australia Limited was incorporated in 1993 and is based in Acacia Ridge, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Acacia Ridge",
        "zipcode": "4110",
        "website": "http://www.lindsayaustralia.com.au",
        "market_cap": "Small Cap"
    },
    "MRTN": {
        "short_name": "Marten Transport, Ltd.",
        "long_name": "Marten Transport, Ltd.",
        "summary": "Marten Transport, Ltd. operates as a temperature-sensitive truckload carrier for shippers in the United States, Canada, and Mexico. It operates through four segments: Truckload, Dedicated, Intermodal, and Brokerage. The Truckload segment transports food and other consumer packaged goods that require a temperature-controlled or insulated environment. The Dedicated segment offers customized transportation solutions for individual customers' requirements using temperature-controlled trailers, dry vans, and other specialized equipment. The Intermodal segment transports customers' freight utilizing its temperature-controlled trailers on railroad flatcars for portions of trips, as well as using tractors and contracted carriers. The Brokerage segment develops contractual relationships with and arranges for third-party carriers to transport freight for customers in temperature-controlled trailers and dry vans. As of December 31, 2020, the company operated a fleet of 3,331 tractors, including 3,188 company-owned tractors and 143 tractors supplied by independent contractors. Marten Transport, Ltd. was founded in 1946 and is headquartered in Mondovi, Wisconsin.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "WI",
        "city": "Mondovi",
        "zipcode": "54755",
        "website": "http://www.marten.com",
        "market_cap": "Small Cap"
    },
    "MT9.F": {
        "short_name": "MARTEN TRANSP.LTD  DL-,01",
        "long_name": "Marten Transport, Ltd.",
        "summary": "Marten Transport, Ltd. operates as a temperature-sensitive truckload carrier for shippers in the United States, Canada, and Mexico. It operates through four segments: Truckload, Dedicated, Intermodal, and Brokerage. The Truckload segment transports food and other consumer packaged goods that require a temperature-controlled or insulated environment. The Dedicated segment offers customized transportation solutions for individual customers' requirements using temperature-controlled trailers, dry vans, and other specialized equipment. The Intermodal segment transports customers' freight utilizing its temperature-controlled trailers on railroad flatcars for portions of trips, as well as using tractors and contracted carriers. The Brokerage segment develops contractual relationships with and arranges for third-party carriers to transport freight for customers in temperature-controlled trailers and dry vans. As of December 31, 2020, the company operated a fleet of 3,331 tractors, including 3,188 company-owned tractors and 143 tractors supplied by independent contractors. Marten Transport, Ltd. was founded in 1946 and is headquartered in Mondovi, Wisconsin.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "WI",
        "city": "Mondovi",
        "zipcode": "54755",
        "website": "http://www.marten.com",
        "market_cap": "Small Cap"
    },
    "MTL.TO": {
        "short_name": "MULLEN GROUP LTD.",
        "long_name": "Mullen Group Ltd.",
        "summary": "Mullen Group Ltd. provides trucking and logistics services in Canada and the United States. The company operates through three segments: Less-Than-Truckload, Logistics & Warehousing, and Specialized & Industrial Services. The Less-Than-Truckload segment delivers general freight consisting of smaller shipments, packages, and parcels; and pharmaceutical and package products. The Logistics & Warehousing segment offers multimode transportation services, such as full truckload, specialized trucking, intermodal, and transload to customers through a network of terminals and transload facilities; and warehousing and distribution services. The Specialized & Industrial Services segment provides production services, such as well servicing, production fluid transportation, transportation of fluids for disposal, frac support, and industrial cleaning and turnaround services; and specialized services comprising dredging and dewatering services, large diameter pipe stockpiling and stringing services, water management, environmental services, civil construction, municipal development and emergency services, hydrovac excavation services, hydrostatic testing services to the pipeline industry and midstream sector, and transporting of oversize and overweight shipments. This segment also offers drilling and drilling related services, consisting of transportation, handling, and storage of oilfield fluids, tubulars, and drilling mud; drilling rig relocation; general oilfield hauling; well disposal facility; core drilling; setting surface casing; and conductor pipe setting services. Mullen Group Ltd. was founded in 1949 and is headquartered in Okotoks, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Okotoks",
        "zipcode": "T1S 2N3",
        "website": "http://www.mullen-group.com",
        "market_cap": "Small Cap"
    },
    "MYFT": {
        "short_name": "MY FREIGHTWORLD TECHNOLOGIES IN",
        "long_name": "myFreightWorld Technologies, Inc.",
        "summary": "myFreightworld Technologies, Inc., a business services company, provides cloud based transportation management system (TMS) to manufacturing companies, third-party logistics managers, and transportation intermediaries in the United States and Canada. The company's TMS offers various functions, such as less-than-truckload pricing engine; electronic quoting, booking, dispatching, tracking, and tracing; freight audit and pay; interface with multiple truckload software applications; and interface with multiple small package software applications. Its services include LTL and truckload freight brokerage services. The company was formerly known as Anything Brands Online, Inc. and changed its name to myFreightworld Technologies, Inc. in February 2010. myFreightworld Technologies, Inc. is headquartered in Overland Park, Kansas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "KS",
        "city": "Overland Park",
        "zipcode": "66212",
        "website": "http://www.myfreightworld.com",
        "market_cap": "Small Cap"
    },
    "NECCLTD.NS": {
        "short_name": "NORTH EASTERN CARR",
        "long_name": "North Eastern Carrying Corporation Limited",
        "summary": "North Eastern Carrying Corporation Limited provides transportation and logistics services in India, Nepal, Bhutan, and Bangladesh. The company books small parcels, as well as full truck load, project, and over dimensional consignments. It also offers containerized movement of cargo, packing and moving, warehousing, and third party logistics and storage facilities. The company operates through a network of approximately 250 branches. The company was founded in 1984 and is based in Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Delhi",
        "zipcode": "110006",
        "website": "http://www.neccgroup.com",
        "market_cap": "Small Cap"
    },
    "NXTN": {
        "short_name": "NEXT10 INC",
        "long_name": "Next10, Inc.",
        "summary": "Next10, Inc. engages in the development, manufacture, and sale of security systems for the cargo transportation industry primarily in the United States and Canada. The company offers Â\u0091Bulldog Online Security Systems' (BOSS), which is designed to prevent cargo theft from cargo containers, tractor-trailers, cargo vans, tanker trucks, storage year containers, and other cargo transportation and storage equipment. Its products alert onsite security personnel in the event of theft or tampering; alert the driver in the event someone attempts to access the cargo; and monitors multiple roll-up and sliding doors, prevents unauthorized entry and intrusion, and alert the driver through a mobile receiver a thief attempt to enter, move, or remove items from the delivery vehicle. The company's BOSS line of products primarily include The Yard BOSS, The Road BOSS, The Tanker BOSS, Bulldogs BOSS Tracker, and Mini BOSS System. It offers its products to retail, pharmaceutical, high technology, and government markets. The company was formerly known as Bulldog Technologies, Inc. and changed its name to Next10, Inc. on March 25, 2011. Next10, Inc. was incorporated in 1998 and is based in Placentia, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Placentia",
        "zipcode": "92870",
        "website": null,
        "market_cap": "Small Cap"
    },
    "O1DF34.SA": {
        "short_name": "OLD DOMINIONDRN",
        "long_name": "Old Dominion Freight Line, Inc.",
        "summary": "Old Dominion Freight Line, Inc. operates as a less-than-truckload (LTL) motor carrier in the United States and North America. It provides regional, inter-regional, and national LTL services, including expedited transportation. The company also offers various value-added services, such as container drayage, truckload brokerage, and supply chain consulting. As of December 31, 2020, it owned 9,288 tractors, as well as operated 244 service and 42 maintenance centers. Old Dominion Freight Line, Inc. was founded in 1934 and is based in Thomasville, North Carolina.",
        "currency": "BRL",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "NC",
        "city": "Thomasville",
        "zipcode": "27360",
        "website": "http://www.odfl.com",
        "market_cap": "Large Cap"
    },
    "ODF.F": {
        "short_name": "OLD DOMIN.FR.LINE  DL-,10",
        "long_name": "Old Dominion Freight Line, Inc.",
        "summary": "Old Dominion Freight Line, Inc. operates as a less-than-truckload (LTL) motor carrier in the United States and North America. It provides regional, inter-regional, and national LTL services, including expedited transportation. The company also offers various value-added services, such as container drayage, truckload brokerage, and supply chain consulting. As of December 31, 2020, it owned 9,288 tractors, as well as operated 244 service and 42 maintenance centers. Old Dominion Freight Line, Inc. was founded in 1934 and is based in Thomasville, North Carolina.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NC",
        "city": "Thomasville",
        "zipcode": "27360",
        "website": "http://www.odfl.com",
        "market_cap": "Large Cap"
    },
    "ODFL.MX": {
        "short_name": "OLD DOMINION FREIGHT LINE INC",
        "long_name": "Old Dominion Freight Line, Inc.",
        "summary": "Old Dominion Freight Line, Inc. operates as a less-than-truckload (LTL) motor carrier in the United States and North America. It provides regional, inter-regional, and national LTL services, including expedited transportation. The company also offers various value-added services, such as container drayage, truckload brokerage, and supply chain consulting. As of December 31, 2020, it owned 9,288 tractors, as well as operated 244 service and 42 maintenance centers. Old Dominion Freight Line, Inc. was founded in 1934 and is based in Thomasville, North Carolina.",
        "currency": "MXN",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "NC",
        "city": "Thomasville",
        "zipcode": "27360",
        "website": "http://www.odfl.com",
        "market_cap": "Large Cap"
    },
    "ODFL": {
        "short_name": "Old Dominion Freight Line, Inc.",
        "long_name": "Old Dominion Freight Line, Inc.",
        "summary": "Old Dominion Freight Line, Inc. operates as a less-than-truckload (LTL) motor carrier in the United States and North America. It provides regional, inter-regional, and national LTL services, including expedited transportation. The company also offers various value-added services, such as container drayage, truckload brokerage, and supply chain consulting. As of December 31, 2020, it owned 9,288 tractors, as well as operated 244 service and 42 maintenance centers. Old Dominion Freight Line, Inc. was founded in 1934 and is based in Thomasville, North Carolina.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NC",
        "city": "Thomasville",
        "zipcode": "27360",
        "website": "http://www.odfl.com",
        "market_cap": "Large Cap"
    },
    "OLG.JO": {
        "short_name": "Onelogix Group Ltd",
        "long_name": "OneLogix Group Limited",
        "summary": "OneLogix Group Limited, together with its subsidiaries, provides logistics and related services in South Africa. It operates through three segments: Abnormal Logistics, Primary Products Logistics, and Other. The company offers project and abnormal freight logistics; local and cross-border auto-logistics; logistics services for solvents, acids, food grade products, liquid petroleum, gas, cryogenics, and dry bulk products; general freight and commodities movement services; refrigerated logistics services for agricultural products, such as fruit and vegetable market; and transport vehicles, including new commercial vehicles through a fleet of 300 trucks and trailers. It also provides import and export warehouse handling and clearing and forwarding services; distributes agricultural inputs and final products; repairs passenger vehicles, commercial vehicles, and structural chassis; and rebuilds cabs, as well as offers spray painting services. In addition, the company offers logistics related accounting software. OneLogix Group Limited was founded in 2000 and is headquartered in Kempton Park, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Kempton Park",
        "zipcode": "1619",
        "website": "http://www.onelogix.com",
        "market_cap": null
    },
    "PATI": {
        "short_name": "Patriot Transportation Holding,",
        "long_name": "Patriot Transportation Holding, Inc.",
        "summary": "Patriot Transportation Holding, Inc., through its subsidiary, Florida Rock & Tank Lines, Inc., transports petroleum and other liquids, and dry bulk commodities. The company is involved in hauling petroleum related products, including gas and diesel fuel; and dry bulk commodities, such as cement, lime, and various industrial powder products, as well as liquid chemicals. Its petroleum clients include convenience stores and hypermarket accounts, fuel wholesalers, and oil companies; and dry bulk and chemical customers comprise industrial companies, such as cement and concrete accounts, as well as product distribution companies. As of September 30, 2020, the company operated a fleet of 320 company tractors, 18 owner operators, and 444 trailers from its 18 terminals and 6 satellite locations in Florida, Georgia, Alabama, and Tennessee. Patriot Transportation Holding, Inc. is headquartered in Jacksonville, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Jacksonville",
        "zipcode": "32202",
        "website": "http://www.patriottrans.com",
        "market_cap": "Small Cap"
    },
    "PTSI": {
        "short_name": "P.A.M. Transportation Services,",
        "long_name": "P.A.M. Transportation Services, Inc.",
        "summary": "P.A.M. Transportation Services, Inc., through its subsidiaries, operates as a truckload transportation and logistics company in the United States, Mexico, and Canada. The company is involved in the transportation of general commodities. Its freight primarily consists of automotive parts; expedited goods; consumer goods, such as general retail store merchandise; and manufactured goods, including heating and air conditioning units. The company also provides brokerage and logistics services. As of December 31, 2020, it operated a fleet of 2,013 trucks, which included 355 independent contractor trucks; and 6,994 trailers. The company was founded in 1980 and is headquartered in Tontitown, Arkansas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "state": "AR",
        "city": "Tontitown",
        "zipcode": "72770",
        "website": "http://www.pamtransport.com",
        "market_cap": "Small Cap"
    },
    "PURA.JK": {
        "short_name": "Putra Rajawali Kencana Tbk.",
        "long_name": "PT Putra Rajawali Kencana Tbk",
        "summary": "PT Putra Rajawali Kencana Tbk operates as an intra logistic and multimode company in Indonesia and internationally. The company provides transportation management services, including the business of sending and/or packing of goods in large volumes through railroad, land, sea, and air transportation. It also offers multimodal transportation services comprising the transportation of goods using various modes of transportation. In addition, the company provides additional services in the form of freight forwarding, warehousing, cargo consolidation, cargo space, and customs clearance for multimodal transportation; rents and leases cars, buses, and trucks without option rights; and leases cars, trucks, and tow trucks without operational rights. Further, it trades in used cars consisting of special cars, such as ambulances, caravans, microbus, fire engines, etc.; and lorries, trailers, semi-trailers, and various other motorized transport vehicles. The company was founded in 2012 and is headquartered in Surabaya, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Surabaya",
        "zipcode": "60292",
        "website": "http://puratrans.com",
        "market_cap": "Small Cap"
    },
    "RRTS": {
        "short_name": "ROADRUNNER TRANSPORTATON SYSTMS",
        "long_name": "Roadrunner Transportation Systems, Inc.",
        "summary": "Roadrunner Transportation Systems, Inc. provides asset-right transportation and asset-light logistics services. It operates through four segments: Ascent Transportation Management (Ascent TM), Ascent On-Demand (Ascent OD), Less-than-Truckload (LTL), and Truckload (TL). The company offers domestic freight management solutions, including asset-backed truckload brokerage, specialized/heavy haul, LTL shipment execution, LTL carrier rate negotiations, access to its transportation management system, and freight audit/payment. It also provides air and ground expedite services for the transportation of automotive and industrial parts, paper products, and steel, as well as frozen and refrigerated foods, including dairy, poultry and meat, and consumers products, such as foods and beverages. In addition, the company arranges the pickup and delivery of TL freight through its 30 TL service centers in the United States; offers dry van truckload, temperature-controlled truckload, and logistics and warehouse services; and provides pickup, consolidation, linehaul, deconsolidation, and delivery of LTL shipments in the United States and Canada through 27 LTL service centers and approximately 140 third-party delivery agents. Further, the company provides international air and ocean freight forwarding, customs brokerage, regulatory compliance, project and order management, and retail consolidation services. It operates through a network of independent brokerage agents, direct sales force, company brokers, and commissioned sales representatives. The company offers its services under the Roadrunner and Ascent Global Logistics brands. Roadrunner Transportation Systems, Inc. was incorporated in 2005 and is headquartered in Downers Grove, Illinois.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Downers Grove",
        "zipcode": "60515",
        "website": "http://www.rrts.com",
        "market_cap": "Small Cap"
    },
    "SAIA": {
        "short_name": "Saia, Inc.",
        "long_name": "Saia, Inc.",
        "summary": "Saia, Inc., through its subsidiaries, operates as a transportation company in North America. The company provides less-than-truckload services for shipments between 100 and 10,000 pounds; and other value-added services, including non-asset truckload, expedited, and logistics services. As of December 31, 2020, it operated 174 owned and leased facilities; and owned approximately 5,700 tractors and 17,400 trailers. The company was formerly known as SCS Transportation, Inc. and changed its name to Saia, Inc. in July 2006. Saia, Inc. was founded in 1924 and is headquartered in Johns Creek, Georgia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Johns Creek",
        "zipcode": "30097",
        "website": "http://www.saia.com",
        "market_cap": "Mid Cap"
    },
    "SDMU.JK": {
        "short_name": "Sidomulyo Selaras Tbk.",
        "long_name": "PT Sidomulyo Selaras Tbk",
        "summary": "PT Sidomulyo Selaras Tbk engages in the transportation and storage of toxic and hazardous chemicals in Indonesia. It primarily transports chemicals, oil, and gas. The company also engages in buying and selling spare parts of trucking vehicles, as well as in the customs clearance, isotank washing and repair, and isotank rental activities. It primarily serves companies operating in the upstream chemical industry that produce basic chemicals for domestic and export markets. The company was founded in 1993 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10610",
        "website": "http://www.sidomulyo.com",
        "market_cap": "Small Cap"
    },
    "SEOTF": {
        "short_name": "SEINO HOLDINGS",
        "long_name": "Seino Holdings Co., Ltd.",
        "summary": "Seino Holdings Co., Ltd. provides transportation services in Japan and internationally. The company operates through Transportation Services, Vehicle Sales, Merchandise Sales, and Real Estate Leasing Services segments. It offers timed, cash on delivery/settlement, delivery, bicycle event flight/transportation, and group services; and moving, shopping, and logistics services. The company also provides freight vehicle transportation, warehousing, air transport agency, customs clearance, international intermodal transportation services, etc. In addition, it engages in the sale of passenger vehicles and used parts; provision of vehicle inspection, and vehicle maintenance and garage services; and sale of maintenance packages and automotive coatings. Additionally, the company sells fuel, paper and paper products, and other products; and engages in the information services, housing sales, construction contract, real estate leasing, passenger transportation, and personnel services businesses. The company was formerly known as Seino Transportation Co., Ltd. Seino Holdings Co., Ltd. was founded in 1930 and is headquartered in Ogaki, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Ogaki",
        "zipcode": "503-8501",
        "website": "http://www.seino.co.jp",
        "market_cap": "Mid Cap"
    },
    "SNDR": {
        "short_name": "Schneider National, Inc.",
        "long_name": "Schneider National, Inc.",
        "summary": "Schneider National, Inc., a surface transportation and logistics solutions company, provides truckload, intermodal, and logistics services in North America. Its Truckload segment provides standard long-haul and regional shipping services through dry van, bulk, temperature-controlled, and flat-bed equipment, as well as customized solutions for time-sensitive loads. The company's Intermodal segment offers door-to-door container on flat car services, including rail and dray transportation through containers, chassis, and trucks. Its Logistics segment provides freight brokerage, supply chain, and import/export services; value-added services to manage and move its customers' freight; and trans-loading and warehousing services. Schneider National, Inc. also leases equipment, such as trucks to owner-operators; and provides insurance for the company drivers and owner-operators. The company was founded in 1935 and is headquartered in Green Bay, Wisconsin.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "WI",
        "city": "Green Bay",
        "zipcode": "54313",
        "website": "http://www.schneider.com",
        "market_cap": "Mid Cap"
    },
    "SNIA.F": {
        "short_name": "SCHNEIDER NATL.INC. CL.B",
        "long_name": "Schneider National, Inc.",
        "summary": "Schneider National, Inc., a surface transportation and logistics solutions company, provides truckload, intermodal, and logistics services in North America. Its Truckload segment provides standard long-haul and regional shipping services through dry van, bulk, temperature-controlled, and flat-bed equipment, as well as customized solutions for time-sensitive loads. The company's Intermodal segment offers door-to-door container on flat car services, including rail and dray transportation through containers, chassis, and trucks. Its Logistics segment provides freight brokerage, supply chain, and import/export services; value-added services to manage and move its customers' freight; and trans-loading and warehousing services. Schneider National, Inc. also leases equipment, such as trucks to owner-operators; and provides insurance for the company drivers and owner-operators. The company was founded in 1935 and is headquartered in Green Bay, Wisconsin.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "WI",
        "city": "Green Bay",
        "zipcode": "54313",
        "website": "http://www.schneider.com",
        "market_cap": "Mid Cap"
    },
    "SQR.F": {
        "short_name": "SAIA INC.  DL-,01",
        "long_name": "Saia, Inc.",
        "summary": "Saia, Inc., through its subsidiaries, operates as a transportation company in North America. The company provides less-than-truckload services for shipments between 100 and 10,000 pounds; and other value-added services, including non-asset truckload, expedited, and logistics services. As of December 31, 2020, it operated 174 owned and leased facilities; and owned approximately 5,700 tractors and 17,400 trailers. The company was formerly known as SCS Transportation, Inc. and changed its name to Saia, Inc. in July 2006. Saia, Inc. was founded in 1924 and is headquartered in Johns Creek, Georgia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "GA",
        "city": "Johns Creek",
        "zipcode": "30097",
        "website": "http://www.saia.com",
        "market_cap": "Mid Cap"
    },
    "TEAH": {
        "short_name": "WORRY FREE TEA HOUSE HOLDINGS C",
        "long_name": "Worry Free Tea House Holdings Company",
        "summary": "DRS Inc. operates as a drywall subcontractor, drywall scrapper, drywall recycler, and hauler in the states of Washington and Oregon, the United States. The company involves in the collection and removal of drywall scrap from the job sites, and other rubbish from construction sites for disposal and recycling; stocks and provides materials comprising sheetrock; finishes drywall surface with taping and mudding process; and applies a coat of primer and texturing of the surface. It works primarily in the residential sector and provides drywall services for single and multi-family housing, as well as new construction and remodels. The company was founded in 2006 and is based in Renton, Washington.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WA",
        "city": "Renton",
        "zipcode": "98056",
        "website": null,
        "market_cap": "Small Cap"
    },
    "TFII": {
        "short_name": "TFI International Inc.",
        "long_name": "TFI International Inc.",
        "summary": "TFI International Inc. provides transportation and logistics services in the United States, Canada, and Mexico. The company operates through Package and Courier, Less-Than-Truckload (LTL), Truckload (TL), and Logistics segments. The Package and Courier segment engages in the pickup, transport, and delivery of items. The LTL segment is involved in the pickup, consolidation, transportation, and delivery of smaller loads. The TL segment offers expedited transportation, flatbed, tank container, and dedicated services, as well as TL brokerage services. This segment carries full loads directly from the customer to the destination using a closed van or specialized equipment. The Logistics segment provides asset-light logistics services, including brokerage, freight forwarding, and transportation management, as well as small package parcel delivery. As of December 31, 2020, the company had 7,867 tractors, 25,520 trailers, and 9,926 independent contractors. The company was formerly known as TransForce Inc. and changed its name to TFI International Inc. in December 2016. TFI International Inc. is headquartered in Saint-Laurent, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Canada",
        "state": "QC",
        "city": "Saint-Laurent",
        "zipcode": "H4S 1Z6",
        "website": "http://www.tfiintl.com",
        "market_cap": "Mid Cap"
    },
    "TFII.TO": {
        "short_name": "TFI INTERNATIONAL INC",
        "long_name": "TFI International Inc.",
        "summary": "TFI International Inc. provides transportation and logistics services in the United States, Canada, and Mexico. The company operates through Package and Courier, Less-Than-Truckload (LTL), Truckload (TL), and Logistics segments. The Package and Courier segment engages in the pickup, transport, and delivery of items. The LTL segment is involved in the pickup, consolidation, transportation, and delivery of smaller loads. The TL segment offers expedited transportation, flatbed, tank container, and dedicated services, as well as TL brokerage services. This segment carries full loads directly from the customer to the destination using a closed van or specialized equipment. The Logistics segment provides asset-light logistics services, including brokerage, freight forwarding, and transportation management, as well as small package parcel delivery. As of December 31, 2020, the company had 7,867 tractors, 25,520 trailers, and 9,926 independent contractors. The company was formerly known as TransForce Inc. and changed its name to TFI International Inc. in December 2016. TFI International Inc. is headquartered in Saint-Laurent, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Saint-Laurent",
        "zipcode": "H4S 1Z6",
        "website": "http://www.tfiintl.com",
        "market_cap": "Mid Cap"
    },
    "TGMA3.SA": {
        "short_name": "TEGMA       ON      NM",
        "long_name": "Tegma Gestão Logística S.A.",
        "summary": "Tegma GestÃ£o LogÃ­stica S.A. provides logistics, transportation, and warehouse services in Brazil. It operates through two divisions, Automotive Logistics and Integrated Logistics. The Automotive Logistics division engages in the transportation of vehicles, and management of yard; transfer and distribution of zero-kilometer, new, and used vehicle; storage of vehicles; and provision of pre delivery inspection, and center for automotive/multi-brand services. The Integrated Logistics division provides transportation, storage, inventory management, and similar services. It serves automotive, consumer goods, chemicals, and household appliances sectors. The company was founded in 1969 and is headquartered in SÃ£o Bernardo do Campo, Brazil.",
        "currency": "BRL",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "state": "SP",
        "city": "SÃ£o Bernardo do Campo",
        "zipcode": null,
        "website": "http://www.tegma.com.br",
        "market_cap": "Small Cap"
    },
    "TLSS": {
        "short_name": "TRANSPORTATION & LOGISTICS SYS ",
        "long_name": "Transportation and Logistics Systems, Inc.",
        "summary": "Transportation and Logistics Systems, Inc., through its subsidiaries, provides tractor-trailer and box truck deliveries of packages on the east coast of the United States. The company offers package delivery services primarily in New York, New Jersey, Pennsylvania, Georgia, Florida, Ohio, and Tennessee, principally for Amazon and its customers, and for other customers. It also provides various logistics services to Amazon and storage solutions for Amazon's customers with limited storage facilities. The company is based in Jupiter, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Jupiter",
        "zipcode": "33458",
        "website": "http://www.tlss-inc.com",
        "market_cap": "Small Cap"
    },
    "TRUK.JK": {
        "short_name": "Guna Timur Raya Tbk.",
        "long_name": "PT Guna Timur Raya Tbk",
        "summary": "PT Guna Timur Raya Tbk provides land transportation services for customers worldwide. It operates trucks. The company was formerly known as PT Timur Jaya and changed its name to PT Guna Timur Raya Tbk in July 1980. The company was founded in 1980 and is based in Jakarta, Indonesia. PT Guna Timur Raya Tbk is a subsidiary of PT Guna Makmur Raya.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "14430",
        "website": "http://gunatimurraya.com",
        "market_cap": "Small Cap"
    },
    "TSP": {
        "short_name": "TuSimple Holdings Inc.",
        "long_name": "TuSimple Holdings Inc.",
        "summary": "TuSimple Holdings Inc., an autonomous technology company, develops autonomous technology specifically designed for semi-trucks in the United States and internationally. It intends to produce a line of purpose-built (Level 4) L4 autonomous semi-trucks for the North American market. The company operates its Autonomous Freight Network (AFN) L4 autonomous semi-trucks equipped with its autonomous driving technology. Its AFN is an ecosystem that consists of L4 autonomous semi-trucks, high definition digital mapped routes, terminals, and TuSimple Connect, a cloud-based autonomous operations oversight system. The company was founded in 2015 and is based in San Diego, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Diego",
        "zipcode": "92122",
        "website": "http://www.tusimple.com",
        "market_cap": "Mid Cap"
    },
    "ULH": {
        "short_name": "Universal Logistics Holdings, I",
        "long_name": "Universal Logistics Holdings, Inc.",
        "summary": "Universal Logistics Holdings, Inc. provides transportation and logistics solutions in the United States, Mexico, Canada, and Colombia. It offers truckload services, which include dry van, flatbed, heavy-haul, and refrigerated operations; domestic and international freight forwarding, and customs brokerage services; and final mile and ground expedite services. The company transports various commodities comprising automotive parts, machinery, building materials, paper, food, consumer goods, furniture, steel, and other metals. It also provides value-added services for individual customer requirements, including material handling, consolidation, sequencing, sub-assembly, cross-dock, kitting, repacking, warehousing, and returnable container management; and intermodal support services comprising short-to-medium distance delivery of steamship and rail truck containers between the port or railhead, and the customer and drayage services. Universal Logistics Holdings, Inc. serves automotive, steel, oil and gas, alternative energy, and manufacturing industries, as well as other transportation companies who aggregate loads from various shippers. The company was formerly known as Universal Truckload Services, Inc. and changed its name to Universal Logistics Holdings, Inc. in April 2016. Universal Logistics Holdings, Inc. was founded in 1932 and is headquartered in Warren, Michigan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "MI",
        "city": "Warren",
        "zipcode": "48089",
        "website": "http://www.universallogistics.com",
        "market_cap": "Small Cap"
    },
    "USAK": {
        "short_name": "USA Truck, Inc.",
        "long_name": "USA Truck, Inc.",
        "summary": "USA Truck, Inc. operates as a truckload carrier in the United States, Mexico, and Canada. The company operates through two segments, Trucking and USAT Logistics. The Trucking segment offers truckload motor carrier services as a medium-haul common and contract carrier; and freight services. The USAT Logistics segment provides freight brokerage, logistics, and rail intermodal services. As of December 31, 2020, the company operated a fleet of 2,065 tractors, which included 628 independent contractor tractors; and 6,263 trailers. USA Truck, Inc. was founded in 1983 and is headquartered in Van Buren, Arkansas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "AR",
        "city": "Van Buren",
        "zipcode": "72956",
        "website": "http://www.usa-truck.com",
        "market_cap": "Small Cap"
    },
    "USX": {
        "short_name": "U.S. Xpress Enterprises, Inc.",
        "long_name": "U.S. Xpress Enterprises, Inc.",
        "summary": "U.S. Xpress Enterprises, Inc. operates as an asset-based truckload carrier providing services primarily in the United States. It operates through two segments, Truckload and Brokerage. The Truckload segment offers over-the-road and contract services. The Brokerage segment provides non-asset-based freight brokerage services. The company offers customers a portfolio of services using its asset-based truckload fleet and third-party carriers through its non-asset-based truck brokerage network. As of December 31, 2020, its fleet consisted of approximately 6,500 tractors and 13,000 trailers, including 1,800 tractors provided by independent contractors. U.S. Xpress Enterprises, Inc. was founded in 1985 and is headquartered in Chattanooga, Tennessee.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TN",
        "city": "Chattanooga",
        "zipcode": "37421",
        "website": "http://www.usxpress.com",
        "market_cap": "Small Cap"
    },
    "VLE.JO": {
        "short_name": "Value Group Ltd",
        "long_name": "Value Group Limited",
        "summary": "Value Group Limited, through its subsidiaries, provides supply chain solutions in South Africa. It operates through General Distribution, Truck Rental and Other, and Retail Logistics segments. The company offers distribution services, including express courier, breakbulk, retail delivery, DC delivery, front door delivery, home delivery, informal trade, forecourts, dangerous goods, over-border, cross-border, and reverse logistics services; and warehousing services, such as dedicated, multi-principal, transshipment, bonded, dangerous goods, managed solution, and value added services. It is also involved in the fleet management; materials handling and commercial vehicle rental and leasing; clearing and forwarding activities; and wholesale of various fast moving consumer goods to the convenience, formal, and informal sectors, which primarily includes independent traders, fuel forecourts, and small retailers. In addition, the company offers import and export services, such as international courier, container haulage, and intermodal services; and materials handling services that include rentals, FMLs, outright purchases, repairs and maintenance, spares accessories, and tires; transport services, which include truck rental, refrigerated fleet, film fleet, mine spec, FML, linehaul, and dedicated distribution services; and truck, trailer, and forklift repairs and maintenance services, as well as panel beating and branding services. It serves automotive, electronics, chemical, textile, packaging, mining, construction, telecommunications, and pharmaceutical industries. Value Group Limited was founded in 1981 and is headquartered in Isando, South Africa. Value Group Limited is a subsidiary of Lougot Property Investments (Pty) Ltd.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Isando",
        "zipcode": "1600",
        "website": "http://www.value.co.za",
        "market_cap": null
    },
    "VRLLOG.NS": {
        "short_name": "VRL LOGISTICS LTD",
        "long_name": "VRL Logistics Limited",
        "summary": "VRL Logistics Limited operates as a logistics and transport company. The company operates through four segments: Goods Transport, Bus Operations, Sale of Power, and Transport of Passengers by Air. The Goods Transport segment offers services for the transportation of goods using a range of road transportation solutions, including less than full truck load and full truck load for customers across 22 states and 5 union territories in India. This segment also provides courier business for the transportation of small parcels and documents through multi model solutions. The Bus Operations segment provides services of transportation solutions through buses in the states of Karnataka, Maharashtra, Andhra Pradesh, Tamil Nadu, Gujarat, Rajasthan, and Goa through its fleet of approximately 362 buses/coaches. The Sale of Power segment operates a wind farm that consists of wind turbine generators with a capacity of 1.25 MW. The Transport of Passengers by Air segment offers services for the transportation of passengers by air to the individuals and corporate representatives. The company was formerly known as Vijayanand Roadlines Ltd. and changed its name to VRL Logistics Limited in August 2006. VRL Logistics Limited was founded in 1976 and is based in Hubli, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hubli",
        "zipcode": "580029",
        "website": "http://www.vrllogistics.com",
        "market_cap": "Small Cap"
    },
    "WE1.F": {
        "short_name": "WERNER ENTERPR.  DL -,01",
        "long_name": "Werner Enterprises, Inc.",
        "summary": "Werner Enterprises, Inc., a transportation and logistics company, engages in transporting truckload shipments of general commodities in interstate and intrastate commerce in the United States, Mexico, and internationally. It operates in two segments, Truckload Transportation Services and Werner Logistics. The Truckload Transportation Services segment operates medium-to-long-haul van fleet that transports various consumer nondurable products and other commodities in truckload quantities using dry van trailers; the expedited fleet, which offers time-sensitive truckload services using driver teams; regional short-haul fleet that provides comparable truckload van service in the United States; and temperature controlled fleet, which offers truckload services for temperature sensitive products using temperature-controlled trailers. It transports retail store merchandise, consumer products, food and beverage products, and manufactured products. The Werner Logistics segment provides non-asset-based transportation and logistics services, including truck brokerage; logistics management services and solutions; rail transportation through alliances with rail and drayage providers; management of shipments from origin to destination using a combination of air, ocean, truck, and rail transportation modes; and home and business deliveries of large or heavy items using liftgate straight truck. As of December 31, 2020, the company had a fleet of 7,830 trucks, which included 7,390 company-operated, as well as 440 owned and operated by independent contractors; 24,400 company-owned trailers that comprised dry vans, flatbeds, and temperature-controlled and other specialized trailers; and 31 intermodal drayage trucks. Werner Enterprises, Inc. was founded in 1956 and is headquartered in Omaha, Nebraska.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NE",
        "city": "Omaha",
        "zipcode": "68145-0308",
        "website": "http://www.werner.com",
        "market_cap": "Mid Cap"
    },
    "WERN": {
        "short_name": "Werner Enterprises, Inc.",
        "long_name": "Werner Enterprises, Inc.",
        "summary": "Werner Enterprises, Inc., a transportation and logistics company, engages in transporting truckload shipments of general commodities in interstate and intrastate commerce in the United States, Mexico, and internationally. It operates in two segments, Truckload Transportation Services and Werner Logistics. The Truckload Transportation Services segment operates medium-to-long-haul van fleet that transports various consumer nondurable products and other commodities in truckload quantities using dry van trailers; the expedited fleet, which offers time-sensitive truckload services using driver teams; regional short-haul fleet that provides comparable truckload van service in the United States; and temperature controlled fleet, which offers truckload services for temperature sensitive products using temperature-controlled trailers. It transports retail store merchandise, consumer products, food and beverage products, and manufactured products. The Werner Logistics segment provides non-asset-based transportation and logistics services, including truck brokerage; logistics management services and solutions; rail transportation through alliances with rail and drayage providers; management of shipments from origin to destination using a combination of air, ocean, truck, and rail transportation modes; and home and business deliveries of large or heavy items using liftgate straight truck. As of December 31, 2020, the company had a fleet of 7,830 trucks, which included 7,390 company-operated, as well as 440 owned and operated by independent contractors; 24,400 company-owned trailers that comprised dry vans, flatbeds, and temperature-controlled and other specialized trailers; and 31 intermodal drayage trucks. Werner Enterprises, Inc. was founded in 1956 and is headquartered in Omaha, Nebraska.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NE",
        "city": "Omaha",
        "zipcode": "68145-0308",
        "website": "http://www.werner.com",
        "market_cap": "Mid Cap"
    },
    "XSE.F": {
        "short_name": "SEINO HLDGS CO.LTD.",
        "long_name": "Seino Holdings Co., Ltd.",
        "summary": "Seino Holdings Co., Ltd. provides transportation services in Japan and internationally. The company operates through Transportation Services, Vehicle Sales, Merchandise Sales, and Real Estate Leasing Services segments. It offers timed, cash on delivery/settlement, delivery, bicycle event flight/transportation, and group services; and moving, shopping, and logistics services. The company also provides freight vehicle transportation, warehousing, air transport agency, customs clearance, international intermodal transportation services, etc. In addition, it engages in the sale of passenger vehicles and used parts; provision of vehicle inspection, and vehicle maintenance and garage services; and sale of maintenance packages and automotive coatings. Additionally, the company sells fuel, paper and paper products, and other products; and engages in the information services, housing sales, construction contract, real estate leasing, passenger transportation, and personnel services businesses. The company was formerly known as Seino Transportation Co., Ltd. Seino Holdings Co., Ltd. was founded in 1930 and is headquartered in Ogaki, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Ogaki",
        "zipcode": "503-8501",
        "website": "http://www.seino.co.jp",
        "market_cap": "Mid Cap"
    },
    "YATRY": {
        "short_name": "YAMATO HOLDINGS CO LTD",
        "long_name": "Yamato Holdings Co., Ltd.",
        "summary": "Yamato Holdings Co., Ltd. provides delivery, logistics, home convenience, e-business, financial, auto works, and other related services in Japan and internationally. The company's Delivery segment offers small parcel delivery services for the general public and corporations centering on TA-Q-BIN; and value-added services, such as Cool TA-Q-BIN and TA-Q-BIN Collect. Its BIZ-Logistics segment handles logistics and other B2B distribution operations. The company's Home Convenience segment offers lifestyle support services; and installs electrical appliances for customers. Its e-Business segment provides information services for corporations, including ASP services and information system development. The company's Financial segment offers settlement and other financial services to consumers and business customers; and various settlement methods, including payment on delivery and payment by credit card. Its Autoworks segment provides trucks and other vehicles maintenance services for transport companies. The company also provides various shared services, including highway transportation and personnel placement services. Yamato Holdings Co., Ltd. was founded in 1919 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8125",
        "website": "http://www.yamato-hd.co.jp",
        "market_cap": "Mid Cap"
    },
    "YEL.F": {
        "short_name": "YELLOW CORP.  DL ,-01",
        "long_name": "Yellow Corporation",
        "summary": "Yellow Corporation, through its subsidiaries, provides a range of transportation services primarily in North America. It primarily offers less-than-truckload (LTL) shipments and supply chain solutions. The company provides various services to transport industrial, commercial, and retail goods; next-day ground services; customer-specific logistics solutions, including truckload, residential, and warehouse solutions. It also offers specialized services, such as guaranteed expedited, time-specific delivery, cross-border, coast-to-coast air delivery, exhibit, product return, temperature-sensitive shipment protection, and government material shipment services. In addition, the company provides consolidation and distribution, reverse logistics, and residential white glove services. As of December 31, 2020, it had a fleet of approximately 13,500 tractors comprising 10,400 owned and 3,100 leased tractors; and 41,900 trailers consisting of 29,600 owned and 12,300 leased trailers. The company was formerly known as YRC Worldwide Inc. and changed its name to Yellow Corporation in February 2021. Yellow Corporation was founded in 1924 and is headquartered in Overland Park, Kansas.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "KS",
        "city": "Overland Park",
        "zipcode": "66211",
        "website": "http://www.myyellow.com",
        "market_cap": "Small Cap"
    },
    "YELL": {
        "short_name": "Yellow Corporation",
        "long_name": "Yellow Corporation",
        "summary": "Yellow Corporation, through its subsidiaries, provides a range of transportation services primarily in North America. It primarily offers less-than-truckload (LTL) shipments and supply chain solutions. The company provides various services to transport industrial, commercial, and retail goods; next-day ground services; customer-specific logistics solutions, including truckload, residential, and warehouse solutions. It also offers specialized services, such as guaranteed expedited, time-specific delivery, cross-border, coast-to-coast air delivery, exhibit, product return, temperature-sensitive shipment protection, and government material shipment services. In addition, the company provides consolidation and distribution, reverse logistics, and residential white glove services. As of December 31, 2020, it had a fleet of approximately 13,500 tractors comprising 10,400 owned and 3,100 leased tractors; and 41,900 trailers consisting of 29,600 owned and 12,300 leased trailers. The company was formerly known as YRC Worldwide Inc. and changed its name to Yellow Corporation in February 2021. Yellow Corporation was founded in 1924 and is headquartered in Overland Park, Kansas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "KS",
        "city": "Overland Park",
        "zipcode": "66211",
        "website": "http://www.myyellow.com",
        "market_cap": "Small Cap"
    },
    "YGMZ": {
        "short_name": "MingZhu Logistics Holdings Limi",
        "long_name": "MingZhu Logistics Holdings Limited",
        "summary": "MingZhu Logistics Holdings Limited provides trucking and delivery services using its truckload fleet and subcontractors in the People's Republic of China. The company serves sizeable logistics companies, freight forwarders, and warehouse operators. As of March 5, 2021, it operated a truckload fleet with 114 tractors and 76 trailers. MingZhu Logistics Holdings Limited was founded was founded in 2002 and is based in Shenzhen, China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NCM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518081",
        "website": "http://www.szygmz.com",
        "market_cap": "Small Cap"
    },
    "YTT.F": {
        "short_name": "YAMATO HLDGS CO.LTD.",
        "long_name": "Yamato Holdings Co., Ltd.",
        "summary": "Yamato Holdings Co., Ltd. provides delivery, logistics, home convenience, e-business, financial, auto works, and other related services in Japan and internationally. The company's Delivery segment offers small parcel delivery services for the general public and corporations centering on TA-Q-BIN; and value-added services, such as Cool TA-Q-BIN and TA-Q-BIN Collect. Its BIZ-Logistics segment handles logistics and other B2B distribution operations. The company's Home Convenience segment offers lifestyle support services; and installs electrical appliances for customers. Its e-Business segment provides information services for corporations, including ASP services and information system development. The company's Financial segment offers settlement and other financial services to consumers and business customers; and various settlement methods, including payment on delivery and payment by credit card. Its Autoworks segment provides trucks and other vehicles maintenance services for transport companies. The company also provides various shared services, including highway transportation and personnel placement services. Yamato Holdings Co., Ltd. was founded in 1919 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8125",
        "website": "http://www.yamato-hd.co.jp",
        "market_cap": "Mid Cap"
    }
}