{
  "ALEMK.BR": {
    "city": "Brussels",
    "country": "Belgium",
    "currency": "EUR",
    "exchange": "BRU",
    "industry": "Advertising Agencies",
    "long_name": "Emakina Group SA",
    "market": "be_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "EMAKINA GROUP",
    "state": null,
    "summary": "Emakina Group SA operates as a communication agency in Europe and internationally. It offers services in the areas of digital marketing, website building, application development, unified commerce, audiovisual production, consumer insights, marketplaces management, and influence marketing. The company is based in Brussels, Belgium.",
    "website": "http://www.emakina.com",
    "zipcode": "1170"
  },
  "ALINV.PA": {
    "city": "Ghent",
    "country": "Belgium",
    "currency": "EUR",
    "exchange": "PAR",
    "industry": "Advertising Agencies",
    "long_name": "Invibes Advertising N.V.",
    "market": "fr_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "INVIBES ADVERTSING",
    "state": null,
    "summary": "Invibes Advertising N.V., a technology company, provides digital advertising services. Its solutions are supported by an in-feed format that is integrated into media content. The company develops its technology to help brands to communicate with consumers. Its technology is optimized for distributing in a closed network of media sites, including Bertelsmann, Hearst, Unify, Groupe Marie Claire, Axel Springer, and others. The company was founded 2011 and is headquartered in Ghent, Belgium.",
    "website": "http://www.invibes.com",
    "zipcode": "9052"
  },
  "MLIOC.PA": {
    "city": "Ans",
    "country": "Belgium",
    "currency": "EUR",
    "exchange": "PAR",
    "industry": "Advertising Agencies",
    "long_name": "Indoor and Outdoor Communication Holding SA",
    "market": "fr_market",
    "market_cap": null,
    "sector": "Communication Services",
    "short_name": "IOC HOLDING",
    "state": null,
    "summary": "Indoor and Outdoor Communication Holding SA manufactures indoor and outdoor visual communication supports for points of sale. The company offers temporary and permanent displays, permanent refrigeration units, display panels, publicity supports on urban furniture and building dressing products. Indoor and Outdoor Communication Holding SA is based in Ans, Belgium.",
    "website": "http://www.iocommunication.com",
    "zipcode": "4430"
  }
}
