{
    "MTLS": {
        "short_name": "Materialise NV",
        "long_name": "Materialise NV",
        "summary": "Materialise NV provides additive manufacturing and medical software, and 3D printing services in Europe, the Americas, Europe and Africa, and the Asia-Pacific. The company's Materialise Software segment offers software through programs and platforms that enable and enhance the functionality of 3D printers and of 3D printing operations. Its software interfaces between various types of 3D printers; and various software applications and capturing technologies, including computer-aided design packages and 3D scanners. This segment serves 3D printing machine original equipment manufacturers; manufacturers in automotive, aerospace, consumer goods, and hearing aid industries; and 3D printing service bureaus through its sales force, Website, and third-party distributors. Its Materialise Medical segment provides medical software that allows medical-image based analysis and engineering, as well as patient-specific design of surgical devices and implants. It serves medical device companies, hospitals, universities, and industrial companies through its direct sales force, Website, and picture archiving and communication system partners. The company's Materialise Manufacturing segment provides 3D printing services, design and engineering services, and rapid prototyping and additive manufacturing of production parts to industrial and commercial customers. It has collaboration agreements with Zimmer Biomet Holdings, Inc.; Encore Medical, L.P.; DePuy Synthes Companies of Johnson & Johnson; Global Orthopaedic Technology Pty Ltd; Limacorporate Spa; Mathys AG; Howmedica Osteonics Corp.; Corin Ltd.; and Fluidda, as well as a partnership with Sigma Labs, Inc. The company was founded in 1990 and is headquartered in Leuven, Belgium.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Belgium",
        "city": "Leuven"
    },
    "UPG.BR": {
        "short_name": "UNIFIEDPOST GROUP",
        "long_name": "UnifiedPost Group S.A.",
        "summary": "UnifiedPost Group operates and develops a cloud-based platform for administrative and financial services in Belgium. It allows connections between its customers, suppliers, customers, and other parties along the financial value chain. The company offers document, identity, payment, and finance and service solutions. It serves corporate and government customers; small and medium-sized enterprises; and agricultural, accounting, interim, and construction sectors. The company was founded in 2001 and is headquartered in La Hulpe, Belgium.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "BRU",
        "market": "be_market",
        "country": "Belgium",
        "city": "La Hulpe"
    }
}