{
  "00W.F": {
    "city": "Perth",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Publishing",
    "long_name": "Aspermont Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "ASPERMONT LTD",
    "state": "WA",
    "summary": "Aspermont Limited provides media services to resource industries in Australia, Asia, Europe, the United States, and internationally. The company offers market specific contents through a combination of print, digital media, and face to face networking channels. It provides publications, researches, and events, as well as other publications in partnership with external agencies across various trade sectors, including mining, investment, agriculture, and energy. The company also offers online publications that provide essential news and information directly in desktops, tablets, and smart phones, as well as print publications through tablet and mobile apps. In addition, it runs events and holds conferences. The company is based in Perth, Australia.",
    "website": "http://www.aspermont.com",
    "zipcode": "6000"
  },
  "0OH.F": {
    "city": "North Sydney",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Advertising Agencies",
    "long_name": "oOh!media Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "OOH MEDIA LTD",
    "state": "NSW",
    "summary": "oOh!media Limited operates as an out of home media company in Australia and New Zealand. The company's portfolio includes large format classic and digital roadside screens; classic and digital signs in shopping centers, airport terminals, and lounges, as well as in cafes, pubs, universities, office buildings, and gyms; classic and digital street furniture signs; digital and classic format advertising in public transportation corridors, such as rail; and online sites for millennials, students, flyers, small businesses, and city-based audiences. It also engages in content production and digital printing operations. The company serves advertisers, landlords, leaseholders, community organizations, local councils, and governments. oOh!media Limited was founded in 1989 and is based in North Sydney, Australia.",
    "website": "http://www.oohmedia.com.au",
    "zipcode": "2060"
  },
  "3DH.F": {
    "city": "Pyrmont",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Internet Content & Information",
    "long_name": "Domain Holdings Australia Limited",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Communication Services",
    "short_name": "DOMAIN HLDGS AUSTR. LTD",
    "state": "NSW",
    "summary": "Domain Holdings Australia Limited operates as a real estate media and technology services company that focuses on the property market in Australia. It operates through three segments: Core Digital, Consumer Solutions and Other, and Print segments. The company offers residential, commercial, and rural property marketing services through its listings portals on desktop and mobile, as well as through social media and print magazines. It also provides media and lead-generation solutions for advertisers looking to promote their products and services to consumers; and creates property market content to engage consumers and support audience growth. In addition, the company offers data and technology services to real estate agencies through customer relationship management software, property data subscriptions and research, and property inspection management tools. Further, it publishes real estate newspapers and magazines; and provides other services in the property lifecycle, including home loan brokerage, insurance, residential utilities product comparison, residential and commercial utilities connection, and trade services, as well as information services for buyers, investors, sellers, renters, and agents. Domain Holdings Australia Limited serves residential and commercial real estate agencies and professionals, property developers, financial services companies, retailers, utilities companies, media, government, and consumers. The company is based in Pyrmont, Australia. Domain Holdings Australia Limited is a subsidiary of Nine Entertainment Co. Holdings Limited.",
    "website": "http://shareholders.domain.com.au",
    "zipcode": "2009"
  },
  "5GG.AX": {
    "city": "Balcatta",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Telecom Services",
    "long_name": "Pentanet Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "PENTANET FPO",
    "state": "WA",
    "summary": "Pentanet Limited, a telecommunications carrier and internet service provider, provides wireless internet services through its fixed-wireless network and other fixed-line networks to residential, business, and enterprise customers in Perth. The company also offers a range of fixed-line internet services including national broadband network, local broadband network, enterprise fibre, and apartment broadband product. In addition, it offers subscription-based entertainment services, such as cloud gaming. The company was founded in 2017 and is headquartered in Balcatta, Australia.",
    "website": "http://www.pentanet.com.au",
    "zipcode": "6021"
  },
  "9SL.F": {
    "city": "Brisbane",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Telecom Services",
    "long_name": "Superloop Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "SUPERLOOP LTD",
    "state": "QLD",
    "summary": "Superloop Limited engages in the design, development, construction, and operation of independent telecommunications infrastructure in the Asia Pacific region. It offers network solutions for wholesale, enterprise, and channel customers. The company is also involved in the operation of a fixed wireless network; and provision of outsourced cloud and managed services, and cyber security and cyber safety services. In addition, it manages and delivers broadband solutions for campus environments, including student accommodations, hotels, and schools; and offers residential and small business broadband services through fixed wireless or fixed line NBN services. The company was founded in 2014 and is headquartered in Brisbane, Australia.",
    "website": "http://www.superloop.com",
    "zipcode": "4000"
  },
  "ABB.AX": {
    "city": "Morwell",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Telecom Services",
    "long_name": "Aussie Broadband Limited",
    "market": "au_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "AUSSIEBAND FPO",
    "state": "VIC",
    "summary": "Aussie Broadband Limited provides telecommunications services to homes and businesses in Australia. The company offers national broadband network (NBN) subscription plans and bundles to residential homes, small businesses, not-for-profits, corporate/enterprises, and managed service providers. It also provides a range of other telecommunications services, including Voice over Internet Protocol, mobile plans, and entertainment bundles; and sells mobile phone plans, Fetch TV subscriptions, and other telecommunication products and services. In addition, the company offers businesses a range of services and solutions, such as multi-handset phone systems, voice connectivity, security, redundancy, and private networks; and support packages, which include 24x7 enterprise support, uptime guarantees, and NBN enhanced service level guarantees. As of June 30, 2020, it served approximately 243,000 residential connections. The company was founded in 2008 and is headquartered in Morwell, Victoria.",
    "website": "http://www.aussiebroadband.com.au",
    "zipcode": "3840"
  },
  "AC8.F": {
    "city": "North Ryde",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Gaming & Multimedia",
    "long_name": "Aristocrat Leisure Limited",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Communication Services",
    "short_name": "ARISTOCRAT LEISURE",
    "state": "NSW",
    "summary": "Aristocrat Leisure Limited, together with its subsidiaries, engages in the development, assembly, sale, distribution, and servicing of games and systems in the Americas, Australia, New Zealand, and internationally. The company offers gaming content; and platforms and systems, including electronic gaming machines, digital social games, and casino management systems, as well as social web and mobile gaming services. It also provides cabinets and gaming products. Aristocrat Leisure Limited was incorporated in 1984 and is based in North Ryde, Australia.",
    "website": "http://www.aristocrat.com",
    "zipcode": "2113"
  },
  "AFW.AX": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Internet Content & Information",
    "long_name": "Applyflow Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "APPLYFLOW FPO",
    "state": "NSW",
    "summary": "Applyflow Limited engages in the development of cloud-based software-as-a-service solution platform in Australia. Its platform focuses on human resource management, which offers a suite of products, including JXT, a recruitment website; and Workconex, an applicant tracking tool. The company was formerly known as Nvoi Limited and changed its name to Applyflow Limited in November 2020. Applyflow Limited was incorporated in 2003 and is based in Sydney, Australia.",
    "website": "http://www.applyflow.com",
    "zipcode": "2000"
  },
  "AIM.AX": {
    "city": "North Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Entertainment",
    "long_name": "Access Innovation Holdings Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "ACCESS IHL FPO",
    "state": "NSW",
    "summary": "Access Innovation Holdings Limited provides access that utilizes its technology platform to make content available for live and recorded captioning, transcription, subtitles, translation, and speech analytics services in Australia, New Zealand, North America, and internationally. The company was incorporated in 2006 and is based in Melbourne, Australia.",
    "website": "http://www.ai-media.tv",
    "zipcode": "2060"
  },
  "ALL.AX": {
    "city": "North Ryde",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Electronic Gaming & Multimedia",
    "long_name": "Aristocrat Leisure Limited",
    "market": "au_market",
    "market_cap": "Large Cap",
    "sector": "Communication Services",
    "short_name": "ARISTOCRAT FPO",
    "state": "NSW",
    "summary": "Aristocrat Leisure Limited, together with its subsidiaries, engages in the development, assembly, sale, distribution, and servicing of games and systems in the Americas, Australia, New Zealand, and internationally. The company offers gaming content; and platforms and systems, including electronic gaming machines, digital social games, and casino management systems, as well as social web and mobile gaming services. It also provides cabinets and gaming products. Aristocrat Leisure Limited was incorporated in 1984 and is based in North Ryde, Australia.",
    "website": "http://www.aristocrat.com",
    "zipcode": "2113"
  },
  "AQHE.F": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Entertainment",
    "long_name": "Event Hospitality & Entertainment Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "EVENT HOSPITALITY+ENTMT",
    "state": "NSW",
    "summary": "Event Hospitality & Entertainment Limited operates as an entertainment, hospitality, and leisure company in Australia, New Zealand, and Germany. The company operates through Entertainment, Hotels and Resorts, Thredbo Alpine Resort, and Property and Other Investments segments. It is involved in cinema exhibition operations under the Event Cinemas, Moonlight Cinemas, Greater Union and Birch, and Carroll & Coyle cinemas brands; and the operation of Cine Buzz Rewards, a movie loyalty program, as well as State Theatre, a 2,000-seat theatre located in Sydney. The company also supplies cinema technology solutions to the industry in digital and electronic cinema, and film projection portfolios; owns, operates, and manages hotels and resorts under the Rydges, QT, Atura, and Thredbo Alpine brand names; and operates Priority Guest Rewards, a hotel and resort rewards program. In addition, it invests in, and rents properties; and invests in shares of unlisted companies. The company was formerly known as Amalgamated Holdings Limited and changed its name to Event Hospitality & Entertainment Limited in December 2015. Event Hospitality & Entertainment Limited was founded in 1910 and is headquartered in Sydney, Australia.",
    "website": "http://www.evt.com",
    "zipcode": "2000"
  },
  "ARLUF": {
    "city": "North Ryde",
    "country": "Australia",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Electronic Gaming & Multimedia",
    "long_name": "Aristocrat Leisure Limited",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Communication Services",
    "short_name": "ARISTOCRAT LEISURE",
    "state": "NSW",
    "summary": "Aristocrat Leisure Limited, together with its subsidiaries, engages in the development, assembly, sale, distribution, and servicing of games and systems in the Americas, Australia, New Zealand, and internationally. The company offers gaming content; and platforms and systems, including electronic gaming machines, digital social games, and casino management systems, as well as social web and mobile gaming services. It also provides cabinets and gaming products. Aristocrat Leisure Limited was incorporated in 1984 and is based in North Ryde, Australia.",
    "website": "http://www.aristocrat.com",
    "zipcode": "2113"
  },
  "ART.AX": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Internet Content & Information",
    "long_name": "Airtasker Limited",
    "market": "au_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "AIRTASKER FPO",
    "state": "NSW",
    "summary": "Airtasker Pty Limited operates a community platform that connects people to outsource tasks and find local services. Its platform offers range of tasks from tasks around the home like deliveries, cleaning, gardening and handyman work to tasks for businesses like office admin, promotional work, computer , and IT support. It also offers range of creative tasks like photography, graphic design , website, and blog support. It offers web platform and mobile application. The company was incorporated in 2011 and is based in Sydney, Australia. It has additional offices in Ireland, New Zealand, Singapore, United Kingdom, and United States.",
    "website": "http://www.airtasker.com",
    "zipcode": "2000"
  },
  "ASP.AX": {
    "city": "Perth",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Publishing",
    "long_name": "Aspermont Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "ASPERMONT FPO",
    "state": "WA",
    "summary": "Aspermont Limited provides media services to resource industries in Australia, Asia, Europe, the United States, and internationally. The company offers market specific contents through a combination of print, digital media, and face to face networking channels. It provides publications, researches, and events, as well as other publications in partnership with external agencies across various trade sectors, including mining, investment, agriculture, and energy. The company also offers online publications that provide essential news and information directly in desktops, tablets, and smart phones, as well as print publications through tablet and mobile apps. In addition, it runs events and holds conferences. The company is based in Perth, Australia.",
    "website": "http://www.aspermont.com",
    "zipcode": "6000"
  },
  "BYI.AX": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Entertainment",
    "long_name": "Beyond International Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "BEYOND INT FPO",
    "state": "NSW",
    "summary": "Beyond International Limited, together with its subsidiaries, engages in the media and content businesses in Australia, North America, Europe, and internationally. The company operates through four divisions: TV Production and Copyright, Film and Television Distribution, Home Entertainment, and Digital Marketing. The TV Production and Copyright division is involved in the production of television programs and ownership of television product copyrights. The Film and Television Distribution division distributes television programs and feature films. The Home Entertainment division distributes DVDs. The Digital Marketing segment provides online search optimization, website creation, development and performance, and online media sales services. The company was founded in 1984 and is headquartered in Dublin, Ireland.",
    "website": "http://www.beyond.com.au",
    "zipcode": "2064"
  },
  "CAR.AX": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Internet Content & Information",
    "long_name": "carsales.com Ltd",
    "market": "au_market",
    "market_cap": "Mid Cap",
    "sector": "Communication Services",
    "short_name": "CARSALES FPO",
    "state": "VIC",
    "summary": "carsales.com Ltd engages operates digital automotive marketplace in Australia, South Korea, Brazil, Mexico, Chile, and Argentina. It operates in Online Advertising Services; Data, Research and Services; Latin America; and Asia segments. The Online Advertising Services segment offers classified advertising that allows dealers and consumers to advertise automotive and non-automotive goods and services for sale across the carsales network; and services, including subscriptions, lead fees, and priority placement services on automotive and non-automotive goods and services. It also provides display advertising services, such as placing advertisements on carsales network websites for corporate customers comprising automotive manufacturers/importers, and finance and insurance companies. In addition, this segment holds investments in tyresales.com.au, an online tyre advertisement website that allows consumers to transact and purchase tyres; and RedBook Inspect, which provides inspection services published online as part of classified advertisements. The Data, Research and Services segment offers software, analysis, research and reporting, valuation, and website development and hosting services, as well as photography services. The Latin America segment is involved in the provision of online automotive classifieds and media advertising services. The Asia segment provides online automotive classifieds, media advertising, and automotive data services. carsales.com Ltd was founded in 1997 and is headquartered in Melbourne, Australia.",
    "website": "http://www.carsales.com.au",
    "zipcode": "3121"
  },
  "CSXXY": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Internet Content & Information",
    "long_name": "carsales.com Ltd",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Communication Services",
    "short_name": "CARSALES.COM LTD",
    "state": "VIC",
    "summary": "carsales.com Ltd engages operates digital automotive marketplace in Australia, South Korea, Brazil, Mexico, Chile, and Argentina. It operates in Online Advertising Services; Data, Research and Services; Latin America; and Asia segments. The Online Advertising Services segment offers classified advertising that allows dealers and consumers to advertise automotive and non-automotive goods and services for sale across the carsales network; and services, including subscriptions, lead fees, and priority placement services on automotive and non-automotive goods and services. It also provides display advertising services, such as placing advertisements on carsales network websites for corporate customers comprising automotive manufacturers/importers, and finance and insurance companies. In addition, this segment holds investments in tyresales.com.au, an online tyre advertisement website that allows consumers to transact and purchase tyres; and RedBook Inspect, which provides inspection services published online as part of classified advertisements. The Data, Research and Services segment offers software, analysis, research and reporting, valuation, and website development and hosting services, as well as photography services. The Latin America segment is involved in the provision of online automotive classifieds and media advertising services. The Asia segment provides online automotive classifieds, media advertising, and automotive data services. carsales.com Ltd was founded in 1997 and is headquartered in Melbourne, Australia.",
    "website": "http://www.carsales.com.au",
    "zipcode": "3121"
  },
  "DHG.AX": {
    "city": "Pyrmont",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Internet Content & Information",
    "long_name": "Domain Holdings Australia Limited",
    "market": "au_market",
    "market_cap": "Mid Cap",
    "sector": "Communication Services",
    "short_name": "DOMAIN FPO",
    "state": "NSW",
    "summary": "Domain Holdings Australia Limited operates as a real estate media and technology services company that focuses on the property market in Australia. It operates through three segments: Core Digital, Consumer Solutions and Other, and Print segments. The company offers residential, commercial, and rural property marketing services through its listings portals on desktop and mobile, as well as through social media and print magazines. It also provides media and lead-generation solutions for advertisers looking to promote their products and services to consumers; and creates property market content to engage consumers and support audience growth. In addition, the company offers data and technology services to real estate agencies through customer relationship management software, property data subscriptions and research, and property inspection management tools. Further, it publishes real estate newspapers and magazines; and provides other services in the property lifecycle, including home loan brokerage, insurance, residential utilities product comparison, residential and commercial utilities connection, and trade services, as well as information services for buyers, investors, sellers, renters, and agents. Domain Holdings Australia Limited serves residential and commercial real estate agencies and professionals, property developers, financial services companies, retailers, utilities companies, media, government, and consumers. The company is based in Pyrmont, Australia. Domain Holdings Australia Limited is a subsidiary of Nine Entertainment Co. Holdings Limited.",
    "website": "http://shareholders.domain.com.au",
    "zipcode": "2009"
  },
  "EGG.AX": {
    "city": "Pyrmont",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Advertising Agencies",
    "long_name": "Enero Group Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "ENERO FPO",
    "state": "NSW",
    "summary": "Enero Group Limited provides integrated marketing and communication services in Australia, the United Kingdom, rest of Europe, and the United States. Its services include strategy, market research and insights, advertising, digital, public relations, communications planning, designing, events management, direct marketing, corporate communications, and programmatic media. The company was incorporated in 2000 and is based in Pyrmont, Australia.",
    "website": "http://www.enero.com",
    "zipcode": "2009"
  },
  "EM1.AX": {
    "city": "Perth",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Electronic Gaming & Multimedia",
    "long_name": "Emerge Gaming Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "EMERGEGAM FPO",
    "state": "WA",
    "summary": "Emerge Gaming Limited develops and markets an online eSport and gaming tournament platform in Eastern Europe and South Africa. It develops Arcade X online gaming platform, which focuses on skill based tournaments and matches, where players compete to enhance their user rankings/status in the virtual gaming world and for digital merchandise to enhance their gaming experience, as well as offers a market place that gives players the opportunity to enter pay-to-play competitions and tournaments. The company is based in Perth, Australia.",
    "website": "http://www.emergegaming.com.au",
    "zipcode": "6007"
  },
  "ESH.AX": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Electronic Gaming & Multimedia",
    "long_name": "Esports Mogul Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "ESPORTS FPO",
    "state": "VIC",
    "summary": "Esports Mogul Limited engages in the esports media and software business in Australia and Singapore. It owns and operates the mogul.gg tournament platform, an online esports tournament and matchmaking platform. The company was formerly known as eSports Mogul Asia Pacific Limited and changed its name to Esports Mogul Limited in May 2019. Esports Mogul Limited is based in Melbourne, Australia.",
    "website": "http://esh.mogul.gg",
    "zipcode": "3000"
  },
  "EVT.AX": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Entertainment",
    "long_name": "Event Hospitality & Entertainment Limited",
    "market": "au_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "EVEHOSPENT FPO",
    "state": "NSW",
    "summary": "Event Hospitality & Entertainment Limited operates as an entertainment, hospitality, and leisure company in Australia, New Zealand, and Germany. The company operates through Entertainment, Hotels and Resorts, Thredbo Alpine Resort, and Property and Other Investments segments. It is involved in cinema exhibition operations under the Event Cinemas, Moonlight Cinemas, Greater Union and Birch, and Carroll & Coyle cinemas brands; and the operation of Cine Buzz Rewards, a movie loyalty program, as well as State Theatre, a 2,000-seat theatre located in Sydney. The company also supplies cinema technology solutions to the industry in digital and electronic cinema, and film projection portfolios; owns, operates, and manages hotels and resorts under the Rydges, QT, Atura, and Thredbo Alpine brand names; and operates Priority Guest Rewards, a hotel and resort rewards program. In addition, it invests in, and rents properties; and invests in shares of unlisted companies. The company was formerly known as Amalgamated Holdings Limited and changed its name to Event Hospitality & Entertainment Limited in December 2015. Event Hospitality & Entertainment Limited was founded in 1910 and is headquartered in Sydney, Australia.",
    "website": "http://www.evt.com",
    "zipcode": "2000"
  },
  "FGL.AX": {
    "city": "Subiaco",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Internet Content & Information",
    "long_name": "Frugl Group Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "FRUGLGROUP FPO",
    "state": "WA",
    "summary": "Frugl Group Limited engages in the development, compliance, and commercialization of cyber safety and grocery comparison applications in Australia. The company offers Family Insights, a cyber safety software platform to help keep children safe online and their parents informed of their children's online habits; and Frugl, a grocery price comparison platform, which offers shoppers with products, promotions, and pricing information to find the lowest price each week across Australia's supermarkets. It also provides Infocus Analytics, a grocery pricing and promotions analytics platform that offers data and analytics expertise in retail to retailers, brand manufacturers, retail merchandisers and advertising managers, consumer facing businesses, and digital media advertisers and agencies. The company was formerly known as Family Insights Group Limited and changed its name to Frugl Group Limited in July 2020. Frugl Group Limited was incorporated in 2001 and is based in Subiaco, Australia.",
    "website": "http://www.fruglgroup.com",
    "zipcode": "6008"
  },
  "FNGWF": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Telecom Services",
    "long_name": "5G Networks Limited",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "5G NETWORKS LTD",
    "state": "VIC",
    "summary": "5G Networks Limited operates as a licensed telecommunications carrier in Australia. The company offers data connectivity, cloud and data center, and managed services. It provides cloud-based solutions and network services; and operates fiber and wireless infrastructure, management of cloud computing environment, and data center facilities. In addition, the company engages in domain name registrations and renewals, website and email hosting, website development, search engine marketing, and social advertising campaigns for businesses. 5G Networks Limited was incorporated in 2013 and is headquartered in Melbourne, Australia.",
    "website": "http://www.5gnetworks.com.au",
    "zipcode": "3000"
  },
  "FSG.AX": {
    "city": "Belrose",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Telecom Services",
    "long_name": "Field Solutions Holdings Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "FIELD SOLU FPO",
    "state": "NSW",
    "summary": "Field Solutions Holdings Limited, a telecommunications carrier and technology company, provides connectivity and business solutions for rural, regional, and remote areas in Australia. The company offers cloud computing, cloud application development, and cloud software development services; designs and builds custom software systems; establishes private and public cloud hosting services; designs and deploys private networks; migrates existing products and software to the cloud; manages, monitors, and optimizes cloud and network infrastructure; and builds disaster recovery scenarios. It also provides end-to-end solutions ranging from concept and strategy, to design, implementation, and support; and cloud access solutions using dark fiber, wireless, microwave, Ethernet, NBN, and satellite. The company is based in Belrose, Australia.",
    "website": "http://www.fieldsolutions-group.com",
    "zipcode": "2085"
  },
  "GIX.F": {
    "city": "Perth",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Gaming & Multimedia",
    "long_name": "Emerge Gaming Limited",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "EMERGE GAMING LTD",
    "state": "WA",
    "summary": "Emerge Gaming Limited develops and markets an online eSport and gaming tournament platform in Eastern Europe and South Africa. It develops Arcade X online gaming platform, which focuses on skill based tournaments and matches, where players compete to enhance their user rankings/status in the virtual gaming world and for digital merchandise to enhance their gaming experience, as well as offers a market place that gives players the opportunity to enter pay-to-play competitions and tournaments. The company is based in Perth, Australia.",
    "website": "http://www.emergegaming.com.au",
    "zipcode": "6007"
  },
  "GTN.AX": {
    "city": "North Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Advertising Agencies",
    "long_name": "GTN Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "GTNETWORK FPO",
    "state": "NSW",
    "summary": "GTN Limited, together with its subsidiaries, operates broadcast media advertising platforms that supply traffic information reports to radio and/or television stations. The company through its advertising spots offers information reports, such as traffic and news. Its advertising platform enables advertisers to reach audiences in Australia, the United Kingdom, Canada, and Brazil. The company was founded in 1997 and is headquartered in North Sydney, Australia.",
    "website": "http://www.gtnetwork.com.au",
    "zipcode": "2060"
  },
  "GWC.NZ": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "NZD",
    "exchange": "NZE",
    "industry": "Advertising Agencies",
    "long_name": "Goodwood Capital Limited",
    "market": "nz_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "Goodwood Capital Limited Ordina",
    "state": "NSW",
    "summary": "Goodwood Capital Limited operates as a mobile media advertising company in Australia, New Zealand, and Southeast Asia. It offers precision geo-location and audience based in-app and mobile Web advertising solutions. The company also provides programmatic geographic mobile platform for customers to manage on a self-service basis. The company was formerly known as Snakk Media Limited and changed its name to Goodwood Capital Limited in October 2020. Goodwood Capital Limited was founded in 2010 and is headquartered in Sydney, Australia. As of October 19, 2020, Goodwood Capital Limited was taken private.",
    "website": "http://www.snakkmedia.com",
    "zipcode": "2010"
  },
  "HFY.AX": {
    "city": "Macquarie Park",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Telecom Services",
    "long_name": "Hubify Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "HUBIFYLTD FPO",
    "state": "NSW",
    "summary": "United Networks Limited engages in the customization, integration, maintenance, and sale of IT and telecommunications systems. The company specializes in voice, data, and value-add services. Its products include global roaming SIM cards, local telecommunications services, location-based services, and Wi-Fi solutions. The company also offers flexible office phone, broadband and data, and mobile fleet management solutions. In addition, it provides traditional and digital telephony solutions; mobile and fixed data services; account management and optimization services; consultancy services; and technology platforms and services, as well as sells hardware and software products through Internet. United Networks Limited is headquartered in Macquarie Park, Australia.",
    "website": "http://www.unitednetworks.net.au",
    "zipcode": "2113"
  },
  "HT1.AX": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Entertainment",
    "long_name": "HT&E Limited",
    "market": "au_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "HT&E LTD FPO",
    "state": "NSW",
    "summary": "HT&E Limited, together with its subsidiaries, operates as a media and entertainment company in Australia and Hong Kong. The company operates through three segments: Australian Radio Network, HK Outdoor, and Digital Investments. It owns and operates Australian Radio Network under The KIIS Network, The Pure Gold Network, iHeartRadio, and The Edge brands. The company also provides billboard, transit, and other outdoor advertising services. It also operates a network of approximately 440 outdoor advertising panels across Hong Kong tunnels and the tram shelters on Hong Kong Island, as well as provides mobile messaging technology services. The company was formerly known as APN News & Media Limited and changed its name to HT&E Limited in May 2017. HT&E Limited was incorporated in 1988 and is based in Sydney, Australia.",
    "website": "http://www.htande.com.au",
    "zipcode": "2113"
  },
  "HTA.AX": {
    "city": "North Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Telecom Services",
    "long_name": "Hutchison Telecommunications (Australia) Limited",
    "market": "au_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "HUTCHISON FPO",
    "state": "NSW",
    "summary": "Hutchison Telecommunications (Australia) Limited, through its 25.05% interest in TPG Telecom Limited, provides telecommunications services in Australia. It offers portfolio of fixed and mobile products under the Vodafone, TPG, iiNet, Internode, Lebara, and AAPT brands. The company was founded in 1989 and is based in North Sydney, Australia. Hutchison Telecommunications (Australia) Limited is a subsidiary of Hutchison Telecommunications (Amsterdam) B.V.",
    "website": "http://www.hutchison.com.au",
    "zipcode": "2060"
  },
  "ICI.AX": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Electronic Gaming & Multimedia",
    "long_name": "iCandy Interactive Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "ICANDY FPO",
    "state": "VIC",
    "summary": "iCandy Interactive Limited develops and publishes mobile games and digital entertainment worldwide. It operates in Development of Digital Media and Development of Intellectual Properties segments. The company was incorporated in 2015 and is headquartered in Melbourne, Australia.",
    "website": "http://www.icandy.io",
    "zipcode": "3000"
  },
  "IGL.AX": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Advertising Agencies",
    "long_name": "IVE Group Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "IVEGROUP FPO",
    "state": "NSW",
    "summary": "IVE Group Limited engages in the marketing, communications, and print businesses in Australia. The company provides conceptual and creative design across print, mobile, and interactive media; and personalized communications, including marketing automation, marketing mail, publication mail, e-communications, multi-channel solutions, and call center services. It also prints and distributes catalogues, magazines, marketing, and corporate communications materials and stationery; and manufactures point of sale display material and large format banners for retail applications. In addition, the company provides data analytics, customer experience strategy, and CRM; and outsourced communication solutions for large organizations, such development of customized multi-channel management models covering creative and digital services, supply chain optimization, inventory management, warehousing, and logistics. It serves various industry sectors comprising financial services, publishing, retail, communications, property, clubs and associations, not-for-profit, utilities, manufacturing, education, and government. IVE Group Limited was founded in 1921 and is based in Sydney, Australia.",
    "website": "http://www.ivegroup.com.au",
    "zipcode": "2140"
  },
  "ISU.AX": {
    "city": "Cheltenham",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Internet Content & Information",
    "long_name": "iSelect Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "ISELECT FPO",
    "state": "VIC",
    "summary": "iSelect Limited provides online comparison and purchase services for insurance, utilities, and personal finance products in Australia. The company operates through four segments: Health, Life and General Insurance, Energy and Telecommunications, and Other. It compares and sells private health, life, car, pet, travel, business, and home and contents insurance, as well as overseas health cover products; and home loans and income protection products. The company also provides comparison, purchase, and referral services for broadband, electricity and gas, and mobile phones and plans, as well as moving house services. In addition, it offers mortgage brokerage products. The company provides its services under the iSelect, iMoney, and Energy Watch brands. iSelect Limited was founded in 2000 and is headquartered in Cheltenham, Australia.",
    "website": "http://www.iselect.com.au",
    "zipcode": "3192"
  },
  "IZ3.F": {
    "city": "Cheltenham",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Internet Content & Information",
    "long_name": "iSelect Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "ISELECT LTD",
    "state": "VIC",
    "summary": "iSelect Limited provides online comparison and purchase services for insurance, utilities, and personal finance products in Australia. The company operates through four segments: Health, Life and General Insurance, Energy and Telecommunications, and Other. It compares and sells private health, life, car, pet, travel, business, and home and contents insurance, as well as overseas health cover products; and home loans and income protection products. The company also provides comparison, purchase, and referral services for broadband, electricity and gas, and mobile phones and plans, as well as moving house services. In addition, it offers mortgage brokerage products. The company provides its services under the iSelect, iMoney, and Energy Watch brands. iSelect Limited was founded in 2000 and is headquartered in Cheltenham, Australia.",
    "website": "http://www.iselect.com.au",
    "zipcode": "3192"
  },
  "LVE.AX": {
    "city": "Perth",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Internet Content & Information",
    "long_name": "Love Group Global Ltd",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "LOVEGROUP FPO",
    "state": "WA",
    "summary": "Love Group Global Ltd provides social and dating products and services in Oceania, Asia, and Europe. It operates through Dating Services and Enterprise Services segments. The company's operates DateTix platform, a mobile online marketplace that facilitates offline dates by connecting like-minded people who are nearby each other and free at the same times; Lovestruck, an online dating platform operating in Hong Kong, Singapore, and the United Kingdom; and Noonswoon mobile application. It also provides personalized matchmaking services; and member events, as well as operates lounge business under the Love Lounge brand name. The company was formerly known as Datetix Group Ltd and changed its name to Love Group Global Ltd in May 2017. Love Group Global Ltd is based in Perth, Australia.",
    "website": "http://www.lovegroup.co",
    "zipcode": "6000"
  },
  "M2G.F": {
    "city": "Nedlands",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Telecom Services",
    "long_name": "Norwood Systems Limited",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "NORWOOD SYSTEMS LTD",
    "state": "WA",
    "summary": "Norwood Systems Limited provides voice, messaging, data, and cyber security services to consumers, enterprises, and carriers worldwide. The company offers enterprise solutions, including mobile cost management that enable bring your own device platform to realize telecommunication capabilities; CRM Auto-Capture provides data on all business-related calls and texts instantly; and compliance management that assists organizational communications where sharing sensitive information is prevalent, as well as enables metadata and deep data collection on communication events through Corona Cloud platform. It also provides SecondLine, an app to Separate personal and professional personas; World Phone, a virtual phone app; World Message, an app for messaging; World Wi-Fi, an app to find Wi-Fi hotspots; World Secure, a Wi-Fi Cyber-security app; and World Voicemail, a visual voicemail app. The company was founded in 2011 and is based in Nedlands, Australia.",
    "website": "http://www.norwoodsystems.com",
    "zipcode": "6009"
  },
  "MAQ.AX": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Telecom Services",
    "long_name": "Macquarie Telecom Group Limited",
    "market": "au_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "MA TELECOM FPO",
    "state": "NSW",
    "summary": "Macquarie Telecom Group Limited provides telecommunication and hosting services to corporate and government customers in Australia. It offers voice services, such as teams calling, unified communications, and video and Web conferencing services, as well as Hello, a cloud-based hosted voice system; managed mobility services and mobile management tools; and cloud services, including hybrid, VMWare, and private cloud services, as well as dedicated servers, colocation, managed hosting, management tools, SD-WAN, and data center extension services. The company also provides data services, including Internet, fixed wireline Ethernet, private IP-VPN, Cisco Meraki, business NBN, international data links, SIP trunking, SaaS enabled WAN, secure remote access, and business Ethernet access. Macquarie Telecom Group Limited was founded in 1992 and is headquartered in Sydney, Australia.",
    "website": "http://www.macquarietelecomgroup.com",
    "zipcode": "2000"
  },
  "MKL.AX": {
    "city": "Adelaide",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Electronic Gaming & Multimedia",
    "long_name": "Mighty Kingdom Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "MIGHTYKING FPO",
    "state": "SA",
    "summary": "Mighty Kingdom Limited operates as a game developer in Australia. It develops games for console, PC, and mobile platforms. The company was founded in 2010 and is based in Adelaide, Australia.",
    "website": "http://www.mightykingdom.com",
    "zipcode": "5000"
  },
  "MNF.AX": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Telecom Services",
    "long_name": "MNF Group Limited",
    "market": "au_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "MNFGROUP FPO",
    "state": "NSW",
    "summary": "MNF Group Limited, together with subsidiaries, provides voice, data, and cloud based communication and communication enablement services to residential, business, government, and wholesale customers in Australia and internationally. It operates through Domestic Wholesale, Direct, and Global Wholesale segments. The company's products include MyNetFone that provides voice and Internet services; Symbio Networks, which offers IP voice carriage services and software through in-country voice infrastructure and platforms; Connexus; and CallStream that provides inbound business phone numbers. It also offers Pennytel that provides SIM-only mobile services; theBuzz; iBoss, a software-as-a-service platform, which enables users to start and scale their own telecommunications business; and TNZI, a global voice business servicing international carriage service providers, regional telecommunications networks, and multi-national enterprises. In addition, the company provides TollShield, a real-time toll fraud mitigation software for networks and carriers; Telcoinabox, a wholesale telecommunications aggregator; OCA Softswitch that delivers converged voice, data, and multi-media services for carriers and enterprises; Supernet, a licensed independent facilities based operator; MNF Enterprise, an enterprise and government telecommunications solution; and audio conferencing and collaboration services. Further, it provides hardware, equipment, and consulting services to support its products. The company was formerly known as My Net Fone Limited and changed its name to MNF Group Limited in October 2015. MNF Group Limited was founded in 2004 and is headquartered in Sydney, Australia.",
    "website": "http://www.mnfgroup.limited",
    "zipcode": "2000"
  },
  "MXO.AX": {
    "city": "Perth",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Advertising Agencies",
    "long_name": "Motio Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "MOTIO FPO",
    "state": "WA",
    "summary": "Motio Limited provides advertising services for metro rail operators and outdoor media companies in Australia. It builds, installs, and maintains cross-track digital systems. The company was formerly known as XTD Limited and changed its name to Motio Limited in November 2020. The company is based in Perth, Australia. Motio Limited is a subsidiary of Lunalite International Pty Ltd.",
    "website": "http://www.motio.com.au",
    "zipcode": "6000"
  },
  "NEA.AX": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Internet Content & Information",
    "long_name": "Nearmap Ltd",
    "market": "au_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "NEARMAP FPO",
    "state": "NSW",
    "summary": "Nearmap Ltd provides online aerial photomaps in Australia, New Zealand, and North America. Its solutions are used in the architecture and engineering, construction, insurance and financial services, property and real estate, roofing, solar, telecommunication, transportation and logistics, and utilities, as well as government sector. The company was formerly known as ipernica ltd and changed its name to Nearmap Ltd in November 2012. Nearmap Ltd was founded in 2007 and is based in Sydney, Australia.",
    "website": "http://www.nearmap.com.au",
    "zipcode": "2000"
  },
  "NEC.AX": {
    "city": "North Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Broadcasting",
    "long_name": "Nine Entertainment Co. Holdings Limited",
    "market": "au_market",
    "market_cap": "Mid Cap",
    "sector": "Communication Services",
    "short_name": "NINE ENT FPO",
    "state": "NSW",
    "summary": "Nine Entertainment Co. Holdings Limited engages in the broadcasting and program production businesses across free to air television and metropolitan radio networks in Australia. It operates through Broadcasting, Digital and Publishing, Domain Group, and Stan segments. The company provides television services under the brands, including Channel 9, 9Rush, 9Go!, 9Gem, and 9Life; video on demand platform under 9Now brand; talkback radio stations under 2GB, 3AW, 4BC, 6PR, 2UE, 4BH, 6GT, Magic1278 brands; and publishes newspapers, news-inserted magazines, and events, as well as nine.com.au, a site of news, sport, entertainment, and lifestyle content. It offers mastheads under the The Sydney Morning Herald, The Age, and The Australian Financial Review brands. The company also provides real estate media and technology services. Nine Entertainment Co. Holdings Limited was founded in 1956 and is headquartered in North Sydney, Australia.",
    "website": "http://www.nineforbrands.com.au",
    "zipcode": "2060"
  },
  "NEE.SG": {
    "city": "North Sydney",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Broadcasting",
    "long_name": "Nine Entertainment Co. Holdings Limited",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Communication Services",
    "short_name": "Nine Entertainment Co.Hldg.LtdR",
    "state": "NSW",
    "summary": "Nine Entertainment Co. Holdings Limited engages in the broadcasting and program production businesses across free to air television and metropolitan radio networks in Australia. It operates through Broadcasting, Digital and Publishing, Domain Group, and Stan segments. The company provides television services under the brands, including Channel 9, 9Rush, 9Go!, 9Gem, and 9Life; video on demand platform under 9Now brand; talkback radio stations under 2GB, 3AW, 4BC, 6PR, 2UE, 4BH, 6GT, Magic1278 brands; and publishes newspapers, news-inserted magazines, and events, as well as nine.com.au, a site of news, sport, entertainment, and lifestyle content. It offers mastheads under the The Sydney Morning Herald, The Age, and The Australian Financial Review brands. The company also provides real estate media and technology services. Nine Entertainment Co. Holdings Limited was founded in 1956 and is headquartered in North Sydney, Australia.",
    "website": "http://www.nineforbrands.com.au",
    "zipcode": "2060"
  },
  "NIROF": {
    "city": "Twin Waters",
    "country": "Australia",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Internet Content & Information",
    "long_name": "SportsHero Limited",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "SPORTSHERO LTD",
    "state": "QLD",
    "summary": "SportsHero Limited develops sports gamification platform. The company develops and owns Olahbola, a football app in Indonesia. It also provides marketing services. The company is based in Twin Waters, Australia.",
    "website": "http://www.sportshero.live",
    "zipcode": "4564"
  },
  "NOR.AX": {
    "city": "Nedlands",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Telecom Services",
    "long_name": "Norwood Systems Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "NORWOOD FPO",
    "state": "WA",
    "summary": "Norwood Systems Limited provides voice, messaging, data, and cyber security services to consumers, enterprises, and carriers worldwide. The company offers enterprise solutions, including mobile cost management that enable bring your own device platform to realize telecommunication capabilities; CRM Auto-Capture provides data on all business-related calls and texts instantly; and compliance management that assists organizational communications where sharing sensitive information is prevalent, as well as enables metadata and deep data collection on communication events through Corona Cloud platform. It also provides SecondLine, an app to Separate personal and professional personas; World Phone, a virtual phone app; World Message, an app for messaging; World Wi-Fi, an app to find Wi-Fi hotspots; World Secure, a Wi-Fi Cyber-security app; and World Voicemail, a visual voicemail app. The company was founded in 2011 and is based in Nedlands, Australia.",
    "website": "http://www.norwoodsystems.com",
    "zipcode": "6009"
  },
  "OML.AX": {
    "city": "North Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Advertising Agencies",
    "long_name": "oOh!media Limited",
    "market": "au_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "OOHMEDIA FPO",
    "state": "NSW",
    "summary": "oOh!media Limited operates as an out of home media company in Australia and New Zealand. The company's portfolio includes large format classic and digital roadside screens; classic and digital signs in shopping centers, airport terminals, and lounges, as well as in cafes, pubs, universities, office buildings, and gyms; classic and digital street furniture signs; digital and classic format advertising in public transportation corridors, such as rail; and online sites for millennials, students, flyers, small businesses, and city-based audiences. It also engages in content production and digital printing operations. The company serves advertisers, landlords, leaseholders, community organizations, local councils, and governments. oOh!media Limited was founded in 1989 and is based in North Sydney, Australia.",
    "website": "http://www.oohmedia.com.au",
    "zipcode": "2060"
  },
  "OTW.AX": {
    "city": "Brisbane",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Telecom Services",
    "long_name": "Over the Wire Holdings Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "OTW HLDING FPO",
    "state": "QLD",
    "summary": "Over the Wire Holdings Limited provides data network and Internet, voice, cloud and managed, and data center co-location services in Australia and New Zealand. The company offers Internet connectivity services to enable Internet services, video conferencing, Software as a Service applications, and online collaboration for various businesses. It also provides Session Initiation Protocol based Internet voice solutions; and operates a platform that supports various client usage scenarios, from Private Branch exchanges (PBX) to call center dialers, for inbound and outbound calling. In addition, the company offers a range of private cloud-based services consisting of Infrastructure as a Service, hosted PBX, and managed services. Further, it allows customers to house their equipment, such as servers and network equipment. The company was founded in 2005 and is headquartered in Brisbane, Australia.",
    "website": "http://www.overthewire.com.au",
    "zipcode": "4000"
  },
  "P7D.F": {
    "city": "Watson",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Broadcasting",
    "long_name": "Prime Media Group Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "PRIME MEDIA GROUP LTD.",
    "state": "ACT",
    "summary": "Prime Media Group Limited provides commercial television broadcasting services in Australia. It offers free-to-air television broadcasting services under the PRIME7 and GWN7 brands in regional New South Wales, the Australian Capital Territory, regional Victoria, the Gold Coast area of Southern Queensland, and regional Western Australia. The company was incorporated in 1970 and is based in Watson, Australia.",
    "website": "http://www.primemedia.com.au",
    "zipcode": "2602"
  },
  "PLY.AX": {
    "city": "Port Melbourne",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Electronic Gaming & Multimedia",
    "long_name": "PlaySide Studios Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "PLAYSIDE FPO",
    "state": "VIC",
    "summary": "PlaySide Studios Limited develops mobile video games in Australia. It provides titles in a range of categories, including self-published games based on original intellectual property and games developed in collaboration with studios, such as Disney, Pixar, Warner Bros, and Nickelodeon. The company's portfolio consists of 52 titles that are delivered across 4 platforms, which include mobile, virtual reality, augmented reality, and PC. The company was incorporated in 2011 and is headquartered in Port Melbourne, Australia.",
    "website": "http://www.playsidestudios.com",
    "zipcode": "3207"
  },
  "PNH.F": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Entertainment",
    "long_name": "HT&E Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "HT+E LTD",
    "state": "NSW",
    "summary": "HT&E Limited, together with its subsidiaries, operates as a media and entertainment company in Australia and Hong Kong. The company operates through three segments: Australian Radio Network, HK Outdoor, and Digital Investments. It owns and operates Australian Radio Network under The KIIS Network, The Pure Gold Network, iHeartRadio, and The Edge brands. The company also provides billboard, transit, and other outdoor advertising services. It also operates a network of approximately 440 outdoor advertising panels across Hong Kong tunnels and the tram shelters on Hong Kong Island, as well as provides mobile messaging technology services. The company was formerly known as APN News & Media Limited and changed its name to HT&E Limited in May 2017. HT&E Limited was incorporated in 1988 and is based in Sydney, Australia.",
    "website": "http://www.htande.com.au",
    "zipcode": "2113"
  },
  "PPL.AX": {
    "city": "Darlinghurst",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Advertising Agencies",
    "long_name": "Pureprofile Ltd",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "PUREPROFIL FPO",
    "state": "NSW",
    "summary": "Pureprofile Ltd provides profile marketing and insights technology services for marketers, researchers, and publishers in Australia and internationally. The company operates through three segments: Data & Insights, Media, and Performance. The Data & Insights segment conducts market research; and provides research technology platforms. The Media segment buys and sells online advertising inventory on behalf of advertisers and publishers. The Performance segment generates leads for clients through its consumer database and proprietary and partner digital assets. It collects deep profiles of consumers and provides businesses the ability to segment, target, and engage with audiences through research, marketing, and advertising. Pureprofile Ltd was founded in 2000 and is headquartered in Darlinghurst, Australia.",
    "website": "http://pureprofile.investorportal.com.au",
    "zipcode": "2010"
  },
  "PRT.AX": {
    "city": "Watson",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Broadcasting",
    "long_name": "Prime Media Group Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "PRIME TV FPO",
    "state": "ACT",
    "summary": "Prime Media Group Limited provides commercial television broadcasting services in Australia. It offers free-to-air television broadcasting services under the PRIME7 and GWN7 brands in regional New South Wales, the Australian Capital Territory, regional Victoria, the Gold Coast area of Southern Queensland, and regional Western Australia. The company was incorporated in 1970 and is based in Watson, Australia.",
    "website": "http://www.primemedia.com.au",
    "zipcode": "2602"
  },
  "QSX1.F": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Internet Content & Information",
    "long_name": "Nearmap Ltd",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "NEARMAP LTD",
    "state": "NSW",
    "summary": "Nearmap Ltd provides online aerial photomaps in Australia, New Zealand, and North America. Its solutions are used in the architecture and engineering, construction, insurance and financial services, property and real estate, roofing, solar, telecommunication, transportation and logistics, and utilities, as well as government sector. The company was formerly known as ipernica ltd and changed its name to Nearmap Ltd in November 2012. Nearmap Ltd was founded in 2007 and is based in Sydney, Australia.",
    "website": "http://www.nearmap.com.au",
    "zipcode": "2000"
  },
  "R9C.F": {
    "city": "Richmond",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Internet Content & Information",
    "long_name": "REA Group Limited",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Communication Services",
    "short_name": "REA GROUP LTD.",
    "state": "VIC",
    "summary": "REA Group Limited engages in online property advertising business in Australia, Asia, and North America. It offers property and property-related services on websites and mobile apps. The company operates residential, commercial, share, and co-working property sites, such as realestate.com.au, realcommercial.com.au, spacely.com.au, Flatmates.com.au, iproperty.com.my, smartline.com.au, hometrack.com.au, 1form.com, rumah123.com, iproperty.com.sg, squarefoot.com.hk, ThinkgOfLiving.com, myfun.com, smartexpos.com, makaan.com, housing.com, PropTiger.com, move.com, realtor.com, and 99.co. It also provides mortgage broking and home-financing solutions. The company was formerly known as realestate.com.au Ltd. and changed its name to REA Group Limited in December 2008. REA Group Limited was founded in 1995 and is headquartered in Richmond, Australia. REA Group Limited operates as a subsidiary of News Corporation.",
    "website": "http://www.rea-group.com",
    "zipcode": "3121"
  },
  "REA.AX": {
    "city": "Richmond",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Internet Content & Information",
    "long_name": "REA Group Limited",
    "market": "au_market",
    "market_cap": "Large Cap",
    "sector": "Communication Services",
    "short_name": "REA GROUP FPO",
    "state": "VIC",
    "summary": "REA Group Limited engages in online property advertising business in Australia, Asia, and North America. It offers property and property-related services on websites and mobile apps. The company operates residential, commercial, share, and co-working property sites, such as realestate.com.au, realcommercial.com.au, spacely.com.au, Flatmates.com.au, iproperty.com.my, smartline.com.au, hometrack.com.au, 1form.com, rumah123.com, iproperty.com.sg, squarefoot.com.hk, ThinkgOfLiving.com, myfun.com, smartexpos.com, makaan.com, housing.com, PropTiger.com, move.com, realtor.com, and 99.co. It also provides mortgage broking and home-financing solutions. The company was formerly known as realestate.com.au Ltd. and changed its name to REA Group Limited in December 2008. REA Group Limited was founded in 1995 and is headquartered in Richmond, Australia. REA Group Limited operates as a subsidiary of News Corporation.",
    "website": "http://www.rea-group.com",
    "zipcode": "3121"
  },
  "RMY.AX": {
    "city": "Cremorne",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Internet Content & Information",
    "long_name": "RMA Global Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "RMA GLOBAL FPO",
    "state": "VIC",
    "summary": "RMA Global Limited, an online digital marketing company, provides data on real estate. The company offers sale results for residential real estate agents and agencies, as well as reviews of agent performance from vendors and buyers of residential real estate. It operates in Australia, the United States, and New Zealand. The company was formerly known as Digital Castle Pty. Ltd. RMA Global Limited was founded in 2014 and is based in Cremorne, Australia.",
    "website": "http://www.rma-global.com",
    "zipcode": "3121"
  },
  "RNT.AX": {
    "city": "Burswood",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Internet Content & Information",
    "long_name": "Rent.com.au Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "RENTDOTCOM FPO",
    "state": "WA",
    "summary": "Rent.com.au Limited, together with its subsidiaries, operates real estate websites focusing on the rental property market in Australia. It accepts rental property listings from agents, landlords, renters, and advertisers. Rent.com.au Limited was founded in 2007 and is based in Burswood, Australia.",
    "website": "http://www.rent.com.au",
    "zipcode": "6100"
  },
  "SEG.AX": {
    "city": "Southbank",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Broadcasting",
    "long_name": "Sports Entertainment Group Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "SPORTS ENT FPO",
    "state": "VIC",
    "summary": "Sports Entertainment Group Limited engages in broadcasting and publishing business in Australia. It operates through Media and Complementary Services segments. The company operates various radio stations, such as SEN 1116, SEN 1170, SEM 1629, Spirit 621AM, 2CH 1170AM, 1539AM Sydney, 1593AM Melbourne, and 90.7FM Darwin; provides SEN, an application that offers news and information about sports; SENTrack, an independent racing and greyhound radio racing service; and SEN Spirit, a sport and music show; and publishes AFL Record, a weekly match-day magazine content, and Lifestyle1 magazine. It also delivers brand content stories to national, metropolitan, and regional audiences through various platforms, such as radio, print, television, online, in-stadium, and events. In addition, the company provides live satellite and internet-based vision transfer services through Rapid TV; and television production services, such as production, filming, editing, talent sourcing, and delivery to broadcasters and brands. Further, it offers sports marketing agency services, which delivers event, activation, and hospitality experiences; and talent management services, including contract negotiation, marketing and endorsement opportunities, media opportunities, building the talent's personal brand, and planning for the future, as well as the representation of media professionals, such as presenters, broadcasters, and entertainers. The company was formerly known as Pacific Star Network Limited and changed its name to Sports Entertainment Group Limited in November 2020. Sports Entertainment Group Limited was incorporated in 1987 and is based in Southbank, Australia.",
    "website": "http://www.sportsentertainmentnetwork.com.au",
    "zipcode": "3006"
  },
  "SHO.AX": {
    "city": "Twin Waters",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Internet Content & Information",
    "long_name": "SportsHero Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "SPORTSH FPO",
    "state": "QLD",
    "summary": "SportsHero Limited develops sports gamification platform. The company develops and owns Olahbola, a football app in Indonesia. It also provides marketing services. The company is based in Twin Waters, Australia.",
    "website": "http://www.sportshero.live",
    "zipcode": "4564"
  },
  "SLC.AX": {
    "city": "Brisbane",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Telecom Services",
    "long_name": "Superloop Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "SUPERLOOP FPO",
    "state": "QLD",
    "summary": "Superloop Limited engages in the design, development, construction, and operation of independent telecommunications infrastructure in the Asia Pacific region. It offers network solutions for wholesale, enterprise, and channel customers. The company is also involved in the operation of a fixed wireless network; and provision of outsourced cloud and managed services, and cyber security and cyber safety services. In addition, it manages and delivers broadband solutions for campus environments, including student accommodations, hotels, and schools; and offers residential and small business broadband services through fixed wireless or fixed line NBN services. The company was founded in 2014 and is headquartered in Brisbane, Australia.",
    "website": "http://www.superloop.com",
    "zipcode": "4000"
  },
  "SPA.AX": {
    "city": "Rose Park",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Telecom Services",
    "long_name": "Spacetalk Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "SPACETALK FPO",
    "state": "SA",
    "summary": "Spacetalk Limited designs, develops, and commercializes smartphone + watch wearables devices for children, and software for school communication and student absence management in Australia, New Zealand, the United Kingdom, and the United States. The company operates through School Messaging Services, Smart Watches and Apps, and Other segments. It offers Outreach+, a content management and messaging platform for mobile school communications; School Star, a school news and messaging app; and MessageYou, a student absence notification. The company also provides WatchLists, an absence analytics software; and RollMarker, a student attendance management solution. In addition, it supplies Spacetalk smartwatches and applications through retail distribution networks and online sales. The company was formerly known as MGM Wireless Limited and changed its name to Spacetalk Limited in November 2020. Spacetalk Limited is headquartered in Rose Park, Australia.",
    "website": "http://www.spacetalkwatch.com",
    "zipcode": "5067"
  },
  "ST1.AX": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Telecom Services",
    "long_name": "Spirit Technology Solutions Ltd.",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "SPIRIT TEC FPO",
    "state": "VIC",
    "summary": "Spirit Technology Solutions Ltd. provides information technology (IT) and telecommunications services to small and medium size businesses in Australia. It offers managed IT services, including enterprise grade managed Wi-Fi, cyber security, networking, disaster recovery, online backup, and desktop/laptop maintenance services, as well as infrastructure as a service; and Internet services for apartments, green fields, students, and connected communities, as well as for business. The company also provides unified communications; Smart ISDN solution for cloud transition; and phone name solutions. The company was formerly known as Spirit Telecom Limited and changed its name to Spirit Technology Solutions Ltd. in October 2020. Spirit Technology Solutions Ltd. is based in South Melbourne, Australia.",
    "website": "http://www.spirit.com.au",
    "zipcode": "3205"
  },
  "SW1.AX": {
    "city": "Bentley",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Entertainment",
    "long_name": "Swift Media Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "SWIFTMEDIA FPO",
    "state": "WA",
    "summary": "Swift Media Limited, together with its subsidiaries, provides content, communications, and advertising on television screens for out-of-home environments with a focus on the mining and resources, aged care, health and wellbeing, and hospitality and other industries in Australia. It sources, curates, packages, and distributes premium and multilingual content to clients' guests through its cloud-based distribution platform. The company's solutions include on-demand movies, pay television services, free to air broadcast television channels, news, live and scheduled games and events, curated contents on the lifestyle topics, children's contents, international content, and music and radio services. It also offers Internet and telecommunications services; and design and engineering services. The company was formerly known as Swift Networks Group Limited and changed its name to Swift Media Limited in February 2019. Swift Media Limited was incorporated in 1983 and is headquartered in Bentley, Australia.",
    "website": "http://www.swiftmedia.com.au",
    "zipcode": "6102"
  },
  "SWM.AX": {
    "city": "Perth",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Entertainment",
    "long_name": "Seven West Media Limited",
    "market": "au_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "SEVENWEST FPO",
    "state": "WA",
    "summary": "Seven West Media Limited, together with its subsidiaries, operates as an integrated media company in Australia and internationally. The company operates through Television; The West; and Other Business and New Ventures segments. It produces and operates commercial television programming and stations; and distributes programming content. The company also engages in the publishing of newspapers and insert magazines, colourpress, West Australian, Community Newspaper Group, and digital publishing. Seven West Media Limited was incorporated in 1991 and is based in Perth, Australia.",
    "website": "http://www.sevenwestmedia.com.au",
    "zipcode": "6017"
  },
  "SXL.AX": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Entertainment",
    "long_name": "Southern Cross Media Group Limited",
    "market": "au_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "STHNXMEDIA FPO",
    "state": "VIC",
    "summary": "Southern Cross Media Group Limited, together with its subsidiaries, engages in the creation and broadcasting of content on free-to-air commercial radio, television (TV), and online media platforms. It operates through two segments, Regional and Metro. The company owns 78 radio stations and 8 digital radio stations across metropolitan and regional Australia, as well as 34 regional radio stations; and broadcasts 86 free to air TV signals in regional Australia primarily under the Nine Network brand. It also provides audio and visual services, including social media, live events, video, online, and mobile assets that deliver national and local entertainment, and news content. The company was formerly known as Macquarie Media Group. Southern Cross Media Group Limited was incorporated in 2005 and is based in South Melbourne, Australia.",
    "website": "http://www.southerncrossaustereo.com.au",
    "zipcode": "3205"
  },
  "TLS.AX": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Telecom Services",
    "long_name": "Telstra Corporation Limited",
    "market": "au_market",
    "market_cap": "Large Cap",
    "sector": "Communication Services",
    "short_name": "TELSTRA FPO",
    "state": "VIC",
    "summary": "Telstra Corporation Limited provides telecommunications and information services to businesses, governments, and individuals in Australia and internationally. It operates in four segments: Telstra Consumer and Small Business, Telstra Enterprise, Networks and IT, and Telstra InfraCo. The company offers telecommunication products, services, and solutions across mobiles, fixed and mobile broadband, telephony and Pay TV/IPTV, and digital content; and online self-service capabilities, as well as operates inbound and outbound call centers, owned and licensed Telstra shops, and the Telstra dealership network. It also provides sales and contract management; and product management services for data and Internet protocol networks, mobility services, and network applications and services products, such as managed network, unified communications, cloud, industry solutions, and integrated services and monitoring. In addition, the company engages in the development of industry vertical solutions; planning, design, engineering architecture, and construction of Telstra networks, technology, and information technology solutions; and delivering network technologies. Further, it provides telecommunication products and services through its networks and related support systems to other carriers, carriage service providers, and Internet service providers; access to fixed network infrastructure assets; disconnection services; and network services under the Infrastructure Services Agreement and commercial contracts, as well as holds fixed network infrastructure, including data centers, non-mobiles related domestic fiber, copper, HFC cable, international subsea cables, exchanges, poles, ducts, and pipes. The company was formerly known as Australian and Overseas Telecommunications Corporation Limited and changed its name to Telstra Corporation Limited in April 1993. Telstra Corporation Limited was founded in 1901 and is based in Melbourne, Australia.",
    "website": "http://www.telstra.com.au",
    "zipcode": "3000"
  },
  "TLS.NZ": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "NZD",
    "exchange": "NZE",
    "industry": "Telecom Services",
    "long_name": "Telstra Corporation Limited",
    "market": "nz_market",
    "market_cap": "Large Cap",
    "sector": "Communication Services",
    "short_name": "Telstra Corporation Limited Ord",
    "state": "VIC",
    "summary": "Telstra Corporation Limited provides telecommunications and information services to businesses, governments, and individuals in Australia and internationally. It operates in four segments: Telstra Consumer and Small Business, Telstra Enterprise, Networks and IT, and Telstra InfraCo. The company offers telecommunication products, services, and solutions across mobiles, fixed and mobile broadband, telephony and Pay TV/IPTV, and digital content; and online self-service capabilities, as well as operates inbound and outbound call centers, owned and licensed Telstra shops, and the Telstra dealership network. It also provides sales and contract management; and product management services for data and Internet protocol networks, mobility services, and network applications and services products, such as managed network, unified communications, cloud, industry solutions, and integrated services and monitoring. In addition, the company engages in the development of industry vertical solutions; planning, design, engineering architecture, and construction of Telstra networks, technology, and information technology solutions; and delivering network technologies. Further, it provides telecommunication products and services through its networks and related support systems to other carriers, carriage service providers, and Internet service providers; access to fixed network infrastructure assets; disconnection services; and network services under the Infrastructure Services Agreement and commercial contracts, as well as holds fixed network infrastructure, including data centers, non-mobiles related domestic fiber, copper, HFC cable, international subsea cables, exchanges, poles, ducts, and pipes. The company was formerly known as Australian and Overseas Telecommunications Corporation Limited and changed its name to Telstra Corporation Limited in April 1993. Telstra Corporation Limited was founded in 1901 and is based in Melbourne, Australia.",
    "website": "http://www.telstra.com.au",
    "zipcode": "3000"
  },
  "TLSYY": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Telecom Services",
    "long_name": "Telstra Corporation Limited",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Communication Services",
    "short_name": "TELSTRA CORPORATION LTD",
    "state": "VIC",
    "summary": "Telstra Corporation Limited provides telecommunications and information services to businesses, governments, and individuals in Australia and internationally. It operates in four segments: Telstra Consumer and Small Business, Telstra Enterprise, Networks and IT, and Telstra InfraCo. The company offers telecommunication products, services, and solutions across mobiles, fixed and mobile broadband, telephony and Pay TV/IPTV, and digital content; and online self-service capabilities, as well as operates inbound and outbound call centers, owned and licensed Telstra shops, and the Telstra dealership network. It also provides sales and contract management; and product management services for data and Internet protocol networks, mobility services, and network applications and services products, such as managed network, unified communications, cloud, industry solutions, and integrated services and monitoring. In addition, the company engages in the development of industry vertical solutions; planning, design, engineering architecture, and construction of Telstra networks, technology, and information technology solutions; and delivering network technologies. Further, it provides telecommunication products and services through its networks and related support systems to other carriers, carriage service providers, and Internet service providers; access to fixed network infrastructure assets; disconnection services; and network services under the Infrastructure Services Agreement and commercial contracts, as well as holds fixed network infrastructure, including data centers, non-mobiles related domestic fiber, copper, HFC cable, international subsea cables, exchanges, poles, ducts, and pipes. The company was formerly known as Australian and Overseas Telecommunications Corporation Limited and changed its name to Telstra Corporation Limited in April 1993. Telstra Corporation Limited was founded in 1901 and is based in Melbourne, Australia.",
    "website": "http://www.telstra.com.au",
    "zipcode": "3000"
  },
  "TMH.AX": {
    "city": "Perth",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Internet Content & Information",
    "long_name": "The Market Herald Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "THEMRKTHLD FPO",
    "state": "WA",
    "summary": "The Market Herald Limited operates as a digital business news and investor relations platform in Australia. It operates through two segments, The Market Herald and Stockhouse. The company operates The Market Herald, an Australian business digital news masthead; HotCopper, a stock market internet discussion forum; and Stockhouse, which helps individual investors to create and manage their personal wealth by delivering a suite of aggregated news and information, portfolio management and analysis tools, and a forum for capturing and accessing user-generated content, as well as offers digital investor relations and wealth brand consulting services. It also provides sophisticated investor services; and advertising and retail leasing services. The company was formerly known as Hotcopper Holdings Limited and changed its name to The Market Herald Limited in June 2020. The Market Herald Limited was incorporated in 2016 and is based in Perth, Australia.",
    "website": "http://www.themarketherald.com.au",
    "zipcode": "6000"
  },
  "TNY.AX": {
    "city": "Surry Hills",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Internet Content & Information",
    "long_name": "Tinybeans Group Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "TINYBEANS FPO",
    "state": "NSW",
    "summary": "Tinybeans Group Limited develops a mobile and web-based technology platform that allow parents to securely record and share digital data privately and securely. The company offers Tinybeans, a photo sharing platform that provides parents with a safe space to capture and share their children's life stories with family and friends. It operates in the United States and Australia. Tinybeans Group Limited was founded in 2012 and is based in Sydney, Australia.",
    "website": "http://www.tinybeans.com",
    "zipcode": "2010"
  },
  "TNYYF": {
    "city": "Surry Hills",
    "country": "Australia",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Internet Content & Information",
    "long_name": "Tinybeans Group Limited",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "TINYBEANS GROUP PTY LTD",
    "state": "NSW",
    "summary": "Tinybeans Group Limited develops a mobile and web-based technology platform that allow parents to securely record and share digital data privately and securely. The company offers Tinybeans, a photo sharing platform that provides parents with a safe space to capture and share their children's life stories with family and friends. It operates in the United States and Australia. Tinybeans Group Limited was founded in 2012 and is based in Sydney, Australia.",
    "website": "http://www.tinybeans.com",
    "zipcode": "2010"
  },
  "TPG.AX": {
    "city": "North Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Telecom Services",
    "long_name": "TPG Telecom Limited",
    "market": "au_market",
    "market_cap": "Mid Cap",
    "sector": "Communication Services",
    "short_name": "TPGLIMITED FPO",
    "state": "NSW",
    "summary": "TPG Telecom Limited provides telecommunications services. It owns and operates fixed and mobile network infrastructure, including fixed voice and data network with approximately 27,000 kilometers of metropolitan and inter-capital fiber networks; international subsea cable systems connecting Australia to principal hubs in North America and Asia; and mobile network. The company provides its fixed and mobile products under the Vodafone, TPG, iiNet, Internode, Lebara, and AAPT brands. The company, formerly known as Vodafone Hutchison Australia Limited, is based in North Sydney, Australia.",
    "website": "http://www.tpgtelecom.com.au",
    "zipcode": "2060"
  },
  "TSTA.F": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Telecom Services",
    "long_name": "Telstra Corporation Limited",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Communication Services",
    "short_name": "TELSTRA CORP. LTD",
    "state": "VIC",
    "summary": "Telstra Corporation Limited provides telecommunications and information services to businesses, governments, and individuals in Australia and internationally. It operates in four segments: Telstra Consumer and Small Business, Telstra Enterprise, Networks and IT, and Telstra InfraCo. The company offers telecommunication products, services, and solutions across mobiles, fixed and mobile broadband, telephony and Pay TV/IPTV, and digital content; and online self-service capabilities, as well as operates inbound and outbound call centers, owned and licensed Telstra shops, and the Telstra dealership network. It also provides sales and contract management; and product management services for data and Internet protocol networks, mobility services, and network applications and services products, such as managed network, unified communications, cloud, industry solutions, and integrated services and monitoring. In addition, the company engages in the development of industry vertical solutions; planning, design, engineering architecture, and construction of Telstra networks, technology, and information technology solutions; and delivering network technologies. Further, it provides telecommunication products and services through its networks and related support systems to other carriers, carriage service providers, and Internet service providers; access to fixed network infrastructure assets; disconnection services; and network services under the Infrastructure Services Agreement and commercial contracts, as well as holds fixed network infrastructure, including data centers, non-mobiles related domestic fiber, copper, HFC cable, international subsea cables, exchanges, poles, ducts, and pipes. The company was formerly known as Australian and Overseas Telecommunications Corporation Limited and changed its name to Telstra Corporation Limited in April 1993. Telstra Corporation Limited was founded in 1901 and is based in Melbourne, Australia.",
    "website": "http://www.telstra.com.au",
    "zipcode": "3000"
  },
  "TSTD.F": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Telecom Services",
    "long_name": "Telstra Corporation Limited",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Communication Services",
    "short_name": "TELSTRA CORP. ADR/5",
    "state": "VIC",
    "summary": "Telstra Corporation Limited provides telecommunications and information services to businesses, governments, and individuals in Australia and internationally. It operates in four segments: Telstra Consumer and Small Business, Telstra Enterprise, Networks and IT, and Telstra InfraCo. The company offers telecommunication products, services, and solutions across mobiles, fixed and mobile broadband, telephony and Pay TV/IPTV, and digital content; and online self-service capabilities, as well as operates inbound and outbound call centers, owned and licensed Telstra shops, and the Telstra dealership network. It also provides sales and contract management; and product management services for data and Internet protocol networks, mobility services, and network applications and services products, such as managed network, unified communications, cloud, industry solutions, and integrated services and monitoring. In addition, the company engages in the development of industry vertical solutions; planning, design, engineering architecture, and construction of Telstra networks, technology, and information technology solutions; and delivering network technologies. Further, it provides telecommunication products and services through its networks and related support systems to other carriers, carriage service providers, and Internet service providers; access to fixed network infrastructure assets; disconnection services; and network services under the Infrastructure Services Agreement and commercial contracts, as well as holds fixed network infrastructure, including data centers, non-mobiles related domestic fiber, copper, HFC cable, international subsea cables, exchanges, poles, ducts, and pipes. The company was formerly known as Australian and Overseas Telecommunications Corporation Limited and changed its name to Telstra Corporation Limited in April 1993. Telstra Corporation Limited was founded in 1901 and is based in Melbourne, Australia.",
    "website": "http://www.telstra.com.au",
    "zipcode": "3000"
  },
  "TTRAF": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Telecom Services",
    "long_name": "Telstra Corporation Limited",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Communication Services",
    "short_name": "TELSTRA CORPORATION LTD",
    "state": "VIC",
    "summary": "Telstra Corporation Limited provides telecommunications and information services to businesses, governments, and individuals in Australia and internationally. It operates in four segments: Telstra Consumer and Small Business, Telstra Enterprise, Networks and IT, and Telstra InfraCo. The company offers telecommunication products, services, and solutions across mobiles, fixed and mobile broadband, telephony and Pay TV/IPTV, and digital content; and online self-service capabilities, as well as operates inbound and outbound call centers, owned and licensed Telstra shops, and the Telstra dealership network. It also provides sales and contract management; and product management services for data and Internet protocol networks, mobility services, and network applications and services products, such as managed network, unified communications, cloud, industry solutions, and integrated services and monitoring. In addition, the company engages in the development of industry vertical solutions; planning, design, engineering architecture, and construction of Telstra networks, technology, and information technology solutions; and delivering network technologies. Further, it provides telecommunication products and services through its networks and related support systems to other carriers, carriage service providers, and Internet service providers; access to fixed network infrastructure assets; disconnection services; and network services under the Infrastructure Services Agreement and commercial contracts, as well as holds fixed network infrastructure, including data centers, non-mobiles related domestic fiber, copper, HFC cable, international subsea cables, exchanges, poles, ducts, and pipes. The company was formerly known as Australian and Overseas Telecommunications Corporation Limited and changed its name to Telstra Corporation Limited in April 1993. Telstra Corporation Limited was founded in 1901 and is based in Melbourne, Australia.",
    "website": "http://www.telstra.com.au",
    "zipcode": "3000"
  },
  "TUA.AX": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Telecom Services",
    "long_name": "Tuas Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "TUAS LTD FPO",
    "state": "NSW",
    "summary": "Tuas Limited constructs and operates a mobile cellular network in Singapore. It also offers other information technology services. The company was incorporated in 2020 and is headquartered in Sydney, Australia.",
    "website": "http://www.tuas.com.au",
    "zipcode": "2000"
  },
  "UWL.AX": {
    "city": "Adelaide",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Telecom Services",
    "long_name": "Uniti Group Limited",
    "market": "au_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "UNITIGROUP FPO",
    "state": "SA",
    "summary": "Uniti Group Limited provides Internet, and associated telecommunications products and services in Australia. It operates through three segments: Consumer & Business Enablement, Wholesale & Infrastructure, and Specialty Services. The Consumer & Business Enablement segment retails telecommunications products and services, including broadband and voice services across fibre access networks. The Wholesale & Infrastructure segment designs, installs, operates, and maintenance fibre-to-the-premises open access wholesale telecommunication last mile' network infrastructure. The Specialty Services segment offers premium voice services to approximately 13, 1300, 1800 calling services. This segment also offers value-added software as a service data analytics and call tracking application, as well as the leasing of phonewords on the numbers. The company was formerly known as Uniti Wireless Limited and changed its name to Uniti Group Limited in August 2019. Uniti Group Limited was incorporated in 2012 and is based in Adelaide, Australia.",
    "website": "http://www.unitigrouplimited.com",
    "zipcode": "5000"
  },
  "VN8.AX": {
    "city": "Milton",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Telecom Services",
    "long_name": "Vonex Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "VONEXLTD FPO",
    "state": "QLD",
    "summary": "Vonex Limited provides telecommunications services in Australia and the United States. The company operates through Retail and Wholesale segments. It offers mobile, internet, traditional fixed lines, and hosted PBX and VoIP services for the small to medium enterprise customers under the Vonex brand, as well as sells hardware. The company also provides Vonex PBX and call termination services, and NBN and 4G mobile broadband at wholesale rates via a white label model. In addition, it develops various technologies in the telecommunications industry, including cloud-hosted PBX system; and Oper8tor App, a multi-platform real-time voice, messaging, and social media app that allows users to connect with various social media friends, followers, and contacts. The company is based in Milton, Australia.",
    "website": "http://www.vonex.com.au",
    "zipcode": "4064"
  },
  "VOC.AX": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Telecom Services",
    "long_name": "Vocus Group Limited",
    "market": "au_market",
    "market_cap": "Mid Cap",
    "sector": "Communication Services",
    "short_name": "VOCUS FPO",
    "state": "VIC",
    "summary": "Vocus Group Limited provides fiber and network solutions to enterprise, government, wholesale, small business, and residential customers in Australia and New Zealand. The company operates through Vocus Network Services, Retail, and New Zealand segments. It offers telecommunications products and services, such as networks and connectivity, data centers, cloud platforms and security, and workplace collaboration under the Vocus, Slingshot, Flip, and Orcon brands. The company also provides broadband, voice, and mobile services under the Dodo, iPrimus, Commander, and Engin brands, as well as Fetch TV services. In addition, it supplies, retails, and markets gas and electricity services; and offers insurance products. The company was formerly known as Vocus Communications Limited and changed its name to Vocus Group Limited in December 2016. Vocus Group Limited was founded in 2007 and is headquartered in Melbourne, Australia.",
    "website": "http://www.vocusgroup.com.au",
    "zipcode": "3000"
  },
  "VOQ.F": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Telecom Services",
    "long_name": "Vocus Group Limited",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Communication Services",
    "short_name": "VOCUS GROUP LTD.",
    "state": "VIC",
    "summary": "Vocus Group Limited provides fiber and network solutions to enterprise, government, wholesale, small business, and residential customers in Australia and New Zealand. The company operates through Vocus Network Services, Retail, and New Zealand segments. It offers telecommunications products and services, such as networks and connectivity, data centers, cloud platforms and security, and workplace collaboration under the Vocus, Slingshot, Flip, and Orcon brands. The company also provides broadband, voice, and mobile services under the Dodo, iPrimus, Commander, and Engin brands, as well as Fetch TV services. In addition, it supplies, retails, and markets gas and electricity services; and offers insurance products. The company was formerly known as Vocus Communications Limited and changed its name to Vocus Group Limited in December 2016. Vocus Group Limited was founded in 2007 and is headquartered in Melbourne, Australia.",
    "website": "http://www.vocusgroup.com.au",
    "zipcode": "3000"
  },
  "WA7.F": {
    "city": "Perth",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Entertainment",
    "long_name": "Seven West Media Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "SEVEN WEST MEDIA LTD",
    "state": "WA",
    "summary": "Seven West Media Limited, together with its subsidiaries, operates as an integrated media company in Australia and internationally. The company operates through Television; The West; and Other Business and New Ventures segments. It produces and operates commercial television programming and stations; and distributes programming content. The company also engages in the publishing of newspapers and insert magazines, colourpress, West Australian, Community Newspaper Group, and digital publishing. Seven West Media Limited was incorporated in 1991 and is based in Perth, Australia.",
    "website": "http://www.sevenwestmedia.com.au",
    "zipcode": "6017"
  },
  "WN6.F": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Internet Content & Information",
    "long_name": "carsales.com Ltd",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Communication Services",
    "short_name": "CARSALES.COM",
    "state": "VIC",
    "summary": "carsales.com Ltd engages operates digital automotive marketplace in Australia, South Korea, Brazil, Mexico, Chile, and Argentina. It operates in Online Advertising Services; Data, Research and Services; Latin America; and Asia segments. The Online Advertising Services segment offers classified advertising that allows dealers and consumers to advertise automotive and non-automotive goods and services for sale across the carsales network; and services, including subscriptions, lead fees, and priority placement services on automotive and non-automotive goods and services. It also provides display advertising services, such as placing advertisements on carsales network websites for corporate customers comprising automotive manufacturers/importers, and finance and insurance companies. In addition, this segment holds investments in tyresales.com.au, an online tyre advertisement website that allows consumers to transact and purchase tyres; and RedBook Inspect, which provides inspection services published online as part of classified advertisements. The Data, Research and Services segment offers software, analysis, research and reporting, valuation, and website development and hosting services, as well as photography services. The Latin America segment is involved in the provision of online automotive classifieds and media advertising services. The Asia segment provides online automotive classifieds, media advertising, and automotive data services. carsales.com Ltd was founded in 1997 and is headquartered in Melbourne, Australia.",
    "website": "http://www.carsales.com.au",
    "zipcode": "3121"
  }
}
