{"SCN-R.BK": {"short_name": "SCAN INTER PUBLIC COMPANY LIMIT", "long_name": "Scan Inter Public Company Limited", "summary": "Scan Inter Public Company Limited, together with its subsidiaries, primarily engages in trading natural gas through vehicle service stations in Thailand. The company operates through four segments: Gas Related Business, Car Dealer and Spare Parts, Renewable Energy, and Others. The Gas Related Business segment engages in trading gas through natural gas for vehicle (NGV) service stations; filling gas of industrial compressed natural gas for industrial applications; providing service for quality improvement of natural gas; and transporting natural gas. This segment is also involved in the design, installation, repair, and maintenance of natural gas dispenser equipment; and design and installation of gas system in vehicles, as well as the testing of vehicle cylinders. It owns 13 NGV service stations. The Car Dealer and Spare Parts segment trades in cars and related spare parts. The Renewable Energy segment operates a solar power plant. The Others segment trades in liquid carbon dioxide, engine oil, and lubricants; and operates convenient stores, as well as provides transportation, warehousing, and distribution services.it also exports battery and glass. Scan Inter Public Company Limited is headquartered in Nonthaburi, Thailand.", "currency": "THB", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Nonthaburi"}, "WP-R.BK": {"short_name": "WP ENERGY PUBLIC COMPANY LIMITE", "long_name": "WP Energy Public Company Limited", "summary": "WP Energy Public Company Limited, together with its subsidiaries, trades in liquefied petroleum gas (LPG) under the World Gas brand name. The company operates through Sale of LPG and Transportation segments. It distributes LPG cylinder to the LPG gas filling plants, retail gas distributors, and industrial and household users, as well as offers specialized LPG cylinders for forklift trucks. The company also transports oil, gas, and chemical substances; operates gas station; produces and distributes electricity; and leases vehicles. WP Energy Public Company Limited was founded in 2014 and is based in Bangkok, Thailand.", "currency": "THB", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}}