{
    "1OQ.F": {
        "short_name": "HAFNIA LTD  DL-,01",
        "long_name": "Hafnia Limited",
        "summary": "Hafnia Limited, owns and operates oil product tankers. The company operates in four segments: Long Range II (LR2), Long Range I (LR1), Medium Range (MR), and Handy size (Handy). It transports oil and oil products to national and international oil companies, and chemical companies, as well as trading and utility companies. The company provides ship owning, ship-management, chartering, investment, and agency office services. As of April 29, 2020, the company operated a fleet of 174 vessels in pools, including newbuilds, of which 102 are owned or chartered-in including six owned LR2s, 27 owned and nine chartered-in LR1s, 41 owned and six chartered-in MRs, and 13 owned Handy vessels. The company is based in Hamilton, Bermuda. Hafnia Limited is a subsidiary of BW Group Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "2020.OL": {
        "short_name": "2020 BULKERS LTD",
        "long_name": "2020 Bulkers Ltd",
        "summary": "2020 Bulkers Ltd owns and operates large dry bulk vessels worldwide. The company operates six Newcastlemax dry bulk vessels. 2020 Bulkers Ltd was incorporated in 2017 and is based in Hamilton, Bermuda.",
        "currency": "NOK",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "2QAA.F": {
        "short_name": "AURIS MEDICAL HLDG SF-,01",
        "long_name": "Auris Medical Holding Ltd.",
        "summary": "Auris Medical Holding Ltd., a development-stage biopharmaceutical company, focuses on the development of pharmaceutical products for the treatment and prevention of peripheral and central nervous disorders. The company's Phase 3 programs under the development include Keyzilen (AM-101) for the treatment of acute inner ear tinnitus; and Sonsuvi (AM-111) for the treatment of acute inner ear hearing loss. It is also developing AM-125 that is in Phase 2 clinical trial for the intranasal treatment of acute peripheral vertigo; and AM-201, which is in Phase 1b clinical trial for the prevention of weight gain and drowsiness, which are side effects of various antipsychotic drugs, as well as AM-102 for the tinnitus treatment. The company has a collaboration and license agreement with INSERM; and Xigen S.A. to develop, manufacture, and commercialize pharmaceutical products, as well as drug delivery devices and formulations for local administration of therapeutic substances to the inner ear for the treatment of ear disorders. Auris Medical Holding Ltd. was founded in 1998 and is headquartered in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "2WH.F": {
        "short_name": "WATFORD HLDGS LTD  DL-,01",
        "long_name": "Watford Holdings Ltd.",
        "summary": "Watford Holdings Ltd., together with its subsidiaries, operates as a property, casualty, and mortgage insurance and reinsurance company worldwide. The company offers casualty reinsurance products, such as executive assurance, medical malpractice liability, other professional liability, workers' compensation, umbrella liability; other specialty reinsurance, including personal and commercial automobile, mortgage, surety, accident and health, workers' compensation catastrophe, agriculture and marine, and aviation; and property catastrophe reinsurance, as well as other insurance programs comprising general liability, umbrella liability, professional liability, personal and commercial automobile, and inland marine and property business with minimal catastrophe exposure. The company was founded in 2013 and is headquartered in Pembroke, Bermuda.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Insurance—Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "31L.F": {
        "short_name": "SYLVANIA PLAT. DL 0,01",
        "long_name": "Sylvania Platinum Limited",
        "summary": "Sylvania Platinum Limited primarily engages in the retreatment of platinum group metals (PGM) bearing chrome tailings materials in South Africa and Mauritius. The company produces PGMs, such as platinum, palladium, and rhodium. It holds interests in the Sylvania dump operations, as well as Northern Limb projects. The company is based in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Other Precious Metals & Mining",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "35G.F": {
        "short_name": "GENPACT LTD  DL 0,01",
        "long_name": "Genpact Limited",
        "summary": "Genpact Limited provides business process outsourcing and information technology (IT) services North and Latin America, India, rest of Asia, and Europe. It operates in three segments: Banking, Capital Markets and Insurance; Consumer Goods, Retail, Life Sciences and Healthcare; and High Tech, Manufacturing and Services. The company's finance and accounting services include accounts payable, such as document management, invoice processing, approval and resolution management, and travel and expense processing; invoice-to-cash services, including customer master data management, credit and contract management, fulfillment, billing, collections, and dispute management services; record to report services comprising accounting, treasury, tax, product cost accounting, and closing and reporting services; enterprise performance management consisting of budgeting, forecasting, and business performance reporting; and enterprise risk and compliance services, including operational risks and controls. It also provides transformation services; core industry operation services; and sourcing, procurement, and supply chain services, such as direct and indirect strategic sourcing, category management, spend analytics, procurement operations, master data management, and other procurement and supply chain advisory services. The company's IT services comprise end-user computing support, infrastructure management, application production support, and database management services, as well as business intelligence and data, enterprise resource planning, quality assurance, technology integration, and business intelligence reporting services. It serves banking, capital markets, insurance, consumer goods, retail, life sciences, healthcare, high tech, and manufacturing and services industries. Genpact Limited was founded in 1997 and is based in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "3RR.F": {
        "short_name": "ROMREAL LTD.  EO 0,0025",
        "long_name": "RomReal Limited",
        "summary": "RomReal Limited, together with its subsidiaries, engages in property investment and development in Romania. The company owns a portfolio of properties, primarily in Constanta and Ovidiu. Its plots are primarily suited for residential and commercial developments. As of December 31, 2019, the company's land bank comprised 275,835 square meters. RomReal Limited was founded in 2005 and is based in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "3T7.F": {
        "short_name": "TEXTAINER GROUP HLDGS LTD",
        "long_name": "Textainer Group Holdings Limited",
        "summary": "Textainer Group Holdings Limited, through its subsidiaries, engages in the purchase, ownership, management, leasing, and disposal of a fleet of intermodal containers worldwide. It operates through three segments: Container Ownership, Container Management, and Container Resale. The company owns and leases standard dry freight containers, refrigerated, and other special-purpose containers. It also provides container management, acquisition, and disposal services to affiliated and unaffiliated container investors. In addition, the company sells containers from its fleet, as well as purchases, leases, or resells containers from shipping line customers, container traders, and other sellers of containers. It operates a fleet of approximately 2.3 million containers, representing 3.5 million twenty-foot equivalent units. The company primarily serves shipping lines, as well as freight forwarding companies and the United States military. Textainer Group Holdings Limited was founded in 1979 and is headquartered in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "48R.F": {
        "short_name": "ENSTAR GROUP LTD  DL-,01",
        "long_name": "Enstar Group Limited",
        "summary": "Enstar Group Limited acquires and manages insurance and reinsurance companies, and portfolios of insurance and reinsurance business in run-off. It operates in three segments: Non-Life Run-Off, Atrium, and StarStone. The Non-Life Run-Off segment engages in the running off property and casualty, and other non-life lines of businesses. It also provides consulting services, including claims inspection, claims validation, reinsurance asset collection, and IT consulting services to the insurance and reinsurance industry. The Atrium segment is involved in underwriting various classes, including marine, aviation, transit, property and casualty binding authorities, reinsurance, accident and health, and non marine direct and facultative. The StarStone segment offers a range of property, casualty, and specialty insurance products to multi-national, and small and middle-market clients. It operates in Bermuda, the United States, the United Kingdom, Continental Europe, Australia, and internationally. The company was formerly known as Castlewood Holdings Limited and changed its name to Enstar Group Limited in January 2007. Enstar Group Limited was founded in 2001 and is based in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Insurance—Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "4OWA.F": {
        "short_name": "MAIDEN HLDGS LTD  DL -,01",
        "long_name": "Maiden Holdings, Ltd.",
        "summary": "Maiden Holdings, Ltd., through its subsidiaries, provides property and casualty reinsurance solutions to regional and specialty insurers primarily in Europe and internationally. The company writes treaties on a quota share basis and excess of loss basis. It also offers auto and credit life insurance products through its insurer partners to retail clients. The company was founded in 2007 and is headquartered in Pembroke, Bermuda.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Insurance—Reinsurance",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "A61.F": {
        "short_name": "ARDMORE SHIPPING C.DL-,01",
        "long_name": "Ardmore Shipping Corporation",
        "summary": "Ardmore Shipping Corporation, together with its subsidiaries, engages in the seaborne transportation of petroleum products and chemicals worldwide. As of August 30, 2019, the company operated a fleet of 25 double-hulled product and chemical tankers. It serves oil majors, oil companies, oil and chemical traders, and chemical companies. The company was founded in 2010 and is based in Pembroke, Bermuda.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "ACGL": {
        "short_name": "Arch Capital Group Ltd.",
        "long_name": "Arch Capital Group Ltd.",
        "summary": "Arch Capital Group Ltd., together with its subsidiaries, provides insurance, reinsurance, and mortgage insurance products worldwide. The company's Insurance segment offers primary and excess casualty coverages; loss sensitive primary casualty insurance programs; collateral protection, debt cancellation, and service contract reimbursement products; directors' and officers' liability, errors and omissions liability, employment practices and fiduciary liability, crime, professional indemnity, and other financial related coverages; medical professional and general liability insurance coverages; and workers' compensation and umbrella liability, as well as commercial automobile and inland marine products. It also provides property, energy, marine, and aviation insurance; travel insurance; accident, disability, and medical plan insurance coverages; captive insurance programs; and contract and commercial surety coverages. This segment markets its products through a group of licensed independent retail and wholesale brokers. Its Reinsurance segment provides reinsurance for third party liability and workers' compensation exposures; marine and aviation reinsurance; surety, accident and health, workers' compensation catastrophe, agriculture, trade credit, and political risk products; reinsurance protection for catastrophic losses, and personal lines and commercial property exposures; life reinsurance; casualty clash; and risk management solutions. This segment markets its reinsurance products through brokers. The company's Mortgage segment offers private mortgage insurance covering one-to-four family residential mortgages; mortgage insurance to cover previously originated residential loans; quota share reinsurance; and credit risk-sharing products. This segment sells its products through direct basis and through brokers to mortgage originators. The company was founded in 1995 and is based in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Diversified",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "ACGLO": {
        "short_name": "Arch Capital Group Ltd. - Depos",
        "long_name": "Arch Capital Group Ltd.",
        "summary": "Arch Capital Group Ltd., together with its subsidiaries, provides insurance, reinsurance, and mortgage insurance products worldwide. The company's Insurance segment offers primary and excess casualty coverages; loss sensitive primary casualty insurance programs; collateral protection, debt cancellation, and service contract reimbursement products; directors' and officers' liability, errors and omissions liability, employment practices and fiduciary liability, crime, professional indemnity, and other financial related coverages; medical professional and general liability insurance coverages; and workers' compensation and umbrella liability, as well as commercial automobile and inland marine products. It also provides property, energy, marine, and aviation insurance; travel insurance; accident, disability, and medical plan insurance coverages; captive insurance programs; and contract and commercial surety coverages. This segment markets its products through a group of licensed independent retail and wholesale brokers. Its Reinsurance segment provides reinsurance for third party liability and workers' compensation exposures; marine and aviation reinsurance; surety, accident and health, workers' compensation catastrophe, agriculture, trade credit, and political risk products; reinsurance protection for catastrophic losses, and personal lines and commercial property exposures; life reinsurance; casualty clash; and risk management solutions. This segment markets its reinsurance products through brokers. The company's Mortgage segment offers private mortgage insurance covering one-to-four family residential mortgages; mortgage insurance to cover previously originated residential loans; quota share reinsurance; and credit risk-sharing products. This segment sells its products through direct basis and through brokers to mortgage originators. The company was founded in 1995 and is based in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Diversified",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "ACGLP": {
        "short_name": "Arch Capital Group Ltd. - Depos",
        "long_name": "Arch Capital Group Ltd.",
        "summary": "Arch Capital Group Ltd., together with its subsidiaries, provides insurance, reinsurance, and mortgage insurance products worldwide. The company's Insurance segment offers primary and excess casualty coverages; loss sensitive primary casualty insurance programs; collateral protection, debt cancellation, and service contract reimbursement products; directors' and officers' liability, errors and omissions liability, employment practices and fiduciary liability, crime, professional indemnity, and other financial related coverages; medical professional and general liability insurance coverages; and workers' compensation and umbrella liability, as well as commercial automobile and inland marine products. It also provides property, energy, marine, and aviation insurance; travel insurance; accident, disability, and medical plan insurance coverages; captive insurance programs; and contract and commercial surety coverages. This segment markets its products through a group of licensed independent retail and wholesale brokers. Its Reinsurance segment provides reinsurance for third party liability and workers' compensation exposures; marine and aviation reinsurance; surety, accident and health, workers' compensation catastrophe, agriculture, trade credit, and political risk products; reinsurance protection for catastrophic losses, and personal lines and commercial property exposures; life reinsurance; casualty clash; and risk management solutions. This segment markets its reinsurance products through brokers. The company's Mortgage segment offers private mortgage insurance covering one-to-four family residential mortgages; mortgage insurance to cover previously originated residential loans; quota share reinsurance; and credit risk-sharing products. This segment sells its products through direct basis and through brokers to mortgage originators. The company was founded in 1995 and is based in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Diversified",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "AGAS.OL": {
        "short_name": "AVANCE GAS HLDGS L",
        "long_name": "Avance Gas Holding Ltd",
        "summary": "Avance Gas Holding Ltd, together with its subsidiaries, engages in the transportation of liquefied petroleum gas (LPG) worldwide. The company transports LPG from the Middle East Gulf and the United States Gulf/the United States East Coast to destinations in Europe, South America, India, and Asia. As of December 31, 2019, it operated through a fleet of 14 very large gas carriers. The company was founded in 2007 and is based in Hamilton, Bermuda.",
        "currency": "NOK",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "AGO": {
        "short_name": "Assured Guaranty Ltd.",
        "long_name": "Assured Guaranty Ltd.",
        "summary": "Assured Guaranty Ltd., through its subsidiaries, provides credit protection products to public finance, infrastructure, and structured finance markets in the United States and internationally. The company operates in two segments, Insurance and Asset Management. It offers financial guaranty insurance that protects holders of debt instruments and other monetary obligations from defaults in scheduled payments. The company insures and reinsures various debt obligations, including bonds issued by the United States state, governmental authorities or municipal governmental authorities; and notes issued to finance infrastructure projects. It also insures and reinsures various types of the U.S. public finance obligations, such as general obligation, tax-backed, municipal utility, transportation, healthcare, higher education, infrastructure, housing revenue, investor-owned utility, renewable energy, and other public finance bonds; non-U.S. public finance obligations comprising regulated utilities, infrastructure finance, sovereign and sub-sovereign, renewable energy bonds, pooled infrastructure, and other public finance obligations; and the U.S. and non-U.S. Structured finance obligations, including residential mortgage-backed securities, insurance securitization obligations, consumer receivables securities, pooled corporate obligations, financial products, and other structured finance securities. In addition, the company provides asset management services comprising investment advisory services, including management of collateralized loan obligations and opportunity funds to outside investors. It markets its financial guaranty insurance directly to issuers and underwriters of public finance and structured finance securities, as well as to investors in such obligations. Assured Guaranty Ltd. was founded in 2003 and is headquartered in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Specialty",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "AHL-PC": {
        "short_name": "Aspen Insurance Holdings Limite",
        "long_name": "Aspen Insurance Holdings Limited",
        "summary": "Aspen Insurance Holdings Limited, through its subsidiaries, engages in insurance and reinsurance businesses in Bermuda, the United States, the United Kingdom, and internationally. The company's Aspen Insurance segment offers property and casualty insurance products, including U.S. and U.K. commercial property, commercial liability, U.S. primary casualty, excess casualty, environmental liability, and railroad liability products; and marine, aviation, and energy insurance products, such as marine and energy liability, onshore and offshore energy physical damage, marine hull, specie, inland and ocean marine, and aviation insurance products. This segment also provides financial and professional lines insurance products comprising financial and corporate risks, professional liability, management liability, credit and political risks, crisis management, accident and health, surety risks, and technology liability insurance products. The company's Aspen Reinsurance segment offers property catastrophe reinsurance products; other property reinsurance products; casualty reinsurance products, including U.S. treaty, international treaty, and casualty facultative reinsurance products; and specialty reinsurance products comprising credit and surety, agriculture, mortgage, marine, aviation, terrorism, engineering, cyber, and other specialty lines. It distributes its products primarily through brokers and reinsurance intermediaries. Aspen Insurance Holdings Limited was founded in 2002 and is headquartered in Hamilton, Bermuda. Aspen Insurance Holdings Limited operates as a subsidiary of Highlands Holdings, Ltd.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Property & Casualty",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "AHL-PD": {
        "short_name": "Aspen Insurance Holdings Limite",
        "long_name": "Aspen Insurance Holdings Limited",
        "summary": "Aspen Insurance Holdings Limited, through its subsidiaries, engages in insurance and reinsurance businesses in Bermuda, the United States, the United Kingdom, and internationally. The company's Aspen Insurance segment offers property and casualty insurance products, including U.S. and U.K. commercial property, commercial liability, U.S. primary casualty, excess casualty, environmental liability, and railroad liability products; and marine, aviation, and energy insurance products, such as marine and energy liability, onshore and offshore energy physical damage, marine hull, specie, inland and ocean marine, and aviation insurance products. This segment also provides financial and professional lines insurance products comprising financial and corporate risks, professional liability, management liability, credit and political risks, crisis management, accident and health, surety risks, and technology liability insurance products. The company's Aspen Reinsurance segment offers property catastrophe reinsurance products; other property reinsurance products; casualty reinsurance products, including U.S. treaty, international treaty, and casualty facultative reinsurance products; and specialty reinsurance products comprising credit and surety, agriculture, mortgage, marine, aviation, terrorism, engineering, cyber, and other specialty lines. It distributes its products primarily through brokers and reinsurance intermediaries. Aspen Insurance Holdings Limited was founded in 2002 and is headquartered in Hamilton, Bermuda. Aspen Insurance Holdings Limited operates as a subsidiary of Highlands Holdings, Ltd.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Property & Casualty",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "AHL-PE": {
        "short_name": "Aspen Insurance Holdings Limite",
        "long_name": "Aspen Insurance Holdings Limited",
        "summary": "Aspen Insurance Holdings Limited, through its subsidiaries, engages in insurance and reinsurance businesses in Bermuda, the United States, the United Kingdom, and internationally. The company's Aspen Insurance segment offers property and casualty insurance products, including U.S. and U.K. commercial property, commercial liability, U.S. primary casualty, excess casualty, environmental liability, and railroad liability products; and marine, aviation, and energy insurance products, such as marine and energy liability, onshore and offshore energy physical damage, marine hull, specie, inland and ocean marine, and aviation insurance products. This segment also provides financial and professional lines insurance products comprising financial and corporate risks, professional liability, management liability, credit and political risks, crisis management, accident and health, surety risks, and technology liability insurance products. The company's Aspen Reinsurance segment offers property catastrophe reinsurance products; other property reinsurance products; casualty reinsurance products, including U.S. treaty, international treaty, and casualty facultative reinsurance products; and specialty reinsurance products comprising credit and surety, agriculture, mortgage, marine, aviation, terrorism, engineering, cyber, and other specialty lines. It distributes its products primarily through brokers and reinsurance intermediaries. Aspen Insurance Holdings Limited was founded in 2002 and is headquartered in Hamilton, Bermuda. Aspen Insurance Holdings Limited operates as a subsidiary of Highlands Holdings, Ltd.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Property & Casualty",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "AOREF": {
        "short_name": "AMERICAN OVERSEAS GROUP LTD",
        "long_name": "American Overseas Group Limited",
        "summary": "American Overseas Group Limited, through its subsidiaries, provides property/casualty insurance and reinsurance products and services in Bermuda, Barbados, and the United States. It offers non-standard auto insurance products; and specialty risk transfer and management services. The company was formerly known as RAM Holdings Ltd. and changed its name to American Overseas Group Limited in December 2011. American Overseas Group Limited was founded in 1998 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Reinsurance",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "ARGO": {
        "short_name": "Argo Group International Holdin",
        "long_name": "Argo Group International Holdings, Ltd.",
        "summary": "Argo Group International Holdings, Ltd. underwrites specialty insurance and reinsurance products in the property and casualty markets. The company operates in two segments, U.S. Operations and International Operations. The U.S. Operations segment underwrites primary and excess specialty casualty, and commercial multi-peril, as well as contract, product, environmental, and auto liability products; and general, auto, management, errors and omissions, and public entity liability, as well as workers compensation, and surety and inland marine risks. This segment distributes its products through a network of wholesale agents and brokers. Its International Operations segment offers coverage for long-tail casualty and general liability; property catastrophe reinsurance, and direct and facultative excess insurance; professional indemnity, directors and officer's liability, and medical malpractice; and North American and international binders, and residential collateral protection for lending institutions. This segment also underwrites risks of general liability, international casualty, and motor treaties; and personal accident, aviation, cargo, yachts, and onshore and offshore marine insurance. This segment distributes its products through brokers and third-party intermediaries. Argo Group International Holdings, Ltd. is headquartered in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Property & Casualty",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "ARGO-PA": {
        "short_name": "Argo Group International Holdin",
        "long_name": "Argo Group International Holdings, Ltd.",
        "summary": "Argo Group International Holdings, Ltd. underwrites specialty insurance and reinsurance products in the property and casualty markets. The company operates in two segments, U.S. Operations and International Operations. The U.S. Operations segment underwrites primary and excess specialty casualty, and commercial multi-peril, as well as contract, product, environmental, and auto liability products; and general, auto, management, errors and omissions, and public entity liability, as well as workers compensation, and surety and inland marine risks. This segment distributes its products through a network of wholesale agents and brokers. Its International Operations segment offers coverage for long-tail casualty and general liability; property catastrophe reinsurance, and direct and facultative excess insurance; professional indemnity, directors and officer's liability, and medical malpractice; and North American and international binders, and residential collateral protection for lending institutions. This segment also underwrites risks of general liability, international casualty, and motor treaties; and personal accident, aviation, cargo, yachts, and onshore and offshore marine insurance. This segment distributes its products through brokers and third-party intermediaries. Argo Group International Holdings, Ltd. is headquartered in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Property & Casualty",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "ARHVF": {
        "short_name": "ARCHER LTD",
        "long_name": "Archer Limited",
        "summary": "Archer Limited, an oilfield service company, provides various oilfield products and services to the oil and gas industry. It operates through two segments, Eastern Hemisphere and Western Hemisphere. The company provides oiltools, such as plugs and abandonment (P&A), slot recovery and P&A, cementing, and well cleaning solutions; land drilling and platform drilling services; and modular drilling rigs. It also offers engineering services, such as project management, construction and installations, multidiscipline engineering, consulting, and inspection services. In addition, the company provides cased hole logging, conveyance and mechanical/slickline, and R&D and technology development services. Further, it offers fluids, guarantor, international personnel, management, and equipment rental services, as well as performs rig inspections. The company operates in Angola, Argentina, Australia, Bolivia, Brazil, Canada, Congo, Indonesia, Malaysia, Nigeria, Norway, Saudi Arabia, the United Arab Emirates, the United Kingdom, and the United States. The company was formerly known as Seawell Limited and changed its name to Archer Limited in May 2011. Archer Limited was founded in 2007 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "ASC": {
        "short_name": "Ardmore Shipping Corporation",
        "long_name": "Ardmore Shipping Corporation",
        "summary": "Ardmore Shipping Corporation, together with its subsidiaries, engages in the seaborne transportation of petroleum products and chemicals worldwide. As of August 30, 2019, the company operated a fleet of 25 double-hulled product and chemical tankers. It serves oil majors, oil companies, oil and chemical traders, and chemical companies. The company was founded in 2010 and is based in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "ASGXF": {
        "short_name": "ASIA GLOBAL CROSSING",
        "long_name": "Asia Global Crossing Ltd.",
        "summary": "Asia Global Crossing, Ltd. does not have significant operations. Prior to November 2002, the company operated as a pan-Asian telecommunications carrier providing telecommunications services, including data and Web-hosting services to wholesale and business customers. Asia Global Crossing is based in Hamilton, Bermuda. On June 11, 2003, the voluntary petition of Asia Global Crossing Ltd. for reorganization under Chapter 11 was converted to Chapter 7. It had filed for Chapter 11 bankruptcy on November 17, 2002.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "ATH": {
        "short_name": "Athene Holding Ltd.",
        "long_name": "Athene Holding Ltd.",
        "summary": "Athene Holding Ltd., a retirement services company, issues, reinsures, and acquires retirement savings products for individuals and institutions in the United States and Bermuda. The company provides annuity retirement solutions to its policyholders; and reinsures multi-year guaranteed annuities, fixed indexed annuities, traditional one-year guarantee fixed deferred annuities, immediate annuities, and institutional products. It also offers funding agreements and group annuities. The company was incorporated in 2008 and is headquartered in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Diversified",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "ATH-PA": {
        "short_name": "Athene Holding Ltd. Depositary ",
        "long_name": "Athene Holding Ltd.",
        "summary": "Athene Holding Ltd., a retirement services company, issues, reinsures, and acquires retirement savings products for individuals and institutions in the United States and Bermuda. The company provides annuity retirement solutions to its policyholders; and reinsures multi-year guaranteed annuities, fixed indexed annuities, traditional one-year guarantee fixed deferred annuities, immediate annuities, and institutional products. It also offers funding agreements and group annuities. The company was incorporated in 2008 and is headquartered in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Diversified",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "ATH-PB": {
        "short_name": "Athene Holding Ltd. Depositary ",
        "long_name": "Athene Holding Ltd.",
        "summary": "Athene Holding Ltd., a retirement services company, issues, reinsures, and acquires retirement savings products for individuals and institutions in the United States and Bermuda. The company provides annuity retirement solutions to its policyholders; and reinsures multi-year guaranteed annuities, fixed indexed annuities, traditional one-year guarantee fixed deferred annuities, immediate annuities, and institutional products. It also offers funding agreements and group annuities. The company was incorporated in 2008 and is headquartered in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Diversified",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "ATH-PC": {
        "short_name": "Athene Holding Ltd. Depositary ",
        "long_name": "Athene Holding Ltd.",
        "summary": "Athene Holding Ltd., a retirement services company, issues, reinsures, and acquires retirement savings products for individuals and institutions in the United States and Bermuda. The company provides annuity retirement solutions to its policyholders; and reinsures multi-year guaranteed annuities, fixed indexed annuities, traditional one-year guarantee fixed deferred annuities, immediate annuities, and institutional products. It also offers funding agreements and group annuities. The company was incorporated in 2008 and is headquartered in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Diversified",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "ATH-PD": {
        "short_name": "Athene Holding Ltd. Depositary ",
        "long_name": "Athene Holding Ltd.",
        "summary": "Athene Holding Ltd., a retirement services company, issues, reinsures, and acquires retirement savings products for individuals and institutions in the United States and Bermuda. The company provides annuity retirement solutions to its policyholders; and reinsures multi-year guaranteed annuities, fixed indexed annuities, traditional one-year guarantee fixed deferred annuities, immediate annuities, and institutional products. It also offers funding agreements and group annuities. The company was incorporated in 2008 and is headquartered in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Diversified",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "AVACF": {
        "short_name": "AVANCE GAS HOLDING LIMITED",
        "long_name": "Avance Gas Holding Ltd",
        "summary": "Avance Gas Holding Ltd, together with its subsidiaries, engages in the transportation of liquefied petroleum gas (LPG) worldwide. The company transports LPG from the Middle East Gulf and the United States Gulf/the United States East Coast to destinations in Europe, South America, India, and Asia. As of December 31, 2019, it operated through a fleet of 14 very large gas carriers. The company was founded in 2007 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "AXS": {
        "short_name": "Axis Capital Holdings Limited",
        "long_name": "AXIS Capital Holdings Limited",
        "summary": "AXIS Capital Holdings Limited, through its subsidiaries, provides various specialty insurance and reinsurance products worldwide. It operates through two segments, Insurance and Reinsurance. The Insurance segment offers property insurance products for commercial buildings, residential premises, construction projects, and onshore energy installations; marine insurance products covering offshore energy, cargo, liability, recreational marine, fine art, specie, hull, and war; and terrorism, aviation, credit and political risk, and liability insurance products. It also provides professional insurance products that cover directors' and officers' liability, errors and omissions liability, employment practices liability, fiduciary liability, crime, professional indemnity, cyber and privacy, medical malpractice, and other financial insurance related coverages for commercial enterprises, financial institutions, not-for-profit organizations, and other professional service providers. In addition, this segment offers accidental death, travel, and specialty health products for employer and affinity groups. The Reinsurance segment offers reinsurance products to insurance companies, including catastrophe reinsurance products; property reinsurance products covering property damage and related losses resulting from natural and man-made perils; professional lines; and credit and surety products. This segment also provides agriculture reinsurance products; coverages for various types of construction risks and risks related to erection, testing, and commissioning of machinery and plants during the construction stage; marine and aviation reinsurance products; and personal accident, specialty health, accidental death, travel, life and disability reinsurance products. The company was founded in 2001 and is headquartered in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Property & Casualty",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "AXS-PE": {
        "short_name": "Axis Capital Holdings Limited D",
        "long_name": "AXIS Capital Holdings Limited",
        "summary": "AXIS Capital Holdings Limited, through its subsidiaries, provides various specialty insurance and reinsurance products worldwide. It operates through two segments, Insurance and Reinsurance. The Insurance segment offers property insurance products for commercial buildings, residential premises, construction projects, and onshore energy installations; marine insurance products covering offshore energy, cargo, liability, recreational marine, fine art, specie, hull, and war; and terrorism, aviation, credit and political risk, and liability insurance products. It also provides professional insurance products that cover directors' and officers' liability, errors and omissions liability, employment practices liability, fiduciary liability, crime, professional indemnity, cyber and privacy, medical malpractice, and other financial insurance related coverages for commercial enterprises, financial institutions, not-for-profit organizations, and other professional service providers. In addition, this segment offers accidental death, travel, and specialty health products for employer and affinity groups. The Reinsurance segment offers reinsurance products to insurance companies, including catastrophe reinsurance products; property reinsurance products covering property damage and related losses resulting from natural and man-made perils; professional lines; and credit and surety products. This segment also provides agriculture reinsurance products; coverages for various types of construction risks and risks related to erection, testing, and commissioning of machinery and plants during the construction stage; marine and aviation reinsurance products; and personal accident, specialty health, accidental death, travel, life and disability reinsurance products. The company was founded in 2001 and is headquartered in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Property & Casualty",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "AXV.F": {
        "short_name": "AXIS CAPIT. HLDGS DL -,10",
        "long_name": "AXIS Capital Holdings Limited",
        "summary": "AXIS Capital Holdings Limited, through its subsidiaries, provides various specialty insurance and reinsurance products worldwide. It operates through two segments, Insurance and Reinsurance. The Insurance segment offers property insurance products for commercial buildings, residential premises, construction projects, and onshore energy installations; marine insurance products covering offshore energy, cargo, liability, recreational marine, fine art, specie, hull, and war; and terrorism, aviation, credit and political risk, and liability insurance products. It also provides professional insurance products that cover directors' and officers' liability, errors and omissions liability, employment practices liability, fiduciary liability, crime, professional indemnity, cyber and privacy, medical malpractice, and other financial insurance related coverages for commercial enterprises, financial institutions, not-for-profit organizations, and other professional service providers. In addition, this segment offers accidental death, travel, and specialty health products for employer and affinity groups. The Reinsurance segment offers reinsurance products to insurance companies, including catastrophe reinsurance products; property reinsurance products covering property damage and related losses resulting from natural and man-made perils; professional lines; and credit and surety products. This segment also provides agriculture reinsurance products; coverages for various types of construction risks and risks related to erection, testing, and commissioning of machinery and plants during the construction stage; marine and aviation reinsurance products; and personal accident, specialty health, accidental death, travel, life and disability reinsurance products. The company was founded in 2001 and is headquartered in Pembroke, Bermuda.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Insurance—Property & Casualty",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "B2WP.F": {
        "short_name": "BORR DRILLING NEW DL -,05",
        "long_name": "Borr Drilling Limited",
        "summary": "Borr Drilling Limited operates as an offshore drilling contractor to the oil and gas industry worldwide. It owns, contracts, and operates jack-up rigs for operations in shallow-water areas, including the provision of related equipment and work crews to conduct oil and gas drilling and workover operations for exploration and production. The company serves oil and gas exploration and production companies, such as integrated oil companies, state-owned national oil companies, and independent oil and gas companies. As of December 31, 2019, it operated a fleet of 27 jack-up drilling rigs and one semi-submersible rig. The company was formerly known as Magni Drilling Limited and changed its name to Borr Drilling Limited in December 2016.Borr Drilling Limited was founded in 2016 and is based in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BAP": {
        "short_name": "Credicorp Ltd.",
        "long_name": "Credicorp Ltd.",
        "summary": "Credicorp Ltd., a financial services holding company, provides various financial, insurance, and health services and products primarily in Peru and internationally. It operates through Universal Banking, Insurance and Pensions, Microfinance, and Investment Banking and Wealth Management segments. The company offers deposits and current accounts, and various credits and financial instruments to individuals and legal entities. It also issues insurance policies to cover losses in commercial property, transportation, marine vessels, automobile, life, health, and pensions, as well as provides private pension fund management services. In addition, the company offers microfinance, including the management of loans, credits, deposits, and current accounts of the small and microenterprises. Further, it provides investment brokerage and management services to corporations, institutional investors, governments, and foundations; and engages in structuring and placement of issues in the primary market, as well as the execution and negotiation of operations in the secondary market. Additionally, it structures securitization processes for corporate customers and manages mutual funds, as well as investment advisory and financial planning services. The company was founded in 1889 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks—Regional",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BBU": {
        "short_name": "Brookfield Business Partners L.",
        "long_name": "Brookfield Business Partners L.P.",
        "summary": "Brookfield Business Partners L.P. is a private equity firm specializes in acquisition. The firm typically invests in business services, construction, energy, and industrials sector. It prefers to take majority stake in companies. The firm seeks returns of at least 15% on its investments. Brookfield Business Partners L.P. is based in Hamilton, Bermuda. Brookfield Business Partners L.P. operates as a subsidiary of Brookfield Asset Management Inc.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BBU-UN.TO": {
        "short_name": "BROOKFIELD BUSINESS PARTNERS LP",
        "long_name": "Brookfield Business Partners L.P.",
        "summary": "Brookfield Business Partners L.P. is a private equity firm specializes in acquisition. The firm typically invests in business services, construction, energy, and industrials sector. It prefers to take majority stake in companies. The firm seeks returns of at least 15% on its investments. Brookfield Business Partners L.P. is based in Hamilton, Bermuda. Brookfield Business Partners L.P. operates as a subsidiary of Brookfield Asset Management Inc.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BCRHF": {
        "short_name": "BLUE CAPITAL REINSURANCE HLDGS ",
        "long_name": "Blue Capital Reinsurance Holdings Ltd.",
        "summary": "Blue Capital Reinsurance Holdings Ltd. does not have significant operations. Previously, the company, through its subsidiaries, provided collateralized reinsurance in the property catastrophe market in the United States and internationally. Blue Capital Reinsurance Holdings Ltd. was founded in 2013 and is headquartered in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "BEP": {
        "short_name": "Brookfield Renewable Partners L",
        "long_name": "Brookfield Renewable Partners L.P.",
        "summary": "Brookfield Renewable Partners L.P. owns a portfolio of renewable power generating facilities primarily in North America, Colombia, Brazil, Europe, India, and China. The company generates electricity through hydroelectric, wind, solar, cogeneration, and biomass sources. Its portfolio consists of approximately 19,000 megawatts of installed capacity. Brookfield Renewable Partners Limited operates as the general partner of Brookfield Renewable Partners L.P. The company was formerly known as Brookfield Renewable Energy Partners L.P. and changed its name to Brookfield Renewable Partners L.P. in May 2016. Brookfield Renewable Partners L.P. was founded in 1999 and is headquartered in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Renewable",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BEP-PA": {
        "short_name": "Brookfield Renewable Partners L",
        "long_name": "Brookfield Renewable Partners L.P.",
        "summary": "Brookfield Renewable Partners L.P. owns a portfolio of renewable power generating facilities primarily in North America, Colombia, Brazil, Europe, India, and China. The company generates electricity through hydroelectric, wind, solar, cogeneration, and biomass sources. Its portfolio consists of approximately 19,000 megawatts of installed capacity. Brookfield Renewable Partners Limited operates as the general partner of Brookfield Renewable Partners L.P. The company was formerly known as Brookfield Renewable Energy Partners L.P. and changed its name to Brookfield Renewable Partners L.P. in May 2016. Brookfield Renewable Partners L.P. was founded in 1999 and is headquartered in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Renewable",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BEP-PE.TO": {
        "short_name": "BROOKFIELD RENEWABLE LP PREF SE",
        "long_name": "Brookfield Renewable Partners L.P.",
        "summary": "Brookfield Renewable Partners L.P. owns a portfolio of renewable power generating facilities primarily in North America, Colombia, Brazil, Europe, India, and China. The company generates electricity through hydroelectric, wind, solar, cogeneration, and biomass sources. Its portfolio consists of approximately 19,000 megawatts of installed capacity. Brookfield Renewable Partners Limited operates as the general partner of Brookfield Renewable Partners L.P. The company was formerly known as Brookfield Renewable Energy Partners L.P. and changed its name to Brookfield Renewable Partners L.P. in May 2016. Brookfield Renewable Partners L.P. was founded in 1999 and is headquartered in Hamilton, Bermuda.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities—Renewable",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BEP-PG.TO": {
        "short_name": "BROOKFIELD RENEWABLE LP PREF SE",
        "long_name": "Brookfield Renewable Partners L.P.",
        "summary": "Brookfield Renewable Partners L.P. owns a portfolio of renewable power generating facilities primarily in North America, Colombia, Brazil, Europe, India, and China. The company generates electricity through hydroelectric, wind, solar, cogeneration, and biomass sources. Its portfolio consists of approximately 19,000 megawatts of installed capacity. Brookfield Renewable Partners Limited operates as the general partner of Brookfield Renewable Partners L.P. The company was formerly known as Brookfield Renewable Energy Partners L.P. and changed its name to Brookfield Renewable Partners L.P. in May 2016. Brookfield Renewable Partners L.P. was founded in 1999 and is headquartered in Hamilton, Bermuda.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities—Renewable",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BEP-PI.TO": {
        "short_name": "BROOKFIELD RENEWABLE  PREF SER ",
        "long_name": "Brookfield Renewable Partners L.P.",
        "summary": "Brookfield Renewable Partners L.P. owns a portfolio of renewable power generating facilities primarily in North America, Colombia, Brazil, Europe, India, and China. The company generates electricity through hydroelectric, wind, solar, cogeneration, and biomass sources. Its portfolio consists of approximately 19,000 megawatts of installed capacity. Brookfield Renewable Partners Limited operates as the general partner of Brookfield Renewable Partners L.P. The company was formerly known as Brookfield Renewable Energy Partners L.P. and changed its name to Brookfield Renewable Partners L.P. in May 2016. Brookfield Renewable Partners L.P. was founded in 1999 and is headquartered in Hamilton, Bermuda.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities—Renewable",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BEP-PK.TO": {
        "short_name": "BROOKFIELD RENEWABLE LP PREF SE",
        "long_name": "Brookfield Renewable Partners L.P.",
        "summary": "Brookfield Renewable Partners L.P. owns a portfolio of renewable power generating facilities primarily in North America, Colombia, Brazil, Europe, India, and China. The company generates electricity through hydroelectric, wind, solar, cogeneration, and biomass sources. Its portfolio consists of approximately 19,000 megawatts of installed capacity. Brookfield Renewable Partners Limited operates as the general partner of Brookfield Renewable Partners L.P. The company was formerly known as Brookfield Renewable Energy Partners L.P. and changed its name to Brookfield Renewable Partners L.P. in May 2016. Brookfield Renewable Partners L.P. was founded in 1999 and is headquartered in Hamilton, Bermuda.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities—Renewable",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BEP-PM.TO": {
        "short_name": "BROOKFIELD RENEWABLE LP PREF SE",
        "long_name": "Brookfield Renewable Partners L.P.",
        "summary": "Brookfield Renewable Partners L.P. owns a portfolio of renewable power generating facilities primarily in North America, Colombia, Brazil, Europe, India, and China. The company generates electricity through hydroelectric, wind, solar, cogeneration, and biomass sources. Its portfolio consists of approximately 19,000 megawatts of installed capacity. Brookfield Renewable Partners Limited operates as the general partner of Brookfield Renewable Partners L.P. The company was formerly known as Brookfield Renewable Energy Partners L.P. and changed its name to Brookfield Renewable Partners L.P. in May 2016. Brookfield Renewable Partners L.P. was founded in 1999 and is headquartered in Hamilton, Bermuda.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities—Renewable",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BEP-PO.TO": {
        "short_name": "BROOKFIELD RENEWABLE LP PREF SE",
        "long_name": "Brookfield Renewable Partners L.P.",
        "summary": "Brookfield Renewable Partners L.P. owns a portfolio of renewable power generating facilities primarily in North America, Colombia, Brazil, Europe, India, and China. The company generates electricity through hydroelectric, wind, solar, cogeneration, and biomass sources. Its portfolio consists of approximately 19,000 megawatts of installed capacity. Brookfield Renewable Partners Limited operates as the general partner of Brookfield Renewable Partners L.P. The company was formerly known as Brookfield Renewable Energy Partners L.P. and changed its name to Brookfield Renewable Partners L.P. in May 2016. Brookfield Renewable Partners L.P. was founded in 1999 and is headquartered in Hamilton, Bermuda.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities—Renewable",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BEP-UN.TO": {
        "short_name": "BROOKFIELD RENEWABLE PARTNERS L",
        "long_name": "Brookfield Renewable Partners L.P.",
        "summary": "Brookfield Renewable Partners L.P. owns a portfolio of renewable power generating facilities primarily in North America, Colombia, Brazil, Europe, India, and China. The company generates electricity through hydroelectric, wind, solar, cogeneration, and biomass sources. Its portfolio consists of approximately 19,000 megawatts of installed capacity. Brookfield Renewable Partners Limited operates as the general partner of Brookfield Renewable Partners L.P. The company was formerly known as Brookfield Renewable Energy Partners L.P. and changed its name to Brookfield Renewable Partners L.P. in May 2016. Brookfield Renewable Partners L.P. was founded in 1999 and is headquartered in Hamilton, Bermuda.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities—Renewable",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BIP": {
        "short_name": "Brookfield Infrastructure Partn",
        "long_name": "Brookfield Infrastructure Partners L.P.",
        "summary": "Brookfield Infrastructure Partners L.P. owns and operates utilities, transport, energy, and data infrastructure businesses in North and South America, Europe, and the Asia Pacific. The Utilities segment operates approximately 2,000 kilometers (km) of natural gas transportation pipelines in the states of Rio de Janeiro, Sao Paulo, and Minas Gerais; approximately 2,200 km of electricity transmission lines; and approximately 6.7 million electricity and natural gas connections, as well as operates coal export terminals. The Transport segment offers transportation and storage services for freight, bulk commodities, and passengers through a network of 10,300 km of rails and 4,200 km of toll roads, as well as 37 port terminals. The Energy segment offers natural gas midstream and storage services through approximately 16,500 km of natural gas transmission pipelines; and 600 billion cubic feet of natural gas storage. This segment also provides heating and cooling services to commercial buildings and campuses, as well as serves approximately 1.6 million residential infrastructure customers. The Data Infrastructure segment offers services and critical infrastructure to the media broadcasting and telecom sectors; and data storage services and infrastructure to enterprise customers. The company was founded in 2007 and is based in Hamilton, Bermuda. Brookfield Infrastructure Partners L.P. is a subsidiary of Brookfield Asset Management Inc.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Diversified",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BIP-PA": {
        "short_name": "Brookfield Infrastructure Partn",
        "long_name": "Brookfield Infrastructure Partners L.P.",
        "summary": "Brookfield Infrastructure Partners L.P. owns and operates utilities, transport, energy, and data infrastructure businesses in North and South America, Europe, and the Asia Pacific. The Utilities segment operates approximately 2,000 kilometers (km) of natural gas transportation pipelines in the states of Rio de Janeiro, Sao Paulo, and Minas Gerais; approximately 2,200 km of electricity transmission lines; and approximately 6.7 million electricity and natural gas connections, as well as operates coal export terminals. The Transport segment offers transportation and storage services for freight, bulk commodities, and passengers through a network of 10,300 km of rails and 4,200 km of toll roads, as well as 37 port terminals. The Energy segment offers natural gas midstream and storage services through approximately 16,500 km of natural gas transmission pipelines; and 600 billion cubic feet of natural gas storage. This segment also provides heating and cooling services to commercial buildings and campuses, as well as serves approximately 1.6 million residential infrastructure customers. The Data Infrastructure segment offers services and critical infrastructure to the media broadcasting and telecom sectors; and data storage services and infrastructure to enterprise customers. The company was founded in 2007 and is based in Hamilton, Bermuda. Brookfield Infrastructure Partners L.P. is a subsidiary of Brookfield Asset Management Inc.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Diversified",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BIP-PA.TO": {
        "short_name": "BROOKFIELD INFRA PARTNERS LP PR",
        "long_name": "Brookfield Infrastructure Partners L.P.",
        "summary": "Brookfield Infrastructure Partners L.P. owns and operates utilities, transport, energy, and data infrastructure businesses in North and South America, Europe, and the Asia Pacific. The Utilities segment operates approximately 2,000 kilometers (km) of natural gas transportation pipelines in the states of Rio de Janeiro, Sao Paulo, and Minas Gerais; approximately 2,200 km of electricity transmission lines; and approximately 6.7 million electricity and natural gas connections, as well as operates coal export terminals. The Transport segment offers transportation and storage services for freight, bulk commodities, and passengers through a network of 10,300 km of rails and 4,200 km of toll roads, as well as 37 port terminals. The Energy segment offers natural gas midstream and storage services through approximately 16,500 km of natural gas transmission pipelines; and 600 billion cubic feet of natural gas storage. This segment also provides heating and cooling services to commercial buildings and campuses, as well as serves approximately 1.6 million residential infrastructure customers. The Data Infrastructure segment offers services and critical infrastructure to the media broadcasting and telecom sectors; and data storage services and infrastructure to enterprise customers. The company was founded in 2007 and is based in Hamilton, Bermuda. Brookfield Infrastructure Partners L.P. is a subsidiary of Brookfield Asset Management Inc.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities—Diversified",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BIP-PB": {
        "short_name": "Brookfield Infrastructure Partn",
        "long_name": "Brookfield Infrastructure Partners L.P.",
        "summary": "Brookfield Infrastructure Partners L.P. owns and operates utilities, transport, energy, and data infrastructure businesses in North and South America, Europe, and the Asia Pacific. The Utilities segment operates approximately 2,000 kilometers (km) of natural gas transportation pipelines in the states of Rio de Janeiro, Sao Paulo, and Minas Gerais; approximately 2,200 km of electricity transmission lines; and approximately 6.7 million electricity and natural gas connections, as well as operates coal export terminals. The Transport segment offers transportation and storage services for freight, bulk commodities, and passengers through a network of 10,300 km of rails and 4,200 km of toll roads, as well as 37 port terminals. The Energy segment offers natural gas midstream and storage services through approximately 16,500 km of natural gas transmission pipelines; and 600 billion cubic feet of natural gas storage. This segment also provides heating and cooling services to commercial buildings and campuses, as well as serves approximately 1.6 million residential infrastructure customers. The Data Infrastructure segment offers services and critical infrastructure to the media broadcasting and telecom sectors; and data storage services and infrastructure to enterprise customers. The company was founded in 2007 and is based in Hamilton, Bermuda. Brookfield Infrastructure Partners L.P. is a subsidiary of Brookfield Asset Management Inc.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Diversified",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BIP-PB.TO": {
        "short_name": "BROOKFIELD INFRA PARTNERS LP PR",
        "long_name": "Brookfield Infrastructure Partners L.P.",
        "summary": "Brookfield Infrastructure Partners L.P. owns and operates utilities, transport, energy, and data infrastructure businesses in North and South America, Europe, and the Asia Pacific. The Utilities segment operates approximately 2,000 kilometers (km) of natural gas transportation pipelines in the states of Rio de Janeiro, Sao Paulo, and Minas Gerais; approximately 2,200 km of electricity transmission lines; and approximately 6.7 million electricity and natural gas connections, as well as operates coal export terminals. The Transport segment offers transportation and storage services for freight, bulk commodities, and passengers through a network of 10,300 km of rails and 4,200 km of toll roads, as well as 37 port terminals. The Energy segment offers natural gas midstream and storage services through approximately 16,500 km of natural gas transmission pipelines; and 600 billion cubic feet of natural gas storage. This segment also provides heating and cooling services to commercial buildings and campuses, as well as serves approximately 1.6 million residential infrastructure customers. The Data Infrastructure segment offers services and critical infrastructure to the media broadcasting and telecom sectors; and data storage services and infrastructure to enterprise customers. The company was founded in 2007 and is based in Hamilton, Bermuda. Brookfield Infrastructure Partners L.P. is a subsidiary of Brookfield Asset Management Inc.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities—Diversified",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BIP-PC.TO": {
        "short_name": "BROOKFIELD INFRA PARTNERS LP PR",
        "long_name": "Brookfield Infrastructure Partners L.P.",
        "summary": "Brookfield Infrastructure Partners L.P. owns and operates utilities, transport, energy, and data infrastructure businesses in North and South America, Europe, and the Asia Pacific. The Utilities segment operates approximately 2,000 kilometers (km) of natural gas transportation pipelines in the states of Rio de Janeiro, Sao Paulo, and Minas Gerais; approximately 2,200 km of electricity transmission lines; and approximately 6.7 million electricity and natural gas connections, as well as operates coal export terminals. The Transport segment offers transportation and storage services for freight, bulk commodities, and passengers through a network of 10,300 km of rails and 4,200 km of toll roads, as well as 37 port terminals. The Energy segment offers natural gas midstream and storage services through approximately 16,500 km of natural gas transmission pipelines; and 600 billion cubic feet of natural gas storage. This segment also provides heating and cooling services to commercial buildings and campuses, as well as serves approximately 1.6 million residential infrastructure customers. The Data Infrastructure segment offers services and critical infrastructure to the media broadcasting and telecom sectors; and data storage services and infrastructure to enterprise customers. The company was founded in 2007 and is based in Hamilton, Bermuda. Brookfield Infrastructure Partners L.P. is a subsidiary of Brookfield Asset Management Inc.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities—Diversified",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BIP-PD.TO": {
        "short_name": "BROOKFIELD INFRA PARTNERS LP PR",
        "long_name": "Brookfield Infrastructure Partners L.P.",
        "summary": "Brookfield Infrastructure Partners L.P. owns and operates utilities, transport, energy, and data infrastructure businesses in North and South America, Europe, and the Asia Pacific. The Utilities segment operates approximately 2,000 kilometers (km) of natural gas transportation pipelines in the states of Rio de Janeiro, Sao Paulo, and Minas Gerais; approximately 2,200 km of electricity transmission lines; and approximately 6.7 million electricity and natural gas connections, as well as operates coal export terminals. The Transport segment offers transportation and storage services for freight, bulk commodities, and passengers through a network of 10,300 km of rails and 4,200 km of toll roads, as well as 37 port terminals. The Energy segment offers natural gas midstream and storage services through approximately 16,500 km of natural gas transmission pipelines; and 600 billion cubic feet of natural gas storage. This segment also provides heating and cooling services to commercial buildings and campuses, as well as serves approximately 1.6 million residential infrastructure customers. The Data Infrastructure segment offers services and critical infrastructure to the media broadcasting and telecom sectors; and data storage services and infrastructure to enterprise customers. The company was founded in 2007 and is based in Hamilton, Bermuda. Brookfield Infrastructure Partners L.P. is a subsidiary of Brookfield Asset Management Inc.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities—Diversified",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BIP-PE.TO": {
        "short_name": "BROOKFIELD INFRA PARTNERS LP PR",
        "long_name": "Brookfield Infrastructure Partners L.P.",
        "summary": "Brookfield Infrastructure Partners L.P. owns and operates utilities, transport, energy, and data infrastructure businesses in North and South America, Europe, and the Asia Pacific. The Utilities segment operates approximately 2,000 kilometers (km) of natural gas transportation pipelines in the states of Rio de Janeiro, Sao Paulo, and Minas Gerais; approximately 2,200 km of electricity transmission lines; and approximately 6.7 million electricity and natural gas connections, as well as operates coal export terminals. The Transport segment offers transportation and storage services for freight, bulk commodities, and passengers through a network of 10,300 km of rails and 4,200 km of toll roads, as well as 37 port terminals. The Energy segment offers natural gas midstream and storage services through approximately 16,500 km of natural gas transmission pipelines; and 600 billion cubic feet of natural gas storage. This segment also provides heating and cooling services to commercial buildings and campuses, as well as serves approximately 1.6 million residential infrastructure customers. The Data Infrastructure segment offers services and critical infrastructure to the media broadcasting and telecom sectors; and data storage services and infrastructure to enterprise customers. The company was founded in 2007 and is based in Hamilton, Bermuda. Brookfield Infrastructure Partners L.P. is a subsidiary of Brookfield Asset Management Inc.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities—Diversified",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BIP-PF.TO": {
        "short_name": "BROOKFIELD INFRA PARTNERS LP PR",
        "long_name": "Brookfield Infrastructure Partners L.P.",
        "summary": "Brookfield Infrastructure Partners L.P. owns and operates utilities, transport, energy, and data infrastructure businesses in North and South America, Europe, and the Asia Pacific. The Utilities segment operates approximately 2,000 kilometers (km) of natural gas transportation pipelines in the states of Rio de Janeiro, Sao Paulo, and Minas Gerais; approximately 2,200 km of electricity transmission lines; and approximately 6.7 million electricity and natural gas connections, as well as operates coal export terminals. The Transport segment offers transportation and storage services for freight, bulk commodities, and passengers through a network of 10,300 km of rails and 4,200 km of toll roads, as well as 37 port terminals. The Energy segment offers natural gas midstream and storage services through approximately 16,500 km of natural gas transmission pipelines; and 600 billion cubic feet of natural gas storage. This segment also provides heating and cooling services to commercial buildings and campuses, as well as serves approximately 1.6 million residential infrastructure customers. The Data Infrastructure segment offers services and critical infrastructure to the media broadcasting and telecom sectors; and data storage services and infrastructure to enterprise customers. The company was founded in 2007 and is based in Hamilton, Bermuda. Brookfield Infrastructure Partners L.P. is a subsidiary of Brookfield Asset Management Inc.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities—Diversified",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BIP-UN.TO": {
        "short_name": "BROOKFIELD INFRA PARTNERS LP UN",
        "long_name": "Brookfield Infrastructure Partners L.P.",
        "summary": "Brookfield Infrastructure Partners L.P. owns and operates utilities, transport, energy, and data infrastructure businesses in North and South America, Europe, and the Asia Pacific. The Utilities segment operates approximately 2,000 kilometers (km) of natural gas transportation pipelines in the states of Rio de Janeiro, Sao Paulo, and Minas Gerais; approximately 2,200 km of electricity transmission lines; and approximately 6.7 million electricity and natural gas connections, as well as operates coal export terminals. The Transport segment offers transportation and storage services for freight, bulk commodities, and passengers through a network of 10,300 km of rails and 4,200 km of toll roads, as well as 37 port terminals. The Energy segment offers natural gas midstream and storage services through approximately 16,500 km of natural gas transmission pipelines; and 600 billion cubic feet of natural gas storage. This segment also provides heating and cooling services to commercial buildings and campuses, as well as serves approximately 1.6 million residential infrastructure customers. The Data Infrastructure segment offers services and critical infrastructure to the media broadcasting and telecom sectors; and data storage services and infrastructure to enterprise customers. The company was founded in 2007 and is based in Hamilton, Bermuda. Brookfield Infrastructure Partners L.P. is a subsidiary of Brookfield Asset Management Inc.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities—Diversified",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BIPFF": {
        "short_name": "BROOKFIELD INFRASTRUCTURE PARTN",
        "long_name": "Brookfield Infrastructure Partners L.P.",
        "summary": "Brookfield Infrastructure Partners L.P. owns and operates utilities, transport, energy, and data infrastructure businesses in North and South America, Europe, and the Asia Pacific. The Utilities segment operates approximately 2,000 kilometers (km) of natural gas transportation pipelines in the states of Rio de Janeiro, Sao Paulo, and Minas Gerais; approximately 2,200 km of electricity transmission lines; and approximately 6.7 million electricity and natural gas connections, as well as operates coal export terminals. The Transport segment offers transportation and storage services for freight, bulk commodities, and passengers through a network of 10,300 km of rails and 4,200 km of toll roads, as well as 37 port terminals. The Energy segment offers natural gas midstream and storage services through approximately 16,500 km of natural gas transmission pipelines; and 600 billion cubic feet of natural gas storage. This segment also provides heating and cooling services to commercial buildings and campuses, as well as serves approximately 1.6 million residential infrastructure customers. The Data Infrastructure segment offers services and critical infrastructure to the media broadcasting and telecom sectors; and data storage services and infrastructure to enterprise customers. The company was founded in 2007 and is based in Hamilton, Bermuda. Brookfield Infrastructure Partners L.P. is a subsidiary of Brookfield Asset Management Inc.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BORR": {
        "short_name": "Borr Drilling Limited",
        "long_name": "Borr Drilling Limited",
        "summary": "Borr Drilling Limited operates as an offshore drilling contractor to the oil and gas industry worldwide. It owns, contracts, and operates jack-up rigs for operations in shallow-water areas, including the provision of related equipment and work crews to conduct oil and gas drilling and workover operations for exploration and production. The company serves oil and gas exploration and production companies, such as integrated oil companies, state-owned national oil companies, and independent oil and gas companies. As of December 31, 2019, it operated a fleet of 27 jack-up drilling rigs and one semi-submersible rig. The company was formerly known as Magni Drilling Limited and changed its name to Borr Drilling Limited in December 2016.Borr Drilling Limited was founded in 2016 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BPY": {
        "short_name": "Brookfield Property Partners L.",
        "long_name": "Brookfield Property Partners L.P.",
        "summary": "Brookfield Property Partners, through Brookfield Property Partners L.P. and its subsidiary Brookfield Property REIT Inc., is one of the world's premier real estate companies, with approximately $88 billion in total assets. We own and operate iconic properties in the world's major markets, and our global portfolio includes office, retail, multifamily, logistics, hospitality, self-storage, triple net lease, manufactured housing and student housing. Brookfield Property Partners is the flagship listed real estate company of Brookfield Asset Management Inc., a leading global alternative asset manager with over $540 billion in assets under management. More information is available at www.brookfield.com.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BPY-UN.TO": {
        "short_name": "BROOKFIELD PROPERTY PARTNERS LP",
        "long_name": "Brookfield Property Partners L.P.",
        "summary": "Brookfield Property Partners, through Brookfield Property Partners L.P. and its subsidiary Brookfield Property REIT Inc., is one of the world's premier real estate companies, with approximately $88 billion in total assets. We own and operate iconic properties in the world's major markets, and our global portfolio includes office, retail, multifamily, logistics, hospitality, self-storage, triple net lease, manufactured housing and student housing. Brookfield Property Partners is the flagship listed real estate company of Brookfield Asset Management Inc., a leading global alternative asset manager with over $540 billion in assets under management. More information is available at www.brookfield.com.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BPYPN": {
        "short_name": "Brookfield Property Partners L.",
        "long_name": "Brookfield Property Partners L.P.",
        "summary": "Brookfield Property Partners, through Brookfield Property Partners L.P. and its subsidiary Brookfield Property REIT Inc., is one of the world's premier real estate companies, with approximately $88 billion in total assets. We own and operate iconic properties in the world's major markets, and our global portfolio includes office, retail, multifamily, logistics, hospitality, self-storage, triple net lease, manufactured housing and student housing. Brookfield Property Partners is the flagship listed real estate company of Brookfield Asset Management Inc., a leading global alternative asset manager with over $540 billion in assets under management. More information is available at www.brookfield.com.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BPYPO": {
        "short_name": "Brookfield Property Partners L.",
        "long_name": "Brookfield Property Partners L.P.",
        "summary": "Brookfield Property Partners, through Brookfield Property Partners L.P. and its subsidiary Brookfield Property REIT Inc., is one of the world's premier real estate companies, with approximately $88 billion in total assets. We own and operate iconic properties in the world's major markets, and our global portfolio includes office, retail, multifamily, logistics, hospitality, self-storage, triple net lease, manufactured housing and student housing. Brookfield Property Partners is the flagship listed real estate company of Brookfield Asset Management Inc., a leading global alternative asset manager with over $540 billion in assets under management. More information is available at www.brookfield.com.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BPYPP": {
        "short_name": "Brookfield Property Partners L.",
        "long_name": "Brookfield Property Partners L.P.",
        "summary": "Brookfield Property Partners, through Brookfield Property Partners L.P. and its subsidiary Brookfield Property REIT Inc., is one of the world's premier real estate companies, with approximately $88 billion in total assets. We own and operate iconic properties in the world's major markets, and our global portfolio includes office, retail, multifamily, logistics, hospitality, self-storage, triple net lease, manufactured housing and student housing. Brookfield Property Partners is the flagship listed real estate company of Brookfield Asset Management Inc., a leading global alternative asset manager with over $540 billion in assets under management. More information is available at www.brookfield.com.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "BWO.OL": {
        "short_name": "BW OFFSHORE LTD",
        "long_name": "BW Offshore Limited",
        "summary": "BW Offshore Limited builds, owns, and operates oil and gas floating production, storage, and offloading vessels (FPSOs), and floating, storage, and offloading vessels (FSOs). It also offers engineering, procurement, construction, and installation services; and lease and operation services for FPSO units. As of September 16, 2020, the company had a fleet of 15 FPSOs and FSO. It also operates 40 projects, which include 30 FPSOs projects and 10 FSO projects. It serves the oil and gas industries in the Asia Pacific, the Americas, Europe, and West Africa. BW Offshore Limited was founded in 1982 and is based in Hamilton, Bermuda.",
        "currency": "NOK",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "COCBF": {
        "short_name": "COASTAL CARIBBEAN OILS & MINERA",
        "long_name": "Coastal Caribbean Oils & Minerals, Ltd.",
        "summary": "Coastal Caribbean Oils & Minerals, Ltd. operates as an independent oil and gas exploration company in the United States. It seeks various exploration projects with potential for providing long-term drilling inventories. The company was founded in 1953 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "D8EN.F": {
        "short_name": "DHT HLDGS INC.NEW DL -,01",
        "long_name": "DHT Holdings, Inc.",
        "summary": "DHT Holdings, Inc., through its subsidiaries, owns and operates crude oil tankers primarily in Monaco, Singapore, Oslo, and Norway. As of March 19, 2020, it had a fleet of 27 very large crude carriers with a capacity of 8,360,850 deadweight tons. The company was founded in 2005 and is headquartered in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "DHT": {
        "short_name": "DHT Holdings, Inc.",
        "long_name": "DHT Holdings, Inc.",
        "summary": "DHT Holdings, Inc., through its subsidiaries, owns and operates crude oil tankers primarily in Monaco, Singapore, Oslo, and Norway. As of March 19, 2020, it had a fleet of 27 very large crude carriers with a capacity of 8,360,850 deadweight tons. The company was founded in 2005 and is headquartered in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "DHU.F": {
        "short_name": "ASSURED GUARANTY  DL-,01",
        "long_name": "Assured Guaranty Ltd.",
        "summary": "Assured Guaranty Ltd., through its subsidiaries, provides credit protection products to public finance, infrastructure, and structured finance markets in the United States and internationally. The company operates in two segments, Insurance and Asset Management. It offers financial guaranty insurance that protects holders of debt instruments and other monetary obligations from defaults in scheduled payments. The company insures and reinsures various debt obligations, including bonds issued by the United States state, governmental authorities or municipal governmental authorities; and notes issued to finance infrastructure projects. It also insures and reinsures various types of the U.S. public finance obligations, such as general obligation, tax-backed, municipal utility, transportation, healthcare, higher education, infrastructure, housing revenue, investor-owned utility, renewable energy, and other public finance bonds; non-U.S. public finance obligations comprising regulated utilities, infrastructure finance, sovereign and sub-sovereign, renewable energy bonds, pooled infrastructure, and other public finance obligations; and the U.S. and non-U.S. Structured finance obligations, including residential mortgage-backed securities, insurance securitization obligations, consumer receivables securities, pooled corporate obligations, financial products, and other structured finance securities. In addition, the company provides asset management services comprising investment advisory services, including management of collateralized loan obligations and opportunity funds to outside investors. It markets its financial guaranty insurance directly to issuers and underwriters of public finance and structured finance securities, as well as to investors in such obligations. Assured Guaranty Ltd. was founded in 2003 and is headquartered in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Insurance—Specialty",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "EARS": {
        "short_name": "Auris Medical Holding Ltd.",
        "long_name": "Auris Medical Holding Ltd.",
        "summary": "Auris Medical Holding Ltd., a development-stage biopharmaceutical company, focuses on the development of pharmaceutical products for the treatment and prevention of peripheral and central nervous disorders. The company's Phase 3 programs under the development include Keyzilen (AM-101) for the treatment of acute inner ear tinnitus; and Sonsuvi (AM-111) for the treatment of acute inner ear hearing loss. It is also developing AM-125 that is in Phase 2 clinical trial for the intranasal treatment of acute peripheral vertigo; and AM-201, which is in Phase 1b clinical trial for the prevention of weight gain and drowsiness, which are side effects of various antipsychotic drugs, as well as AM-102 for the tinnitus treatment. The company has a collaboration and license agreement with INSERM; and Xigen S.A. to develop, manufacture, and commercialize pharmaceutical products, as well as drug delivery devices and formulations for local administration of therapeutic substances to the inner ear for the treatment of ear disorders. Auris Medical Holding Ltd. was founded in 1998 and is headquartered in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "ESGR": {
        "short_name": "Enstar Group Limited",
        "long_name": "Enstar Group Limited",
        "summary": "Enstar Group Limited acquires and manages insurance and reinsurance companies, and portfolios of insurance and reinsurance business in run-off. It operates in three segments: Non-Life Run-Off, Atrium, and StarStone. The Non-Life Run-Off segment engages in the running off property and casualty, and other non-life lines of businesses. It also provides consulting services, including claims inspection, claims validation, reinsurance asset collection, and IT consulting services to the insurance and reinsurance industry. The Atrium segment is involved in underwriting various classes, including marine, aviation, transit, property and casualty binding authorities, reinsurance, accident and health, and non marine direct and facultative. The StarStone segment offers a range of property, casualty, and specialty insurance products to multi-national, and small and middle-market clients. It operates in Bermuda, the United States, the United Kingdom, Continental Europe, Australia, and internationally. The company was formerly known as Castlewood Holdings Limited and changed its name to Enstar Group Limited in January 2007. Enstar Group Limited was founded in 2001 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Diversified",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "ESGRO": {
        "short_name": "Enstar Group Limited - Deposito",
        "long_name": "Enstar Group Limited",
        "summary": "Enstar Group Limited acquires and manages insurance and reinsurance companies, and portfolios of insurance and reinsurance business in run-off. It operates in three segments: Non-Life Run-Off, Atrium, and StarStone. The Non-Life Run-Off segment engages in the running off property and casualty, and other non-life lines of businesses. It also provides consulting services, including claims inspection, claims validation, reinsurance asset collection, and IT consulting services to the insurance and reinsurance industry. The Atrium segment is involved in underwriting various classes, including marine, aviation, transit, property and casualty binding authorities, reinsurance, accident and health, and non marine direct and facultative. The StarStone segment offers a range of property, casualty, and specialty insurance products to multi-national, and small and middle-market clients. It operates in Bermuda, the United States, the United Kingdom, Continental Europe, Australia, and internationally. The company was formerly known as Castlewood Holdings Limited and changed its name to Enstar Group Limited in January 2007. Enstar Group Limited was founded in 2001 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Diversified",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "ESGRP": {
        "short_name": "Enstar Group Limited - Deposita",
        "long_name": "Enstar Group Limited",
        "summary": "Enstar Group Limited acquires and manages insurance and reinsurance companies, and portfolios of insurance and reinsurance business in run-off. It operates in three segments: Non-Life Run-Off, Atrium, and StarStone. The Non-Life Run-Off segment engages in the running off property and casualty, and other non-life lines of businesses. It also provides consulting services, including claims inspection, claims validation, reinsurance asset collection, and IT consulting services to the insurance and reinsurance industry. The Atrium segment is involved in underwriting various classes, including marine, aviation, transit, property and casualty binding authorities, reinsurance, accident and health, and non marine direct and facultative. The StarStone segment offers a range of property, casualty, and specialty insurance products to multi-national, and small and middle-market clients. It operates in Bermuda, the United States, the United Kingdom, Continental Europe, Australia, and internationally. The company was formerly known as Castlewood Holdings Limited and changed its name to Enstar Group Limited in January 2007. Enstar Group Limited was founded in 2001 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Diversified",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "ESNT": {
        "short_name": "Essent Group Ltd.",
        "long_name": "Essent Group Ltd.",
        "summary": "Essent Group Ltd., through its subsidiaries, provides private mortgage insurance and reinsurance for mortgages secured by residential properties located in the United States. Its mortgage insurance products include primary, pool, and master policy. The company also provides information technology maintenance and development services; customer support-related services; and contract underwriting services. It serves the originators of residential mortgage loans, such as regulated depository institutions, mortgage banks, credit unions, and other lenders. The company was founded in 2008 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Mortgage Finance",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "FLNG": {
        "short_name": "FLEX LNG Ltd.",
        "long_name": "Flex LNG Ltd.",
        "summary": "Flex LNG Ltd., through its subsidiaries, engages in the seaborne transportation of liquefied natural gas (LNG) worldwide. As of December 31, 2019, it owned and operated six LNG carriers. It also provides chartering and management services. Flex LNG Ltd. was founded in 2006 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "FLNG.OL": {
        "short_name": "FLEX LNG LTD (BM)",
        "long_name": "Flex LNG Ltd.",
        "summary": "Flex LNG Ltd., through its subsidiaries, engages in the seaborne transportation of liquefied natural gas (LNG) worldwide. As of December 31, 2019, it owned and operated six LNG carriers. It also provides chartering and management services. Flex LNG Ltd. was founded in 2006 and is based in Hamilton, Bermuda.",
        "currency": "NOK",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "FNXLF": {
        "short_name": "FENIX FINANCIAL LTD",
        "long_name": "Fenix Financial Ltd.",
        "summary": "Fenix Financial Ltd. operates in the financial sector. It allows individual and institutional customers to execute trades with the New York Stock Exchange, NASDAQ, American Stock Exchange, and other exchanges. The company is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "FRLN.F": {
        "short_name": "FRONTLINE LTD  DL 1",
        "long_name": "Frontline Ltd.",
        "summary": "Frontline Ltd., a shipping company, engages in the seaborne transportation of crude oil and oil products worldwide. It owns and operates oil and product tankers. As of December 31, 2019, the company operated a fleet of 71 vessels. It is also involved in the charter, purchase, and sale of vessels. Frontline Ltd. is based in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "FRO": {
        "short_name": "Frontline Ltd.",
        "long_name": "Frontline Ltd.",
        "summary": "Frontline Ltd., a shipping company, engages in the seaborne transportation of crude oil and oil products worldwide. It owns and operates oil and product tankers. As of December 31, 2019, the company operated a fleet of 71 vessels. It is also involved in the charter, purchase, and sale of vessels. Frontline Ltd. is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "G": {
        "short_name": "Genpact Limited",
        "long_name": "Genpact Limited",
        "summary": "Genpact Limited provides business process outsourcing and information technology (IT) services North and Latin America, India, rest of Asia, and Europe. It operates in three segments: Banking, Capital Markets and Insurance; Consumer Goods, Retail, Life Sciences and Healthcare; and High Tech, Manufacturing and Services. The company's finance and accounting services include accounts payable, such as document management, invoice processing, approval and resolution management, and travel and expense processing; invoice-to-cash services, including customer master data management, credit and contract management, fulfillment, billing, collections, and dispute management services; record to report services comprising accounting, treasury, tax, product cost accounting, and closing and reporting services; enterprise performance management consisting of budgeting, forecasting, and business performance reporting; and enterprise risk and compliance services, including operational risks and controls. It also provides transformation services; core industry operation services; and sourcing, procurement, and supply chain services, such as direct and indirect strategic sourcing, category management, spend analytics, procurement operations, master data management, and other procurement and supply chain advisory services. The company's IT services comprise end-user computing support, infrastructure management, application production support, and database management services, as well as business intelligence and data, enterprise resource planning, quality assurance, technology integration, and business intelligence reporting services. It serves banking, capital markets, insurance, consumer goods, retail, life sciences, healthcare, high tech, and manufacturing and services industries. Genpact Limited was founded in 1997 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "G2O.F": {
        "short_name": "GOLAR LNG LTD.  DL 1",
        "long_name": "Golar LNG Limited",
        "summary": "Golar LNG Limited provides infrastructure for the liquefaction, transportation, regasification, and downstream distribution of LNG. It operates through three segments: Vessel Operations, Floating Liquefaction Natural Gas Vessel (FLNG), and Power. The company engages in the acquisition, ownership, operation, and chartering of LNG carriers, FLNG, and floating storage regasification units (FSRUs); and the development of gas to power projects, as well as LNG distribution operations. As of April 16, 2020, it operated twelve LNG carriers, one FSRU, and two FLNGs. The company was founded in 1946 and is headquartered in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "G7L.F": {
        "short_name": "GOLAR LNG PARTNERS DL-,01",
        "long_name": "Golar LNG Partners LP",
        "summary": "Golar LNG Partners LP owns and operates floating storage regasification units (FSRUs) and liquefied natural gas (LNG) carriers under long-term charters in Brazil, Indonesia, Jordan, Jamaica, Kuwait, and the United Arab Emirates. As of April 16, 2020, it had a fleet of six FSRUs and four LNG carriers. Golar GP LLC serves as the general partner of Golar LNG Partners LP. The company was founded in 2007 and is headquartered in Hamilton, Bermuda. Golar LNG Partners LP is a subsidiary of Golar LNG Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "GFKSY": {
        "short_name": "GULF KEYSTONE PETROLEUM",
        "long_name": "Gulf Keystone Petroleum Limited",
        "summary": "Gulf Keystone Petroleum Limited engages in the exploration, evaluation, and production of oil and gas properties in the Kurdistan Region of Iraq and the United Kingdom. The company operates Shaikan field that covers an area of 283 square kilometers, which is located north-west of Erbil. It also provides management, support, geological, geophysical, and engineering services. Gulf Keystone Petroleum Limited was founded in 2001 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "GKP.L": {
        "short_name": "GULF KEYSTONE PETROLEUM LTD COM",
        "long_name": "Gulf Keystone Petroleum Limited",
        "summary": "Gulf Keystone Petroleum Limited engages in the exploration, evaluation, and production of oil and gas properties in the Kurdistan Region of Iraq and the United Kingdom. The company operates Shaikan field that covers an area of 283 square kilometers, which is located north-west of Erbil. It also provides management, support, geological, geophysical, and engineering services. Gulf Keystone Petroleum Limited was founded in 2001 and is based in Hamilton, Bermuda.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "GLNG": {
        "short_name": "Golar LNG Limited",
        "long_name": "Golar LNG Limited",
        "summary": "Golar LNG Limited provides infrastructure for the liquefaction, transportation, regasification, and downstream distribution of LNG. It operates through three segments: Vessel Operations, Floating Liquefaction Natural Gas Vessel (FLNG), and Power. The company engages in the acquisition, ownership, operation, and chartering of LNG carriers, FLNG, and floating storage regasification units (FSRUs); and the development of gas to power projects, as well as LNG distribution operations. As of April 16, 2020, it operated twelve LNG carriers, one FSRU, and two FLNGs. The company was founded in 1946 and is headquartered in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "GLNGN.MX": {
        "short_name": "GOLAR LNG LIMITED",
        "long_name": "Golar LNG Limited",
        "summary": "Golar LNG Limited provides infrastructure for the liquefaction, transportation, regasification, and downstream distribution of LNG. It operates through three segments: Vessel Operations, Floating Liquefaction Natural Gas Vessel (FLNG), and Power. The company engages in the acquisition, ownership, operation, and chartering of LNG carriers, FLNG, and floating storage regasification units (FSRUs); and the development of gas to power projects, as well as LNG distribution operations. As of April 16, 2020, it operated twelve LNG carriers, one FSRU, and two FLNGs. The company was founded in 1946 and is headquartered in Hamilton, Bermuda.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "GMLP": {
        "short_name": "Golar LNG Partners LP",
        "long_name": "Golar LNG Partners LP",
        "summary": "Golar LNG Partners LP owns and operates floating storage regasification units (FSRUs) and liquefied natural gas (LNG) carriers under long-term charters in Brazil, Indonesia, Jordan, Jamaica, Kuwait, and the United Arab Emirates. As of April 16, 2020, it had a fleet of six FSRUs and four LNG carriers. Golar GP LLC serves as the general partner of Golar LNG Partners LP. The company was founded in 2007 and is headquartered in Hamilton, Bermuda. Golar LNG Partners LP is a subsidiary of Golar LNG Limited.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "GOGL": {
        "short_name": "Golden Ocean Group Limited",
        "long_name": "Golden Ocean Group Limited",
        "summary": "Golden Ocean Group Limited, a shipping company, owns and operates a fleet of dry bulk vessels comprising of Newcastlemax, Capesize, Panamax, and Ultramax vessels worldwide. It owns and operates dry bulk vessels in the spot and time charter markets. The company transports bulk commodities, such as ores, coal, grains, and fertilizers. As of March 12, 2020, it owned a fleet of 67 vessels. Golden Ocean Group Limited is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "GOGL.OL": {
        "short_name": "GOLDEN OCEAN GROUP",
        "long_name": "Golden Ocean Group Limited",
        "summary": "Golden Ocean Group Limited, a shipping company, owns and operates a fleet of dry bulk vessels comprising of Newcastlemax, Capesize, Panamax, and Ultramax vessels worldwide. It owns and operates dry bulk vessels in the spot and time charter markets. The company transports bulk commodities, such as ores, coal, grains, and fertilizers. As of March 12, 2020, it owned a fleet of 67 vessels. Golden Ocean Group Limited is based in Hamilton, Bermuda.",
        "currency": "NOK",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "GUKYF": {
        "short_name": "GULF KEYSTONE PETROLEUM",
        "long_name": "Gulf Keystone Petroleum Limited",
        "summary": "Gulf Keystone Petroleum Limited engages in the exploration, evaluation, and production of oil and gas properties in the Kurdistan Region of Iraq and the United Kingdom. The company operates Shaikan field that covers an area of 283 square kilometers, which is located north-west of Erbil. It also provides management, support, geological, geophysical, and engineering services. Gulf Keystone Petroleum Limited was founded in 2001 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "H2X3.F": {
        "short_name": "HISCOX LTD  LS-,065",
        "long_name": "Hiscox Ltd",
        "summary": "Hiscox Ltd, together with its subsidiaries, provides insurance and reinsurance services. The company operates through four segments: Hiscox Retail, Hiscox London Market, Hiscox Re & ILS, and Corporate Centre. It provides commercial insurance for small-and medium-sized businesses, including household, fine art, and luxury motor via brokers, through a growing network of partnerships, and directly to consumers. The company also offers property insurance; marine and energy insurance; casualty insurance; specialty and international employees and officers' insurance; kidnap and ransom insurance; auto physical damage and aviation insurance; and other specialty insurance, such as contingency, terrorism, personal accident, and product recall. In addition, it provides healthcare and casualty reinsurance services, as well as investment services. The company operates in Bermuda, the United Kingdom, Ireland, the United States, Guernsey, France, Germany, Belgium, the Netherlands, Spain, Portugal, Singapore, and Thailand. Hiscox Ltd is headquartered in Pembroke, Bermuda.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Insurance—Property & Casualty",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "H4W.F": {
        "short_name": "JARDINE MATH. HLDG DL-,25",
        "long_name": "Jardine Matheson Holdings Limited",
        "summary": "Jardine Matheson Holdings Limited, through its subsidiaries, engages in the motor vehicles and related operations, property investment and development, food retailing, home furnishings, engineering and construction, and transportation businesses. It is also involved in the insurance brokerage, financial services, heavy equipment, mining, and agribusinesses. The company offers ground handling, and aviation and travel agency services; and engineering, sourcing, and contracting services, as well as owns and operates air cargo terminals, and invests in residential properties. It is also involved in the Pizza Hut and KFC restaurants operations; designing, engineering, installation, maintenance, and modernization of lifts, escalators, and moving walkways; corporate travel management; and provision of ticketing services to other travel agents, and technology and consultancy solutions. In addition, the company sells and services motor vehicles; invests in, owns, develops, and manages office and retail properties; operates outlets, including supermarkets, hypermarkets, convenience stores, health and beauty stores, home furnishings stores, and restaurants; invests in and manages a portfolio of deluxe and first class hotels, resorts, and residences; and provides automobile and motorcycle products. Further, it engages in the motor dealerships, financing, dairy, and cement businesses. Additionally, the company is involved in automotive, financial, construction, energy, infrastructure, logistics, and information technology businesses. It operates in Greater China, Southeast Asia, the United Kingdom, and internationally. The company was founded in 1832 and is based in Hamilton, Bermuda. Jardine Matheson Holdings Limited operates as a subsidiary of Jardine Strategic Holdings Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "H78.SI": {
        "short_name": "HongkongLand USD",
        "long_name": "Hongkong Land Holdings Limited",
        "summary": "Hongkong Land Holdings Limited, together with its subsidiaries, engages in the investment, development, and management of properties in Hong Kong, Macau, Mainland China, Southeast Asia, and internationally. The company operates in two segments, Investment Properties and Development Properties. It owns and manages approximately 850,000 square meters of office and luxury retail property primarily in Hong Kong, Singapore, Beijing, and Jakarta. The company also develops and sells residential properties. In addition, it is involved in hotel investment, finance, and project management businesses. The company was founded in 1889 and is based in Hamilton, Bermuda. Hongkong Land Holdings Limited is a subsidiary of Jardine Strategic Holdings Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "HAFNI.OL": {
        "short_name": "HAFNIA LIMITED",
        "long_name": "Hafnia Limited",
        "summary": "Hafnia Limited, owns and operates oil product tankers. The company operates in four segments: Long Range II (LR2), Long Range I (LR1), Medium Range (MR), and Handy size (Handy). It transports oil and oil products to national and international oil companies, and chemical companies, as well as trading and utility companies. The company provides ship owning, ship-management, chartering, investment, and agency office services. As of April 29, 2020, the company operated a fleet of 174 vessels in pools, including newbuilds, of which 102 are owned or chartered-in including six owned LR2s, 27 owned and nine chartered-in LR1s, 41 owned and six chartered-in MRs, and 13 owned Handy vessels. The company is based in Hamilton, Bermuda. Hafnia Limited is a subsidiary of BW Group Limited.",
        "currency": "NOK",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "HKHGF": {
        "short_name": "HONGKONG LAND HOLDINGS LTD",
        "long_name": "Hongkong Land Holdings Limited",
        "summary": "Hongkong Land Holdings Limited, together with its subsidiaries, engages in the investment, development, and management of properties in Hong Kong, Macau, Mainland China, Southeast Asia, and internationally. The company operates in two segments, Investment Properties and Development Properties. It owns and manages approximately 850,000 square meters of office and luxury retail property primarily in Hong Kong, Singapore, Beijing, and Jakarta. The company also develops and sells residential properties. In addition, it is involved in hotel investment, finance, and project management businesses. The company was founded in 1889 and is based in Hamilton, Bermuda. Hongkong Land Holdings Limited is a subsidiary of Jardine Strategic Holdings Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "HKLD.L": {
        "short_name": "HONG KONG LAND HOLDINGS LD ORD ",
        "long_name": "Hongkong Land Holdings Limited",
        "summary": "Hongkong Land Holdings Limited, together with its subsidiaries, engages in the investment, development, and management of properties in Hong Kong, Macau, Mainland China, Southeast Asia, and internationally. The company operates in two segments, Investment Properties and Development Properties. It owns and manages approximately 850,000 square meters of office and luxury retail property primarily in Hong Kong, Singapore, Beijing, and Jakarta. The company also develops and sells residential properties. In addition, it is involved in hotel investment, finance, and project management businesses. The company was founded in 1889 and is based in Hamilton, Bermuda. Hongkong Land Holdings Limited is a subsidiary of Jardine Strategic Holdings Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "HLH.F": {
        "short_name": "H.K. LD HLDGS  DL -,10",
        "long_name": "Hongkong Land Holdings Limited",
        "summary": "Hongkong Land Holdings Limited, together with its subsidiaries, engages in the investment, development, and management of properties in Hong Kong, Macau, Mainland China, Southeast Asia, and internationally. The company operates in two segments, Investment Properties and Development Properties. It owns and manages approximately 850,000 square meters of office and luxury retail property primarily in Hong Kong, Singapore, Beijing, and Jakarta. The company also develops and sells residential properties. In addition, it is involved in hotel investment, finance, and project management businesses. The company was founded in 1889 and is based in Hamilton, Bermuda. Hongkong Land Holdings Limited is a subsidiary of Jardine Strategic Holdings Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "HLNG.OL": {
        "short_name": "HOEGH LNG HOLDINGS",
        "long_name": "Höegh LNG Holdings Ltd.",
        "summary": "HÃ¶egh LNG Holdings Ltd., together with its subsidiaries, provides floating energy solutions worldwide. The company operates through four segments: HMLP, Operations, Business Development, and Project Execution. It owns and operates floating LNG import terminals, floating storage and regasification units (FSRUs), and LNG carriers (LNGCs). The company also acquires FSRUs, LNGCs, and other LNG infrastructure assets under long-term charters. As of December 31, 2019, it operated a fleet of two LNG transportation vessels, and ten floating storage and regasification units. The company is also involved in the commercial management and bareboat hiring; and business development and project execution activities. In addition, it owns ships. The company is based in Hamilton, Bermuda.",
        "currency": "NOK",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "HMLP": {
        "short_name": "Hoegh LNG Partners LP",
        "long_name": "Höegh LNG Partners LP",
        "summary": "HÃ¶egh LNG Partners LP focuses on owning, operating, and acquiring floating storage and regasification units (FSRUs), liquefied natural gas (LNG) carriers, and other LNG infrastructure assets under long-term charters. The company also offers ship management services. As of March 31, 2019, it had a fleet of five FSRUs. HÃ¶egh LNG GP LLC is the general partner of the company. The company was founded in 2014 and is headquartered in Hamilton, Bermuda. HÃ¶egh LNG Partners LP is a subsidiary of HÃ¶egh LNG Holdings Ltd.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "HNGKY": {
        "short_name": "HONGKONG LAND HOLDINGS LTD",
        "long_name": "Hongkong Land Holdings Limited",
        "summary": "Hongkong Land Holdings Limited, together with its subsidiaries, engages in the investment, development, and management of properties in Hong Kong, Macau, Mainland China, Southeast Asia, and internationally. The company operates in two segments, Investment Properties and Development Properties. It owns and manages approximately 850,000 square meters of office and luxury retail property primarily in Hong Kong, Singapore, Beijing, and Jakarta. The company also develops and sells residential properties. In addition, it is involved in hotel investment, finance, and project management businesses. The company was founded in 1889 and is based in Hamilton, Bermuda. Hongkong Land Holdings Limited is a subsidiary of Jardine Strategic Holdings Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "HOFSQ": {
        "short_name": "Hermitage Offshore Services Ltd",
        "long_name": "Hermitage Offshore Services Ltd.",
        "summary": "Hermitage Offshore Services Ltd., together with its subsidiaries, engages in offshore support vessel business primarily in the North Sea and off the coast of West Africa. It owns and operates a fleet of 23 vessels comprising of ten platform supply vessels, 11 crew boats, and 2 anchor handling supply vessels. The company was formerly known Nordic American Offshore Ltd. and changed its name to Hermitage Offshore Services Ltd. in June 2019. Hermitage Offshore Services Ltd. was founded in 2013 and is based in Hamilton, Bermuda. On August 11, 2020, Hermitage Offshore Services Ltd., along with its affiliates, filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the Southern District of New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Bermuda"
    },
    "HSX.L": {
        "short_name": "HISCOX LTD ORD 6.5P (DI)",
        "long_name": "Hiscox Ltd",
        "summary": "Hiscox Ltd, together with its subsidiaries, provides insurance and reinsurance services. The company operates through four segments: Hiscox Retail, Hiscox London Market, Hiscox Re & ILS, and Corporate Centre. It provides commercial insurance for small-and medium-sized businesses, including household, fine art, and luxury motor via brokers, through a growing network of partnerships, and directly to consumers. The company also offers property insurance; marine and energy insurance; casualty insurance; specialty and international employees and officers' insurance; kidnap and ransom insurance; auto physical damage and aviation insurance; and other specialty insurance, such as contingency, terrorism, personal accident, and product recall. In addition, it provides healthcare and casualty reinsurance services, as well as investment services. The company operates in Bermuda, the United Kingdom, Ireland, the United States, Guernsey, France, Germany, Belgium, the Netherlands, Spain, Portugal, Singapore, and Thailand. Hiscox Ltd is headquartered in Pembroke, Bermuda.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Insurance—Property & Casualty",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "J36.SI": {
        "short_name": "JMH USD",
        "long_name": "Jardine Matheson Holdings Limited",
        "summary": "Jardine Matheson Holdings Limited, through its subsidiaries, engages in the motor vehicles and related operations, property investment and development, food retailing, home furnishings, engineering and construction, and transportation businesses. It is also involved in the insurance brokerage, financial services, heavy equipment, mining, and agribusinesses. The company offers ground handling, and aviation and travel agency services; and engineering, sourcing, and contracting services, as well as owns and operates air cargo terminals, and invests in residential properties. It is also involved in the Pizza Hut and KFC restaurants operations; designing, engineering, installation, maintenance, and modernization of lifts, escalators, and moving walkways; corporate travel management; and provision of ticketing services to other travel agents, and technology and consultancy solutions. In addition, the company sells and services motor vehicles; invests in, owns, develops, and manages office and retail properties; operates outlets, including supermarkets, hypermarkets, convenience stores, health and beauty stores, home furnishings stores, and restaurants; invests in and manages a portfolio of deluxe and first class hotels, resorts, and residences; and provides automobile and motorcycle products. Further, it engages in the motor dealerships, financing, dairy, and cement businesses. Additionally, the company is involved in automotive, financial, construction, energy, infrastructure, logistics, and information technology businesses. It operates in Greater China, Southeast Asia, the United Kingdom, and internationally. The company was founded in 1832 and is based in Hamilton, Bermuda. Jardine Matheson Holdings Limited operates as a subsidiary of Jardine Strategic Holdings Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "J37.SI": {
        "short_name": "JSH USD",
        "long_name": "Jardine Strategic Holdings Limited",
        "summary": "Jardine Strategic Holdings Limited, through its subsidiaries, engages in the engineering and construction, transport services, and insurance broking businesses in Greater China, Southeast Asia, the United Kingdom, and internationally. It is also involved in the property investment and development, food retailing, restaurants, hotels, motor vehicles and related activities, financial services, heavy equipment, mining, and agribusinesses. The company invests in, develops, leases, and manages commercial and residential properties. In addition, it operates supermarkets, hypermarkets, convenience stores, health and beauty stores, home furnishings stores, and restaurants; and 33 hotels and seven residences in 23 countries and territories. Further, the company is involved in motor trading, dairy, construction and energy, information technology, cement production, and infrastructure and logistics businesses. The company is based in Hamilton, Bermuda. Jardine Strategic Holdings Limited operates as a subsidiary of Jardine Matheson Holdings Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "JAR.L": {
        "short_name": "JARDINE MATHESON HOLDINGS LD OR",
        "long_name": "Jardine Matheson Holdings Limited",
        "summary": "Jardine Matheson Holdings Limited, through its subsidiaries, engages in the motor vehicles and related operations, property investment and development, food retailing, home furnishings, engineering and construction, and transportation businesses. It is also involved in the insurance brokerage, financial services, heavy equipment, mining, and agribusinesses. The company offers ground handling, and aviation and travel agency services; and engineering, sourcing, and contracting services, as well as owns and operates air cargo terminals, and invests in residential properties. It is also involved in the Pizza Hut and KFC restaurants operations; designing, engineering, installation, maintenance, and modernization of lifts, escalators, and moving walkways; corporate travel management; and provision of ticketing services to other travel agents, and technology and consultancy solutions. In addition, the company sells and services motor vehicles; invests in, owns, develops, and manages office and retail properties; operates outlets, including supermarkets, hypermarkets, convenience stores, health and beauty stores, home furnishings stores, and restaurants; invests in and manages a portfolio of deluxe and first class hotels, resorts, and residences; and provides automobile and motorcycle products. Further, it engages in the motor dealerships, financing, dairy, and cement businesses. Additionally, the company is involved in automotive, financial, construction, energy, infrastructure, logistics, and information technology businesses. It operates in Greater China, Southeast Asia, the United Kingdom, and internationally. The company was founded in 1832 and is based in Hamilton, Bermuda. Jardine Matheson Holdings Limited operates as a subsidiary of Jardine Strategic Holdings Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "JARLF": {
        "short_name": "JARDINE MATHESON HLDGS",
        "long_name": "Jardine Matheson Holdings Limited",
        "summary": "Jardine Matheson Holdings Limited, through its subsidiaries, engages in the motor vehicles and related operations, property investment and development, food retailing, home furnishings, engineering and construction, and transportation businesses. It is also involved in the insurance brokerage, financial services, heavy equipment, mining, and agribusinesses. The company offers ground handling, and aviation and travel agency services; and engineering, sourcing, and contracting services, as well as owns and operates air cargo terminals, and invests in residential properties. It is also involved in the Pizza Hut and KFC restaurants operations; designing, engineering, installation, maintenance, and modernization of lifts, escalators, and moving walkways; corporate travel management; and provision of ticketing services to other travel agents, and technology and consultancy solutions. In addition, the company sells and services motor vehicles; invests in, owns, develops, and manages office and retail properties; operates outlets, including supermarkets, hypermarkets, convenience stores, health and beauty stores, home furnishings stores, and restaurants; invests in and manages a portfolio of deluxe and first class hotels, resorts, and residences; and provides automobile and motorcycle products. Further, it engages in the motor dealerships, financing, dairy, and cement businesses. Additionally, the company is involved in automotive, financial, construction, energy, infrastructure, logistics, and information technology businesses. It operates in Greater China, Southeast Asia, the United Kingdom, and internationally. The company was founded in 1832 and is based in Hamilton, Bermuda. Jardine Matheson Holdings Limited operates as a subsidiary of Jardine Strategic Holdings Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "JDSHF": {
        "short_name": "JARDINE STRATEGIC HLDGS",
        "long_name": "Jardine Strategic Holdings Limited",
        "summary": "Jardine Strategic Holdings Limited, through its subsidiaries, engages in the engineering and construction, transport services, and insurance broking businesses in Greater China, Southeast Asia, the United Kingdom, and internationally. It is also involved in the property investment and development, food retailing, restaurants, hotels, motor vehicles and related activities, financial services, heavy equipment, mining, and agribusinesses. The company invests in, develops, leases, and manages commercial and residential properties. In addition, it operates supermarkets, hypermarkets, convenience stores, health and beauty stores, home furnishings stores, and restaurants; and 33 hotels and seven residences in 23 countries and territories. Further, the company is involved in motor trading, dairy, construction and energy, information technology, cement production, and infrastructure and logistics businesses. The company is based in Hamilton, Bermuda. Jardine Strategic Holdings Limited operates as a subsidiary of Jardine Matheson Holdings Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "JMHLY": {
        "short_name": "JARDINE MATHESON HLDGS",
        "long_name": "Jardine Matheson Holdings Limited",
        "summary": "Jardine Matheson Holdings Limited, through its subsidiaries, engages in the motor vehicles and related operations, property investment and development, food retailing, home furnishings, engineering and construction, and transportation businesses. It is also involved in the insurance brokerage, financial services, heavy equipment, mining, and agribusinesses. The company offers ground handling, and aviation and travel agency services; and engineering, sourcing, and contracting services, as well as owns and operates air cargo terminals, and invests in residential properties. It is also involved in the Pizza Hut and KFC restaurants operations; designing, engineering, installation, maintenance, and modernization of lifts, escalators, and moving walkways; corporate travel management; and provision of ticketing services to other travel agents, and technology and consultancy solutions. In addition, the company sells and services motor vehicles; invests in, owns, develops, and manages office and retail properties; operates outlets, including supermarkets, hypermarkets, convenience stores, health and beauty stores, home furnishings stores, and restaurants; invests in and manages a portfolio of deluxe and first class hotels, resorts, and residences; and provides automobile and motorcycle products. Further, it engages in the motor dealerships, financing, dairy, and cement businesses. Additionally, the company is involved in automotive, financial, construction, energy, infrastructure, logistics, and information technology businesses. It operates in Greater China, Southeast Asia, the United Kingdom, and internationally. The company was founded in 1832 and is based in Hamilton, Bermuda. Jardine Matheson Holdings Limited operates as a subsidiary of Jardine Strategic Holdings Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "JRVR": {
        "short_name": "James River Group Holdings, Ltd",
        "long_name": "James River Group Holdings, Ltd.",
        "summary": "James River Group Holdings, Ltd., through its subsidiaries, provides specialty insurance and reinsurance services in the United States. It operates through Excess and Surplus Lines, Specialty Admitted Insurance, and Casualty Reinsurance segments. The Excess and Surplus Lines segment underwrites liability and property insurance on an excess and surplus commercial lines basis in all states and the District of Columbia. This segment distributes its insurance policies primarily through wholesale insurance brokers. The Specialty Admitted Insurance segment provides workers' compensation coverage for building trades, healthcare employees, goods and services, light manufacturing, specialty transportation, agriculture, and fronting and program business. The Casualty Reinsurance segment offers proportional and working layer casualty reinsurance to third parties and unaffiliated insurance companies. James River Group Holdings, Ltd. was founded in 2002 and is headquartered in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Specialty",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "JSHLY": {
        "short_name": "JARDINE STRATEGIC HLDGS",
        "long_name": "Jardine Strategic Holdings Limited",
        "summary": "Jardine Strategic Holdings Limited, through its subsidiaries, engages in the engineering and construction, transport services, and insurance broking businesses in Greater China, Southeast Asia, the United Kingdom, and internationally. It is also involved in the property investment and development, food retailing, restaurants, hotels, motor vehicles and related activities, financial services, heavy equipment, mining, and agribusinesses. The company invests in, develops, leases, and manages commercial and residential properties. In addition, it operates supermarkets, hypermarkets, convenience stores, health and beauty stores, home furnishings stores, and restaurants; and 33 hotels and seven residences in 23 countries and territories. Further, the company is involved in motor trading, dairy, construction and energy, information technology, cement production, and infrastructure and logistics businesses. The company is based in Hamilton, Bermuda. Jardine Strategic Holdings Limited operates as a subsidiary of Jardine Matheson Holdings Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "JSL.SG": {
        "short_name": "JARDINE STRATEGIC HOLDINGS LTDR",
        "long_name": "Jardine Strategic Holdings Limited",
        "summary": "Jardine Strategic Holdings Limited, through its subsidiaries, engages in the engineering and construction, transport services, and insurance broking businesses in Greater China, Southeast Asia, the United Kingdom, and internationally. It is also involved in the property investment and development, food retailing, restaurants, hotels, motor vehicles and related activities, financial services, heavy equipment, mining, and agribusinesses. The company invests in, develops, leases, and manages commercial and residential properties. In addition, it operates supermarkets, hypermarkets, convenience stores, health and beauty stores, home furnishings stores, and restaurants; and 33 hotels and seven residences in 23 countries and territories. Further, the company is involved in motor trading, dairy, construction and energy, information technology, cement production, and infrastructure and logistics businesses. The company is based in Hamilton, Bermuda. Jardine Strategic Holdings Limited operates as a subsidiary of Jardine Matheson Holdings Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "KNSA": {
        "short_name": "Kiniksa Pharmaceuticals, Ltd.",
        "long_name": "Kiniksa Pharmaceuticals, Ltd.",
        "summary": "Kiniksa Pharmaceuticals, Ltd., a clinical-stage biopharmaceutical company, focuses on discovering, acquiring, developing, and commercializing therapeutic medicines for patients suffering from debilitating diseases with significant unmet medical need worldwide. Its clinical-stage product candidates include Rilonacept, which is in Phase III clinical trials for the treatment of recurrent pericarditis, an inflammatory cardiovascular disease; Mavrilimumab, a monoclonal antibody that is in Phase II clinical trials for the treatment of giant cell arteritis; and KPL-716, a monoclonal antibody, which is in Phase 2a clinical trial for the treatment of prurigo nodularis, a chronic inflammatory skin condition; and in Phase 1a clinical trial for the treatment of atopic dermatitis. The company's preclinical product candidates comprise KPL-404, a monoclonal antibody inhibitor of the CD40/CD40L interaction, a central control node of T-cell-dependent, and B-cell-mediated humoral adaptive immunity. The company has a clinical collaboration with Kite Pharma, Inc. to evaluate investigational combination of Yescarta and Mavrilimumab in patients with relapsed or refractory Large B-Cell lymphoma. Kiniksa Pharmaceuticals, Ltd. was founded in 2015 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "LAZ": {
        "short_name": "Lazard LTD. Lazard, LTD.",
        "long_name": "Lazard Ltd",
        "summary": "Lazard Ltd, together with its subsidiaries, operates as a financial advisory and asset management firm in North America, Europe, Asia, Australia, and Central and South America. Its Financial Advisory segment offers various financial advisory services regarding mergers and acquisitions and other strategic matters, capital advisory, restructurings, shareholder advisory, sovereign advisory, capital raising, and other strategic advisory matters. This segment serves corporate, partnership, institutional, government, sovereign, and individual clients. The company's Asset Management segment offers a range of investment solutions and investment management services in equity and fixed income strategies; and alternative investments and private equity funds to corporations, public funds, sovereign entities, endowments and foundations, labor funds, financial intermediaries, and private clients. Lazard Ltd was founded in 1848 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "LCSHF": {
        "short_name": "LANCASHIRE HLDGS",
        "long_name": "Lancashire Holdings Limited",
        "summary": "Lancashire Holdings Limited provides specialty insurance and reinsurance products in the United States, Canada, Europe, the Far East, the Middle East, and internationally. The company operates through five segments: Property, Energy, Marine, Aviation, and Lancashire Syndicate. It offers aviation insurance solutions comprising AV52, aviation deductible, and other aviation solutions; coverage for upstream operational and construction all risks related to wind, earthquakes, and floods, as well as standalone business interruption coverage, and downstream and onshore operational business coverage; and coverage in marine portfolio, including marine hull, total loss and war, mortgagees interests insurance, mortgagees additional perils, excess protection and indemnity, marine war, and builder's risks to high-profile accounts, cruise vessels, and liquid natural gas carriers. The company also provides property reinsurance solutions comprising worldwide property catastrophe excess of loss and territorial specific retrocession; and terrorism and political risk solutions consisting of war and strike, riots, civil commotion, confiscation, expropriation, nationalization, deprivation, political violence, and currency inconvertibility/non transfer, as well as contract frustration cover against sovereign and quasi sovereign entities. In addition, it offers general insurance, insurance management, support, insurance agent, and insurance mediation services. The company was founded in 2005 and is headquartered in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Specialty",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "LNH.F": {
        "short_name": "LANCASHIRE HLDGS  DL -,50",
        "long_name": "Lancashire Holdings Limited",
        "summary": "Lancashire Holdings Limited provides specialty insurance and reinsurance products in the United States, Canada, Europe, the Far East, the Middle East, and internationally. The company operates through five segments: Property, Energy, Marine, Aviation, and Lancashire Syndicate. It offers aviation insurance solutions comprising AV52, aviation deductible, and other aviation solutions; coverage for upstream operational and construction all risks related to wind, earthquakes, and floods, as well as standalone business interruption coverage, and downstream and onshore operational business coverage; and coverage in marine portfolio, including marine hull, total loss and war, mortgagees interests insurance, mortgagees additional perils, excess protection and indemnity, marine war, and builder's risks to high-profile accounts, cruise vessels, and liquid natural gas carriers. The company also provides property reinsurance solutions comprising worldwide property catastrophe excess of loss and territorial specific retrocession; and terrorism and political risk solutions consisting of war and strike, riots, civil commotion, confiscation, expropriation, nationalization, deprivation, political violence, and currency inconvertibility/non transfer, as well as contract frustration cover against sovereign and quasi sovereign entities. In addition, it offers general insurance, insurance management, support, insurance agent, and insurance mediation services. The company was founded in 2005 and is headquartered in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Insurance—Specialty",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "LRE.L": {
        "short_name": "LANCASHIRE HOLDINGS LIMITED COM",
        "long_name": "Lancashire Holdings Limited",
        "summary": "Lancashire Holdings Limited provides specialty insurance and reinsurance products in the United States, Canada, Europe, the Far East, the Middle East, and internationally. The company operates through five segments: Property, Energy, Marine, Aviation, and Lancashire Syndicate. It offers aviation insurance solutions comprising AV52, aviation deductible, and other aviation solutions; coverage for upstream operational and construction all risks related to wind, earthquakes, and floods, as well as standalone business interruption coverage, and downstream and onshore operational business coverage; and coverage in marine portfolio, including marine hull, total loss and war, mortgagees interests insurance, mortgagees additional perils, excess protection and indemnity, marine war, and builder's risks to high-profile accounts, cruise vessels, and liquid natural gas carriers. The company also provides property reinsurance solutions comprising worldwide property catastrophe excess of loss and territorial specific retrocession; and terrorism and political risk solutions consisting of war and strike, riots, civil commotion, confiscation, expropriation, nationalization, deprivation, political violence, and currency inconvertibility/non transfer, as well as contract frustration cover against sovereign and quasi sovereign entities. In addition, it offers general insurance, insurance management, support, insurance agent, and insurance mediation services. The company was founded in 2005 and is headquartered in Hamilton, Bermuda.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Insurance—Specialty",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "MH-PC": {
        "short_name": "Maiden Holdings North America, ",
        "long_name": "Maiden Holdings, Ltd.",
        "summary": "Maiden Holdings, Ltd., through its subsidiaries, provides property and casualty reinsurance solutions to regional and specialty insurers primarily in Europe and internationally. The company writes treaties on a quota share basis and excess of loss basis. It also offers auto and credit life insurance products through its insurer partners to retail clients. The company was founded in 2007 and is headquartered in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Reinsurance",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "MH-PD": {
        "short_name": "Maiden Holdings, Ltd. 6.700% No",
        "long_name": "Maiden Holdings, Ltd.",
        "summary": "Maiden Holdings, Ltd., through its subsidiaries, provides property and casualty reinsurance solutions to regional and specialty insurers primarily in Europe and internationally. The company writes treaties on a quota share basis and excess of loss basis. It also offers auto and credit life insurance products through its insurer partners to retail clients. The company was founded in 2007 and is headquartered in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Reinsurance",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "MHLD": {
        "short_name": "Maiden Holdings, Ltd.",
        "long_name": "Maiden Holdings, Ltd.",
        "summary": "Maiden Holdings, Ltd., through its subsidiaries, provides property and casualty reinsurance solutions to regional and specialty insurers primarily in Europe and internationally. The company writes treaties on a quota share basis and excess of loss basis. It also offers auto and credit life insurance products through its insurer partners to retail clients. The company was founded in 2007 and is headquartered in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Reinsurance",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "MRVL": {
        "short_name": "Marvell Technology Group Ltd.",
        "long_name": "Marvell Technology Group Ltd.",
        "summary": "Marvell Technology Group Ltd. designs, develops, and sells analog, mixed-signal, digital signal processing, and embedded and standalone integrated circuits. It offers a portfolio of Ethernet solutions, including controllers, network adapters, physical transceivers, and switches; single or multiple core processors; custom application specific integrated circuits; and printer SoC products and application processors. The company also provides a range of storage products comprising storage controllers for hard disk drives (HDD) and solid-state drives that support various host system interfaces consisting of serial attached SCSI (SAS), serial advanced technology attachment (SATA), peripheral component interconnect express, non-volatile memory express (NVMe), and NVMe over fabrics; and fiber channel products, including host bus adapters, and controllers for server and storage system connectivity. It has operations in the United States, China, Malaysia, the Philippines, Thailand, Singapore, India, Israel, Japan, South Korea, Taiwan, and Vietnam. The company was founded in 1995 and is headquartered in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "MVL.F": {
        "short_name": "MARVELL TECH. GRP DL-,002",
        "long_name": "Marvell Technology Group Ltd.",
        "summary": "Marvell Technology Group Ltd. designs, develops, and sells analog, mixed-signal, digital signal processing, and embedded and standalone integrated circuits. It offers a portfolio of Ethernet solutions, including controllers, network adapters, physical transceivers, and switches; single or multiple core processors; custom application specific integrated circuits; and printer SoC products and application processors. The company also provides a range of storage products comprising storage controllers for hard disk drives (HDD) and solid-state drives that support various host system interfaces consisting of serial attached SCSI (SAS), serial advanced technology attachment (SATA), peripheral component interconnect express, non-volatile memory express (NVMe), and NVMe over fabrics; and fiber channel products, including host bus adapters, and controllers for server and storage system connectivity. It has operations in the United States, China, Malaysia, the Philippines, Thailand, Singapore, India, Israel, Japan, South Korea, Taiwan, and Vietnam. The company was founded in 1995 and is headquartered in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "NAT": {
        "short_name": "Nordic American Tankers Limited",
        "long_name": "Nordic American Tankers Limited",
        "summary": "Nordic American Tankers Limited, a tanker company, acquires and charters double-hull tankers in Bermuda and internationally. It operates a fleet of 23 Suezmax crude oil tankers. The company was formerly known as Nordic American Tanker Shipping Limited and changed its name to Nordic American Tankers Limited in June 2011. Nordic American Tankers Limited was founded in 1995 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "NBI1.F": {
        "short_name": "NABORS INDUSTRIES DL-,001",
        "long_name": "Nabors Industries Ltd.",
        "summary": "Nabors Industries Ltd. provides drilling and drilling-related services for land-based and offshore oil and natural gas wells. It operates through five segments: U.S. Drilling, Canada Drilling, International Drilling, Drilling Solutions, and Rig Technologies. The company offers tubular running, wellbore placement, directional drilling, measurement-while-drilling (MWD), equipment manufacturing, and rig instrumentation services; logging-while-drilling systems and services; and an optimization software. Its drilling tools include Acculine MWD tool for well-site handling; AccuSteer tool for downhole drilling dynamics measurements, and annular and bore pressure applications; and AccuMP MWD tool that provides accurate survey, gamma, and continuous inclination data; In addition, the company offers AccuWave, an electromagnetic MWD system for use in various drilling fluid environments; Navigator collaborative guidance and advisory platform that delivers automated directional drilling information and instructions; ROCKit, a directional steering control system; and REVit, an automated real time stick-slip mitigation system. Further, it manufactures and sells top drives, catwalks, wrenches, draw works, and other drilling related equipment, such as robotic systems and downhole tools; and provides automated tubular and tool handling equipment. As of December 31, 2019, the company marketed approximately 366 rigs for land-based drilling operations in the United States and Canada, as well as in 16 other countries worldwide; and 33 rigs for offshore drilling operations in the United States and internationally. Nabors Industries Ltd. was founded in 1952 and is headquartered in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "NBR": {
        "short_name": "Nabors Industries Ltd.",
        "long_name": "Nabors Industries Ltd.",
        "summary": "Nabors Industries Ltd. provides drilling and drilling-related services for land-based and offshore oil and natural gas wells. It operates through five segments: U.S. Drilling, Canada Drilling, International Drilling, Drilling Solutions, and Rig Technologies. The company offers tubular running, wellbore placement, directional drilling, measurement-while-drilling (MWD), equipment manufacturing, and rig instrumentation services; logging-while-drilling systems and services; and an optimization software. Its drilling tools include Acculine MWD tool for well-site handling; AccuSteer tool for downhole drilling dynamics measurements, and annular and bore pressure applications; and AccuMP MWD tool that provides accurate survey, gamma, and continuous inclination data; In addition, the company offers AccuWave, an electromagnetic MWD system for use in various drilling fluid environments; Navigator collaborative guidance and advisory platform that delivers automated directional drilling information and instructions; ROCKit, a directional steering control system; and REVit, an automated real time stick-slip mitigation system. Further, it manufactures and sells top drives, catwalks, wrenches, draw works, and other drilling related equipment, such as robotic systems and downhole tools; and provides automated tubular and tool handling equipment. As of December 31, 2019, the company marketed approximately 366 rigs for land-based drilling operations in the United States and Canada, as well as in 16 other countries worldwide; and 33 rigs for offshore drilling operations in the United States and internationally. Nabors Industries Ltd. was founded in 1952 and is headquartered in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "NBR-PA": {
        "short_name": "Nabors Industries Ltd. 6.00% Ma",
        "long_name": "Nabors Industries Ltd.",
        "summary": "Nabors Industries Ltd. provides drilling and drilling-related services for land-based and offshore oil and natural gas wells. It operates through five segments: U.S. Drilling, Canada Drilling, International Drilling, Drilling Solutions, and Rig Technologies. The company offers tubular running, wellbore placement, directional drilling, measurement-while-drilling (MWD), equipment manufacturing, and rig instrumentation services; logging-while-drilling systems and services; and an optimization software. Its drilling tools include Acculine MWD tool for well-site handling; AccuSteer tool for downhole drilling dynamics measurements, and annular and bore pressure applications; and AccuMP MWD tool that provides accurate survey, gamma, and continuous inclination data; In addition, the company offers AccuWave, an electromagnetic MWD system for use in various drilling fluid environments; Navigator collaborative guidance and advisory platform that delivers automated directional drilling information and instructions; ROCKit, a directional steering control system; and REVit, an automated real time stick-slip mitigation system. Further, it manufactures and sells top drives, catwalks, wrenches, draw works, and other drilling related equipment, such as robotic systems and downhole tools; and provides automated tubular and tool handling equipment. As of December 31, 2019, the company marketed approximately 366 rigs for land-based drilling operations in the United States and Canada, as well as in 16 other countries worldwide; and 33 rigs for offshore drilling operations in the United States and internationally. Nabors Industries Ltd. was founded in 1952 and is headquartered in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "NODL.OL": {
        "short_name": "NORTHERN DRILLING",
        "long_name": "Northern Drilling Ltd.",
        "summary": "Northern Drilling Ltd., a drilling contractor, focuses on acquiring and operating offshore drilling rigs for oil and gas industry. It owns two semi-submersible drilling rigs, as well as owns two drillships and an option to acquire a third drillship. The company was incorporated in 2017 and is based in Hamilton, Bermuda.",
        "currency": "NOK",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "NOL.OL": {
        "short_name": "NORTHERN OCEAN LTD",
        "long_name": "Northern Ocean Ltd.",
        "summary": "Northern Ocean Ltd. provides offshore contract drilling services for the oil and gas industry worldwide. The company was founded in 2017 and is based in Hamilton, Bermuda. Northern Ocean Ltd. operates independent of Northern Drilling Ltd. as of February 26, 2020.",
        "currency": "NOK",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "NTB": {
        "short_name": "Bank of N.T. Butterfield & Son ",
        "long_name": "The Bank of N.T. Butterfield & Son Limited",
        "summary": "The Bank of N.T. Butterfield & Son Limited provides a range of community, commercial, and private banking services to individuals and small to medium-sized businesses. It accepts retail and corporate checking, savings, term, and non-interest bearing deposits, as well as certificate of deposits. The company's lending portfolio includes residential mortgage lending, automobile lending, consumer financing, credit cards, overdraft facilities, commercial real estate lending, and commercial and industrial loans. It also offers investment products and services; and cash and liquidity management, foreign exchange, custody administration, and settlement services. In addition, the company provides personal and property/auto insurance products; letters of credit; and cash management, payroll, remote banking, money market, advisory, brokerage, trust, estate, company management, private banking, administered banking services, and fiduciary services. Further, it offers debit cards; automated teller machines; and personal and business deposit, merchant acquiring, and mobile and internet banking services. The company operates through offices in the Cayman Islands, Guernsey, Jersey, the United Kingdom, The Bahamas, Switzerland, Singapore, Mauritius, and Canada, as well as through 3 branches in Bermuda and 4 branches in the Cayman Islands. The Bank of N.T. Butterfield & Son Limited was founded in 1858 and is headquartered in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks—Diversified",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "OCN.L": {
        "short_name": "OCEAN WILSONS (HOLDINGS) LD ORD",
        "long_name": "Ocean Wilsons Holdings Limited",
        "summary": "Ocean Wilsons Holdings Limited, an investment holding company, offers maritime and logistics services in Brazil. The company operates in two segments, Maritime Services and Investments. The Maritime Services segment provides towage, port terminals, ship agency, offshore, logistics, and shipyard services. The Investments segment holds a portfolio of international investments. Ocean Wilsons Holdings Limited is based in Hamilton, Bermuda.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "PRE-PG": {
        "short_name": "PartnerRe Ltd. 6.50% Series G C",
        "long_name": "PartnerRe Ltd.",
        "summary": "PartnerRe Ltd., through its subsidiaries, provides reinsurance in Europe, North America, Asia, Australia, New Zealand, Latin America, the Caribbean, and Africa. It operates through three segments: Property & Casualty, Specialty, and Life and Health. The company reinsures various risks, including agriculture, aviation/space, casualty, catastrophe, energy, engineering, financial risks, marine, motor, multiline, and property, as well as mortality, morbidity, longevity, accident, and health products. It also reinsures alternative risk products consisting of weather and credit protection insurance to financial, industrial, and service companies. The company offers its products through brokers and direct relationships with insurance companies. PartnerRe Ltd. was founded in 1993 and is based in Pembroke, Bermuda. PartnerRe Ltd. is a subsidiary of EXOR Nederland N.V.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Reinsurance",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "PRE-PH": {
        "short_name": "PartnerRe Ltd. 7.25% Series H C",
        "long_name": "PartnerRe Ltd.",
        "summary": "PartnerRe Ltd., through its subsidiaries, provides reinsurance in Europe, North America, Asia, Australia, New Zealand, Latin America, the Caribbean, and Africa. It operates through three segments: Property & Casualty, Specialty, and Life and Health. The company reinsures various risks, including agriculture, aviation/space, casualty, catastrophe, energy, engineering, financial risks, marine, motor, multiline, and property, as well as mortality, morbidity, longevity, accident, and health products. It also reinsures alternative risk products consisting of weather and credit protection insurance to financial, industrial, and service companies. The company offers its products through brokers and direct relationships with insurance companies. PartnerRe Ltd. was founded in 1993 and is based in Pembroke, Bermuda. PartnerRe Ltd. is a subsidiary of EXOR Nederland N.V.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Reinsurance",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "PRE-PI": {
        "short_name": "PartnerRe Ltd. 5.875% Series I ",
        "long_name": "PartnerRe Ltd.",
        "summary": "PartnerRe Ltd., through its subsidiaries, provides reinsurance in Europe, North America, Asia, Australia, New Zealand, Latin America, the Caribbean, and Africa. It operates through three segments: Property & Casualty, Specialty, and Life and Health. The company reinsures various risks, including agriculture, aviation/space, casualty, catastrophe, energy, engineering, financial risks, marine, motor, multiline, and property, as well as mortality, morbidity, longevity, accident, and health products. It also reinsures alternative risk products consisting of weather and credit protection insurance to financial, industrial, and service companies. The company offers its products through brokers and direct relationships with insurance companies. PartnerRe Ltd. was founded in 1993 and is based in Pembroke, Bermuda. PartnerRe Ltd. is a subsidiary of EXOR Nederland N.V.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Reinsurance",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "RE": {
        "short_name": "Everest Re Group, Ltd.",
        "long_name": "Everest Re Group, Ltd.",
        "summary": "Everest Re Group, Ltd., through its subsidiaries, provides reinsurance and insurance products in the United States, Bermuda, and internationally. The company operates through four segments: U.S. Reinsurance, International, Bermuda, and Insurance. The U.S. Reinsurance segment writes property and casualty reinsurance; and specialty lines of business, including marine, aviation, surety, and accident and health insurance through reinsurance brokers, as well as directly with ceding companies in the United States. The International segment writes property and casualty reinsurance in Canada, Singapore, Brazil, Miami, and New Jersey. The Bermuda segment provides reinsurance and insurance to property and casualty markets through brokers and directly with ceding companies in Bermuda, and reinsurance to the United Kingdom and European markets. The Insurance segment writes property and casualty insurance products directly, as well as through general agents, wholesaler, retail brokers, and surplus lines brokers in the United States, Canada, Bermuda, and Ireland. The company also provides property and casualty reinsurance and insurance coverages, such as errors and omissions liability, directors' and officers' liability, medical malpractice, and worker's compensation products. Everest Re Group, Ltd. was founded in 1973 and is headquartered in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Reinsurance",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "RNR": {
        "short_name": "RenaissanceRe Holdings Ltd.",
        "long_name": "RenaissanceRe Holdings Ltd.",
        "summary": "RenaissanceRe Holdings Ltd. provides reinsurance and insurance products in the United States and internationally. The company operates through Property, and Casualty and Specialty segments. The Property segment writes property catastrophe excess of loss reinsurance and excess of loss retrocessional reinsurance to insure insurance and reinsurance companies against natural and man-made catastrophes, including hurricanes, earthquakes, and other windstorms, as well as claims arising from other natural and man-made catastrophes comprising tsunamis, winter storms, freezes, floods, fires, tornadoes, explosions and acts of terrorism; and other property class of products, such as proportional reinsurance, property per risk, property reinsurance, and binding facilities and regional U.S. multi-line reinsurance. The Casualty and Specialty segment writes various classes of products, such as directors and officers, medical malpractice, and professional indemnity; automobile and employer's liability, casualty clash, umbrella or excess casualty, workers' compensation, and general liability; financial and mortgage guaranty, political risk, surety, and trade credit; and accident and health, agriculture, aviation, cyber, energy, marine, satellite, and terrorism. It distributes its products and services primarily through intermediaries. The company was founded in 1993 and is headquartered in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Reinsurance",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "RNR-PE": {
        "short_name": "RenaissanceRe Holdings Ltd. 5.3",
        "long_name": "RenaissanceRe Holdings Ltd.",
        "summary": "RenaissanceRe Holdings Ltd. provides reinsurance and insurance products in the United States and internationally. The company operates through Property, and Casualty and Specialty segments. The Property segment writes property catastrophe excess of loss reinsurance and excess of loss retrocessional reinsurance to insure insurance and reinsurance companies against natural and man-made catastrophes, including hurricanes, earthquakes, and other windstorms, as well as claims arising from other natural and man-made catastrophes comprising tsunamis, winter storms, freezes, floods, fires, tornadoes, explosions and acts of terrorism; and other property class of products, such as proportional reinsurance, property per risk, property reinsurance, and binding facilities and regional U.S. multi-line reinsurance. The Casualty and Specialty segment writes various classes of products, such as directors and officers, medical malpractice, and professional indemnity; automobile and employer's liability, casualty clash, umbrella or excess casualty, workers' compensation, and general liability; financial and mortgage guaranty, political risk, surety, and trade credit; and accident and health, agriculture, aviation, cyber, energy, marine, satellite, and terrorism. It distributes its products and services primarily through intermediaries. The company was founded in 1993 and is headquartered in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Reinsurance",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "RNR-PF": {
        "short_name": "RenaissanceRe Holdings Ltd. Dep",
        "long_name": "RenaissanceRe Holdings Ltd.",
        "summary": "RenaissanceRe Holdings Ltd. provides reinsurance and insurance products in the United States and internationally. The company operates through Property, and Casualty and Specialty segments. The Property segment writes property catastrophe excess of loss reinsurance and excess of loss retrocessional reinsurance to insure insurance and reinsurance companies against natural and man-made catastrophes, including hurricanes, earthquakes, and other windstorms, as well as claims arising from other natural and man-made catastrophes comprising tsunamis, winter storms, freezes, floods, fires, tornadoes, explosions and acts of terrorism; and other property class of products, such as proportional reinsurance, property per risk, property reinsurance, and binding facilities and regional U.S. multi-line reinsurance. The Casualty and Specialty segment writes various classes of products, such as directors and officers, medical malpractice, and professional indemnity; automobile and employer's liability, casualty clash, umbrella or excess casualty, workers' compensation, and general liability; financial and mortgage guaranty, political risk, surety, and trade credit; and accident and health, agriculture, aviation, cyber, energy, marine, satellite, and terrorism. It distributes its products and services primarily through intermediaries. The company was founded in 1993 and is headquartered in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Reinsurance",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "ROM.OL": {
        "short_name": "ROMREAL INVEST LTD",
        "long_name": "RomReal Limited",
        "summary": "RomReal Limited, together with its subsidiaries, engages in property investment and development in Romania. The company owns a portfolio of properties, primarily in Constanta and Ovidiu. Its plots are primarily suited for residential and commercial developments. As of December 31, 2019, the company's land bank comprised 275,835 square meters. RomReal Limited was founded in 2005 and is based in Hamilton, Bermuda.",
        "currency": "NOK",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "RQIH.L": {
        "short_name": "RANDALL & QUILTER INVESTMENT HO",
        "long_name": "Randall & Quilter Investment Holdings Ltd",
        "summary": "Randall & Quilter Investment Holdings Ltd, together with its subsidiaries, owns and manages insurance companies worldwide. It operates through Program, Legacy, and Other segments. The company acquires legacy portfolios and insurance debt; and provides capital support to Lloyd's syndicates. It provides exit and restructuring solutions through acquisition, portfolio transfer, reinsurance, insurance business transfer, and SIR/deductible reimbursement policies. The company also offers program management services and solutions. In addition, it operates as an underwriting manager for active insurers; participator in Lloyd's Syndicates in the non-life insurance market; and purchaser of insurance receivables, as well as provides healthcare solutions. The company was founded in 1991 and is headquartered in Hamilton, Bermuda.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Insurance—Specialty",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "RRJ.F": {
        "short_name": "RENAISSANCERE HLDGS  DL 1",
        "long_name": "RenaissanceRe Holdings Ltd.",
        "summary": "RenaissanceRe Holdings Ltd. provides reinsurance and insurance products in the United States and internationally. The company operates through Property, and Casualty and Specialty segments. The Property segment writes property catastrophe excess of loss reinsurance and excess of loss retrocessional reinsurance to insure insurance and reinsurance companies against natural and man-made catastrophes, including hurricanes, earthquakes, and other windstorms, as well as claims arising from other natural and man-made catastrophes comprising tsunamis, winter storms, freezes, floods, fires, tornadoes, explosions and acts of terrorism; and other property class of products, such as proportional reinsurance, property per risk, property reinsurance, and binding facilities and regional U.S. multi-line reinsurance. The Casualty and Specialty segment writes various classes of products, such as directors and officers, medical malpractice, and professional indemnity; automobile and employer's liability, casualty clash, umbrella or excess casualty, workers' compensation, and general liability; financial and mortgage guaranty, political risk, surety, and trade credit; and accident and health, agriculture, aviation, cyber, energy, marine, satellite, and terrorism. It distributes its products and services primarily through intermediaries. The company was founded in 1993 and is headquartered in Pembroke, Bermuda.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Insurance—Reinsurance",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "RSK.F": {
        "short_name": "ARCH CAPITAL GROUP DL-,01",
        "long_name": "Arch Capital Group Ltd.",
        "summary": "Arch Capital Group Ltd., together with its subsidiaries, provides insurance, reinsurance, and mortgage insurance products worldwide. The company's Insurance segment offers primary and excess casualty coverages; loss sensitive primary casualty insurance programs; collateral protection, debt cancellation, and service contract reimbursement products; directors' and officers' liability, errors and omissions liability, employment practices and fiduciary liability, crime, professional indemnity, and other financial related coverages; medical professional and general liability insurance coverages; and workers' compensation and umbrella liability, as well as commercial automobile and inland marine products. It also provides property, energy, marine, and aviation insurance; travel insurance; accident, disability, and medical plan insurance coverages; captive insurance programs; and contract and commercial surety coverages. This segment markets its products through a group of licensed independent retail and wholesale brokers. Its Reinsurance segment provides reinsurance for third party liability and workers' compensation exposures; marine and aviation reinsurance; surety, accident and health, workers' compensation catastrophe, agriculture, trade credit, and political risk products; reinsurance protection for catastrophic losses, and personal lines and commercial property exposures; life reinsurance; casualty clash; and risk management solutions. This segment markets its reinsurance products through brokers. The company's Mortgage segment offers private mortgage insurance covering one-to-four family residential mortgages; mortgage insurance to cover previously originated residential loans; quota share reinsurance; and credit risk-sharing products. This segment sells its products through direct basis and through brokers to mortgage originators. The company was founded in 1995 and is based in Pembroke, Bermuda.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Insurance—Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "SDRL.OL": {
        "short_name": "SEADRILL LTD",
        "long_name": "Seadrill Limited",
        "summary": "Seadrill Limited, an offshore drilling contractor, provides offshore drilling services to the oil and gas industry worldwide. It operates in three segments: Floaters, Jack-up Rigs, and Other. The Floaters segment offers drilling, completion, and maintenance services for offshore exploration and production wells. Its drilling contracts relates to semi-submersible rigs and drill ships for harsh and benign environments in mid, deep, and ultra-deep waters. The Jack-up Rigs segment provides drilling, completion, and maintenance services for offshore exploration and production wells. Its drilling contracts relate to jack-up rigs for operations in harsh and benign environment in shallow waters. The Other segment offers management services to third parties and related parties. The company operates a fleet of 35 drilling units, including 7 drill ships, 12 semi-submersible rigs, and 16 jack-up rigs. It serves oil super-majors, state-owned national oil companies, and independent oil and gas companies. Seadrill Limited was founded in 2005 and is based in Hamilton, Bermuda.",
        "currency": "NOK",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "SDRLF": {
        "short_name": "Seadrill Limited",
        "long_name": "Seadrill Limited",
        "summary": "Seadrill Limited, an offshore drilling contractor, provides offshore drilling services to the oil and gas industry worldwide. It operates in three segments: Floaters, Jack-up Rigs, and Other. The Floaters segment offers drilling, completion, and maintenance services for offshore exploration and production wells. Its drilling contracts relates to semi-submersible rigs and drill ships for harsh and benign environments in mid, deep, and ultra-deep waters. The Jack-up Rigs segment provides drilling, completion, and maintenance services for offshore exploration and production wells. Its drilling contracts relate to jack-up rigs for operations in harsh and benign environment in shallow waters. The Other segment offers management services to third parties and related parties. The company operates a fleet of 35 drilling units, including 7 drill ships, 12 semi-submersible rigs, and 16 jack-up rigs. It serves oil super-majors, state-owned national oil companies, and independent oil and gas companies. Seadrill Limited was founded in 2005 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "SEAOF": {
        "short_name": "SEACO LIMITED",
        "long_name": "SeaCo Ltd.",
        "summary": "SeaCo Ltd. is engaged in the container investment and leasing activities in Bermuda. The company was founded in 2009 and is based in Hamilton, Bermuda. SeaCo Ltd. is in Liquidation.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "SFL": {
        "short_name": "SFL Corporation Ltd",
        "long_name": "SFL Corporation Ltd.",
        "summary": "SFL Corporation Ltd. engages in the ownership, operation, and chartering out of vessels and offshore related assets on medium and long-term charters. It is also involved in the charter, purchase, and sale of assets. In addition, the company operates in various sectors of the shipping and offshore industry, including oil transportation, dry bulk shipments, chemical transportation, oil product transportation, container transportation, car transportation, drilling rigs, and offshore support vessels. As of December 31, 2019, it had a fleet of 81 vessels and rigs. It operates in Bermuda, Cyprus, Malta, Liberia, Norway, the United Kingdom, and the Marshall Islands. The company was formerly known as Ship Finance International Limited and changed its name to SFL Corporation Ltd. in September 2019. SFL Corporation Ltd. was founded in 2003 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "SG": {
        "short_name": "Sirius International Insurance ",
        "long_name": "Sirius International Insurance Group, Ltd.",
        "summary": "Sirius International Insurance Group, Ltd., through its subsidiaries, provides insurance and reinsurance products worldwide. The company operates through four segments: Global Reinsurance, Global A&H, U.S. Specialty, and Runoff and Other. It offers property insurance and reinsurance; property catastrophe excess reinsurance; agriculture reinsurance; healthcare and medical travel insurance; insurance and reinsurance product lines, including aviation and space, marine, trade credit, contingency, casualty, surety, and environmental specialty lines; and asbestos risks, environmental risks, and other long-tailed liability exposure products, as well as administration services. The company is also involved in the acquisition and management of runoff liabilities for insurance and reinsurance companies. Sirius International Insurance Group, Ltd. is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Property & Casualty",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "SIG": {
        "short_name": "Signet Jewelers Limited",
        "long_name": "Signet Jewelers Limited",
        "summary": "Signet Jewelers Limited engages in the retail sale of diamond jewelry, watches, and other products. As of February 01, 2020, it operated 3,208 stores and kiosks. The company operates through three segments: North America, International, and Other. The North America segment operates jewelry stores in malls and off-mall locations primarily under the Kay Jewelers, Kay Jewelers Outlet, Jared The Galleria Of Jewelry, Jared Vault, Zales Jewelers, Zales Outlet, Piercing Pagoda, Peoples Jewellers, Gordon's Jewelers, and Mappins Jewellers regional banners; and JamesAllen.com, an online jewelry retailer Website. This segment operated 2,639 locations in the United States and 118 locations in Canada. The International segment operates stores in shopping malls and off-mall locations, principally under the H.Samuel and Ernest Jones brands. This segment operated 451 stores in the United Kingdom, the Republic of Ireland, and the Channel Islands. The Other segment is involved in the purchase and conversion of rough diamonds to polished stones, as well as provision of diamond polishing services. Signet Jewelers Limited was founded in 1950 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "SKRUF": {
        "short_name": "SCOTTISH RE GROUP LIMITED",
        "long_name": "Scottish Re Group Limited",
        "summary": "Scottish Re Group Limited, through its subsidiaries, offers reinsurance of life insurance, annuities, and annuity-type products. Scottish Re Group Limited was formerly known as Scottish Annuity & Life Holdings, Ltd. and changed its name to Scottish Re Group Limited in September 2003. The company was founded in 1998 and is based in Hamilton, Bermuda. Scottish Re Group Limited operates as a subsidiary Srgl Acquisition, Ldc. Scottish Re Group Limited is under liquidation.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Life",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "SLP.L": {
        "short_name": "SYLVANIA PLATINUM LIMITED CMN S",
        "long_name": "Sylvania Platinum Limited",
        "summary": "Sylvania Platinum Limited primarily engages in the retreatment of platinum group metals (PGM) bearing chrome tailings materials in South Africa and Mauritius. The company produces PGMs, such as platinum, palladium, and rhodium. It holds interests in the Sylvania dump operations, as well as Northern Limb projects. The company is based in Hamilton, Bermuda.",
        "currency": "GBp",
        "sector": "Basic Materials",
        "industry": "Other Precious Metals & Mining",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "SSTRF": {
        "short_name": "SILVERSTAR HLDGS",
        "long_name": "Silverstar Holdings Ltd.",
        "summary": "Silverstar Holdings Ltd., through its subsidiaries, publishes entertainment software worldwide. It publishes entertainment software for various game platforms, including Microsoft's Xbox 360 and Xbox platforms, Sony's PS2 and PSP platforms, Nintendo's Wii, and DS platforms, as well as personal computer, mobile, and other digital platforms. The company also develops wireless broadband solutions for the mobile telecommunications industry. Silverstar Holdings Ltd.'s games are sold directly in the United Kingdom; either directly or through third party software distributors in the rest of Europe; and through licensed third party distributors in North America. Its products are also sold on CD's and over the Internet. Silverstar Holdings Ltd. was formerly known as Leisureplanet Holdings, Ltd. and changed its name to Silverstar Holdings Ltd. in December 2000. The company was founded in 1995 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "SYCRF": {
        "short_name": "SYNCORA HLDGS LTD",
        "long_name": "Syncora Holdings Ltd.",
        "summary": "Syncora Holdings Ltd. does not have significant operations. It was previously engaged in the provision of financial guarantee insurance and reinsurance, and credit enhancement for the obligations of debt issuers. The company was formerly known as Security Capital Assurance Ltd. Syncora Holdings Ltd. was founded in 2006 and is headquartered in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Specialty",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "SZ2.F": {
        "short_name": "SIGNET JEWELERS  DL-,18",
        "long_name": "Signet Jewelers Limited",
        "summary": "Signet Jewelers Limited engages in the retail sale of diamond jewelry, watches, and other products. As of February 01, 2020, it operated 3,208 stores and kiosks. The company operates through three segments: North America, International, and Other. The North America segment operates jewelry stores in malls and off-mall locations primarily under the Kay Jewelers, Kay Jewelers Outlet, Jared The Galleria Of Jewelry, Jared Vault, Zales Jewelers, Zales Outlet, Piercing Pagoda, Peoples Jewellers, Gordon's Jewelers, and Mappins Jewellers regional banners; and JamesAllen.com, an online jewelry retailer Website. This segment operated 2,639 locations in the United States and 118 locations in Canada. The International segment operates stores in shopping malls and off-mall locations, principally under the H.Samuel and Ernest Jones brands. This segment operated 451 stores in the United Kingdom, the Republic of Ireland, and the Channel Islands. The Other segment is involved in the purchase and conversion of rough diamonds to polished stones, as well as provision of diamond polishing services. Signet Jewelers Limited was founded in 1950 and is based in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "TGH": {
        "short_name": "Textainer Group Holdings Limite",
        "long_name": "Textainer Group Holdings Limited",
        "summary": "Textainer Group Holdings Limited, through its subsidiaries, engages in the purchase, ownership, management, leasing, and disposal of a fleet of intermodal containers worldwide. It operates through three segments: Container Ownership, Container Management, and Container Resale. The company owns and leases standard dry freight containers, refrigerated, and other special-purpose containers. It also provides container management, acquisition, and disposal services to affiliated and unaffiliated container investors. In addition, the company sells containers from its fleet, as well as purchases, leases, or resells containers from shipping line customers, container traders, and other sellers of containers. It operates a fleet of approximately 2.3 million containers, representing 3.5 million twenty-foot equivalent units. The company primarily serves shipping lines, as well as freight forwarding companies and the United States military. Textainer Group Holdings Limited was founded in 1979 and is headquartered in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "TGP": {
        "short_name": "Teekay LNG Partners L.P.",
        "long_name": "Teekay LNG Partners L.P.",
        "summary": "Teekay LNG Partners L.P. provides marine transportation services focusing on liquefied natural gas (LNG) and liquefied petroleum gas (LPG) worldwide. It operates in LNG and LPG segments. The company transports liquid petroleum gases, including propane, butane, and ethane; petrochemical gases, such as ethylene, propylene, and butadiene; and ammonia. As of December 31, 2019, it had a fleet of 49 LNG carriers and 30 LPG/multi-gas carriers. Teekay GP L.L.C. serves as the general partner of the company. Teekay LNG Partners L.P. was founded in 2004 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "TGPN.MX": {
        "short_name": "TEEKAY LNG PARTNERS LP",
        "long_name": "Teekay LNG Partners L.P.",
        "summary": "Teekay LNG Partners L.P. provides marine transportation services focusing on liquefied natural gas (LNG) and liquefied petroleum gas (LPG) worldwide. It operates in LNG and LPG segments. The company transports liquid petroleum gases, including propane, butane, and ethane; petrochemical gases, such as ethylene, propylene, and butadiene; and ammonia. As of December 31, 2019, it had a fleet of 49 LNG carriers and 30 LPG/multi-gas carriers. Teekay GP L.L.C. serves as the general partner of the company. Teekay LNG Partners L.P. was founded in 2004 and is based in Hamilton, Bermuda.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "THH.F": {
        "short_name": "TEEKAY LNG PARTNERS UTS",
        "long_name": "Teekay LNG Partners L.P.",
        "summary": "Teekay LNG Partners L.P. provides marine transportation services focusing on liquefied natural gas (LNG) and liquefied petroleum gas (LPG) worldwide. It operates in LNG and LPG segments. The company transports liquid petroleum gases, including propane, butane, and ethane; petrochemical gases, such as ethylene, propylene, and butadiene; and ammonia. As of December 31, 2019, it had a fleet of 49 LNG carriers and 30 LPG/multi-gas carriers. Teekay GP L.L.C. serves as the general partner of the company. Teekay LNG Partners L.P. was founded in 2004 and is based in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "TPRE": {
        "short_name": "Third Point Reinsurance Ltd.",
        "long_name": "Third Point Reinsurance Ltd.",
        "summary": "Third Point Reinsurance Ltd., through its subsidiaries, provides specialty property and casualty reinsurance products to insurance and reinsurance companies worldwide. It underwrites homeowners' and commercial, workers' compensation, personal automobile, mortgage, and multi-line reinsurance products; professional, transactional, and general liability reinsurance products; and marine, travel, and extended warranty reinsurance products. The company was incorporated in 2011 and is based in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Reinsurance",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "TRTN": {
        "short_name": "Triton International Limited",
        "long_name": "Triton International Limited",
        "summary": "Triton International Limited engages in the acquisition, leasing, re-leasing, and sale of various types of intermodal containers and chassis to shipping lines, and freight forwarding companies and manufacturers. It operates in two segments, Equipment Leasing and Equipment Trading. The company primarily leases dry, refrigerated, special, and tank containers; and chassis used for the transportation of intermodal containers, as well as provides maritime container management services. As of December 31, 2019, its total fleet consisted of 3.6 million containers and chassis representing 6.1 million twenty-foot equivalent units or 6.9 million cost equivalent units. The company also purchases containers from shipping line customers and other sellers, and resells these containers to container retailers and users. It operates in Asia, Europe, the Americas, Bermuda, and internationally. The company was founded in 1980 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "TRTN-PA": {
        "short_name": "Triton International Limited 8.",
        "long_name": "Triton International Limited",
        "summary": "Triton International Limited engages in the acquisition, leasing, re-leasing, and sale of various types of intermodal containers and chassis to shipping lines, and freight forwarding companies and manufacturers. It operates in two segments, Equipment Leasing and Equipment Trading. The company primarily leases dry, refrigerated, special, and tank containers; and chassis used for the transportation of intermodal containers, as well as provides maritime container management services. As of December 31, 2019, its total fleet consisted of 3.6 million containers and chassis representing 6.1 million twenty-foot equivalent units or 6.9 million cost equivalent units. The company also purchases containers from shipping line customers and other sellers, and resells these containers to container retailers and users. It operates in Asia, Europe, the Americas, Bermuda, and internationally. The company was founded in 1980 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "TRTN-PB": {
        "short_name": "Triton International Limited 8.",
        "long_name": "Triton International Limited",
        "summary": "Triton International Limited engages in the acquisition, leasing, re-leasing, and sale of various types of intermodal containers and chassis to shipping lines, and freight forwarding companies and manufacturers. It operates in two segments, Equipment Leasing and Equipment Trading. The company primarily leases dry, refrigerated, special, and tank containers; and chassis used for the transportation of intermodal containers, as well as provides maritime container management services. As of December 31, 2019, its total fleet consisted of 3.6 million containers and chassis representing 6.1 million twenty-foot equivalent units or 6.9 million cost equivalent units. The company also purchases containers from shipping line customers and other sellers, and resells these containers to container retailers and users. It operates in Asia, Europe, the Americas, Bermuda, and internationally. The company was founded in 1980 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "TRTN-PC": {
        "short_name": "Triton International Limited 7.",
        "long_name": "Triton International Limited",
        "summary": "Triton International Limited engages in the acquisition, leasing, re-leasing, and sale of various types of intermodal containers and chassis to shipping lines, and freight forwarding companies and manufacturers. It operates in two segments, Equipment Leasing and Equipment Trading. The company primarily leases dry, refrigerated, special, and tank containers; and chassis used for the transportation of intermodal containers, as well as provides maritime container management services. As of December 31, 2019, its total fleet consisted of 3.6 million containers and chassis representing 6.1 million twenty-foot equivalent units or 6.9 million cost equivalent units. The company also purchases containers from shipping line customers and other sellers, and resells these containers to container retailers and users. It operates in Asia, Europe, the Americas, Bermuda, and internationally. The company was founded in 1980 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "TRTN-PD": {
        "short_name": "Triton International Limited 6.",
        "long_name": "Triton International Limited",
        "summary": "Triton International Limited engages in the acquisition, leasing, re-leasing, and sale of various types of intermodal containers and chassis to shipping lines, and freight forwarding companies and manufacturers. It operates in two segments, Equipment Leasing and Equipment Trading. The company primarily leases dry, refrigerated, special, and tank containers; and chassis used for the transportation of intermodal containers, as well as provides maritime container management services. As of December 31, 2019, its total fleet consisted of 3.6 million containers and chassis representing 6.1 million twenty-foot equivalent units or 6.9 million cost equivalent units. The company also purchases containers from shipping line customers and other sellers, and resells these containers to container retailers and users. It operates in Asia, Europe, the Americas, Bermuda, and internationally. The company was founded in 1980 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "TXT.JO": {
        "short_name": "Textainer Group Hldgs Ltd",
        "long_name": "Textainer Group Holdings Limited",
        "summary": "Textainer Group Holdings Limited, through its subsidiaries, engages in the purchase, ownership, management, leasing, and disposal of a fleet of intermodal containers worldwide. It operates through three segments: Container Ownership, Container Management, and Container Resale. The company owns and leases standard dry freight containers, refrigerated, and other special-purpose containers. It also provides container management, acquisition, and disposal services to affiliated and unaffiliated container investors. In addition, the company sells containers from its fleet, as well as purchases, leases, or resells containers from shipping line customers, container traders, and other sellers of containers. It operates a fleet of approximately 2.3 million containers, representing 3.5 million twenty-foot equivalent units. The company primarily serves shipping lines, as well as freight forwarding companies and the United States military. Textainer Group Holdings Limited was founded in 1979 and is headquartered in Hamilton, Bermuda.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "UEM.L": {
        "short_name": "UTILICO EMERGING MARKETS TRUST ",
        "long_name": "Utilico Emerging Markets Trust PLC",
        "summary": "Utilico Emerging Markets Trust PLC is a closed-ended balanced mutual fund launched and managed by ICM Investment Management Limited. The fund is co-managed by ICM Limited. It invests in the public equity and fixed income markets of emerging market countries across the globe. The fund seeks to invest in securities of companies operating in the infrastructure, utility, and related sectors. It primarily invests in value stocks of companies, as well as in convertible securities and bonds of various credit ratings. The fund focuses on businesses with essential service or monopolistic characteristics to create its portfolio. It benchmarks the performance of its portfolio against the MSCI Emerging Markets Total Return Index. The fund was formerly known as Utilico Emerging Markets Limited. Utilico Emerging Markets Trust PLC was formed on July 20, 2005 and is domiciled in United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "UTL.L": {
        "short_name": "UIL LIMITED ORD 10P (DI)",
        "long_name": "UIL Limited",
        "summary": "UIL Limited is a closed-ended equity mutual fund launched and managed by ICM Limited. The fund invests in public equity markets across the globe. It seeks to invest in stocks of companies operating in the infrastructure, utility, and related sectors including water, sewerage, waste, electricity, gas, telecommunications, ports, airports, service, rail, roads, and any business with essential service or monopolistic characteristics. The fund primarily invests in value stocks of companies. It employs fundamental analysis with a focus on such factors as sound balance sheets, good cash flows, ability to pay and sustain dividends, good asset bases, and market conditions to create its portfolio. The fund benchmarks the performance of its portfolio against the FTSE Utilities Index, FTSE All-Share Index, and the Dow Jones World Utilities Index. It was formerly known as Utilico Investments Limited. UIL Limited was formed on August, 2003 and is domiciled in Bermuda.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "VEFL-SDB.ST": {
        "short_name": "VEF Ltd",
        "long_name": "VEF Ltd.",
        "summary": "VEF Ltd. is a venture capital firm specializing in early venture, emerging growth and growth capital investments. The firm primarily invests in modern financial services and fintech sector. The financial services sector includes payments providers, Credit, mobile money and all forms of financial marketplaces. It typically invests in the emerging and frontier markets. It prefers to take a minority stakes and board representation. Vostok Emerging Finance Ltd. was founded in 2015 and is based in Hamilton, Bermuda.",
        "currency": "SEK",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "STO",
        "market": "se_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "VNV.ST": {
        "short_name": "VNV Global AB",
        "long_name": "VNV Global AB (publ)",
        "summary": "VNV Global AB (publ) formerly known as Vostok New Ventures Ltd., is a private equity and venture capital firm specializing in growth capital, buyout investments, incubation, seed/startup, early venture, mid venture, late venture. It prefers to invest  in online marketplaces, consumer-focused and business 2 business companies globally except China. It usually seeks investments where it can become a significant minority shareholder and actively manage the investment through board representation. The firm prefers to invest in unlisted companies. It prefers to take majority and minority stake in its portfolio companies. VNV Global AB (publ) was founded on April 5, 2007 and is based in Hamilton, Bermuda with an additional office in Stockholm, Sweden .",
        "currency": "SEK",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "STO",
        "market": "se_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "VSTKF": {
        "short_name": "VNV GLOBAL AB",
        "long_name": "VNV Global AB (publ)",
        "summary": "VNV Global AB (publ) formerly known as Vostok New Ventures Ltd., is a private equity and venture capital firm specializing in growth capital, buyout investments, incubation, seed/startup, early venture, mid venture, late venture. It prefers to invest  in online marketplaces, consumer-focused and business 2 business companies globally except China. It usually seeks investments where it can become a significant minority shareholder and actively manage the investment through board representation. The firm prefers to invest in unlisted companies. It prefers to take majority and minority stake in its portfolio companies. VNV Global AB (publ) was founded on April 5, 2007 and is based in Hamilton, Bermuda with an additional office in Stockholm, Sweden .",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "WNI.F": {
        "short_name": "WHITE MTNS INS. GRP  DL 1",
        "long_name": "White Mountains Insurance Group, Ltd.",
        "summary": "White Mountains Insurance Group, Ltd., through its subsidiaries, provides insurance services in the United States. The company operates through four segments: HG Global/BAM, NSM, MediaAlpha, Kudu, and Other Operations. The HG Global/BAM segment provides insurance on municipal bonds issued to finance public purposes, such as schools, utilities, and transportation facilities, as well as reinsurance protection services. The NSM segment operates as a general underwriting agency and program administrator for specialty property and casualty insurance to sectors, such as specialty transportation, social services, and real estate. The MediaAlpha segment operates MediaAlpha, a marketing technology that enables programmatic buying and selling of vertical specific, performance-based media between advertisers, and publishers through cost-per-click, cost-per-call, and cost-per-lead pricing models. The Kudu segment provides capital solutions to asset managers and registered investment advisors for general ownership transfers, management buyouts, acquisitions, growth finances, and legacy partner liquidity. The Other Operations segment offers insurance solutions to travel industry through broker channel; and manages separate accounts and pooled investment vehicles for insurance-linked securities sectors, including catastrophe bonds, collateralized reinsurance investments, and industry loss warranties of third-party clients. White Mountains Insurance Group, Ltd. was incorporated in 1980 and is headquartered in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Insurance—Property & Casualty",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "WSON33.SA": {
        "short_name": "WILSON SONS DR3",
        "long_name": "Wilson Sons Limited",
        "summary": "Wilson Sons Limited provides port, maritime, and logistics services in Brazil. The company manages two container terminals, such as Rio Grande and Salvador container terminals. Its logistics solutions include bonded and general warehousing, inventory management, distribution, transport management, and foreign trade solutions. The company also operates 75 tugboats; and offers salvage assistance, fire-fighting, ocean towage, and support services for the construction of oil platforms and offshore drilling rigs. In addition, it is involved in the construction, maintenance, and repair of small and medium sized vessels that are used primarily for the offshore and harbour support. Further, the company provides logistics services, such as transportation of equipment, mud and pipes drilling, cement, food, waste, and other materials between port terminals and offshore platforms; and manages equipment logistics, boarding documents, and regular and non-regular ships scheduling, as well as prepares documents related to maritime transport, demurrage control, and others. It serves shipping companies, importers, exporters, and oil and gas companies, as well as other participants in various sectors. Wilson Sons Limited was founded in 1837 and is headquartered in Hamilton, Bermuda. Wilson Sons Limited is a subsidiary of Ocean Wilsons Holdings Ltd.",
        "currency": "BRL",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "WTM": {
        "short_name": "White Mountains Insurance Group",
        "long_name": "White Mountains Insurance Group, Ltd.",
        "summary": "White Mountains Insurance Group, Ltd., through its subsidiaries, provides insurance services in the United States. The company operates through four segments: HG Global/BAM, NSM, MediaAlpha, Kudu, and Other Operations. The HG Global/BAM segment provides insurance on municipal bonds issued to finance public purposes, such as schools, utilities, and transportation facilities, as well as reinsurance protection services. The NSM segment operates as a general underwriting agency and program administrator for specialty property and casualty insurance to sectors, such as specialty transportation, social services, and real estate. The MediaAlpha segment operates MediaAlpha, a marketing technology that enables programmatic buying and selling of vertical specific, performance-based media between advertisers, and publishers through cost-per-click, cost-per-call, and cost-per-lead pricing models. The Kudu segment provides capital solutions to asset managers and registered investment advisors for general ownership transfers, management buyouts, acquisitions, growth finances, and legacy partner liquidity. The Other Operations segment offers insurance solutions to travel industry through broker channel; and manages separate accounts and pooled investment vehicles for insurance-linked securities sectors, including catastrophe bonds, collateralized reinsurance investments, and industry loss warranties of third-party clients. White Mountains Insurance Group, Ltd. was incorporated in 1980 and is headquartered in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Property & Casualty",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "WTRE": {
        "short_name": "Watford Holdings Ltd.",
        "long_name": "Watford Holdings Ltd.",
        "summary": "Watford Holdings Ltd., together with its subsidiaries, operates as a property, casualty, and mortgage insurance and reinsurance company worldwide. The company offers casualty reinsurance products, such as executive assurance, medical malpractice liability, other professional liability, workers' compensation, umbrella liability; other specialty reinsurance, including personal and commercial automobile, mortgage, surety, accident and health, workers' compensation catastrophe, agriculture and marine, and aviation; and property catastrophe reinsurance, as well as other insurance programs comprising general liability, umbrella liability, professional liability, personal and commercial automobile, and inland marine and property business with minimal catastrophe exposure. The company was founded in 2013 and is headquartered in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Diversified",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    },
    "WTREP": {
        "short_name": "Watford Holdings Ltd. - 8.25% C",
        "long_name": "Watford Holdings Ltd.",
        "summary": "Watford Holdings Ltd., together with its subsidiaries, operates as a property, casualty, and mortgage insurance and reinsurance company worldwide. The company offers casualty reinsurance products, such as executive assurance, medical malpractice liability, other professional liability, workers' compensation, umbrella liability; other specialty reinsurance, including personal and commercial automobile, mortgage, surety, accident and health, workers' compensation catastrophe, agriculture and marine, and aviation; and property catastrophe reinsurance, as well as other insurance programs comprising general liability, umbrella liability, professional liability, personal and commercial automobile, and inland marine and property business with minimal catastrophe exposure. The company was founded in 2013 and is headquartered in Pembroke, Bermuda.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance—Diversified",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Bermuda",
        "city": "Pembroke"
    }
}