{
    "ASPS": {
        "short_name": "Altisource Portfolio Solutions ",
        "long_name": "Altisource Portfolio Solutions S.A.",
        "summary": "Altisource Portfolio Solutions S.A. operates as an integrated service provider and marketplace for the real estate and mortgage industries in the United States and internationally. It provides property preservation and inspection services, including vendor management, marketplace transaction management, payment management technologies, and a vendor management oversight software-as-a-service (SaaS) platform. The company also offers Hubzu, an online real estate auction platform, as well as real estate auction, real estate brokerage, and asset management services; and Equator, a SaaS-based technology to manage real estate owned, short sales, foreclosure, bankruptcy, and eviction processes. In addition, it provides mortgage origination loan fulfillment, certification and certification insurance services, technologies, title insurance agent, settlement and valuation services, residential and commercial construction inspection and risk mitigation, foreclosure trustee, and commercial loan technology services. Further, the company offers Vendorly, a SaaS-based vendor management platform, as well as support services for Federal Housing Administration mortgages. It serves financial institutions, government-sponsored enterprises, utility companies, commercial banks, servicers, investors, non-bank originators, correspondent lenders, and mortgage bankers. Altisource Portfolio Solutions S.A. was incorporated in 1999 and is headquartered in Luxembourg.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Mortgage Finance",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Luxembourg",
        "city": "Luxembourg City"
    },
    "BREB.BR": {
        "short_name": "BREDERODE",
        "long_name": "Brederode SA",
        "summary": "Brederode SA is a private equity firm specializing in direct and fund of fund investments. Within direct, it specializes in buyouts, middle market, growth capital, and mature investments. Within fund of fund investments, the firm prefers to invest in private equity funds. It also invests in funds through secondary investments. The firm invests in both unlisted and listed securities. It typically invests in the companies operating in various sectors, including financial, energy, telecoms, and other sectors. It seeks to invest in Europe, United States of America, Asia and Australia. The firm seeks to acquire majority stakes. Brederode SA was founded in 1804 and is based in Luxembourg, Luxembourg.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "BRU",
        "market": "be_market",
        "country": "Luxembourg",
        "city": "Luxembourg"
    },
    "MBC.DE": {
        "short_name": "MYBUCKS SA ORD.REG. EO 1",
        "long_name": "MyBucks S.A.",
        "summary": "MyBucks S.A., a digital banking company, provides various financial products and services in Africa, Europe, and Australia. The company operates through Banking, Lending, and Management segments. It offers personal, executive, term, payroll term, vehicle log book, home, home improvement, SMME, and educational loans; and asset finance, credit wallet, budgeting tool, payment/wallet, crypto wallet, salary and airtime advance, and mortgage products under the GetBucks and Fair Go finance brands. The company also provides medical, legal, funeral, and credit cover insurance products under the GetSure brand. In addition, it offers transactional cards, savings accounts, and short term and fixed deposits, as well as mobile transactions and complete financial solutions. The company operates 116 branches. MyBucks S.A. was founded in 2011 and is based in Luxembourg City, Luxembourg.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "GER",
        "market": "de_market",
        "country": "Luxembourg",
        "city": "Luxembourg City"
    },
    "MBC.F": {
        "short_name": "MYBUCKS SA ORD.REG. EO 1",
        "long_name": "MyBucks S.A.",
        "summary": "MyBucks S.A., a digital banking company, provides various financial products and services in Africa, Europe, and Australia. The company operates through Banking, Lending, and Management segments. It offers personal, executive, term, payroll term, vehicle log book, home, home improvement, SMME, and educational loans; and asset finance, credit wallet, budgeting tool, payment/wallet, crypto wallet, salary and airtime advance, and mortgage products under the GetBucks and Fair Go finance brands. The company also provides medical, legal, funeral, and credit cover insurance products under the GetSure brand. In addition, it offers transactional cards, savings accounts, and short term and fixed deposits, as well as mobile transactions and complete financial solutions. The company operates 116 branches. MyBucks S.A. was founded in 2011 and is based in Luxembourg City, Luxembourg.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Luxembourg",
        "city": "Luxembourg City"
    },
    "REINA.AS": {
        "short_name": "REINET INVESTMENTS",
        "long_name": "Reinet Investments S.C.A.",
        "summary": "Reinet Investments S.C.A. operates as a securitization vehicle in Luxembourg. The company, through its subsidiary, Reinet Fund S.C.A., F.I.S., invests in assets. Reinet Investments Manager S.A. serves as the general partner of Reinet Investments S.C.A. The company was formerly known as Richemont S.A. and changed its name to Reinet Investments S.C.A. in October 2008. Reinet Investments S.C.A. was incorporated in 1979 and is based in Luxembourg City, Luxembourg.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "AMS",
        "market": "nl_market",
        "country": "Luxembourg",
        "city": "Luxembourg City"
    },
    "RNI.JO": {
        "short_name": "Reinet Investments S.C.A",
        "long_name": "Reinet Investments S.C.A.",
        "summary": "Reinet Investments S.C.A. operates as a securitization vehicle in Luxembourg. The company, through its subsidiary, Reinet Fund S.C.A., F.I.S., invests in assets. Reinet Investments Manager S.A. serves as the general partner of Reinet Investments S.C.A. The company was formerly known as Richemont S.A. and changed its name to Reinet Investments S.C.A. in October 2008. Reinet Investments S.C.A. was incorporated in 1979 and is based in Luxembourg City, Luxembourg.",
        "currency": "ZAc",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JNB",
        "market": "za_market",
        "country": "Luxembourg",
        "city": "Luxembourg City"
    }
}