{
    "AXBN.MX": {
        "short_name": "AXIS BANK",
        "long_name": "Axis Bank Limited",
        "summary": "Axis Bank Limited provides corporate and retail banking products and services in India and internationally. The company's deposit products include savings, salary, and current accounts, as well as fixed, recurring, tax saver fixed, and flexi deposits. It also provides home, personal, holiday, car, business, gold, two wheeler, working capital, and education loans, as well as loans against properties, securities, and fixed deposits; and commercial vehicle and construction equipment loans. In addition, the company offers safe deposit locker, safe custodian, and pension system services; foreign exchange services; investment products; and life, general, home, health, travel, motor, and business guard insurance products. Further, it provides cash management, trade, treasury, capital market, corresponding banking and financial institutions, pension, and bullion services; debit and credit cards; mutual funds, public provident funds, demat accounts, and systematic investment plan; products and services for non-resident Indians; agricultural and rural banking products and services; and burgundy and priority banking products and services. Additionally, the company offers corporate, online, mobile, and phone banking; trade finance; and risk management solutions. Axis Bank Limited operates approximately 4,528 domestic branches with 12,044 ATMs and 5,433 cash recyclers; 11 overseas offices with branches at Singapore, Hong Kong, Dubai, Colombo, Shanghai, and Gift City-IBU; and representative offices at Dhaka, Dubai, Abu Dhabi, and Sharjah. The company was formerly known as UTI Bank Limited and changed its name to Axis Bank Limited in July 2007. Axis Bank Limited was incorporated in 1993 and is based in Mumbai, India.",
        "currency": "MXN",
        "sector": "Financial",
        "industry": "Money Center Banks",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "India",
        "city": "Mumbai"
    },
    "IBNN.MX": {
        "short_name": "ICICI BANK LIMITED",
        "long_name": "ICICI Bank Limited",
        "summary": "ICICI Bank Limited provides various banking products and financial services in India and internationally. It operates in Retail Banking, Wholesale Banking, Treasury, and Others Banking segments. The company offers savings, salary, pension, current, and other accounts; and fixed, recurring, and security deposits. It also provides home, car, two wheeler, personal, gold, and commercial business loans, as well as loans against securities and other loans; business loans, such as working capital finance, term loans, collateral free loans, loans without financials, finance for importers and exporters, and secured loans for credit card swipes, as well as loans for new entities, and schools and colleges; and credit, debit, prepaid, travel, and corporate cards. In addition, the company offers insurance products; pockets wallet; fixed income products; investment products, such as mutual funds, gold monetization schemes, and initial public offerings, as well as other online investment services; and farmer finance, tractor loans, and micro banking services, as well as other services to agri traders and processors, and agri corporates. Further, it provides portfolio management, trade, foreign exchange, locker, private and NRI banking, and cash management services; family wealth and demat accounts; commercial and investment banking, capital market, custodial, project and technology finance, and institutional banking services, as well as Internet, mobile, and phone banking services. Additionally, the company offers securities investment, broking, trading, and underwriting services; and merchant banking, trusteeship, housing finance, and pension fund management services. As of March 31, 2020, it had a network of 5,324 branches, 15,688 ATMs, 1,638 insta-banking kiosks, 483,538 POS terminals, and 1,791 cash acceptance machines. ICICI Bank Limited was founded in 1955 and is headquartered in Mumbai, India.",
        "currency": "MXN",
        "sector": "Financial",
        "industry": "Money Center Banks",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "India",
        "city": "Mumbai"
    }
}