{
    "AXBN.MX": {
        "short_name": "AXIS BANK",
        "long_name": "Axis Bank Limited",
        "summary": "Axis Bank Limited provides corporate and retail banking products and services in India and internationally. The company's deposit products include savings, salary, and current accounts, as well as fixed, recurring, tax saver fixed, and flexi deposits. It also provides home, personal, holiday, car, business, gold, two wheeler, working capital, and education loans, as well as loans against properties, securities, and fixed deposits; and commercial vehicle and construction equipment loans. In addition, the company offers safe deposit locker, safe custodian, and pension system services; foreign exchange services; investment products; and life, general, home, health, travel, motor, and business guard insurance products. Further, it provides cash management, trade, treasury, capital market, corresponding banking and financial institutions, pension, and bullion services; debit and credit cards; mutual funds, public provident funds, demat accounts, and systematic investment plan; products and services for non-resident Indians; agricultural and rural banking products and services; and burgundy and priority banking products and services. Additionally, the company offers corporate, online, mobile, and phone banking; trade finance; and risk management solutions. Axis Bank Limited operates approximately 4,528 domestic branches with 12,044 ATMs and 5,433 cash recyclers; 11 overseas offices with branches at Singapore, Hong Kong, Dubai, Colombo, Shanghai, and Gift City-IBU; and representative offices at Dhaka, Dubai, Abu Dhabi, and Sharjah. The company was formerly known as UTI Bank Limited and changed its name to Axis Bank Limited in July 2007. Axis Bank Limited was incorporated in 1993 and is based in Mumbai, India.",
        "currency": "MXN",
        "sector": "Financial",
        "industry": "Money Center Banks",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400025",
        "website": "http://www.axisbank.com",
        "market_cap": 584250490880
    }
}