{
    "ASELS.IS": {
        "short_name": "ASELSAN",
        "long_name": "Aselsan Elektronik Sanayi ve Ticaret Anonim Sirketi",
        "summary": "Aselsan Elektronik Sanayi ve Ticaret Anonim Sirketi engages in the research, development, engineering, production, testing, assembly, integration, sale, consultancy, and trading of software, equipment, system, tools, material, and platforms. The company operates through five divisions: Communication and Information Technologies; Radar, Electronic Warfare and Intelligence Systems; Defense Systems Technologies; Microelectronics, Guidance & Electro-Optics; and Transportation, Security, Energy & Automation Systems. It offers communication systems, military communication systems, public safety communication systems, mobile communication systems, information technology systems, space technologies, satellite ground systems, satellite payloads, and encryption and information security systems. The company is also involved in the design, development, and integration of naval and naval combat systems of underwater and surface platforms; air and missile defense systems; land systems, main battle tank systems, and fire control systems, as well as command control communication and computer systems; and weapon and weapon fire control systems. In addition, it manufactures and develops electro-optic systems, guidance and unmanned systems, and avionics systems; and transportation systems, security systems, and energy systems, as well as traffic, automation, and medical systems. Aselsan Elektronik Sanayi ve Ticaret Anonim Sirketi offers its products and services for army, navy, air force, and aerospace applications in Turkey and internationally. The company was founded in 1975 and is headquartered in Ankara, Turkey. Aselsan Elektronik Sanayi ve Ticaret Anonim Sirketi is a subsidiary of Turkish Armed Forces Foundation.",
        "currency": "TRY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "city": "Ankara"
    }
}