{
    "03N1.SG": {
        "short_name": "Crete Plastics S.A. Namens-Akti",
        "long_name": "Plastika Kritis S.A.",
        "summary": "Plastika Kritis S.A. produces and sells masterbatches and agricultural films in Greece. The company provides a range of masterbatches, including color, white, black, UV-stabilizer, additive, and filler masterbatches, as well as garden furniture compounds, masterbatches for PVC cables and synthetic fibers, tailor-made multi-functional masterbatches, single pigment concentrates, masterbatches for polylactide, and photo-oxo degradable masterbatches, as well as biodegradable compounds. The company also provides multi-layer films for various agricultural applications comprising greenhouses, low-tunnels, mulching, soil-disinfection, energy-screening, silage, silage and grain bags, farm and animal buildings, and pond-lining; and geomembranes, such as high density polyethylene, low density polyethylene, linear low density polyethylene, EVA, and fPP flexible membrane liners for applications in landfill lining, landfills capping, waste-water treatment reservoirs, manmade water reservoirs, irrigation canals, agriculture and aquaculture, tunnels, earth dams, underground insulation, mining, civil engineering projects, and evaporation basins. In addition, it offers polyethylene pipes for use in irrigation and water supply in agriculture, potable water supply, cable protection in telecommunications, and natural gas distribution; and recycled plastics. Further, the company owns and operates a wind park of capacity of 12 MW; and 4 photovoltaic stations with a capacity of 340 KW. It serves the plastics industry, the horticultural and agricultural markets, and projects related to water-management and environment protection. The company also exports its products to approximately 70 countries worldwide. Plastika Kritis S.A. was founded in 1970 and is based in Heraklion, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Greece",
        "state": null,
        "city": "Heraklion",
        "zipcode": "714 08",
        "website": "http://www.plastikakritis.com",
        "full_time_employees": 1098
    },
    "A3A.F": {
        "short_name": "ALUMIL ALU.IND.SA EO 0,37",
        "long_name": "Alumil Aluminium Industry S.A.",
        "summary": "Alumil Aluminium Industry S.A., together with its subsidiaries, designs, produces, and distributes a range of architectural aluminium systems in Greece and internationally. The company offers windows and doors, sliding doors, entrance doors, folding doors, railing and fences, curtain walls, partitions, wall cladding systems, and conservatories, as well as shading, safety, and security systems for doors and windows. It also provides building materials comprising polycarbonate sheets and wood-plastic composites for various applications, such as atriums, skylights, decking, fencing, cladding, and others; and various aluminum systems for atriums, glass roofs, skylights, and greenhouses. In addition, the company offers surface treatments, such as anodizing, powder coating, preanodizing, and sublimation; and accessories, including window and door locks, hinges, handles, and other hardware. Further, it provides various PV mounting structures; and automation systems. The company was founded in 1988 and is headquartered in Kilkis, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Greece",
        "state": null,
        "city": "Kilkis",
        "zipcode": "611 00",
        "website": "http://www.alumil.com",
        "full_time_employees": 2347
    },
    "ALMY.AT": {
        "short_name": "ALUMIL ALUMINIUM INDUSTRY S.A",
        "long_name": "Alumil Aluminium Industry S.A.",
        "summary": "Alumil Aluminium Industry S.A., together with its subsidiaries, designs, produces, and distributes a range of architectural aluminium systems in Greece and internationally. The company offers windows and doors, sliding doors, entrance doors, folding doors, railing and fences, curtain walls, partitions, wall cladding systems, and conservatories, as well as shading, safety, and security systems for doors and windows. It also provides building materials comprising polycarbonate sheets and wood-plastic composites for various applications, such as atriums, skylights, decking, fencing, cladding, and others; and various aluminum systems for atriums, glass roofs, skylights, and greenhouses. In addition, the company offers surface treatments, such as anodizing, powder coating, preanodizing, and sublimation; and accessories, including window and door locks, hinges, handles, and other hardware. Further, it provides various PV mounting structures; and automation systems. The company was founded in 1988 and is headquartered in Kilkis, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Kilkis",
        "zipcode": "611 00",
        "website": "http://www.alumil.com",
        "full_time_employees": 2347
    },
    "ELIN.AT": {
        "short_name": "ELINOIL S.A. (CR)",
        "long_name": "Elinoil Hellenic Petroleum Company S.A.",
        "summary": "Elinoil Hellenic Petroleum Company S.A. engages in the supply of liquid and solid fuels, and lubricants worldwide. The company offers fuels, including gasoline, diesel fuel, diesel crystal, and heating oil products; crystal fuels; gasoline and diesel engine lubricants; and solid fuels for road, sea, industrial, transport, construction, shipping, and yachting applications, as well as heating oil thermo crystals for home through distribution facilities. It also operates petrol stations. The company was formerly known as D. Diamantidis - Ch. Courouclis & Associates. Elinoil Hellenic Petroleum Company S.A. was founded in 1954 and is headquartered in Kifissia, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Kifissia",
        "zipcode": "145 64",
        "website": "http://www.elin.gr",
        "full_time_employees": 266
    },
    "ELPE.AT": {
        "short_name": "HELLENIC PETROLEUM S.A. (CR)",
        "long_name": "Hellenic Petroleum S.A.",
        "summary": "Hellenic Petroleum S.A., together with its subsidiaries, operates in the energy sector primarily in Greece, South Eastern Europe, and the East Mediterranean. It operates through the Refining, Marketing, Exploration and Production of Hydrocarbons, Petro-chemicals, Gas and Power, and Other segments. The company engages in the refining, supply, and trading of petroleum products; marketing of fuels; production and trading of petrochemicals/chemicals; exploration and production of oil and gas; and generation and trading of power. It is also involved in the production, distribution, and trading of renewable energy sources; provision of financing and other financial services; retail trade of liquid fuels and LPG; operation of tankers; exploration and production of hydrocarbons; trade, distribution, and storage of oil products; and construction and operation of crude oil pipelines. In addition, the company engages in the owning of vessels; production and marketing of lubricants, polypropylene, and solvents; trading of imported plastics and chemicals; production and trade of BOPP films; construction and operation of fuel storage facilities; and provision of treasury, consulting, and engineering services. It operates a network of 1,703 service stations, 15 fuel storage and distribution facilities, 24 aircraft refueling stations in the Greek airports, 2 LPG bottling plants, and 1 lubricant production and packing site in Greece. Hellenic Petroleum S.A. was founded in 1998 and is headquartered in Maroussi, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Major Integrated Oil & Gas",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Marousi",
        "zipcode": "151 25",
        "website": "http://www.helpe.gr",
        "full_time_employees": 3544
    },
    "ELSTR.AT": {
        "short_name": "ELASTRON S.A.",
        "long_name": "Elastron S.A. - Steel Service Centers",
        "summary": "Elastron S.A. - Steel Service Centers imports, processes, produces, and resells steel products and insulated composite panels worldwide. It offers hot-and cold-rolled, and galvanized steel plates, sheets, strips, and coils; long products, such as beams, joints, channels, flats, equal and unequal angles, rounds, squares, T-sections, and bulb flats; circular, square, and rectangular hollow sections; and structural tubes. The company also provides panels-cladding systems; composite SYMDECK decks; cladding single skin products; purlin for steel buildings; drywall metal profiles; hydroponic metal gutters; and core accessories consisting of translucent panels, flashings, and fastening and sealing materials, as well as handles installation services. Further, it produces and trades in electric energy from photovoltaic stations; and agricultural products from glasshouse cultivations. The company's steel products are used in the industry, construction, shipbuilding, agricultural, and energy sectors. The company was founded in 1958 and is headquartered in Aspropyrgos, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel & Iron",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Aspropyrgos",
        "zipcode": "193 00",
        "website": "http://www.elastron.gr",
        "full_time_employees": 76
    },
    "ELTON.AT": {
        "short_name": "ELTON CHEMICALS S.A. (CR)",
        "long_name": "Elton International Trading Company S.A.",
        "summary": "Elton International Trading Company S.A. engages in trading raw materials, additives, chemicals, and other specialized products in Greece, Romania, Turkey, Serbia, Bulgaria, and Ukraine. It offers crop protection products, seed solutions, and fertilizers-special nutrition products; ingredients and additives to the feed and animal care products industry; reagents, laboratory micro equipment and consumables, and glassware; polymers, polymer dispersions, plasticizers, solvents, pigments, additives, natural and synthetic rubbers, resins, polymer powders, accelerators, retarders, and fibers; and house care products. The company also provides food and drink products, such as acidifiers, emulsifiers, viscosifiers, leaveling agents, carbonates, citrates, lactates, phosphates, skimmed and whole fat milk powders, milk proteins, cocoa and egg products, dehydrated vegetables, bakery seeds, starches, antioxidants, vitamins, natural proteins, taste improvers, flavors, sweeteners, preservatives, fruit and bakery enzymes, wine and beer ingredients, bleaging and filtration earths, and biotechnology products for winery. In addition, it offers industrial application products, including antioxidants, catalysts, filtration elements, antifreezes, brakes liquids, microbicides, foaming agents, flotation media products, and solvents; raw materials for the production of personal care products and pharmaceuticals; dietary supplements; polyurethane systems; refrigeration specialty chemicals; products in the tanning and textiles industry; chemical products and implementation technical support to water processing industries; and rubber and plastic products, waxes, additives, and auxiliary products, as well as yeasts, enzymes, dietary factors, and winemaking additives. The company was founded in 1981 and is based in Avlona, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals - Major Diversified",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Avlona",
        "zipcode": "190 11",
        "website": "http://www.elton.gr",
        "full_time_employees": null
    },
    "KORDE.AT": {
        "short_name": "KORDELLOS CH.BROS S.A.(CR)",
        "long_name": "Kordellos Ch. Bros S.A.",
        "summary": "Kordellos Ch. Bros S.A. engages in the processing, trading, and distributing iron and steel products in Greece. The company was founded in 1952 and is based in Mandra, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel & Iron",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Mandra",
        "zipcode": "19600",
        "website": "http://www.kordelos.gr",
        "full_time_employees": 83
    },
    "MOH.AT": {
        "short_name": "MOTOR OIL HELLAS S.A. (CR)",
        "long_name": "Motor Oil (Hellas) Corinth Refineries S.A.",
        "summary": "Motor Oil (Hellas) Corinth Refineries S.A. engages in oil refining and oil products trading in Greece and internationally. It operates through three segments: Refinery's Activities, Sales to/from Gas Stations, and Services. The company produces and sells liquid fuels, lubricants, and asphalt for transportation, industrial, and household use. It also markets and distributes a range of oil products, including gasoline, fuel oil, diesel, and lubricants through a retail network of approximately 763 stations under the SHELL name; retail service comprising 29 SHELL branded fuel sites; and operates 486 gas stations under AVIN brand name and 116 gas stations under CYCLON brand. In addition, the company engages in the trading, transportation, storage, and agency of petroleum products; collection and trading of used lubricants; research, exploration, and trading of crude oil; and marketing and distribution of natural gas, as well as operates aircraft fuel supply system and the storage facilities at the Athens International Airport at Spata of Attica. Further, it is involved in the purchase, sale, exploitation, and development of real estate properties; and provision of liquefied petroleum gas, facilities management services, and financial services, as well as systems of alternative management of lubricant wastes. The company was founded in 1970 and is headquartered in Maroussi, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Marousi",
        "zipcode": "151 24",
        "website": "http://www.moh.gr",
        "full_time_employees": 2258
    },
    "MYTIL.AT": {
        "short_name": "MYTILINEOS S.A. (CR)",
        "long_name": "Mytilineos S.A.",
        "summary": "Mytilineos S.A. operates in metallurgy, sustainable engineering solution, renewables and storage development, and power and gas sectors in Greece, European Union, and internationally. The company's principal business areas include production of electricity and natural gas; operation of industrial and renewable energy plants with a total installed capacity of 1,200 MW; trading of gas; production of alumina and aluminum, as well as bauxite; and production, processing, and trading of metals, which include aluminum alloys and derivative products. Its principal business areas also include development of solar PV and energy storage; contractor of specialized large-scale integrated turn-key projects; provision of environmental solutions for water, liquid, and solid waste; energy solutions; and construction of infrastructure projects, as well as provides range of project management, engineering, procurement, construction, and plant commissioning services. The company was formerly known as Mytilineos Holdings S.A. and changed its name to Mytilineos S.A. in July 2019. Mytilineos S.A. was founded in 1908 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Industrial Metals & Minerals",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "151 25",
        "website": "http://www.mytilineos.gr",
        "full_time_employees": 3856
    },
    "PLAKR.AT": {
        "short_name": "CRETE PLASTICS S.A. (CR)",
        "long_name": "Plastika Kritis S.A.",
        "summary": "Plastika Kritis S.A. produces and sells masterbatches and agricultural films in Greece. The company provides a range of masterbatches, including color, white, black, UV-stabilizer, additive, and filler masterbatches, as well as garden furniture compounds, masterbatches for PVC cables and synthetic fibers, tailor-made multi-functional masterbatches, single pigment concentrates, masterbatches for polylactide, and photo-oxo degradable masterbatches, as well as biodegradable compounds. The company also provides multi-layer films for various agricultural applications comprising greenhouses, low-tunnels, mulching, soil-disinfection, energy-screening, silage, silage and grain bags, farm and animal buildings, and pond-lining; and geomembranes, such as high density polyethylene, low density polyethylene, linear low density polyethylene, EVA, and fPP flexible membrane liners for applications in landfill lining, landfills capping, waste-water treatment reservoirs, manmade water reservoirs, irrigation canals, agriculture and aquaculture, tunnels, earth dams, underground insulation, mining, civil engineering projects, and evaporation basins. In addition, it offers polyethylene pipes for use in irrigation and water supply in agriculture, potable water supply, cable protection in telecommunications, and natural gas distribution; and recycled plastics. Further, the company owns and operates a wind park of capacity of 12 MW; and 4 photovoltaic stations with a capacity of 340 KW. It serves the plastics industry, the horticultural and agricultural markets, and projects related to water-management and environment protection. The company also exports its products to approximately 70 countries worldwide. Plastika Kritis S.A. was founded in 1970 and is based in Heraklion, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Heraklion",
        "zipcode": "714 08",
        "website": "http://www.plastikakritis.com",
        "full_time_employees": 1098
    },
    "PROFK.AT": {
        "short_name": "PIPEWORKS GIRAKIAN PROFIL S.A",
        "long_name": "Pipe Works L. Girakian Profil S.A.",
        "summary": "Pipe Works L. Girakian Profil S.A. manufactures and sells various types of steel pipes in Greece. The company offers constructional pipes; galvanized pipes; hollow section pipes; hollow sections galvanized pipes; hollow sections used in the construction of prefabricated houses, steel buildings, and scaffolding, as well as lofts; and metal plates for manufacturing tanks and construction lofts. It also provides heavy duty tubes used in roof rafters, doors, windows, railings, housing, etc.; round tubes used in greenhouses, mesh fencing, shoring, awnings, and railings; and automotive tubes used in car seats and the exhaust. The company sells its products to wholesalers, industries, and crafts. Pipe Works L. Girakian Profil S.A. was founded in 1967 and is headquartered in Oinofyta, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel & Iron",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Oinofyta",
        "zipcode": "32011",
        "website": "http://www.tzirakian.com",
        "full_time_employees": 55
    },
    "REVOIL.AT": {
        "short_name": "REVOIL S.A",
        "long_name": "Revoil S.A.",
        "summary": "Revoil S.A. engages in the marketing of petroleum products for use in automobiles, homes, and vessels in Greece. It offers gasoline, fuel oil, petrol, and diesel; and a range of lubricants for engines, hydraulic systems, gears, and agricultural machinery. The company also provides lamps, windscreen wipers, car deodorants, and mobile accessories; and car and moto wash, lubricant change, and other services. It trades in fuels and lubricants through a network of 528 petrol stations in Greece, as well as for heating oil retailers. The company was founded in 1982 and is headquartered in Vari, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Vari",
        "zipcode": "16672",
        "website": "http://www.revoil.gr",
        "full_time_employees": null
    },
    "SIDMA.AT": {
        "short_name": "SIDMA STEEL SA (CR)",
        "long_name": "Sidma S.A. Steel Products",
        "summary": "Sidma S.A. Steel Products engages in processing and trading of steel products in Greece and internationally. The company operates in two segments, Steel and Other. It offers flat products, such as hot rolled, pickled and oiled, chequered and tear drop, cold rolled, galvanized, stainless, pre painted, and plastified surface coils and sheets, as well as corrugated and trapezoidal sheets, hot rolled plates, shipbuilding plates, boiler plates, and abrasion resistant plates. The company also provides long products, including hot rolled steel bars with rectangular, square, equilateral and non-equilateral angular, T-shaped cross-section; hot rolled beams with U-shaped cross-section, hot rolled narrow flange I-beams with taper flanges, and hot rolled medium and wide flange I-beams with parallel flanges; hot rolled bulbflats for shipbuilding purposes; and hot rolled KS crane rails and ASCE rails. In addition, it offers tubes comprising electric resistance welding (ERW) uncoated selfcolor steel profiles, ERW zinc-coated steel profiles, ERW uncoated selfcolor construction steel pipes, and ERW zinc-coated hot-dip galvanized construction steel pipes for steel pipes for industrial, structural and general use, as well as wire products. Sidma S.A. Steel Products was founded in 1931 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel & Iron",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "152 33",
        "website": "http://www.sidma.gr",
        "full_time_employees": 230
    },
    "SPIR.AT": {
        "short_name": "THE HOUSE OF AGRICULTURE SPI",
        "long_name": "The House of Agriculture Spiroy S.A.",
        "summary": "The House of Agriculture Spiroy S.A. researches, produces, and markets vegetable and crop seeds. The company provides cotton, corn, alfalfa, cucumber, endive, watermelon, pumpkin, cauliflower, onion, cabbage, lettuce, eggplant, and broccoli seeds. It offers its products in Greece, Albania, North Macedonia, Bulgaria, Romania, Spain, North Africa, Turkey, the Middle East, Ukraine, Russia, Kazakhstan, and Moldova. The company was founded in 1947 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Agricultural Chemicals",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "122 42",
        "website": "http://www.spirou.gr",
        "full_time_employees": 145
    }
}