{"ELTON.AT": {"short_name": "ELTON CHEMICALS S.A. (CR)", "long_name": "Elton International Trading Company S.A.", "summary": "Elton International Trading Company S.A. engages in trading raw materials, additives, chemicals, and other specialized products in Greece, Romania, Turkey, Serbia, Bulgaria, and Ukraine. It offers crop protection products, seed solutions, and fertilizers-special nutrition products; ingredients and additives to the feed and animal care products industry; reagents, laboratory micro equipment and consumables, and glassware; polymers, polymer dispersions, plasticizers, solvents, pigments, additives, natural and synthetic rubbers, resins, polymer powders, accelerators, retarders, and fibers; and house care products. The company also provides food and drink products, such as acidifiers, emulsifiers, viscosifiers, leaveling agents, carbonates, citrates, lactates, phosphates, skimmed and whole fat milk powders, milk proteins, cocoa and egg products, dehydrated vegetables, bakery seeds, starches, antioxidants, vitamins, natural proteins, taste improvers, flavors, sweeteners, preservatives, fruit and bakery enzymes, wine and beer ingredients, bleaging and filtration earths, and biotechnology products for winery. In addition, it offers industrial application products, including antioxidants, catalysts, filtration elements, antifreezes, brakes liquids, microbicides, foaming agents, flotation media products, and solvents; raw materials for the production of personal care products and pharmaceuticals; dietary supplements; polyurethane systems; refrigeration specialty chemicals; products in the tanning and textiles industry; chemical products and implementation technical support to water processing industries; and rubber and plastic products, waxes, additives, and auxiliary products, as well as yeasts, enzymes, dietary factors, and winemaking additives. The company was founded in 1981 and is based in Avlona, Greece.", "currency": "EUR", "sector": "Basic Materials", "industry": "Chemicals - Major Diversified", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Avlona"}}