{
    "CTAC.AS": {
        "short_name": "CTAC",
        "long_name": "Ctac N.V.",
        "summary": "Ctac N.V. provides business and cloud integration services primarily in the Netherlands, Belgium, and France. The company's services cover management, configuration, development, and users training; solution adoption, which include change, communication, and learning and performance; functional, technical, and integrated application management; and resourcing. It provides solutions in the areas of customer experience, which cover marketing, sales and service, product information management, and e-commerce and CMS; cloud as-a-service, integration, and security; data and analytics in the areas of master data management, business intelligence, and enterprise performance management; application and integration development; ERP and digital core that include SAP S/4HANA and Mendix; and smart workplace, user adoption, and managed services. The company also provides XV Retail, a point of sale cash register system and retail solution for food and non-food retailers; and Omni Customer Loyalty, a retail loyalty program. It primarily serves retail, wholesale, manufacturing, real estate, and social enterprise markets. The company was founded in 1992 and is headquartered in Â\u0091s-Hertogenbosch, the Netherlands.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "AMS",
        "market": "nl_market",
        "country": "Netherlands",
        "state": null,
        "city": "'s-Hertogenbosch",
        "zipcode": "5216 TZ",
        "website": "http://www.ctac.nl",
        "market_cap": "Micro Cap"
    },
    "NOVI.AS": {
        "short_name": "NOVISOURCE",
        "long_name": "Novisource N.V.",
        "summary": "Novisource N.V., a business and IT consultancy company, provides business service in the financial sector. The company offers consultancy services in the areas of regulatory change, digital transformation, information security, and information services. Novisource N.V. was founded in 2001 and is based in Amsterdam, the Netherlands.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "AMS",
        "market": "nl_market",
        "country": "Netherlands",
        "state": null,
        "city": "Amsterdam",
        "zipcode": "1101 BE",
        "website": "http://www.novisource.nl",
        "market_cap": "Nano Cap"
    },
    "ORA.F": {
        "short_name": "ORDINA NV  EO-10",
        "long_name": "Ordina N.V.",
        "summary": "Ordina N.V. provides IT services in the Netherlands, Belgium, and Luxembourg. It engages in devising, building, and managing technological applications in the public, financial services, and industrial sectors; and development and optimization of software and platforms, as well as management and optimization of IT landscapes. The company also provides consulting, technology, and outsourcing services. It offers its products and services under the Ordina and SourcePower brands. Ordina N.V. was founded in 1973 and is headquartered in Nieuwegein, the Netherlands.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Netherlands",
        "state": null,
        "city": "Nieuwegein",
        "zipcode": "3439 LM",
        "website": "http://www.ordina.nl",
        "market_cap": "Small Cap"
    },
    "ORDI.AS": {
        "short_name": "ORDINA",
        "long_name": "Ordina N.V.",
        "summary": "Ordina N.V. provides IT services in the Netherlands, Belgium, and Luxembourg. It engages in devising, building, and managing technological applications in the public, financial services, and industrial sectors; and development and optimization of software and platforms, as well as management and optimization of IT landscapes. The company also provides consulting, technology, and outsourcing services. It offers its products and services under the Ordina and SourcePower brands. Ordina N.V. was founded in 1973 and is headquartered in Nieuwegein, the Netherlands.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "AMS",
        "market": "nl_market",
        "country": "Netherlands",
        "state": null,
        "city": "Nieuwegein",
        "zipcode": "3439 LM",
        "website": "http://www.ordina.nl",
        "market_cap": "Small Cap"
    },
    "TPPPF": {
        "short_name": "TRIPLE P NV",
        "long_name": "Triple P N.V.",
        "summary": "Triple P. N.V. provides information and communication technology (ICT) infrastructure solutions. Its services include ICT security, cloud, managed services, managed IP telephony, professional services, business continuity, unified communications, and cloud migration. The company serves care, education, government, and commercial services sectors. Triple P. N.V. was founded in 1989 and is headquartered in Nieuwegein, the Netherlands.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Netherlands",
        "state": null,
        "city": "Nieuwegein",
        "zipcode": "3436 ZZ",
        "website": "http://www.triple-p.nl",
        "market_cap": "Nano Cap"
    }
}