{
    "ASLN": {
        "short_name": "ASLAN Pharmaceuticals Limited",
        "long_name": "ASLAN Pharmaceuticals Limited",
        "summary": "ASLAN Pharmaceuticals Limited, a clinical-stage immunology and oncology focused biopharmaceutical company, engages in developing various treatments to transform the lives of patients. The company's clinical portfolio comprises ASLAN004, a monoclonal therapy that is being developed in atopic dermatitis and other immunology indications; and a small molecule inhibitor targeting oncology. Its partners include Almirall, Array BioPharma, Bristol-Myers Squibb, and CSL Limited. The company was founded in 2010 and is headquartered in Singapore.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NGM",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "WVE": {
        "short_name": "Wave Life Sciences Ltd.",
        "long_name": "Wave Life Sciences Ltd.",
        "summary": "Wave Life Sciences Ltd., a clinical stage genetic medicine company, designs, optimizes, and produces of novel stereopure oligonucleotides through PRISM, a discovery and drug developing platform. The company is primarily developing oligonucleotides that target genetic defects to either reduce the expression of disease-promoting proteins or transform the production of dysfunctional mutant proteins into the production of functional proteins. It focuses on programs in neurology in the central nervous system and neuromuscular system. The company has a research, license, and option agreement with Pfizer Inc. and Takeda Pharmaceutical Company Limited for the research, development, and commercialization of stereopure oligonucleotide therapeutics and oligonucleotide therapeutics; and research, development, and develop antisense oligonucleotides. Wave Life Sciences Ltd. was founded in 2012 and is based in Singapore.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NGM",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}