{
    "950210.KS": {
        "short_name": "PRESTIGE BIOPHARMA",
        "long_name": "Prestige BioPharma Limited",
        "summary": "Prestige BioPharma Limited, a biopharmaceutical company, focuses on the development of biosimilars and new antibody therapeutics in the Asia Pacific. It primarily engages in the development of new and similar antibody drugs for solid tumor, pancreatic cancer, and arthritis. The company was founded in 2015 and is headquartered in Singapore.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "118222",
        "website": "http://www.prestigebiopharma.com",
        "market_cap": "Large Cap"
    },
    "ASLN": {
        "short_name": "ASLAN Pharmaceuticals Limited",
        "long_name": "ASLAN Pharmaceuticals Limited",
        "summary": "ASLAN Pharmaceuticals Limited, a clinical-stage immunology focused biopharmaceutical company, engages in developing various treatments to transform the lives of patients. The company's clinical portfolio comprises ASLAN004, a monoclonal therapy that is being developed in atopic dermatitis and other immunology indications; and ASLAN003, a small-molecule inhibitor of dihydroorotate dehydrogenase for the treatment of autoimmune conditions. It has a joint venture with Bukwang Pharmaceutical Co., Ltd. to develop immuno-oncology therapeutics for markets targeting the AhR pathway. Its partners include Almirall, Array BioPharma, and CSL Limited. The company was founded in 2010 and is headquartered in Singapore.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NGM",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "239920",
        "website": "http://aslanpharma.com",
        "market_cap": "Small Cap"
    },
    "WVE": {
        "short_name": "Wave Life Sciences Ltd.",
        "long_name": "Wave Life Sciences Ltd.",
        "summary": "Wave Life Sciences Ltd., a clinical stage genetic medicine company, designs, optimizes, and produces of novel stereopure oligonucleotides through PRISM, a discovery and drug developing platform. The company is primarily developing oligonucleotides target ribonucleic acid to reduce the expression of disease-promoting proteins or transform the production of dysfunctional mutant proteins into the production of functional proteins. It develops WVE-120101 and WVE-120102, a stereopure therapeutic candidates, which are in Phase 1b/2a clinical trials for the treatment of Huntington's disease (HD); WVE-003, mutant huntingtin SNP3 program for the treatment of HD; WVE-004, C9orf72 program for the treatment of amyotrophic lateral sclerosis and frontotemporal dementia; WVE-N531, our Exon 53 program for the treatment of Duchenne muscular dystrophy; and ATXN3 program in SCA3. The company has collaboration agreements with Pfizer Inc., Takeda Pharmaceutical Company Limited, University of Oxford, and University of Massachusetts. Wave Life Sciences Ltd. was incorporated in 2012 and is based in Singapore.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NGM",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "018936",
        "website": "http://www.wavelifesciences.com",
        "market_cap": "Small Cap"
    }
}