{
    "1B1.SI": {
        "short_name": "$ HC Surgical",
        "long_name": "HC Surgical Specialists Limited",
        "summary": "HC Surgical Specialists Limited, an investment holding company, provides medical services primarily in Singapore. It offers endoscopic procedures, including gastroscopies and colonoscopies; and general surgery services with a focus on colorectal procedures in a network of clinics. The company also offers treatment services for other conditions, such as haemorrhoids, anal abscesses, anal fissures, anal fistula, gallstones and inflammation of the gallbladder, hernias, gastric cancer, colorectal cancer, stomach cancer, colonic diverticular disease, and cysts and lipomas; and vein laser vascular, laparoscopy, and other general and specialized medical services. In addition, it provides home care, such as medical, nursing, physiotherapy, speech therapy, occupational therapy, and ambulance services; and general consultation and diagnostic services, including blood tests, X-Rays, ultrasound, CT Scans, and MRIs. The company operates 16 clinics in Singapore. HC Surgical Specialists Limited was incorporated in 2015 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "3DC.SG": {
        "short_name": "Cordlife Group Ltd Registered S",
        "long_name": "Cordlife Group Limited",
        "summary": "Cordlife Group Limited, an investment holding company, provides cord blood banking services in Singapore, Hong Kong, Macau, India, Malaysia, Indonesia, Myanmar, Vietnam, the Philippines, Bangladesh, and internationally. It operates through two segments, Banking and Diagnostics. The company provides cord blood, cord lining, and cord tissue banking services comprising processing and storage of stem cells; and non-invasive prenatal testing, paediatric vision screening, newborn metabolic screening, and family genetic screening services. It also offers management, marketing, and property investment services. The company was formerly known as Cordlife Pte Ltd and changed its name to Cordlife Group Limited in 2011. Cordlife Group Limited was founded in 2001 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "505.SI": {
        "short_name": "$ AsiaMedic",
        "long_name": "AsiaMedic Limited",
        "summary": "AsiaMedic Limited, an investment holding company, provides healthcare services in Singapore. The company focuses on the management of clinical services in the fields of disease prevention, early illness detection, and medical imaging and aesthetics. It offers health risk assessments and screenings, and anti-aging and health risk management programs for optimized healthy aging and wellness. The company also provides general and subspecialty computerized tomography (CT) and magnetic resonance imaging (MRI) imaging scans for cardiovascular, neuroradiological, ENT, and musculoskeletal imaging, as well as positron emission tomography (PET)/CT imaging for diagnosis, staging, localization, and monitoring progress of cancer and cardiac diseases; and other imaging services, including bone densitometry, ultrasound, mammography, and X-ray. In addition, it operates travel and aesthetic clinics, and family medicine practices, as well as sells pharmaceutical and aesthetic related products. The company was incorporated in 1974 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "P8A.SI": {
        "short_name": "Cordlife",
        "long_name": "Cordlife Group Limited",
        "summary": "Cordlife Group Limited, an investment holding company, provides cord blood banking services in Singapore, Hong Kong, Macau, India, Malaysia, Indonesia, Myanmar, Vietnam, the Philippines, Bangladesh, and internationally. It operates through two segments, Banking and Diagnostics. The company provides cord blood, cord lining, and cord tissue banking services comprising processing and storage of stem cells; and non-invasive prenatal testing, paediatric vision screening, newborn metabolic screening, and family genetic screening services. It also offers management, marketing, and property investment services. The company was formerly known as Cordlife Pte Ltd and changed its name to Cordlife Group Limited in 2011. Cordlife Group Limited was founded in 2001 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}