{
    "BKZ.SI": {
        "short_name": "Suntar Eco-City",
        "long_name": "Suntar Eco-City Limited",
        "summary": "Suntar Eco-City Limited, an investment holding company, engages in the eco-tourism and property development activities in the People's Republic of China. It is also involved in the medical research and development activities; sale of healthcare products and nanophase materials; and provision of technical and investment consulting services. The company was formerly known as Reyphon Agriceutical Limited and changed its name to Suntar Eco-City Limited in June 2012. The company was founded in 2006 and is based in Singapore. Suntar Eco-City Limited is a subsidiary of Suntar Investment Pte. Ltd.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "569059",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "HBMK": {
        "short_name": "HUBEI MINKANG PHARMACEUTICAL LT",
        "long_name": "Hubei Minkang Pharmaceutical Ltd.",
        "summary": "Hubei Minkang Pharmaceutical Ltd. is engaged in the research, development, manufacture, and marketing of traditional Chinese medicine (TCM) and chemical pharmaceuticals. The company produces 21 products, which include 5 prescription TCM products, 1 chemical or western-style medicine, and 15 over-the-counter (OTC) products in various product types, including pills, tablets, capsules, granules, oral liquids, syrups, and mixtures and injections in approximately 400 formulations and dosages. Its principal products comprise Yinxing Damo Zhusheye, a chemical medication injectable for the prevention and treatment of coronary heart disease; An Ka Huangmin Jiaonang, a chemical medication that relieves cold and flu symptoms, including fever, headache, sore throat, and sneezing; Xumeian Capsule, a prescription TCM medication used for leucopenia; Wei C Yinqiao Pian, an OTC pill used for relieving cold and flu symptoms, such as body aches, cough, fever, headache, and sore throat; and Shuxin Koufouye, a prescription TCM oral medication for promoting blood circulation and relieving chest pain, shortness of breath, and fatigue associated with coronary heart disease. The company sells its products through distributors in the People's Republic of China, the United States, Japan, Vietnam, Malaysia, Singapore, the Philippines, Hong Kong, Indonesia, and various European countries. Hubei Minkang Pharmaceutical Ltd. was founded in 2003 and is based in Singapore.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "408864",
        "website": "http://www.minkang.com.cn",
        "market_cap": "Micro Cap"
    }
}