{
    "FIHUN.MX": {
        "short_name": "FAIRFAX INDIA HOLDINGS CORPORAT",
        "long_name": "Fairfax India Holdings Corporation",
        "summary": "Fairfax India Holdings Corporation, an investment holding company, engages in the investment activities in India. It invests in public and private equity securities and debt instruments in India and Indian businesses, or other businesses with customers, suppliers, or business primarily conducted in, or dependent on, India. The company was founded in 2014 and is headquartered in Toronto, Canada. Fairfax India Holdings Corporation is a subsidiary of Fairfax Financial Holdings Limited.",
        "currency": "MXN",
        "sector": "Financial",
        "industry": "Asset Management",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "FTN.TO": {
        "short_name": "FINANCIAL 15 SPLIT CORP",
        "long_name": "Financial 15 Split Corp.",
        "summary": "Financial 15 Split Corp. is an close ended equity mutual fund launched by Quadravest Inc. It is managed by Quadravest Capital Management Inc. It invests in the public equity markets of the United States and Canada. The fund primarily invests in stocks of companies operating in the financials sector. Financial 15 Split Corp. was formed on Nov 14, 2003 and is domiciled in the Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "FUND": {
        "short_name": "Sprott Focus Trust, Inc. - Clos",
        "long_name": "Sprott Focus Trust, Inc.",
        "summary": "Sprott Focus Trust, Inc. is a closed-ended equity mutual fund launched and managed by Sprott Asset Management, LP. The fund is co-managed by Sprott Asset Management USA Inc. It invests in the public equity markets of the United States. The fund seeks to invest in stocks of companies operating across diversified sectors. It primarily invests in value stocks of companies across all market capitalizations. The fund benchmarks the performance of its portfolio against the Russell 3000 Index. It was formerly known as Royce Focus Trust, Inc. Sprott Focus Trust, Inc. was formed on March 2, 1988 and is domiciled in the United States.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "GCG-A.TO": {
        "short_name": "GUARDIAN CAPITAL GROUP LTD., CL",
        "long_name": "Guardian Capital Group Limited",
        "summary": "Guardian Capital Group Limited, together with its subsidiaries, operates as a diversified financial services company in Canada, the United Kingdom, the United States, and the Caribbean. The company manages institutional assets for pension plans, insurers, foundations, endowments, third-party mutual funds, and ETFs; and provides private wealth management services to individuals, families, and charitable organizations. It also offers trust and corporate administration, investment management, and banking services for international clients; and an integrated wealth management platform for financial advisors to deliver professional advice on mutual funds, securities, and insurance. In addition, the company engages in the sale of life insurance products, mutual funds, and other securities. Guardian Capital Group Limited was founded in 1962 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "GDV-PA.TO": {
        "short_name": "GLOBAL DIVIDEND GROWTH SPLIT CO",
        "long_name": "Global Dividend Growth Split Corp.",
        "summary": "Global Dividend Growth Split Corp. is an equity mutual fund launched and managed by Brompton Funds Limited. The fund invests in the public equity markets across the globe. It invests in the growth stocks of companies with large-capitalization. Global Dividend Growth Split Corp. was formed on April 24, 2018 and is domiciled in Canada",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "GDVM": {
        "short_name": "GLOBAL DEVELOPMENT INC",
        "long_name": "Global Developments, Inc.",
        "summary": "Global Developments, Inc. is no longer investing. It is a principal investment firm specializing in acquisitions and early stage financing of emerging growth companies. It acquires portfolio companies as a wholly owned subsidiary or as an investment in a minority stake. The firm seeks to be the lead investor with substantial management control. It also helps its portfolio companies grow through mergers and acquisitions before spinning them out through an initial public offering or direct sale. The firm does not confine its investments to any particular industry or geography. Global Developments, Inc. was founded in 2006 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "GFP.V": {
        "short_name": "GREENFIRST FOREST PRODUCTS INC",
        "long_name": "GreenFirst Forest Products Inc.",
        "summary": "GreenFirst Forest Products Inc. focuses on investments in the forest products industry in Canada. It owns a sawmill in Kenora. The company was formerly known as Itasca Capital Ltd. and changed its name to GreenFirst Forest Products Inc. in January 2021. GreenFirst Forest Products Inc. is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "GMN.V": {
        "short_name": "GOBIMIN INC",
        "long_name": "GobiMin Inc.",
        "summary": "GobiMin Inc., together with its subsidiaries, invests in equity, debt, or other securities in China. The company operates through two segments, Investment Business and Mining Business. It is also involved in the development and exploration of gold and mineral properties; and property holding and leasing activities, as well as in the provision of business and consultancy services. The company is based in Montreal, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Montreal"
    },
    "GPK.CN": {
        "short_name": "GrandPeak",
        "long_name": "Grand Peak Capital Corp.",
        "summary": "Grand Peak Capital Corp. is a private equity and venture capital firm specializing in growth capital, management or leveraged buyouts, turnaround situations, and reviewing investment opportunities in undervalued companies. The firm prefers to make investments in publicly traded companies holding assets in the real estate, mining/exploration and technology sectors. It also provides merchant banking, consulting activities, and asset-based commercial lending services include financial and advisory services for corporate finance transactions including mergers, bridge financing, and loan workouts in Canada and the United States. The company was formerly known as Black Mountain Capital Corporation. Grand Peak Capital Corp. was founded in 1952 and is based in Surrey, Canada with an additional office in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Surrey"
    },
    "HBL-UN.TO": {
        "short_name": "BRAND LEADERS INCOME FUND",
        "long_name": "Brand Leaders Income Fund",
        "summary": "Brand Leaders Income Fund is a closed ended equity mutual fund launched by Harvest Portfolios Group Inc. The fund is managed by Highstreet Asset Management Inc. It invests in public equity markets across the globe. The fund invests in stocks of companies operating across diversified sectors. It invests in growth and value stocks of companies with market capitalization greater than US$10 billion. The fund benchmarks the performance of its portfolio against the S&P 100 Index. Brand Leaders Income Fund was formed on June 29, 2011 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "London"
    },
    "HFPC-U.TO": {
        "short_name": "HELIOS FAIRFAX PARTNERS CORPORA",
        "long_name": "Helios Fairfax Partners Corporation",
        "summary": "Helios Fairfax Partners Corporation, an investment holding company, focuses on investing in public and private equity securities and debt instruments of African businesses or other businesses with customers, suppliers, or business primarily conducted in, or dependent on, Africa. The company was formerly known as Fairfax Africa Holdings Corporation and changed its name to Helios Fairfax Partners Corporation in December 2020. Helios Fairfax Partners Corporation was founded in 2016 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "ICLTF": {
        "short_name": "GREENFIRST FOREST PRODUCTS INC",
        "long_name": "GreenFirst Forest Products Inc.",
        "summary": "GreenFirst Forest Products Inc. focuses on investments in the forest products industry in Canada. It owns a sawmill in Kenora. The company was formerly known as Itasca Capital Ltd. and changed its name to GreenFirst Forest Products Inc. in January 2021. GreenFirst Forest Products Inc. is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "IDK.CN": {
        "short_name": "ThreeDCap",
        "long_name": "ThreeD Capital Inc.",
        "summary": "ThreeD Capital Inc., formerly known as Brownstone Energy Inc., is a venture capital firm specializing in seed, early stage and growth capital opportunistic investments. The firm seeks to invest in technology; biotechnology; renewable technology, Nanotechnology, Electric Vehicles,Internet of things, electronic sports, junior resources with an emphasis on the precious-metal and battery-metal sectors; artificial intelligence with a focus on disruptive data science technologies, machine learning, and neuro networks; and blockchain sectors with a focus on blockchain assets. ThreeD Capital Inc. was founded in 1987 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "IDKFF": {
        "short_name": "THREED CAPITAL INC",
        "long_name": "ThreeD Capital Inc.",
        "summary": "ThreeD Capital Inc., formerly known as Brownstone Energy Inc., is a venture capital firm specializing in seed, early stage and growth capital opportunistic investments. The firm seeks to invest in technology; biotechnology; renewable technology, Nanotechnology, Electric Vehicles,Internet of things, electronic sports, junior resources with an emphasis on the precious-metal and battery-metal sectors; artificial intelligence with a focus on disruptive data science technologies, machine learning, and neuro networks; and blockchain sectors with a focus on blockchain assets. ThreeD Capital Inc. was founded in 1987 and is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "IGIFF": {
        "short_name": "IGM FINANCIAL INC",
        "long_name": "IGM Financial Inc.",
        "summary": "IGM Financial Inc. operates as a wealth and asset management company in Canada. It operates through IG Wealth Management, Mackenzie Investments, and Corporate and Other segments. The company also offers financial planning services, including investment, tax, retirement, education, risk management, and estate planning; strategic investment planning tools; mutual funds; iProfile, a portfolio management program; and separately managed accounts and fee-based brokerage accounts. In addition, it provides segregated funds; term, universal life, whole life, disability, critical illness, long-term care, and personal health care coverage and group insurance products; securities services; and residential mortgages. Further, the company offers banking products, such as investment loans, lines of credit, personal loans, creditor insurance, deposit accounts, and credit cards; cash management solutions; private wealth solutions; and investment management, advisory, and related services. It offers its products and services through a network of consultants, as well as retail, strategic alliance, and institutional distribution channels. The company was founded in 1894 and is headquartered in Winnipeg, Canada. IGM Financial Inc. is a subsidiary of Power Financial Corporation.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Winnipeg"
    },
    "IMTA.F": {
        "short_name": "ITASCA CAITAL",
        "long_name": "GreenFirst Forest Products Inc.",
        "summary": "Itasca Capital Ltd. does not have significant operations. Previously, it was engaged in the mineral exploration business. The company was formerly known as Kobex Capital Corp. and changed its name to Itasca Capital Ltd. in June 2016. Itasca Capital Ltd. is based in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "INC-UN.TO": {
        "short_name": "INCOME FIN UN",
        "long_name": "Income Financial Trust",
        "summary": "Income Financial Trust is an open-ended equity mutual fund launched by Quadravest Inc. The fund is managed by Quadravest Capital Management Inc. It invests in the public equity markets of North America. The fund seeks to invest in stocks of companies operating in the financial services sector. It invests in stocks of companies that are included in the Toronto Stock Exchange Financial Services Index, the Standard & Poor's Financials Index or the Standard & Poor's MidCap Financials Index. Income Financial Trust was formed on January 27, 1999 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "L01.F": {
        "short_name": "LANEBURY GROWTH CAP.",
        "long_name": "Lanebury Growth Capital Ltd.",
        "summary": "Lanebury Growth Capital Ltd. operates as an investment company. It focuses on building a portfolio of investments in technology start-ups. The company was formerly known as NU2U Resources Corp. and changed its name to Lanebury Growth Capital Ltd. in April 2017. Lanebury Growth Capital Ltd. was incorporated in 2011 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "LBI.V": {
        "short_name": "LIONS BAY CAPITAL INC",
        "long_name": "Lions Bay Capital Inc.",
        "summary": "Lions Bay Capital Inc., an investment holding company, focuses on acquiring strategic stakes in companies operating in the resource, energy, and resource related technology sectors. The company is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "LBS.TO": {
        "short_name": "LIFE & BANC SPLIT CORP.",
        "long_name": "Life & Banc Split Corp.",
        "summary": "Life & Banc Split Corp. is a closed-ended equity mutual fund launched and managed by Brompton Funds Limited. The fund invests in the public equity markets of Canada. It seeks to invest in stocks of companies operating across banking and life insurance sector. The fund primarily invests in the stocks of the six largest banks of the country, as well as of life insurance companies, utilizing a split share structure on a low cost basis. It benchmarks the performance of its portfolio against the S&P/TSX Capped Financials Index and S&P/TSX Composite Index. Life & Banc Split Corp. was formed on September 6, 2006 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "LCS.TO": {
        "short_name": "BROMPTON LIFECO SPLIT CORP, CLA",
        "long_name": "Brompton Lifeco Split Corp.",
        "summary": "Brompton Lifeco Split Corp. is a close-ended equity mutual fund launched and managed by Brompton Funds Limited. The fund invests in the public equity markets of Canada. It invests in companies primarily engaged in the life insurance sector. The fund benchmarks the performance of its portfolio against the S&P/TSX Capped Financials Index and S&P/TSX Composite Index. Brompton Lifeco Split Corp. was formed on January 19, 2007 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "LFE-PB.TO": {
        "short_name": "CANADIAN LIFE SPLIT 2012 PREF S",
        "long_name": "Canadian Life Companies Split Corp.",
        "summary": "Canadian Life Companies Split Corp. is a closed-ended equity mutual fund launched and managed by Quadravest Capital Management Inc. It invests in the public equity markets of Canada. The fund seeks to invest in stocks of companies operating in the life insurance sector. It primarily invests in stocks of four publicly traded life insurance companies namely Great-West Lifeco Inc., Industrial Alliance Insurance and Financial Services Inc., Manulife Financial Corporation, and Sun Life Financial Inc. The fund employs fundamental analysis with a focus on such factors as a firm's earning history, relative price-earnings multiple, cash flow, dividend yield, market position, and growth prospects to create its portfolio. It benchmarks the performance of its portfolio against the S&P TSX Financial Index. Canadian Life Companies Split Corp. was formed on April 18, 2005 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "LITT.V": {
        "short_name": "ROADMAN INVESTMENTS CORP",
        "long_name": "Roadman Investments Corp.",
        "summary": "Roadman Investments Corp. is a venture capital, private equity and advisory firm specializing in incubation, seed, start-ups, later stage, strategic advisory, global partnership development, breakthrough products, devices, treatments, health supplement, corporate restructuring, Corporate recapitalization and growth capital investments. It focuses on managing and facilitating foreign investment and investing in private and public companies whose businesses involve later-stage. The firm prefers to invest in health & wellness, agricultural, medicinal mushroom, media, retail, financial services, pharmaceutical products, nutrition, medicine, technology, healthcare, clean tech, energy, consumer product, and consumer services and identify an exit strategy in China or North America. The firm invests into companies across the Pan-Pacific region. It prefers to take majority stake in its portfolio companies. Roadman Investments Corp. is previously known as Urban Select Capital Corporation and formerly known as China Select Capital Partners Corp, was incorporated in September 12, 2007 and is based in Vancouver, Canada with an additional office in Beijing, China, Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "LLL.CN": {
        "short_name": "LaneburyGrowCap",
        "long_name": "Lanebury Growth Capital Ltd.",
        "summary": "Lanebury Growth Capital Ltd. operates as an investment company. It focuses on building a portfolio of investments in technology start-ups. The company was formerly known as NU2U Resources Corp. and changed its name to Lanebury Growth Capital Ltd. in April 2017. Lanebury Growth Capital Ltd. was incorporated in 2011 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "LPC.V": {
        "short_name": "LORNE PARK CAPITAL PARTNERS INC",
        "long_name": "Lorne Park Capital Partners Inc.",
        "summary": "Lorne Park Capital Partners Inc., through with its subsidiaries, provides portfolio management services in Canada. It serves investors, estates, trusts, endowments, foundations, individuals, and institutional clients. The company was founded in 2013 and is based in Oakville, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Oakville"
    },
    "M.V": {
        "short_name": "MOSAIC CAPITAL CORPORATION",
        "long_name": "Mosaic Capital Corporation",
        "summary": "Mosaic Capital Corporation is a private equity firm specializing in acquisitions, growth capital, mature, buyouts, and middle market investments. It prefers to invest in consumer discretionary, consumer staples, energy, financials, healthcare, industrials, information technology, materials, telecommunication services, utilities sectors and infrastructure, distribution, construction, business services, oil and gas services, manufacturing and real estate industries. The firm seeks to invest in all sectors in Canada. It seeks to invest in companies with an annual cash flow of between $3 million and $15 million, revenues between $5 million and $50 million, and EBIDTA $2 million and $10 million. It seeks to make long term investments and also take majority stakes in its portfolio companies. Mosaic Capital Corporation was founded in May 2011 and is based in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "MBN.TO": {
        "short_name": "MBN CORPORATION",
        "long_name": "MBN Corporation",
        "summary": "MBN Corporation is a closed-ended equity mutual fund launched by Middlefield Fund Management Limited. The fund is managed by Middlefield Capital Corporation and Groppe, Long & Littell. It invests in the public equity markets of Canada. The fund invests in stocks of companies operating across energy related sectors with a focus on oil sands sector. It benchmarks the performance of its portfolio against the S&P/TSX Composite Index. The fund was formerly known as OilSands Canada Corporation. It was formerly known as Middlefield Tactical Energy Corporation. MBN Corporation was formed on June 1, 2007 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "MEDI.CN": {
        "short_name": "MyconicCap",
        "long_name": "Myconic Capital Corp.",
        "summary": "Myconic Capital Corp. intends to identify, evaluate, and acquire assets, properties or businesses with a view to completing a qualifying transaction. The company was formerly known as Auralite Investments Inc. and changed its name to Myconic Capital Corp. in July 2020. Myconic Capital Corp. was founded in 2017 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "MEDV.NE": {
        "short_name": "MEDIVOLVE INC.",
        "long_name": "Medivolve Inc.",
        "summary": "QuestCap Inc. is a principal investment firm. It is a social-impact investment focused company Investing resources, funds and bandwidth for the betterment of the human condition through medical sciences, climate change and technology. The firm was formerly known as Continent Resources Inc. and changed its name to Copper One Inc. in October 2009. Copper One Inc. was incorporated in 2005 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NEO",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "MGHCF": {
        "short_name": "MINCO CAPITAL CORP",
        "long_name": "Minco Capital Corp.",
        "summary": "Minco Capital Corp. operates as an investment company. It invests in public and private companies and assets. The company was formerly known as Minco Gold Corporation and changed its name to Minco Capital Corp. in February 2019. Minco Capital Corp. was founded in 1982 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "MID-UN.TO": {
        "short_name": "MINT INCOME FUND",
        "long_name": "MINT Income Fund",
        "summary": "MINT Income Fund is a closed ended equity mutual fund launched by Middlefield Limited. It is co-managed by Middlefield Capital Corporation, Guardian Capital LP, and Groppe, Long & Littell. The fund invests in public equity markets across the globe. It seeks to invest in stocks of companies operating across diversified sectors. The fund primarily invests in dividend paying stocks of companies. It seeks to benchmarks the performance of its portfolio against the S&P/TSX Composite Index. MINT Income Fund was formed on February 28, 1997 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "MKZ-UN.TO": {
        "short_name": "MACKENZIE MSTR UN",
        "long_name": "Mackenzie Master Limited Partnership",
        "summary": "Mackenzie Master Limited Partnership pays selling commissions to financial advisors who sell redemption charge securities of Mackenzie mutual funds for specific periods. MMLP GP Inc. serves as the general partner of Mackenzie Master Limited Partnership. Mackenzie Master Limited Partnership was founded in 1995 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "MMM.V": {
        "short_name": "MINCO CAPITAL CORP",
        "long_name": "Minco Capital Corp.",
        "summary": "Minco Capital Corp. operates as an investment company. It invests in public and private companies and assets. The company was formerly known as Minco Gold Corporation and changed its name to Minco Capital Corp. in February 2019. Minco Capital Corp. was founded in 1982 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "MMP-UN.TO": {
        "short_name": "PRECIOUS METALS AND MINING TRUS",
        "long_name": "Precious Metals and Mining Trust",
        "summary": "Precious Metals and Mining Trust is a closed ended equity fund launched and managed CI Investments Inc. The fund invests in public equity markets of Canada. It invests in stocks of companies in Metals and Mining sector. The fund invests in value stocks of small capitalization companies. The fund employs fundamental analysis with top-down and bottom-up stock picking approach focusing on factors like use of computer based research incorporating and rating a number of factors including profitability, liquidity, operating and administrative costs, cash flow and management. Precious Metals and Mining Trust was formed on May 29, 2006 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "MNX.V": {
        "short_name": "MANITEX CAPITAL INC.",
        "long_name": "Manitex Capital Inc.",
        "summary": "Manitex Capital Inc. does not have significant business. It focuses on acquiring interests in life sciences, cleantech, and sustainable products/technologies companies. Previously, it was engaged in the acquisition and markets specialty pharmaceutical products, and distributes third-party pharmaceutical products, as well as holds a portfolio in marketable securities. The company is headquartered in Kirkland, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Kirkland"
    },
    "NFD-A.V": {
        "short_name": "NORTHFIELD CAPITAL CORP., CL.A,",
        "long_name": "Northfield Capital Corporation",
        "summary": "Northfield Capital Corporation serves as an investment company that invests in companies operating in the glass, manufacturing, oil and gas, mining, and technology industries. Its subsidiaries manufacture insulating glass sealed units, aluminum, and indoor air filtration and purification units. The group also owns several holdings for exploration of oil and gas in major oil and gas producing regions in the United States and Canada. In addition, it involves in exploration for precious metals in Canada and Guyana. In the technology industry, Northfield Capital has investment in an applied research and technology company that develops and markets products for the global marine transportation community. It also holds interest in a company that provides educational software and distance learning solutions in the People's Republic of China. The company was formed and incorporated in 1981 under the name Puissance Resources Limited. It changed its name to Puissance Corporation in 1983 and to Northfield Capital Corporation in 1987. Northfield Capital is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "OLY.TO": {
        "short_name": "OLYMPIA FINANCIAL GROUP INC",
        "long_name": "Olympia Financial Group Inc.",
        "summary": "Olympia Financial Group Inc., through its subsidiary Olympia Trust Company, operates as a non-deposit taking trust corporation in Canada. The company operates through Private Health Services Plan, Registered Plans, Foreign Exchange, Corporate and Shareholder Services, and Exempt Edge divisions. The Private Health Services Plan division markets, sells, and administers health and dental benefits to business owners. The Registered Plans division administers self-directed registered plans. The Foreign Exchange division provides personalized services, such as buying and selling foreign currencies for corporations and private clients. The Corporate and Shareholder Services division provides transfer agency and corporate trust services to public and private issuers. The Exempt Edge division focuses on the provision of information technology services to exempt market dealers, registrants, and issuers. Olympia Financial Group Inc. was incorporated in 1994 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "ONE.F": {
        "short_name": "ONEX CORP. (SUB. VTG)",
        "long_name": "Onex Corporation",
        "summary": "Onex Corporation is a private equity firm specializing in acquisitions and platform acquisitions. The firm makes investments in buyouts, large- middle market, large-cap, mid-cap, and small-cap market and distressed companies. It also invests in recapitalization, growth capital, corporate carve-outs of subsidiaries and mission-critical supply divisions from multinational corporations, operational restructurings of undervalued businesses, and builds up. The firm seeks to invest in technology, electronics manufacturing services, industrial, aerospace, healthcare, retail, restaurants, industrials products, customer care services, metal services, building products, entertainment, gaming, cabinetry products, commercial vehicles, commercial and investment banking, financial services, commercial and multi-unit residential real estate. It invests in global businesses headquartered in North America, including United States and Canada, or Europe. The firm seeks to invest between $125 million and $1 billion in companies that have minimum revenues of $300 million. It does not consider size if the company is in an industry in which the firm already has presence. The firm seeks to make direct as well as co-investments through managed private equity, real estate and credit funds. It seeks to acquire a control position in its portfolio companies. Onex Corporation was founded in 1984 and is based in Toronto, Canada with additional offices in New York, New York; Englewood Cliffs, New Jersey; and London, United Kingdom.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "ONEX.TO": {
        "short_name": "ONEX CORPORATION",
        "long_name": "Onex Corporation",
        "summary": "Onex Corporation is a private equity firm specializing in acquisitions and platform acquisitions. The firm makes investments in buyouts, large- middle market, large-cap, mid-cap, and small-cap market and distressed companies. It also invests in recapitalization, growth capital, corporate carve-outs of subsidiaries and mission-critical supply divisions from multinational corporations, operational restructurings of undervalued businesses, and builds up. The firm seeks to invest in technology, electronics manufacturing services, industrial, aerospace, healthcare, retail, restaurants, industrials products, customer care services, metal services, building products, entertainment, gaming, cabinetry products, commercial vehicles, commercial and investment banking, financial services, commercial and multi-unit residential real estate. It invests in global businesses headquartered in North America, including United States and Canada, or Europe. The firm seeks to invest between $125 million and $1 billion in companies that have minimum revenues of $300 million. It does not consider size if the company is in an industry in which the firm already has presence. The firm seeks to make direct as well as co-investments through managed private equity, real estate and credit funds. It seeks to acquire a control position in its portfolio companies. Onex Corporation was founded in 1984 and is based in Toronto, Canada with additional offices in New York, New York; Englewood Cliffs, New Jersey; and London, United Kingdom.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "ONEXF": {
        "short_name": "ONEX CORP",
        "long_name": "Onex Corporation",
        "summary": "Onex Corporation is a private equity firm specializing in acquisitions and platform acquisitions. The firm makes investments in buyouts, large- middle market, large-cap, mid-cap, and small-cap market and distressed companies. It also invests in recapitalization, growth capital, corporate carve-outs of subsidiaries and mission-critical supply divisions from multinational corporations, operational restructurings of undervalued businesses, and builds up. The firm seeks to invest in technology, electronics manufacturing services, industrial, aerospace, healthcare, retail, restaurants, industrials products, customer care services, metal services, building products, entertainment, gaming, cabinetry products, commercial vehicles, commercial and investment banking, financial services, commercial and multi-unit residential real estate. It invests in global businesses headquartered in North America, including United States and Canada, or Europe. The firm seeks to invest between $125 million and $1 billion in companies that have minimum revenues of $300 million. It does not consider size if the company is in an industry in which the firm already has presence. The firm seeks to make direct as well as co-investments through managed private equity, real estate and credit funds. It seeks to acquire a control position in its portfolio companies. Onex Corporation was founded in 1984 and is based in Toronto, Canada with additional offices in New York, New York; Englewood Cliffs, New Jersey; and London, United Kingdom.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "OSP-PA.TO": {
        "short_name": "BROMPTON OIL SPLIT CORP PREFERR",
        "long_name": "Brompton Oil Split Corp.",
        "summary": "Brompton Oil Split Corp. is a closed-ended equity mutual fund launched and managed by Brompton Funds Limited. The fund invests in public equity markets of North America. It primarily invests in dividend paying stocks of large-cap companies having market capitalization of at least $2 billion. The fund invests in stocks of companies which are a constituent of the S&P 500 Index and S&P/TSX Composite Index. It invests in stocks of companies operating in the oil and gas sectors. Brompton Oil Split Corp. was formed on February 24, 2015 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "OSP.TO": {
        "short_name": "BROMPTON OIL SPLIT CORP",
        "long_name": "Brompton Oil Split Corp.",
        "summary": "Brompton Oil Split Corp. is a closed-ended equity mutual fund launched and managed by Brompton Funds Limited. The fund invests in public equity markets of North America. It primarily invests in dividend paying stocks of large-cap companies having market capitalization of at least $2 billion. The fund invests in stocks of companies which are a constituent of the S&P 500 Index and S&P/TSX Composite Index. It invests in stocks of companies operating in the oil and gas sectors. Brompton Oil Split Corp. was formed on February 24, 2015 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "PBY-UN.TO": {
        "short_name": "CANSO CREDIT INCOME FUND UNITS",
        "long_name": "Canso Credit Trust - Canso Credit Income Fund",
        "summary": "Canso Credit Trust - Canso Credit Income Fund is a closed ended fixed income mutual fund launched by Lysander Funds Limited. The fund is managed by Canso Investment Counsel Ltd. It invests in the fixed income markets of Canada. The fund primarily invests in corporate bonds. It employs fundamental analysis with bottom-up and deep value approach to create its portfolio. The fund benchmarks the performance of its portfolio against the DEX Universe Corporate Bond Index. Canso Credit Trust - Canso Credit Income Fund was formed on July 16, 2010 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Richmond Hill"
    },
    "PDV.TO": {
        "short_name": "PRIME DIVIDEND CORP. CL A",
        "long_name": "Prime Dividend Corp.",
        "summary": "Prime Dividend Corp. is an open ended equity mutual fund launched by Quadravest Inc. The fund is managed by Quadravest Capital Management Inc. It invests in public equity markets of Canada. The fund invests in stocks of companies across diversified sectors. Prime Dividend Corp. was formed on November 16, 2005 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "PIC-A.TO": {
        "short_name": "PREMIUM INCOME A",
        "long_name": "Premium Income Corporation",
        "summary": "Premium Income Corporation is an equity mutual fund launched and managed by Strathbridge Asset Management Inc. It invests in the public equity markets of Canada. It invests in stocks of companies operating primarily in the banking sector. The fund uses financial derivatives such as call and put options to invest in stocks of Bank of Montreal, Bank of Nova Scotia, Canadian Imperial Bank of Commerce, Royal Bank of Canada, and Toronto Dominion Bank. It seeks to invest in stocks of dividend paying companies. The fund benchmarks the performance of its portfolio against the S&P/TSX Diversified Banks Total Return Index. Premium Income Corporation was formed on August 27, 1996 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "PNXPF": {
        "short_name": "PLANET VENTURES INC",
        "long_name": "Planet Ventures Inc.",
        "summary": "Planet Ventures Inc. a venture capital firm specializing in early stage investments. The firm focuses on holding investments in the resource, biotechnology, and technology companies. The firm seeks to invest in disruptive and emerging growth companies and industries with focus on technology, blockchain, crypto-currencies, fantasy and sports betting markets. The company also focuses on investing in undervalued resource projects and companies in the precious metals, uranium and coal, oil and gas, base metals, potash, lithium, and rare earths sectors. The firm makes investment in both public or private companies in form of equity or debt respectively. The firm typically takes an active management role as part of its investment strategy by participating at the Board/Advisory levels. The company was formerly known as Planet Exploration Inc. and changed its name to Planet Mining Exploration Inc. in April 2012. Planet Ventures Inc. was founded in 1996 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "PPK.V": {
        "short_name": "PROSPECT PARK CAPITAL CORP",
        "long_name": "Prospect Park Capital Corp.",
        "summary": "Prospect Park Capital Corp., an investment company, focuses on public healthcare sector in Canada. The company was incorporated in 2012 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "PRM-PA.TO": {
        "short_name": "BIG PHARMA SPLIT CORP PREF SHAR",
        "long_name": "Big Pharma Split Corp.",
        "summary": "Big Pharma Split Corp is a closed ended equity mutual fund launched and managed by Harvest Portfolios Group Inc. It invests in the public equity markets across United States. The fund primarily invests in the Pharmaceutical sector. Big Pharma Split Corp was formed on September 15, 2017 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Oakville"
    },
    "PVF-UN.V": {
        "short_name": "PARTNERS VALUE INVESTMENTS  LP",
        "long_name": "Partners Value Investments LP",
        "summary": "Partners Value Investments LP operates as an investment holding company that engages in the securities and financing transactions in Toronto, Canada. The firm invests on a value basis in companies that can demonstrate an ability to produce consistent and durable cash flows and profits, in markets that are growing. It has a leveraged investment in Brascan Corporation. The company's operations are managed by Brascan Financial Corporation, a subsidiary of Brascan Corporation. It was formerly known as Partners Value Investments Inc. Partners Value Investments LP has its corporate office in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "PVS-PD.TO": {
        "short_name": "PARTNERS VALUE SPLIT CORP PREF ",
        "long_name": "Partners Value Split Corp.",
        "summary": "Partners Value Split Corp is a private fund launched and managed by Brookfield Investment Management (Canada) Inc. The investment portfolio comprises of Class A Limited voting shares of Brookfield Asset Management Inc. It was formerly known as BAM Split Corp. Partners Value Split Corp is based in Toronto, Ontario.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "PVS-PE.TO": {
        "short_name": "PARTNERS VALUE SPLIT CORP PREF ",
        "long_name": "Partners Value Split Corp.",
        "summary": "Partners Value Split Corp is a private fund launched and managed by Brookfield Investment Management (Canada) Inc. The investment portfolio comprises of Class A Limited voting shares of Brookfield Asset Management Inc. It was formerly known as BAM Split Corp. Partners Value Split Corp is based in Toronto, Ontario.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "PVS-PG.TO": {
        "short_name": "PARTNERS VALUE SPLIT CORP PREF ",
        "long_name": "Partners Value Split Corp.",
        "summary": "Partners Value Split Corp is a private fund launched and managed by Brookfield Investment Management (Canada) Inc. The investment portfolio comprises of Class A Limited voting shares of Brookfield Asset Management Inc. It was formerly known as BAM Split Corp. Partners Value Split Corp is based in Toronto, Ontario.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "PVS-PH.TO": {
        "short_name": "PARTNERS VALUE SPLIT CORP PREF ",
        "long_name": "Partners Value Split Corp.",
        "summary": "Partners Value Split Corp is a private fund launched and managed by Brookfield Investment Management (Canada) Inc. The investment portfolio comprises of Class A Limited voting shares of Brookfield Asset Management Inc. It was formerly known as BAM Split Corp. Partners Value Split Corp is based in Toronto, Ontario.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "PVS-PI.TO": {
        "short_name": "PARTNERS VALUE SPLIT CORP PREF ",
        "long_name": "Partners Value Split Corp.",
        "summary": "Partners Value Split Corp is a private fund launched and managed by Brookfield Investment Management (Canada) Inc. The investment portfolio comprises of Class A Limited voting shares of Brookfield Asset Management Inc. It was formerly known as BAM Split Corp. Partners Value Split Corp is based in Toronto, Ontario.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "PXI.V": {
        "short_name": "PLANET VENTURES INC",
        "long_name": "Planet Ventures Inc.",
        "summary": "Planet Ventures Inc. a venture capital firm specializing in early stage investments. The firm focuses on holding investments in the resource, biotechnology, and technology companies. The firm seeks to invest in disruptive and emerging growth companies and industries with focus on technology, blockchain, crypto-currencies, fantasy and sports betting markets. The company also focuses on investing in undervalued resource projects and companies in the precious metals, uranium and coal, oil and gas, base metals, potash, lithium, and rare earths sectors. The firm makes investment in both public or private companies in form of equity or debt respectively. The firm typically takes an active management role as part of its investment strategy by participating at the Board/Advisory levels. The company was formerly known as Planet Exploration Inc. and changed its name to Planet Mining Exploration Inc. in April 2012. Planet Ventures Inc. was founded in 1996 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "QCA.CN": {
        "short_name": "QuinsamCap",
        "long_name": "Quinsam Capital Corporation",
        "summary": "Quinsam Capital Corporation operates as an investment and merchant banking firm in small-cap market in Canada. It primarily focuses on cannabis-related investments. The company's activities include acquisitions, advisory services, lending activities, and portfolio investments. Quinsam Capital Corporation was incorporated in 2004 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "QLDN.F": {
        "short_name": "ELYSEE DEVELOPMENT",
        "long_name": "Elysee Development Corp.",
        "summary": "Elysee Development Corp. operates as an investment and venture capital firm that makes growth capital investments. The firm makes investments, with a focus on the natural resource sector. Its investment portfolio consists of equity investments in small and medium sized public companies, with a focus on precious and specialty metals; and investments in convertible debentures of mining companies. The company was formerly known as Alberta Star Development Corp. and changed its name to Elysee Development Corp. in July 2015. Elysee Development Corp. was incorporated in 1996 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "RBN-UN.TO": {
        "short_name": "BLUE RIBBON INCOME FUND",
        "long_name": "Blue Ribbon Income Fund",
        "summary": "Blue Ribbon Income Fund is a closed-ended equity mutual fund launched and managed by Bloom Investment Counsel, Inc. The fund invests in public equity markets of Canada. It benchmarks the performance of its portfolio against the S&P/TSX Income Trust Index. The fund was formerly known as the Citadel Diversified Investment Trust. Blue Ribbon Income Fund was formed on September 16, 1997 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "REO.CN": {
        "short_name": "ReservoirCap",
        "long_name": "Reservoir Capital Corp.",
        "summary": "Reservoir Capital Corp. is a principal investment firm. The firm is focused on renewable energy and concentrates on operational power projects located in emerging markets. It prefers to hold a minority stake in its investments. Reservoir Capital Corp. was incorporated in 2006 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "RII-K.V": {
        "short_name": "RICHCO INVESTORS INC SV",
        "long_name": "Richco Investors Inc.",
        "summary": "Richco Investors Inc. provides financial, management, and other administrative services to early development stage businesses. The company offers strategic planning, capital infusion, and corporate restructuring services. Richco Investors Inc. is based in North Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "North Vancouver"
    },
    "RKS.CN": {
        "short_name": "RockshieldCap",
        "long_name": "Rockshield Capital Corp.",
        "summary": "Rockshield Capital Corp. is a venture capital firm specializing in early-stage, seed and emerging growth investments. The firm seeks to invest at various stages of development, including pre-initial public offering, and/or early stage companies requiring start-up or development capital. The firm seeks to invest in marketable securities comprising common shares and other equity instruments of companies in the mining, oil and gas, media technology, and medical technology industries that are listed on various Canadian stock exchanges or the OTCBB in the United States. It considers to invest over a number of sectors, including but not limited to: cannabis, fintech, healthcare, the resource sector, information and communications technology, and energy & clean technology. The firm seeks to invest between $0.25 million to $2 million. The firm is also involved in assisting financing, identifying acquisition targets, developing strategic plans, supporting operations, and implementing exit strategies. The firm also works with co-investors. It typically invests in Canada and the United States. Rockshield Capital Corp. was founded in 2007 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "RKSCF": {
        "short_name": "ROCKSHIELD CAPITAL CORP",
        "long_name": "Rockshield Capital Corp.",
        "summary": "Rockshield Capital Corp. is a venture capital firm specializing in early-stage, seed and emerging growth investments. The firm seeks to invest at various stages of development, including pre-initial public offering, and/or early stage companies requiring start-up or development capital. The firm seeks to invest in marketable securities comprising common shares and other equity instruments of companies in the mining, oil and gas, media technology, and medical technology industries that are listed on various Canadian stock exchanges or the OTCBB in the United States. It considers to invest over a number of sectors, including but not limited to: cannabis, fintech, healthcare, the resource sector, information and communications technology, and energy & clean technology. The firm seeks to invest between $0.25 million to $2 million. The firm is also involved in assisting financing, identifying acquisition targets, developing strategic plans, supporting operations, and implementing exit strategies. The firm also works with co-investors. It typically invests in Canada and the United States. Rockshield Capital Corp. was founded in 2007 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "RS-PA.TO": {
        "short_name": "REAL ESTATE AND ECOMM SPLIT COR",
        "long_name": "Real Estate & E-Comm Split Corp.",
        "summary": "Real Estate & E-Commerce Split Corp. is a balanced mutual fund launched by Middlefield Limited. The fund is managed by Middlefield Capital Corporation. Real Estate & E-Commerce Split Corp. Real Estate & E-Commerce Split Corp. was formed on October 7, 2020 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "SBC.TO": {
        "short_name": "BROMPTON SPLIT BANC CORP., CL A",
        "long_name": "Brompton Split Banc Corp.",
        "summary": "Brompton Split Banc Corp. is a close-ended equity mutual fund launched and managed by Brompton Funds Limited. The fund invests in the public equity markets of Canada. It seeks to invest in stocks of companies primarily engaged in the banking sector. The fund benchmarks the performance of its portfolio against the S&P/TSX Capped Financials Index. Brompton Split Banc Corp. was formed on September 14, 2005 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "SBN.TO": {
        "short_name": "S SPLIT CORP., CL.A",
        "long_name": "Mulvihill S Split Corp.",
        "summary": "Mulvihill S Split Corp. is a closed ended equity mutual fund launched by Mulvihill Fund Services Inc. The fund is managed by Mulvihill Capital Management Inc. It invests in the public equity markets of Canada. The fund also invests some portion of its portfolio in derivative instruments. It invests in the stocks companies operating in financial sector. It invests in the stocks of The Bank of Nova Scotia. Mulvihill S Split Corp. was formed on January 26, 2007 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "SEC.TO": {
        "short_name": "SENVEST CAPITAL",
        "long_name": "Senvest Capital Inc.",
        "summary": "Senvest Capital Inc., through its subsidiaries, holds investments in equity and real estate holdings primarily in the United States. It invests in derivative financial instruments consisting primarily of options and warrants to purchase or sell equities, equity indices and currencies, equity swaps, foreign currency forward contracts, and foreign currency futures contracts. The company also has investments as minority interests in private entities whose main assets are real estate properties; and real estate income trusts and partnerships. It also operates in Canada, European Union, Argentina, and internationally. The company was formerly known as Sensormatic Canada Limited and changed its name to Senvest Capital Inc. in April 1991. Senvest Capital Inc. was incorporated in 1968 and is headquartered in Montreal, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Montreal"
    },
    "SII": {
        "short_name": "Sprott Inc.",
        "long_name": "Sprott Inc.",
        "summary": "Sprott Inc. is a publicly owned asset management holding company. Through its subsidiaries, the firm provides asset management, portfolio management, wealth management, fund management, and administrative and consulting services to its clients. It offers mutual funds, hedge funds, and offshore funds, along with managed accounts. Further, the firm also provides broker-dealer activities. Sprott Inc. was formed on February 13, 2008 and is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "SII.TO": {
        "short_name": "SPROTT INC.",
        "long_name": "Sprott Inc.",
        "summary": "Sprott Inc. is a publicly owned asset management holding company. Through its subsidiaries, the firm provides asset management, portfolio management, wealth management, fund management, and administrative and consulting services to its clients. It offers mutual funds, hedge funds, and offshore funds, along with managed accounts. Further, the firm also provides broker-dealer activities. Sprott Inc. was formed on February 13, 2008 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "SQG.V": {
        "short_name": "SPACKMAN EQUITIES GROUP INC",
        "long_name": "Spackman Equities Group Inc.",
        "summary": "Spackman Equities Group Inc., an investment holding company, invests into and develops in small/medium-sized growth companies in Asia. The company also engages in development, production, presentation, financing, and distribution of theatrical motion pictures and television dramas. In addition, it is involved in movie/drama equipment leasing business, event and branded content production, and talent management business. Further, the company invests in drama and movies; and provides consulting services for the production of Korean content. Additionally, it operates a cafÃ© lounge under the Upper West name in Gangnam district, Seoul; and owns a professional photography studio. The company was formerly known as Centiva Capital Inc. and changed its name to Spackman Equities Group Inc. in October 2011. Spackman Equities Group Inc. was founded in 2006 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "SVCTF": {
        "short_name": "SENVEST CAPITAL INC",
        "long_name": "Senvest Capital Inc.",
        "summary": "Senvest Capital Inc., through its subsidiaries, holds investments in equity and real estate holdings primarily in the United States. It invests in derivative financial instruments consisting primarily of options and warrants to purchase or sell equities, equity indices and currencies, equity swaps, foreign currency forward contracts, and foreign currency futures contracts. The company also has investments as minority interests in private entities whose main assets are real estate properties; and real estate income trusts and partnerships. It also operates in Canada, European Union, Argentina, and internationally. The company was formerly known as Sensormatic Canada Limited and changed its name to Senvest Capital Inc. in April 1991. Senvest Capital Inc. was incorporated in 1968 and is headquartered in Montreal, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Montreal"
    },
    "TCA.V": {
        "short_name": "TIMIA CAPITAL CORP",
        "long_name": "TIMIA Capital Corp.",
        "summary": "TIMIA Capital Corp., a specialty finance company, focuses on providing financing to technology companies in North America. The company provides financing in exchange for variable monthly payments structured as a percentage of applicable revenue, subject to minimum monthly payments; and a fixed schedule of predetermined monthly payments. It also offers revenue financing products and services, as well as manages a portfolio of equity investments. The company was formerly known as GreenAngel Energy Corp. and changed its name to TIMIA Capital Corp. in September 2015. TIMIA Capital Corp. was incorporated in 2007 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "TCC.CN": {
        "short_name": "Trenchant Cap",
        "long_name": "Trenchant Capital Corp.",
        "summary": "Trenchant Capital Corp. is a private equity and venture capital firm specializing in special situation debt financing in private equity companies. The firm seeks to invest in Canada. The company was formerly known as Echelon Petroleum Corp. and changed its name to Trenchant Capital Corp. in May 2017. Trenchant Capital Corp. was incorporated in 2009 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "TIMCF": {
        "short_name": "TIMIA CAPITAL CORP",
        "long_name": "TIMIA Capital Corp.",
        "summary": "TIMIA Capital Corp., a specialty finance company, focuses on providing financing to technology companies in North America. The company provides financing in exchange for variable monthly payments structured as a percentage of applicable revenue, subject to minimum monthly payments; and a fixed schedule of predetermined monthly payments. It also offers revenue financing products and services, as well as manages a portfolio of equity investments. The company was formerly known as GreenAngel Energy Corp. and changed its name to TIMIA Capital Corp. in September 2015. TIMIA Capital Corp. was incorporated in 2007 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "TLP-UN.CN": {
        "short_name": "TierOne Cap",
        "long_name": "Tier One Capital Limited Partnership",
        "summary": "Tier One Capital Limited Partnership is headquartered in Toronto, Ontario, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "TORR.V": {
        "short_name": "TORRENT CAPITAL LTD",
        "long_name": "Torrent Capital Ltd.",
        "summary": "Torrent Capital Ltd. focuses on investments in private and public company securities. It also provides merchant banking services to small scale companies, as well as advisory services for corporate finance and capital markets. The company was formerly known as Metallum Resources Inc. and changed its name to Torrent Capital Ltd. in February 2017. Torrent Capital Ltd. is based in Halifax, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Halifax"
    },
    "TRGCF": {
        "short_name": "TARGET CAPITAL INC",
        "long_name": "Target Capital Inc.",
        "summary": "Target Capital Inc. is a private equity and venture capital firm specializing in acquisitions, startups, early stage and buyout companies. It owns interests in future commissions on claims processed through the Olympia Trust Health Plan. It invests in listed public companies, trailer fee rights, notes receivable, reporting issuers, and controlled private companies. The firm also invests in land development corporations. It seeks to invest in medical and recreational cannabis industry, and in businesses offering from cultivators to ancillary supportive products and services. It prefers to invest in Canada, Europe and United States. It prefers to invest in companies that generate 10x ROI Within 3 Years. It prefers to take majority stake. It prefers to exit through acquisition. Target Capital Inc. was incorporated in 1993 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "TXT-UN.TO": {
        "short_name": "TOP 10 SPLIT TRUST",
        "long_name": "Top 10 Split Trust",
        "summary": "Top 10 Split Trust is an equity mutual fund launched and managed by Strathbridge Asset Management Inc. It invests in public equity markets of Canada. The fund invests in the stocks of companies operating across the financial sector. It uses SSO covered call writing strategy to invest in the securities of 6 banks namely, Bank of Montreal, the Bank of Nova Scotia, Canadian Imperial Bank of Commerce, National Bank of Canada, Royal Bank of Canada, the Toronto-Dominion Bank and 4 insurance companies namely, Great-West Lifeco Inc., Industrial Alliance Insurance and Financial Services Inc., Manulife Financial Corporation, Sun Life Financial Inc. The fund seeks to benchmark the performance of its portfolio against the S&P/TSX Composite Index. The fund was formerly known as First Premium U.S. Income Trust. Top 10 Split Trust was formed on January 22, 1997 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "TZS.TO": {
        "short_name": "TREZ CAPITAL SENIOR MORTGAGE IN",
        "long_name": "Trez Capital Senior Mortgage Investment Corporation",
        "summary": "Trez Capital Senior Mortgage Investment Corporation is a fund of Trez Capital Limited Partnership.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "UBAAF": {
        "short_name": "URBANA CORP",
        "long_name": "Urbana Corporation",
        "summary": "Urbana Corporation is an investment fund launched and managed by Caldwell Investment Management Ltd. For its equity investment the fund primarily invests in public equity markets of United States and Canada. The fund primarily focuses on U.S. financial companies and Canadian resource companies for equity investments. The fund also focuses on private equity investments. It was formerly known as Macho River Gold Mines Limited. Urbana Corporation is domiciled in Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "URB-A.TO": {
        "short_name": "URBANA CORPORATION CL A",
        "long_name": "Urbana Corporation",
        "summary": "Urbana Corporation is an investment fund launched and managed by Caldwell Investment Management Ltd. For its equity investment the fund primarily invests in public equity markets of United States and Canada. The fund primarily focuses on U.S. financial companies and Canadian resource companies for equity investments. The fund also focuses on private equity investments. It was formerly known as Macho River Gold Mines Limited. Urbana Corporation is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "URNAF": {
        "short_name": "URBANA CORP",
        "long_name": "Urbana Corporation",
        "summary": "Urbana Corporation is an investment fund launched and managed by Caldwell Investment Management Ltd. For its equity investment the fund primarily invests in public equity markets of United States and Canada. The fund primarily focuses on U.S. financial companies and Canadian resource companies for equity investments. The fund also focuses on private equity investments. It was formerly known as Macho River Gold Mines Limited. Urbana Corporation is domiciled in Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "USF-UN.TO": {
        "short_name": "US FINANCIALS INCOME FUND",
        "long_name": "U.S. Financials Income Fund",
        "summary": "U.S. Financials Income Fund is a closed-end equity mutual fund launched and managed by Strathbridge Asset Management Inc. It invests in the public equity markets of countries based in the United States. The fund invests in stocks of companies operating across diversified sectors. It invests in stocks of companies across diversified market capitalizations. The fund employs a combination fundamental and quantitative analysis to create its portfolio. U.S. Financials Income Fund is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "WCM-A.TO": {
        "short_name": "WILMINGTON CAPITAL MGMT INC., C",
        "long_name": "Wilmington Capital Management Inc.",
        "summary": "Wilmington Capital Management Inc. is a private equity firm specializing in special situation investments. The firm prefers to invest in real estate and energy sectors. It owns and operates 38 self-storage facilities with approximately 1.6 million square feet of rentable area in British Columbia, Alberta, Manitoba, and Ontario. In addition, it owns and operates 4 marinas in Ontario, which include approximately 1,700 boat slips and 100 acres of waterfront land. The company was formerly known as Unicorp Inc. and changed its name to Wilmington Capital Management Inc. in March 2002. Wilmington Capital Management Inc. was founded in 1979 and is based in Calgary, Canada with an additional office in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "WCM-B.TO": {
        "short_name": "WILMINGTON CAPITAL MANAGEMENT C",
        "long_name": "Wilmington Capital Management Inc.",
        "summary": "Wilmington Capital Management Inc. is a private equity firm specializing in special situation investments. The firm prefers to invest in real estate and energy sectors. It owns and operates 38 self-storage facilities with approximately 1.6 million square feet of rentable area in British Columbia, Alberta, Manitoba, and Ontario. In addition, it owns and operates 4 marinas in Ontario, which include approximately 1,700 boat slips and 100 acres of waterfront land. The company was formerly known as Unicorp Inc. and changed its name to Wilmington Capital Management Inc. in March 2002. Wilmington Capital Management Inc. was founded in 1979 and is based in Calgary, Canada with an additional office in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "WE.V": {
        "short_name": "WECOMMERCE HOLDINGS LTD",
        "long_name": "WeCommerce Holdings Ltd.",
        "summary": "WeCommerce Holdings Ltd. is private equity and venture capital firm specializing in startups, and buyout. It operates as a holding company that owns a family of companies and brands in the Shopify partner ecosystem, including Pixel Union, Out of the Sandbox, Yopify, SuppleApps, Rehash, and Foursixty. WeCommerce Holdings Ltd. is based in Victoria, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": null
    },
    "WECMF": {
        "short_name": "WECOMMERCE HOLDINGS LTD",
        "long_name": "WeCommerce Holdings Ltd.",
        "summary": "WeCommerce Holdings Ltd. is private equity and venture capital firm specializing in startups, and buyout. It operates as a holding company that owns a family of companies and brands in the Shopify partner ecosystem, including Pixel Union, Out of the Sandbox, Yopify, SuppleApps, Rehash, and Foursixty. WeCommerce Holdings Ltd. is based in Victoria, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": null
    },
    "WED.V": {
        "short_name": "THE WESTAIM CORPORATION",
        "long_name": "The Westaim Corporation",
        "summary": "The Westaim Corporation is a private equity firm specializing in direct and indirect investments through acquisitions, joint ventures, secondary investments both direct and indirect, fund of fund investments, and other arrangements. For direct investments, the firm invests in early venture, mid venture, late venture, middle market, later stage, mature, emerging growth, PIPEs, and buyout transactions. For fund of fund investments, it seeks to invest in private equity funds, venture capital funds, and hedge funds. The firm seeks to provide long term capital to businesses operating in the global financial services industry. It typically acquires controlling interests in businesses. The firm seeks to acquire debt, equity, or derivative securities of both public and private companies. It invests with the objective of providing its shareholders with capital appreciation and real wealth preservation. The firm seeks to provide its portfolio companies with advisory services including, but not limited to, advice on capital allocation, financing strategy, performance measurement and merger and acquisition support. It also seeks to partner with like-minded providers of third party capital to help supplement the firm's own capital, when completing acquisitions. The firm generally seeks to hold its investments for seven to 15 years. The Westaim Corporation was founded in 1996 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "WEDXF": {
        "short_name": "WESTAIM CORP",
        "long_name": "The Westaim Corporation",
        "summary": "The Westaim Corporation is a private equity firm specializing in direct and indirect investments through acquisitions, joint ventures, secondary investments both direct and indirect, fund of fund investments, and other arrangements. For direct investments, the firm invests in early venture, mid venture, late venture, middle market, later stage, mature, emerging growth, PIPEs, and buyout transactions. For fund of fund investments, it seeks to invest in private equity funds, venture capital funds, and hedge funds. The firm seeks to provide long term capital to businesses operating in the global financial services industry. It typically acquires controlling interests in businesses. The firm seeks to acquire debt, equity, or derivative securities of both public and private companies. It invests with the objective of providing its shareholders with capital appreciation and real wealth preservation. The firm seeks to provide its portfolio companies with advisory services including, but not limited to, advice on capital allocation, financing strategy, performance measurement and merger and acquisition support. It also seeks to partner with like-minded providers of third party capital to help supplement the firm's own capital, when completing acquisitions. The firm generally seeks to hold its investments for seven to 15 years. The Westaim Corporation was founded in 1996 and is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "WEM1.F": {
        "short_name": "WESTAIM CORP.",
        "long_name": "The Westaim Corporation",
        "summary": "The Westaim Corporation is a private equity firm specializing in direct and indirect investments through acquisitions, joint ventures, secondary investments both direct and indirect, fund of fund investments, and other arrangements. For direct investments, the firm invests in early venture, mid venture, late venture, middle market, later stage, mature, emerging growth, PIPEs, and buyout transactions. For fund of fund investments, it seeks to invest in private equity funds, venture capital funds, and hedge funds. The firm seeks to provide long term capital to businesses operating in the global financial services industry. It typically acquires controlling interests in businesses. The firm seeks to acquire debt, equity, or derivative securities of both public and private companies. It invests with the objective of providing its shareholders with capital appreciation and real wealth preservation. The firm seeks to provide its portfolio companies with advisory services including, but not limited to, advice on capital allocation, financing strategy, performance measurement and merger and acquisition support. It also seeks to partner with like-minded providers of third party capital to help supplement the firm's own capital, when completing acquisitions. The firm generally seeks to hold its investments for seven to 15 years. The Westaim Corporation was founded in 1996 and is based in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "XMF-A.TO": {
        "short_name": "M SPLIT CORP CAPITAL SHARES 201",
        "long_name": "M Split Corp.",
        "summary": "M Split Corp. is a close-ended equity mutual fund launched and managed by Quadravest Capital Management Inc. It invests in the public equity markets of Canada. The fund invests in the stocks of companies engaged in the financial sector. It invests its entire corpus in the stock of Manulife Financial Corp. The fund benchmarks the performance of its portfolio against the S&P TSX Financial index. M Split Corp. was formed on February 12, 2007 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "XTD.TO": {
        "short_name": "TDB SPLIT CORP., CLASS A SHARES",
        "long_name": "TDb Split Corp.",
        "summary": "TDb Split Corp. is a closed-ended equity mutual fund launched and managed by Quadravest Capital Management Inc. It invests in the public equity markets of Canada. The fund seeks to invest in the stocks of a company operating in the banking sector. It primarily invests in the common shares of Toronto-Dominion Bank. The fund benchmarks the performance of its portfolio against the S&P TSX Financial Index. TDb Split Corp. was formed on May 24, 2007 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "YCM.TO": {
        "short_name": "COMMERCE SPLIT CORP CAPITAL SHA",
        "long_name": "New Commerce Split Fund",
        "summary": "New Commerce Split Fund is an equity mutual fund launched and managed by Quadravest Capital Management Inc. The fund invests in the equity shares of Canadian Imperial Bank of Commerce. It was formerly known as Commerce Split Fund. New Commerce Split Fund was launched on November 27, 2006 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    }
}