{
    "APM.V": {
        "short_name": "ANDEAN PRECIOUS METALS CORP",
        "long_name": "Andean Precious Metals Corp.",
        "summary": null,
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Industrial Metals & Minerals",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": null,
        "city": null,
        "zipcode": null,
        "website": null,
        "full_time_employees": null
    },
    "NOB.V": {
        "short_name": "NOBLE MINERAL EXPLORATION INC",
        "long_name": "Noble Mineral Exploration Inc.",
        "summary": "Noble Mineral Exploration Inc., a junior exploration company, engages in the exploration and evaluation of mineral resources properties in Canada. It primarily explores for nickel, cobalt, gold, chromium, copper, lead, zinc, and silver deposits. The company's principal properties include the Project 81 that covers an area of approximately 72,000 hectares located in Timmins-Cochrane area of Northern Ontario; and Holdsworth property comprising 19 contiguous patented mining claims covering an area of 304 hectares situated to the northeast of Wawa, Ontario. The company was formerly known as Ring of Fire Resources Inc. and changed its name to Noble Mineral Exploration Inc. in March 2012. Noble Mineral Exploration Inc. is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Industrial Metals & Minerals",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 1T1",
        "website": "http://www.noblemineralexploration.com",
        "full_time_employees": null
    },
    "TECKN.MX": {
        "short_name": "TECK RESOURCES LIMITED",
        "long_name": "Teck Resources Limited",
        "summary": "Teck Resources Limited engages in exploring for, acquiring, developing, and producing natural resources in Asia, Europe, and North America. It operates through Steelmaking Coal, Copper, Zinc, and Energy segments. The company's principal products include steelmaking coal; copper concentrates and refined copper cathodes; refined zinc and zinc concentrates; energy products, such as bitumen; and lead and molybdenum concentrates. It also produces gold, silver, germanium, indium, and cadmium, as well as chemicals, industrial products, and fertilizers. In addition, the company holds interest in Frontier oil sands projects in the Athabasca region of Alberta; and owns interests in exploration and development projects in Australia, Chile, Ireland, Mexico, Peru, Turkey, and the United States. The company was formerly known as Teck Cominco Limited and changed its name to Teck Resources Limited in April 2009. Teck Resources Limited was founded in 1913 and is headquartered in Vancouver, Canada.",
        "currency": "MXN",
        "sector": "Basic Materials",
        "industry": "Industrial Metals & Minerals",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 0B3",
        "website": "http://www.teck.com",
        "full_time_employees": 10000
    }
}