{
    "3EN.F": {
        "short_name": "CURRENT WATER TECHS",
        "long_name": "Current Water Technologies Inc.",
        "summary": "Current Water Technologies Inc. develops environmental technologies in Canada, Europe, Asia, and the United States. The company provides patented and proprietary technologies for the treatment of waste water and drinking water that are contaminated by metals or nutrients, such as arsenic and nitrate/ammonia associated with the mining, metal processing, chemical, agricultural, municipal, and waste management sectors; and for the recovery of nickel and other valuable metals from waste mill sulphide tailings associated with the mining sector. Its technologies comprise electro-static deionization, a electrochemical process that lowers the concentration of total dissolved solids in water; ammonia removal technology, a technology used for the removal of dissolved ammonia from industrial and municipal water, including wastewater, storm water, sewage effluent, and mine waste water; NitrEL system, an electrochemical water treatment process that reduces nitrate concentrations in contaminated drinking water, groundwater, and industrial process wastewater streams; AmdEl an electrochemical system that prevents the oxidation of sulphide minerals in tailings or waste rock; and ExtrEL for the recovery of metals from sulphide tailings and ore. The company was formerly known as ENPAR Technologies Inc. and changed its name to Current Water Technologies Inc. in January 2018. Current Water Technologies Inc. was incorporated in 1996 and is headquartered in Guelph, Canada.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Guelph",
        "zipcode": "N1G 4P5",
        "website": "http://www.currentwatertechnologies.com",
        "market_cap": 5425600
    },
    "52G.F": {
        "short_name": "GREENLANE RENEWABLES INC.",
        "long_name": "Greenlane Renewables Inc.",
        "summary": "Greenlane Renewables Inc. designs, develops, sells, and services a range of biogas upgrading systems worldwide. The company's systems remove impurities and separate carbon dioxide from biomethane in the raw biogas created from anaerobic decomposition of organic waste at landfills, wastewater treatment plants, and farms and for injection food waste facilities into the natural gas grid or for direct use as vehicle fuel. It offers water wash, pressure swing adsorption, and membrane separation technologies. The company markets and sells its upgrading systems under the Greenlane Biogas brand. The company was formerly known as Creation Capital Corp. and changed its name to Greenlane Renewables Inc. in June 2019. Greenlane Renewables Inc. was founded in 1986 and is headquartered in Burnaby, Canada.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Burnaby",
        "zipcode": "V5G 4X5",
        "website": "http://www.greenlanerenewables.com",
        "market_cap": 155733552
    },
    "79Q.F": {
        "short_name": "QUESTOR TECHNOLOGY INC.",
        "long_name": "Questor Technology Inc.",
        "summary": "Questor Technology Inc., an environmental clean technology company, designs, manufactures, and services waste gas combustion systems in Canada and the United States. The company sells, rents, and services waste gas incineration systems. It offers its solutions for various oil and gas projects, as well as for landfill biogas, syngas, waste engine exhaust, geothermal and solar, and cement plant waste heat. The company was formerly known as Interglobe Gas Technology Inc. and changed its name to Questor Technology Inc. in September 1995. Questor Technology Inc. was founded in 1994 and is headquartered in Calgary, Canada.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 3N3",
        "website": "http://www.questortech.com",
        "market_cap": 31900580
    },
    "ACT.CN": {
        "short_name": "AduroCleanTech",
        "long_name": "Aduro Clean Technologies Inc.",
        "summary": "Aduro Energy Inc. develops water-based solutions to transform corn distillers oil and other waste lipids into drop-in diesel, petroleum, specialty chemicals, and bio-jet fuel. The company was founded in 2011 and is based in London, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "London",
        "zipcode": "N6G 0J3",
        "website": "http://www.aduroenergy.com",
        "market_cap": 8280600
    },
    "ADCV": {
        "short_name": "AD CAPITAL US INC",
        "long_name": "ADCapital US Inc.",
        "summary": "ADCapital US Inc. engages in the research, testing, and development of products that reduce emissions from vehicle exhaust. Its principal product includes Auto Emission Post Regulator (AEPR), which reduces the vehicle emission (NOx) by approximately 97%. ADCapital US Inc. is based in Burnaby, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Burnaby",
        "zipcode": "V3N 2Z4",
        "website": null,
        "market_cap": 86700
    },
    "APL.V": {
        "short_name": "APPULSE CORP.",
        "long_name": "Appulse Corporation",
        "summary": "Appulse Corporation, through its subsidiaries, provides new and refurbished centrifuge machines and parts in North America and internationally. It is also involved in the rental of centrifuge equipment; provision of maintenance services, and consulting and design advisory services to industries, as well as machining services for equipment repairs; and manufacture of parts using machining and milling equipment. In addition, the company offers value added services, including a balancing service for large equipment, such as centrifuge bowls. It provides its products and services for food and beverage processing, and environmental applications, as well as serves other industries comprising the oil and gas service, refinery, marine processing, and pharmaceutical industries. The company is based in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2C 1P4",
        "website": "http://www.appulsecorp.net",
        "market_cap": 4749188
    },
    "BRM.V": {
        "short_name": "BIOREM INC.",
        "long_name": "BIOREM Inc.",
        "summary": "BIOREM Inc., an environmental biotechnology company, designs, manufactures, and sells air emissions control systems that are used to eliminate odors, volatile organic compounds (VOCs), and hazardous air pollutants (HAPs). It offers biofilters for the removal of odors, H2S, VOCs and HAPs; and biotrickling filters for applications of high concentrations of H2S or other water soluble compounds. The company also provides multi-stage systems to treat odors associated with various municipal wastewater treatment processes; biogas conditioning systems; ultrafiltration membranes to treat water sources; biological odor control systems; and filter media products to treat air emissions. In addition, it offers biological processes and testing services; media sampling and analysis; system review and inspections; and media replacements and spare parts. The company operates in Canada, the United States, China, and internationally. BIOREM Inc. is headquartered in Guelph, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Guelph",
        "zipcode": "N1H 6H9",
        "website": "http://www.biorem.biz",
        "market_cap": 17397720
    },
    "C3X2.F": {
        "short_name": "DUNDEE SUSTAINABLE TECHN.",
        "long_name": "Dundee Sustainable Technologies Inc.",
        "summary": "Dundee Sustainable Technologies Inc. engages in the development and commercialization of technologies for the treatment of refractory materials in the mining industry in Canada and internationally. It focuses on the commercialization of CLEVR process, which extracts precious metals, as well as removes and stabilizes contaminants, such as arsenic, antimony, and cadmium; and GlassLock process, which stabilizes arsenic, forms scorodite, and produces an insoluble glass residue that meets environmental requirements. The company extracts precious and base metals from ores, concentrates, and tailings. It also provides technical services to customers in the mining industry to evaluate processing alternatives. The company was formerly known as Nichromet Extraction Inc. and changed its name to Dundee Sustainable Technologies Inc. in January 2014. Dundee Sustainable Technologies Inc. was incorporated in 1997 and is headquartered in Montreal, Canada. Dundee Sustainable Technologies Inc. is a subsidiary of Dundee Corporation.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3A 2W5",
        "website": "http://www.dundeetechnologies.com",
        "market_cap": 38447600
    },
    "COSLF": {
        "short_name": "CO2 SOLUTIONS INC",
        "long_name": "CO2 Solutions Inc.",
        "summary": "CO2 Solutions Inc. develops proprietary technologies for the capture and production of carbon dioxide (CO2) in Canada, the United States, and Europe. It focuses on commercializing an enzyme-based technology for efficient CO2 capture from various industrial flue gasses for reuse or sequestration. The company's technology has various industrial applications, such as enhanced oil recovery, oil and gas, pulp and paper, water treatment, cement, beverage carbonation, greenhouses, and other uses. It has a collaboration agreement with Hatch Ltd. to deliver carbon capture systems. CO2 Solutions Inc. was founded in 1997 and is headquartered in Quebec City, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "QC",
        "city": "Quebec City",
        "zipcode": "G2C 1T9",
        "website": "http://www.co2solutions.com",
        "market_cap": 4567420
    },
    "DOCKF": {
        "short_name": "BEYOND MEDICAL TECHNOLOGIES INC",
        "long_name": "Beyond Medical Technologies Inc.",
        "summary": "Beyond Medical Technologies Inc., an industrial/technology company, develops waste digester systems for food and pharmaceuticals industries in Canada. Its Organivore and Pharmavore waste digester systems turns organic waste into clean water. The company also engages in the manufacturing and distribution of personal protective equipment, including medical grade face masks. In addition, it offers health communications platform that facilitates doctors to streamline communications with their patients and remotely monitor them. The company was formerly known as Micron Waste Technologies Inc. The company was incorporated in 2006 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1G8",
        "website": "http://beyondmd.ca",
        "market_cap": 4095067
    },
    "DOCT.CN": {
        "short_name": "BeyondMedTech",
        "long_name": "Beyond Medical Technologies Inc.",
        "summary": "Beyond Medical Technologies Inc., an industrial/technology company, develops waste digester systems for food and pharmaceuticals industries in Canada. Its Organivore and Pharmavore waste digester systems turns organic waste into clean water. The company also engages in the manufacturing and distribution of personal protective equipment, including medical grade face masks. In addition, it offers health communications platform that facilitates doctors to streamline communications with their patients and remotely monitor them. The company was formerly known as Micron Waste Technologies Inc. The company was incorporated in 2006 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1G8",
        "website": "http://beyondmd.ca",
        "market_cap": 3920826
    },
    "DSOX": {
        "short_name": "TRITON EMISSION SOLUTIONS INC",
        "long_name": "Triton Emission Solutions Inc.",
        "summary": "Triton Emission Solutions Inc. develops and markets emission abatement technologies for the marine industry worldwide. It offers bio scrubber technology, a system designed to reduce the maintenance cost and premature failure of gas turbine engines by removing alkali metals; and DSOX-20, a pre-combustion fuel purification system that is designed to remove alkali metals, such as sulfur and sodium from heavy marine fuel. It also provides Njord exhaust gas scrubber system that clean the exhaust gases from excess sulfur released from the internal combustion process within ships engine. The company was formerly known as Poly Shield Technologies Inc. and changed its name to Triton Emission Solutions Inc. in August 2014. Triton Emission Solutions Inc. was incorporated in 2000 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 4A4",
        "website": "http://www.tritoninc.com",
        "market_cap": 176390
    },
    "DST.CN": {
        "short_name": "DundeeSustain",
        "long_name": "Dundee Sustainable Technologies Inc.",
        "summary": "Dundee Sustainable Technologies Inc. engages in the development and commercialization of technologies for the treatment of refractory materials in the mining industry in Canada and internationally. It focuses on the commercialization of CLEVR process, which extracts precious metals, as well as removes and stabilizes contaminants, such as arsenic, antimony, and cadmium; and GlassLock process, which stabilizes arsenic, forms scorodite, and produces an insoluble glass residue that meets environmental requirements. The company extracts precious and base metals from ores, concentrates, and tailings. It also provides technical services to customers in the mining industry to evaluate processing alternatives. The company was formerly known as Nichromet Extraction Inc. and changed its name to Dundee Sustainable Technologies Inc. in January 2014. Dundee Sustainable Technologies Inc. was incorporated in 1997 and is headquartered in Montreal, Canada. Dundee Sustainable Technologies Inc. is a subsidiary of Dundee Corporation.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3A 2W5",
        "website": "http://www.dundeetechnologies.com",
        "market_cap": 24635520
    },
    "EUW.F": {
        "short_name": "THERMAL ENERGY INTL",
        "long_name": "Thermal Energy International Inc.",
        "summary": "Thermal Energy International Inc. engages in the development, engineering, and supply of pollution control products, heat recovery systems, and condensate return solutions in North America, Europe, China, and internationally. Its products include GEM steam traps; FLU-ACE, a direct contact condensing heat recovery system that recycles the heat lost through the boiler flue gas exhaust; and DRY-REX, a low temperature biomass drying system. The company also provides turn-key thermal energy solutions; and sells water treatment products and services. It serves pharmaceutical, food and beverage, pulp and paper, hospital, chemical and petrochemical, and other industry sectors. Thermal Energy International Inc. was founded in 1991 and is headquartered in Ottawa, Canada.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Ottawa",
        "zipcode": "K2E 7W5",
        "website": "http://www.thermalenergy.com",
        "market_cap": 19472088
    },
    "EWS.V": {
        "short_name": "ENVIRONMENTAL WASTE INTERNATION",
        "long_name": "Environmental Waste International Inc.",
        "summary": "Environmental Waste International Inc., together with its subsidiaries, designs and develops environmental products for waste treatment and disposal in Canada and the United States. It researches, designs, develops, sells, and maintains systems based on the patented Reverse Polymerization process and related delivery system. The company offers systems for feed tire reduction, biological wastewater sterilization, shipboard food waste sterilization/dehydration, and batch-based infectious medical waste sterilization. Its tire system breaks the molecular bonds in tires and other rubber products and reduces them to their base components of carbon black, steel, and hydrocarbon vapors. The company also offers FS-6000 and FS-POD biocontainment and wastewater sterilization units; MD-1000, a three-stage, three chamber, medical waste reduction unit that produces a sterilized carbon residue; and AW-1000 to process and reduce animal waste into its constituents. Environmental Waste International Inc. was founded in 1987 and is based in Ajax, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Ajax",
        "zipcode": "L1S 1R5",
        "website": "http://www.ewi.ca",
        "market_cap": 60283920
    },
    "GRN.TO": {
        "short_name": "GREENLANE RENEWABLES INC",
        "long_name": "Greenlane Renewables Inc.",
        "summary": "Greenlane Renewables Inc. designs, develops, sells, and services a range of biogas upgrading systems worldwide. The company's systems remove impurities and separate carbon dioxide from biomethane in the raw biogas created from anaerobic decomposition of organic waste at landfills, wastewater treatment plants, and farms and for injection food waste facilities into the natural gas grid or for direct use as vehicle fuel. It offers water wash, pressure swing adsorption, and membrane separation technologies. The company markets and sells its upgrading systems under the Greenlane Biogas brand. The company was formerly known as Creation Capital Corp. and changed its name to Greenlane Renewables Inc. in June 2019. Greenlane Renewables Inc. was founded in 1986 and is headquartered in Burnaby, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Burnaby",
        "zipcode": "V5G 4X5",
        "website": "http://www.greenlanerenewables.com",
        "market_cap": 203948352
    },
    "GRNWF": {
        "short_name": "GREENLANE RENEWABLES INC",
        "long_name": "Greenlane Renewables Inc.",
        "summary": "Greenlane Renewables Inc. designs, develops, sells, and services a range of biogas upgrading systems worldwide. The company's systems remove impurities and separate carbon dioxide from biomethane in the raw biogas created from anaerobic decomposition of organic waste at landfills, wastewater treatment plants, and farms and for injection food waste facilities into the natural gas grid or for direct use as vehicle fuel. It offers water wash, pressure swing adsorption, and membrane separation technologies. The company markets and sells its upgrading systems under the Greenlane Biogas brand. The company was formerly known as Creation Capital Corp. and changed its name to Greenlane Renewables Inc. in June 2019. Greenlane Renewables Inc. was founded in 1986 and is headquartered in Burnaby, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Burnaby",
        "zipcode": "V5G 4X5",
        "website": "http://www.greenlanerenewables.com",
        "market_cap": 177205440
    },
    "INTWF": {
        "short_name": "SHARC INTERNATIONAL SYSTEMS INC",
        "long_name": "Sharc International Systems Inc.",
        "summary": "Sharc International Systems Inc. provides wastewater heat exchange products and services for commercial, industrial, public utilities, and residential development projects in Canada, the United Kingdom, and internationally. It offers PIRANHA and SHARC systems that provide energy savings and reduce carbon emissions from multi-unit and district heating and cooling network. The company was formerly known as International Wastewater Systems Inc. and changed its name to Sharc International Systems Inc. in September 2017. Sharc International Systems Inc. is based in Port Coquitlam, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Port Coquitlam",
        "zipcode": "V3C 6L4",
        "website": "http://www.sharcenergy.com",
        "market_cap": 26129422
    },
    "IWIA.F": {
        "short_name": "SHARC INTL SYS INC.",
        "long_name": "Sharc International Systems Inc.",
        "summary": "Sharc International Systems Inc. provides wastewater heat exchange products and services for commercial, industrial, public utilities, and residential development projects in Canada, the United Kingdom, and internationally. It offers PIRANHA and SHARC systems that provide energy savings and reduce carbon emissions from multi-unit and district heating and cooling network. The company was formerly known as International Wastewater Systems Inc. and changed its name to Sharc International Systems Inc. in September 2017. Sharc International Systems Inc. is based in Port Coquitlam, Canada.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Port Coquitlam",
        "zipcode": "V3C 6L4",
        "website": "http://www.sharcenergy.com",
        "market_cap": 21377050
    },
    "MGON": {
        "short_name": "MEGOLA INC",
        "long_name": "Megola, Inc.",
        "summary": "Megola, Inc. develops and sells various physical water treatment devices. It has operations in Canada, China, Indonesia, and the United States. The company is based in Point Edward, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Point Edward",
        "zipcode": "N7V 1X4",
        "website": null,
        "market_cap": 8986
    },
    "QST.V": {
        "short_name": "Questor Technology Inc.",
        "long_name": "Questor Technology Inc.",
        "summary": "Questor Technology Inc., an environmental clean technology company, designs, manufactures, and services waste gas combustion systems in Canada and the United States. The company sells, rents, and services waste gas incineration systems. It offers its solutions for various oil and gas projects, as well as for landfill biogas, syngas, waste engine exhaust, geothermal and solar, and cement plant waste heat. The company was formerly known as Interglobe Gas Technology Inc. and changed its name to Questor Technology Inc. in September 1995. Questor Technology Inc. was founded in 1994 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 3N3",
        "website": "http://www.questortech.com",
        "market_cap": 47693576
    },
    "QUTIF": {
        "short_name": "QUESTOR TECHNOLOGY INC",
        "long_name": "Questor Technology Inc.",
        "summary": "Questor Technology Inc., an environmental clean technology company, designs, manufactures, and services waste gas combustion systems in Canada and the United States. The company sells, rents, and services waste gas incineration systems. It offers its solutions for various oil and gas projects, as well as for landfill biogas, syngas, waste engine exhaust, geothermal and solar, and cement plant waste heat. The company was formerly known as Interglobe Gas Technology Inc. and changed its name to Questor Technology Inc. in September 1995. Questor Technology Inc. was founded in 1994 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 3N3",
        "website": "http://www.questortech.com",
        "market_cap": 39862284
    },
    "QWTR": {
        "short_name": "QUEST WATER GLOBAL INC",
        "long_name": "Quest Water Global, Inc.",
        "summary": "Quest Water Global, Inc., a water technology company, provides solutions that address the shortage of clean drinking water in developing countries. The company focuses on manufacturing and selling AQUAtap community drinking water station, a solar-powered water purification and distribution system; and WEPS, a water extraction and purification system that produces clean drinking water from humidity in the atmosphere. The company's systems have applications in rural and urban community water supply, water supply for household needs, remote work site camps, and water supply for disaster relief. It offers its community drinking water station to various markets, including non-governmental organizations, governmental agencies, land developers, local communities, and local water suppliers in Angola; and water extraction and purification system to commercial bottled water operations, agricultural irrigation, industrial capture and reuse, and bulk residential supply markets. The company was founded in 2008 and is headquartered in West Vancouver, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "West Vancouver",
        "zipcode": "V7V 1A7",
        "website": "http://www.questwatersolutions.com",
        "market_cap": 5483720
    },
    "RAKR": {
        "short_name": "RAINMAKER WORLDWIDE INC",
        "long_name": "Rainmaker Worldwide Inc.",
        "summary": "Rainmaker Worldwide Inc. produces drinking water for communities. It offers water-producing technologies, including air-to-water technology, which harvests fresh water from the air; water-to-water technology that transforms seawater or polluted water into drinking water; and commercial water-to-water technology. The company is headquartered in Peterborough, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Peterborough",
        "zipcode": "K9H 2P8",
        "website": "http://rainmakerww.com",
        "market_cap": 302513
    },
    "ROBXF": {
        "short_name": "ROBIX ENVIRONMENTAL TECHNOLOGIE",
        "long_name": "Robix Environmental Technologies, Inc.",
        "summary": "Robix Environmental Technologies, Inc., an investment holding company, develops and sells oil spill response and recovery equipment, oil-water separation equipment, and cleaning and purification equipment in Canada. The company operates through Clean Ocean Vessel Technology and Clean Water Technology segments. Its products include C series clean ocean vessel that recover oil in rough ocean waters, lakes, rivers, and tailings ponds; and P series platform, which accelerates oil recovery from settling ponds at production facilities, as well as hydro cycle water systems. Robix Environmental Technologies, Inc. also provides contaminated water clean-up treatment services. The company was formerly known as Robix Alternative Fuels, Inc. and changed its name to Robix Environmental Technologies, Inc. in March 2016. Robix Environmental Technologies, Inc. was founded in 2011 and is headquartered in Calgary, Canada. Robix Environmental Technologies, Inc. is a subsidiary of Blue Horizon Industries Inc.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2E 7T8",
        "website": "http://www.robixfuels.com",
        "market_cap": 52933
    },
    "SAY.V": {
        "short_name": "SPARTA CAPITAL LTD",
        "long_name": "Sparta Capital Ltd.",
        "summary": "Sparta Capital Ltd. provides specialized energy capturing, converting, optimizing, and related services to the commercial sector. It is involved in the conversion of biomass with a focus on sequestering CO2 emissions through waste diversion and converting biomass waste into consumables, such as waste-to-energy products; and electronics recycling business that converts and remarkets old electronic components. The company also distributes specialized photoluminescent exit signs and egress pathway marking to reduce the consumption of carbon based electricity; and measures and monitors energy use in commercial buildings and manufacturing facilities, as well as offers turnkey solutions and ongoing support. In addition, it delivers energy management and power quality solutions and services, including harmonic mitigation and power factor correction in industrial and commercial areas. Further, the company offers TruckSuite that provides fleet owners/operators with comprehensive maintenance, including roadside emergency assistance; emergency repair with competitive pricing, and complete warranty coverage; and TripVision, an integrated vehicle health and safety management system. Sparta Capital Ltd. was incorporated in 1988 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 2Y2",
        "website": "http://www.spartagroup.ca",
        "market_cap": 16229680
    },
    "SHRC.CN": {
        "short_name": "SharcIntlSysInc",
        "long_name": "Sharc International Systems Inc.",
        "summary": "Sharc International Systems Inc. provides wastewater heat exchange products and services for commercial, industrial, public utilities, and residential development projects in Canada, the United Kingdom, and internationally. It offers PIRANHA and SHARC systems that provide energy savings and reduce carbon emissions from multi-unit and district heating and cooling network. The company was formerly known as International Wastewater Systems Inc. and changed its name to Sharc International Systems Inc. in September 2017. Sharc International Systems Inc. is based in Port Coquitlam, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Port Coquitlam",
        "zipcode": "V3C 6L4",
        "website": "http://www.sharcenergy.com",
        "market_cap": 30373940
    },
    "TGTMF": {
        "short_name": "TARGETED MICROWAVE SOLUTIONS IN",
        "long_name": "Targeted Microwave Solutions Inc.",
        "summary": "Targeted Microwave Solutions Inc. operates as an industrial clean technology company in Canada. The company is developing microwave based application technologies to dry, decontaminate, physically upgrade, and eliminate or reduce environment harming emissions. Its technology has applications to mass-scale use of industrial aggregates, energy producing biomass and low-rank coals, and other materials for use by power utilities and industrial companies. The company was incorporated in 2015 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 0M9",
        "website": null,
        "market_cap": 4299395
    },
    "TLGN": {
        "short_name": "TOTALLY GREEN INC",
        "long_name": "Totally Green, Inc.",
        "summary": "Totally Green, Inc. develops and distributes the organic refuse conversion alternative (OGCA) green machines in the United States and Canada. The OGCA green machines use an aerobic composting process to convert food waste into nutrient rich water that safely discharges into the sanitary sewer system. The company was founded in 2003 and is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M3B 2M3",
        "website": "http://www.feedtheorca.com",
        "market_cap": 14620686
    },
    "TMG.V": {
        "short_name": "Thermal Energy International In",
        "long_name": "Thermal Energy International Inc.",
        "summary": "Thermal Energy International Inc. engages in the development, engineering, and supply of pollution control products, heat recovery systems, and condensate return solutions in North America, Europe, China, and internationally. Its products include GEM steam traps; FLU-ACE, a direct contact condensing heat recovery system that recycles the heat lost through the boiler flue gas exhaust; and DRY-REX, a low temperature biomass drying system. The company also provides turn-key thermal energy solutions; and sells water treatment products and services. It serves pharmaceutical, food and beverage, pulp and paper, hospital, chemical and petrochemical, and other industry sectors. Thermal Energy International Inc. was founded in 1991 and is headquartered in Ottawa, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Ottawa",
        "zipcode": "K2E 7W5",
        "website": "http://www.thermalenergy.com",
        "market_cap": 28522200
    },
    "TMGEF": {
        "short_name": "THERMAL ENERGY INTERNATIONAL IN",
        "long_name": "Thermal Energy International Inc.",
        "summary": "Thermal Energy International Inc. engages in the development, engineering, and supply of pollution control products, heat recovery systems, and condensate return solutions in North America, Europe, China, and internationally. Its products include GEM steam traps; FLU-ACE, a direct contact condensing heat recovery system that recycles the heat lost through the boiler flue gas exhaust; and DRY-REX, a low temperature biomass drying system. The company also provides turn-key thermal energy solutions; and sells water treatment products and services. It serves pharmaceutical, food and beverage, pulp and paper, hospital, chemical and petrochemical, and other industry sectors. Thermal Energy International Inc. was founded in 1991 and is headquartered in Ottawa, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Ottawa",
        "zipcode": "K2E 7W5",
        "website": "http://www.thermalenergy.com",
        "market_cap": 23005366
    },
    "TMS-H.V": {
        "short_name": "TARGETED MICROWAVE SOLUTIONS IN",
        "long_name": "Targeted Microwave Solutions Inc.",
        "summary": "Targeted Microwave Solutions Inc. operates as an industrial clean technology company in Canada. The company is developing microwave based application technologies to dry, decontaminate, physically upgrade, and eliminate or reduce environment harming emissions. Its technology has applications to mass-scale use of industrial aggregates, energy producing biomass and low-rank coals, and other materials for use by power utilities and industrial companies. Targeted Microwave Solutions Inc. was incorporated in 2015 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 0M9",
        "website": null,
        "market_cap": 3840720
    },
    "WATR.V": {
        "short_name": "CURRENT WATER TECHNOLOGIES INC",
        "long_name": "Current Water Technologies Inc.",
        "summary": "Current Water Technologies Inc. develops environmental technologies in Canada, Europe, Asia, and the United States. The company provides patented and proprietary technologies for the treatment of waste water and drinking water that are contaminated by metals or nutrients, such as arsenic and nitrate/ammonia associated with the mining, metal processing, chemical, agricultural, municipal, and waste management sectors; and for the recovery of nickel and other valuable metals from waste mill sulphide tailings associated with the mining sector. Its technologies comprise electro-static deionization, a electrochemical process that lowers the concentration of total dissolved solids in water; ammonia removal technology, a technology used for the removal of dissolved ammonia from industrial and municipal water, including wastewater, storm water, sewage effluent, and mine waste water; NitrEL system, an electrochemical water treatment process that reduces nitrate concentrations in contaminated drinking water, groundwater, and industrial process wastewater streams; AmdEl an electrochemical system that prevents the oxidation of sulphide minerals in tailings or waste rock; and ExtrEL for the recovery of metals from sulphide tailings and ore. The company was formerly known as ENPAR Technologies Inc. and changed its name to Current Water Technologies Inc. in January 2018. Current Water Technologies Inc. was incorporated in 1996 and is headquartered in Guelph, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Guelph",
        "zipcode": "N1G 4P5",
        "website": "http://www.currentwatertechnologies.com",
        "market_cap": 13495950
    },
    "YEWTF": {
        "short_name": "ENVIRONMENTAL WASTE INTERNATION",
        "long_name": "Environmental Waste International Inc.",
        "summary": "Environmental Waste International Inc., together with its subsidiaries, designs and develops environmental products for waste treatment and disposal in Canada and the United States. It researches, designs, develops, sells, and maintains systems based on the patented Reverse Polymerization process and related delivery system. The company offers systems for feed tire reduction, biological wastewater sterilization, shipboard food waste sterilization/dehydration, and batch-based infectious medical waste sterilization. Its tire system breaks the molecular bonds in tires and other rubber products and reduces them to their base components of carbon black, steel, and hydrocarbon vapors. The company also offers FS-6000 and FS-POD biocontainment and wastewater sterilization units; MD-1000, a three-stage, three chamber, medical waste reduction unit that produces a sterilized carbon residue; and AW-1000 to process and reduce animal waste into its constituents. Environmental Waste International Inc. was founded in 1987 and is based in Ajax, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Ajax",
        "zipcode": "L1S 1R5",
        "website": "http://www.ewi.ca",
        "market_cap": 51116400
    }
}