{
    "26N.F": {
        "short_name": "NETCENTS TECHNOLOGY INC.",
        "long_name": "NetCents Technology Inc.",
        "summary": "NetCents Technology Inc. provides electronic digital payment services in Canada and Europe. Its platform allows clients and merchants to manage electronic payments through various devices and currencies. The company provides cryptocurrency ecommerce payments, in-store payments, instant settlements, as well as card and exchange services. It also allow users to purchase digital currency, such as Bitcoin, Ethereum, and Litecoin. The company is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V3C 1E3",
        "website": "http://www.net-cents.com",
        "market_cap": "Small Cap"
    },
    "54G.F": {
        "short_name": "SANGOMA TEC.",
        "long_name": "Sangoma Technologies Corporation",
        "summary": "Sangoma Technologies Corporation develops, manufactures, distributes, and supports voice and data connectivity components for software-based communication applications worldwide. The company offers Switchvox, a business phone system; PBXact, a phone system; Internet protocol (IP) phones; service provider and voice over Internet protocol gateways; Switchvox Cloud, a unified communications solution; SIPstation SIP Trunking, a hosted session initiation protocol trunking service; PBXact Cloud, a cloud based private branch exchange service; and FAXStation, a fax-over-IP solution. It also provides session border controllers; telephony and media transcoding cards; and open source communications software. The company serves small and medium sized businesses, enterprises, original equipment manufacturers, carriers, and service providers. Sangoma Technologies Corporation was founded in 1984 and is headquartered in Markham, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Markham",
        "zipcode": "L3R 9R6",
        "website": "http://www.sangoma.com",
        "market_cap": "Small Cap"
    },
    "5Z9.MU": {
        "short_name": "TELUS INTL SB VT.WH.ISS.",
        "long_name": "TELUS International (Cda) Inc.",
        "summary": "TELUS International (Cda) Inc. provides customer experience and digital business services in Europe, North America, the Asia-Pacific, and the Central America. It offers digital experience solutions, such as AI and bots, omnichannel CX, mobility solutions, cloud contact center, big data, platform transformation, and UX/UI design; and customer experience solutions, including work anywhere/work from home, customer care, technical support, sales growth and retention, and healthcare/patient experience. The company also provides IT lifecycle services comprising cloud and platform services, app dev and management, quality assurance and testing, system operations, IT service desk, internet of things, engineering solutions, and enterprise platform services; advisory services consisting of digital strategy, CX process consulting, data and customer analytics, workforce management, learning excellence solutions, and business and process transformation; robotic process automation, talent acquisition, finance and accounting, and supply chain management; and content moderation and social media, and fraud prevention and detection. It serves tech and games, communications and media, ecommerce and fintech, healthcare, and travel and hospitality industries. The company was founded in 2005 and is headquartered in Vancouver, Canada. TELUS International (Cda) Inc. is a subsidiary of TELUS Communications Inc.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 0M3",
        "website": "http://www.telusinternational.com",
        "market_cap": "Mid Cap"
    },
    "7ITA.F": {
        "short_name": "PREDICTIV AI INC.",
        "long_name": "Predictiv AI Inc.",
        "summary": "Predictiv AI Inc. provides software and solutions in the artificial intelligence and industrial internet of things markets in the United States and Canada. It offers real-time advanced artificial intelligence based predictive road condition weather analytics for government, insurance, agriculture, public safety, fleet management, and outdoor event industries. Predictiv AI Inc. has a collaboration with the Waterloo Artificial Intelligence Institute at the University of Waterloo to pursue various innovations. The company was formerly known as Internet of Things Inc. and changed its name to Predictiv AI Inc. in August 2020. Predictiv AI Inc. is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5S 1S4",
        "website": "http://www.predictiv.ai",
        "market_cap": "Small Cap"
    },
    "9SQ1.F": {
        "short_name": "TAAL DISTRIBUTED INFO.",
        "long_name": "Taal Distributed Information Technologies Inc.",
        "summary": "Taal Distributed Information Technologies Inc., through its subsidiaries, provides blockchain infrastructure and transactional platforms to support businesses building solutions and applications in Canada, Kazakhstan, and Cayman Island. It also engages in the developing, operating, and managing distributed computing systems for enterprise users. The company was formerly known as Squire Mining Ltd. and changed its name to Taal Distributed Information Technologies Inc. in December 2019. Taal Distributed Information Technologies Inc. was incorporated in 2011 and is based in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V7X 1L3",
        "website": "http://www.taal.com",
        "market_cap": "Small Cap"
    },
    "ATW.V": {
        "short_name": "ATW TECH INC",
        "long_name": "ATW Tech Inc.",
        "summary": "ATW Tech Inc., together with its subsidiaries, provides financial technology solutions in Canada, the United States, Europe, and internationally. The company offers its solutions through various Web platforms, including VoxTel, an interactive communication, landline, and mobile carrier billing phone solution; VuduMobile, a specialized text messaging solution for enterprises; Option.vote, a voting system for unions, political parties, professional associations, and others; and Bloomed, a cloud-based platform to manage data on consumers and their behaviors. The company was formerly known as AtmanCo Inc. ATW Tech Inc. is headquartered in Montreal, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3G 1Y8",
        "website": "http://www.atwtech.com",
        "market_cap": "Small Cap"
    },
    "BB": {
        "short_name": "BlackBerry Limited",
        "long_name": "BlackBerry Limited",
        "summary": "BlackBerry Limited provides intelligent security software and services to enterprises and governments worldwide. The company leverages artificial intelligence and machine learning to deliver solutions in the areas of cybersecurity, safety, and data privacy; and endpoint security management, encryption, and embedded systems. It offers BlackBerry Spark software platform that includes a suite of security software products and services comprising BlackBerry UEM, BlackBerry Dynamics, and BlackBerry Workspaces solutions; and BlackBerry Spark SDK to promote the evolution of a platform ecosystem by enabling enterprise and independent software vendor developers to integrate the security features of BlackBerry Spark into their own mobile and web applications. The company also provides BlackBerry Internet of Things (IoT) solutions, including BlackBerry QNX, BlackBerry Certicom, BlackBerry Radar, BlackBerry Jarvis, BlackBerry AtHoc, BlackBerry Alert, SecuSUITE, and other IoT applications. As of February 28, 2021, it owned approximately 38,000 worldwide patents and applications. The company has a partnership with the University of Windsor to develop and deliver a cybersecurity curriculum for the university's graduate master's program in applied computing; and an agreement with Amazon Web Services, Inc. to develop and market BlackBerry's IVY, an intelligent vehicle data platform. The company was formerly known as Research In Motion Limited and changed its name to BlackBerry Limited in July 2013. BlackBerry Limited was incorporated in 1984 and is headquartered in Waterloo, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Waterloo",
        "zipcode": "N2K 0A7",
        "website": "http://www.blackberry.com",
        "market_cap": "Mid Cap"
    },
    "BB.TO": {
        "short_name": "BLACKBERRY LIMITED",
        "long_name": "BlackBerry Limited",
        "summary": "BlackBerry Limited provides intelligent security software and services to enterprises and governments worldwide. The company leverages artificial intelligence and machine learning to deliver solutions in the areas of cybersecurity, safety, and data privacy; and endpoint security management, encryption, and embedded systems. It offers BlackBerry Spark software platform that includes a suite of security software products and services comprising BlackBerry UEM, BlackBerry Dynamics, and BlackBerry Workspaces solutions; and BlackBerry Spark SDK to promote the evolution of a platform ecosystem by enabling enterprise and independent software vendor developers to integrate the security features of BlackBerry Spark into their own mobile and web applications. The company also provides BlackBerry Internet of Things (IoT) solutions, including BlackBerry QNX, BlackBerry Certicom, BlackBerry Radar, BlackBerry Jarvis, BlackBerry AtHoc, BlackBerry Alert, SecuSUITE, and other IoT applications. As of February 28, 2021, it owned approximately 38,000 worldwide patents and applications. The company has a partnership with the University of Windsor to develop and deliver a cybersecurity curriculum for the university's graduate master's program in applied computing; and an agreement with Amazon Web Services, Inc. to develop and market BlackBerry's IVY, an intelligent vehicle data platform. The company was formerly known as Research In Motion Limited and changed its name to BlackBerry Limited in July 2013. BlackBerry Limited was incorporated in 1984 and is headquartered in Waterloo, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Waterloo",
        "zipcode": "N2K 0A7",
        "website": "http://www.blackberry.com",
        "market_cap": "Mid Cap"
    },
    "BYND.CN": {
        "short_name": "BYNDCannasoft",
        "long_name": "BYND Cannasoft Enterprises Inc.",
        "summary": "BYND Cannasoft Enterprises Inc., through its subsidiary, BYND Â\u0096 Beyond Solutions Ltd., owns and markets a proprietary customer relationship management software product under the Benefit CRM name. The company's Benefit CRM software enables small and medium-sized businesses to optimize their day-to-day business activities, such as sales management, personnel management, marketing, call center, and asset management activities. It is also developing New Cannabis CRM Platform to serve the needs of the medical cannabis industry. In addition, the company intends to construct, license, and operate cannabis farm. BYND Cannasoft Enterprises Inc. is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V5N 1Z6",
        "website": null,
        "market_cap": null
    },
    "C0B1.F": {
        "short_name": "TECHX TECHNOLOGIES INC.",
        "long_name": "TechX Technologies Inc.",
        "summary": "TechX Technologies Inc. focuses on emerging technologies across crypto, blockchain, artificial intelligence, IOT, and cloud based technologies sectors. The company was formerly known as LiteLink Technologies Inc. and changed its name to TechX Technologies Inc. in February 2021. TechX Technologies Inc. is based in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 4H1",
        "website": "http://www.tech-x.io",
        "market_cap": "Small Cap"
    },
    "DND.TO": {
        "short_name": "DYE AND DURHAM LIMITED",
        "long_name": "Dye & Durham Limited",
        "summary": "Dye & Durham Limited, through its subsidiary, Dye & Durham Corporation, provides cloud-based software and technology solutions for legal firms, financial service institutions, and government organizations in Canada and the United Kingdom. Its cloud-based platform automates the public record due diligence searches, document preparation, and electronic public record for legal due diligence, corporate formation and maintenance, lien registration, litigation, and real estate conveyancing. The company was founded in 1874 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5L 1E9",
        "website": "http://www.dyedurham.com",
        "market_cap": "Mid Cap"
    },
    "DRKOF": {
        "short_name": "MARTELLO TECHNOLOGIES GROUP INC",
        "long_name": "Martello Technologies Group Inc.",
        "summary": "Martello Technologies Group Inc., along with its subsidiaries, develops and sells products and solutions that optimize the performance of real-time applications on cloud and enterprise networks. It offers Mitel Performance Analytics, which monitors the status and performance of Mitel and third-party systems in the network; Martello Gizmo, which measures, alerts, and reports on Microsoft 365 user experience; unified communications solution for network health testing; Martello iQ, a service monitoring and analytics platform; and Live Maps, a Windows authentication troubleshooting solution. The company also provides technical support and training services. It serves industries, such as education, government, healthcare, professional services, and remote work, as well as service providers in Canada and internationally. The company was incorporated in 1981 and is headquartered in Ottawa, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Ottawa",
        "zipcode": "K2K 0G7",
        "website": "http://martellotech.com",
        "market_cap": "Small Cap"
    },
    "DSAI.CN": {
        "short_name": "DeepSpatial",
        "long_name": "DeepSpatial Inc.",
        "summary": "DeepSpatial Inc., an early stage artificial intelligence technology company, provides enterprise insights using geospatial data, geographic information systems, and machine learning. The company is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5K 1G8",
        "website": "http://www.deepspatial.ai",
        "market_cap": null
    },
    "DTSRF": {
        "short_name": "ETHER CAPITAL CORPORATION",
        "long_name": "Ether Capital Corporation",
        "summary": "Ether Capital Corporation, a technology company, through its subsidiaries, provides access and exposure to the Ethereum and Web 3 ecosystem to public market investors. It also operates cryptocurrency exchange and technology platform. The company was formerly known as Movit Media Corp. Ether Capital Corporation was founded in 2009 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 3P5",
        "website": "http://www.ethcap.co",
        "market_cap": "Small Cap"
    },
    "ETHC.NE": {
        "short_name": "ETHER CAPITAL CORPORATION",
        "long_name": "Ether Capital Corporation",
        "summary": "Ether Capital Corporation, a technology company, through its subsidiaries, provides access and exposure to the Ethereum and Web 3 ecosystem to public market investors. It also operates cryptocurrency exchange and technology platform. The company was formerly known as Movit Media Corp. Ether Capital Corporation was founded in 2009 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "NEO",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 3P5",
        "website": "http://www.ethcap.co",
        "market_cap": "Small Cap"
    },
    "FGBDF": {
        "short_name": "FIRST GLOBAL DATA LTD",
        "long_name": "First Global Data Limited",
        "summary": "First Global Data Limited, together with its subsidiaries, provides electronic payments and transaction processing solutions. Its services include remittance of services (online and mobile) from Canada and the United States under the FirstGlobalMoney brand; digital payments (online and mobile) under the PayQwik brand; and the licensing of its software. It primarily serves expatriates and migrant workers in Canada and the United States who send money to their countries of origin; and individuals without traditional banking relationships and traditional bank customers who prefer the speedy mobile and online service. The company accepts funds primarily from customers in Canada and the United States at its storefronts and online through electronic funds transfer and checking services. It dispenses funds to through its third-party agent and partner network to approximately 70 countries worldwide. The company was founded in 2001 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5V 3B1",
        "website": "http://www.firstglobaldata.com",
        "market_cap": "Small Cap"
    },
    "FTEC.V": {
        "short_name": "FINTECH SELECT LTD",
        "long_name": "Fintech Select Ltd.",
        "summary": "Fintech Select Ltd. provides financial payment services and solutions in Canada. The company operates through three segments: Distribution, Call Center, and Financial and Payment Services. It offers MasterCard and Visa prepaid card programs for various corporate and government organizations. The company's MasterCard branded card program serves a point of sale (POS) footprint, which allows consumers to activate, fund, and reload their cards. It also offers customized or turnkey private label card solutions for various programs and sales verticals, including government disbursements, incentives and rewards, payroll, mobile subscribers, general purpose re-loadable, retail gift, healthcare, travel, transit, loyalty, open or closed loop, and others. The company's mobile banking solutions include peer-to-peer micro lending, bill payment, remittance, and other financial features. In addition, it offers a POS cryptocurrency solution for buying and or selling cryptocurrencies through its retail partners, as well as e-wallet and online payment solutions. The company was formerly known as Selectcore Ltd. and changed its name to Fintech Select Ltd. in August 2017. Fintech Select Ltd. was founded in 1999 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "L4K 4M2",
        "website": "http://www.fintechselect.com",
        "market_cap": "Small Cap"
    },
    "GMS1.F": {
        "short_name": "IMAGINEAR INC.",
        "long_name": "ImagineAR Inc.",
        "summary": "ImagineAR Inc. provides an augmented reality (AR) platform that enables businesses, sports teams, and organizations to create and implement their own AR campaigns with no programming or technology experience. The company's products include ImagineAR Augmented Reality Platform that allows the choice of engagement by marker, location, and Web-based activation; ImagineAR.com, an AR-as-a-service platform for desktops; ImagineAR mobile app; ImagineAR SDK/API; ImagineAR Cloud, a centralized content management system, where AR is securely stored and managed; and WebAR services. It serves the retail, sports/live events, advertising/promotion, and fundraising industries. The company was formerly known as Imagination Park Technologies Inc. and changed its name to ImagineAR Inc. in April 2020. ImagineAR Inc. was incorporated in 2011 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 3B6",
        "website": "http://www.imaginear.com",
        "market_cap": "Small Cap"
    },
    "HAI.TO": {
        "short_name": "HAIVISION SYSTEMS INC",
        "long_name": "Haivision Systems Inc.",
        "summary": "Haivision Systems Inc. provides infrastructure solutions for the video streaming market, and servicing enterprises and governments worldwide. It offers cloud series products; video encoders and decoders; transcoders and gateways; players and set-top boxes; enterprise video and signage solutions; recording and low latency viewing products; and Haivision Media Platform, an enterprise video solution, which provides tools for securely distribute internet protocol television channels. The company deployed approximately 70,000 systems to blue-chip end-clients through a combination of its direct sales force and channel partners. It serves broadcast, enterprise, government, house of worship, medical, and military and defense industries. The company was formerly known as Hajtek Vision Inc. and changed its name to Haivision Systems Inc. in June 2004. Haivision Systems Inc. was founded in 2004 and is headquartered in Montreal, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H4S 0A9",
        "website": "http://www.haivision.com",
        "market_cap": "Small Cap"
    },
    "HAIVF": {
        "short_name": "HAIVISION SYSTEMS INC",
        "long_name": "Haivision Systems Inc.",
        "summary": "Haivision Systems Inc. provides infrastructure solutions for the video streaming market, and servicing enterprises and governments worldwide. It offers cloud series products; video encoders and decoders; transcoders and gateways; players and set-top boxes; enterprise video and signage solutions; recording and low latency viewing products; and Haivision Media Platform, an enterprise video solution, which provides tools for securely distribute internet protocol television channels. The company deployed approximately 70,000 systems to blue-chip end-clients through a combination of its direct sales force and channel partners. It serves broadcast, enterprise, government, house of worship, medical, and military and defense industries. The company was formerly known as Hajtek Vision Inc. and changed its name to Haivision Systems Inc. in June 2004. Haivision Systems Inc. was founded in 2004 and is headquartered in Montreal, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H4S 0A9",
        "website": "http://www.haivision.com",
        "market_cap": null
    },
    "INOTF": {
        "short_name": "PREDICTIV AI INC",
        "long_name": "Predictiv AI Inc.",
        "summary": "Predictiv AI Inc. provides software and solutions in the artificial intelligence and industrial internet of things markets in the United States, Europe, and Canada. It offers real-time advanced artificial intelligence based predictive road condition weather analytics for government, insurance, agriculture, public safety, fleet management, and outdoor event industries. Predictiv AI Inc. has a collaboration with the Waterloo Artificial Intelligence Institute at the University of Waterloo to pursue various innovations. The company was formerly known as Internet of Things Inc. and changed its name to Predictiv AI Inc. in August 2020. Predictiv AI Inc. is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5S 1S4",
        "website": "http://www.predictiv.ai",
        "market_cap": "Small Cap"
    },
    "IP.CN": {
        "short_name": "ImagineAR Inc.",
        "long_name": "ImagineAR Inc.",
        "summary": "ImagineAR Inc. provides an augmented reality (AR) platform that enables businesses, sports teams, and organizations to create and implement their own AR campaigns with no programming or technology experience. The company's products include ImagineAR Augmented Reality Platform that allows the choice of engagement by marker, location, and Web-based activation; ImagineAR.com, an AR-as-a-service platform for desktops; ImagineAR mobile app; ImagineAR SDK/API; ImagineAR Cloud, a centralized content management system, where AR is securely stored and managed; and WebAR services. It serves the retail, sports/live events, advertising/promotion, and fundraising industries. The company was formerly known as Imagination Park Technologies Inc. and changed its name to ImagineAR Inc. in April 2020. ImagineAR Inc. was incorporated in 2011 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 3B6",
        "website": "http://www.imaginear.com",
        "market_cap": "Small Cap"
    },
    "IPNFF": {
        "short_name": "IMAGINEAR INC",
        "long_name": "ImagineAR Inc.",
        "summary": "ImagineAR Inc. provides an augmented reality (AR) platform that enables businesses, sports teams, and organizations to create and implement their own AR campaigns with no programming or technology experience. The company's products include ImagineAR Augmented Reality Platform that allows the choice of engagement by marker, location, and Web-based activation; ImagineAR.com, an AR-as-a-service platform for desktops; ImagineAR mobile app; ImagineAR SDK/API; ImagineAR Cloud, a centralized content management system, where AR is securely stored and managed; and WebAR services. It serves the retail, sports/live events, advertising/promotion, and fundraising industries. The company was formerly known as Imagination Park Technologies Inc. and changed its name to ImagineAR Inc. in April 2020. ImagineAR Inc. was incorporated in 2011 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 3B6",
        "website": "http://www.imaginear.com",
        "market_cap": "Small Cap"
    },
    "ITLL": {
        "short_name": "INTELLIGENT CLOUD RES INC",
        "long_name": "Intelligent Cloud Resources Inc.",
        "summary": "Intelligent Cloud Resources Inc., a development stage company, focuses on providing cloud-enabler and cloud broker services primarily to small and medium sized organizations in Canada. It also focuses on building a private cloud for those enterprises that have security concerns for deploying their applications on a public cloud accessible to only those persons who work within their organization. The company intends to offer its services in the areas of cloud migration, infrastructure management, VoIP solution on cloud, cloud management, application development, and cloud enablement. Intelligent Cloud Resources Inc. was founded in 2014 and is based in Oakville, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Oakville",
        "zipcode": "L6J 7J9",
        "website": "http://www.intelligentcloudresources.com",
        "market_cap": "Small Cap"
    },
    "MTLO.V": {
        "short_name": "MARTELLO TECHNOLOGIES GROUP INC",
        "long_name": "Martello Technologies Group Inc.",
        "summary": "Martello Technologies Group Inc., along with its subsidiaries, develops and sells products and solutions that optimize the performance of real-time applications on cloud and enterprise networks. It offers Mitel Performance Analytics, which monitors the status and performance of Mitel and third-party systems in the network; Martello Gizmo, which measures, alerts, and reports on Microsoft 365 user experience; unified communications solution for network health testing; Martello iQ, a service monitoring and analytics platform; and Live Maps, a Windows authentication troubleshooting solution. The company also provides technical support and training services. It serves industries, such as education, government, healthcare, professional services, and remote work, as well as service providers in Canada and internationally. The company was incorporated in 1981 and is headquartered in Ottawa, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Ottawa",
        "zipcode": "K2K 0G7",
        "website": "http://martellotech.com",
        "market_cap": "Small Cap"
    },
    "NBVA.V": {
        "short_name": "NUBEVA TECHNOLOGIES LTD",
        "long_name": "Nubeva Technologies Ltd.",
        "summary": "Nubeva Technologies Ltd., together with its subsidiaries, develops software-as-a-service software and services that enable enterprises to run cybersecurity in the cloud in North America. It offers Nubeva Prisms SSL/TLS decryption solution that decrypts cloud traffic and enables security teams to monitor network traffic and data in motion for threats; Netflow/IPFIX network protocols designed to collect IP traffic information enabling enterprises to determine the source and destination of traffic and to analyze traffic to identify the cause of congestion or to detect intrusion; and Nubeva Prisms Services Processor, a cloud-native packet processor. Nubeva Technologies Ltd. was founded in 2016 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": null,
        "city": "Vancouver",
        "zipcode": "V6C 1H2",
        "website": "http://www.nubeva.com",
        "market_cap": "Small Cap"
    },
    "NBVAF": {
        "short_name": "NUBEVA TECHNOLOGIES LTD",
        "long_name": "Nubeva Technologies Ltd.",
        "summary": "Nubeva Technologies Ltd., together with its subsidiaries, develops software-as-a-service software and services that enable enterprises to run cybersecurity in the cloud in North America. It offers Nubeva Prisms SSL/TLS decryption solution that decrypts cloud traffic and enables security teams to monitor network traffic and data in motion for threats; Netflow/IPFIX network protocols designed to collect IP traffic information enabling enterprises to determine the source and destination of traffic and to analyze traffic to identify the cause of congestion or to detect intrusion; and Nubeva Prisms Services Processor, a cloud-native packet processor. Nubeva Technologies Ltd. was founded in 2016 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": null,
        "city": "Vancouver",
        "zipcode": "V6C 1H2",
        "website": "http://www.nubeva.com",
        "market_cap": "Small Cap"
    },
    "NC.CN": {
        "short_name": "NetCentsTech",
        "long_name": "NetCents Technology Inc.",
        "summary": "NetCents Technology Inc. provides electronic digital payment services in Canada and Europe. Its platform allows clients and merchants to manage electronic payments through various devices and currencies. The company provides cryptocurrency ecommerce payments, in-store payments, instant settlements, as well as card and exchange services. It also allow users to purchase digital currency, such as Bitcoin, Ethereum, and Litecoin. The company is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V3C 1E3",
        "website": "http://www.net-cents.com",
        "market_cap": "Small Cap"
    },
    "NTTCF": {
        "short_name": "NETCENTS TECHNOLOGY INC",
        "long_name": "NetCents Technology Inc.",
        "summary": "NetCents Technology Inc. provides electronic digital payment services in Canada and Europe. Its platform allows clients and merchants to manage electronic payments through various devices and currencies. The company provides cryptocurrency ecommerce payments, in-store payments, instant settlements, as well as card and exchange services. It also allow users to purchase digital currency, such as Bitcoin, Ethereum, and Litecoin. The company is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V3C 1E3",
        "website": "http://www.net-cents.com",
        "market_cap": "Small Cap"
    },
    "OPT.TO": {
        "short_name": "OPTIVA INC",
        "long_name": "Optiva Inc.",
        "summary": "Optiva Inc. provides cloud-native revenue management software to communication service providers (CSP) in Europe, the Middle East, Africa, North America, Latin America, the Caribbean, Asia, and the Pacific Rim. The company's monetization products enable real-time billing, charging, policy management, and user experience. Its solutions include Optiva Charging Engine, a convergent charging solution that helps CSPs to monetize platform; Optiva Business Support System Platform, an end-to-end cloud native converged charging and billing solutions on the private and public cloud; Policy Control, a data monetization for real-time applications for video streaming, interactive gaming, and voice over LTE; and Optiva Wholesale Settlement, a cloud-based solution that provides converged settlement and accurate interconnect billing. It also offers Optiva Payment solutions that include various payment methods, including voucher and voucher less payment and top-up solutions. The company was founded in 1999 and is headquartered in Mississauga, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Mississauga",
        "zipcode": "L5N 2X7",
        "website": "http://www.optiva.com",
        "market_cap": "Small Cap"
    },
    "OVT.V": {
        "short_name": "OCULUS VISIONTECH INC",
        "long_name": "Oculus VisionTech, Inc.",
        "summary": "Oculus VisionTech, Inc., a development-stage technology company, designs and markets digital watermarking services and solutions to business customers in the United States and Canada. Its products include Forget-Me-Yes (FMY), a data privacy software-as-a-service (SaaS) platform that enables secure discovery and delete requests against multiple data sources; Comply Trust SaaS Suite (CTSS), a set of software tools designed to address cloud-native data management and regulatory compliant data governance; and cloud-based document protection system (Cloud-DPS) technology, a SaaS-based document management platform for tamper-proof document authentication and protection. The company was formerly known as USA Video Interactive Corp. and changed its name to Oculus VisionTech, Inc. in January 2012. Oculus VisionTech, Inc. was incorporated in 1986 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 3N6",
        "website": "http://www.ovtz.com",
        "market_cap": "Small Cap"
    },
    "OVTZ": {
        "short_name": "OCULUS VISIONTECH INC",
        "long_name": "Oculus VisionTech, Inc.",
        "summary": "Oculus VisionTech, Inc., a development-stage technology company, designs and markets digital watermarking services and solutions to business customers in the United States and Canada. Its products include Forget-Me-Yes (FMY), a data privacy software-as-a-service (SaaS) platform that enables secure discovery and delete requests against multiple data sources; Comply Trust SaaS Suite (CTSS), a set of software tools designed to address cloud-native data management and regulatory compliant data governance; and cloud-based document protection system (Cloud-DPS) technology, a SaaS-based document management platform for tamper-proof document authentication and protection. The company was formerly known as USA Video Interactive Corp. and changed its name to Oculus VisionTech, Inc. in January 2012. Oculus VisionTech, Inc. was incorporated in 1986 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 3N6",
        "website": "http://www.ovtz.com",
        "market_cap": "Small Cap"
    },
    "PAI.V": {
        "short_name": "PREDICTIV AI INC",
        "long_name": "Predictiv AI Inc.",
        "summary": "Predictiv AI Inc. provides software and solutions in the artificial intelligence and industrial internet of things markets in the United States, Europe, and Canada. It offers real-time advanced artificial intelligence based predictive road condition weather analytics for government, insurance, agriculture, public safety, fleet management, and outdoor event industries. Predictiv AI Inc. has a collaboration with the Waterloo Artificial Intelligence Institute at the University of Waterloo to pursue various innovations. The company was formerly known as Internet of Things Inc. and changed its name to Predictiv AI Inc. in August 2020. Predictiv AI Inc. is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5S 1S4",
        "website": "http://www.predictiv.ai",
        "market_cap": "Small Cap"
    },
    "PERK.CN": {
        "short_name": "Perk Labs Inc.",
        "long_name": "Perk Labs Inc.",
        "summary": "Perk Labs Inc. owns and operates a mobile ordering, contactless payments, and loyalty app in Canada and the United States. Its products include Perk Hero, a digital loyalty management platform that enables merchants to provide their customers with digital rewards and a more engaging and convenient customer experience; and Glance Pay mobile payments application. The company was formerly known as Glance Technologies Inc. and changed its name to Perk Labs Inc. in February 2020. Perk Labs Inc. is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V7X 1M9",
        "website": "http://perklabs.io",
        "market_cap": "Small Cap"
    },
    "PKLB.F": {
        "short_name": "PERK LABS INC.  O.N.",
        "long_name": "Perk Labs Inc.",
        "summary": "Perk Labs Inc. owns and operates a mobile ordering, contactless payments, and loyalty app in Canada and the United States. Its products include Perk Hero, a digital loyalty management platform that enables merchants to provide their customers with digital rewards and a more engaging and convenient customer experience; and Glance Pay mobile payments application. The company was formerly known as Glance Technologies Inc. and changed its name to Perk Labs Inc. in February 2020. Perk Labs Inc. is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V7X 1M9",
        "website": "http://perklabs.io",
        "market_cap": "Small Cap"
    },
    "PKLBF": {
        "short_name": "PERK LABS INC",
        "long_name": "Perk Labs Inc.",
        "summary": "Perk Labs Inc. owns and operates a mobile ordering, contactless payments, and loyalty app in Canada and the United States. Its products include Perk Hero, a digital loyalty management platform that enables merchants to provide their customers with digital rewards and a more engaging and convenient customer experience; and Glance Pay mobile payments application. The company was formerly known as Glance Technologies Inc. and changed its name to Perk Labs Inc. in February 2020. Perk Labs Inc. is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V7X 1M9",
        "website": "http://perklabs.io",
        "market_cap": "Small Cap"
    },
    "PLCKF": {
        "short_name": "PLURILOCK SECURITY INC",
        "long_name": "Plurilock Security Inc.",
        "summary": "Plurilock Security Solutions Inc., an identity-centric cybersecurity company, provides multi-factor authentication solutions using behavioral-biometric, environmental, and contextual technologies. The company offers Plurilock ADAPT, an augmented behavioral biometrics, which provides out-of-band multi-factor authentication by analyzing identity signals; and Plurilock DEFEND, a patented behavioral biometrics that recognizes users by the way they work. It serves financial services, healthcare, critical infrastructure, and government and military industries. The company is headquartered in Victoria, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Victoria",
        "zipcode": "V8W 1H2",
        "website": "http://www.plurilock.com",
        "market_cap": "Small Cap"
    },
    "PLUR.V": {
        "short_name": "PLURILOCK SECURITYINC",
        "long_name": "Plurilock Security Inc.",
        "summary": "Plurilock Security Solutions Inc., an identity-centric cybersecurity company, provides multi-factor authentication solutions using behavioral-biometric, environmental, and contextual technologies. The company offers Plurilock ADAPT, an augmented behavioral biometrics, which provides out-of-band multi-factor authentication by analyzing identity signals; and Plurilock DEFEND, a patented behavioral biometrics that recognizes users by the way they work. It serves financial services, healthcare, critical infrastructure, and government and military industries. The company is headquartered in Victoria, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Victoria",
        "zipcode": "V8W 1H2",
        "website": "http://www.plurilock.com",
        "market_cap": "Small Cap"
    },
    "PLYZ": {
        "short_name": "PLYZER TECHNOLOGIES INC",
        "long_name": "Plyzer Technologies Inc.",
        "summary": "Plyzer Technologies Inc., through its subsidiaries, provides custom, real-time, cloud-based business intelligence solutions for brands to analyze critical online price and market data. Its customizable dashboard enables country, regional and local sales, production, and logistics operations to adapt to prevailing market conditions. The company was formerly known as ZD Ventures Corporation and changed its name to Plyzer Technologies Inc. in March 2017. Plyzer Technologies Inc. was founded in 2005 and is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5R 2G3",
        "website": "http://plyzertechnologies.com",
        "market_cap": "Small Cap"
    },
    "RACMF": {
        "short_name": "FOBI AI INC",
        "long_name": "Fobi Ai Inc.",
        "summary": "Fobi Ai Inc., a technology company, engages in the development of automated artificial intelligence marketing platform for bricks and mortar retailers. The company offers various brands and retailers with the solutions to interconnect their physical and digital ecosystems by using the Loop device that helps in plugging into various point of sale environments that are independent of hardware or IT networks. It also provides Fobi, an automated plug and play system that seamlessly integrates with existing infrastructure to personalize consumer's physical and digital journeys; and predictive analytics and insights. The company was formerly known as Loop Insights Inc. Fobi Ai Inc. is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2C2",
        "website": "http://www.fobi.ai",
        "market_cap": "Small Cap"
    },
    "RE6B.F": {
        "short_name": "OPTIVA INC.",
        "long_name": "Optiva Inc.",
        "summary": "Optiva Inc. provides cloud-native revenue management software to communication service providers (CSP) in Europe, the Middle East, Africa, North America, Latin America, the Caribbean, Asia, and the Pacific Rim. The company's monetization products enable real-time billing, charging, policy management, and user experience. Its solutions include Optiva Charging Engine, a convergent charging solution that helps CSPs to monetize platform; Optiva Business Support System Platform, an end-to-end cloud native converged charging and billing solutions on the private and public cloud; Policy Control, a data monetization for real-time applications for video streaming, interactive gaming, and voice over LTE; and Optiva Wholesale Settlement, a cloud-based solution that provides converged settlement and accurate interconnect billing. It also offers Optiva Payment solutions that include various payment methods, including voucher and voucher less payment and top-up solutions. The company was founded in 1999 and is headquartered in Mississauga, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Mississauga",
        "zipcode": "L5N 2X7",
        "website": "http://www.optiva.com",
        "market_cap": "Small Cap"
    },
    "RI1.F": {
        "short_name": "BLACKBERRY LTD",
        "long_name": "BlackBerry Limited",
        "summary": "BlackBerry Limited provides intelligent security software and services to enterprises and governments worldwide. The company leverages artificial intelligence and machine learning to deliver solutions in the areas of cybersecurity, safety, and data privacy; and endpoint security management, encryption, and embedded systems. It offers BlackBerry Spark software platform that includes a suite of security software products and services comprising BlackBerry UEM, BlackBerry Dynamics, and BlackBerry Workspaces solutions; and BlackBerry Spark SDK to promote the evolution of a platform ecosystem by enabling enterprise and independent software vendor developers to integrate the security features of BlackBerry Spark into their own mobile and web applications. The company also provides BlackBerry Internet of Things (IoT) solutions, including BlackBerry QNX, BlackBerry Certicom, BlackBerry Radar, BlackBerry Jarvis, BlackBerry AtHoc, BlackBerry Alert, SecuSUITE, and other IoT applications. As of February 28, 2021, it owned approximately 38,000 worldwide patents and applications. The company has a partnership with the University of Windsor to develop and deliver a cybersecurity curriculum for the university's graduate master's program in applied computing; and an agreement with Amazon Web Services, Inc. to develop and market BlackBerry's IVY, an intelligent vehicle data platform. The company was formerly known as Research In Motion Limited and changed its name to BlackBerry Limited in July 2013. BlackBerry Limited was incorporated in 1984 and is headquartered in Waterloo, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Waterloo",
        "zipcode": "N2K 0A7",
        "website": "http://www.blackberry.com",
        "market_cap": "Mid Cap"
    },
    "RKNEF": {
        "short_name": "OPTIVA INC",
        "long_name": "Optiva Inc.",
        "summary": "Optiva Inc. provides cloud-native revenue management software to communication service providers (CSP) in Europe, the Middle East, Africa, North America, Latin America, the Caribbean, Asia, and the Pacific Rim. The company's monetization products enable real-time billing, charging, policy management, and user experience. Its solutions include Optiva Charging Engine, a convergent charging solution that helps CSPs to monetize platform; Optiva Business Support System Platform, an end-to-end cloud native converged charging and billing solutions on the private and public cloud; Policy Control, a data monetization for real-time applications for video streaming, interactive gaming, and voice over LTE; and Optiva Wholesale Settlement, a cloud-based solution that provides converged settlement and accurate interconnect billing. It also offers Optiva Payment solutions that include various payment methods, including voucher and voucher less payment and top-up solutions. The company was founded in 1999 and is headquartered in Mississauga, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Mississauga",
        "zipcode": "L5N 2X7",
        "website": "http://www.optiva.com",
        "market_cap": "Small Cap"
    },
    "S8W3.F": {
        "short_name": "VENZEE TECHNOLOGIES INC.",
        "long_name": "Venzee Technologies Inc.",
        "summary": "Venzee Technologies Inc. develops and markets a cloud-based platform for suppliers and manufactures in various industries to share their product information and inventory updates in real-time with their retailers under the Mesh Connectors name. It operates in the United States and internationally. The company is based in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 2Z4",
        "website": "http://www.venzee.com",
        "market_cap": "Small Cap"
    },
    "SAMOF": {
        "short_name": "SANGOMA TECHNOLOGIES CORPORATIO",
        "long_name": "Sangoma Technologies Corporation",
        "summary": "Sangoma Technologies Corporation develops, manufactures, distributes, and supports voice and data connectivity components for software-based communication applications worldwide. The company offers Switchvox, a business phone system; PBXact, a phone system; Internet protocol (IP) phones; service provider and voice over Internet protocol gateways; Switchvox Cloud, a unified communications solution; SIPstation SIP Trunking, a hosted session initiation protocol trunking service; PBXact Cloud, a cloud based private branch exchange service; and FAXStation, a fax-over-IP solution. It also provides session border controllers; telephony and media transcoding cards; and open source communications software. The company serves small and medium sized businesses, enterprises, original equipment manufacturers, carriers, and service providers. Sangoma Technologies Corporation was founded in 1984 and is headquartered in Markham, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Markham",
        "zipcode": "L3R 9R6",
        "website": "http://www.sangoma.com",
        "market_cap": "Small Cap"
    },
    "SCT.V": {
        "short_name": "SKYCHAIN TECHNOLOGIES INC",
        "long_name": "Skychain Technologies Inc.",
        "summary": "Skychain Technologies Inc. provides blockchain infrastructure services and power solutions to cryptominers. It offers warehouse space, low-cost electricity, and maintenance and hosting services. The company was formerly known as Green Valley Mine Incorporated and changed its name to Skychain Technologies Inc. in September 2018. Skychain Technologies Inc. was incorporated in 1977 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 2S1",
        "website": "http://www.skychaintechnologiesinc.com",
        "market_cap": "Small Cap"
    },
    "SKKY": {
        "short_name": "SKKYNET CLOUD SYSTEMS INC",
        "long_name": "Skkynet Cloud Systems, Inc.",
        "summary": "Skkynet Cloud Systems, Inc., an industrial middleware vendor, provides connectivity and data acquisition to various industrial and office hardware and software products worldwide. The company offers DataHub software that includes applications for real-time graphical Web display of data; connecting data from open process control, dynamic data exchange, and Modbus servers to analyze the status of factory production, embedded systems, or financial strategies; connecting data from MQTT clients to connect remote sensors and other cloud-based services; and data mirroring. Its DataHub software is also used for data logging that enables reading and writing of data with various open database connectivity; creating a data bridging interface to permit association of data points in another control system; providing historical data for QuickTrend and WebView trend displays; data redundancy features; and network system monitoring. In addition, the company offers SkkyHub, a software-as-a-service portal for industrial clients; Embedded Toolkit, a seamless and end-to-end solution that provides a direct link to SkkyHub from various devices and operating systems for M2M and viewing customer data from device on the Internet; and VINE products for financial clients. Further, it provides software support program renewal, legacy installation support, and custom integration and development services. The company serves customers in aerospace, automation and control, chemical, communication, education, engineering, energy and utility, financial, food and beverage, government and municipal, healthcare and pharmaceutical, instrumentation, manufacturing, natural resource, and system integrator industries directly, as well as through resellers. Skkynet Cloud Systems, Inc. was founded in 2011 and is headquartered in Mississauga, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Mississauga",
        "zipcode": "L5N 2X7",
        "website": "http://skkynet.com",
        "market_cap": "Small Cap"
    },
    "SKTCF": {
        "short_name": "SKYCHAIN TECHNOLOGIES INC",
        "long_name": "Skychain Technologies Inc.",
        "summary": "Skychain Technologies Inc. provides blockchain infrastructure services and power solutions to cryptominers. It offers warehouse space, low-cost electricity, and maintenance and hosting services. The company was formerly known as Green Valley Mine Incorporated and changed its name to Skychain Technologies Inc. in September 2018. Skychain Technologies Inc. was incorporated in 1977 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 2S1",
        "website": "http://www.skychaintechnologiesinc.com",
        "market_cap": "Small Cap"
    },
    "SLXXF": {
        "short_name": "FINTECH SELECT LTD",
        "long_name": "Fintech Select Ltd.",
        "summary": "Fintech Select Ltd. provides financial payment services and solutions in Canada. The company operates through three segments: Distribution, Call Center, and Financial and Payment Services. It offers MasterCard and Visa prepaid card programs for various corporate and government organizations. The company's MasterCard branded card program serves a point of sale (POS) footprint, which allows consumers to activate, fund, and reload their cards. It also offers customized or turnkey private label card solutions for various programs and sales verticals, including government disbursements, incentives and rewards, payroll, mobile subscribers, general purpose re-loadable, retail gift, healthcare, travel, transit, loyalty, open or closed loop, and others. The company's mobile banking solutions include peer-to-peer micro lending, bill payment, remittance, and other financial features. In addition, it offers a POS cryptocurrency solution for buying and or selling cryptocurrencies through its retail partners, as well as e-wallet and online payment solutions. The company was formerly known as Selectcore Ltd. and changed its name to Fintech Select Ltd. in August 2017. Fintech Select Ltd. was founded in 1999 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "L4K 4M2",
        "website": "http://www.fintechselect.com",
        "market_cap": "Small Cap"
    },
    "SNSFF": {
        "short_name": "VENZEE TECHNOLOGIES INC",
        "long_name": "Venzee Technologies Inc.",
        "summary": "Venzee Technologies Inc. develops and markets a cloud-based platform for suppliers and manufactures in various industries to share their product information and inventory updates in real-time with their retailers under the Mesh Connectors name. It operates in the United States and internationally. The company is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 2Z4",
        "website": "http://www.venzee.com",
        "market_cap": "Small Cap"
    },
    "SRBBF": {
        "short_name": "VPN TECHNOLOGIES INC",
        "long_name": "VPN Technologies Inc.",
        "summary": "VPN Technologies Inc. develops, acquires, operates, and manages software as a service (SaaS) business in Canada. The company offers GamerVPN.com that provides secure virtual private network (VPN) connections to various online games; and BladeVPN.com, a premium VPN, which offers unlimited VPN servers worldwide for both individuals and business customers. It also provides WebinarIgnition, a plug-in for WordPress that enables users to deploy live or prerecorded webinars, and charge viewers through the integrated payment system; and Gingerly, a cloud-based business management suite and dashboard offering a portfolio of a la carte business management applications for solopreneurs and small- and medium-sized enterprises. In addition, the company offers bContact, a cloud-based business management solution that provides integrated business management tools, including customer relationship management, accounting, banking, invoicing, billing, and quotation for small and medium sized organizations; ServerHawk.com, a SaaS Website analysis, SEO, and marketing tool for marketing professionals, business owners, and Web developers; and FileQ.com, an electronic file sharing and storage service that enable users to access content in real time. Further, it provides SiteSafe.io, an Internet security service that assists IT professionals in maintaining and managing networks, including the detection of viruses, worms, Trojans, and other malware injected on Websites; and LenderTech.com, a cloud based SaaS loan management utility solution for banks, financial institutions, mortgage lending facilitators, and micro-finance lenders. The company was formerly known as Subscribe Technologies Inc. and changed its name to VPN Technologies Inc. in February 2020. VPN Technologies Inc. was incorporated in 2010 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2T7",
        "website": "http://www.vpntech.ca",
        "market_cap": "Small Cap"
    },
    "STC.V": {
        "short_name": "Sangoma Technologies Corporatio",
        "long_name": "Sangoma Technologies Corporation",
        "summary": "Sangoma Technologies Corporation develops, manufactures, distributes, and supports voice and data connectivity components for software-based communication applications worldwide. The company offers Switchvox, a business phone system; PBXact, a phone system; Internet protocol (IP) phones; service provider and voice over Internet protocol gateways; Switchvox Cloud, a unified communications solution; SIPstation SIP Trunking, a hosted session initiation protocol trunking service; PBXact Cloud, a cloud based private branch exchange service; and FAXStation, a fax-over-IP solution. It also provides session border controllers; telephony and media transcoding cards; and open source communications software. The company serves small and medium sized businesses, enterprises, original equipment manufacturers, carriers, and service providers. Sangoma Technologies Corporation was founded in 1984 and is headquartered in Markham, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Markham",
        "zipcode": "L3R 9R6",
        "website": "http://www.sangoma.com",
        "market_cap": "Small Cap"
    },
    "TAAL.CN": {
        "short_name": "TaalDistInfo",
        "long_name": "Taal Distributed Information Technologies Inc.",
        "summary": "Taal Distributed Information Technologies Inc., through its subsidiaries, provides blockchain infrastructure and transactional platforms to support businesses building solutions and applications in Canada, Kazakhstan, and Cayman Island. It also engages in the developing, operating, and managing distributed computing systems for enterprise users. The company was formerly known as Squire Mining Ltd. and changed its name to Taal Distributed Information Technologies Inc. in December 2019. Taal Distributed Information Technologies Inc. was incorporated in 2011 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V7X 1L3",
        "website": "http://www.taal.com",
        "market_cap": "Small Cap"
    },
    "TAALF": {
        "short_name": "TAAL DISTRIBUTED INFRMTION TECH",
        "long_name": "Taal Distributed Information Technologies Inc.",
        "summary": "Taal Distributed Information Technologies Inc., through its subsidiaries, provides blockchain infrastructure and transactional platforms to support businesses building solutions and applications in Canada, Kazakhstan, and Cayman Island. It also engages in the developing, operating, and managing distributed computing systems for enterprise users. The company was formerly known as Squire Mining Ltd. and changed its name to Taal Distributed Information Technologies Inc. in December 2019. Taal Distributed Information Technologies Inc. was incorporated in 2011 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V7X 1L3",
        "website": "http://www.taal.com",
        "market_cap": "Small Cap"
    },
    "TBIX.V": {
        "short_name": "TRUSTBIX INC",
        "long_name": "TrustBIX Inc.",
        "summary": "TrustBIX Inc. provides information solutions for the livestock industry in Canada, the United States, China, and Mexico. The company is involved in the sale, installation, and support of software and computer systems for auction markets and livestock dealers; software for livestock feedlots; and data capture and carcass grading systems for pork plants, as well as Business Infoxchange (BIX). It also provides internet-based applications that provide animal tracking and management. TrustBIX Inc. is based in Edmonton, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Edmonton",
        "zipcode": "T6A 3N2",
        "website": "http://www.trustbix.com",
        "market_cap": "Small Cap"
    },
    "TC.TO": {
        "short_name": "TUCOWS INC.",
        "long_name": "Tucows Inc.",
        "summary": "Tucows Inc. provides network access, domain name registration, email, mobile telephony, and other Internet services in Canada, the United States, and Europe. It operates through two segments, Network Access Services and Domain Services. The Network Access Services segment offers mobile phones and retail telephony services; fixed high-speed Internet access services; and professional services, including implementation, training, consulting, and software development and modification services, as well as operates Mobile Services Enabler platform that provides network access, provisioning, and billing services; The Domain Services segment offers wholesale and retail domain name registration services; portfolio services; and value-added services, such as hosted email, Internet security services, Internet hosting, WHOIS privacy, publishing tools, and other value-added services for end-users under the OpenSRS, eNom, Ascio, and Hover brands. The company was formerly known as Infonautics, Inc. and changed its name to Tucows Inc. in August 2001. Tucows Inc. was incorporated in 1992 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M6K 3M1",
        "website": "http://www.tucows.com",
        "market_cap": "Small Cap"
    },
    "TCX": {
        "short_name": "Tucows Inc.",
        "long_name": "Tucows Inc.",
        "summary": "Tucows Inc. provides network access, domain name registration, email, mobile telephony, and other Internet services in Canada, the United States, and Europe. It operates through two segments, Network Access Services and Domain Services. The Network Access Services segment offers mobile phones and retail telephony services; fixed high-speed Internet access services; and professional services, including implementation, training, consulting, and software development and modification services, as well as operates Mobile Services Enabler platform that provides network access, provisioning, and billing services; The Domain Services segment offers wholesale and retail domain name registration services; portfolio services; and value-added services, such as hosted email, Internet security services, Internet hosting, WHOIS privacy, publishing tools, and other value-added services for end-users under the OpenSRS, eNom, Ascio, and Hover brands. The company was formerly known as Infonautics, Inc. and changed its name to Tucows Inc. in August 2001. Tucows Inc. was incorporated in 1992 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M6K 3M1",
        "website": "http://www.tucows.com",
        "market_cap": "Small Cap"
    },
    "TECX.CN": {
        "short_name": "TechXTech",
        "long_name": "TechX Technologies Inc.",
        "summary": "TechX Technologies Inc. focuses on emerging technologies across crypto, blockchain, artificial intelligence, IOT, and cloud based technologies sectors. The company was formerly known as LiteLink Technologies Inc. and changed its name to TechX Technologies Inc. in February 2021. TechX Technologies Inc. is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 4H1",
        "website": "http://www.tech-x.io",
        "market_cap": "Small Cap"
    },
    "TECXF": {
        "short_name": "TECHX TECHNOLOGIES INC",
        "long_name": "TechX Technologies Inc.",
        "summary": "TechX Technologies Inc. focuses on emerging technologies across crypto, blockchain, artificial intelligence, IOT, and cloud based technologies sectors. The company was formerly known as LiteLink Technologies Inc. and changed its name to TechX Technologies Inc. in February 2021. TechX Technologies Inc. is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 4H1",
        "website": "http://www.tech-x.io",
        "market_cap": "Small Cap"
    },
    "TIXT": {
        "short_name": "TELUS International (Cda) Inc. ",
        "long_name": "TELUS International (Cda) Inc.",
        "summary": "TELUS International (Cda) Inc. provides customer experience and digital business services in Europe, North America, the Asia-Pacific, and the Central America. It offers digital experience solutions, such as AI and bots, omnichannel CX, mobility solutions, cloud contact center, big data, platform transformation, and UX/UI design; and customer experience solutions, including work anywhere/work from home, customer care, technical support, sales growth and retention, and healthcare/patient experience. The company also provides IT lifecycle services comprising cloud and platform services, app dev and management, quality assurance and testing, system operations, IT service desk, internet of things, engineering solutions, and enterprise platform services; advisory services consisting of digital strategy, CX process consulting, data and customer analytics, workforce management, learning excellence solutions, and business and process transformation; robotic process automation, talent acquisition, finance and accounting, and supply chain management; and content moderation and social media, and fraud prevention and detection. It serves tech and games, communications and media, ecommerce and fintech, healthcare, and travel and hospitality industries. The company was founded in 2005 and is headquartered in Vancouver, Canada. TELUS International (Cda) Inc. is a subsidiary of TELUS Communications Inc.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 0M3",
        "website": "http://www.telusinternational.com",
        "market_cap": "Mid Cap"
    },
    "TIXT.TO": {
        "short_name": "TELUS INTERNATIONAL CDA INC",
        "long_name": "TELUS International (Cda) Inc.",
        "summary": "TELUS International (Cda) Inc. provides customer experience and digital business services in Europe, North America, the Asia-Pacific, and the Central America. It offers digital experience solutions, such as AI and bots, omnichannel CX, mobility solutions, cloud contact center, big data, platform transformation, and UX/UI design; and customer experience solutions, including work anywhere/work from home, customer care, technical support, sales growth and retention, and healthcare/patient experience. The company also provides IT lifecycle services comprising cloud and platform services, app dev and management, quality assurance and testing, system operations, IT service desk, internet of things, engineering solutions, and enterprise platform services; advisory services consisting of digital strategy, CX process consulting, data and customer analytics, workforce management, learning excellence solutions, and business and process transformation; robotic process automation, talent acquisition, finance and accounting, and supply chain management; and content moderation and social media, and fraud prevention and detection. It serves tech and games, communications and media, ecommerce and fintech, healthcare, and travel and hospitality industries. The company was founded in 2005 and is headquartered in Vancouver, Canada. TELUS International (Cda) Inc. is a subsidiary of TELUS Communications Inc.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 0M3",
        "website": "http://www.telusinternational.com",
        "market_cap": "Mid Cap"
    },
    "TOI.V": {
        "short_name": "TOPICUS COM INC",
        "long_name": "Topicus.com Inc.",
        "summary": "Topicus.com Inc. provides vertical market software and vertical market platforms in Europe. The company acquires, builds, and manages various vertical market software businesses, which offer software solutions that address the particular needs of customers. It serves accountancy, agriculture, associations, automotive, central government, education, facility management, finance, healthcare, hospitality, legal, local government, manufacturing, mobility, real estate, and retail vertical markets. The company was incorporated in 2020 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5C 2T6",
        "website": "http://www.topicus.com",
        "market_cap": "Mid Cap"
    },
    "TOITF": {
        "short_name": "TOPICUS COM INC",
        "long_name": "Topicus.com Inc.",
        "summary": "Topicus.com Inc. provides vertical market software and vertical market platforms in Europe. The company acquires, builds, and manages various vertical market software businesses, which offer software solutions that address the particular needs of customers. It serves accountancy, agriculture, associations, automotive, central government, education, facility management, finance, healthcare, hospitality, legal, local government, manufacturing, mobility, real estate, and retail vertical markets. The company was incorporated in 2020 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5C 2T6",
        "website": "http://www.topicus.com",
        "market_cap": "Mid Cap"
    },
    "TUQ1.F": {
        "short_name": "TUCOWS INC.",
        "long_name": "Tucows Inc.",
        "summary": "Tucows Inc. provides network access, domain name registration, email, mobile telephony, and other Internet services in Canada, the United States, and Europe. It operates through two segments, Network Access Services and Domain Services. The Network Access Services segment offers mobile phones and retail telephony services; fixed high-speed Internet access services; and professional services, including implementation, training, consulting, and software development and modification services, as well as operates Mobile Services Enabler platform that provides network access, provisioning, and billing services; The Domain Services segment offers wholesale and retail domain name registration services; portfolio services; and value-added services, such as hosted email, Internet security services, Internet hosting, WHOIS privacy, publishing tools, and other value-added services for end-users under the OpenSRS, eNom, Ascio, and Hover brands. The company was formerly known as Infonautics, Inc. and changed its name to Tucows Inc. in August 2001. Tucows Inc. was incorporated in 1992 and is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M6K 3M1",
        "website": "http://www.tucows.com",
        "market_cap": "Small Cap"
    },
    "USF1.F": {
        "short_name": "OCULUS VISIONTECH",
        "long_name": "Oculus VisionTech, Inc.",
        "summary": "Oculus VisionTech, Inc., a development-stage technology company, designs and markets digital watermarking services and solutions to business customers in the United States and Canada. Its products include Forget-Me-Yes (FMY), a data privacy software-as-a-service (SaaS) platform that enables secure discovery and delete requests against multiple data sources; Comply Trust SaaS Suite (CTSS), a set of software tools designed to address cloud-native data management and regulatory compliant data governance; and cloud-based document protection system (Cloud-DPS) technology, a SaaS-based document management platform for tamper-proof document authentication and protection. The company was formerly known as USA Video Interactive Corp. and changed its name to Oculus VisionTech, Inc. in January 2012. Oculus VisionTech, Inc. was incorporated in 1986 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 3N6",
        "website": "http://www.ovtz.com",
        "market_cap": "Small Cap"
    },
    "VENZ.V": {
        "short_name": "VENZEE TECHNOLOGIES INC",
        "long_name": "Venzee Technologies Inc.",
        "summary": "Venzee Technologies Inc. develops and markets a cloud-based platform for suppliers and manufactures in various industries to share their product information and inventory updates in real-time with their retailers under the Mesh Connectors name. It operates in the United States and internationally. The company is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 2Z4",
        "website": "http://www.venzee.com",
        "market_cap": "Small Cap"
    },
    "VPN.CN": {
        "short_name": "VPNTechInc",
        "long_name": "VPN Technologies Inc.",
        "summary": "VPN Technologies Inc. develops, acquires, operates, and manages software as a service (SaaS) business in Canada. The company offers GamerVPN.com that provides secure virtual private network (VPN) connections to various online games; and BladeVPN.com, a premium VPN, which offers unlimited VPN servers worldwide for both individuals and business customers. It also provides WebinarIgnition, a plug-in for WordPress that enables users to deploy live or prerecorded webinars, and charge viewers through the integrated payment system; and Gingerly, a cloud-based business management suite and dashboard offering a portfolio of a la carte business management applications for solopreneurs and small- and medium-sized enterprises. In addition, the company offers bContact, a cloud-based business management solution that provides integrated business management tools, including customer relationship management, accounting, banking, invoicing, billing, and quotation for small and medium sized organizations; ServerHawk.com, a SaaS Website analysis, SEO, and marketing tool for marketing professionals, business owners, and Web developers; and FileQ.com, an electronic file sharing and storage service that enable users to access content in real time. Further, it provides SiteSafe.io, an Internet security service that assists IT professionals in maintaining and managing networks, including the detection of viruses, worms, Trojans, and other malware injected on Websites; and LenderTech.com, a cloud based SaaS loan management utility solution for banks, financial institutions, mortgage lending facilitators, and micro-finance lenders. The company was formerly known as Subscribe Technologies Inc. and changed its name to VPN Technologies Inc. in February 2020. VPN Technologies Inc. was incorporated in 2010 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2T7",
        "website": "http://www.vpntech.ca",
        "market_cap": "Small Cap"
    },
    "Z1S1.F": {
        "short_name": "FINTECH SELECT",
        "long_name": "Fintech Select Ltd.",
        "summary": "Fintech Select Ltd. provides financial payment services and solutions in Canada. The company operates through three segments: Distribution, Call Center, and Financial and Payment Services. It offers MasterCard and Visa prepaid card programs for various corporate and government organizations. The company's MasterCard branded card program serves a point of sale (POS) footprint, which allows consumers to activate, fund, and reload their cards. It also offers customized or turnkey private label card solutions for various programs and sales verticals, including government disbursements, incentives and rewards, payroll, mobile subscribers, general purpose re-loadable, retail gift, healthcare, travel, transit, loyalty, open or closed loop, and others. The company's mobile banking solutions include peer-to-peer micro lending, bill payment, remittance, and other financial features. In addition, it offers a POS cryptocurrency solution for buying and or selling cryptocurrencies through its retail partners, as well as e-wallet and online payment solutions. The company was formerly known as Selectcore Ltd. and changed its name to Fintech Select Ltd. in August 2017. Fintech Select Ltd. was founded in 1999 and is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "L4K 4M2",
        "website": "http://www.fintechselect.com",
        "market_cap": "Small Cap"
    }
}