{
    "0BT1.SG": {
        "short_name": "BacTech Environmental Corp. Reg",
        "long_name": "BacTech Environmental Corporation",
        "summary": "BacTech Environmental Corporation operates as an environmental technology company. It develops and commercializes BACOX, a proprietary bioleaching technology for the reclamation of mine tailings. The company's technology utilizes bacteria to extract precious and base metals, as well as to treat difficult-to-treat sulphide ores and concentrates. It holds a 100% interest in the Ecuador project. The company was incorporated in 2010 and is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5C 1E9",
        "website": "http://www.bactechgreen.com",
        "full_time_employees": null
    },
    "36E.F": {
        "short_name": "GFL ENVIRONM.(SUB.VT.SH.)",
        "long_name": "GFL Environmental Inc.",
        "summary": "GFL Environmental Inc. operates as a diversified environmental services company in Canada and the United States. The company offers non-hazardous solid waste management, infrastructure and soil remediation, and liquid waste management services. Its solid waste management business line includes the collection, transportation, transfer, recycling, and disposal of non-hazardous solid waste for municipal, residential, and commercial and industrial customers. The company's infrastructure and soil remediation business line provides remediation of contaminated soils, as well as complementary services, including civil, demolition, and excavation and shoring services. Its liquid waste management business collects, manages, transports, processes, and disposes of a range of industrial and commercial liquid wastes, as well as resells liquid waste products. The company was founded in 2007 and is headquartered in Vaughan, Canada.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Vaughan",
        "zipcode": "L4K 0H9",
        "website": "http://gflenv.com",
        "full_time_employees": 15475
    },
    "AWWI": {
        "short_name": "ALPHA WASTEWATER INC",
        "long_name": "Alpha Wastewater, Inc.",
        "summary": "Alpha Wastewater, Inc., an environmental management, manufacturing, and technology company, focuses on wastewater treatment primarily water recycling. It owns a license to manufacture, assemble, advertise, promote, sell, and distribute a patented wastewater purification system in the People's Republic of China. The company has strategic alliance agreements with Renmin University of China School of Environment and Natural Resources, as well as with Shandong Provincial Urban Construction Design Institute. Alpha Wastewater, Inc. was founded in 2009 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V7Y 1C6",
        "website": "http://www.alphawastewater.com",
        "full_time_employees": 2
    },
    "BAC.CN": {
        "short_name": "BacTechEnviron",
        "long_name": "BacTech Environmental Corporation",
        "summary": "BacTech Environmental Corporation operates as an environmental technology company. It develops and commercializes BACOX, a proprietary bioleaching technology for the reclamation of mine tailings. The company's technology utilizes bacteria to extract precious and base metals, as well as to treat difficult-to-treat sulphide ores and concentrates. It holds a 100% interest in the Ecuador project. The company was incorporated in 2010 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5C 1E9",
        "website": "http://www.bactechgreen.com",
        "full_time_employees": null
    },
    "BCCEF": {
        "short_name": "BACTECH ENVIRONMENTAL CORP",
        "long_name": "BacTech Environmental Corporation",
        "summary": "BacTech Environmental Corporation operates as an environmental technology company. It develops and commercializes BACOX, a proprietary bioleaching technology for the reclamation of mine tailings. The company's technology utilizes bacteria to extract precious and base metals, as well as to treat difficult-to-treat sulphide ores and concentrates. It holds a 100% interest in the Ecuador project. The company was incorporated in 2010 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5C 1E9",
        "website": "http://www.bactechgreen.com",
        "full_time_employees": null
    },
    "BLM.V": {
        "short_name": "BLUMETRIC ENVIRONMENTAL INC",
        "long_name": "BluMetric Environmental Inc.",
        "summary": "BluMetric Environmental Inc. provides solution-oriented consultation, design, products, and construction services to clients with environmental issues in Canada and internationally. The company offers professional services in the fields of environmental geosciences and engineering, industrial hygiene, occupational health and safety, renewable energy, water and waste water treatment, and environmental contracting and management. Its professional services include environmental permitting and compliance, environmental reporting, environmental site assessments, geomatics and data management, industrial hygiene, management systems, physical hydrogeology and clean water, property assessments and environmental due diligence, waste management, and waterpower and hydraulic structures, as well as occupational health, and safety and ergonomics. The company also provides SROD - shipboard reverse osmosis desalinator systems; and ROWPU- reverse osmosis water purification units that produce drinking water from nearly water source. The company serves commercial and industrial customers, military, mining, and governments. BluMetric Environmental Inc. is headquartered in Ottawa, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Ottawa",
        "zipcode": "K2C 3R8",
        "website": "http://www.blumetric.ca",
        "full_time_employees": 160
    },
    "BQE.V": {
        "short_name": "BQE WATER INC",
        "long_name": "BQE Water Inc.",
        "summary": "BQE Water Inc., a water treatment company, provides wastewater treatment services to the mining and metallurgical industry in Canada, the United States, Mexico, Chile, China, and internationally. It offers water treatment solutions for mine drainage, run-off, waste rock seepage, tailings water, groundwater, and lime plant influent and/or effluent streams for treating metals, sulphate, selenium, nitrate, ammonia, and cyanide in the mining sector; smelting and refining services for treating metals and sulphate; and hydrometallurgy services for the treatment of metals, cyanide, and acids. The company's metal recovery and removal technologies include BioSulphide and ChemSulphide technologies, which use biological or chemical sources of sulphide to precipitate dissolved metals from mining wastewater; and Met-IX technology that treats wastewater. It also offers sulphate technologies, such as Sulf-IX and Sulf-IXC, which removes sulphate and hardness from wastewater; selenium removal technology, including Selen-IX that removes selenium from mining wastewater; and cyanide treatment technologies, such as SART, a process technology to remove the metallurgical interference of cyanide-soluble metals in gold cyanidation. The company was formerly known as BioteQ Environmental Technologies Inc. and changed its name to BQE Water Inc. in March 2017. BQE Water Inc. was founded in 1997 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6Z 2M4",
        "website": "http://www.bqewater.com",
        "full_time_employees": null
    },
    "C36.F": {
        "short_name": "CIELO WASTE SOLUT.",
        "long_name": "Cielo Waste Solutions Corp.",
        "summary": "Cielo Waste Solutions Corp. engages in refining landfill, and municipal and commercial waste into a renewable diesel in Canada. It uses landfill waste, tires, plastics, wood shavings, and paper products to produce renewable Kerosene, highway diesel, and naphtha. The company was formerly known as Cielo Gold Corp. and changed its name to Cielo Waste Solutions Corp. in August 2013. Cielo Waste Solutions Corp. was incorporated in 2011 and is headquartered in Red Deer, Canada.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "AB",
        "city": "Red Deer",
        "zipcode": "T4N 2L8",
        "website": "http://www.cielows.com",
        "full_time_employees": null
    },
    "CLI.V": {
        "short_name": "CLEARFORD WATER SYSTEMS INC",
        "long_name": "Clearford Water Systems Inc.",
        "summary": "Clearford Water Systems Inc., a water management company, provides unified water infrastructure solutions in Canada, the United States, India, and internationally. It operates in three segments: Waterworks, Water & Wastewater Infrastructure Delivery, and UV disinfection. The company offers Clearford One, a wastewater solution for the collection, conveyance and treatment of sewag; ClearDigest, an underground tanks that receive raw sewage from each connected source; ClearConvey, a network of small bore sewer pipes that carries liquids without any infiltration to an optimized facility for final treatment; and ClearRecover, a treatment facility. It also provides Clearford M-brane, a lifecycle solution for managed and decentralized water treatment; Clearford UV, which offers potable, wastewater, reuse, and rainwater disinfection systems; and Clearford Pay-for-Performance project financing program solutions. In addition, the company designs, manufactures, and sells ultraviolet purification systems using its patented Crossfire technology into the potable water, wastewater, reuse, and rainwater harvesting markets. Further, it provides water supply and wastewater treatment systems for small communities, as well as manufactures and supplies packaged treatment solutions, including containerized membrane plants for advanced water treatment. The company was formerly known as Clearford Industries Inc. and changed its name to Clearford Water Systems Inc. in June 2014. Clearford Water Systems Inc. is headquartered in Ottawa, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Ottawa",
        "zipcode": "K2K 3G4",
        "website": "http://www.clearford.com",
        "full_time_employees": 91
    },
    "CMC.CN": {
        "short_name": "CieloWaste Sol",
        "long_name": "Cielo Waste Solutions Corp.",
        "summary": "Cielo Waste Solutions Corp. engages in refining landfill, and municipal and commercial waste into a renewable diesel in Canada. It uses landfill waste, tires, plastics, wood shavings, and paper products to produce renewable Kerosene, highway diesel, and naphtha. The company was formerly known as Cielo Gold Corp. and changed its name to Cielo Waste Solutions Corp. in August 2013. Cielo Waste Solutions Corp. was incorporated in 2011 and is headquartered in Red Deer, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Red Deer",
        "zipcode": "T4N 2L8",
        "website": "http://www.cielows.com",
        "full_time_employees": null
    },
    "CRVYF": {
        "short_name": "CANADIAN OIL RECOVERY & REMEDIA",
        "long_name": "Canadian Oil Recovery & Remediation Enterprises Ltd.",
        "summary": "Canadian Oil Recovery & Remediation Enterprises Ltd. provides oil waste management solutions to the petroleum industry. The company's operating lines include remediating oil-contaminated soil; treating sludge, oil-based mud and drilling waste; oil recovery; industrial waste management; oil storage tank cleaning; oil and gas engineering, and project management. It serves customers in the upstream petroleum sector comprising oil production and drilling companies; and downstream petroleum sector, such as oil refinery, transportation, and distribution companies. Canadian Oil Recovery & Remediation Enterprises Ltd. has a strategic alliance with CANAR. The company is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 3L5",
        "website": "http://www.corre.com",
        "full_time_employees": null
    },
    "CTRNF": {
        "short_name": "CHAR TECHNOLOGIES LTD",
        "long_name": "CHAR Technologies Ltd.",
        "summary": "CHAR Technologies Ltd., a cleantech development and services company, engages in biocarbon development activity. It offers SulfaCHAR, a gas-cleaning solution that removes hydrogen sulfide from renewable natural gas; Cleanfyre, a carbon neutral coal replacement; and equipment for industrial air and water treatment. The company also provides environmental consulting services comprising environmental management, site investigation and remediation, engineering, and resource services. It serves food and beverage, industrial, and renewable gas project customers. CHAR Technologies Ltd. was founded in 2011 and is headquartered in North York, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "North York",
        "zipcode": "M3C 1T5",
        "website": "http://www.chartechnologies.com",
        "full_time_employees": null
    },
    "CWSFF": {
        "short_name": "CIELO WASTE SOLUTIONS CORP",
        "long_name": "Cielo Waste Solutions Corp.",
        "summary": "Cielo Waste Solutions Corp. engages in refining landfill, and municipal and commercial waste into a renewable diesel in Canada. It uses landfill waste, tires, plastics, wood shavings, and paper products to produce renewable Kerosene, highway diesel, and naphtha. The company was formerly known as Cielo Gold Corp. and changed its name to Cielo Waste Solutions Corp. in August 2013. Cielo Waste Solutions Corp. was incorporated in 2011 and is headquartered in Red Deer, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Red Deer",
        "zipcode": "T4N 2L8",
        "website": "http://www.cielows.com",
        "full_time_employees": null
    },
    "EAATF": {
        "short_name": "EARTHWORKS INDUSTRIES INC",
        "long_name": "Earthworks Industries Inc.",
        "summary": "Earthworks Industries Inc., a development stage company, focuses on providing waste disposal services for private and public sectors in Canada and the United States. It designs, constructs, and operates an integrated waste handling facility on 443 acres of the Cortina Rancheria in Colusa County California. The company was founded in 1993 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2V6",
        "website": "http://www.earthworksinc.com",
        "full_time_employees": null
    },
    "ECM.V": {
        "short_name": "ECOLOMONDO CORPORATION",
        "long_name": "Ecolomondo Corporation",
        "summary": "Ecolomondo Corporation, a development stage clean tech company, designs, engineers, and develops a thermal decomposition process using a pyrolysis platform that converts hydrocarbon waste into marketable commodity end-products, namely carbon black substitute, oil, gas, and steel. Ecolomondo Corporation is headquartered in Saint-Laurent, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Saint-Laurent",
        "zipcode": "H4S 1H7",
        "website": "http://www.ecolomondo.com",
        "full_time_employees": null
    },
    "ETK-H.V": {
        "short_name": "ENVIROTEK REMEDIATION INC",
        "long_name": "EnviroTek Remediation Inc.",
        "summary": "EnviroTek Remediation Inc. focuses on the development of products/solutions and processes for hydrocarbon remediation. The company was formerly known as Phoenix Metals Corporation and changed its name to Envirotek Remediation Inc. in April 2018. EnviroTek Remediation Inc. was incorporated in 1980 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 4H8",
        "website": "http://envirotekremediation.com",
        "full_time_employees": null
    },
    "EWK.V": {
        "short_name": "Earthworks Industries Inc.",
        "long_name": "Earthworks Industries Inc.",
        "summary": "Earthworks Industries Inc., a development stage company, focuses on providing waste disposal services for private and public sectors in Canada and the United States. It designs, constructs, and operates an integrated waste handling facility on 443 acres of the Cortina Rancheria in Colusa County California. The company was founded in 1993 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2V6",
        "website": "http://www.earthworksinc.com",
        "full_time_employees": null
    },
    "GFL": {
        "short_name": "GFL Environmental Inc. Subordin",
        "long_name": "GFL Environmental Inc.",
        "summary": "GFL Environmental Inc. operates as a diversified environmental services company in Canada and the United States. The company offers non-hazardous solid waste management, infrastructure and soil remediation, and liquid waste management services. Its solid waste management business line includes the collection, transportation, transfer, recycling, and disposal of non-hazardous solid waste for municipal, residential, and commercial and industrial customers. The company's infrastructure and soil remediation business line provides remediation of contaminated soils, as well as complementary services, including civil, demolition, and excavation and shoring services. Its liquid waste management business collects, manages, transports, processes, and disposes of a range of industrial and commercial liquid wastes, as well as resells liquid waste products. The company was founded in 2007 and is headquartered in Vaughan, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Vaughan",
        "zipcode": "L4K 0H9",
        "website": "http://gflenv.com",
        "full_time_employees": 15475
    },
    "GFL.TO": {
        "short_name": "GFL ENVIRONMENTAL INC",
        "long_name": "GFL Environmental Inc.",
        "summary": "GFL Environmental Inc. operates as a diversified environmental services company in Canada and the United States. The company offers non-hazardous solid waste management, infrastructure and soil remediation, and liquid waste management services. Its solid waste management business line includes the collection, transportation, transfer, recycling, and disposal of non-hazardous solid waste for municipal, residential, and commercial and industrial customers. The company's infrastructure and soil remediation business line provides remediation of contaminated soils, as well as complementary services, including civil, demolition, and excavation and shoring services. Its liquid waste management business collects, manages, transports, processes, and disposes of a range of industrial and commercial liquid wastes, as well as resells liquid waste products. The company was founded in 2007 and is headquartered in Vaughan, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Vaughan",
        "zipcode": "L4K 0H9",
        "website": "http://gflenv.com",
        "full_time_employees": 15475
    },
    "GFLU": {
        "short_name": "GFL Environmental Inc. Tangible",
        "long_name": "GFL Environmental Inc.",
        "summary": "GFL Environmental Inc. operates as a diversified environmental services company in Canada and the United States. The company offers non-hazardous solid waste management, infrastructure and soil remediation, and liquid waste management services. Its solid waste management business line includes the collection, transportation, transfer, recycling, and disposal of non-hazardous solid waste for municipal, residential, and commercial and industrial customers. The company's infrastructure and soil remediation business line provides remediation of contaminated soils, as well as complementary services, including civil, demolition, and excavation and shoring services. Its liquid waste management business collects, manages, transports, processes, and disposes of a range of industrial and commercial liquid wastes, as well as resells liquid waste products. The company was founded in 2007 and is headquartered in Vaughan, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Vaughan",
        "zipcode": "L4K 0H9",
        "website": "http://gflenv.com",
        "full_time_employees": 15475
    },
    "HDII": {
        "short_name": "HYPERTENSION DIAGNOSTICS INCORP",
        "long_name": "Hypertension Diagnostics, Inc.",
        "summary": "Hypertension Diagnostics, Inc. designs, develops, manufactures, and markets proprietary noninvasive medical devices that detect subtle changes in the elasticity of arteries in the United States and internationally. It offers CVProfilor, which allows a physician to non-invasively assess the elasticity of small and large arteries, of which small artery elasticity is the earliest and sensitive marker of cardiovascular disease. The company offers CVProfilor DO-2020, which provides a patient's arterial elasticity indices used in the assessment for underlying vascular disease; CVProfilor MD-3000 that offers a sensitive and specific guide to the presence of blood vessel disease; and HD/PulseWave CR-2000 research cardiovascular profiling system, which provides researchers and scientists with a non-invasive means to assess arterial elasticity in support of human research in various areas. Its products collect 30 seconds of blood pressure waveform data, perform an analysis of the digitized blood pressure waveforms, and generate a CVProfile report that contains information on blood pressure, heart rate, pulse pressure, body surface area, body mass index, and C1-large and C2-small artery elasticity indices. The company sells its products to primary care physicians, cardiologists, health care professionals, trained medical personnel, research investigators at academic medical research centers, government institutes, cardiovascular specialists, and pharmaceutical firms. It markets its products through a representative organization in the United States. Hypertension Diagnostics, Inc. was founded in 1988 and is based in Richmond Hill, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Richmond Hill",
        "zipcode": "L4B 3Z4",
        "website": "http://www.hypertensiondiagnostics.com",
        "full_time_employees": null
    },
    "LUX.CN": {
        "short_name": "NewloxGold Vent",
        "long_name": "Newlox Gold Ventures Corp.",
        "summary": "Newlox Gold Ventures Corp. operates as an environmental reclamation and mineral recovery company in Canada. The company undertakes tailings remediation and fold recovery projects in Costa Rica. It produces gold through environmental remediation by recovering residual precious metals and contaminants from historical tailings. The company was incorporated in 2011 and is headquartered in West Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "West Vancouver",
        "zipcode": "V7S 1B7",
        "website": "http://www.newloxgold.com",
        "full_time_employees": null
    },
    "NGO.F": {
        "short_name": "NEWLOX GOLD VENTURES",
        "long_name": "Newlox Gold Ventures Corp.",
        "summary": "Newlox Gold Ventures Corp. operates as an environmental reclamation and mineral recovery company in Canada. The company undertakes tailings remediation and fold recovery projects in Costa Rica. It produces gold through environmental remediation by recovering residual precious metals and contaminants from historical tailings. The company was incorporated in 2011 and is headquartered in West Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "West Vancouver",
        "zipcode": "V7S 1B7",
        "website": "http://www.newloxgold.com",
        "full_time_employees": null
    },
    "SNRG": {
        "short_name": "SUSGLOBAL ENERGY CORP",
        "long_name": "SusGlobal Energy Corp.",
        "summary": "SusGlobal Energy Corp., a renewable energy company, focuses on acquiring, developing, and monetizing a portfolio of proprietary technologies in the waste to energy and regenerative products application. It primarily serves municipalities in rural and urban centers throughout southern and central Ontario, Canada. The company was founded in 2014 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5R 1J2",
        "website": "http://www.susglobalenergy.com",
        "full_time_employees": 8
    },
    "UL5A.SG": {
        "short_name": "BQE Water Inc. Registered Share",
        "long_name": "BQE Water Inc.",
        "summary": "BQE Water Inc., a water treatment company, provides wastewater treatment services to the mining and metallurgical industry in Canada, the United States, Mexico, Chile, China, and internationally. It offers water treatment solutions for mine drainage, run-off, waste rock seepage, tailings water, groundwater, and lime plant influent and/or effluent streams for treating metals, sulphate, selenium, nitrate, ammonia, and cyanide in the mining sector; smelting and refining services for treating metals and sulphate; and hydrometallurgy services for the treatment of metals, cyanide, and acids. The company's metal recovery and removal technologies include BioSulphide and ChemSulphide technologies, which use biological or chemical sources of sulphide to precipitate dissolved metals from mining wastewater; and Met-IX technology that treats wastewater. It also offers sulphate technologies, such as Sulf-IX and Sulf-IXC, which removes sulphate and hardness from wastewater; selenium removal technology, including Selen-IX that removes selenium from mining wastewater; and cyanide treatment technologies, such as SART, a process technology to remove the metallurgical interference of cyanide-soluble metals in gold cyanidation. The company was formerly known as BioteQ Environmental Technologies Inc. and changed its name to BQE Water Inc. in March 2017. BQE Water Inc. was founded in 1997 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6Z 2M4",
        "website": "http://www.bqewater.com",
        "full_time_employees": null
    },
    "VCI.V": {
        "short_name": "VITREOUS GLASS INC.",
        "long_name": "Vitreous Glass Inc.",
        "summary": "Vitreous Glass Inc. cleans, crushes, and sells waste glass to the fiberglass manufacturing industry in Alberta, Canada. The company offers its products to fiberglass insulation manufacturers for use as furnace ready cullet for use in their production facilities. Vitreous Glass Inc. is headquartered in Airdrie, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Airdrie",
        "zipcode": "T4A 0H5",
        "website": "http://www.vitreousglass.ca",
        "full_time_employees": null
    },
    "VCIGF": {
        "short_name": "VITREOUS GLASS INC",
        "long_name": "Vitreous Glass Inc.",
        "summary": "Vitreous Glass Inc. cleans, crushes, and sells waste glass to the fiberglass manufacturing industry in Alberta, Canada. The company offers its products to fiberglass insulation manufacturers for use as furnace ready cullet for use in their production facilities. Vitreous Glass Inc. is headquartered in Airdrie, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Airdrie",
        "zipcode": "T4A 0H5",
        "website": "http://www.vitreousglass.ca",
        "full_time_employees": null
    },
    "VTX.V": {
        "short_name": "VERTEX RESOURCE GROUP LTD",
        "long_name": "Vertex Resource Group Ltd.",
        "summary": "The Environmental Consulting segment offers planning and regulatory approvals, site assessments and monitoring, geotechnical and civil engineering, wildlife management, reclamation, remediation, groundwater monitoring, drilling waste, gas migration, emissions testing and reporting, and well abandonment services; land and regulatory services; emergency spill response services; abandonment, completion, and drilling engineering; and geographical information services, and mapping and drone services to various industries, including energy, telecommunications, public sector, utilities, mining, and agriculture. The Environmental Services provides fluid management and logistics, vacuum, hydrovac, pressure testing, industrial cleaning, waste management and recycling, equipment rental, and wellsite accommodation services, as well as manufactures and installs metal buildings and acoustical products for energy, construction, mining, utilities, telecommunications, and forestry industries. Vertex Resource Group Ltd. was founded in 1962 and is headquartered in Sherwood Park, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Sherwood Park",
        "zipcode": "T8H 0G2",
        "website": "http://www.vertex.ca",
        "full_time_employees": 650
    },
    "WCN": {
        "short_name": "Waste Connections, Inc.",
        "long_name": "Waste Connections, Inc.",
        "summary": "Waste Connections, Inc. provides waste collection, transfer, disposal, and recycling services in the United States and Canada. The company operates through five segments: Southern, Western, Eastern, Canada, Central, and Corporate. It offers collection services to residential, commercial, municipal, industrial, and E&P customers; landfill disposal services; and recycling services for various recyclable materials, including compost, cardboard, mixed paper, plastic containers, glass bottles, and ferrous and aluminum metals. The company also owns and operates transfer stations that receive compact and/or load waste to be transported to landfills or treatment facilities through truck, rail, or barge; and intermodal services for the rail haul movement of cargo and solid waste containers in the Pacific Northwest through a network of intermodal facilities. In addition, it provides E&P waste treatment, recovery, and disposal services for waste resulting from oil and natural gas exploration and production activity, such as drilling fluids, drill cuttings, completion fluids, and flowback water; production wastes and produced water during a well's operating life; contaminated soils that require treatment during site reclamation; and substances, which require clean-up after a spill, reserve pit clean-up, or pipeline rupture. Further, the company offers leasing services to its customers. As of December 31, 2020, it owned 311 solid waste collection operations; 132 transfer stations; 57 municipal solid waste (MSW) landfills; 12 E&P waste landfills; 13 non-MSW landfills; 68 recycling operations; 4 intermodal operations; 23 E&P liquid waste injection wells; and 19 E&P waste treatment and oil recovery facilities. It also operated an additional 53 transfer stations, 9 MSW landfills, and 2 intermodal operations. Waste Connections, Inc. was founded in 1997 and is headquartered in Vaughan, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Vaughan",
        "zipcode": "L4K0E3",
        "website": "http://www.wasteconnections.com",
        "full_time_employees": 18933
    },
    "WCN.TO": {
        "short_name": "WASTE CONNECTIONS INC",
        "long_name": "Waste Connections, Inc.",
        "summary": "Waste Connections, Inc. provides waste collection, transfer, disposal, and recycling services in the United States and Canada. The company operates through five segments: Southern, Western, Eastern, Canada, Central, and Corporate. It offers collection services to residential, commercial, municipal, industrial, and E&P customers; landfill disposal services; and recycling services for various recyclable materials, including compost, cardboard, mixed paper, plastic containers, glass bottles, and ferrous and aluminum metals. The company also owns and operates transfer stations that receive compact and/or load waste to be transported to landfills or treatment facilities through truck, rail, or barge; and intermodal services for the rail haul movement of cargo and solid waste containers in the Pacific Northwest through a network of intermodal facilities. In addition, it provides E&P waste treatment, recovery, and disposal services for waste resulting from oil and natural gas exploration and production activity, such as drilling fluids, drill cuttings, completion fluids, and flowback water; production wastes and produced water during a well's operating life; contaminated soils that require treatment during site reclamation; and substances, which require clean-up after a spill, reserve pit clean-up, or pipeline rupture. Further, the company offers leasing services to its customers. As of December 31, 2020, it owned 311 solid waste collection operations; 132 transfer stations; 57 municipal solid waste (MSW) landfills; 12 E&P waste landfills; 13 non-MSW landfills; 68 recycling operations; 4 intermodal operations; 23 E&P liquid waste injection wells; and 19 E&P waste treatment and oil recovery facilities. It also operated an additional 53 transfer stations, 9 MSW landfills, and 2 intermodal operations. Waste Connections, Inc. was founded in 1997 and is headquartered in Vaughan, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Vaughan",
        "zipcode": "L4K0E3",
        "website": "http://www.wasteconnections.com",
        "full_time_employees": 18933
    },
    "YES.V": {
        "short_name": "CHAR TECHNOLOGIES LTD",
        "long_name": "CHAR Technologies Ltd.",
        "summary": "CHAR Technologies Ltd., a cleantech development and services company, engages in biocarbon development activity. It offers SulfaCHAR, a gas-cleaning solution that removes hydrogen sulfide from renewable natural gas; Cleanfyre, a carbon neutral coal replacement; and equipment for industrial air and water treatment. The company also provides environmental consulting services comprising environmental management, site investigation and remediation, engineering, and resource services. It serves food and beverage, industrial, and renewable gas project customers. CHAR Technologies Ltd. was founded in 2011 and is headquartered in North York, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "North York",
        "zipcode": "M3C 1T5",
        "website": "http://www.chartechnologies.com",
        "full_time_employees": null
    }
}