{
    "0ZQ.F": {
        "short_name": "KAZATOMPROM  GDR REGS 1/1",
        "long_name": "joint stock company \"National atomic company \"Kazatomprom\"",
        "summary": "joint stock company 'National atomic company 'Kazatomprom' produces and sells uranium and uranium products. It also manufactures and sells beryllium and tantalum products; provides communication and security services; mines rare-earth metals; and produces semiconductor materials. In addition, the company offers research, project, development, and engineering consulting services; explores for, extracts, and processes molybdenum-copper ores; produces and sells metallurgical and polycrystalline silicon; recycles silicon production waste; and produces solar quality silicon, and silicon and photovoltaic slices, and photovoltaic modules. Further, it provides drilling services; monitors radiation level and environment conditions; and offers procurement and transportation services. The company operates in the Republic of Kazakhstan and internationally. joint stock company 'National atomic company 'Kazatomprom' was founded in 1997 and is based in Nur-Sultan, Kazakhstan.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Uranium",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Kazakhstan",
        "city": "Nur-Sultan"
    },
    "80TE.L": {
        "short_name": "JOINT STOCK COMPANY KASPI.KZ GD",
        "long_name": "Kaspi.kz Joint Stock Company",
        "summary": "Kaspi.kz Joint Stock Company operates as bank holding company for Kaspi Bank Joint Stock Company that provides various banking products and services. The company operates through Payments Platform, Marketplace Platform, and Fintech Platform segments. The Payments Platform segment connects its customers, which consists consumer and merchants to facilitate cashless and digital payment transactions; and offers a technology platform to pay and receive payments for goods and services, as well as transfer and withdraw money. The Marketplace Platform segment connects merchants and consumers, which enables merchants to increase its sales and enable consumers to buy various products and services from various merchants. The Fintech Platform enables its customers to manage their personal finance online and access consumer finance and deposit products through Kaspi.kz mobile app. It is also involved in real estate business. The company was incorporated in 1997 and is based in Almaty, the Republic of Kazakhstan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Kazakhstan",
        "city": "Almaty"
    },
    "BKMM": {
        "short_name": "BEKEM METALS INC",
        "long_name": "Bekem Metals, Inc.",
        "summary": "Bekem Metals, Inc. explores and produces mineral properties. It provides exploration of nickel, cobalt, and brown coal. Bekem Metals, Inc. was formerly known as Condesa Pacific, S.A. and changed its name to Bekem Metals, Inc. in March, 2005. The company was founded in 2001 and is based in Aktobe, Kazakhstan with an additional office location in Salt Lake City, Utah.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Kazakhstan",
        "city": "Aktobe"
    },
    "CSSV": {
        "short_name": "CASPIAN SERVICES INC",
        "long_name": "Caspian Services, Inc.",
        "summary": "Caspian Services, Inc. provides various oilfield services for the oil and gas industry in the Republic of Kazakhstan and the Caspian Sea region. The company operates in three segments: Vessel Operations, Geophysical Services, and Marine Base Services. The Vessel Operations segment charters a fleet of shallow draft offshore support vessels to oil and natural gas exploration companies. This segment's vessel fleet includes supply vessels, survey/utility vessels, anchor handling multicats and support vessel tugs, cable laying barges, accommodation vessels, and crewboats. The Geophysical Services segment offers onshore geophysical services to independent oil and gas exploration and development companies operating in Kazakhstan. This segment provides geophysical seismic surveys, such as 2D and 3D seismic surveys. The Marine Base Services segment operates a marine base located at the Port of Bautino on the North Caspian Sea. This segment offers various facilities and services comprising long and short terms vessel moorings, wharf front crane pad for vessel loading/offloading, boat yard with vessel lifting facilities, long-term berths, water storage facilities and vessel bunkering, oily and waste water collection and removing facilities, weighbridge facilities, electrical power supply and distribution systems, and open lay-down storage area. The company was formerly known as EMPS Corporation and changed its name to Caspian Services, Inc. in July 2005. Caspian Services, Inc. was founded in 1998 and is based in Almaty, Kazakhstan.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Kazakhstan",
        "city": "Almaty"
    },
    "DMW2.F": {
        "short_name": "FREEDOM HLDG  DL-,001",
        "long_name": "Freedom Holding Corp.",
        "summary": "Freedom Holding Corp., through its subsidiaries, provides retail securities brokerage, research, investment counseling, securities trading, market making, corporate investment banking, and underwriting services. The company offers investment brokerage services for exchange-traded and over-the-counter corporate equity and debt securities, money market instruments, exchange traded options and futures contracts, government bonds, and mutual funds; Margin Lending services collateralized by securities and cash in the customer's account; various investment education and training courses; and investment research services. It also provides capital raising solutions for corporate clients through initial public offerings and follow-on offerings; and debt capital markets solutions that focuses on structuring and distributing private and public debt for various purposes, including buyouts, acquisitions, growth capital financings, and recapitalizations. In addition, the company is involved in trading, investment, and brokerage activities. Further, it act as an intermediary between borrowers and lenders of short-term funds and provide funding for various inventory positions; and employs repurchase and reverse repurchase agreements in proprietary trading activities. It has operations primarily in Russia, Kazakhstan, Ukraine, Uzbekistan, Kyrgyzstan, and Cyprus. The company was formerly known as BMB Munai, Inc. and changed its name to Freedom Holding Corp. Freedom Holding Corp. was incorporated in 1981 and is headquartered in Almaty, Kazakhstan.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Kazakhstan",
        "city": "Almaty"
    },
    "FRHC": {
        "short_name": "Freedom Holding Corp.",
        "long_name": "Freedom Holding Corp.",
        "summary": "Freedom Holding Corp., through its subsidiaries, provides retail securities brokerage, research, investment counseling, securities trading, market making, corporate investment banking, and underwriting services. The company offers investment brokerage services for exchange-traded and over-the-counter corporate equity and debt securities, money market instruments, exchange traded options and futures contracts, government bonds, and mutual funds; Margin Lending services collateralized by securities and cash in the customer's account; various investment education and training courses; and investment research services. It also provides capital raising solutions for corporate clients through initial public offerings and follow-on offerings; and debt capital markets solutions that focuses on structuring and distributing private and public debt for various purposes, including buyouts, acquisitions, growth capital financings, and recapitalizations. In addition, the company is involved in trading, investment, and brokerage activities. Further, it act as an intermediary between borrowers and lenders of short-term funds and provide funding for various inventory positions; and employs repurchase and reverse repurchase agreements in proprietary trading activities. It has operations primarily in Russia, Kazakhstan, Ukraine, Uzbekistan, Kyrgyzstan, and Cyprus. The company was formerly known as BMB Munai, Inc. and changed its name to Freedom Holding Corp. Freedom Holding Corp. was incorporated in 1981 and is headquartered in Almaty, Kazakhstan.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Kazakhstan",
        "city": "Almaty"
    },
    "H4L1.F": {
        "short_name": "HALYK SAV.BK.GDRS/40 KT15",
        "long_name": "Joint Stock Company Halyk Savings Bank of Kazakhstan",
        "summary": "Joint Stock Company Halyk Savings Bank of Kazakhstan and its subsidiaries provides corporate and retail banking services primarily in the Republic of Kazakhstan, Russia, Kyrgyzstan, Tajikistan, Georgia, and Uzbekistan. It operates through four segments: Corporate Banking, Small and Medium Enterprises Banking (SME), Retail Banking, and Investment banking. The company originates loans and guarantees; collects deposits; trades in securities and foreign currencies; executes transfers; and offers cash and payment card processing, and other banking services. Its products and services include current and correspondent accounts; various deposit products; investment savings products; credit and debit cards; consumer loans and mortgages; custody, cash, and foreign currency related services; overdrafts; other credit facilities; and letters of credit, trade finance products, foreign exchange, documentary, and capital market services. In addition, it offers leasing, telecommunications, broker and dealer, cash collection, and asset management services; and property and casualty, liability, personal, and life insurance products, as well as Internet, online, mobile, and SMS banking services. The company serves individuals, corporate clients and financial organizations, and SME clients and individual entrepreneurs. As of December 31, 2019, it operated through its head office in Almaty and its 24 regional branches, 120 sub-regional offices, and 482 cash settlement units. The company was founded in 1923 and is headquartered in Almaty, the Republic of Kazakhstan. Joint Stock Company Halyk Savings Bank of Kazakhstan is a subsidiary of JSC HG Almex.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks—Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Kazakhstan",
        "city": "Almaty"
    },
    "KC1A.F": {
        "short_name": "KCELL JSC GDR REG S",
        "long_name": "Kcell Joint Stock Company",
        "summary": "Kcell Joint Stock Company, together with its subsidiaries, provides mobile telecommunication services in the Republic of Kazakhstan. It offers voice and messaging services; and value-added services, including multimedia and mobile content services, as well as data transmission services, such as Internet access. The company provides its services under the Kcell and Activ brands primarily to corporate subscribers comprising government subscribers, as well as mass market subscribers. The company was formerly known as GSM Kazakhstan OAO Kazakhtelecom LLP and changed its name to Kcell Joint Stock Company in July 2012. The company was founded in 1998 and is based in Almaty, the Republic of Kazakhstan. Kcell Joint Stock Company is a subsidiary of Kazakhtelecom JSC.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Kazakhstan",
        "city": "Almaty"
    },
    "KKS.F": {
        "short_name": "KASPI.KZ (SP.GDR REG.S)/1",
        "long_name": "Kaspi.kz Joint Stock Company",
        "summary": "Kaspi.kz Joint Stock Company operates as bank holding company for Kaspi Bank Joint Stock Company that provides various banking products and services. The company operates through Payments Platform, Marketplace Platform, and Fintech Platform segments. The Payments Platform segment connects its customers, which consists consumer and merchants to facilitate cashless and digital payment transactions; and offers a technology platform to pay and receive payments for goods and services, as well as transfer and withdraw money. The Marketplace Platform segment connects merchants and consumers, which enables merchants to increase its sales and enable consumers to buy various products and services from various merchants. The Fintech Platform enables its customers to manage their personal finance online and access consumer finance and deposit products through Kaspi.kz mobile app. It is also involved in real estate business. The company was incorporated in 1997 and is based in Almaty, the Republic of Kazakhstan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Kazakhstan",
        "city": "Almaty"
    },
    "RTSO": {
        "short_name": "RTS OIL HOLDINGS INC",
        "long_name": "RTS Oil Holdings, Inc.",
        "summary": "RTS Oil LLP distributes oil and gas products. The company also owns and operates approximately 20 petrol stations for retail sales, and 6 crude oil and fuel storage tank farms located throughout Kazakhstan for the wholesale distribution of petroleum products. RTS Oil LLP is based in Kazakhstan. RTS Oil Holdings, Inc. was formerly known as RTS Oil LLP. As a result of the acquisition of RTS Oil LLP  by Geo Point Technologies, Inc., RTS Oil LLP's name was changed.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Kazakhstan",
        "city": "None"
    }
}