{
    "MLZAM.PA": {
        "short_name": "ZCCM",
        "long_name": "ZCCM Investments Holdings Plc",
        "summary": "ZCCM Investments Holdings Plc, an investment holding company, primarily holds investments in the copper mining sector in Zambia. It is involved in the mining and manufacturing of limestone products; coal and gold mining; provision of environmental and technical services; and commercial banking business. The company was founded in 1982 is based in Lusaka, Zambia. ZCCM Investments Holdings Plc is a subsidiary of Industrial Development Corporation ltd.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "Zambia",
        "state": null,
        "city": "Lusaka",
        "zipcode": "10101",
        "website": "http://www.zccm-ih.com.zm",
        "full_time_employees": 691
    },
    "ZAM.L": {
        "short_name": "ZAMBEEF PRODUCTS PLC ORD ZMW0.0",
        "long_name": "Zambeef Products PLC",
        "summary": "Zambeef Products PLC, together with its subsidiaries, engages in the agri-businesses in Zambia, West Africa, and internationally. The company engages in the production, processing, distribution, and retailing of beef, chicken, pork, milk, dairy products, eggs, edible oils, stock feed, and flour. It is also involved in row cropping operations primarily maize, soya beans, and wheat with approximately 7,787 hectares of row crops under irrigation and 8,694 hectares of rain-fed/dry-land crops; and palm tree plantation activities. The company operates 236 retail outlets directly to end-consumers; and transport and trucking fleets consisting of 244 trucks in Zambia. In addition, it produces, processes, and sells leather, shoes, and meat products, as well as engages in the chicken breeding business. The company was incorporated in 1994 and is headquartered in Lusaka, Zambia.",
        "currency": "GBp",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Zambia",
        "state": null,
        "city": "Lusaka",
        "zipcode": null,
        "website": "http://zambeefplc.com",
        "full_time_employees": 6834
    }
}