{
    "7010.SR": {
        "short_name": "Saudi Telecom Co.",
        "long_name": "Saudi Telecom Company",
        "summary": "Saudi Telecom Company, together with its subsidiaries, provides telecommunications, information, media, and digital payment services in the Kingdom of Saudi Arabia and internationally. The company offers mobile, landline, Internet, and TV on demand services, as well as international telecommunication, broadband, and other related services; and operates communications projects. It is also involved in the electrical business and telecommunication networks; and wholesale and retail of telecommunications equipment and electrical appliances, and recharge card services. In addition, the company engages in importing, marketing, installing, and maintaining licensed telecommunications and information technology; owning, constructing, operating, leasing, and commercializing telecom towers; the content services and digital media activities; the provision of computer services; the sale and re-sale of fixed and mobile telecommunication services; and the maintenance and operation of commercial centers. Further, it establishes, owns, develops, invests, and manages real estate and contracting activities; and provides consulting, and importing and exporting services. The company was founded in 1998 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "12464",
        "website": "http://www.stc.com.sa",
        "market_cap": "Large Cap"
    },
    "7020.SR": {
        "short_name": "Etihad Etisalat Co.",
        "long_name": "Etihad Etisalat Company",
        "summary": "Etihad Etisalat Company operates mobile wireless telecommunication and fiber optic networks in the Kingdom of Saudi Arabia. The company manages, installs, and operates telephone networks, terminals, and communication unit systems; and sells and maintains mobile phones and communication unit systems. It is also involved in the contractual establishment and maintenance of wired telecommunication networks and related works; installation and maintenance of wire and wireless telecommunication networks; installation and maintenance of computer systems and the provision of data services; import, export, sale, and distribution of telecommunications hardware, software and systems, and intelligent building systems; and marketing and distribution of telecommunication services. In addition, the company provides computer services and related software and equipment; consultation services in the telecommunication, computer, software, and media production domains; and marketing and importing services for third parties. Further, it is involved in the wholesale, retail, maintenance, and operation of computers and electronic equipment, as well as the provision of related services. Additionally, the company invests funds in shares, bonds, and other securities; and owns real estate, as well as owns and leases intellectual property rights, such as patents and trademarks, concessions, and other intangible rights. Etihad Etisalat Company was founded in 2004 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11423",
        "website": "http://www.mobily.com.sa",
        "market_cap": "Mid Cap"
    },
    "7040.SR": {
        "short_name": "Etihad Atheeb Telecommunication",
        "long_name": "Etihad Atheeb Telecommunication Company",
        "summary": "Etihad Atheeb Telecommunication Company provides voice and data services in the Kingdom of Saudi Arabia. The company offers voice, data, value added and directory, and other future services and applications, as well as integrated business solutions. It offers dedicated internet acess, IP-VPN, VPN and IPLC, and VPN over LTE services; SIP trunk, national toll free, and UAN 9200 services; managed routers service and distributed denial of service; and co-location services. The company also provides fibre broadband, LTE broadband, and WiMAX broadband services; and prepaid calling cards to residential and personal customers. Etihad Atheeb Telecommunication Company was founded in 2008 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": null,
        "website": "http://www.go.com.sa",
        "market_cap": "Micro Cap"
    }
}