{"1693.HK": {"short_name": "BGMC", "long_name": "BGMC International Limited", "summary": "BGMC International Limited, an investment holding company, provides construction services in Malaysia. The company operates through five segments: Building and Structures, Energy Infra-structure, Mechanical and Electrical, Earthworks and Infrastructure, and Concession and Maintenance. It constructs low-rise and high-rise residential, and commercial properties; factories; and government-led infrastructure and facility projects. The company also designs, constructs, and installs medium and high voltage power substations; installs high voltage underground cabling systems; and develops and establishes utility scale solar power plants. In addition, it undertakes installation of mechanical and electrical components, and equipment for buildings and infrastructure; and designs, plans, and installs mechanical and electrical facilities. Further, the company maintains a fleet of machinery for carrying out earthworks, such as site clearing, building platform preparation, road and drainage systems, and other infrastructure installation works. Additionally, it supplies and installs elevators; builds, leases, maintains, and transfers campus to university; builds, owns, and operates solar power plant; provides asset management services; generates and sell power; and undertakes development and construction relating to provision of renewable energy. The company is also involved in the provision of mechanical and electrical engineering services; and property investment. BGMC International Limited was founded in 1996 and is headquartered in Subang Jaya, Malaysia.", "currency": "HKD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "HKG", "market": "hk_market", "country": "Malaysia", "city": "Subang Jaya"}, "1903.HK": {"short_name": "JBB BUILDERS", "long_name": "JBB Builders International Limited", "summary": "JBB Builders International Limited, an engineering contractor, provides marine construction, and building and infrastructure services to contractors and developers in Malaysia and Singapore. The company offers land reclamation and related works, such as soil investigation, hydrographic survey, pre-reclamation design, sand handling/filling, ground treatment, sand surcharge removal work, and other related works; and marine civil works consisting of construction of jetty, channel-crossing works, maintenance dredging, and river diversion works. It also provides marine transportation services, which comprise transportation of marine sand, loading of marine sand extracted from the approved sand source onto sand carriers, and carriage and delivery of marine sand to designated sites where the marine sand is unloaded to be used for land reclamation. The company's building and infrastructure services include general building works in construction of properties and infrastructure works. It also engages in the construction and trading of sand; and land based machinery works and rental activities. JBB Builders International Limited was founded in 2012 and is headquartered in Johor Bahru, Malaysia.", "currency": "HKD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "HKG", "market": "hk_market", "country": "Malaysia", "city": "Johor Bahru"}, "1953.HK": {"short_name": "RIMBACO", "long_name": "Rimbaco Group Global Limited", "summary": "Rimbaco Group Global Limited operates as a building construction contractor in Malaysia. It offers building construction services for factories, including low-rise processing facilities and manufacturing plants; and institutional, commercial and/or residential buildings, such as private hospitals, hotels, shopping malls, high-rise residential buildings, and commercial/residential complex. The company also undertakes small-scale ancillary construction works, including renovation works, repair works, and electrical works. Rimbaco Group Global Limited was founded in 1985 and is headquartered in Penang, Malaysia.", "currency": "HKD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "HKG", "market": "hk_market", "country": "Malaysia", "city": "Penang"}, "1960.HK": {"short_name": "TBKS HLDGS", "long_name": "TBK & Sons Holdings Limited", "summary": "TBK & Sons Holdings Limited undertakes civil and structural works in the oil and gas industry in Malaysia. Its civil and structural works services include site preparation works, such as earthwork, demolition works, and temporary facilities, as well as infrastructure construction, including building temporary site offices, canteens, warehouses, etc.; and civil works for process plants comprise reinforced concrete foundations, pipe supports, ponds, pits, underground and open drainage networks, paving work and related plant civil maintenance works. The company also undertakes building works, such as the building of sub-stations, field auxiliary rooms, workshops and storage buildings, etc. TBK & Sons Holdings Limited was founded in 1975 and is headquartered in Port Dickson, Malaysia. TBK & Sons Holdings Limited is a subsidiary of TBK & Sons International Limited.", "currency": "HKD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "HKG", "market": "hk_market", "country": "Malaysia", "city": "Port Dickson"}}