{"ALPHS.PA": {"short_name": "PHARMASIMPLE", "long_name": "Pharmasimple SA", "summary": "Pharmasimple SA operates a Website for medicines, cosmetics, and food supplements in Belgium and France. It offers beauty and cosmetics products, such as face wash, face care, make-up, hair removal, body care, tanning lotions, and hair treatment products; health products, including feminine hygiene, dental hygiene, alternative medicine, hearing aid, and aromatherapy products; and men care products categories, such as face, body, and hair care, as well as shaving products. The company also provides diet products, sport diet, health supplements, and health food; child care product categories, which include nappies, baby washing, breastfeeding equipment, baby food, and baby care products; and veterinary and pest control products. Pharmasimple SA was founded in 2010 and is based in Houdeng-Goegnies, Belgium.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Internet Retail", "exchange": "PAR", "market": "fr_market", "country": "Belgium", "city": "Houdeng-Goegnies"}, "BALTA.BR": {"short_name": "BALTA GROUP", "long_name": "Balta Group NV", "summary": "Balta Group NV produces and sells textile floor coverings in Europe, North America, and internationally. The company operates through four segments: Rugs, Residential, Commercial, and Non-Woven. The Rugs segment designs, manufactures, and distributes a range of machine-made rugs to retailers, such as home improvement, furniture, specialist, discount, and DIY stores, as well as e-commerce players and wholesalers under the Balta home brand name. The Residential segment designs, manufactures, and distributes branded broadloom carpets under the Balta Carpets and ITC brands; and tiles to retailers and wholesalers. The Commercial segment designs, manufactures, and distributes modular carpet tiles for offices and public projects under the modulyss and Bentley brands; and broadloom carpets for the hospitality sector under the arc edition brand to architects, designers, contractors, and distributors. The Non-Woven segment designs, manufactures, and distributes soft flooring for events, such as fairs and expositions; specialized fabrics for insulation, lining, cars, carpet backings, and banners under the Captiqs brand name; and needle felt products. It also exports its products to 139 countries worldwide. The company was founded in 1964 and is headquartered in Sint-Baafs-Vijve, Belgium.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Furnishings, Fixtures & Appliances", "exchange": "BRU", "market": "be_market", "country": "Belgium", "city": "Sint-Baafs-Vijve"}, "BDB.F": {"short_name": "BALTA GROUP N.V.", "long_name": "Balta Group NV", "summary": "Balta Group NV produces and sells textile floor coverings in Europe, North America, and internationally. The company operates through four segments: Rugs, Residential, Commercial, and Non-Woven. The Rugs segment designs, manufactures, and distributes a range of machine-made rugs to retailers, such as home improvement, furniture, specialist, discount, and DIY stores, as well as e-commerce players and wholesalers under the Balta home brand name. The Residential segment designs, manufactures, and distributes branded broadloom carpets under the Balta Carpets and ITC brands; and tiles to retailers and wholesalers. The Commercial segment designs, manufactures, and distributes modular carpet tiles for offices and public projects under the modulyss and Bentley brands; and broadloom carpets for the hospitality sector under the arc edition brand to architects, designers, contractors, and distributors. The Non-Woven segment designs, manufactures, and distributes soft flooring for events, such as fairs and expositions; specialized fabrics for insulation, lining, cars, carpet backings, and banners under the Captiqs brand name; and needle felt products. It also exports its products to 139 countries worldwide. The company was founded in 1964 and is headquartered in Sint-Baafs-Vijve, Belgium.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Furnishings, Fixtures & Appliances", "exchange": "FRA", "market": "dr_market", "country": "Belgium", "city": "Sint-Baafs-Vijve"}, "DJDA.F": {"short_name": "D'IETEREN P.S.", "long_name": "D'Ieteren SA", "summary": "D'Ieteren SA, together with its subsidiaries, provides various services to the motorists worldwide. The company operates through D'Ieteren Auto, Belron, and Moleskine segments. It imports and distributes Volkswagen, Audi, SEAT, Â\u008akoda, Bentley, Lamborghini, Bugatti, Porsche, and Yamaha vehicles, as well as its spare parts and accessories. The company also provides vehicle glass repair and replacement services under the Carglass, Safelite AutoGlass, and Autoglass brands; and manages vehicle glass and other insurance claims on behalf of insurance customers. In addition, it develops and sells branded notebooks, as well as writing, travel, and reading accessories under the Moleskine brand name. Further, the company sells used vehicles; and provides after-sales services, including bodywork, maintenance, glass, and tyre replacement services. D'Ieteren SA was founded in 1805 and is headquartered in Brussels, Belgium.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Auto & Truck Dealerships", "exchange": "FRA", "market": "dr_market", "country": "Belgium", "city": "Brussels"}, "RES.BR": {"short_name": "RESILUX", "long_name": "Resilux NV", "summary": "Resilux NV manufactures and sells polyethylene terephthalate (PET) preforms and bottles worldwide. Its preforms and bottles are used for packaging water, carbonated soft drinks, edible oils, ketchups, detergents, milk, beers, soft drinks, wines, fruit juices, and other applications. The company also offers PET wide mouth jars, packaging foils, and blister packs. In addition, it provides in-house, wall-to-wall, and satellite blowing services; and PET recycling services. The company primarily serves producers of drink, food, and household products. The company was founded in 1992 and is headquartered in Wetteren, Belgium.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "BRU", "market": "be_market", "country": "Belgium", "city": "Wetteren"}, "SIETY": {"short_name": "D'IETEREN NV", "long_name": "D'Ieteren SA", "summary": "D'Ieteren SA, together with its subsidiaries, provides various services to the motorists worldwide. The company operates through D'Ieteren Auto, Belron, and Moleskine segments. It imports and distributes Volkswagen, Audi, SEAT, Â\u008akoda, Bentley, Lamborghini, Bugatti, Porsche, and Yamaha vehicles, as well as its spare parts and accessories. The company also provides vehicle glass repair and replacement services under the Carglass, Safelite AutoGlass, and Autoglass brands; and manages vehicle glass and other insurance claims on behalf of insurance customers. In addition, it develops and sells branded notebooks, as well as writing, travel, and reading accessories under the Moleskine brand name. Further, the company sells used vehicles; and provides after-sales services, including bodywork, maintenance, glass, and tyre replacement services. D'Ieteren SA was founded in 1805 and is headquartered in Brussels, Belgium.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Auto & Truck Dealerships", "exchange": "PNK", "market": "us_market", "country": "Belgium", "city": "Brussels"}, "SIOE.BR": {"short_name": "SIOEN", "long_name": "Sioen Industries NV", "summary": "Sioen Industries NV provides coated technical textiles and apparels. It operates through three segments: Coating, Apparel, and Chemicals. The Coating segment offers yarns and woven fabrics; non-woven fabrics, including films and sheets for automotive and industrial sector; coated technical textiles; and finished products, as well as processes coated fabrics and PVC membranes for industrial applications. The Apparel segment provides professional and chainsaw protective clothing; fire intervention suits; life jackets and floatation suits; professional drysuits; workwear; ballistic jackets; and hunting, fishing, and lifestyle clothing. The Chemicals segment offers pigment pastes, printing inks and extenders, varnishes, digital inks, color dispersions, and clearing agents. The company also engages in the real estate activities. It operates in France, Germany, Eastern Europe, Belgium, the Netherlands, Scandinavia, the United Kingdom, Italy, the United States, Austria, China, Spain, Switzerland, Portugal, Ireland, and internationally. The company was founded in 1960 and is based in Ardooie, Belgium. Sioen Industries NV is a subsidiary of Sihold NV.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "BRU", "market": "be_market", "country": "Belgium", "city": "Ardooie"}, "VAN.BR": {"short_name": "VAN DE VELDE", "long_name": "Van de Velde NV", "summary": "Van de Velde NV, together with its subsidiaries, designs, develops, manufactures, and markets fashionable luxury lingerie for women worldwide. It operates through two segments, Wholesale and Retail. The company offers its products under the PrimaDonna, Marie Jo, Andres Sarda, and Lingerie Styling brands. It also operates retail websites under the name of Rigby & Peller and Lincherie; and specialized boutiques and department stores, as well as approximately 5,000 retail stores. The company was founded in 1919 and is headquartered in Schellebelle, Belgium. Van de Velde NV is a subsidiary of Van de Velde Holding NV.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "BRU", "market": "be_market", "country": "Belgium", "city": "Schellebelle"}, "WOLS.BR": {"short_name": "WOL. SHOPPING CERT", "long_name": "Woluwe Shopping Center", "summary": "Woluwe Shopping Center operates real estate properties, primarily shopping centers in Brussels. The company is based in Brussels, Belgium.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Department Stores", "exchange": "BRU", "market": "be_market", "country": "Belgium", "city": "Brussels"}}