{
    "0CP1.F": {
        "short_name": "CHAROEN POKPHAND  RP 10",
        "long_name": "PT Charoen Pokphand Indonesia Tbk",
        "summary": "PT Charoen Pokphand Indonesia Tbk produces and sells poultry feed, day old chicks (DOC), processed chicken, and other food products in Indonesia. The company offers broiler and layer poultry feed; and various poultry feed products for parent stock, duck, native chicken, fighting cock, and quail, as well as feed for cattle and swine under the brands of HI-PRO, HI-PRO-VITE, BINTANG, BONAVITE, ROYAL FEED, TURBO FEED, and TIJI. It also provides various types of DOC, such as broiler DOC; layer DOC; and other DOC, such as DOC for parent stock and male layer. In addition, the company sells various food products under the Golden Fiesta, Fiesta, Champ, and Okey brands. Further, it is involved in poultry farming and beverage activities; the trade of processed chicken; the production of plastic packaging products; the production and distribution of chicken feather meal; and the operation of restaurants and convenience stores. The company was formerly known as PT Charoen Pokphand Indonesia Animal Feedmill Co. Limited. PT Charoen Pokphand Indonesia Tbk was founded in 1972 and is headquartered in Jakarta, Indonesia. PT Charoen Pokphand Indonesia Tbk is a subsidiary of PT Charoen Pokphand Indonesia Group.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "16S.SG": {
        "short_name": "Sawit Sumbermas Sarana Tbk PT R",
        "long_name": "PT Sawit Sumbermas Sarana Tbk.",
        "summary": "PT Sawit Sumbermas Sarana Tbk., together with its subsidiaries, engages in the production and sale of crude palm oil, fresh fruit bunches, palm kernel oil, and palm kernel in Indonesia. The company operates oil palm plantations and a palm oil mill. It is also involved in the provision of consulting and trading services. PT Sawit Sumbermas Sarana Tbk. was founded in 1995 and is headquartered in Pangkalan Bun, Indonesia.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Pangkalan Bun"
    },
    "1MF.SG": {
        "short_name": "Malindo Feedmill TBK PT Registe",
        "long_name": "PT Malindo Feedmill Tbk",
        "summary": "PT Malindo Feedmill Tbk, together with its subsidiaries, engages in the animal feed, breeding and broiler farm, and food processing businesses in Indonesia. It offers broiler, layer, duck, and other livestock feed products; and parent stock and day old chicken final stock. The company also produces broiler chickens; and provides consumer products, such as chicken nuggets, chicken tempura, chicken sticks, chicken wings, tulip wings, chicken karaage, chicken drumstick, chicken sausage, and combined variant packs under the SunnyGold and Ciki Wiki brands. The company was founded in 1997 and is headquartered in Jakarta Selatan, Indonesia. PT Malindo Feedmill Tbk is a subsidiary of Dragon Amity Pte. Ltd.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "2BU.F": {
        "short_name": "BUMITAMA AGRI LTD",
        "long_name": "Bumitama Agri Ltd.",
        "summary": "Bumitama Agri Ltd., an investment holding company, produces and trades in crude palm oil (CPO), palm kernel (PK), and related products for refineries in Indonesia. The company operates through two segments; Plantations and Palm Oil Mills and Downstream Biodiesel Refinery. It is involves in cultivation and maintenance of oil palm plantations and operation of palm oil mills; and processing biodiesel plant and sells biodiesel products from the refinery. The company also engages in harvesting and processing fresh palm fruit bunches (FFB) into CPO and PK; and business and management consultancy services. It manages a total land area of approximately 187,567 hectares in Central Kalimantan, West Kalimantan, and Riau provinces. The company was founded in 1996 and is based in South Jakarta, Indonesia. Bumitama Agri Ltd. is a subsidiary of Wellpoint Pacific Holdings Ltd.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "2IR.SG": {
        "short_name": "PT Salim Ivomas Pratama Tbk Reg",
        "long_name": "PT Salim Ivomas Pratama Tbk",
        "summary": "PT Salim Ivomas Pratama Tbk, together with its subsidiaries, operates as an integrated producer of edible oils and fats in Indonesia. It operates in two segments, Plantations; and Edible Oil and Fats. The Plantations segment is primarily involved in the development and maintenance of oil palm, sugar cane, timber, and rubber plantations; and processing, trading, marketing, and sale of palm oil, sugar, and rubber products. This segment also develops and maintains cocoa, coconut, agroforestry, and tea plantations. The Edible Oil and Fats segment produces, markets, and sells edible oils, margarines, shortening, fats, and other related products, as well as other by-products derived from palm oil refining and fractionation. The company also provides transportation, investment and research management, and technical services; and artificial primary macronutrients mix fertilizers. In addition, it engages in bulking station business; seed breeding activities; and invests in agricultural technology and cultivation, agriculture, marketing and research businesses, as well as engages in the house prefabrication activities. The company offers its products under the Bimoli, Bimoli Spesial, Delima, Happy, Palmia, Amanda, Simas, Malinda, and Mahakam brand names. It also exports its products to approximately 25 countries, including China, Malaysia, Singapore, Nigeria, South Korea, Timor Leste, the Philippines, Myanmar, Sri Lanka, and Papua New Guinea. The company was formerly known as PT Ivomas Pratama and changed its name to PT Salim Ivomas Pratama Tbk in February 1994. The company was founded in 1992 and is based in Jakarta, Indonesia. PT Salim Ivomas Pratama Tbk is a subsidiary of Indofood Agri Resources Ltd.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "6CK1.SG": {
        "short_name": "Wilmar Cahaya Indonesia Tbk,PTR",
        "long_name": "PT Wilmar Cahaya Indonesia Tbk.",
        "summary": "PT Wilmar Cahaya Indonesia Tbk. produces and sells vegetable and specialty oils in Indonesia. It offers specialty fats, including cocoa butter substitutes, cocoa butter replacers, cocoa butter equivalents, confectionary fats, icing and filling fats, milk fat replacers, ice cream fats, and spread fats, as well as bakery fats. The company was formerly known as PT Cahaya Kalbar Tbk. and changed its name to PT Wilmar Cahaya Indonesia Tbk. in May 2013. The company was founded in 1968 and is headquartered in Bekasi, Indonesia. PT Wilmar Cahaya Indonesia Tbk. is a subsidiary of PT Sentratama Niaga Indonesia.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "7MU.SG": {
        "short_name": "Mustika Ratu, PT Registered Sha",
        "long_name": "PT Mustika Ratu Tbk",
        "summary": "PT Mustika Ratu Tbk, together with its subsidiaries, manufactures, trades, and distributes herbal and traditional cosmetics, body care products, health drinks, and other related products in Indonesia. The company was founded in 1975 and is headquartered in Jakarta, Indonesia. PT Mustika Ratu Tbk is a subsidiary of PT Mustika Ratu Investama.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "AAGRY": {
        "short_name": "ASTRA AGRO LESTARI TBK",
        "long_name": "PT Astra Agro Lestari Tbk",
        "summary": "PT Astra Agro Lestari Tbk, together with its subsidiaries, engages in the palm oil business in Indonesia. It provides crude palm oil and its derivatives, palm kernel and its derivatives, and other products. The company manages 286,877 hectares of oil palm plantations in Sumatra, Kalimantan, and Sulawesi. It also operates palm oil refineries in the Mamuju Utara Regency in West Sulawesi province; and Dumai, Riau province. In addition, the company exports its processed palm oil products, including olein, and stearin to China, Bangladesh, Pakistan, Malaysia, the Philippines, and South Korea. Further, it operates fertilizer blending plants; and engages in the integrated cattle-in-plantation business. The company was founded in 1988 and is headquartered in Jakarta, Indonesia. PT Astra Agro Lestari Tbk is a subsidiary of PT Astra International Tbk.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "AALI.JK": {
        "short_name": "Astra Agro Lestari Tbk.",
        "long_name": "PT Astra Agro Lestari Tbk",
        "summary": "PT Astra Agro Lestari Tbk, together with its subsidiaries, engages in the palm oil business in Indonesia. It provides crude palm oil and its derivatives, palm kernel and its derivatives, and other products. The company manages 286,877 hectares of oil palm plantations in Sumatra, Kalimantan, and Sulawesi. It also operates palm oil refineries in the Mamuju Utara Regency in West Sulawesi province; and Dumai, Riau province. In addition, the company exports its processed palm oil products, including olein, and stearin to China, Bangladesh, Pakistan, Malaysia, the Philippines, and South Korea. Further, it operates fertilizer blending plants; and engages in the integrated cattle-in-plantation business. The company was founded in 1988 and is headquartered in Jakarta, Indonesia. PT Astra Agro Lestari Tbk is a subsidiary of PT Astra International Tbk.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "ADES.JK": {
        "short_name": "Akasha Wira International Tbk.",
        "long_name": "PT Akasha Wira International Tbk",
        "summary": "PT Akasha Wira International Tbk manufactures and distributes bottled drinking water and cosmetic products in Indonesia and internationally. It offers bottled drinking water under the Nestle Pure Life and Vica Royal brands; soy milk under the Pureal brand; and beauty care products, such as hair energy and hair recovery products under the Makarizo and Wella brand. The company was founded in 1985 and is headquartered in Jakarta, Indonesia. PT Akasha Wira International Tbk is a subsidiary of Water Partners Bottling S.A.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Beverages—Non-Alcoholic",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "AGAR.JK": {
        "short_name": "Asia Sejahtera Mina Tbk.",
        "long_name": "PT Asia Sejahtera Mina Tbk",
        "summary": "PT Asia Sejahtera Mina Tbk processes and sells seaweeds in Indonesia. The company offers dried Eucheuma cottonii, Eucheuma spinosum, and dried Gracilaria seaweeds. It also exports its products to the Philippines, South America, Denmark, Spain, Malaysia, and China. The company was founded in 2008 and is headquartered in Jakarta Barat, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Barat"
    },
    "AISA.JK": {
        "short_name": "Tiga Pilar Sejahtera Food Tbk.",
        "long_name": "PT Tiga Pilar Sejahtera Food Tbk",
        "summary": "PT Tiga Pilar Sejahtera Food Tbk, together with its subsidiaries, engages in food manufacturing and rice milling businesses in Indonesia. The company offers dried and instant noodles, dried and corn vermicelli, biscuits, candies, and snacks. It is also involved in palm oil plantation activity; and the operation of electric power plant. The company was formerly known as PT Tiga Pilar Sejahtera and changed its name to PT Tiga Pilar Sejahtera Food Tbk in 2003. PT Tiga Pilar Sejahtera Food Tbk was founded in 1959 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "ALTO.JK": {
        "short_name": "Tri Banyan Tirta Tbk.",
        "long_name": "PT Tri Banyan Tirta Tbk",
        "summary": "PT Tri Banyan Tirta Tbk manufactures and sells bottled mineral and flavored water under the Alto and Total brand names in Indonesia. It also sells alkaline water products under the Total 8+ brand. In addition, the company operates as an original equipment manufacturer for bottled VIT products. It serves plastic packaging, food, beverages, and canning/bottling industries, as well as packaging materials sector. The company was founded in 1997 and is headquartered in Sukabumi, Indonesia. PT Tri Banyan Tirta Tbk is a subsidiary of PT Fikasa Bintang Cemerlang.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Beverages—Non-Alcoholic",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Sukabumi"
    },
    "AMRT.JK": {
        "short_name": "Sumber Alfaria Trijaya Tbk.",
        "long_name": "PT Sumber Alfaria Trijaya Tbk",
        "summary": "PT Sumber Alfaria Trijaya Tbk engages in the retail distribution of consumer products in Indonesia. The company's stores offer food and non-food products. It also provides transportation and freight forwarding services; operates a pharmacy; and trades in medical equipment. PT Sumber Alfaria Trijaya Tbk sells its products through approximately 10,300 mini-markets under the Alfamart, Alfamidi, and Alfamidi super names, as well as through the Internet. The company was founded in 1989 and is headquartered in Tangerang, Indonesia. PT Sumber Alfaria Trijaya Tbk is a subsidiary of PT Sigmantara Alfindo.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "ANDI.JK": {
        "short_name": "Andira Agro Tbk.",
        "long_name": "PT. Andira Agro, Tbk",
        "summary": "PT Andira Agro Tbk owns, operates, and manages a crude palm oil mill and oil plantations in Indonesia. The company is involved in cultivating and harvesting fresh fruit bunches (FFB) from palm trees, as well as extracting and refining crude palm oil and palm kernel from FFB. It owns a total concession of 12,172 hectares. The company was founded in 1995 and is based in East Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "East Jakarta"
    },
    "ANJT.JK": {
        "short_name": "Austindo Nusantara Jaya Tbk.",
        "long_name": "PT Austindo Nusantara Jaya Tbk",
        "summary": "PT Austindo Nusantara Jaya Tbk engages in the oil palm plantation business in Indonesia. It operates in four segments: Palm Oil, Sago, Energy, and Others. The company offers crude palm oil and palm kernel, edamame, as well as processes tobacco; and produces sago starch. It also operates renewable energy biogas plant in Belitung Island. The company was formerly known as PT Austindo Teguh Jaya. PT Austindo Nusantara Jaya Tbk was founded in 1993 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "AYLS.JK": {
        "short_name": "Agro Yasa Lestari Tbk.",
        "long_name": "PT Agro Yasa Lestari Tbk",
        "summary": "PT. Agro Yasa Lestari Tbk engages in the wholesale trade of other construction materials, food and beverage products, and other agricultural products. It trades in asphalt, geosynthetic, and soybean beans meal. The company was founded in 2010 and is based in Central Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Central Jakarta"
    },
    "BEEF.JK": {
        "short_name": "Estika Tata Tiara Tbk.",
        "long_name": "PT Estika Tata Tiara Tbk",
        "summary": "PT Estika Tata Tiara Tbk produces, processes, distributes, and markets beef products. The company offers marinated beef, various grade of meatballs, beef salami and patties, frankfurter sausages, smoked and corned beef, minced beef, and other sausages under the Kibif, Boss, Kipao, Murato, and Adell brand names. It is also involved in the cattle breeding, meat packing and processing, warehouse and distribution, and logistics activities. The company was formerly known as PT Estika Tata Tiara and changed its name to PT Estika Tata Tiara Tbk. PT Estika Tata Tiara Tbk was founded in 2001 and is based in Cikarang, Indonesia. PT Estika Tata Tiara Tbk is a subsidiary of PT Tiga Tunggal Adimulya.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Cikarang"
    },
    "BNE.SI": {
        "short_name": "Kencana Agri",
        "long_name": "Kencana Agri Limited",
        "summary": "Kencana Agri Limited, together with its subsidiaries, operates as a plantation company in Indonesia, Malaysia, and internationally. It engages in the cultivation of oil palms; processing of fresh fruit bunches into crude palm oil (CPO), crude palm kernel oil, and palm kernel cake; and provision of bulking, and logistics services. It has oil palm plantations in Sumatra, Kalimantan, and Sulawesi regions of Indonesia. The company is also involved in the wholesale of electricity-related products and plantation-related products; provision of support storage facilities; and transportation of palm oil products. It markets and sells its products to trading companies, refineries, and oleochemical companies. As of December 31, 2019, the company had a total land bank of 115,737 hectares. The company was founded in 1996 and is based in Jakarta, Indonesia. Kencana Agri Limited is a subsidiary of Kencana Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Indonesia",
        "city": "Jakarta Barat"
    },
    "BTEK.JK": {
        "short_name": "Bumi Teknokultura Unggul Tbk",
        "long_name": "PT Bumi Teknokultura Unggul Tbk",
        "summary": "PT Bumi Teknokultura Unggul Tbk engages in cocoa bean processing activities in Indonesia. It also has various forest concession rights located in Papua Barat. In addition, the company engages in the nursery of forestry plants, food crops, medicinal plants, logging and tropical ornamental plants, as well as trading of logs. PT Bumi Teknokultura Unggul Tbk was founded in 2001 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "South Jakarta"
    },
    "BUA.SG": {
        "short_name": "Budi Starch&Sweetener Tbk, PT R",
        "long_name": "PT Budi Starch & Sweetener Tbk",
        "summary": "PT Budi Starch & Sweetener Tbk, together with its subsidiaries, produces and sells cassava-based products in Indonesia and internationally. The company offers tapioca starch and modified tapioca starch for use in food, chemicals, flavoring spices, paper making, and clothing; and sweeteners, such as glucose, fructose, sorbitol, and maltodextrine. It also provides plastic sheeting products and polypropylene woven bags for packaging applications; sulfuric acid for use in fertilizer manufacturing industries, rayon, coloring agents, medicines, detergents, inorganic salts, oil refineries, and metallurgical processes; citric acid and other chemicals; and organic fertilizers. In addition, the company engages in trading business. The company was formerly known as PT Budi Acid Jaya Tbk and changed its name to PT Budi Starch & Sweetener Tbk in July 2013. PT Budi Starch & Sweetener Tbk was founded in 1979 and is headquartered in Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "BUDI.JK": {
        "short_name": "Budi Starch & Sweetener Tbk.",
        "long_name": "PT Budi Starch & Sweetener Tbk",
        "summary": "PT Budi Starch & Sweetener Tbk, together with its subsidiaries, produces and sells cassava-based products in Indonesia and internationally. The company offers tapioca starch and modified tapioca starch for use in food, chemicals, flavoring spices, paper making, and clothing; and sweeteners, such as glucose, fructose, sorbitol, and maltodextrine. It also provides plastic sheeting products and polypropylene woven bags for packaging applications; sulfuric acid for use in fertilizer manufacturing industries, rayon, coloring agents, medicines, detergents, inorganic salts, oil refineries, and metallurgical processes; citric acid and other chemicals; and organic fertilizers. In addition, the company engages in trading business. The company was formerly known as PT Budi Acid Jaya Tbk and changed its name to PT Budi Starch & Sweetener Tbk in July 2013. PT Budi Starch & Sweetener Tbk was founded in 1979 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "BWPT.JK": {
        "short_name": "Eagle High Plantations Tbk.",
        "long_name": "PT Eagle High Plantations Tbk",
        "summary": "PT Eagle High Plantations Tbk, together with its subsidiaries, operates palm plantations in Indonesia and Singapore. It operates in two segments, Plantations and Manufacturing. The company offers palm products, including crude palm oil and palm kernel. As of December 31, 2019, its total planted area was approximately 124,218 hectares in Kalimantan, Sumatera, Sulawesi, and Papua. The company also engages in the palm oil mill and bulking, and investment holding activities. PT Eagle High Plantations Tbk was founded in 2000 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "CAMP.JK": {
        "short_name": "Campina Ice Cream Industry Tbk.",
        "long_name": "PT Campina Ice Cream Industry, Tbk.",
        "summary": "PT Campina Ice Cream Industry, Tbk. produces, markets, and distributes ice creams in Indonesia. It offers cake, cone, cup, pack, and stick ice creams. The company was founded in 1972 and is headquartered in Surabaya, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Surabaya"
    },
    "CEKA.JK": {
        "short_name": "Wilmar Cahaya Indonesia Tbk.",
        "long_name": "PT Wilmar Cahaya Indonesia Tbk.",
        "summary": "PT Wilmar Cahaya Indonesia Tbk. produces and sells vegetable and specialty oils in Indonesia. It offers specialty fats, including cocoa butter substitutes, cocoa butter replacers, cocoa butter equivalents, confectionary fats, icing and filling fats, milk fat replacers, ice cream fats, and spread fats, as well as bakery fats. The company was formerly known as PT Cahaya Kalbar Tbk. and changed its name to PT Wilmar Cahaya Indonesia Tbk. in May 2013. The company was founded in 1968 and is headquartered in Bekasi, Indonesia. PT Wilmar Cahaya Indonesia Tbk. is a subsidiary of PT Sentratama Niaga Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "CLEO.JK": {
        "short_name": "Sariguna Primatirta Tbk.",
        "long_name": "PT Sariguna Primatirta Tbk",
        "summary": "PT Sariguna Primatirta Tbk engages in the bottled water business in Indonesia. It operates through Bottle, Non Bottle, and Others segments. The company provides packaged drinking water under the Anda, Cleo Platine, S-Tube, Super O2, Vio 8+, and Cleo Pure Water brands. It also offers industry and trading services. The company was formerly known as PT Sari Guna and changed its name to PT Sariguna Primatirta Tbk in December 1988. The company was founded in 1988 and is headquartered in Sidoarjo, Indonesia. PT Sariguna Primatirta Tbk is a subsidiary of PT Tancorp Global Abadi.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Beverages—Non-Alcoholic",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Sidoarjo"
    },
    "COCO.JK": {
        "short_name": "Wahana Interfood Nusantara Tbk.",
        "long_name": "PT Wahana Interfood Nusantara Tbk",
        "summary": "PT Wahana Interfood Nusantara Tbk manufactures and sells cocoa and chocolate products in Indonesia. The company provides cocoa powder, couverture and compound chocolates, spreads and fillings, and chocolate powder drinks. It sells its products under the SCHOKO brand name for food manufacturers, food services, and retailers. The company also exports its products to Asia, Europe, Australia, New Zealand, and the United States. PT Wahana Interfood Nusantara Tbk was founded in 2006 and is based in Bandung, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Bandung"
    },
    "CPIN.JK": {
        "short_name": "Charoen Pokphand Indonesia Tbk",
        "long_name": "PT Charoen Pokphand Indonesia Tbk",
        "summary": "PT Charoen Pokphand Indonesia Tbk produces and sells poultry feed, day old chicks (DOC), processed chicken, and other food products in Indonesia. The company offers broiler and layer poultry feed; and various poultry feed products for parent stock, duck, native chicken, fighting cock, and quail, as well as feed for cattle and swine under the brands of HI-PRO, HI-PRO-VITE, BINTANG, BONAVITE, ROYAL FEED, TURBO FEED, and TIJI. It also provides various types of DOC, such as broiler DOC; layer DOC; and other DOC, such as DOC for parent stock and male layer. In addition, the company sells various food products under the Golden Fiesta, Fiesta, Champ, and Okey brands. Further, it is involved in poultry farming and beverage activities; the trade of processed chicken; the production of plastic packaging products; the production and distribution of chicken feather meal; and the operation of restaurants and convenience stores. The company was formerly known as PT Charoen Pokphand Indonesia Animal Feedmill Co. Limited. PT Charoen Pokphand Indonesia Tbk was founded in 1972 and is headquartered in Jakarta, Indonesia. PT Charoen Pokphand Indonesia Tbk is a subsidiary of PT Charoen Pokphand Indonesia Group.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "CPRO.JK": {
        "short_name": "Central Proteina Prima Tbk.",
        "long_name": "PT Central Proteina Prima Tbk",
        "summary": "PT Central Proteina Prima Tbk, together with its subsidiaries, operates as an integrated aquaculture company in Indonesia and internationally. The company operates through Feeds, Food Products, and Others segments. It engages in the shrimp farming and hatchery activities; cold storage and trading of shrimps; and production and sale of shrimp and fish feeds. The company also provides fry and pet food products; shrimp and processed food products; and shrimp and fish probiotics, as well as aquaculture chemicals. In addition, it offers medicines for shrimp and fish. The company sells its products through retail outlets, which cover hypermarts, supermarkets, minimarts, convenient stores, and traditional mom-and-pop stores; and supplies to hotels, restaurants, and cafeterias in Indonesia. It also exports its products to the United States, Europe, and Japan. The company was formerly known as PT Central Proteinaprima Tbk and changed its name to PT Central Proteina Prima Tbk in June 2014. PT Central Proteina Prima Tbk was founded in 1980 and is headquartered in Jakarta Selatan, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "CSRA.JK": {
        "short_name": "Cisadane Sawit Raya Tbk.",
        "long_name": "PT Cisadane Sawit Raya Tbk",
        "summary": "PT Cisadane Sawit Raya Tbk. operates oil palm plantations in Indonesia. The company was founded in 1983 and is headquartered in North Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Utara"
    },
    "D7V.F": {
        "short_name": "MAYORA INDAH  RP 20",
        "long_name": "PT Mayora Indah Tbk",
        "summary": "PT Mayora Indah Tbk, together with its subsidiaries, manufactures and sells food and beverage products in Indonesia, rest of Asia, and internationally. It operates through three segments: Packaged Food Processing, Packaged Beverages Processing, and Financial Services. The company offers biscuits under the Roma Marie Susu, Roma Marie Susu Gold, Roma Kelapa, Roma Kelapa Cream, Roma Sandwich, Roma Malkist, Roma Malkist Abon, Roma Malkist Coklat, Roma Malkist Krim Keju Manis, Roma Malkist Krim Tiramisu, Roma Cream Creakers, Royal Choice, Better, Slai O Lai, Sari Gandum, Sari Gandum Sandwich, Roma Cookies, Roma Arden, dll, and other brands names; candies under the Kopiko, Kopiko Cappuccino, KIS, Tamarin, dll, and other brand names; and wafers under the Beng Beng, Beng Beng Maxx, Beng Beng Share It, Astor, Roma Wafer Coklat, Roma Zuperrr Keju, Roma Choco Blast, dll, and other brand names. It also provides chocolates under the Choki-Choki and Drink Beng Beng brands; coffee under the Torabika Duo, Torabika Duo Susu Full Cream, Torabika 3 in 1, Torabika Moka, Torabika Cappuccino, Torabika Jahe Susu, Torabika Creamy Latte, Torabika Kopi Susu Espreso, Kopiko Brown Coffee, Toracafe Volcano Chocomelt, Toracafe Caramelove, Torabika Milky Latte, dll, and other brand names; and health food products under the Energen Cereal, Energen Oatmilk, and Prima Cereal brands. In addition, it is involved in provision of financial services; and processing of coffee powder and instant coffee, and cacao beans. PT Mayora Indah Tbk was founded in 1977 and is headquartered in West Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta Barat"
    },
    "DLTA.JK": {
        "short_name": "Delta Djakarta Tbk.",
        "long_name": "PT Delta Djakarta Tbk",
        "summary": "PT Delta Djakarta Tbk manufactures and distributes alcoholic beverages in Indonesia. The company offers pilsener and stout beers under the Anker Beer, Anker Lychee, Anker Stout, Carlsberg, Kuda Putih, San Mig Light, San Miguel Pale, and San Miguel Cerveza Negra brands. It also exports its products. The company was founded in 1932 and is headquartered in Bekasi, Indonesia. PT Delta Djakarta Tbk is a subsidiary of San Miguel Malaysia (L) Private Limited.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Beverages—Brewers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "DMND.JK": {
        "short_name": "Diamond Food Indonesia Tbk.",
        "long_name": "PT Diamond Food Indonesia Tbk",
        "summary": "PT Diamond Food Indonesia Tbk manufactures and distributes consumer goods in Indonesia. Its products include milk and cheese products, juices, chocolates, yogurts, ice creams, dressings, toppings and creamidor products. The company is also involved in the production and processing of dairy-based products and frozen food products; trading and distribution of food and beverage products, and non-food equipment and supplies; and retail of food and beverage products. PT Diamond Food Indonesia Tbk was founded in 1995 and is based in Central Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Central Jakarta"
    },
    "DPUM.JK": {
        "short_name": "Dua Putra Utama Makmur Tbk.",
        "long_name": "PT Dua Putra Utama Makmur Tbk",
        "summary": "PT Dua Putra Utama Makmur Tbk engages in the fisheries and trading businesses in Indonesia. Its fish products include Indian mackerel, black pomfret, narrow-barred Spanish mackerel, large-head hairtail, snapper, spotted sardine, moonfish, round scad, short-fin scad, bullet tuna, frigate tuna, skipjack tuna, trevally, barracuda, thread-fin bream, hard-tail scad, leather jacket, tuna, purple-spotted big eye, grouper, conger eel, emperor, parrotfish, lizardfish, banyar fish, hammer croaker, samge, swangi, bloso, lemadang, silago, grouper, pure-bred, deho, salem, splotch, salmon, trevally, badong, tuna, manyung, kuniran, milkfish, jahan, etc. The company also provides shrimp products comprising white, black tiger, sea tiger, pink, flower, and vannamei shrimps; and squids, cuttlefish, and octopus. In addition, it offers processed food, including marugoto, ebi furay, ebi fritter, katsu ball squid and shrimp, nugget shrimp, squid nugget and beef, and shrimp steak and meatballs. The company was founded in 2012 and is headquartered in Pati, Indonesia. PT Dua Putra Utama Makmur Tbk is a subsidiary of PT Pandawa Putra Investama.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Pati"
    },
    "DSFI.JK": {
        "short_name": "Dharma Samudera Fishing Industr",
        "long_name": "PT Dharma Samudera Fishing Industries Tbk",
        "summary": "PT Dharma Samudera Fishing Industries Tbk, together with its subsidiary, engages in collecting, processing, marketing, and trading of fishing products in Indonesia. It offers fish fillet, red snapper, grouper, tuna, king fish, octopus, cuttlefish, barramundi, malabar snapper, squid, and other products. The company also exports its products to Japan, Europe, the United States, and internationally. PT Dharma Samudera Fishing Industries Tbk was founded in 1973 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "DSNG.JK": {
        "short_name": "Dharma Satya Nusantara Tbk.",
        "long_name": "PT Dharma Satya Nusantara Tbk",
        "summary": "PT Dharma Satya Nusantara Tbk engages in the forestry, agriculture and plantation, transportation, plant construction, service, and trading industries in Indonesia. It operates through three segments: Palm Oil, Wood Products, and Others. The company plants, produces, and sells palm oil products, including crude palm oil, palm kernel, and palm kernel oil. It also provides various wood products, such as block boards and plywood, as well as panels and engineered floors. As of December 31, 2019, the company had 112,450 hectares of planted areas of palm oil plantations. It also exports its products to Europe, Central America, Canada, Japan, Asia, and the Middle East. The company was founded in 1980 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "ENZO.JK": {
        "short_name": "Morenzo Abadi Perkasa Tbk.",
        "long_name": "PT Morenzo Abadi Perkasa Tbk",
        "summary": "PT Morenzo Abadi Perkasa engages in the processing and export of seafood to various countries. It offers a range of products from pasteurized crabmeat to frozen seafood, such as squid, shrimp, soft shell crab, octopus, cuttlefish, etc. The company was founded in 2013 and is headquartered in Demak, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Demak"
    },
    "FAPA.JK": {
        "short_name": "FAP Agri Tbk.",
        "long_name": "PT FAP Agri Tbk",
        "summary": "PT FAP Agri Tbk operates as an agricultural producing company in Indonesia. It processes and produces palm oil and other related products. The company is based in West Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "West Jakarta"
    },
    "FISH.JK": {
        "short_name": "FKS Multi Agro Tbk.",
        "long_name": "PT FKS Multi Agro Tbk",
        "summary": "PT FKS Multi Agro Tbk, together with its subsidiaries, supplies food and feed ingredients in Indonesia. It operates through three segments: Trading and Distribution, Manufacturing, and Logistic. The company engages in the wholesale trading of various goods, which includes canola seed, millet, and canary seed; food and beverages consisting rice flour, tapioca flour, caramel, shrimp crackers, pet food, and animal feed; and agriculture yields, as well as rice, corn, un-hulled rice, wheat, secondary crops, and other cereals; and other agricultural products and live animals. It also offers fishery products, such as fish, shrimp, crabs, oysters, pearls, clams, seaweed, sponges and frogs, and fish seeds; vegetable oils and fats; pharmaceuticals; and fish meal and oil products. In addition, the company provides business advisory services; purchases, sells, leases, and operates properties, such as apartment, residential, and non-residential buildings; warehousing and storage services; and cold storage services. Further, it provides fermented and non-fermented soybean products; oilseed meals include soybean meals and rapeseed meals; grain milling co-products, consisting dried distiller's grains soluble, wheat bran, and corn gluten meal and feed products; and logistics services, including port logistics, warehouse management, transport, and distribution services, as well as bulk handling and product packaging services. Additionally, the company involved in the development and management of industrial zones; and provision of loading and unloading services. It serves aquaculture and animal feed industries, and food processors. The company was formerly known as PT Fishindo Kusuma Sejahtera Tbk and changed its name to PT FKS Multi Agro Tbk in June 2006. PT FKS Multi Agro Tbk was founded in 1992 and is headquartered in South Jakarta, Indonesia. PT FKS Multi Agro Tbk is a subsidiary of PT FKS Corporindo Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "FOOD.JK": {
        "short_name": "Sentra Food Indonesia Tbk.",
        "long_name": "PT Sentra Food Indonesia Tbk",
        "summary": "PT Sentra Food Indonesia Tbk engages in selling and processing of fresh meat and food and beverages products in Indonesia. The company operates through Fresh Meat, Processed Meat, and Others divisions. It offers sausages, burgers, meatballs, delicatessen, kebabs, dried beef, mayonnaise, and thousand island. The company was formerly known as PT Sentra Darmaga and changed its name to PT Sentra Food Indonesia Tbk in August 2018. The company was founded in 2004 and is headquartered in Jakarta Selatan, Indonesia. PT Sentra Food Indonesia Tbk is a subsidiary of PT Super Capital Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "GGG.F": {
        "short_name": "PT GUDANG GAR.  RP 500",
        "long_name": "PT Gudang Garam Tbk",
        "summary": "PT Gudang Garam Tbk produces and sells cigarettes in Indonesia and internationally. The company operates through Cigarettes, Paperboards, and Others segments. It offers hand-rolled, machine-made, and klobot clove cigarettes. The company markets its products under the Gudang Garam Family, Surya Family, and GG Family brand names. It is also involved in trading activities. In addition, the company provides non-scheduled air transportation and entertainment services. The company was formerly known as PT Perusahaan Rokok Tjap Â\u0093Gudang GaramÂ\u0094 Kediri. PT Gudang Garam Tbk was founded in 1958 and is headquartered in Kediri, Indonesia. PT Gudang Garam Tbk is a subsidiary of PT Suryaduta Investama.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Tobacco",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Kediri"
    },
    "GGNPF": {
        "short_name": "GUDANG GARAM TBK",
        "long_name": "PT Gudang Garam Tbk",
        "summary": "PT Gudang Garam Tbk produces and sells cigarettes in Indonesia and internationally. The company operates through Cigarettes, Paperboards, and Others segments. It offers hand-rolled, machine-made, and klobot clove cigarettes. The company markets its products under the Gudang Garam Family, Surya Family, and GG Family brand names. It is also involved in trading activities. In addition, the company provides non-scheduled air transportation and entertainment services. The company was formerly known as PT Perusahaan Rokok Tjap Â\u0093Gudang GaramÂ\u0094 Kediri. PT Gudang Garam Tbk was founded in 1958 and is headquartered in Kediri, Indonesia. PT Gudang Garam Tbk is a subsidiary of PT Suryaduta Investama.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Tobacco",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "city": "Kediri"
    },
    "GGRM.JK": {
        "short_name": "Gudang Garam Tbk.",
        "long_name": "PT Gudang Garam Tbk",
        "summary": "PT Gudang Garam Tbk produces and sells cigarettes in Indonesia and internationally. The company operates through Cigarettes, Paperboards, and Others segments. It offers hand-rolled, machine-made, and klobot clove cigarettes. The company markets its products under the Gudang Garam Family, Surya Family, and GG Family brand names. It is also involved in trading activities. In addition, the company provides non-scheduled air transportation and entertainment services. The company was formerly known as PT Perusahaan Rokok Tjap Â\u0093Gudang GaramÂ\u0094 Kediri. PT Gudang Garam Tbk was founded in 1958 and is headquartered in Kediri, Indonesia. PT Gudang Garam Tbk is a subsidiary of PT Suryaduta Investama.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Tobacco",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Kediri"
    },
    "GOOD.JK": {
        "short_name": "Garudafood Putra Putri Jaya Tbk",
        "long_name": "PT Garudafood Putra Putri Jaya Tbk",
        "summary": "PT Garudafood Putra Putri Jaya Tbk provides snacks and beverages in Indonesia. The company operates through Snack Foods, Beverages, and Others segments. It offers biscuits, peanuts, bread, chocolates, ready-to-drink drinks, confectioneries, and milk processing products; and snacks, such as atomic, salted, sukro, and crunchy peanuts, as well as foods made from soybeans and other nuts. The company also exports its products. The company was founded in 1994 and is headquartered in Jakarta, Indonesia. PT Garudafood Putra Putri Jaya Tbk is a subsidiary of PT Tudung Putra Putri Jaya.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "GZCO.JK": {
        "short_name": "Gozco Plantations Tbk.",
        "long_name": "PT Gozco Plantations Tbk",
        "summary": "PT Gozco Plantations Tbk, together with its subsidiaries, develops and operates oil palm plantations. It is also involved in the processing of crude palm oil and palm kernel; and production of fruit bunches for distribution in Indonesia. The company was formerly known as PT Surya Gemilang Sentosa and changed its name to PT Gozco Plantations Tbk in December 2007. The company was founded in 2001 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "South Jakarta"
    },
    "HMSP.JK": {
        "short_name": "H.M. Sampoerna Tbk.",
        "long_name": "PT Hanjaya Mandala Sampoerna Tbk",
        "summary": "PT Hanjaya Mandala Sampoerna Tbk manufactures and trades in cigarettes in Indonesia. The company engages in the general trading, property development, and expedition and warehousing businesses; e-commerce and agency activities; and the provision of leisure and golf services. It sells its products under the Dji Sam Soe, Sampoerna A, Sampoerna Kretek, and Sampoerna U brand names. The company was founded in 1913 and is headquartered in Surabaya, Indonesia. PT Hanjaya Mandala Sampoerna Tbk is a subsidiary of PT Philip Morris Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Tobacco",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Surabaya"
    },
    "HOKI.JK": {
        "short_name": "Buyung Poetra Sembada Tbk.",
        "long_name": "PT Buyung Poetra Sembada Tbk",
        "summary": "PT Buyung Poetra Sembada Tbk produces and distributes rice in Indonesia. It supplies rice to supermarkets, hypermarkets, and other retail networks under the LIMAS, HOKI, Topi Koki, BPS, and Belida brand names; and broken rice to vermicelli plants. The company was founded in 2003 and is headquartered in East Jakarta, Indonesia. PT Buyung Poetra Sembada Tbk operates as a subsidiary of PT Buyung Investama Gemilang.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Timur"
    },
    "HSZ.F": {
        "short_name": "HANJAYA MAND.S.TBK  RP 4",
        "long_name": "PT Hanjaya Mandala Sampoerna Tbk",
        "summary": "PT Hanjaya Mandala Sampoerna Tbk manufactures and trades in cigarettes in Indonesia. The company engages in the general trading, property development, and expedition and warehousing businesses; e-commerce and agency activities; and the provision of leisure and golf services. It sells its products under the Dji Sam Soe, Sampoerna A, Sampoerna Kretek, and Sampoerna U brand names. The company was founded in 1913 and is headquartered in Surabaya, Indonesia. PT Hanjaya Mandala Sampoerna Tbk is a subsidiary of PT Philip Morris Indonesia.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Tobacco",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Surabaya"
    },
    "ICBP.JK": {
        "short_name": "Indofood CBP Sukses Makmur Tbk.",
        "long_name": "PT Indofood CBP Sukses Makmur Tbk",
        "summary": "PT Indofood CBP Sukses Makmur Tbk produces and sells consumers products in Indonesia and internationally. It offers noodles, sauces, and instant seasonings under the Indomie, Supermi, Sarimi, Pop Mie, Sakura, and Mi Telur Cap 3 Ayam brands. The company also provides sweetened condensed milk; UHT, sterilized bottled, and pasteurized liquid milk; powdered milk; ice cream; and butter under the Indomilk, Cap Enaak, Tiga Sapi, Kremer, Orchid Butter, Indoeskrim, Good To Go, and Milkuat brands. In addition, it offers chips and non-chips snacks under the Chitato, Qtela, Lays, Chiki, Cheetos, Jetz, Trenz, Wonderland, Dueto, Doritos brands; and food seasonings, including powdered and liquid seasonings, condiments, and syrups under the Sambal Indofood, Bumbu Special Indofood, Bumbu Racik, Indofood Freiss, Kecap Indofood, and Kecap Piring Lombok brands. Further, the company provides nutrition and special foods, such as baby cereals, follow-on cereals, noodle soups, and baby biscuits, as well as fortified milk for expectant and lactating mothers under the Promina, Sun, Govit, and Gowell brands. Additionally, it offers beverages comprising non-alcoholic beverage products, including tea, packaged water and fruit-flavored drinks, under the brands of Ichi Ocha, Club, and Fruitamin. The company also manufactures packaging materials; provides management consulting, general trading, and transportation services; processes oil and fats; markets and distributes paper diapers; and manages restaurants. The company was founded in 1982 and is headquartered in Jakarta, Indonesia. PT Indofood CBP Sukses Makmur Tbk is a subsidiary of PT Indofood Sukses Makmur Tbk.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "IKAN.JK": {
        "short_name": "Era Mandiri Cemerlang Tbk.",
        "long_name": "PT Era Mandiri Cemerlang Tbk",
        "summary": "PT Era Mandiri Cemerlang Tbk operates in the processing and trade sectors of fishery products in Indonesia and internationally. The company produces and supplies seafood products. It offers mahi-mahi, tuna, swordfish, oilfish, red snapper, grouper, and octopus products. The company was founded in 2000 and is headquartered in Jakarta, Indonesia. PT Era Mandiri Cemerlang Tbk is a subsidiary of PT Berkah Delapan Samudera.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "INDF.JK": {
        "short_name": "Indofood Sukses Makmur Tbk.",
        "long_name": "PT Indofood Sukses Makmur Tbk",
        "summary": "PT Indofood Sukses Makmur Tbk produces and sells various food products in Indonesia and internationally. It operates through four segments: Consumer Branded Products Business Group, Bogasari Business Group, Agribusiness Group, and Distribution Business Group. The Consumer Branded Products Business Group segment offers noodles; dairy products, including sweetened condensed, temperature, sterilized bottled, pasteurized liquid, multi-cereal, and powdered milk, as well as butter, ice cream, and creamer; snack foods, such as potato, cassava, soybean, sweet potato, and various extruded snacks, as well as biscuits; culinary products and syrups; nutrition and special foods; and ready-to-drink tea, packaged water, and fruit-flavored drinks. The Bogasari Business Group segment produces flour and pasta. The Agribusiness Group segment produces palm oil, rubber, sugar cane, timber, cocoa, and tea; and manufactures and markets cooking oils, margarines, shortenings, and other by-products. The Distribution Business Group segment distributes third-party products. It is also involved in the shipping, investment, trade export agency, industrial estate, and restaurant chain management activities; ownership and management of buildings; and provision of management consulting, flour blending and trading, and research management and technical services, as well as packaging materials and fertilizers. In addition, it manufactures coffee; extracts and processes coconut oil; operates bulking station; provides transportation services; and markets and distributes paper diapers and packaged drinking water. The company was formerly known as PT Panganjaya Intikusuma and changed its name to PT Indofood Sukses Makmur Tbk in 1994. The company was founded in 1990 and is headquartered in Jakarta, Indonesia. PT Indofood Sukses Makmur Tbk is a subsidiary of First Pacific Investment Management Limited.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "ITIC.JK": {
        "short_name": "Indonesian Tobacco Tbk.",
        "long_name": "PT Indonesian Tobacco Tbk",
        "summary": "PT Indonesian Tobacco Tbk manufactures and sells cigarettes and tobacco in Indonesia. The company processes tobacco leaves into finished products in the form of self-rolled tobacco or tobacco shags. It also exports its products to Singapore, Malaysia, and Japan. The company was founded in 1955 and is headquartered in Malang, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Tobacco",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Malang"
    },
    "JAWA.JK": {
        "short_name": "Jaya Agra Wattie Tbk.",
        "long_name": "PT Jaya Agra Wattie Tbk",
        "summary": "PT Jaya Agra Wattie Tbk, through its subsidiaries, engages in the cultivation, processing, logistics, and marketing of agricultural products in Indonesia and internationally. The company operates through three segments: Rubber, Palm Oil, and Others. It produces and sells rubber, coffee, tea, cocoa, palm oil, and other agricultural products. The company was formerly known as Handel Maatschappij J.A. Wattie and Company Limited and changed its name to PT Jaya Agra Wattie Tbk in 1987. PT Jaya Agra Wattie Tbk was founded in 1921 and is headquartered in Jakarta, Indonesia. PT Jaya Agra Wattie Tbk is a subsidiary of PT Sarana Agro Investama.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "JPFA.JK": {
        "short_name": "Japfa Comfeed Indonesia Tbk.",
        "long_name": "PT Japfa Comfeed Indonesia Tbk",
        "summary": "PT Japfa Comfeed Indonesia Tbk operates as an agri-food company. The company operates in six segments: Animal Feed, Poultry Breeding, Commercial Farm and Poultry Processing, Aquaculture, Beef, and Trading and Others. It provides poultry feed, day old chick broilers/layers and pullets, commercial live broiler birds, and processed chicken products; and feed for fresh, brackish, and marine water fishes and shrimps. The company also operates cold storage and processing plants, as well as fresh water fish farming, and shrimp farming and hatcheries. In addition, it engages in commercial farming, and beef processing and cattle slaughtering activities. Further, it provides woven plastic bags, crude coconut oil and copra extraction meal, animal vaccines, veterinary medicines, and livestock equipment. Additionally, it is involved in the real estate, plantation, general trading, marine transportation, and investment activities. The company markets its products in Indonesia, Asia, Europe, and the United States. The company was founded in 1971 and is headquartered in Jakarta, Indonesia. PT Japfa Comfeed Indonesia Tbk is a subsidiary of Japfa Ltd.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "KEBA.F": {
        "short_name": "KENCANA AGRI LTD",
        "long_name": "Kencana Agri Limited",
        "summary": "Kencana Agri Limited, together with its subsidiaries, operates as a plantation company in Indonesia, Malaysia, and internationally. It engages in the cultivation of oil palms; processing of fresh fruit bunches into crude palm oil (CPO), crude palm kernel oil, and palm kernel cake; and provision of bulking, and logistics services. It has oil palm plantations in Sumatra, Kalimantan, and Sulawesi regions of Indonesia. The company is also involved in the wholesale of electricity-related products and plantation-related products; provision of support storage facilities; and transportation of palm oil products. It markets and sells its products to trading companies, refineries, and oleochemical companies. As of December 31, 2019, the company had a total land bank of 115,737 hectares. The company was founded in 1996 and is based in Jakarta, Indonesia. Kencana Agri Limited is a subsidiary of Kencana Holdings Pte. Ltd.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta Barat"
    },
    "KEJU.JK": {
        "short_name": "Mulia Boga Raya Tbk.",
        "long_name": "PT Mulia Boga Raya Tbk",
        "summary": "PT Mulia Boga Raya Tbk manufactures and sells cheese and mayonnaise for salad dressing under the Prochiz brand name in Indonesia. The company offers block and sliced cheese, and other products. It sells its products through its own marketing force and third-party distributors. The company also exports its products. PT Mulia Boga Raya Tbk was founded in 2006 and is based in Bekasi, Indonesia. As of October 14, 2020, PT Mulia Boga Raya Tbk operates as a subsidiary of PT Garudafood Putra Putri Jaya Tbk.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "KMDS.JK": {
        "short_name": "Kurniamitra Duta Sentosa Tbk.",
        "long_name": "PT Kurniamitra Duta Sentosa, Tbk",
        "summary": "PT Kurniamitra Duta Sentosa, Tbk operates as a food and beverage industry in Indonesia. It imports and sells syrups, fruit mixes, frappe products, and gourmet sauces; coffee products; almond milk, soy milk, coconut milk, dairy milk, and free lactose milk products; and coffee makers. The company was founded in 2000 and is headquartered in Tangerang Selatan, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang Selatan"
    },
    "LSIP.JK": {
        "short_name": "PP London Sumatra Indonesia Tbk",
        "long_name": "PT Perusahaan Perkebunan London Sumatra Indonesia Tbk",
        "summary": "PT Perusahaan Perkebunan London Sumatra Indonesia Tbk, together with its subsidiaries, engages in the plantation business in Indonesia. It operates through four segments: Oil Palm Products, Rubber, Seeds, and Others. The company offers crude palm oil and rubber, as well as cocoa, tea, and oil palm seeds. It also develops plantations on behalf of local smallholders. As of December 31, 2019, the company had a total planted area of 115,665 hectares comprising 95,637 hectares of palm oil; 15,945 hectares of rubber; and 4,083 hectares of cocoa, tea, and other crops in North Sumatra, South Sumatra, East Kalimantan, North Sulawesi, South Sulawesi, and Java. In addition, it is involved in the research, processing, trading, marketing, industrial, and agency/representative activities; and invests in agricultural technology and cultivation, as well as agriculture, forestry, and fishery businesses. The company also exports its products. The company was founded in 1906 and is headquartered in South Jakarta, Indonesia. PT Perusahaan Perkebunan London Sumatra Indonesia Tbk is a subsidiary of PT Salim Ivomas Pratama Tbk.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "MAGP.JK": {
        "short_name": "Multi Agro Gemilang Plantation ",
        "long_name": "PT Multi Agro Gemilang Plantation Tbk",
        "summary": "PT Multi Agro Gemilang Plantation Tbk, together with its subsidiaries, engages in the oil palm plantation business in Indonesia. The company was founded in 2005 and is headquartered in Jakarta, Indonesia. PT Multi Agro Gemilang Plantation Tbk is a subsidiary of PT Santika Griya Persada.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "MAIN.JK": {
        "short_name": "Malindo Feedmill Tbk.",
        "long_name": "PT Malindo Feedmill Tbk",
        "summary": "PT Malindo Feedmill Tbk, together with its subsidiaries, engages in the animal feed, breeding and broiler farm, and food processing businesses in Indonesia. It offers broiler, layer, duck, and other livestock feed products; and parent stock and day old chicken final stock. The company also produces broiler chickens; and provides consumer products, such as chicken nuggets, chicken tempura, chicken sticks, chicken wings, tulip wings, chicken karaage, chicken drumstick, chicken sausage, and combined variant packs under the SunnyGold and Ciki Wiki brands. The company was founded in 1997 and is headquartered in Jakarta Selatan, Indonesia. PT Malindo Feedmill Tbk is a subsidiary of Dragon Amity Pte. Ltd.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "MBTO.JK": {
        "short_name": "Martina Berto Tbk.",
        "long_name": "PT Martina Berto Tbk",
        "summary": "PT Martina Berto Tbk, together with its subsidiaries, manufactures and sells herbal medicines and cosmetic products in Indonesia and internationally. It is also involved in marketing and trading cosmetics, beauty care products, and herbal medicines. In addition, the company engages in contract manufacturing of private labels for dry cosmetics, semi solid cosmetics, liquid cosmetics, and aerosols. PT Martina Berto Tbk markets its products through online stores, chain stores, and supermarkets, as well as through wholesalers, cosmetic retailers, beauty salons, and spas. It sells its products under the Cempaka, Martina, Pesona, Biokos Martha Tilaar, Caring Colours Martha Tilaar, and Belia Martha Tilaar. The company was founded in 1977 and is headquartered in Jakarta, Indonesia. PT Martina Berto Tbk is a subsidiary of PT Marthana Megahayu Inti.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "MGRO.JK": {
        "short_name": "Mahkota Group Tbk.",
        "long_name": "PT Mahkota Group Tbk",
        "summary": "PT Mahkota Group Tbk engages in the palm oil processing and its derivatives businesses in Indonesia. The company produces crude palm oil, palm kernel, and other derivative products. It also offers logistic services; and engages in palm oil plantation activities. The company was founded in 2011 and is headquartered in Medan, Indonesia. PT Mahkota Group Tbk is a subsidiary of Pt Mahkota Global Investama.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Medan"
    },
    "MICE.JK": {
        "short_name": "Multi Indocitra Tbk.",
        "long_name": "PT Multi Indocitra Tbk",
        "summary": "PT Multi Indocitra Tbk produces and trades in baby and health care products, and cosmetics in Indonesia. The company offers baby products and healthcare products, including bottle, nipple, breast feeding accs, feeding accs, nursing accs, healthcare accs, teether, pacifier, breast pads and pumps, baby wipes, baby and kids toiletries, and baby skin care products; personal care products, such as face and compact powder, two way cake, facial foam, and moisturizer; and cosmetics, which includes body lotions, hand gels, lip care, lipstiks, eyes shadows, and make up. It also provides skincare products consists of shower cream and bubble foam shower; hotwheels, barbie, thomas & friends, fisher price, and mega bloks; shaver and refill cartridges; adult and baby diapers; gummy vitamin for kids, adult, beauty, and expectant mom; air fresheners; kitchen cleaners; floor cleaners; cleaner for all surfaces and glasses; ready to drink soya milk; lampu LEDs, daylight and warmwhite bulbs, and flood lights; and viva face tonic, milk cleansers, scin foods, air mawar, eye brow pencils, and liquid foundations. In addition, the company offers food and beverage products, including lexus, oat crunch, samudra, crackers, topmix, and funmixed munchy's; ota moruku, crack potato, miaowmiaow, omypop, and mini rice crack potatoes; waisun, southern, marshmallow, and lot sour 100 candies; and d'best birdness, guava, tea, soya starway, dolphin, and wanfa drink beverages. It sells its brands under the Pigeon and Lock&Lock brands name. The company offers its products through its own distribution centers, as well as third party suppliers and sub-distributors. PT Multi Indocitra Tbk was founded in 1990 and is headquartered in West Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Barat"
    },
    "MIDI.JK": {
        "short_name": "Midi Utama Indonesia Tbk.",
        "long_name": "PT Midi Utama Indonesia Tbk",
        "summary": "PT Midi Utama Indonesia Tbk engages in the retail of consumer products in Indonesia. The company operates through Food, Fresh Food, and Non-Food segments. It offers grocery, fruits and vegetables, home and personal care products, toys, pre-paid vouchers, and stationary products through minimarket network under the Alfamidi name; convenience stores under the Lawson name; and supermarket network under the Alfamidi super name. The company also provides various services, including payment channels for motorcycle/car/electronic installments, PLN electricity billing, TV subscription, and insurance and online payment; cash withdrawal; tickets for train, airplane, and bus; and balance reload. As of December 31, 2019, it operated 1,555 outlets, including 1,538 Alfamidi and 17 Alfamidi Super outlets; and 71 Lawson convenience store outlets. The company was formerly known as PT Midimart Utama. The company was founded in 2007 and is headquartered in Tangerang, Indonesia. PT Midi Utama Indonesia Tbk is a subsidiary of PT Sumber Alfaria Trijaya Tbk.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Discount Stores",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "MLBI.JK": {
        "short_name": "Multi Bintang Indonesia Tbk.",
        "long_name": "PT Multi Bintang Indonesia Tbk",
        "summary": "PT Multi Bintang Indonesia Tbk produces and markets alcoholic and non-alcoholic beverages in Indonesia. The company offers beers, sodas, carbonated soft drinks, and ciders under the Heineken, Heineken Light, Bintang, Bintang Radler, Strongbow, Bintang Zero, Fayrouz, and Green Sands brands. It also exports its products. The company was founded in 1929 and is headquartered in Jakarta, Indonesia. PT Multi Bintang Indonesia Tbk is a subsidiary of Heineken International B.V.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Beverages—Brewers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "MRAT.JK": {
        "short_name": "Mustika Ratu Tbk.",
        "long_name": "PT Mustika Ratu Tbk",
        "summary": "PT Mustika Ratu Tbk, together with its subsidiaries, manufactures, trades, and distributes herbal and traditional cosmetics, body care products, health drinks, and other related products in Indonesia. The company was founded in 1975 and is headquartered in Jakarta, Indonesia. PT Mustika Ratu Tbk is a subsidiary of PT Mustika Ratu Investama.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "MYOR.JK": {
        "short_name": "Mayora Indah Tbk.",
        "long_name": "PT Mayora Indah Tbk",
        "summary": "PT Mayora Indah Tbk, together with its subsidiaries, manufactures and sells food and beverage products in Indonesia, rest of Asia, and internationally. It operates through three segments: Packaged Food Processing, Packaged Beverages Processing, and Financial Services. The company offers biscuits under the Roma Marie Susu, Roma Marie Susu Gold, Roma Kelapa, Roma Kelapa Cream, Roma Sandwich, Roma Malkist, Roma Malkist Abon, Roma Malkist Coklat, Roma Malkist Krim Keju Manis, Roma Malkist Krim Tiramisu, Roma Cream Creakers, Royal Choice, Better, Slai O Lai, Sari Gandum, Sari Gandum Sandwich, Roma Cookies, Roma Arden, dll, and other brands names; candies under the Kopiko, Kopiko Cappuccino, KIS, Tamarin, dll, and other brand names; and wafers under the Beng Beng, Beng Beng Maxx, Beng Beng Share It, Astor, Roma Wafer Coklat, Roma Zuperrr Keju, Roma Choco Blast, dll, and other brand names. It also provides chocolates under the Choki-Choki and Drink Beng Beng brands; coffee under the Torabika Duo, Torabika Duo Susu Full Cream, Torabika 3 in 1, Torabika Moka, Torabika Cappuccino, Torabika Jahe Susu, Torabika Creamy Latte, Torabika Kopi Susu Espreso, Kopiko Brown Coffee, Toracafe Volcano Chocomelt, Toracafe Caramelove, Torabika Milky Latte, dll, and other brand names; and health food products under the Energen Cereal, Energen Oatmilk, and Prima Cereal brands. In addition, it is involved in provision of financial services; and processing of coffee powder and instant coffee, and cacao beans. PT Mayora Indah Tbk was founded in 1977 and is headquartered in West Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Barat"
    },
    "NIRA.SG": {
        "short_name": "Nippon Indosari Corpindo PT Reg",
        "long_name": "PT Nippon Indosari Corpindo Tbk",
        "summary": "PT Nippon Indosari Corpindo Tbk manufactures, sells, and distributes breads in Indonesia and the Philippines. The company offers white/sliced breads, sweet/filled breads, and cakes under the Sari Roti brand. It sells its products to distributors and agents. The company was formerly known as PT Nippon Indosari Corporation and changed its name to PT Nippon Indosari Corpindo Tbk in 2003. PT Nippon Indosari Corpindo Tbk was founded in 1995 and is headquartered in Bekasi, Indonesia.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "OSW.F": {
        "short_name": "BAKRIE SUMATRA  RP 1000",
        "long_name": "PT Bakrie Sumatera Plantations Tbk",
        "summary": "PT Bakrie Sumatera Plantations Tbk, together with its subsidiaries, engages in the plantation, processing, and trading of agricultural and industrial products in Indonesia. The company operates in three segments: Palm Oil and Derivatives, Rubber, and Oleochemical. The Palm Oil and Derivatives segment processes, markets, and sells palm oil, as well as develops and maintains palm oil. Its palm oil derivative products and palm kernel oil are used in food and non-food industries, including cooking oil, margarine, ice creams, soaps and detergents, animal feeds, cosmetics, industrial lubricants, and bio-fuels. The Rubber segment processes, markets, and sells rubber products for use in footwear, gloves, contraceptives, and other industries, as well as develops and maintains rubber. The Oleochemical segment processes, markets, and sells oleochemicals that are used as raw materials for various fast moving consumer goods. The company also provides financial services for issuing bonds; and industrial estate management services, as well as processes fatty acids and distillate, fatty alcohols, glycerin, and palm stearin and olein. It also exports its products. The company was formerly known as United Sumatera Plantations and changed its name to PT Bakrie Sumatera Plantations Tbk in 1991. PT Bakrie Sumatera Plantations Tbk was founded in 1911 and is headquartered in Kisaran, Indonesia.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Kisaran"
    },
    "P8Z.SI": {
        "short_name": "Bumitama Agri",
        "long_name": "Bumitama Agri Ltd.",
        "summary": "Bumitama Agri Ltd., an investment holding company, produces and trades in crude palm oil (CPO), palm kernel (PK), and related products for refineries in Indonesia. The company operates through two segments; Plantations and Palm Oil Mills and Downstream Biodiesel Refinery. It is involves in cultivation and maintenance of oil palm plantations and operation of palm oil mills; and processing biodiesel plant and sells biodiesel products from the refinery. The company also engages in harvesting and processing fresh palm fruit bunches (FFB) into CPO and PK; and business and management consultancy services. It manages a total land area of approximately 187,567 hectares in Central Kalimantan, West Kalimantan, and Riau provinces. The company was founded in 1996 and is based in South Jakarta, Indonesia. Bumitama Agri Ltd. is a subsidiary of Wellpoint Pacific Holdings Ltd.",
        "currency": "SGD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "PANI.JK": {
        "short_name": "Pratama Abadi Nusa Industri Tbk",
        "long_name": "PT Pratama Abadi Nusa Industri Tbk",
        "summary": "PT Pratama Abadi Nusa Industri Tbk manufactures and sells packaging cans. The company primarily offers blek cans for glue and oil packaging. It also engages in the processing of fishery products, as well as provides food freezing and cold storage services. The company was founded in 2000 and is headquartered in Tangerang, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "PCAR.JK": {
        "short_name": "Prima Cakrawala Abadi Tbk.",
        "long_name": "PT Prima Cakrawala Abadi Tbk",
        "summary": "PT Prima Cakrawala Abadi Tbk, together with its subsidiaries, engages in the processing and distribution of fishery products in Indonesia. It offers pasteurized crab meat, and fresh and frozen products. The company also provides canning and cold storage of marine products. PT Prima Cakrawala Abadi Tbk was founded in 2014 and is headquartered in Semarang, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Semarang"
    },
    "PGUN.JK": {
        "short_name": "Pradiksi Gunatama Tbk.",
        "long_name": "PT Pradiksi Gunatama Tbk",
        "summary": "PT Pradiksi Gunatama TBK engages in the palm oil plantation activities in Indonesia. It produces crude palm oil and palm kernel, as well as shell, palm acid oil, empty jlong, and fiber by-products. The company was founded in 1995 and is based in Batu Engau, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tanah Grogot"
    },
    "PHJMF": {
        "short_name": "HANJAYA MANDALA SAMPOERNA",
        "long_name": "PT Hanjaya Mandala Sampoerna Tbk",
        "summary": "PT Hanjaya Mandala Sampoerna Tbk manufactures and trades in cigarettes in Indonesia. The company engages in the general trading, property development, and expedition and warehousing businesses; e-commerce and agency activities; and the provision of leisure and golf services. It sells its products under the Dji Sam Soe, Sampoerna A, Sampoerna Kretek, and Sampoerna U brand names. The company was founded in 1913 and is headquartered in Surabaya, Indonesia. PT Hanjaya Mandala Sampoerna Tbk is a subsidiary of PT Philip Morris Indonesia.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Tobacco",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "city": "Surabaya"
    },
    "PIFFY": {
        "short_name": "INDOFOOD CBP SUKSES MAKMUR TBK ",
        "long_name": "PT Indofood CBP Sukses Makmur Tbk",
        "summary": "PT Indofood CBP Sukses Makmur Tbk produces and sells consumers products in Indonesia and internationally. It offers noodles, sauces, and instant seasonings under the Indomie, Supermi, Sarimi, Pop Mie, Sakura, and Mi Telur Cap 3 Ayam brands. The company also provides sweetened condensed milk; UHT, sterilized bottled, and pasteurized liquid milk; powdered milk; ice cream; and butter under the Indomilk, Cap Enaak, Tiga Sapi, Kremer, Orchid Butter, Indoeskrim, Good To Go, and Milkuat brands. In addition, it offers chips and non-chips snacks under the Chitato, Qtela, Lays, Chiki, Cheetos, Jetz, Trenz, Wonderland, Dueto, Doritos brands; and food seasonings, including powdered and liquid seasonings, condiments, and syrups under the Sambal Indofood, Bumbu Special Indofood, Bumbu Racik, Indofood Freiss, Kecap Indofood, and Kecap Piring Lombok brands. Further, the company provides nutrition and special foods, such as baby cereals, follow-on cereals, noodle soups, and baby biscuits, as well as fortified milk for expectant and lactating mothers under the Promina, Sun, Govit, and Gowell brands. Additionally, it offers beverages comprising non-alcoholic beverage products, including tea, packaged water and fruit-flavored drinks, under the brands of Ichi Ocha, Club, and Fruitamin. The company also manufactures packaging materials; provides management consulting, general trading, and transportation services; processes oil and fats; markets and distributes paper diapers; and manages restaurants. The company was founded in 1982 and is headquartered in Jakarta, Indonesia. PT Indofood CBP Sukses Makmur Tbk is a subsidiary of PT Indofood Sukses Makmur Tbk.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "PIFMF": {
        "short_name": "PT INDOFOOD SUKSES MAKMUR TBK",
        "long_name": "PT Indofood Sukses Makmur Tbk",
        "summary": "PT Indofood Sukses Makmur Tbk produces and sells various food products in Indonesia and internationally. It operates through four segments: Consumer Branded Products Business Group, Bogasari Business Group, Agribusiness Group, and Distribution Business Group. The Consumer Branded Products Business Group segment offers noodles; dairy products, including sweetened condensed, temperature, sterilized bottled, pasteurized liquid, multi-cereal, and powdered milk, as well as butter, ice cream, and creamer; snack foods, such as potato, cassava, soybean, sweet potato, and various extruded snacks, as well as biscuits; culinary products and syrups; nutrition and special foods; and ready-to-drink tea, packaged water, and fruit-flavored drinks. The Bogasari Business Group segment produces flour and pasta. The Agribusiness Group segment produces palm oil, rubber, sugar cane, timber, cocoa, and tea; and manufactures and markets cooking oils, margarines, shortenings, and other by-products. The Distribution Business Group segment distributes third-party products. It is also involved in the shipping, investment, trade export agency, industrial estate, and restaurant chain management activities; ownership and management of buildings; and provision of management consulting, flour blending and trading, and research management and technical services, as well as packaging materials and fertilizers. In addition, it manufactures coffee; extracts and processes coconut oil; operates bulking station; provides transportation services; and markets and distributes paper diapers and packaged drinking water. The company was formerly known as PT Panganjaya Intikusuma and changed its name to PT Indofood Sukses Makmur Tbk in 1994. The company was founded in 1990 and is headquartered in Jakarta, Indonesia. PT Indofood Sukses Makmur Tbk is a subsidiary of First Pacific Investment Management Limited.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "PIFMY": {
        "short_name": "PT INDOFOOD SUKSES MAKMUR TBK",
        "long_name": "PT Indofood Sukses Makmur Tbk",
        "summary": "PT Indofood Sukses Makmur Tbk produces and sells various food products in Indonesia and internationally. It operates through four segments: Consumer Branded Products Business Group, Bogasari Business Group, Agribusiness Group, and Distribution Business Group. The Consumer Branded Products Business Group segment offers noodles; dairy products, including sweetened condensed, temperature, sterilized bottled, pasteurized liquid, multi-cereal, and powdered milk, as well as butter, ice cream, and creamer; snack foods, such as potato, cassava, soybean, sweet potato, and various extruded snacks, as well as biscuits; culinary products and syrups; nutrition and special foods; and ready-to-drink tea, packaged water, and fruit-flavored drinks. The Bogasari Business Group segment produces flour and pasta. The Agribusiness Group segment produces palm oil, rubber, sugar cane, timber, cocoa, and tea; and manufactures and markets cooking oils, margarines, shortenings, and other by-products. The Distribution Business Group segment distributes third-party products. It is also involved in the shipping, investment, trade export agency, industrial estate, and restaurant chain management activities; ownership and management of buildings; and provision of management consulting, flour blending and trading, and research management and technical services, as well as packaging materials and fertilizers. In addition, it manufactures coffee; extracts and processes coconut oil; operates bulking station; provides transportation services; and markets and distributes paper diapers and packaged drinking water. The company was formerly known as PT Panganjaya Intikusuma and changed its name to PT Indofood Sukses Makmur Tbk in 1994. The company was founded in 1990 and is headquartered in Jakarta, Indonesia. PT Indofood Sukses Makmur Tbk is a subsidiary of First Pacific Investment Management Limited.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "PMMP.JK": {
        "short_name": "Panca Mitra Multiperdana Tbk.",
        "long_name": "Pt Panca Mitra Multiperdana Tbk",
        "summary": "Pt Panca Mitra Multiperdana Tbk engages in processing and sale of shrimp. The company supplies shrimp under EBINOYA brand name to restaurants, hotels, and food service firms in Indonesia; and exports to the United States and Japan under Leader brand name. Pt Panca Mitra Multiperdana Tbk was founded in 2004 and is headquartered in Jawa Timur, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Situbondo"
    },
    "PNGO.JK": {
        "short_name": "Pinago Utama Tbk.",
        "long_name": "PT PINAGO UTAMA Tbk",
        "summary": "PT PINAGO UTAMA Tbk engages in the oil palm and rubber plantation business in Indonesia. The company was founded in 1979 and is based in Palembang, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Palembang"
    },
    "PPLFF": {
        "short_name": "PERUSAHAAN PERKEBUNAN LONDON SU",
        "long_name": "PT Perusahaan Perkebunan London Sumatra Indonesia Tbk",
        "summary": "PT Perusahaan Perkebunan London Sumatra Indonesia Tbk, together with its subsidiaries, engages in the plantation business in Indonesia. It operates through four segments: Oil Palm Products, Rubber, Seeds, and Others. The company offers crude palm oil and rubber, as well as cocoa, tea, and oil palm seeds. It also develops plantations on behalf of local smallholders. As of December 31, 2019, the company had a total planted area of 115,665 hectares comprising 95,637 hectares of palm oil; 15,945 hectares of rubber; and 4,083 hectares of cocoa, tea, and other crops in North Sumatra, South Sumatra, East Kalimantan, North Sulawesi, South Sulawesi, and Java. In addition, it is involved in the research, processing, trading, marketing, industrial, and agency/representative activities; and invests in agricultural technology and cultivation, as well as agriculture, forestry, and fishery businesses. The company also exports its products. The company was founded in 1906 and is headquartered in South Jakarta, Indonesia. PT Perusahaan Perkebunan London Sumatra Indonesia Tbk is a subsidiary of PT Salim Ivomas Pratama Tbk.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "PPLFY": {
        "short_name": "PERUSAHAAN PERKEBUNAN LONDON SU",
        "long_name": "PT Perusahaan Perkebunan London Sumatra Indonesia Tbk",
        "summary": "PT Perusahaan Perkebunan London Sumatra Indonesia Tbk, together with its subsidiaries, engages in the plantation business in Indonesia. It operates through four segments: Oil Palm Products, Rubber, Seeds, and Others. The company offers crude palm oil and rubber, as well as cocoa, tea, and oil palm seeds. It also develops plantations on behalf of local smallholders. As of December 31, 2019, the company had a total planted area of 115,665 hectares comprising 95,637 hectares of palm oil; 15,945 hectares of rubber; and 4,083 hectares of cocoa, tea, and other crops in North Sumatra, South Sumatra, East Kalimantan, North Sulawesi, South Sulawesi, and Java. In addition, it is involved in the research, processing, trading, marketing, industrial, and agency/representative activities; and invests in agricultural technology and cultivation, as well as agriculture, forestry, and fishery businesses. The company also exports its products. The company was founded in 1906 and is headquartered in South Jakarta, Indonesia. PT Perusahaan Perkebunan London Sumatra Indonesia Tbk is a subsidiary of PT Salim Ivomas Pratama Tbk.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "PS9A.MU": {
        "short_name": "PT.PP LDN SUMAT.ID RP 100",
        "long_name": "PT Perusahaan Perkebunan London Sumatra Indonesia Tbk",
        "summary": "PT Perusahaan Perkebunan London Sumatra Indonesia Tbk, together with its subsidiaries, engages in the plantation business in Indonesia. It operates through four segments: Oil Palm Products, Rubber, Seeds, and Others. The company offers crude palm oil and rubber, as well as cocoa, tea, and oil palm seeds. It also develops plantations on behalf of local smallholders. As of December 31, 2019, the company had a total planted area of 115,665 hectares comprising 95,637 hectares of palm oil; 15,945 hectares of rubber; and 4,083 hectares of cocoa, tea, and other crops in North Sumatra, South Sumatra, East Kalimantan, North Sulawesi, South Sulawesi, and Java. In addition, it is involved in the research, processing, trading, marketing, industrial, and agency/representative activities; and invests in agricultural technology and cultivation, as well as agriculture, forestry, and fishery businesses. The company also exports its products. The company was founded in 1906 and is headquartered in South Jakarta, Indonesia. PT Perusahaan Perkebunan London Sumatra Indonesia Tbk is a subsidiary of PT Salim Ivomas Pratama Tbk.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "PSDN.JK": {
        "short_name": "Prasidha Aneka Niaga Tbk",
        "long_name": "PT Prasidha Aneka Niaga Tbk",
        "summary": "PT Prasidha Aneka Niaga Tbk, together with its subsidiaries, engages in the processing and trading of agricultural products in Indonesia. It offers crumb rubber; and produces instant and roasted ground coffee products, and coffee beans. The company is also involved in the coffee plantation. It exports its products to the United States, Europe, and Asia. The company was formerly known as PT Aneka Bumi Asih and changed its name to PT Prasidha Aneka Niaga Tbk in 1994. PT Prasidha Aneka Niaga Tbk was founded in 1974 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "PSGO.JK": {
        "short_name": "Palma Serasih Tbk.",
        "long_name": "PT Palma Serasih Tbk",
        "summary": "PT Palma Serasih Tbk engages in plantation, processing, and production of crude palm oil in Indonesia. It also exports its products worldwide. PT Palma Serasih Tbk was founded in 2008 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "RANC.JK": {
        "short_name": "Supra Boga Lestari Tbk.",
        "long_name": "PT Supra Boga Lestari Tbk",
        "summary": "PT Supra Boga Lestari Tbk operates supermarkets in Indonesia. Its supermarkets offer meat, poultry, seafood, fruits, and vegetables, as well as other specialty products. The company operates its supermarket under the Ranch Market and Farmers Market names. It operates 48 stores consisting of 16 Ranch Markets, 29 Farmers Markets, 1 The Gourmet by Ranch Market, and 2 Day2Day by Farmers Market located in various cities in Jakarta, Jabodetabek, Surabaya, Malang, Balikpapan, Samarinda, Pekanbaru, Ambon, Dumai, and Palembang. The company was founded in 1997 and is based in West Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "West Jakarta"
    },
    "RMBA.JK": {
        "short_name": "Bentoel Internasional Investama",
        "long_name": "PT Bentoel Internasional Investama Tbk",
        "summary": "PT Bentoel Internasional Investama Tbk manufactures and distributes cigarettes in Indonesia and internationally. It offers a range of machine-made kretek, hand-made kretek, and white cigarettes under the Dunhill Filter, Dunhill Mild, Club Mild, Lucky Strike Mild, Neo Mild, Tali Jagat, Bintang Buana, Sejati, Star Mild, Uno Mild, Lucky Strike, Dunhill Regular, Dunhill Lights, and Dunhill Menthol brand names. The company was formerly known as PT Transindo Multi Prima Tbk and changed its name to PT Bentoel Internasional Investama Tbk in August 2000. The company was founded in 1930 and is headquartered in South Jakarta, Indonesia. PT Bentoel Internasional Investama Tbk is a subsidiary of British American Tobacco (2009 PCA) Ltd.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Tobacco",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "ROTI.JK": {
        "short_name": "Nippon Indosari Corpindo Tbk.",
        "long_name": "PT Nippon Indosari Corpindo Tbk",
        "summary": "PT Nippon Indosari Corpindo Tbk manufactures, sells, and distributes breads in Indonesia and the Philippines. The company offers white/sliced breads, sweet/filled breads, and cakes under the Sari Roti brand. It sells its products to distributors and agents. The company was formerly known as PT Nippon Indosari Corporation and changed its name to PT Nippon Indosari Corpindo Tbk in 2003. PT Nippon Indosari Corpindo Tbk was founded in 1995 and is headquartered in Bekasi, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "SGRO.JK": {
        "short_name": "Sampoerna Agro Tbk.",
        "long_name": "PT Sampoerna Agro Tbk",
        "summary": "PT Sampoerna Agro Tbk, together with its subsidiaries, operates oil palm and rubber plantations, and palm oil mills in South Sumatera, West Kalimantan, Central Kalimantan, and Riau, Indonesia. The company offers crude palm oil, palm kernel, and germinated oil palm seeds, as well as non-palm oil products, such as rubber and sago starch. It is also involved in the utilization of forestry products; provision of management consultation service; and wholesale trade activities. The company produces and sells its oil palm seeds under the DxP Sriwijaya brand; and sago starch under the brand name Prima Starch. As of September 30, 2020, it total planted area included 119,176 hectares of oil palm inti plantations, sago plantations, and rubber plantations. The company was formerly known as PT Selapan Jaya and changed its name to PT Sampoerna Agro Tbk in 2007. The company was founded in 1993 and is headquartered in Palembang, Indonesia. PT Sampoerna Agro Tbk is a subsidiary of Sampoerna Agri Resources Pte. Ltd.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Palembang"
    },
    "SIMP.JK": {
        "short_name": "Salim Ivomas Pratama Tbk.",
        "long_name": "PT Salim Ivomas Pratama Tbk",
        "summary": "PT Salim Ivomas Pratama Tbk, together with its subsidiaries, operates as an integrated producer of edible oils and fats in Indonesia. It operates in two segments, Plantations; and Edible Oil and Fats. The Plantations segment is primarily involved in the development and maintenance of oil palm, sugar cane, timber, and rubber plantations; and processing, trading, marketing, and sale of palm oil, sugar, and rubber products. This segment also develops and maintains cocoa, coconut, agroforestry, and tea plantations. The Edible Oil and Fats segment produces, markets, and sells edible oils, margarines, shortening, fats, and other related products, as well as other by-products derived from palm oil refining and fractionation. The company also provides transportation, investment and research management, and technical services; and artificial primary macronutrients mix fertilizers. In addition, it engages in bulking station business; seed breeding activities; and invests in agricultural technology and cultivation, agriculture, marketing and research businesses, as well as engages in the house prefabrication activities. The company offers its products under the Bimoli, Bimoli Spesial, Delima, Happy, Palmia, Amanda, Simas, Malinda, and Mahakam brand names. It also exports its products to approximately 25 countries, including China, Malaysia, Singapore, Nigeria, South Korea, Timor Leste, the Philippines, Myanmar, Sri Lanka, and Papua New Guinea. The company was formerly known as PT Ivomas Pratama and changed its name to PT Salim Ivomas Pratama Tbk in February 1994. The company was founded in 1992 and is based in Jakarta, Indonesia. PT Salim Ivomas Pratama Tbk is a subsidiary of Indofood Agri Resources Ltd.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "SIPD.JK": {
        "short_name": "Sreeya Sewu Indonesia Tbk.",
        "long_name": "PT Sreeya Sewu Indonesia Tbk",
        "summary": "PT Sreeya Sewu Indonesia Tbk produces processed and poultry feed in Indonesia. The company operates through Livestock Feed, Day Old Chicks, Dressed Chicken, and Partnership and Commercial Farm segments. It is also involved in breeding and hatchery; growing farm activities; and slaughtering and production of further processed and value added chicken products. In addition, the company offers laboratory services and medicine; and involved in the distribution and trading of poultry equipment, feedmill, and others product. Further, it engages in the frozen food processing industry. The company was formerly known as PT Sierad Produce Tbk and changed its name to PT Sreeya Sewu Indonesia Tbk in September 2020. The company was founded in 1985 and is based in South Jakarta, Indonesia. PT Sreeya Sewu Indonesia Tbk is a subsidiary of PT Great Giant Pineapple.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "SKBM.JK": {
        "short_name": "Sekar Bumi Tbk.",
        "long_name": "PT Sekar Bumi Tbk",
        "summary": "PT Sekar Bumi Tbk processes, produces, trades in, and distributes frozen food products in Indonesia. The company offers block packing, raw, and cooked shrimp, as well as cooked and peeled prawns; beef balls, sea food, fish balls, fish shiumai, hakau, kekian, martabak, mini wonton, nuggets, puffs, samosa, sausage, shiumai, shrimp balls, shrimp shiumai, spring rolls, and squid balls; and cheese and vegetable fish cake, brosur bumifood, dumpling ayam and udang, fish tofu, fish cake laksa recipe, scallop, shrimp and fish dumpling, and shumai. It also processes cashew nuts and other nut products; and bread crumbs and breaded shrimps. In addition, the company is involved in the agriculture, fisheries, aquaculture, trading, transportation, construction, services, printing, and workshop businesses. PT Sekar Bumi Tbk sells its products under the FINNA, SKB, Bumifood, and Mitraku brands. The company also exports its products to the United States, Europe, and other Asian countries. PT Sekar Bumi Tbk was founded in 1968 and is headquartered in Jakarta Selatan, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "SKLT.JK": {
        "short_name": "Sekar Laut Tbk.",
        "long_name": "PT Sekar Laut Tbk",
        "summary": "PT Sekar Laut Tbk produces and sells crackers, tomato and chili sauces, breads, and ready to use seasonings in Indonesia and internationally. The company provides cashew nuts, rice been and other beens, sardines, condiments, cooking spices, and Melinjo products under the Finna brand name. It also involved in the trading of consumer goods; and restaurant business. In addition, the company exports its products to the Netherlands, Korea, England, Oceania, China, and internationally. PT Sekar Laut Tbk was founded in 1976 and is headquartered in Surabaya, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Surabaya"
    },
    "SMAR.JK": {
        "short_name": "Smart Tbk.",
        "long_name": "PT Sinar Mas Agro Resources and Technology Tbk",
        "summary": "PT Sinar Mas Agro Resources and Technology Tbk engages in the cultivation and harvesting of oil palm in Indonesia. The company also processes fresh fruit bunches into crude palm oil (CPO) and palm kernel; and refines CPO into value-added products, such as cooking oil, margarine, shortening, oleo-chemicals, and biodiesel. It offers cooking oil under the Filma, Mitra, Kunci Mas, and Palmvita names; margarines under the Palmboom, Palmboom Cake, Filma Prestige, Filma, Filma Danish Pastry, Menara, Menara Cream, Mitra, Smart Baker, and Palmvita names; and shortening products under the Filma Puff Pastry, Filma Baker's Cream Fat, Filma Butter Oil Substitute, Delicio White Baker's Fat, Filma GoodFry Deep Frying Fat, Goodfry Semi Liquid Frying Oil, Palmvita Deep Frying Fat, Palmvita White Fat, Palmvita Baker's Fat, Palmvita Gold Butter Oil Substitute, Menara, Menara Baker's Fat, Red Rose, and Filma Pusaka White Baker's Fat names. The company also provides specialty fats under the i-Soc CBS, i-Soc PCF, i-Soc CF, Delicio Coating Fat, and Delicio Toffee Fat names. In addition, it offers fractioned fatty acids, distilled fatty acids, glycerine, and soap noodles under the Sinar name; and palm kernel meals, olein, stearin, cocoa butter substitute, and soybean oil and soybean meals. Further, the company is involved in the cultivation of ornamental plants; provision of transportation services; and organic, oleo chemical, and bio energy businesses. As of December 31, 2018, it had a total planted area of approximately 106,637 hectares. The company was founded in 1962 and is headquartered in Jakarta, Indonesia. PT Sinar Mas Agro Resources and Technology Tbk is a subsidiary of PT Purimas Sasmita.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "SSMS.JK": {
        "short_name": "Sawit Sumbermas Sarana Tbk.",
        "long_name": "PT Sawit Sumbermas Sarana Tbk.",
        "summary": "PT Sawit Sumbermas Sarana Tbk., together with its subsidiaries, engages in the production and sale of crude palm oil, fresh fruit bunches, palm kernel oil, and palm kernel in Indonesia. The company operates oil palm plantations and a palm oil mill. It is also involved in the provision of consulting and trading services. PT Sawit Sumbermas Sarana Tbk. was founded in 1995 and is headquartered in Pangkalan Bun, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Pangkalan Bun"
    },
    "STTP.JK": {
        "short_name": "Siantar Top Tbk.",
        "long_name": "PT Siantar Top Tbk",
        "summary": "PT Siantar Top Tbk, together with its subsidiaries, manufactures and sells snacks in Indonesia. It operates in two segments, Food Processing and Others. The company offers biscuits, rice, coffee, instant and snack noodles, pellets, vermicelli, crackers, wafers, and candies, as well as flour and seasoning products. It also exports its products in Asia and the Middle East. The company was founded in 1972 and is headquartered in Sidoarjo, Indonesia. PT Siantar Top Tbk is a subsidiary of PT Shindo Tiara Tunggal.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Sidoarjo"
    },
    "SZ31.F": {
        "short_name": "PT SAMPOERNA AGRO RP 200",
        "long_name": "PT Sampoerna Agro Tbk",
        "summary": "PT Sampoerna Agro Tbk, together with its subsidiaries, operates oil palm and rubber plantations, and palm oil mills in South Sumatera, West Kalimantan, Central Kalimantan, and Riau, Indonesia. The company offers crude palm oil, palm kernel, and germinated oil palm seeds, as well as non-palm oil products, such as rubber and sago starch. It is also involved in the utilization of forestry products; provision of management consultation service; and wholesale trade activities. The company produces and sells its oil palm seeds under the DxP Sriwijaya brand; and sago starch under the brand name Prima Starch. As of September 30, 2020, it total planted area included 119,176 hectares of oil palm inti plantations, sago plantations, and rubber plantations. The company was formerly known as PT Selapan Jaya and changed its name to PT Sampoerna Agro Tbk in 2007. The company was founded in 1993 and is headquartered in Palembang, Indonesia. PT Sampoerna Agro Tbk is a subsidiary of Sampoerna Agri Resources Pte. Ltd.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Palembang"
    },
    "T2L.F": {
        "short_name": "TUNAS BARU LAMPUNG RP 125",
        "long_name": "PT Tunas Baru Lampung Tbk",
        "summary": "PT Tunas Baru Lampung Tbk primarily manufactures and sells vegetable cooking oils in Indonesia. It operates through Plantations and Manufacturing segments. The company offers palm cooking oil, palm kernel oil, crude palm oil, stearine, fatty acid, crude coconut oil, glycerin, margarine, molasses, and sugar, as well as biodiesel, and laundry and cream soaps. It also engages in the plantation of palm oil and sugarcane. The company was founded in 1973 and is headquartered in Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "TBLA.JK": {
        "short_name": "Tunas Baru Lampung Tbk.",
        "long_name": "PT Tunas Baru Lampung Tbk",
        "summary": "PT Tunas Baru Lampung Tbk primarily manufactures and sells vegetable cooking oils in Indonesia. It operates through Plantations and Manufacturing segments. The company offers palm cooking oil, palm kernel oil, crude palm oil, stearine, fatty acid, crude coconut oil, glycerin, margarine, molasses, and sugar, as well as biodiesel, and laundry and cream soaps. It also engages in the plantation of palm oil and sugarcane. The company was founded in 1973 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "TCID.JK": {
        "short_name": "Mandom Indonesia Tbk.",
        "long_name": "PT. Mandom Indonesia Tbk",
        "summary": "PT. Mandom Indonesia Tbk manufactures and trades in cosmetics for men and women in Indonesia. It offers hair, face, and body care products, as well as deodorants, fragrances, and air fresheners. The company markets its products under the Johnny Andrean, Tancho, Fresh n Fresh, Lucido~L, Pixy, Pucelle, Glazelle de Pucelle, Miratone, Lovillea, GATSBY, Mandom, Spalding, Axya, Oxxo, and Style Up brands. T. Mandom Indonesia Tbk also exports its products to the United Arab Emirates, Japan, Malaysia, Thailand, the Philippines, India, Singapore, Korea, Vietnam, China, Hong Kong, and Taiwan. The company was formerly known as PT Tancho Indonesia and changed its name to PT. Mandom Indonesia Tbk in 2001. The company was founded in 1969 and is headquartered in Jakarta, Indonesia. PT. Mandom Indonesia Tbk is a subsidiary of Mandom Corporation.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "TGKA.JK": {
        "short_name": "Tigaraksa Satria Tbk.",
        "long_name": "PT Tigaraksa Satria Tbk",
        "summary": "PT Tigaraksa Satria Tbk, together with its subsidiaries, engages in the sale and distribution of various consumer products in Indonesia. It operates through Food and Consumer Products, Gas (LPG) and Other Kitchen Appliances, and Books segments. The company sells and distributes food products and consumer products; and educational products, as well as produces powdered milk. It also manufactures and distributes gas stoves; and distributes blenders and rice cookers, as well as offers gas refill services for households. The company offers its products to wholesalers, agents and sub distributors, general trade, medical outlets, hypermarkets, convenient stores, supermarkets, and minimarkets. PT Tigaraksa Satria Tbk was founded in 1986 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "South Jakarta"
    },
    "UCID.JK": {
        "short_name": "Uni-Charm Indonesia Tbk.",
        "long_name": "PT Uni-Charm Indonesia Tbk",
        "summary": "PT Uni-Charm Indonesia Tbk operates in the sanitary napkin industry in Indonesia. It operates in two segments, Diapers and Non Diapers. The company engages in the manufacture and sale of sanitary napkins, night wings, panty liners, and baby diapers. It also offers non-woven and tissue papers. The company was founded in 1997 and is headquartered in South Jakarta, Indonesia. PT Uni-Charm Indonesia Tbk is a subsidiary of Unicharm Corporation.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "ULTJ.JK": {
        "short_name": "Ultra Jaya Milk Industry & Trad",
        "long_name": "PT Ultrajaya Milk Industry & Trading Company Tbk",
        "summary": "PT Ultrajaya Milk Industry & Trading Company Tbk, together with its subsidiaries, operates in the food and beverage industry in Indonesia. The company operates in two segments, Beverages and Foods. It produces various beverages, such as milk, fruit juices, tea, traditional drinks, and health drinks; and sweetened condensed milk, powder milk, and tropical fruit juice concentrates. The company also offers milk products under the Ultra Milk and Ultra Mimi names; tea products under the Teh Kotak name; drinks and other health beverages under the Sari Kacang Ijo and Sari Asem names; and sweetened condensed milk under the Ultra Milk and Cap Sapi names. In addition, it provides freight and other services; and air and water management services, as well as engages in agriculture, dairy farm, and trading activities. Further, the company produces powder milk products through other parties for toll packing services. The company sells its products directly through retail outlets, food and beverages stores, kiosks, and its sales force; and indirectly through agents/distributors, minimarkets, supermarkets, and hypermarkets. It also exports its products. PT Ultrajaya Milk Industry & Trading Company Tbk was founded in 1971 and is headquartered in Bandung, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Bandung"
    },
    "UNLRF": {
        "short_name": "UNILEVER INDONESIA",
        "long_name": "PT Unilever Indonesia Tbk",
        "summary": "PT Unilever Indonesia Tbk engages in the manufacture, marketing, and distribution of consumer goods in Indonesia. It offers soaps, detergents, dairy based foods, ice creams, cosmetic products, tea based beverages, and fruit juices, as well as leases office space. It offers its products under the Pepsodent, Lux, Lifebuoy, Dove, Sunsilk, Clear, Rexona, Vaseline, Rinso, Molto, Sunlight, Wall's, Royco, Bango, and other brands. The company founded in 1933 and is based in Tangerang, Indonesia. PT Unilever Indonesia Tbk is a subsidiary of Unilever Indonesia Holding B.V.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "UNLRY": {
        "short_name": "UNILEVER INDONESIA",
        "long_name": "PT Unilever Indonesia Tbk",
        "summary": "PT Unilever Indonesia Tbk engages in the manufacture, marketing, and distribution of consumer goods in Indonesia. It offers soaps, detergents, dairy based foods, ice creams, cosmetic products, tea based beverages, and fruit juices, as well as leases office space. It offers its products under the Pepsodent, Lux, Lifebuoy, Dove, Sunsilk, Clear, Rexona, Vaseline, Rinso, Molto, Sunlight, Wall's, Royco, Bango, and other brands. The company founded in 1933 and is based in Tangerang, Indonesia. PT Unilever Indonesia Tbk is a subsidiary of Unilever Indonesia Holding B.V.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "UNSP.JK": {
        "short_name": "Bakrie Sumatera Plantations Tbk",
        "long_name": "PT Bakrie Sumatera Plantations Tbk",
        "summary": "PT Bakrie Sumatera Plantations Tbk, together with its subsidiaries, engages in the plantation, processing, and trading of agricultural and industrial products in Indonesia. The company operates in three segments: Palm Oil and Derivatives, Rubber, and Oleochemical. The Palm Oil and Derivatives segment processes, markets, and sells palm oil, as well as develops and maintains palm oil. Its palm oil derivative products and palm kernel oil are used in food and non-food industries, including cooking oil, margarine, ice creams, soaps and detergents, animal feeds, cosmetics, industrial lubricants, and bio-fuels. The Rubber segment processes, markets, and sells rubber products for use in footwear, gloves, contraceptives, and other industries, as well as develops and maintains rubber. The Oleochemical segment processes, markets, and sells oleochemicals that are used as raw materials for various fast moving consumer goods. The company also provides financial services for issuing bonds; and industrial estate management services, as well as processes fatty acids and distillate, fatty alcohols, glycerin, and palm stearin and olein. It also exports its products. The company was formerly known as United Sumatera Plantations and changed its name to PT Bakrie Sumatera Plantations Tbk in 1991. PT Bakrie Sumatera Plantations Tbk was founded in 1911 and is headquartered in Kisaran, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Kisaran"
    },
    "UNVR.JK": {
        "short_name": "Unilever Indonesia Tbk.",
        "long_name": "PT Unilever Indonesia Tbk",
        "summary": "PT Unilever Indonesia Tbk engages in the manufacture, marketing, and distribution of consumer goods in Indonesia. It offers soaps, detergents, dairy based foods, ice creams, cosmetic products, tea based beverages, and fruit juices, as well as leases office space. It offers its products under the Pepsodent, Lux, Lifebuoy, Dove, Sunsilk, Clear, Rexona, Vaseline, Rinso, Molto, Sunlight, Wall's, Royco, Bango, and other brands. The company founded in 1933 and is based in Tangerang, Indonesia. PT Unilever Indonesia Tbk is a subsidiary of Unilever Indonesia Holding B.V.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "WAPO.JK": {
        "short_name": "Wahana Pronatural Tbk.",
        "long_name": "PT Wahana Pronatural Tbk",
        "summary": "PT Wahana Pronatural Tbk trades in agriculture and marine products in Indonesia. The company operates through two segments, Sales Agrobisnis Product and Candy. It trades in dried seaweeds, cashew nut, rice, corn, coffee, and soybeans. The company also manufactures and sells candies under various brands. In addition, it engages in the agricultural products, coffee and mining commodities, industrial, transportation, and printing activities; and general contracting business. The company was formerly known as PT Wahana Phonix Mandiri and changed its name to PT Wahana Pronatural Tbk in June 2012. PT Wahana Pronatural Tbk was founded in 1979 and is headquartered in Surabaya, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Surabaya"
    },
    "WICO.JK": {
        "short_name": "Wicaksana Overseas Internationa",
        "long_name": "Pt Wicaksana Overseas International Tbk",
        "summary": "Pt Wicaksana Overseas International Tbk engages in the distribution and trading of food, beverage, and other products in Indonesia. It operates through two segments, Distribution and Trading Centre. The company also offers snacks, beverages, milk powder, instant noodles, personal care products, cosmetics, medicine, household products, cooking oil, and plastic and electrical materials, as well as patient, commercial, and regulatory support services. It operates a network of 46 distribution centers. The company was founded in 1973 and is headquartered in North Jakarta, Indonesia. Pt Wicaksana Overseas International Tbk is a subsidiary of DKSH Holding AG.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Utara"
    },
    "WIIM.JK": {
        "short_name": "Wismilak Inti Makmur Tbk.",
        "long_name": "PT Wismilak Inti Makmur Tbk",
        "summary": "PT Wismilak Inti Makmur Tbk manufactures and trades in cigarettes in Indonesia. It offers hand-rolled and machine-rolled cigarettes, cigars, and filter rods. The company markets and sells its products under the Galan Kretek, Wismilak Spesial, Wismilak Slim, Wismilak Diplomat, Diplomat Mild, Diplomat Mild Menthol, Wismilak Premium Cigars, and Wismilak Premium Seleccion brands. PT Wismilak Inti Makmur Tbk was founded in 1962 and is headquartered in Surabaya, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Tobacco",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Surabaya"
    }
}