{
    "AYLS.JK": {
        "short_name": "Agro Yasa Lestari Tbk.",
        "long_name": "PT Agro Yasa Lestari Tbk",
        "summary": "PT. Agro Yasa Lestari Tbk engages in the wholesale trade of other construction materials, food and beverage products, and other agricultural products. It trades in asphalt, geosynthetic, and soybean beans meal. The company was founded in 2010 and is based in Central Jakarta, Indonesia. As of March 3, 2021, PT Agro Yasa Lestari Tbk operates as a subsidiary of PT Anugrah Cakrawala Dunia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Central Jakarta",
        "zipcode": "10330",
        "website": "http://www.agroyasalestari.com",
        "market_cap": "Small Cap"
    },
    "KMDS.JK": {
        "short_name": "Kurniamitra Duta Sentosa Tbk.",
        "long_name": "PT Kurniamitra Duta Sentosa, Tbk",
        "summary": "PT Kurniamitra Duta Sentosa, Tbk operates as a food and beverage industry in Indonesia. It imports and sells syrups, fruit mixes, frappe products, and gourmet sauces; coffee products; almond milk, soy milk, coconut milk, dairy milk, and free lactose milk products; and coffee makers. The company was founded in 2000 and is headquartered in Tangerang Selatan, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang Selatan",
        "zipcode": "15325",
        "website": "http://www.kmds.co.id",
        "market_cap": "Small Cap"
    },
    "TGKA.JK": {
        "short_name": "Tigaraksa Satria Tbk.",
        "long_name": "PT Tigaraksa Satria Tbk",
        "summary": "PT Tigaraksa Satria Tbk, together with its subsidiaries, engages in the sale and distribution of various consumer products in Indonesia. It operates through Food and Consumer Products, Gas (LPG) and Other Kitchen Appliances, and Books segments. The company sells and distributes food products and consumer products; and educational products, as well as produces powdered milk. It also manufactures and distributes gas stoves; and distributes blenders and rice cookers, as well as offers gas refill services for households. The company offers its products to wholesalers, agents and sub distributors, general trade, medical outlets, hypermarkets, convenient stores, supermarkets, and minimarkets. PT Tigaraksa Satria Tbk was founded in 1986 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "South Jakarta",
        "zipcode": "12780",
        "website": "http://www.tigaraksa.co.id",
        "market_cap": "Small Cap"
    },
    "WICO.JK": {
        "short_name": "Wicaksana Overseas Internationa",
        "long_name": "Pt Wicaksana Overseas International Tbk",
        "summary": "Pt Wicaksana Overseas International Tbk engages in the distribution and trading of food, beverage, and other products in Indonesia. It operates through two segments, Distribution and Trading Centre. The company also offers snacks, beverages, milk powder, instant noodles, personal care products, cosmetics, medicine, household products, cooking oil, and plastic and electrical materials, as well as patient, commercial, and regulatory support services. It operates a network of 46 distribution centers. The company was founded in 1973 and is headquartered in North Jakarta, Indonesia. Pt Wicaksana Overseas International Tbk is a subsidiary of DKSH Holding AG.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Utara",
        "zipcode": "14430",
        "website": "http://www.wicaksana.co.id",
        "market_cap": "Small Cap"
    }
}