{
  "6CK1.SG": {
    "city": "Bekasi",
    "country": "Indonesia",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Packaged Foods",
    "long_name": "PT Wilmar Cahaya Indonesia Tbk.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "Wilmar Cahaya Indonesia Tbk,PTR",
    "state": null,
    "summary": "PT Wilmar Cahaya Indonesia Tbk. produces and sells vegetable and specialty oils in Indonesia. It offers specialty fats, including cocoa butter substitutes, cocoa butter replacers, cocoa butter equivalents, confectionary fats, icing and filling fats, milk fat replacers, ice cream fats, and spread fats, as well as bakery fats. The company was formerly known as PT Cahaya Kalbar Tbk. and changed its name to PT Wilmar Cahaya Indonesia Tbk. in May 2013. The company was founded in 1968 and is headquartered in Bekasi, Indonesia. PT Wilmar Cahaya Indonesia Tbk. is a subsidiary of PT Sentratama Niaga Indonesia.",
    "website": "http://www.wilmarcahayaindonesia.com",
    "zipcode": "17550"
  },
  "AISA.JK": {
    "city": "Jakarta Pusat",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT FKS Food Sejahtera Tbk",
    "market": "id_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "FKS Food Sejahtera Tbk.",
    "state": null,
    "summary": "PT FKS Food Sejahtera Tbk, together with its subsidiaries, engages in food manufacturing and rice milling businesses in Indonesia. The company offers dried and instant noodles, dried and corn vermicelli, biscuits, candies, and snacks. It is also involved in palm oil plantation activity; and the operation of electric power plant. The company was founded in 1959 and is headquartered in Jakarta Pusat, Indonesia.",
    "website": "http://tpsfood.id",
    "zipcode": "10220"
  },
  "BEEF.JK": {
    "city": "Cikarang",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Estika Tata Tiara Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "Estika Tata Tiara Tbk.",
    "state": null,
    "summary": "PT Estika Tata Tiara Tbk produces, processes, distributes, and markets beef products. The company offers marinated beef, various grade of meatballs, beef salami and patties, frankfurter sausages, smoked and corned beef, minced beef, and other sausages under the Kibif, Boss, Kipao, Murato, and Adell brand names. It is also involved in the cattle breeding, meat packing and processing, warehouse and distribution, and logistics activities. The company was formerly known as PT Estika Tata Tiara and changed its name to PT Estika Tata Tiara Tbk. PT Estika Tata Tiara Tbk was founded in 2001 and is based in Cikarang, Indonesia. PT Estika Tata Tiara Tbk is a subsidiary of PT Tiga Tunggal Adimulya.",
    "website": "http://www.kibif.com",
    "zipcode": "17550"
  },
  "BUDI.JK": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Budi Starch & Sweetener Tbk",
    "market": "id_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "Budi Starch & Sweetener Tbk.",
    "state": null,
    "summary": "PT Budi Starch & Sweetener Tbk, together with its subsidiaries, produces and sells cassava-based products in Indonesia and internationally. The company offers tapioca starch and modified tapioca starch for use in food, chemicals, flavoring spices, paper making, and clothing; and sweeteners, such as glucose, fructose, sorbitol, and maltodextrine. It also provides plastic sheeting products and polypropylene woven bags for packaging applications; sulfuric acid for use in fertilizer manufacturing industries, rayon, coloring agents, medicines, detergents, inorganic salts, oil refineries, and metallurgical processes; citric acid and other chemicals; and organic fertilizers. In addition, the company engages in trading business. The company was formerly known as PT Budi Acid Jaya Tbk and changed its name to PT Budi Starch & Sweetener Tbk in July 2013. PT Budi Starch & Sweetener Tbk was founded in 1979 and is headquartered in Jakarta, Indonesia.",
    "website": "http://budistarchsweetener.com",
    "zipcode": "12940"
  },
  "CAMP.JK": {
    "city": "Surabaya",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Campina Ice Cream Industry, Tbk.",
    "market": "id_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "Campina Ice Cream Industry Tbk.",
    "state": null,
    "summary": "PT Campina Ice Cream Industry, Tbk. produces, markets, and distributes ice creams in Indonesia. It offers cake, cone, cup, pack, and stick ice creams. The company was founded in 1972 and is headquartered in Surabaya, Indonesia.",
    "website": "http://www.campina.co.id",
    "zipcode": "60292"
  },
  "CEKA.JK": {
    "city": "Bekasi",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Wilmar Cahaya Indonesia Tbk.",
    "market": "id_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "Wilmar Cahaya Indonesia Tbk.",
    "state": null,
    "summary": "PT Wilmar Cahaya Indonesia Tbk. produces and sells vegetable and specialty oils in Indonesia. It offers specialty fats, including cocoa butter substitutes, cocoa butter replacers, cocoa butter equivalents, confectionary fats, icing and filling fats, milk fat replacers, ice cream fats, and spread fats, as well as bakery fats. The company was formerly known as PT Cahaya Kalbar Tbk. and changed its name to PT Wilmar Cahaya Indonesia Tbk. in May 2013. The company was founded in 1968 and is headquartered in Bekasi, Indonesia. PT Wilmar Cahaya Indonesia Tbk. is a subsidiary of PT Sentratama Niaga Indonesia.",
    "website": "http://www.wilmarcahayaindonesia.com",
    "zipcode": "17550"
  },
  "D7V.F": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "PT Mayora Indah Tbk",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "MAYORA INDAH  RP 20",
    "state": null,
    "summary": "PT Mayora Indah Tbk, together with its subsidiaries, manufactures and sells food and beverage products in Indonesia, rest of Asia, and internationally. It operates through three segments: Packaged Food Processing, Packaged Beverages Processing, and Financial Services. The company offers biscuits under the Roma Marie Susu, Roma Marie Susu Gold, Roma Kelapa, Roma Kelapa Cream, Roma Sandwich, Roma Malkist, Roma Malkist Abon, Roma Malkist Coklat, Roma Malkist Krim Keju Manis, Roma Malkist Krim Tiramisu, Roma Cream Creakers, Royal Choice, Better, Slai O Lai, Sari Gandum, Sari Gandum Sandwich, dll, and other brands names; candies under the Kopiko, Kopiko Cappuccino, KIS, Tamarin, dll, and other brand names; and wafers under the Beng Beng, Beng Beng Maxx, Beng Beng Share It, Astor, Roma Wafer Coklat, Roma Zuperrr Keju, Roma Choco Blast, dll, and other brand names. It also provides chocolates under the Choki-Choki and Drink Beng Beng brands; coffee under the Torabika Duo, Torabika Duo Susu Full Cream, Torabika 3 in 1, Torabika Moka, Torabika Cappuccino, Torabika Jahe Susu, Torabika Creamy Latte, Torabika Double Up, Kopiko Brown Coffee, Toracafe Volcano Chocomelt, Toracafe Caramelove, Torabika Milky Latte, and dll brand names; and health food products under the Energen Cereal, Energen Oatmilk, and Prima Cereal brands. In addition, it is involved in provision of financial services; and processing of coffee powder and instant coffee, and cacao beans. PT Mayora Indah Tbk was founded in 1977 and is headquartered in Jakarta, Indonesia.",
    "website": "http://www.mayoraindah.co.id",
    "zipcode": "11840"
  },
  "DMND.JK": {
    "city": "Central Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Diamond Food Indonesia Tbk",
    "market": "id_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "Diamond Food Indonesia Tbk.",
    "state": null,
    "summary": "PT Diamond Food Indonesia Tbk manufactures and distributes consumer goods in Indonesia. Its products include milk and cheese products, juices, chocolates, yogurts, ice creams, dressings, toppings and creamidor products. The company is also involved in the production and processing of dairy-based products and frozen food products; trading and distribution of food and beverage products, and non-food equipment and supplies; and retail of food and beverage products. PT Diamond Food Indonesia Tbk was founded in 1995 and is based in Central Jakarta, Indonesia.",
    "website": "http://www.diamond.co.id",
    "zipcode": "10220"
  },
  "DPUM.JK": {
    "city": "Pati",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Dua Putra Utama Makmur Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "Dua Putra Utama Makmur Tbk.",
    "state": null,
    "summary": "PT Dua Putra Utama Makmur Tbk engages in the fisheries and trading businesses in Indonesia. Its fish products include Indian mackerel, black pomfret, narrow-barred Spanish mackerel, large-head hairtail, snapper, spotted sardine, moonfish, round scad, short-fin scad, bullet tuna, frigate tuna, skipjack tuna, trevally, barracuda, thread-fin bream, hard-tail scad, leather jacket, tuna, purple-spotted big eye, grouper, conger eel, emperor, parrotfish, lizardfish, banyar fish, hammer croaker, samge, swangi, bloso, lemadang, silago, grouper, pure-bred, deho, salem, splotch, salmon, trevally, badong, tuna, manyung, kuniran, milkfish, jahan, etc. The company also provides shrimp products comprising white, black tiger, sea tiger, pink, flower, and vannamei shrimps; and squids, cuttlefish, and octopus. In addition, it offers processed food, including marugoto, ebi furay, ebi fritter, katsu ball squid and shrimp, nugget shrimp, squid nugget and beef, and shrimp steak and meatballs. The company was founded in 2012 and is headquartered in Pati, Indonesia. PT Dua Putra Utama Makmur Tbk is a subsidiary of PT Pandawa Putra Investama.",
    "website": "http://www.duaputra.com",
    "zipcode": "59119"
  },
  "ENZO.JK": {
    "city": "Demak",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Morenzo Abadi Perkasa Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "Morenzo Abadi Perkasa Tbk.",
    "state": null,
    "summary": "PT Morenzo Abadi Perkasa engages in the processing and export of seafood to various countries. It offers a range of products from pasteurized crabmeat to frozen seafood, such as squid, shrimp, soft shell crab, octopus, cuttlefish, etc. The company was founded in 2013 and is headquartered in Demak, Indonesia.",
    "website": "http://www.morenzo.co.id",
    "zipcode": "59581"
  },
  "FOOD.JK": {
    "city": "Jakarta Selatan",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Sentra Food Indonesia Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "Sentra Food Indonesia Tbk.",
    "state": null,
    "summary": "PT Sentra Food Indonesia Tbk engages in selling and processing of fresh meat and food and beverages products in Indonesia. The company operates through Fresh Meat, Processed Meat, and Others divisions. It offers sausages, burgers, meatballs, delicatessen, kebabs, dried beef, mayonnaise, and thousand island. The company was formerly known as PT Sentra Darmaga and changed its name to PT Sentra Food Indonesia Tbk in August 2018. The company was founded in 2004 and is headquartered in Jakarta Selatan, Indonesia. PT Sentra Food Indonesia Tbk is a subsidiary of PT Super Capital Indonesia.",
    "website": "http://www.sentrafood.co.id",
    "zipcode": "12190"
  },
  "GOOD.JK": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Garudafood Putra Putri Jaya Tbk",
    "market": "id_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "Garudafood Putra Putri Jaya Tbk",
    "state": null,
    "summary": "PT Garudafood Putra Putri Jaya Tbk provides snacks and beverages in Indonesia. The company operates through Snack Foods, Beverages, and Others segments. It offers biscuits, peanuts, bread, chocolates, ready-to-drink drinks, confectioneries, and milk processing products; and snacks, such as atomic, salted, sukro, and crunchy peanuts, as well as foods made from soybeans and other nuts. The company also exports its products. The company was founded in 1994 and is headquartered in Jakarta, Indonesia. PT Garudafood Putra Putri Jaya Tbk is a subsidiary of PT Tudung Putra Putri Jaya.",
    "website": "http://www.garudafood.com",
    "zipcode": "12240"
  },
  "HOKI.JK": {
    "city": "Jakarta Timur",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Buyung Poetra Sembada Tbk",
    "market": "id_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "Buyung Poetra Sembada Tbk.",
    "state": null,
    "summary": "PT Buyung Poetra Sembada Tbk produces and distributes rice in Indonesia. It supplies rice to supermarkets, hypermarkets, and other retail networks under the LIMAS, HOKI, Topi Koki, BPS, and Belida brand names; and broken rice to vermicelli plants. The company was founded in 2003 and is headquartered in East Jakarta, Indonesia. PT Buyung Poetra Sembada Tbk operates as a subsidiary of PT Buyung Investama Gemilang.",
    "website": "http://www.topikoki.com",
    "zipcode": "13240"
  },
  "ICBP.JK": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Indofood CBP Sukses Makmur Tbk",
    "market": "id_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "Indofood CBP Sukses Makmur Tbk.",
    "state": null,
    "summary": "PT Indofood CBP Sukses Makmur Tbk produces and sells consumers products in Indonesia and internationally. It offers noodles, sauces, and instant seasonings under the Indomie, Supermi, Sarimi, Pop Mie, Sakura, and Mi Telur Cap 3 Ayam brands. The company also provides sweetened condensed milk; UHT, sterilized bottled, and pasteurized liquid milk; powdered milk; ice cream; and butter under the Indomilk, Cap Enaak, Tiga Sapi, Kremer, Orchid Butter, Indoeskrim, Good To Go, and Milkuat brands. In addition, it offers chips and non-chips snacks under the Chitato, Qtela, Lays, Chiki, Cheetos, Jetz, Trenz, Wonderland, Dueto, Doritos brands; and food seasonings, including powdered and liquid seasonings, condiments, and syrups under the Sambal Indofood, Bumbu Special Indofood, Bumbu Racik, Indofood Freiss, Kecap Indofood, and Kecap Piring Lombok brands. Further, the company provides nutrition and special foods, such as baby cereals, follow-on cereals, noodle soups, and baby biscuits, as well as fortified milk for expectant and lactating mothers under the Promina, Sun, Govit, and Gowell brands. Additionally, it offers beverages comprising non-alcoholic beverage products, including tea, packaged water and fruit-flavored drinks, under the brands of Ichi Ocha, Club, and Fruitamin. The company also manufactures packaging materials; provides management consulting, general trading, and transportation services; processes oil and fats; markets and distributes paper diapers; and manages restaurants. The company was founded in 1982 and is headquartered in Jakarta, Indonesia. PT Indofood CBP Sukses Makmur Tbk is a subsidiary of PT Indofood Sukses Makmur Tbk.",
    "website": "http://www.indofoodcbp.com",
    "zipcode": "12910"
  },
  "INDF.JK": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Indofood Sukses Makmur Tbk",
    "market": "id_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "Indofood Sukses Makmur Tbk.",
    "state": null,
    "summary": "PT Indofood Sukses Makmur Tbk produces and sells various food products in Indonesia and internationally. It operates through four segments: Consumer Branded Products Business Group, Bogasari Business Group, Agribusiness Group, and Distribution Business Group. The Consumer Branded Products Business Group segment offers noodles; dairy products, including sweetened condensed, temperature, sterilized bottled, pasteurized liquid, multi-cereal, and powdered milk, as well as butter, ice cream, and creamer; snack foods, such as potato, cassava, soybean, sweet potato, and various extruded snacks, as well as biscuits; culinary products and syrups; nutrition and special foods; and ready-to-drink tea, packaged water, and fruit-flavored drinks. The Bogasari Business Group segment produces flour and pasta. The Agribusiness Group segment produces palm oil, rubber, sugar cane, timber, cocoa, and tea; and manufactures and markets cooking oils, margarines, shortenings, and other by-products. The Distribution Business Group segment distributes third-party products. It is also involved in the shipping, investment, trade export agency, industrial estate, and restaurant chain management activities; ownership and management of buildings; and provision of management consulting, flour blending and trading, and research management and technical services, as well as packaging materials and fertilizers. In addition, it manufactures coffee; extracts and processes coconut oil; operates bulking station; provides transportation services; and markets and distributes paper diapers and packaged drinking water. The company was formerly known as PT Panganjaya Intikusuma and changed its name to PT Indofood Sukses Makmur Tbk in 1994. The company was founded in 1990 and is headquartered in Jakarta, Indonesia. PT Indofood Sukses Makmur Tbk is a subsidiary of First Pacific Investment Management Limited.",
    "website": "http://www.indofood.com",
    "zipcode": "12910"
  },
  "ISM.F": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "PT Indofood Sukses Makmur Tbk",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "INDOFOOD  RP 100",
    "state": null,
    "summary": "PT Indofood Sukses Makmur Tbk produces and sells various food products in Indonesia and internationally. It operates through four segments: Consumer Branded Products Business Group, Bogasari Business Group, Agribusiness Group, and Distribution Business Group. The Consumer Branded Products Business Group segment offers noodles; dairy products, including sweetened condensed, temperature, sterilized bottled, pasteurized liquid, multi-cereal, and powdered milk, as well as butter, ice cream, and creamer; snack foods, such as potato, cassava, soybean, sweet potato, and various extruded snacks, as well as biscuits; culinary products and syrups; nutrition and special foods; and ready-to-drink tea, packaged water, and fruit-flavored drinks. The Bogasari Business Group segment produces flour and pasta. The Agribusiness Group segment produces palm oil, rubber, sugar cane, timber, cocoa, and tea; and manufactures and markets cooking oils, margarines, shortenings, and other by-products. The Distribution Business Group segment distributes third-party products. It is also involved in the shipping, investment, trade export agency, industrial estate, and restaurant chain management activities; ownership and management of buildings; and provision of management consulting, flour blending and trading, and research management and technical services, as well as packaging materials and fertilizers. In addition, it manufactures coffee; extracts and processes coconut oil; operates bulking station; provides transportation services; and markets and distributes paper diapers and packaged drinking water. The company was formerly known as PT Panganjaya Intikusuma and changed its name to PT Indofood Sukses Makmur Tbk in 1994. The company was founded in 1990 and is headquartered in Jakarta, Indonesia. PT Indofood Sukses Makmur Tbk is a subsidiary of First Pacific Investment Management Limited.",
    "website": "http://www.indofood.com",
    "zipcode": "12910"
  },
  "KEJU.JK": {
    "city": "Bekasi",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Mulia Boga Raya Tbk",
    "market": "id_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "Mulia Boga Raya Tbk.",
    "state": null,
    "summary": "PT Mulia Boga Raya Tbk manufactures and sells cheese and mayonnaise for salad dressing under the Prochiz brand name in Indonesia. The company offers block and sliced cheese, and other products. It sells its products through its own marketing force and third-party distributors. The company also exports its products. PT Mulia Boga Raya Tbk was founded in 2006 and is based in Bekasi, Indonesia. As of October 14, 2020, PT Mulia Boga Raya Tbk operates as a subsidiary of PT Garudafood Putra Putri Jaya Tbk.",
    "website": "http://www.prochiz.com",
    "zipcode": null
  },
  "MGRO.JK": {
    "city": "Medan",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Mahkota Group Tbk",
    "market": "id_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "Mahkota Group Tbk.",
    "state": null,
    "summary": "PT Mahkota Group Tbk engages in the palm oil processing and its derivatives businesses in Indonesia. The company produces crude palm oil, palm kernel, and other derivative products. It also offers logistic services; and engages in palm oil plantation activities. The company was founded in 2011 and is headquartered in Medan, Indonesia. PT Mahkota Group Tbk is a subsidiary of Pt Mahkota Global Investama.",
    "website": "http://www.mahkotagroup.com",
    "zipcode": "20231"
  },
  "MYOR.JK": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Mayora Indah Tbk",
    "market": "id_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "Mayora Indah Tbk.",
    "state": null,
    "summary": "PT Mayora Indah Tbk, together with its subsidiaries, manufactures and sells food and beverage products in Indonesia, rest of Asia, and internationally. It operates through three segments: Packaged Food Processing, Packaged Beverages Processing, and Financial Services. The company offers biscuits under the Roma Marie Susu, Roma Marie Susu Gold, Roma Kelapa, Roma Kelapa Cream, Roma Sandwich, Roma Malkist, Roma Malkist Abon, Roma Malkist Coklat, Roma Malkist Krim Keju Manis, Roma Malkist Krim Tiramisu, Roma Cream Creakers, Royal Choice, Better, Slai O Lai, Sari Gandum, Sari Gandum Sandwich, dll, and other brands names; candies under the Kopiko, Kopiko Cappuccino, KIS, Tamarin, dll, and other brand names; and wafers under the Beng Beng, Beng Beng Maxx, Beng Beng Share It, Astor, Roma Wafer Coklat, Roma Zuperrr Keju, Roma Choco Blast, dll, and other brand names. It also provides chocolates under the Choki-Choki and Drink Beng Beng brands; coffee under the Torabika Duo, Torabika Duo Susu Full Cream, Torabika 3 in 1, Torabika Moka, Torabika Cappuccino, Torabika Jahe Susu, Torabika Creamy Latte, Torabika Double Up, Kopiko Brown Coffee, Toracafe Volcano Chocomelt, Toracafe Caramelove, Torabika Milky Latte, and dll brand names; and health food products under the Energen Cereal, Energen Oatmilk, and Prima Cereal brands. In addition, it is involved in provision of financial services; and processing of coffee powder and instant coffee, and cacao beans. PT Mayora Indah Tbk was founded in 1977 and is headquartered in Jakarta, Indonesia.",
    "website": "http://www.mayoraindah.co.id",
    "zipcode": "11840"
  },
  "PANI.JK": {
    "city": "Tangerang",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Pratama Abadi Nusa Industri Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "Pratama Abadi Nusa Industri Tbk",
    "state": null,
    "summary": "PT Pratama Abadi Nusa Industri Tbk manufactures and sells packaging cans. The company primarily offers blek cans for glue and oil packaging. It also engages in the processing of fishery products, as well as provides food freezing and cold storage services. The company was founded in 2000 and is headquartered in Tangerang, Indonesia.",
    "website": "http://www.pratamaabadi.com",
    "zipcode": "15720"
  },
  "PCAR.JK": {
    "city": "Semarang",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Prima Cakrawala Abadi Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "Prima Cakrawala Abadi Tbk.",
    "state": null,
    "summary": "PT Prima Cakrawala Abadi Tbk, together with its subsidiaries, engages in the processing and distribution of fishery products in Indonesia. It offers pasteurized crab meat, and fresh and frozen products. The company also provides canning and cold storage of marine products. PT Prima Cakrawala Abadi Tbk was founded in 2014 and is headquartered in Semarang, Indonesia.",
    "website": "http://www.pcafoods.com",
    "zipcode": "50186"
  },
  "PIFFY": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "PT Indofood CBP Sukses Makmur Tbk",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "INDOFOOD CBP SUKSES MAKMUR TBK ",
    "state": null,
    "summary": "PT Indofood CBP Sukses Makmur Tbk produces and sells consumers products in Indonesia and internationally. It offers noodles, sauces, and instant seasonings under the Indomie, Supermi, Sarimi, Pop Mie, Sakura, and Mi Telur Cap 3 Ayam brands. The company also provides sweetened condensed milk; UHT, sterilized bottled, and pasteurized liquid milk; powdered milk; ice cream; and butter under the Indomilk, Cap Enaak, Tiga Sapi, Kremer, Orchid Butter, Indoeskrim, Good To Go, and Milkuat brands. In addition, it offers chips and non-chips snacks under the Chitato, Qtela, Lays, Chiki, Cheetos, Jetz, Trenz, Wonderland, Dueto, Doritos brands; and food seasonings, including powdered and liquid seasonings, condiments, and syrups under the Sambal Indofood, Bumbu Special Indofood, Bumbu Racik, Indofood Freiss, Kecap Indofood, and Kecap Piring Lombok brands. Further, the company provides nutrition and special foods, such as baby cereals, follow-on cereals, noodle soups, and baby biscuits, as well as fortified milk for expectant and lactating mothers under the Promina, Sun, Govit, and Gowell brands. Additionally, it offers beverages comprising non-alcoholic beverage products, including tea, packaged water and fruit-flavored drinks, under the brands of Ichi Ocha, Club, and Fruitamin. The company also manufactures packaging materials; provides management consulting, general trading, and transportation services; processes oil and fats; markets and distributes paper diapers; and manages restaurants. The company was founded in 1982 and is headquartered in Jakarta, Indonesia. PT Indofood CBP Sukses Makmur Tbk is a subsidiary of PT Indofood Sukses Makmur Tbk.",
    "website": "http://www.indofoodcbp.com",
    "zipcode": "12910"
  },
  "PIFMF": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "PT Indofood Sukses Makmur Tbk",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "PT INDOFOOD SUKSES MAKMUR TBK",
    "state": null,
    "summary": "PT Indofood Sukses Makmur Tbk produces and sells various food products in Indonesia and internationally. It operates through four segments: Consumer Branded Products Business Group, Bogasari Business Group, Agribusiness Group, and Distribution Business Group. The Consumer Branded Products Business Group segment offers noodles; dairy products, including sweetened condensed, temperature, sterilized bottled, pasteurized liquid, multi-cereal, and powdered milk, as well as butter, ice cream, and creamer; snack foods, such as potato, cassava, soybean, sweet potato, and various extruded snacks, as well as biscuits; culinary products and syrups; nutrition and special foods; and ready-to-drink tea, packaged water, and fruit-flavored drinks. The Bogasari Business Group segment produces flour and pasta. The Agribusiness Group segment produces palm oil, rubber, sugar cane, timber, cocoa, and tea; and manufactures and markets cooking oils, margarines, shortenings, and other by-products. The Distribution Business Group segment distributes third-party products. It is also involved in the shipping, investment, trade export agency, industrial estate, and restaurant chain management activities; ownership and management of buildings; and provision of management consulting, flour blending and trading, and research management and technical services, as well as packaging materials and fertilizers. In addition, it manufactures coffee; extracts and processes coconut oil; operates bulking station; provides transportation services; and markets and distributes paper diapers and packaged drinking water. The company was formerly known as PT Panganjaya Intikusuma and changed its name to PT Indofood Sukses Makmur Tbk in 1994. The company was founded in 1990 and is headquartered in Jakarta, Indonesia. PT Indofood Sukses Makmur Tbk is a subsidiary of First Pacific Investment Management Limited.",
    "website": "http://www.indofood.com",
    "zipcode": "12910"
  },
  "PIFMY": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "PT Indofood Sukses Makmur Tbk",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "PT INDOFOOD SUKSES MAKMUR TBK",
    "state": null,
    "summary": "PT Indofood Sukses Makmur Tbk produces and sells various food products in Indonesia and internationally. It operates through four segments: Consumer Branded Products Business Group, Bogasari Business Group, Agribusiness Group, and Distribution Business Group. The Consumer Branded Products Business Group segment offers noodles; dairy products, including sweetened condensed, temperature, sterilized bottled, pasteurized liquid, multi-cereal, and powdered milk, as well as butter, ice cream, and creamer; snack foods, such as potato, cassava, soybean, sweet potato, and various extruded snacks, as well as biscuits; culinary products and syrups; nutrition and special foods; and ready-to-drink tea, packaged water, and fruit-flavored drinks. The Bogasari Business Group segment produces flour and pasta. The Agribusiness Group segment produces palm oil, rubber, sugar cane, timber, cocoa, and tea; and manufactures and markets cooking oils, margarines, shortenings, and other by-products. The Distribution Business Group segment distributes third-party products. It is also involved in the shipping, investment, trade export agency, industrial estate, and restaurant chain management activities; ownership and management of buildings; and provision of management consulting, flour blending and trading, and research management and technical services, as well as packaging materials and fertilizers. In addition, it manufactures coffee; extracts and processes coconut oil; operates bulking station; provides transportation services; and markets and distributes paper diapers and packaged drinking water. The company was formerly known as PT Panganjaya Intikusuma and changed its name to PT Indofood Sukses Makmur Tbk in 1994. The company was founded in 1990 and is headquartered in Jakarta, Indonesia. PT Indofood Sukses Makmur Tbk is a subsidiary of First Pacific Investment Management Limited.",
    "website": "http://www.indofood.com",
    "zipcode": "12910"
  },
  "PMMP.JK": {
    "city": "Situbondo",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "Pt Panca Mitra Multiperdana Tbk",
    "market": "id_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "Panca Mitra Multiperdana Tbk.",
    "state": null,
    "summary": "Pt Panca Mitra Multiperdana Tbk engages in processing and sale of shrimp. The company supplies shrimp under EBINOYA brand name to restaurants, hotels, and food service firms in Indonesia; and exports to the United States and Japan under Leader brand name. Pt Panca Mitra Multiperdana Tbk was founded in 2004 and is headquartered in Jawa Timur, Indonesia.",
    "website": "http://www.pancamitra.com",
    "zipcode": null
  },
  "PSDN.JK": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Prasidha Aneka Niaga Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "Prasidha Aneka Niaga Tbk",
    "state": null,
    "summary": "PT Prasidha Aneka Niaga Tbk, together with its subsidiaries, engages in the processing and trading of agricultural products in Indonesia. It offers crumb rubber; and produces instant and roasted ground coffee products, and coffee beans. The company is also involved in the coffee plantation. It exports its products to the United States, Europe, and Asia. The company was formerly known as PT Aneka Bumi Asih and changed its name to PT Prasidha Aneka Niaga Tbk in 1994. PT Prasidha Aneka Niaga Tbk was founded in 1974 and is headquartered in Jakarta, Indonesia.",
    "website": "http://www.prasidha.co.id",
    "zipcode": "12930"
  },
  "ROTI.JK": {
    "city": "Bekasi",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Nippon Indosari Corpindo Tbk",
    "market": "id_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "Nippon Indosari Corpindo Tbk.",
    "state": null,
    "summary": "PT Nippon Indosari Corpindo Tbk manufactures, sells, and distributes breads in Indonesia and the Philippines. The company offers white/sliced breads, sweet/filled breads, and cakes under the Sari Roti brand. It sells its products to distributors and agents. The company was formerly known as PT Nippon Indosari Corporation and changed its name to PT Nippon Indosari Corpindo Tbk in 2003. PT Nippon Indosari Corpindo Tbk was incorporated in 1995 and is headquartered in Bekasi, Indonesia.",
    "website": "http://www.sariroti.com",
    "zipcode": "17530"
  },
  "SKBM.JK": {
    "city": "Jakarta Selatan",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Sekar Bumi Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "Sekar Bumi Tbk.",
    "state": null,
    "summary": "PT Sekar Bumi Tbk processes, produces, trades in, and distributes frozen food products in Indonesia. The company offers block packing, raw, and cooked shrimp, as well as cooked and peeled prawns; beef balls, sea food, fish balls, fish shiumai, hakau, kekian, martabak, mini wonton, nuggets, puffs, samosa, sausage, shiumai, shrimp balls, shrimp shiumai, spring rolls, and squid balls; and cheese and vegetable fish cake, brosur bumifood, dumpling ayam and udang, fish tofu, fish cake laksa recipe, scallop, shrimp and fish dumpling, and shumai. It also processes cashew nuts and other nut products; and bread crumbs and breaded shrimps. In addition, the company is involved in the agriculture, fisheries, aquaculture, trading, transportation, construction, services, printing, and workshop businesses. PT Sekar Bumi Tbk sells its products under the FINNA, SKB, Bumifood, and Mitraku brands. The company also exports its products to the United States, Europe, and other Asian countries. PT Sekar Bumi Tbk was founded in 1968 and is headquartered in Jakarta Selatan, Indonesia.",
    "website": "http://www.sekarbumi.com",
    "zipcode": "12190"
  },
  "SKLT.JK": {
    "city": "Surabaya",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Sekar Laut Tbk",
    "market": "id_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "Sekar Laut Tbk.",
    "state": null,
    "summary": "PT Sekar Laut Tbk produces and sells crackers, tomato and chili sauces, breads, and ready to use seasonings in Indonesia and internationally. The company provides cashew nuts, rice been and other beens, sardines, condiments, cooking spices, and Melinjo products under the Finna brand name. It also involved in the trading of consumer goods; and restaurant business. In addition, the company exports its products to the Netherlands, Korea, England, Oceania, China, and internationally. PT Sekar Laut Tbk was founded in 1976 and is headquartered in Surabaya, Indonesia.",
    "website": "http://www.sekarlaut.com",
    "zipcode": "60265"
  },
  "STTP.JK": {
    "city": "Sidoarjo",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Siantar Top Tbk",
    "market": "id_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "Siantar Top Tbk.",
    "state": null,
    "summary": "PT Siantar Top Tbk, together with its subsidiaries, manufactures and sells snacks in Indonesia. It operates in two segments, Food Processing and Others. The company offers biscuits, rice, coffee, instant and snack noodles, pellets, vermicelli, crackers, wafers, and candies, as well as flour and seasoning products. It also exports its products in Asia and the Middle East. The company was founded in 1972 and is headquartered in Sidoarjo, Indonesia. PT Siantar Top Tbk is a subsidiary of PT Shindo Tiara Tunggal.",
    "website": "http://www.siantartop.co.id",
    "zipcode": "61256"
  },
  "ULTJ.JK": {
    "city": "Bandung",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Ultrajaya Milk Industry & Trading Company Tbk",
    "market": "id_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "Ultra Jaya Milk Industry & Trad",
    "state": null,
    "summary": "PT Ultrajaya Milk Industry & Trading Company Tbk, together with its subsidiaries, operates in the food and beverage industry in Indonesia. The company operates in two segments, Beverages and Foods. It produces various beverages, such as milk, fruit juices, tea, traditional drinks, and health drinks; and sweetened condensed milk, powder milk, and tropical fruit juice concentrates. The company also offers milk products under the Ultra Milk and Ultra Mimi names; tea products under the Teh Kotak name; drinks and other health beverages under the Sari Kacang Ijo and Sari Asem names; and sweetened condensed milk under the Ultra Milk and Cap Sapi names. In addition, it provides freight and other services; and air and water management services, as well as engages in agriculture, dairy farm, and trading activities. Further, the company produces powder milk products through other parties for toll packing services. The company sells its products directly through retail outlets, food and beverages stores, kiosks, and its sales force; and indirectly through agents/distributors, minimarkets, supermarkets, and hypermarkets. It also exports its products. PT Ultrajaya Milk Industry & Trading Company Tbk was founded in 1971 and is headquartered in Bandung, Indonesia.",
    "website": "http://www.ultrajaya.co.id",
    "zipcode": "40552"
  },
  "WAPO.JK": {
    "city": "Surabaya",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Packaged Foods",
    "long_name": "PT Wahana Pronatural Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "Wahana Pronatural Tbk.",
    "state": null,
    "summary": "PT Wahana Pronatural Tbk trades in agriculture and marine products in Indonesia. The company operates through two segments, Sales Agrobisnis Product and Candy. It trades in dried seaweeds, cashew nut, rice, corn, coffee, and soybeans. The company also manufactures and sells candies under various brands. In addition, it engages in the agricultural products, coffee and mining commodities, industrial, transportation, and printing activities; and general contracting business. The company was formerly known as PT Wahana Phonix Mandiri and changed its name to PT Wahana Pronatural Tbk in June 2012. PT Wahana Pronatural Tbk was founded in 1979 and is headquartered in Surabaya, Indonesia.",
    "website": "http://www.wapo.co.id",
    "zipcode": "60271"
  }
}
