{"0P9.F": {"short_name": "RAISE PRODUCTION INC.", "long_name": "Raise Production Inc.", "summary": "Raise Production Inc., an oilfield service company, develops well pumping systems for deviated and horizontal oil and gas wells in Canada and the United States. The company offers Raise Efficient Artificial Lift (REAL) system that provides an artificial lift solution for the build and vertical section of a horizontal wellbore. Its REAL system includes the high angle reciprocating pump with the addition of various downhole tools, such as horizontal separation, sand control, velocity flow tubes, and pack off assemblies for flow control. The company was formerly known as Global Energy Services Ltd. and changed its name to Raise Production Inc. in November 2011. Raise Production Inc. was incorporated in 1993 and is based in Calgary, Canada.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Calgary"}, "30WA.F": {"short_name": "TERVITA CORP.", "long_name": "Tervita Corporation", "summary": "Tervita Corporation operates as a waste and environmentally focused energy service provider in Canada and the United States. It operates in two segments, Energy Services and Industrial Services. The Energy Services segment treats, recovers, and disposes fluids; provides oil terminalling and energy marketing services; processes and disposes solid materials; disposes oilfield-generated waste; offers onsite services using centrifugation or other processes for heavy oil producers involved in mining and in situ production; and supplies and operates drill site processing equipment, such as solids control and drill cuttings management. The Industrial Services segment provides site remediation, facility decommissioning, water treatment, sludge and slurry management, bio-remediation, emergency response, and rail, as well as hazardous and non-hazardous waste management, and disposal services; and technologies. This segment also offers recycling services that include purchase and processing of ferrous and non-ferrous metals recovered from demolition sites and other locations. As of December 31, 2019, the company operated 107 active waste processing, disposal, and industrial facilities, including 47 treatment, recovery, and disposal facilities; seven stand-alone disposal wells; three cavern disposal facilities; seven onsite facilities; 24 engineered landfills; four transfer stations; one naturally occurring radioactive material facility; nine bioremediation facilities; and five metals recycling facilities. It serves oil and gas industry, and industrial and natural resource sectors. The company was formerly known as CCS Corporation and changed its name to Tervita Corporation in March 2012. Tervita Corporation was founded in 1979 and is headquartered in Calgary, Canada.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Calgary"}, "3HE.F": {"short_name": "HANWEI ENERGY SERVICES", "long_name": "Hanwei Energy Services Corp.", "summary": "Hanwei Energy Services Corp., together with its subsidiaries, engineers, manufactures, and supplies high-pressure fiberglass reinforced plastic (FRP) pipes and fittings for the oil and gas, salt mining, water transmission, and industrial and infrastructure applications in China, Canada, Kazakhstan, and internationally. The company operates in two segments, FRP Pipe Business, and Oil and Gas Business. Its petroleum and natural gas assets consist of Leduc Lands asset that covers an area of approximately 3,770 net acres of mineral and surface rights located to the southwest of Edmonton, Alberta; Entice Lands asset covering an area of approximately 2,458 net acres of mineral and surface rights located to the east of Calgary, Alberta; and Nevis Lands asset that owns approximately 5,120 net acres of mineral and surface rights located to the east of Red Deer, Alberta. The company is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "3PS.F": {"short_name": "PASON SYSTEMS INC", "long_name": "Pason Systems Inc.", "summary": "Pason Systems Inc. provides instrumentation and data management systems for drilling rigs. The company offers Electronic AutoDriller, which maximizes the rate of penetration by monitoring various drilling parameters; Electronic Choke Actuator that provides a means of remotely controlling the choke valve; and Electronic Drilling Recorder, a drilling recorder. It also provides Pit Volume Totalizer, a well control system; ExxonMobil DAS, a drilling automation package; Gas Analyzer to detect the changes in relative volumes of hydrocarbon gases; Hazardous Gas Alarm System, which detects the presence of combustible gases and offers visible and audible alerts; Rig Communications that provides remote data communications for drillers; Rig Display, a touch screen computer to access services and applications on and around the rig floor; and SideKick, a rig floor computer, which allows for data entry and displays information around the rig. In addition, the company offers DataHub, a Web application, which collects, stores, and displays drilling data, reports, and real-time information for remote access; Directional System, an application that enables directional drillers to monitor and manage multiple wells; and Drilling Guidance System, which provides real-time guidance. Further, it offers Pason Live, a Web-based data viewer, which provides visualization tools that display real-time drilling data; Tour Sheet Analytics that delivers insight into the data; WellView Field Solution, a corporate well file, which begins at the request to drill and follows through to the well completion; and VERDAZO visual analytics software, as well as training and maintenance services. The company serves operators and contractors. It has operations in Canada, the United States, and internationally. Pason Systems Inc. was founded in 1978 and is headquartered in Calgary, Canada.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Calgary"}, "5CFA.F": {"short_name": "CALFRAC WELL SERVICES", "long_name": "Calfrac Well Services Ltd.", "summary": "Calfrac Well Services Ltd., together with its subsidiaries, provides specialized oilfield services in Canada, the United States, Russia, and Argentina. The company offers hydraulic fracturing, coiled tubing, cementing, other well stimulation, and pressure pumping services to oil and natural gas industries. Calfrac Well Services Ltd. was founded in 1999 and is headquartered in Calgary, Canada.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Calgary"}, "5JN.F": {"short_name": "BRI-CHEM CORP.", "long_name": "Bri-Chem Corp.", "summary": "Bri-Chem Corp. engages in the wholesale supply of drilling fluids and chemicals to the oil and gas industry in North America. It operates through five segments: Fluids Distribution Canada, Fluids Distribution USA, Fluids Blending & Packaging Canada, Fluids Blending & Packaging USA, and Other. The company supplies, blends, and packages drilling fluid products in various weights and clays, lost circulation materials, chemicals, and oil mud products. It also offers completion, cementing, acidizing, stimulation, and production chemicals; and sells calcium nitrate, silica fume, hydrated lime, potash, sodium carbonate, surfactants, and soda ash. In addition, the company provides testing of drilling fluids for customers for various analyses, including viscosity, fluid loss, lubricity, and others. Further, it provides various services to the oil and gas, industrial, agriculture, construction, and resource industries; and blends cementing additives, as well as holds truck and trailers. The company was founded in 1985 and is headquartered in Edmonton, Canada.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Acheson"}, "773.SG": {"short_name": "McCoy Global Inc. Registered Sh", "long_name": "McCoy Global Inc.", "summary": "McCoy Global Inc., together with its subsidiaries, provides equipment and technologies to support wellbore integrity and assist with collecting critical data for the energy industry. It designs, produces, and distributes capital equipment to support wellbore integrity, as well as supports capital equipment sales through aftermarket products and services, such as technical support, consumables, and replacement parts. The company also offers data collection technologies used in rugged applications in the energy industry, as well as in construction, marine, and aerospace sectors; and engages in the provision of repair, maintenance, and calibration of the capital equipment and similar competitor products, as well as rental of corporation technologies. It provides hydraulic power tongs used to make-up and break-out casing, tubing, and drill-pipe; bucking units used for assembling couplings to casing in tubular manufacturing plants; casing running tools; tubular running technologies; mud handling equipment; torque-turn monitoring and control software system; wireless data subs; diesel and electric hydraulic power units; torque-turn monitoring and control software system; roughnecks; load monitoring systems; portable aircraft digital scales; and winch control systems. The company provides aftermarket products and services, such as dies and inserts for tubular make-up and handling equipment; and gauging services. It offers its products and services through direct sales, agents, re-sellers, and distributors primarily under the brand names of DWCRT, CalCERT, weCATT, weVERIFY, winCATT, GRITFACE, CLINCHER, HYTOPS, CHROMEMASTER, LOCKJAW, and weTORQ. McCoy Global Inc. has operations in the United States, Latin America, the Middle East, Africa, Europe, Canada, the Asia Pacific, and Russia. The company was formerly known as McCoy Corporation and changed its name to McCoy Global Inc. in July 2014. McCoy Global Inc. was founded in 1914 and is headquartered in Edmonton, Canada.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "STU", "market": "dr_market", "country": "Canada", "city": "Edmonton"}, "776.SG": {"short_name": "Wavefront Technology Solut.IncR", "long_name": "Wavefront Technology Solutions Inc.", "summary": "Wavefront Technology Solutions Inc. develops fluid injection technologies for oil and gas well stimulation, and improved/enhanced oil recovery in North America, the Middle East, and internationally. The company offers Powerwave process, an injection technology that improves the flow of fluids in geological materials, including sedimentary soils and fractured rock; and Primawave process, a method for aiding in-ground environmental remediation clean-up in contaminated sites. The company was formerly known as Wavefront Energy and Environmental Services Inc. and changed its name to Wavefront Technology Solutions Inc. in March 2009. Wavefront Technology Solutions is headquartered in Edmonton, Canada.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "STU", "market": "dr_market", "country": "Canada", "city": "Edmonton"}, "7EX.F": {"short_name": "ENERFLEX LTD", "long_name": "Enerflex Ltd.", "summary": "Enerflex Ltd. supplies natural gas compression, oil and gas processing, refrigeration systems, and electric power generation equipment to the oil and natural gas industry. The company provides custom and standard compression packages for reciprocating and screw compressor applications; and designs, engineers, manufactures, constructs, and installs modular natural gas processing equipment and refrigeration systems, as well as engages in re-engineering, reconfiguration, and repackaging of compressors for various field applications. It also offers after-market mechanical service, and gas engines and parts distribution; operation, maintenance, and overhaul services; and integrated turnkey power generation and gas processing facilities. In addition, the company rents natural gas compressors totaling approximately 670,000 horsepower. It operates in Canada, the United States, Argentina, Bolivia, Brazil, Colombia, Mexico, the United Kingdom, Bahrain Kuwait, Oman, the United Arab Emirates, Australia, New Zealand, Indonesia, Malaysia, and Thailand. Enerflex Ltd. was founded in 1980 and is headquartered in Calgary, Canada.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Calgary"}, "BRY.TO": {"short_name": "BRI CHEM CORP", "long_name": "Bri-Chem Corp.", "summary": "Bri-Chem Corp. engages in the wholesale supply of drilling fluids and chemicals to the oil and gas industry in North America. It operates through five segments: Fluids Distribution Canada, Fluids Distribution USA, Fluids Blending & Packaging Canada, Fluids Blending & Packaging USA, and Other. The company supplies, blends, and packages drilling fluid products in various weights and clays, lost circulation materials, chemicals, and oil mud products. It also offers completion, cementing, acidizing, stimulation, and production chemicals; and sells calcium nitrate, silica fume, hydrated lime, potash, sodium carbonate, surfactants, and soda ash. In addition, the company provides testing of drilling fluids for customers for various analyses, including viscosity, fluid loss, lubricity, and others. Further, it provides various services to the oil and gas, industrial, agriculture, construction, and resource industries; and blends cementing additives, as well as holds truck and trailers. The company was founded in 1985 and is headquartered in Edmonton, Canada.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Acheson"}, "CESDF": {"short_name": "CES ENERGY SOLUTIONS CORP", "long_name": "CES Energy Solutions Corp.", "summary": "CES Energy Solutions Corp., together with its subsidiaries, provides consumable chemical solutions throughout the life-cycle of the oilfield. It provides solutions at the drill-bit, at the point of completion and stimulation, at the wellhead and pump-jack, and through to the pipeline and midstream market. The company's solutions include corrosion inhibitors, demulsifiers, H2S scavengers, paraffin control products, surfactants, scale inhibitors, biocides, and other specialty products. It also designs and implements drilling fluid systems and completion solutions for oil and gas producers; and designs and manufactures production and specialty chemicals for use in the oil and natural gas production markets, the stimulation and fracturing markets, and the pipeline and midstream markets. In addition, the company provides environmental consulting, water management services, and drilling fluids waste disposal services primarily to oil and gas producers; and trucks and trailers to transport products in the oil and gas industry. It serves oil and natural gas industry, including multinational producers, intermediate oil and natural gas operators, independent juniors, and joint ventures, as well as pipeline and mid-stream markets in western Canada and the United States. The company was formerly known as Canadian Energy Services & Technology Corp. and changed its name to CES Energy Solutions Corp. in June 2017. CES Energy Solutions Corp. was incorporated in 1986 and is headquartered in Calgary, Canada.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Calgary"}, "CEU.TO": {"short_name": "CES ENERGY SOLUTIONS CORP", "long_name": "CES Energy Solutions Corp.", "summary": "CES Energy Solutions Corp., together with its subsidiaries, provides consumable chemical solutions throughout the life-cycle of the oilfield. It provides solutions at the drill-bit, at the point of completion and stimulation, at the wellhead and pump-jack, and through to the pipeline and midstream market. The company's solutions include corrosion inhibitors, demulsifiers, H2S scavengers, paraffin control products, surfactants, scale inhibitors, biocides, and other specialty products. It also designs and implements drilling fluid systems and completion solutions for oil and gas producers; and designs and manufactures production and specialty chemicals for use in the oil and natural gas production markets, the stimulation and fracturing markets, and the pipeline and midstream markets. In addition, the company provides environmental consulting, water management services, and drilling fluids waste disposal services primarily to oil and gas producers; and trucks and trailers to transport products in the oil and gas industry. It serves oil and natural gas industry, including multinational producers, intermediate oil and natural gas operators, independent juniors, and joint ventures, as well as pipeline and mid-stream markets in western Canada and the United States. The company was formerly known as Canadian Energy Services & Technology Corp. and changed its name to CES Energy Solutions Corp. in June 2017. CES Energy Solutions Corp. was incorporated in 1986 and is headquartered in Calgary, Canada.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "CFW.TO": {"short_name": "CALFRAC WELL SERVICES LTD.", "long_name": "Calfrac Well Services Ltd.", "summary": "Calfrac Well Services Ltd., together with its subsidiaries, provides specialized oilfield services in Canada, the United States, Russia, and Argentina. The company offers hydraulic fracturing, coiled tubing, cementing, other well stimulation, and pressure pumping services to oil and natural gas industries. Calfrac Well Services Ltd. was founded in 1999 and is headquartered in Calgary, Canada.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "CFWFD": {"short_name": "CALFRAC WELL SERVICES LTD", "long_name": "Calfrac Well Services Ltd.", "summary": "Calfrac Well Services Ltd., together with its subsidiaries, provides specialized oilfield services in Canada, the United States, Russia, and Argentina. The company offers hydraulic fracturing, coiled tubing, cementing, other well stimulation, and pressure pumping services to oil and natural gas industries. Calfrac Well Services Ltd. was founded in 1999 and is headquartered in Calgary, Canada.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Calgary"}, "CWC.V": {"short_name": "CWC ENERGY SERVICES CORP", "long_name": "CWC Energy Services Corp.", "summary": "CWC Energy Services Corp., a contract drilling and well servicing company, provides oilfield services to oil and gas exploration and development companies in the Western Canadian Sedimentary Basin. The company operates in two segments, Contract Drilling and Production Services. It offers oilfield services, including drilling rigs, service rigs, swabbing rigs, and coil tubing. The company also provides completion, maintenance, workover, and well decommissioning services. It operates through a fleet of 9 telescopic double drilling rigs with depth ratings from 3,200 to 5,000 meters; 145 service rigs, including 75 single, 56 double, and 14 slant rigs; 12 swabbing rigs; and 9 coil tubing units with depth ratings from 1,500 to 3,200 meters. The company was formerly known as CWC Well Services Corp. and changed its name to CWC Energy Services Corp. in May 2014. CWC Energy Services Corp. is headquartered in Calgary, Canada.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "EEYUF": {"short_name": "ESSENTIAL ENERGY SERVICES LTD", "long_name": "Essential Energy Services Ltd.", "summary": "Essential Energy Services Ltd., together with its subsidiaries, provides oilfield services to oil and gas exploration and production companies. The company operates in two segments, Essential Coil Well Service (ECWS) and Tryton Tool Services (Tryton). The ECWS segment offers well completion and stimulation, and workover services with its fleet of coil tubing rigs, and fluid and nitrogen pumpers, as well as ancillary equipment. As of December 31, 2019, its fleet included 29 coil tubing rigs, 19 fluid pumpers, and eight nitrogen pumpers. The Tryton segment provides a range of downhole tool and rental services for completion, production, and decommissioning of oil and natural gas wells, including horizontal and vertical wells in western Canada and the United States. Essential Energy Services Ltd. was incorporated in 2010 and is headquartered in Calgary, Canada.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Calgary"}, "EFX.TO": {"short_name": "ENERFLEX LTD", "long_name": "Enerflex Ltd.", "summary": "Enerflex Ltd. supplies natural gas compression, oil and gas processing, refrigeration systems, and electric power generation equipment to the oil and natural gas industry. The company provides custom and standard compression packages for reciprocating and screw compressor applications; and designs, engineers, manufactures, constructs, and installs modular natural gas processing equipment and refrigeration systems, as well as engages in re-engineering, reconfiguration, and repackaging of compressors for various field applications. It also offers after-market mechanical service, and gas engines and parts distribution; operation, maintenance, and overhaul services; and integrated turnkey power generation and gas processing facilities. In addition, the company rents natural gas compressors totaling approximately 670,000 horsepower. It operates in Canada, the United States, Argentina, Bolivia, Brazil, Colombia, Mexico, the United Kingdom, Bahrain Kuwait, Oman, the United Arab Emirates, Australia, New Zealand, Indonesia, Malaysia, and Thailand. Enerflex Ltd. was founded in 1980 and is headquartered in Calgary, Canada.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "ENRFF": {"short_name": "ENERFLEX LTD", "long_name": "Enerflex Ltd.", "summary": "Enerflex Ltd. supplies natural gas compression, oil and gas processing, refrigeration systems, and electric power generation equipment to the oil and natural gas industry. The company provides custom and standard compression packages for reciprocating and screw compressor applications; and designs, engineers, manufactures, constructs, and installs modular natural gas processing equipment and refrigeration systems, as well as engages in re-engineering, reconfiguration, and repackaging of compressors for various field applications. It also offers after-market mechanical service, and gas engines and parts distribution; operation, maintenance, and overhaul services; and integrated turnkey power generation and gas processing facilities. In addition, the company rents natural gas compressors totaling approximately 670,000 horsepower. It operates in Canada, the United States, Argentina, Bolivia, Brazil, Colombia, Mexico, the United Kingdom, Bahrain Kuwait, Oman, the United Arab Emirates, Australia, New Zealand, Indonesia, Malaysia, and Thailand. Enerflex Ltd. was founded in 1980 and is headquartered in Calgary, Canada.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Calgary"}, "HE.TO": {"short_name": "HANWEI ENERGY SERVICES CORP.", "long_name": "Hanwei Energy Services Corp.", "summary": "Hanwei Energy Services Corp., together with its subsidiaries, engineers, manufactures, and supplies high-pressure fiberglass reinforced plastic (FRP) pipes and fittings for the oil and gas, salt mining, water transmission, and industrial and infrastructure applications in China, Canada, Kazakhstan, and internationally. The company operates in two segments, FRP Pipe Business, and Oil and Gas Business. Its petroleum and natural gas assets consist of Leduc Lands asset that covers an area of approximately 3,770 net acres of mineral and surface rights located to the southwest of Edmonton, Alberta; Entice Lands asset covering an area of approximately 2,458 net acres of mineral and surface rights located to the east of Calgary, Alberta; and Nevis Lands asset that owns approximately 5,120 net acres of mineral and surface rights located to the east of Red Deer, Alberta. The company is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "HGHAF": {"short_name": "HIGH ARCTIC ENERGY SERVICES INC", "long_name": "High Arctic Energy Services Inc", "summary": "High Arctic Energy Services Inc., an oilfield services company, provides oilfield services to exploration and production companies in Canada, Papua New Guinea, and the United States. The company operates through three segments: Drilling Services, Production Services, and Ancillary Services. It offers snubbing services, which include foothills standalone snubbing system for completions and workovers; Hydraulic Workover (HWO) Units, including a patented L-Frame equipment configuration; Rig Assist Snubbing Unit, a truck-mounted hydraulic system to manage underbalanced wellbore conditions; and Power Tower to install a snubbing unit and blowout preventers in one lift. The company also rents oilfield equipment comprising accumulators, blowout preventers, casing cutters and scrappers, chokes, boilers, boiler blowdown tanks, generators, light towers, cross over and rotary subs, elevators, EUE collars, fire suppression kits, fuel tank skid, hot tap kit, mud can, pickers, pipe racks, power swivels, pumps, slips, spools, flanges, thread washers, tongs, trailers and accommodations, tubing, and valves for drilling, completions, workover, and abandonment of oil and gas operations. In addition, it provides nitrogen pumping units; and well servicing. Further, it owns and operates two heli-portable drilling rig in Papua New Guinea; and support equipment, such as rig matting, crawler cranes, water pumps, forklifts/wheel loaders, telehandlers, lighting towers, camps, trucks, wash-down packages, vehicles, and drill pipe and BHA. High Arctic Energy Services Inc. was founded in 1993 and is headquartered in Calgary, Canada.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Calgary"}, "HTC.V": {"short_name": "HTC PURENERGY INC.", "long_name": "HTC Purenergy Inc.", "summary": "HTC Purenergy Inc., doing business as HTC Extraction Systems, develops, aggregates, and commercializes proprietary technologies relating to gas, liquid and biomass extraction, distillation, purification, and reclamation in Canada. It operates through two segments, HTC's Delta CleanTech Division and HTC's Hemp Division. The HTC's Delta CleanTech Division provides products and services related to clean energy industries. The HTC's Hemp Division engages in hemp-based activities, such as hemp extraction, refining, formulation, and distribution in the State of California. The company's products include Delta purification systems/ CO2 capture systems, Delta reclaimer systems, and hydrogen thermochem systems. The company was formerly known as HTC Hydrogen Technologies Corp. and changed its name to HTC Purenergy Inc. in February 2008. HTC Purenergy Inc. is headquartered in Regina, Canada.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Regina"}, "HWO.TO": {"short_name": "HIGH ARCTIC ENERGY SERVICES INC", "long_name": "High Arctic Energy Services Inc", "summary": "High Arctic Energy Services Inc., an oilfield services company, provides oilfield services to exploration and production companies in Canada, Papua New Guinea, and the United States. The company operates through three segments: Drilling Services, Production Services, and Ancillary Services. It offers snubbing services, which include foothills standalone snubbing system for completions and workovers; Hydraulic Workover (HWO) Units, including a patented L-Frame equipment configuration; Rig Assist Snubbing Unit, a truck-mounted hydraulic system to manage underbalanced wellbore conditions; and Power Tower to install a snubbing unit and blowout preventers in one lift. The company also rents oilfield equipment comprising accumulators, blowout preventers, casing cutters and scrappers, chokes, boilers, boiler blowdown tanks, generators, light towers, cross over and rotary subs, elevators, EUE collars, fire suppression kits, fuel tank skid, hot tap kit, mud can, pickers, pipe racks, power swivels, pumps, slips, spools, flanges, thread washers, tongs, trailers and accommodations, tubing, and valves for drilling, completions, workover, and abandonment of oil and gas operations. In addition, it provides nitrogen pumping units; and well servicing. Further, it owns and operates two heli-portable drilling rig in Papua New Guinea; and support equipment, such as rig matting, crawler cranes, water pumps, forklifts/wheel loaders, telehandlers, lighting towers, camps, trucks, wash-down packages, vehicles, and drill pipe and BHA. High Arctic Energy Services Inc. was founded in 1993 and is headquartered in Calgary, Canada.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "IESCF": {"short_name": "INTERCEPT ENERGY SERVICES INC", "long_name": "Intercept Energy Services Inc.", "summary": "Intercept Energy Services Inc., an oil and gas service company, provides technology that heats water used in the fracturing process by exploration and production companies in Canada and the United States. The company offers Big Heat superheater water heating system; and power tongs, as well as operates water heating units. It operates six thru-tubing power tong units. The company was formerly known as Global Green Matrix Corp. and changed its name to Intercept Energy Services Inc. in September 2013. Intercept Energy Services Inc. was incorporated in 1995 and is headquartered in Edmonton, Canada.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Edmonton"}, "MCB.TO": {"short_name": "MCCOY GLOBAL INC", "long_name": "McCoy Global Inc.", "summary": "McCoy Global Inc., together with its subsidiaries, provides equipment and technologies to support wellbore integrity and assist with collecting critical data for the energy industry. It designs, produces, and distributes capital equipment to support wellbore integrity, as well as supports capital equipment sales through aftermarket products and services, such as technical support, consumables, and replacement parts. The company also offers data collection technologies used in rugged applications in the energy industry, as well as in construction, marine, and aerospace sectors; and engages in the provision of repair, maintenance, and calibration of the capital equipment and similar competitor products, as well as rental of corporation technologies. It provides hydraulic power tongs used to make-up and break-out casing, tubing, and drill-pipe; bucking units used for assembling couplings to casing in tubular manufacturing plants; casing running tools; tubular running technologies; mud handling equipment; torque-turn monitoring and control software system; wireless data subs; diesel and electric hydraulic power units; torque-turn monitoring and control software system; roughnecks; load monitoring systems; portable aircraft digital scales; and winch control systems. The company provides aftermarket products and services, such as dies and inserts for tubular make-up and handling equipment; and gauging services. It offers its products and services through direct sales, agents, re-sellers, and distributors primarily under the brand names of DWCRT, CalCERT, weCATT, weVERIFY, winCATT, GRITFACE, CLINCHER, HYTOPS, CHROMEMASTER, LOCKJAW, and weTORQ. McCoy Global Inc. has operations in the United States, Latin America, the Middle East, Africa, Europe, Canada, the Asia Pacific, and Russia. The company was formerly known as McCoy Corporation and changed its name to McCoy Global Inc. in July 2014. McCoy Global Inc. was founded in 1914 and is headquartered in Edmonton, Canada.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Edmonton"}, "NOA": {"short_name": "North American Construction Gro", "long_name": "North American Construction Group Ltd.", "summary": "North American Construction Group Ltd. provides mining and heavy construction services to the resource development and industrial construction sectors in Canada. The company's Heavy Construction & Mining division offers constructability reviews, budgetary cost estimates, design-build construction, project management, contract mining, pre-stripping/pit pioneering, overburden removal and stockpile, muskeg removal and stockpile, site preparation, air strip construction, site dewatering/perimeter ditching, tailings and process pipelines, haulage and access road construction, tailings dam construction and densification, mechanically stabilized earth walls, dyke construction, and reclamation services. Its Equipment Maintenance Services division provides fuel and lube servicing, portable steaming, equipment inspections, parts and component supply, major overhauls and equipment refurbishment, onsite haul truck brake testing, onsite maintenance support, under carriage rebuild, machining, hose manufacturing, and technical support services, as well as welding, fabrication/repairs, weld certification, and inspection services. As of December 31, 2019, the company had a heavy equipment fleet of 686 units. The company was formerly known as North American Energy Partners Inc. and changed its name to North American Construction Group Ltd. in April 2018. The company was founded in 1953 and is headquartered in Acheson, Canada.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "NYQ", "market": "us_market", "country": "Canada", "city": "Acheson"}, "NOA.TO": {"short_name": "NORTH AMERICAN CONSTRUCTION GRO", "long_name": "North American Construction Group Ltd.", "summary": "North American Construction Group Ltd. provides mining and heavy construction services to the resource development and industrial construction sectors in Canada. The company's Heavy Construction & Mining division offers constructability reviews, budgetary cost estimates, design-build construction, project management, contract mining, pre-stripping/pit pioneering, overburden removal and stockpile, muskeg removal and stockpile, site preparation, air strip construction, site dewatering/perimeter ditching, tailings and process pipelines, haulage and access road construction, tailings dam construction and densification, mechanically stabilized earth walls, dyke construction, and reclamation services. Its Equipment Maintenance Services division provides fuel and lube servicing, portable steaming, equipment inspections, parts and component supply, major overhauls and equipment refurbishment, onsite haul truck brake testing, onsite maintenance support, under carriage rebuild, machining, hose manufacturing, and technical support services, as well as welding, fabrication/repairs, weld certification, and inspection services. As of December 31, 2019, the company had a heavy equipment fleet of 686 units. The company was formerly known as North American Energy Partners Inc. and changed its name to North American Construction Group Ltd. in April 2018. The company was founded in 1953 and is headquartered in Acheson, Canada.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Acheson"}, "NSFDF": {"short_name": "NXT ENERGY SOLUTIONS INC", "long_name": "NXT Energy Solutions Inc.", "summary": "NXT Energy Solutions Inc., a technology company, provides geophysical survey services to the upstream oil and gas industry through its proprietary gravity-based stress field detection (SFD) survey system worldwide. Its SFD remote-sensing survey system offers information on areas conducive to fluid entrapment in the sedimentary column. The company was formerly known as Energy Exploration Technologies Inc. and changed its name to NXT Energy Solutions Inc. in September 2008. NXT Energy Solutions Inc. was founded in 1994 and is headquartered in Calgary, Canada.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Calgary"}, "OPI.CN": {"short_name": "ESIEngySer", "long_name": "ESI Energy Services Inc.", "summary": "ESI Energy Services Inc. rents and sells backfill separation machines in the United States and Canada. The company offers padding machines, pipe layers, and oilfield services equipment. It serves mainline pipeline contractors, and renewables and utility construction contractors, as well as oilfield pipeline and construction contractors. ESI Energy Services Inc. was founded in 2001 and is headquartered in Calgary, Canada. As of September 9, 2020, ESI Energy Services Inc. operates as a subsidiary of Battery Mineral Resources Corp.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "PLSDF": {"short_name": "PULSE SEISMIC INC", "long_name": "Pulse Seismic Inc.", "summary": "Pulse Seismic Inc. acquires, markets, and licenses two-dimensional (2D) and three-dimensional (3D) seismic data for the energy sector in Western Canada. Its library covers principal areas in Alberta, Northeast British Columbia, and Saskatchewan, as well as includes portions of the Northwest Territories, Yukon, Manitoba, and Montana. The company's seismic data is used by oil and natural gas exploration and development companies. It owns and manages licensable seismic data library that consists of approximately 65,310 net square kilometers of 3D seismic; and 8,29,207 linear kilometers of 2D seismic data. The company was formerly known as Pulse Data Inc. and changed its name to Pulse Seismic Inc. in May 2009. Pulse Seismic Inc. was founded in 1985 and is headquartered in Calgary, Canada.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Calgary"}, "PSD.TO": {"short_name": "PULSE SEISMIC INC.", "long_name": "Pulse Seismic Inc.", "summary": "Pulse Seismic Inc. acquires, markets, and licenses two-dimensional (2D) and three-dimensional (3D) seismic data for the energy sector in Western Canada. Its library covers principal areas in Alberta, Northeast British Columbia, and Saskatchewan, as well as includes portions of the Northwest Territories, Yukon, Manitoba, and Montana. The company's seismic data is used by oil and natural gas exploration and development companies. It owns and manages licensable seismic data library that consists of approximately 65,310 net square kilometers of 3D seismic; and 8,29,207 linear kilometers of 2D seismic data. The company was formerly known as Pulse Data Inc. and changed its name to Pulse Seismic Inc. in May 2009. Pulse Seismic Inc. was founded in 1985 and is headquartered in Calgary, Canada.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "PSI.TO": {"short_name": "PASON SYSTEMS INC.", "long_name": "Pason Systems Inc.", "summary": "Pason Systems Inc. provides instrumentation and data management systems for drilling rigs. The company offers Electronic AutoDriller, which maximizes the rate of penetration by monitoring various drilling parameters; Electronic Choke Actuator that provides a means of remotely controlling the choke valve; and Electronic Drilling Recorder, a drilling recorder. It also provides Pit Volume Totalizer, a well control system; ExxonMobil DAS, a drilling automation package; Gas Analyzer to detect the changes in relative volumes of hydrocarbon gases; Hazardous Gas Alarm System, which detects the presence of combustible gases and offers visible and audible alerts; Rig Communications that provides remote data communications for drillers; Rig Display, a touch screen computer to access services and applications on and around the rig floor; and SideKick, a rig floor computer, which allows for data entry and displays information around the rig. In addition, the company offers DataHub, a Web application, which collects, stores, and displays drilling data, reports, and real-time information for remote access; Directional System, an application that enables directional drillers to monitor and manage multiple wells; and Drilling Guidance System, which provides real-time guidance. Further, it offers Pason Live, a Web-based data viewer, which provides visualization tools that display real-time drilling data; Tour Sheet Analytics that delivers insight into the data; WellView Field Solution, a corporate well file, which begins at the request to drill and follows through to the well completion; and VERDAZO visual analytics software, as well as training and maintenance services. The company serves operators and contractors. It has operations in Canada, the United States, and internationally. Pason Systems Inc. was founded in 1978 and is headquartered in Calgary, Canada.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "PSYTF": {"short_name": "PASON SYSTEM INCOR", "long_name": "Pason Systems Inc.", "summary": "Pason Systems Inc. provides instrumentation and data management systems for drilling rigs. The company offers Electronic AutoDriller, which maximizes the rate of penetration by monitoring various drilling parameters; Electronic Choke Actuator that provides a means of remotely controlling the choke valve; and Electronic Drilling Recorder, a drilling recorder. It also provides Pit Volume Totalizer, a well control system; ExxonMobil DAS, a drilling automation package; Gas Analyzer to detect the changes in relative volumes of hydrocarbon gases; Hazardous Gas Alarm System, which detects the presence of combustible gases and offers visible and audible alerts; Rig Communications that provides remote data communications for drillers; Rig Display, a touch screen computer to access services and applications on and around the rig floor; and SideKick, a rig floor computer, which allows for data entry and displays information around the rig. In addition, the company offers DataHub, a Web application, which collects, stores, and displays drilling data, reports, and real-time information for remote access; Directional System, an application that enables directional drillers to monitor and manage multiple wells; and Drilling Guidance System, which provides real-time guidance. Further, it offers Pason Live, a Web-based data viewer, which provides visualization tools that display real-time drilling data; Tour Sheet Analytics that delivers insight into the data; WellView Field Solution, a corporate well file, which begins at the request to drill and follows through to the well completion; and VERDAZO visual analytics software, as well as training and maintenance services. The company serves operators and contractors. It has operations in Canada, the United States, and internationally. Pason Systems Inc. was founded in 1978 and is headquartered in Calgary, Canada.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Calgary"}, "PUD.F": {"short_name": "PULSE SEISMIC INC.", "long_name": "Pulse Seismic Inc.", "summary": "Pulse Seismic Inc. acquires, markets, and licenses two-dimensional (2D) and three-dimensional (3D) seismic data for the energy sector in Western Canada. Its library covers principal areas in Alberta, Northeast British Columbia, and Saskatchewan, as well as includes portions of the Northwest Territories, Yukon, Manitoba, and Montana. The company's seismic data is used by oil and natural gas exploration and development companies. It owns and manages licensable seismic data library that consists of approximately 65,310 net square kilometers of 3D seismic; and 8,29,207 linear kilometers of 2D seismic data. The company was formerly known as Pulse Data Inc. and changed its name to Pulse Seismic Inc. in May 2009. Pulse Seismic Inc. was founded in 1985 and is headquartered in Calgary, Canada.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Calgary"}, "RPC.V": {"short_name": "RAISE PRODUCTION INC", "long_name": "Raise Production Inc.", "summary": "Raise Production Inc., an oilfield service company, develops well pumping systems for deviated and horizontal oil and gas wells in Canada and the United States. The company offers Raise Efficient Artificial Lift (REAL) system that provides an artificial lift solution for the build and vertical section of a horizontal wellbore. Its REAL system includes the high angle reciprocating pump with the addition of various downhole tools, such as horizontal separation, sand control, velocity flow tubes, and pack off assemblies for flow control. The company was formerly known as Global Energy Services Ltd. and changed its name to Raise Production Inc. in November 2011. Raise Production Inc. was incorporated in 1993 and is based in Calgary, Canada.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "S9W.F": {"short_name": "SHAWCOR LTD NEW", "long_name": "Shawcor Ltd.", "summary": "Shawcor Ltd., an energy services company, provides products and services for the infrastructure, energy, and transportation markets in North America, Latin America, Europe, the Middle East, Africa, Russia, and the Asia Pacific. The company operates through three segments: Pipeline and Pipe Services, Composite Systems, and Automotive and Industrial. The company offers pipe, insulation, and weight coating systems, as well as custom coating and field joint application services for onshore and offshore pipelines; manufactures and sells heat shrinkable sleeves, adhesives, and liquid coatings for pipeline joint protection applications; designs and assembles engineered pipe logistics products and services; and provides ultrasonic and radiographic pipeline girth weld inspection services for pipeline operators and construction contractors. It also offers spoolable and stick composite pipe systems; high density polyethylene pipes for use in oil and gas gathering, water disposal, carbon dioxide injection pipelines, and other applications; and reinforced plastic underground storage tanks for the retail fuel, water and wastewater, and oil and gas markets. In addition, the company offers tubular management services, including inventory management systems, mobile and in-plant inspection, and refurbishment and rethreading of drill pipe, production tubing and casing, and tubular products; non-destructive testing services for oil and gas gathering pipelines and oilfield infrastructure integrity management services; and pipeline engineering and integrity management services to pipeline operators. Further, it provides heat-shrinkable products, including tubings, sleeve and molded products, and heat-shrink accessories and equipment; and wires and cables for the control, instrumentation, thermocouple, power, marine, and robotics applications. The company was formerly known as Shaw Industries Ltd. and changed its name to Shawcor Ltd. in 2001. Shawcor Ltd. is headquartered in Toronto, Canada.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "SAWLF": {"short_name": "SHAWCOR LTD NEW", "long_name": "Shawcor Ltd.", "summary": "Shawcor Ltd., an energy services company, provides products and services for the infrastructure, energy, and transportation markets in North America, Latin America, Europe, the Middle East, Africa, Russia, and the Asia Pacific. The company operates through three segments: Pipeline and Pipe Services, Composite Systems, and Automotive and Industrial. The company offers pipe, insulation, and weight coating systems, as well as custom coating and field joint application services for onshore and offshore pipelines; manufactures and sells heat shrinkable sleeves, adhesives, and liquid coatings for pipeline joint protection applications; designs and assembles engineered pipe logistics products and services; and provides ultrasonic and radiographic pipeline girth weld inspection services for pipeline operators and construction contractors. It also offers spoolable and stick composite pipe systems; high density polyethylene pipes for use in oil and gas gathering, water disposal, carbon dioxide injection pipelines, and other applications; and reinforced plastic underground storage tanks for the retail fuel, water and wastewater, and oil and gas markets. In addition, the company offers tubular management services, including inventory management systems, mobile and in-plant inspection, and refurbishment and rethreading of drill pipe, production tubing and casing, and tubular products; non-destructive testing services for oil and gas gathering pipelines and oilfield infrastructure integrity management services; and pipeline engineering and integrity management services to pipeline operators. Further, it provides heat-shrinkable products, including tubings, sleeve and molded products, and heat-shrink accessories and equipment; and wires and cables for the control, instrumentation, thermocouple, power, marine, and robotics applications. The company was formerly known as Shaw Industries Ltd. and changed its name to Shawcor Ltd. in 2001. Shawcor Ltd. is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "SCL.TO": {"short_name": "SHAWCOR LTD", "long_name": "Shawcor Ltd.", "summary": "Shawcor Ltd., an energy services company, provides products and services for the infrastructure, energy, and transportation markets in North America, Latin America, Europe, the Middle East, Africa, Russia, and the Asia Pacific. The company operates through three segments: Pipeline and Pipe Services, Composite Systems, and Automotive and Industrial. The company offers pipe, insulation, and weight coating systems, as well as custom coating and field joint application services for onshore and offshore pipelines; manufactures and sells heat shrinkable sleeves, adhesives, and liquid coatings for pipeline joint protection applications; designs and assembles engineered pipe logistics products and services; and provides ultrasonic and radiographic pipeline girth weld inspection services for pipeline operators and construction contractors. It also offers spoolable and stick composite pipe systems; high density polyethylene pipes for use in oil and gas gathering, water disposal, carbon dioxide injection pipelines, and other applications; and reinforced plastic underground storage tanks for the retail fuel, water and wastewater, and oil and gas markets. In addition, the company offers tubular management services, including inventory management systems, mobile and in-plant inspection, and refurbishment and rethreading of drill pipe, production tubing and casing, and tubular products; non-destructive testing services for oil and gas gathering pipelines and oilfield infrastructure integrity management services; and pipeline engineering and integrity management services to pipeline operators. Further, it provides heat-shrinkable products, including tubings, sleeve and molded products, and heat-shrink accessories and equipment; and wires and cables for the control, instrumentation, thermocouple, power, marine, and robotics applications. The company was formerly known as Shaw Industries Ltd. and changed its name to Shawcor Ltd. in 2001. Shawcor Ltd. is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "SDI.V": {"short_name": "STAMPEDE DRILLING INC", "long_name": "Stampede Drilling Inc.", "summary": "Stampede Drilling Inc. provides drilling rig services for the oil and natural gas industry in North America. It operates 13 drilling rigs consisting of ten complementary heavy telescopic drilling rigs, one cantilever triple drilling rig, one light telescopic double rig, and one cantilever double drilling rig located in the provinces of Saskatchewan and Alberta. The company was formerly known as MATRRIX Energy Technologies Inc. and changed its name to Stampede Drilling Inc. in May 2019. Stampede Drilling Inc. was incorporated in 2011 and is headquartered in Calgary, Canada.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "SECYF": {"short_name": "SECURE ENERGY SERVICES INC", "long_name": "Secure Energy Services Inc.", "summary": "Secure Energy Services Inc., an energy services company, provides specialized solutions to upstream oil and natural gas companies operating primarily in Western Canadian Sedimentary Basin and the United States. The company's Midstream Infrastructure division provides services, such as clean oil terminalling, rail transloading, pipeline transportation, marketing and custom treating of crude oil, produced and waste water disposal, oilfield waste processing, and purchase/resale of oil services through its full service terminals, rail facilities, crude oil pipelines, crude oil terminalling facilities, water disposal facilities, and landfills. Its Environmental Solutions division offers pipeline integrity projects; demolition, decommissioning, reclamation, and remediation of former well sites, facilities, and commercial and industrial properties; environmental construction projects; onsite integrated fluid solutions for water management, recycling, pumping, and storage; naturally occurring radioactive material management; waste container services; and emergency response services. The company's Technical Solutions division provides product solutions for drilling, completion, and production operations for oil and gas producers; and design and implementation of drilling fluid systems for producers drilling for oil, bitumen, and natural gas. This division also offers equipment and chemical solutions for chemicals and enhanced oil recovery line. Secure Energy Services Inc. is headquartered in Calgary, Canada.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Calgary"}, "SFD.TO": {"short_name": "NXT ENERGY SOLUTIONS INC", "long_name": "NXT Energy Solutions Inc.", "summary": "NXT Energy Solutions Inc., a technology company, provides geophysical survey services to the upstream oil and gas industry through its proprietary gravity-based stress field detection (SFD) survey system worldwide. Its SFD remote-sensing survey system offers information on areas conducive to fluid entrapment in the sedimentary column. The company was formerly known as Energy Exploration Technologies Inc. and changed its name to NXT Energy Solutions Inc. in September 2008. NXT Energy Solutions Inc. was founded in 1994 and is headquartered in Calgary, Canada.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "SHLE.TO": {"short_name": "SOURCE ENERGY SERVICES LTD", "long_name": "Source Energy Services Ltd.", "summary": "Source Energy Services Ltd. produces, supplies, and distributes Northern White frac sand used primarily in oil and gas exploration and production in Western Canada and the United States. It also provides storage and logistics services for other bulk oil and gas well completion materials; and develops wellsite mobile sand storage and handling system. The company was founded in 2017 and is headquartered in Calgary, Canada.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "SNVVF": {"short_name": "STEP ENERGY SERVICES LTD", "long_name": "STEP Energy Services Ltd.", "summary": "STEP Energy Services Ltd., an oilfield service company, provides integrated coiled tubing, fracturing, and wireline solutions to service oil and natural gas wells in Canada and the United States. The company applies fit-for-purpose coiled tubing, pumping, and hydraulic fracturing technology to enhance reservoir performance in well completions and intervention projects. It also provides chemical laboratory solutions; fluid pumping services for coiled tubing operations and standalone projects; and nitrogen pumping solutions, as well as cased hole wireline and open hole wireline services. STEP Energy Services Ltd. was founded in 2011 and is headquartered in Calgary, Canada.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Calgary"}, "TCW.TO": {"short_name": "TRICAN WELL", "long_name": "Trican Well Service Ltd.", "summary": "Trican Well Service Ltd., an equipment services company, provides various specialized products, equipment, services, and technology for use in the drilling, completion, stimulation, and reworking of oil and gas wells primarily in Canada. The company offers cementing solutions, including pre-flushes and spacers, cement plugs, lost circulation, cement design solutions, and laboratory solutions, as well as surface, intermediate, production, liner, horizontal, and remedial/squeeze cementing services; and cement pumpers, bulk equipment, and cement auxiliary equipment. It also provides reservoir solutions, such as exploration, production analysis, and simulation and modeling services; coiled tubing solutions that include coiled tubing fracturing and acidizing, specially designed tools, in-house engineering, well cleanouts, milling, high pressure jetting, e-coil (smart coil), nitrogen gas lifting, and production enhancement, as well as equipment and tools; and acidizing and production enhancement services comprising production and injection well enhancement services, and equipment. In addition, the company offers pipeline services comprising nitrogen, commissioning, operating, and abandonment services; well intervention tools; fracturing solutions and equipment; and industrial services, such as chemical, mechanical, and bundle cleaning services. Trican Well Service Ltd. was founded in 1979 and is headquartered in Calgary, Canada.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "TEV.TO": {"short_name": "TERVITA CORPORATION", "long_name": "Tervita Corporation", "summary": "Tervita Corporation operates as a waste and environmentally focused energy service provider in Canada and the United States. It operates in two segments, Energy Services and Industrial Services. The Energy Services segment treats, recovers, and disposes fluids; provides oil terminalling and energy marketing services; processes and disposes solid materials; disposes oilfield-generated waste; offers onsite services using centrifugation or other processes for heavy oil producers involved in mining and in situ production; and supplies and operates drill site processing equipment, such as solids control and drill cuttings management. The Industrial Services segment provides site remediation, facility decommissioning, water treatment, sludge and slurry management, bio-remediation, emergency response, and rail, as well as hazardous and non-hazardous waste management, and disposal services; and technologies. This segment also offers recycling services that include purchase and processing of ferrous and non-ferrous metals recovered from demolition sites and other locations. As of December 31, 2019, the company operated 107 active waste processing, disposal, and industrial facilities, including 47 treatment, recovery, and disposal facilities; seven stand-alone disposal wells; three cavern disposal facilities; seven onsite facilities; 24 engineered landfills; four transfer stations; one naturally occurring radioactive material facility; nine bioremediation facilities; and five metals recycling facilities. It serves oil and gas industry, and industrial and natural resource sectors. The company was formerly known as CCS Corporation and changed its name to Tervita Corporation in March 2012. Tervita Corporation was founded in 1979 and is headquartered in Calgary, Canada.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "TOLWF": {"short_name": "TRICAN WELL SERVICE", "long_name": "Trican Well Service Ltd.", "summary": "Trican Well Service Ltd., an equipment services company, provides various specialized products, equipment, services, and technology for use in the drilling, completion, stimulation, and reworking of oil and gas wells primarily in Canada. The company offers cementing solutions, including pre-flushes and spacers, cement plugs, lost circulation, cement design solutions, and laboratory solutions, as well as surface, intermediate, production, liner, horizontal, and remedial/squeeze cementing services; and cement pumpers, bulk equipment, and cement auxiliary equipment. It also provides reservoir solutions, such as exploration, production analysis, and simulation and modeling services; coiled tubing solutions that include coiled tubing fracturing and acidizing, specially designed tools, in-house engineering, well cleanouts, milling, high pressure jetting, e-coil (smart coil), nitrogen gas lifting, and production enhancement, as well as equipment and tools; and acidizing and production enhancement services comprising production and injection well enhancement services, and equipment. In addition, the company offers pipeline services comprising nitrogen, commissioning, operating, and abandonment services; well intervention tools; fracturing solutions and equipment; and industrial services, such as chemical, mechanical, and bundle cleaning services. Trican Well Service Ltd. was founded in 1979 and is headquartered in Calgary, Canada.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Calgary"}, "TVK.TO": {"short_name": "TERRAVEST INDUSTRIES INC", "long_name": "TerraVest Industries Inc.", "summary": "TerraVest Industries Inc., together with its subsidiaries, manufactures and sells goods and services to energy, agriculture, mining, and transportation markets in Canada and the United States. It operates through three segments: Fuel Containment, Processing Equipment, and Service. The Fuel Containment segment manufactures bulk liquefied petroleum gas (LPG) transport trailers, LPG delivery and service trucks, LPG storage tanks, residential and commercial LPG tanks and dispensers, custom pressure vessels, commercial and residential refined fuel tanks, and furnaces and boilers. This segment sells its products directly, as well as through various distribution networks to fuel distributors, transportation companies, industrial and commercial consumers, and residential consumers. The Processing Equipment segment manufactures and sells a range of equipment, such as wellhead processing equipment and tanks, wellhead desanding units, central facilities processing equipment, natural gas liquids (NGL) and LPG storage tanks, anhydrous ammonia storage tanks, NGL and LPG transport trailers, ammonia transport trailers and wagons, compressed gas transport trailers, and various customized processing equipment. This segment offers its products to oil and gas producers, midstream and engineering companies, propane and fertilizer distributors, and transportation companies. The Service segment provides well servicing to the oil and gas sector in Southwest and Central Saskatchewan. This segment operates 21 service rigs. The company was formerly known as TerraVest Capital Inc. and changed its name to TerraVest Industries Inc. in February 2018. TerraVest Industries Inc. was founded in 2004 and is headquartered in Vegreville, Canada.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Vegreville"}, "TWZ.F": {"short_name": "TRICAN WELL SERVICE", "long_name": "Trican Well Service Ltd.", "summary": "Trican Well Service Ltd., an equipment services company, provides various specialized products, equipment, services, and technology for use in the drilling, completion, stimulation, and reworking of oil and gas wells primarily in Canada. The company offers cementing solutions, including pre-flushes and spacers, cement plugs, lost circulation, cement design solutions, and laboratory solutions, as well as surface, intermediate, production, liner, horizontal, and remedial/squeeze cementing services; and cement pumpers, bulk equipment, and cement auxiliary equipment. It also provides reservoir solutions, such as exploration, production analysis, and simulation and modeling services; coiled tubing solutions that include coiled tubing fracturing and acidizing, specially designed tools, in-house engineering, well cleanouts, milling, high pressure jetting, e-coil (smart coil), nitrogen gas lifting, and production enhancement, as well as equipment and tools; and acidizing and production enhancement services comprising production and injection well enhancement services, and equipment. In addition, the company offers pipeline services comprising nitrogen, commissioning, operating, and abandonment services; well intervention tools; fracturing solutions and equipment; and industrial services, such as chemical, mechanical, and bundle cleaning services. Trican Well Service Ltd. was founded in 1979 and is headquartered in Calgary, Canada.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Calgary"}, "TXLZF": {"short_name": "TESLA EXPLORATION LTD", "long_name": "Tesla Exploration Ltd.", "summary": "Tesla Exploration Ltd., a geophysical services company, provides specialized seismic services in North America, Europe, Africa, and internationally. The company offers three-component technologies that enable its clients to capture and process shear wave seismic data and pressure wave data for seismic imaging. It also provides various geophysical services, including survey design and management; project management/permits; seismic data acquisition; seismic data processing and reprocessing; seismic data interpretation; in-seam seismic data acquisition, processing, and interpretation; coal bed methane and gob gas assessments; borehole vertical seismic profiles; borehole geophysics processing and interpretation; and site investigation geophysics acquisition, processing, and interpretation. In addition, the company offers precision navigation and survey service support for marine construction; and data processing, interpretation, and analysis of geological and archaeological resources. It serves oil and gas exploration and production companies, marine construction contractors, and engineering firms, as well as the mining industry. The company is headquartered in Calgary, Canada.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Calgary"}, "UII.F": {"short_name": "HTC PURENERGY INC.", "long_name": "HTC Purenergy Inc.", "summary": "HTC Purenergy Inc., doing business as HTC Extraction Systems, develops, aggregates, and commercializes proprietary technologies relating to gas, liquid and biomass extraction, distillation, purification, and reclamation in Canada. It operates through two segments, HTC's Delta CleanTech Division and HTC's Hemp Division. The HTC's Delta CleanTech Division provides products and services related to clean energy industries. The HTC's Hemp Division engages in hemp-based activities, such as hemp extraction, refining, formulation, and distribution in the State of California. The company's products include Delta purification systems/ CO2 capture systems, Delta reclaimer systems, and hydrogen thermochem systems. The company was formerly known as HTC Hydrogen Technologies Corp. and changed its name to HTC Purenergy Inc. in February 2008. HTC Purenergy Inc. is headquartered in Regina, Canada.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Regina"}, "UTDE": {"short_name": "UNITED E&P INC", "long_name": "United E&P, Inc.", "summary": "Feinstein Report Inc. provides reporting services and is based in Kamloops, Canada.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Kamloops"}, "WEE.V": {"short_name": "WAVEFRONT TECHNOLOGY SOLUTIONS ", "long_name": "Wavefront Technology Solutions Inc.", "summary": "Wavefront Technology Solutions Inc. develops fluid injection technologies for oil and gas well stimulation, and improved/enhanced oil recovery in North America, the Middle East, and internationally. The company offers Powerwave process, an injection technology that improves the flow of fluids in geological materials, including sedimentary soils and fractured rock; and Primawave process, a method for aiding in-ground environmental remediation clean-up in contaminated sites. The company was formerly known as Wavefront Energy and Environmental Services Inc. and changed its name to Wavefront Technology Solutions Inc. in March 2009. Wavefront Technology Solutions is headquartered in Edmonton, Canada.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Edmonton"}, "WEII.V": {"short_name": "WOLVERINE ENERGY AND INFRASTRUC", "long_name": "Wolverine Energy and Infrastructure Inc.", "summary": "Wolverine Energy and Infrastructure Inc., through its subsidiaries, provides energy and infrastructure services to the oilfield and mining industries in Western Canada and the United States. The company is involved in the rental and sale of tubular and oilfield equipment, including combination units; recycle units, portable sewage containments, and gang washrooms; 400 barrel insulated tanks; boilers and heat exchangers; matting equipment; well site accommodations and portable office trailers; lease equipment; well servicing equipment; safe work platforms; flare stacks; flowline/manifolds; flare knock-out drums; line heaters; and pressurized storage equipment. It also engages in the heavy equipment sale and rental activities comprising the rental of articulated rock trucks, graders, dozers, scrapers, excavators, wheel loaders, fire guards, earth compactors, skid steers, access mats, and light towers; provision of trailer rental services; and provision of hauling service to the oil and gas industry, as well as trucking services for construction, agriculture, and residential sectors. In addition, the company undertakes earthworks contractor and excavating works, including water and sewer, site excavation, utilities service and maintenance, horizontal directional drilling, underground gas line installation, polyethylene fusion, and snow management projects; and offers seismic services, such as mulching, slashing, dozer, and QST services. Further, it offers water transfer, management, and heating services. The company was founded in 1952 and is headquartered in Nisku, Canada.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Nisku"}, "WFTSF": {"short_name": "WAVEFRONT TECHNOLOGY SOLUTIONS ", "long_name": "Wavefront Technology Solutions Inc.", "summary": "Wavefront Technology Solutions Inc. develops fluid injection technologies for oil and gas well stimulation, and improved/enhanced oil recovery in North America, the Middle East, and internationally. The company offers Powerwave process, an injection technology that improves the flow of fluids in geological materials, including sedimentary soils and fractured rock; and Primawave process, a method for aiding in-ground environmental remediation clean-up in contaminated sites. The company was formerly known as Wavefront Energy and Environmental Services Inc. and changed its name to Wavefront Technology Solutions Inc. in March 2009. Wavefront Technology Solutions is headquartered in Edmonton, Canada.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Edmonton"}}