{
  "4ZD.F": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Penneo ApS",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "PENNEO A/S  DK 0,02",
    "state": null,
    "summary": "Penneo ApS, a software-as-a-service company, provides an eco-system of automation solutions that digitizes companies' workflows of signing and managing documents. It digitizes, automates, and secures digital document handling workflows. The company serves customers in various industries, such as property management, finance, real estate, HR, and legal. Penneo ApS was founded in 2014 and is headquartered in Copenhagen, Denmark.",
    "website": "http://penneo.com",
    "zipcode": "1647"
  },
  "50O.F": {
    "city": "Farum",
    "country": "Denmark",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Shape Robotics A/S",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "SHAPE ROBOTICS A/S DK-,10",
    "state": null,
    "summary": "Shape Robotics A/S, an educational technology company, develops robot systems for education purpose worldwide. The company develops Fable, a robot system that offers educational robot kits for use in teaching programs, robotics, and innovations in middle and secondary schools, as well as in universities. It also offers Fable Connect, a telepresence robotics system that enables schools to get homebound students back in the classroom using the robot as a communication device. The company sells its products directly, as well as through distributors and resellers. Shape Robotics A/S was founded in 2011 and is based in Farum, Denmark.",
    "website": "http://www.shaperobotics.com",
    "zipcode": "3520"
  },
  "5IJ.F": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Conferize A/S",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "CONFERIZE A/S  DK -,1",
    "state": null,
    "summary": "Conferize A/S develops an online software solution for event and conference market. Its primary product is event management software, which enables event organizers to solve various digital tasks needed to host an event. The company serves event organizers and attendees. It operates in approximately 140 countries. The company was founded in 2011 and is based in Copenhagen, Denmark.",
    "website": "http://www.conferize.com",
    "zipcode": "1307"
  },
  "5NN.F": {
    "city": "Søborg",
    "country": "Denmark",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "NNIT A/S",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "NNIT A/S NAM.  DK 10",
    "state": null,
    "summary": "NNIT A/S provides a range of information technology (IT) services and solutions to customers primarily in the life sciences sector in Denmark and internationally. The company provides advisory services comprising IT organization optimization, outsourcing, organization change management, IT project excellence, mobility, digital transformation, and robotic process automation services. It also offers business solutions, which include life science solutions; enterprise resource planning (ERP) and ERP transformation services; portals and collaborations; enterprise content management, information management, and supply chain management solutions; and DevOps solutions. In addition, the company provides application outsourcing solutions, such as network and local delivery, ERP outsourcing, portals outsourcing and collaboration, and platform-as-a-service. Further, it offers infrastructure outsourcing services, including business critical hosting, network management, device management, security and compliance management, and middleware integration services; infrastructure-as-a-service; and service desk, application support, and onsite support services. Additionally, the company provides cybersecurity solutions comprising cybersecurity consulting, regulatory compliance, application security, cloud security, identity and access management, and managed security solutions; operates cyber defense center; and offers cybersecurity training services. The company serves public, enterprise, healthcare, and finance sectors. NNIT A/S was founded in 1994 and is headquartered in Soborg, Denmark.",
    "website": "http://www.nnit.com",
    "zipcode": "2860"
  },
  "60N.F": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Netcompany Group A/S",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "NETCOMPANY GROUP  DK1",
    "state": null,
    "summary": "Netcompany Group A/S, an IT services company, delivers business critical IT solutions to public and private sector customers in Denmark, Norway, the United Kingdom, the Netherlands, Poland, and Vietnam. It is involved in the development, maintenance, and operation of business critical IT solutions for various areas, such as digital Web and self-service solutions, application development, cognitive computing, e-commerce and product information management (PIM), ERP, CRM and marketing, application management, case and document management, operation and infrastructure, data and insight, application and mobile, and organizational implementation. The company serves customers in finance, government, manufacturing and engineering, municipality, organization, region, retail and trade, service, unemployment insurance fund and union, telecommunication and media, and energy and utility markets. Netcompany Group A/S was founded in 2000 and is headquartered in Copenhagen, Denmark.",
    "website": "http://www.netcompany.com",
    "zipcode": "1270"
  },
  "6VB.F": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Valuer Holding A/S",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "VALUER HOLDING A/S DK-,02",
    "state": null,
    "summary": "Valuer Holding A/S operates a platform for the management of workflows to corporations, accelerators, and venture funds worldwide. Its products include Innovation Themes, a solution to predict, evaluate, and prioritize innovation areas mission critical to the users' business through data-driven intelligence; and Innovation Radar, a solution that allows users to monitor the technology and business model landscapes relevant to their organization. The company also provides Diligence-as-a-Service, as well as strategy and scaling advisory services. It serves customers in the healthcare and biotechnology, cyber security, energy, mobility, industrial engineering, financial services, sustainability, and other industries. The company was founded in 2017 and is based in Copenhagen, Denmark.",
    "website": "http://www.valuer.ai",
    "zipcode": "2100"
  },
  "6VZ.MU": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "EUR",
    "exchange": "MUN",
    "industry": "Software - Application",
    "long_name": "Trustpilot Group plc",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "TRUSTPILOT GROUP LS -,01",
    "state": null,
    "summary": "Trustpilot Group plc operates a review platform for businesses and consumers in the United Kingdom, North America, and internationally. Its online review platform that enables consumers to make purchasing decisions, and businesses to showcase their service. The company was founded in 2007 and is headquartered in Copenhagen, Denmark.",
    "website": "http://www.trustpilot.com",
    "zipcode": "1112"
  },
  "7VL.F": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Realfiction Holding AB (publ)",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "REALFICTION HOLDING AB",
    "state": null,
    "summary": "Realfiction Holding AB (publ) manufactures and sells mixed reality solutions for retail, education, events, and brand activations worldwide. The company offers Dreamoc HD3, a platform for grabbing attention in commercial setting; DeepFrame, a mixed-reality display system; Dreamoc POP3, a display to create attention around a campaign or product launch; Dreamoc XL3; and Dreamoc XL4, a high-quality 3D holographic display that creates an eye-catching visual experience. It also provides Dreamoc XXL3, a mixed reality display and optimal solution for creating experiences in environments, such as malls, museums, and busy trade fairs; and Dreamoc Diamond, a display solutions for events and brand activations in shopping malls, trade fairs, and other traffic locations. The company was founded in 2008 and is based in Copenhagen, Denmark.",
    "website": "http://www.realfiction.com",
    "zipcode": "2100"
  },
  "8ND.F": {
    "city": "Nexø",
    "country": "Denmark",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "DecideAct A/S",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "DECIDEACT A/S  DK -,10",
    "state": null,
    "summary": "DecideAct A/S develops cloud-based strategy execution management and governance platform for organizations. Its solutions include DecideAct Professional, a digital solution for strategy implementation and follow-up; DecideAct Managed, a managed platform for strategy execution management and governance to drive engagement through transparency, automated follow-ups, and reporting; DecideAct Enterprise, a digital solution to integrate with ERP systems and other data sources defined by the organization; DecideAct Public Sector, which helps in the execution of government priorities within public institutions; a corporate social responsibility solution; a crisis recovery platform for enabling organizations to execute their recovery plan; and strategy expert services. The company's integrated strategy implementation platform delivers transparency, accountability, follow-up, and governance. DecideAct A/S was founded in 2014 and is headquartered in Nexø, Denmark.",
    "website": "http://www.decideact.net",
    "zipcode": "3730"
  },
  "8WX.F": {
    "city": "Herlev",
    "country": "Denmark",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Risma Systems A/S",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "RISMA SYSTEMS A/S DK -,10",
    "state": null,
    "summary": "Risma Systems A/S offers a software suite for governance, risk, and compliance (GRC) activities for private and public sectors in Denmark. The company offers GRC platform, a cloud-based Software-as-a-service solution which helps organizations to automate, report, and document controls across the organization through software. Its platform provides solutions for GRC, including privacy and general data protection regulation; information security management system; risk management; financial controls; and incident, policy, and vendor management sysyems. Risma Systems A/S was founded in 2014 and is headquartered in Herlev, Denmark.",
    "website": "http://www.rismasystems.com",
    "zipcode": "2730"
  },
  "8XT.F": {
    "city": "Karlslunde",
    "country": "Denmark",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Nexcom A/S",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "NEXCOM A/S  DK -,50",
    "state": null,
    "summary": "Nexcom A/S, a software as a service company, engages in the development of software solutions for the automation of customer services in Denmark. Its services include digital process optimization, digital workflow, and interaction artificial intelligence and machine learning. The company also offers digital workflow platforms; eTray, a digital workflow management software; and IT related consulting services. It serves companies, such as telephony, insurance, energy, and property management, which serves large number of customers. The company was founded in 1997 and is based in Karlslunde, Denmark.",
    "website": "http://www.nexcom.dk",
    "zipcode": "2690"
  },
  "9HY.F": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Hypefactors A/S",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "HYPEFACTOR A/S  DK -,1",
    "state": null,
    "summary": "Hypefactors A/S operates as a software company that provides a technology platform. The company operates an artificial intelligence-based PR automation platform to power the PR workflow and various facts to document the results. It serves enterprises, small and medium sized companies, and PR agencies. The company is based in Copenhagen, Denmark.",
    "website": "http://www.hypefactors.com",
    "zipcode": "1306"
  },
  "9R6.F": {
    "city": "Odense",
    "country": "Denmark",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Scape Technologies A/S",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "SCAPE TECHNOLOGIES  DK 1",
    "state": null,
    "summary": "Scape Technologies A/S, a robotics company, develops and sells bin-picking systems based on 3D computer vision. It provides SCAPE software for handling random, structured, and semi-structured components; SCAPE Picker tool for collection, controlling, and placing of subcomponents and parts; SCAPE Bin-Picking Manager, a software which handles recognition and picking of parts; SCAPE Communication Server, which enables communication of robot movements and status between SCAPE controller and robot controller; and SCAPE Calibration Manager, an application used for configuring all the units in a work cell. The company also offers SCAPE Part Training Studio, an application for training new parts based on a CAD files; software for structured and random parts; SCAPE Tool Units and Grippers; SCAPE 3D Scanner Recognition solutions; SCAPE Automatic Self Test and Cast Station for verifying the calibration of sensors and functionality of grippers; SCAPE 3D Orientation Control, which helps to handle parts for precision delivery for further processes; SCAPE Controller PC used to run with SCAPE software and hardware modules; and SCAPE Hardware Module solutions. In addition, it offers solutions for gripping and sorting packets and letters for distribution for logistic markets. Scape Technologies A/S was founded in 2004 and is headquartered in Odense, Denmark.",
    "website": "http://www.scapetechnologies.com",
    "zipcode": "5000"
  },
  "ACT.CO": {
    "city": "Nexø",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Software - Application",
    "long_name": "DecideAct A/S",
    "market": "dk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "DecideAct A/S",
    "state": null,
    "summary": "DecideAct A/S develops cloud-based strategy execution management and governance platform for organizations. Its solutions include DecideAct Professional, a digital solution for strategy implementation and follow-up; DecideAct Managed, a managed platform for strategy execution management and governance to drive engagement through transparency, automated follow-ups, and reporting; DecideAct Enterprise, a digital solution to integrate with ERP systems and other data sources defined by the organization; DecideAct Public Sector, which helps in the execution of government priorities within public institutions; a corporate social responsibility solution; a crisis recovery platform for enabling organizations to execute their recovery plan; and strategy expert services. The company's integrated strategy implementation platform delivers transparency, accountability, follow-up, and governance. DecideAct A/S was founded in 2014 and is headquartered in Nexø, Denmark.",
    "website": "http://www.decideact.net",
    "zipcode": "3730"
  },
  "AGILC.CO": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Software - Application",
    "long_name": "Agillic A/S",
    "market": "dk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Agillic A/S",
    "state": null,
    "summary": "Agillic A/S, a software company, provides marketing platform that enables clients to create and automate data-driven and personalized communication across channels in Denmark and internationally. It offers customer marketing platform that enables omnichannel marketing, which helps clients to communicate with message consistency across channels, such as email, SMS, app push notifications, and digital ads, as well as one-to-one personalization and transgressing the limitations of a segmented approach. The company also provides training and professional services related to on-boarding and setup of infrastructure, template design, and implementation, as well as training of new and existing clients. It serves retail, finance, travel and leisure, and NGO and charity industries, as well as subscription-based businesses. The company was incorporated in 1999 and is based in Copenhagen, Denmark.",
    "website": "http://agillic.com",
    "zipcode": "2100"
  },
  "ASTK.OL": {
    "city": "Aalborg",
    "country": "Denmark",
    "currency": "NOK",
    "exchange": "OSL",
    "industry": "Computer Hardware",
    "long_name": "Asetek A/S",
    "market": "no_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "ASETEK A/S",
    "state": null,
    "summary": "Asetek A/S, together with its subsidiaries, engages in the designing, developing, and marketing of liquid cooling solutions in Asia, Europe, and the Americas. The company operates in two segments, Gaming and Enthusiast; and Data Center. Its products are used in personal computers, servers, and data centers to provide enhanced performance, acoustics, and energy efficiency. The company serves original equipment manufacturers, resellers, and channel partners. Asetek A/S was founded in 1997 and is headquartered in Aalborg, Denmark.",
    "website": "http://asetek.com",
    "zipcode": "9220"
  },
  "BETCO.ST": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "SEK",
    "exchange": "STO",
    "industry": "Software - Application",
    "long_name": "Better Collective A/S",
    "market": "se_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "Better Collective A/S",
    "state": null,
    "summary": "Better Collective A/S, together with its subsidiaries, operates as a sports betting media company worldwide. It connects sports enthusiastic bettors with betting operators through various technologies and digital media products. The company primarily focuses on online sports betting and casino marketing platforms. It operates various community-based digital platforms, including bettingexpert.com and speltips.se; owns and operates esports platforms HLTV.org and Dust2.dk; and vegasinsider.com, a source for sports betting information. The company was founded in 2002 and is headquartered in Copenhagen, Denmark.",
    "website": "http://www.bettercollective.com",
    "zipcode": "1253"
  },
  "BGOUF": {
    "city": "Struer",
    "country": "Denmark",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Consumer Electronics",
    "long_name": "Bang & Olufsen a/s",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "BANG & OLUFSEN A/S",
    "state": null,
    "summary": "Bang & Olufsen a/s designs, develops, and markets audio and video products. The company offers portable, multi room, stereo, and architectural speakers; over-ear, on-ear, and other ear and head phones; televisions; and accessories. The company offers its products through approximately 485 Bang & Olufsen monobranded stores; and 3,316 multi-brand stores, as well as through third party retail stores and online. It has operations in Denmark, China, Germany, the United Kingdom, Ireland, the United States, Switzerland, South Korea, Hong Kong, France, Spain, and internationally. The company was founded in 1925 and is based in Struer, Denmark.",
    "website": "http://www.bang-olufsen.com",
    "zipcode": "7600"
  },
  "BO.CO": {
    "city": "Struer",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Consumer Electronics",
    "long_name": "Bang & Olufsen a/s",
    "market": "dk_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "Bang & Olufsen A/S",
    "state": null,
    "summary": "Bang & Olufsen a/s designs, develops, and markets audio and video products. The company offers portable, multi room, stereo, and architectural speakers; over-ear, on-ear, and other ear and head phones; televisions; and accessories. The company offers its products through approximately 485 Bang & Olufsen monobranded stores; and 3,316 multi-brand stores, as well as through third party retail stores and online. It has operations in Denmark, China, Germany, the United Kingdom, Ireland, the United States, Switzerland, South Korea, Hong Kong, France, Spain, and internationally. The company was founded in 1925 and is based in Struer, Denmark.",
    "website": "http://www.bang-olufsen.com",
    "zipcode": "7600"
  },
  "BOLIGA.CO": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Software - Infrastructure",
    "long_name": "Boliga Gruppen A/S",
    "market": "dk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Boliga Gruppen A/S",
    "state": null,
    "summary": "Boliga Gruppen A/S operates as an online media house company that focuses on the housing market in Denmark. The company owns and operates housing-related portals, including Boliga.dk, which provides housing-related services to buyers and sellers; UdenomBanken, an intermediary of alternative home loans outside the banks; DinGeo.dk, a reference work with geodata for home seekers; Selvsalg.dk, a portal for homeowners to sell their home themselves; and itvang.dk and Tvangsauktioner.dk portals to get an overview of properties at an auction for users. It also provides housing condition reports; preparation deeds on a digital platform for buyers and sellers; and Boliga Byg Hus, a single entrance solution for home seekers looking for a new house. The company was formerly known as EuroInvestor.com A/S. Boliga Gruppen A/S was founded in 1997 and is based in Copenhagen, Denmark.",
    "website": "http://boligagruppen.dk",
    "zipcode": "2100"
  },
  "BUOB.F": {
    "city": "Struer",
    "country": "Denmark",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Consumer Electronics",
    "long_name": "Bang & Olufsen a/s",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "BANG+OLUFSEN NAM.  DK 5",
    "state": null,
    "summary": "Bang & Olufsen a/s designs, develops, and markets audio and video products. The company offers portable, multi room, stereo, and architectural speakers; over-ear, on-ear, and other ear and head phones; televisions; and accessories. The company offers its products through approximately 485 Bang & Olufsen monobranded stores; and 3,316 multi-brand stores, as well as through third party retail stores and online. It has operations in Denmark, China, Germany, the United Kingdom, Ireland, the United States, Switzerland, South Korea, Hong Kong, France, Spain, and internationally. The company was founded in 1925 and is based in Struer, Denmark.",
    "website": "http://www.bang-olufsen.com",
    "zipcode": "7600"
  },
  "CBRAIN.CO": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Software - Application",
    "long_name": "cBrain A/S",
    "market": "dk_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "cBrain A/S",
    "state": null,
    "summary": "cBrain A/S, a software company, develops software for government, unions, and private knowledge firms in Denmark. It provides cBrain F2, a software tool that digitizes various workflows, knowledge processing, records management, and communication, including social media, as well as supports PCs and mobiles/tablets. The company was founded in 2002 and is based in Copenhagen, Denmark.",
    "website": "http://www.cbrain.com",
    "zipcode": "2100"
  },
  "CHEMM.CO": {
    "city": "Allerod",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Scientific & Technical Instruments",
    "long_name": "ChemoMetec A/S",
    "market": "dk_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "ChemoMetec A/S",
    "state": null,
    "summary": "ChemoMetec A/S designs, develops, and produces instruments for a range of applications in cell counting and evaluation in Denmark and internationally. The company offers automated cell counters and viability analyzers, such as NucleoCounter NC-3000, an advanced image cytometer to characterize cell properties; NucleoCounter NC-250, an automated cell analyzer to characterize cell properties; NucleoCounter NC-200, an automated cell counter that provides solution for cell counting and cell viability determinations; NucleoCounter NC-100, a mammalian cell counter; NucleoCounter SP-100, a sperm cell counter that offers total sperm concentration and sperm viability in a semen sample from ejaculates or extended doses; NucleoCounter YC-100, a yeast cell counter used to measure the total cell count and viability of yeast cells in suspension; NucleoCounter SCC-100, a somatic cell counter for measuring the amount of somatic cells in a milk sample; and NucleoCounter SCC-400, a somatic cell counter for determining the number of somatic cells in a milk sample. It also provides Xcyto, a quantitative cell imager to analyze adherent and suspension cells; NucleoView, a software that is the user interface for the NucleoCounter NC-200, NC-250, and NC-3000 instruments, which automatically handles data acquisition, image analysis, and data presentation; consumables, which include cassettes, reagents, slides, and test kits; and accessories comprising cables, power supplies, software, and other products. The company offers its solutions for cell therapeutic, stem cell research, cancer cell research, bioprocessing, toxicology, cell biology research, sperm cell counting, yeast cell counting, and somatic cell counting applications. ChemoMetec A/S was founded in 1997 and is headquartered in Allerod, Denmark.",
    "website": "http://www.chemometec.com",
    "zipcode": "3450"
  },
  "CHY.F": {
    "city": "Allerod",
    "country": "Denmark",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Scientific & Technical Instruments",
    "long_name": "ChemoMetec A/S",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "CHEMOMETEC AS  DK 1",
    "state": null,
    "summary": "ChemoMetec A/S designs, develops, and produces instruments for a range of applications in cell counting and evaluation in Denmark and internationally. The company offers automated cell counters and viability analyzers, such as NucleoCounter NC-3000, an advanced image cytometer to characterize cell properties; NucleoCounter NC-250, an automated cell analyzer to characterize cell properties; NucleoCounter NC-200, an automated cell counter that provides solution for cell counting and cell viability determinations; NucleoCounter NC-100, a mammalian cell counter; NucleoCounter SP-100, a sperm cell counter that offers total sperm concentration and sperm viability in a semen sample from ejaculates or extended doses; NucleoCounter YC-100, a yeast cell counter used to measure the total cell count and viability of yeast cells in suspension; NucleoCounter SCC-100, a somatic cell counter for measuring the amount of somatic cells in a milk sample; and NucleoCounter SCC-400, a somatic cell counter for determining the number of somatic cells in a milk sample. It also provides Xcyto, a quantitative cell imager to analyze adherent and suspension cells; NucleoView, a software that is the user interface for the NucleoCounter NC-200, NC-250, and NC-3000 instruments, which automatically handles data acquisition, image analysis, and data presentation; consumables, which include cassettes, reagents, slides, and test kits; and accessories comprising cables, power supplies, software, and other products. The company offers its solutions for cell therapeutic, stem cell research, cancer cell research, bioprocessing, toxicology, cell biology research, sperm cell counting, yeast cell counting, and somatic cell counting applications. ChemoMetec A/S was founded in 1997 and is headquartered in Allerod, Denmark.",
    "website": "http://www.chemometec.com",
    "zipcode": "3450"
  },
  "COLUM.CO": {
    "city": "Ballerup",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Information Technology Services",
    "long_name": "Columbus A/S",
    "market": "dk_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "Columbus A/S",
    "state": null,
    "summary": "Columbus A/S, an IT services and consulting company, offers digital solutions for the manufacturing, food, and retail and distribution industries in Eastern and Western Europe, and North America. It provides application management, business and application integration, cloud ERP, cloud and infrastructure services, compliance and business continuity, data and analytics, and digital commerce solutions; customer relationship management, field service automation, and in-store experience services; and strategy and change solutions. The company also offers various solutions for beverage and process; rental, lease, and equipment; and fashion industries. Columbus A/S was founded in 1989 and is headquartered in Ballerup, Denmark.",
    "website": "http://www.columbusglobal.com",
    "zipcode": "2750"
  },
  "CONFRZ.CO": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Software - Application",
    "long_name": "Conferize A/S",
    "market": "dk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Conferize A/S",
    "state": null,
    "summary": "Conferize A/S develops an online software solution for event and conference market. Its primary product is event management software, which enables event organizers to solve various digital tasks needed to host an event. The company serves event organizers and attendees. It operates in approximately 140 countries. The company was founded in 2011 and is based in Copenhagen, Denmark.",
    "website": "http://www.conferize.com",
    "zipcode": "1307"
  },
  "D9D.F": {
    "city": "Nibe",
    "country": "Denmark",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Dataproces Group A/S",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "DATAPROCES GROUP DK -,02",
    "state": null,
    "summary": "Dataproces Group A/S, an interdisciplinary knowledge company, specializes in IT and consulting services for municipalities and their digital administration. The company offers automation and RPA, revenue optimization, and knowledge and competency solutions. It serves municipalities in the areas of citizen service, social, and employment; children and teenagers; IT and digitization; technology and the environment; and economy and administration. The company was incorporated in 2012 and is based in Nibe, Denmark.",
    "website": "http://www.dataproces.dk",
    "zipcode": "9240"
  },
  "DANT.CO": {
    "city": "Pandrup",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Consumer Electronics",
    "long_name": "Dantax A/S",
    "market": "dk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Dantax A/S",
    "state": null,
    "summary": "Dantax A/S designs, develops, produces, and sells audio products under the Scansonic, Raidho, and Harmony brands. The company was founded in 1969 and is based in Pandrup, Denmark.",
    "website": "http://dantaxradio.dk",
    "zipcode": "9490"
  },
  "DATA.CO": {
    "city": "Nibe",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Information Technology Services",
    "long_name": "Dataproces Group A/S",
    "market": "dk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Dataproces Group A/S",
    "state": null,
    "summary": "Dataproces Group A/S, an interdisciplinary knowledge company, specializes in IT and consulting services for municipalities and their digital administration. The company offers automation and RPA, revenue optimization, and knowledge and competency solutions. It serves municipalities in the areas of citizen service, social, and employment; children and teenagers; IT and digitization; technology and the environment; and economy and administration. The company was incorporated in 2012 and is based in Nibe, Denmark.",
    "website": "http://www.dataproces.dk",
    "zipcode": "9240"
  },
  "ENALYZ.CO": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Software - Application",
    "long_name": "Enalyzer A/S",
    "market": "dk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Enalyzer A/S",
    "state": null,
    "summary": "Enalyzer A/S provides solutions for the measurement and analysis of employee satisfaction, and customer and citizen views on various topics worldwide. The company offers Enalyzer, a software product for running surveys. It also provides consulting, training, and support services. The company was incorporated in 2000 and is based in Copenhagen, Denmark.",
    "website": "http://www.enalyzer.com",
    "zipcode": "1432"
  },
  "FASTPC.CO": {
    "city": "Gladsaxe",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Software - Application",
    "long_name": "FastPassCorp A/S",
    "market": "dk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "FastPassCorp A/S",
    "state": null,
    "summary": "FastPassCorp A/S provides enterprise password management solutions for enterprises and managed service providers in Denmark. It offers Fastpass Enterprise Password Manager for password self-service and compliance for corporations; Facilitated Password Reset for the service desk process; Fastpass Cloud Password Manager, a Web based password manager for medium and large companies who want to improve productivity and security related to password self-service processes; MSP password management self-service; and password synchronization solutions. The company was founded in 2000 and is based in Gladsaxe, Denmark.",
    "website": "http://www.fastpasscorp.com",
    "zipcode": "2860"
  },
  "HYPE.CO": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Software - Application",
    "long_name": "Hypefactors A/S",
    "market": "dk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Hypefactors A/S",
    "state": null,
    "summary": "Hypefactors A/S operates as a software company that provides a technology platform. The company operates an artificial intelligence-based PR automation platform to power the PR workflow and various facts to document the results. It serves enterprises, small and medium sized companies, and PR agencies. The company is based in Copenhagen, Denmark.",
    "website": "http://www.hypefactors.com",
    "zipcode": "1306"
  },
  "IMPERO.CO": {
    "city": "Åbyhøj",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Software - Application",
    "long_name": "Impero A/S",
    "market": "dk_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "Impero A/S",
    "state": null,
    "summary": "Impero A/S provides compliance management platform. Its platform is distributed as Software-as-a-Service that enables companies to easily manage compliance through automation of risk and control management, documentation, and reporting. The company was incorporated in 2013 and is based in Åbyhøj, Denmark.",
    "website": "http://impero.com",
    "zipcode": "8230"
  },
  "KONSOL.CO": {
    "city": "Søborg",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Software - Application",
    "long_name": "Konsolidator A/S",
    "market": "dk_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "Konsolidator A/S",
    "state": null,
    "summary": "Konsolidator A/S develops and sells cloud based solutions. The company offers Konsolidator, a cloud-based financial consolidation software solutions. It also provides consultancy services. Konsolidator A/S was founded in 2016 and is based in Søborg, Denmark.",
    "website": "http://www.konsolidator.com",
    "zipcode": "2860"
  },
  "NANN": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Software - Application",
    "long_name": "Nanovation Microtech, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "NANOVATION MICROTECH INC",
    "state": null,
    "summary": "Nanovation Microtech, Inc. develops and sells applications and games for iPhone, iPad, and Apple watches. The company was formerly known as Kalmin Corp. and changed its name to Nanovation Microtech, Inc. in July 2020. The company was founded in 2016 and is based in Copenhagen, Denmark. Nanovation Microtech, Inc. is a subsidiary of Greenfield International Limited.",
    "website": null,
    "zipcode": "2100"
  },
  "NAPA.OL": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "NOK",
    "exchange": "OSL",
    "industry": "Communication Equipment",
    "long_name": "Napatech A/S",
    "market": "no_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "NAPATECH A/S",
    "state": null,
    "summary": "Napatech A/S provides reconfigurable computing solutions for network performance and cybersecurity applications worldwide. It provides Link Capture Software that enables packet capture with nanosecond timestamping and replay with precise inter-frame gap control; Link Virtualization Software that offloads and accelerates the Open vSwitch (OVS) dataplane to enhance CPU efficiency, scalability and network performance; and Link Programmable, which enables end users and OEMs to deploy FPGA IP on SmartNIC platform. The company also offers FPGA SmartNICs that captures data from networks enabling real-time insight into network traffic; and FPGA Cloud Crypto, a cryptography engine that provides technology demonstration and playground for users to learn, experiment, and adapt use cases for FPGA-based crypto offload. It also provides solutions for telecom operators, cloud and data center service providers, and infrastructure and defense, as well as cyber security, financial services, and network management industries. The company was founded in 2003 and is headquartered in Copenhagen, Denmark.",
    "website": "http://www.napatech.com",
    "zipcode": "2860"
  },
  "NAT.F": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Communication Equipment",
    "long_name": "Napatech A/S",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "NAPATECH A/S NAM. DK 0,25",
    "state": null,
    "summary": "Napatech A/S provides reconfigurable computing solutions for network performance and cybersecurity applications worldwide. It provides Link Capture Software that enables packet capture with nanosecond timestamping and replay with precise inter-frame gap control; Link Virtualization Software that offloads and accelerates the Open vSwitch (OVS) dataplane to enhance CPU efficiency, scalability and network performance; and Link Programmable, which enables end users and OEMs to deploy FPGA IP on SmartNIC platform. The company also offers FPGA SmartNICs that captures data from networks enabling real-time insight into network traffic; and FPGA Cloud Crypto, a cryptography engine that provides technology demonstration and playground for users to learn, experiment, and adapt use cases for FPGA-based crypto offload. It also provides solutions for telecom operators, cloud and data center service providers, and infrastructure and defense, as well as cyber security, financial services, and network management industries. The company was founded in 2003 and is headquartered in Copenhagen, Denmark.",
    "website": "http://www.napatech.com",
    "zipcode": "2860"
  },
  "NETC.CO": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Information Technology Services",
    "long_name": "Netcompany Group A/S",
    "market": "dk_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "Netcompany Group A/S",
    "state": null,
    "summary": "Netcompany Group A/S, an IT services company, delivers business critical IT solutions to public and private sector customers in Denmark, Norway, the United Kingdom, the Netherlands, Poland, and Vietnam. It is involved in the development, maintenance, and operation of business critical IT solutions for various areas, such as digital Web and self-service solutions, application development, cognitive computing, e-commerce and product information management (PIM), ERP, CRM and marketing, application management, case and document management, operation and infrastructure, data and insight, application and mobile, and organizational implementation. The company serves customers in finance, government, manufacturing and engineering, municipality, organization, region, retail and trade, service, unemployment insurance fund and union, telecommunication and media, and energy and utility markets. Netcompany Group A/S was founded in 2000 and is headquartered in Copenhagen, Denmark.",
    "website": "http://www.netcompany.com",
    "zipcode": "1270"
  },
  "NEXCOM.CO": {
    "city": "Karlslunde",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Software - Application",
    "long_name": "Nexcom A/S",
    "market": "dk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Nexcom A/S",
    "state": null,
    "summary": "Nexcom A/S, a software as a service company, engages in the development of software solutions for the automation of customer services in Denmark. Its services include digital process optimization, digital workflow, and interaction artificial intelligence and machine learning. The company also offers digital workflow platforms; eTray, a digital workflow management software; and IT related consulting services. It serves companies, such as telephony, insurance, energy, and property management, which serves large number of customers. The company was founded in 1997 and is based in Karlslunde, Denmark.",
    "website": "http://www.nexcom.dk",
    "zipcode": "2690"
  },
  "NNIT.CO": {
    "city": "Søborg",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Information Technology Services",
    "long_name": "NNIT A/S",
    "market": "dk_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "NNIT A/S",
    "state": null,
    "summary": "NNIT A/S provides a range of information technology (IT) services and solutions to customers primarily in the life sciences sector in Denmark and internationally. The company provides advisory services comprising IT organization optimization, outsourcing, organization change management, IT project excellence, mobility, digital transformation, and robotic process automation services. It also offers business solutions, which include life science solutions; enterprise resource planning (ERP) and ERP transformation services; portals and collaborations; enterprise content management, information management, and supply chain management solutions; and DevOps solutions. In addition, the company provides application outsourcing solutions, such as network and local delivery, ERP outsourcing, portals outsourcing and collaboration, and platform-as-a-service. Further, it offers infrastructure outsourcing services, including business critical hosting, network management, device management, security and compliance management, and middleware integration services; infrastructure-as-a-service; and service desk, application support, and onsite support services. Additionally, the company provides cybersecurity solutions comprising cybersecurity consulting, regulatory compliance, application security, cloud security, identity and access management, and managed security solutions; operates cyber defense center; and offers cybersecurity training services. The company serves public, enterprise, healthcare, and finance sectors. NNIT A/S was founded in 1994 and is headquartered in Soborg, Denmark.",
    "website": "http://www.nnit.com",
    "zipcode": "2860"
  },
  "P1F.F": {
    "city": "Ballerup",
    "country": "Denmark",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Columbus A/S",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "COLUMBUS A/S NAM. DK 1,25",
    "state": null,
    "summary": "Columbus A/S, an IT services and consulting company, offers digital solutions for the manufacturing, food, and retail and distribution industries in Eastern and Western Europe, and North America. It provides application management, business and application integration, cloud ERP, cloud and infrastructure services, compliance and business continuity, data and analytics, and digital commerce solutions; customer relationship management, field service automation, and in-store experience services; and strategy and change solutions. The company also offers various solutions for beverage and process; rental, lease, and equipment; and fashion industries. Columbus A/S was founded in 1989 and is headquartered in Ballerup, Denmark.",
    "website": "http://www.columbusglobal.com",
    "zipcode": "2750"
  },
  "PENNEO.CO": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Software - Application",
    "long_name": "Penneo ApS",
    "market": "dk_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "Penneo A/S",
    "state": null,
    "summary": "Penneo ApS, a software-as-a-service company, provides an eco-system of automation solutions that digitizes companies' workflows of signing and managing documents. It digitizes, automates, and secures digital document handling workflows. The company serves customers in various industries, such as property management, finance, real estate, HR, and legal. Penneo ApS was founded in 2014 and is headquartered in Copenhagen, Denmark.",
    "website": "http://penneo.com",
    "zipcode": "1647"
  },
  "REALFI.ST": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "SEK",
    "exchange": "STO",
    "industry": "Software - Application",
    "long_name": "Realfiction Holding AB (publ)",
    "market": "se_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Realfiction Holding AB",
    "state": null,
    "summary": "Realfiction Holding AB (publ) manufactures and sells mixed reality solutions for retail, education, events, and brand activations worldwide. The company offers Dreamoc HD3, a platform for grabbing attention in commercial setting; DeepFrame, a mixed-reality display system; Dreamoc POP3, a display to create attention around a campaign or product launch; Dreamoc XL3; and Dreamoc XL4, a high-quality 3D holographic display that creates an eye-catching visual experience. It also provides Dreamoc XXL3, a mixed reality display and optimal solution for creating experiences in environments, such as malls, museums, and busy trade fairs; and Dreamoc Diamond, a display solutions for events and brand activations in shopping malls, trade fairs, and other traffic locations. The company was founded in 2008 and is based in Copenhagen, Denmark.",
    "website": "http://www.realfiction.com",
    "zipcode": "2100"
  },
  "RISMA.CO": {
    "city": "Herlev",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Software - Application",
    "long_name": "Risma Systems A/S",
    "market": "dk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "RISMA Systems A/S",
    "state": null,
    "summary": "Risma Systems A/S offers a software suite for governance, risk, and compliance (GRC) activities for private and public sectors in Denmark. The company offers GRC platform, a cloud-based Software-as-a-service solution which helps organizations to automate, report, and document controls across the organization through software. Its platform provides solutions for GRC, including privacy and general data protection regulation; information security management system; risk management; financial controls; and incident, policy, and vendor management sysyems. Risma Systems A/S was founded in 2014 and is headquartered in Herlev, Denmark.",
    "website": "http://www.rismasystems.com",
    "zipcode": "2730"
  },
  "RTE.F": {
    "city": "Nørresundby",
    "country": "Denmark",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Communication Equipment",
    "long_name": "RTX A/S",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "RTX A/S  NAM DK 5",
    "state": null,
    "summary": "RTX A/S designs and develops advanced wireless short-range radio systems and products in Denmark and internationally. It operates in two segments, Design Services and Business Communications. The company designs, develops, and manufactures wireless IP telephony products and sub-systems, including headsets, handsets, base stations, repeaters for PBX systems and VoIP solutions, location beacons, and advanced cloud-based deployment, monitoring, tracking and administration tools for professional use; microphones, instruments, mixers, speakers etc., as well as professional audio applications, such as monitoring systems, conference systems, and content creation solutions for journalists/vloggers/streamers; intercom systems; and wireless transmission solution for use in wireless gaming headsets, controllers, mice, and keyboards etc. It also offers wireless modules and products for continuous patient monitoring in hospitals; and design and development support services, as well as actual modules, sub-components, and end products on an ODM basis for the wireless solutions. In addition, the company also provides Sheersound audio codec for wireless transfer of live audio signals; and Sheerlink product solutions for wireless music transmission. RTX A/S was founded in 1993 and is headquartered in Nørresundby, Denmark.",
    "website": "http://www.rtx.dk",
    "zipcode": "9400"
  },
  "RTX.CO": {
    "city": "Nørresundby",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Communication Equipment",
    "long_name": "RTX A/S",
    "market": "dk_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "RTX A/S",
    "state": null,
    "summary": "RTX A/S designs and develops advanced wireless short-range radio systems and products in Denmark and internationally. It operates in two segments, Design Services and Business Communications. The company designs, develops, and manufactures wireless IP telephony products and sub-systems, including headsets, handsets, base stations, repeaters for PBX systems and VoIP solutions, location beacons, and advanced cloud-based deployment, monitoring, tracking and administration tools for professional use; microphones, instruments, mixers, speakers etc., as well as professional audio applications, such as monitoring systems, conference systems, and content creation solutions for journalists/vloggers/streamers; intercom systems; and wireless transmission solution for use in wireless gaming headsets, controllers, mice, and keyboards etc. It also offers wireless modules and products for continuous patient monitoring in hospitals; and design and development support services, as well as actual modules, sub-components, and end products on an ODM basis for the wireless solutions. In addition, the company also provides Sheersound audio codec for wireless transfer of live audio signals; and Sheerlink product solutions for wireless music transmission. RTX A/S was founded in 1993 and is headquartered in Nørresundby, Denmark.",
    "website": "http://www.rtx.dk",
    "zipcode": "9400"
  },
  "SCAPE.CO": {
    "city": "Odense",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Software - Application",
    "long_name": "Scape Technologies A/S",
    "market": "dk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Scape Technologies A/S",
    "state": null,
    "summary": "Scape Technologies A/S, a robotics company, develops and sells bin-picking systems based on 3D computer vision. It provides SCAPE software for handling random, structured, and semi-structured components; SCAPE Picker tool for collection, controlling, and placing of subcomponents and parts; SCAPE Bin-Picking Manager, a software which handles recognition and picking of parts; SCAPE Communication Server, which enables communication of robot movements and status between SCAPE controller and robot controller; and SCAPE Calibration Manager, an application used for configuring all the units in a work cell. The company also offers SCAPE Part Training Studio, an application for training new parts based on a CAD files; software for structured and random parts; SCAPE Tool Units and Grippers; SCAPE 3D Scanner Recognition solutions; SCAPE Automatic Self Test and Cast Station for verifying the calibration of sensors and functionality of grippers; SCAPE 3D Orientation Control, which helps to handle parts for precision delivery for further processes; SCAPE Controller PC used to run with SCAPE software and hardware modules; and SCAPE Hardware Module solutions. In addition, it offers solutions for gripping and sorting packets and letters for distribution for logistic markets. Scape Technologies A/S was founded in 2004 and is headquartered in Odense, Denmark.",
    "website": "http://www.scapetechnologies.com",
    "zipcode": "5000"
  },
  "SHAPE.CO": {
    "city": "Farum",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Software - Application",
    "long_name": "Shape Robotics A/S",
    "market": "dk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Shape Robotics A/S",
    "state": null,
    "summary": "Shape Robotics A/S, an educational technology company, develops robot systems for education purpose worldwide. The company develops Fable, a robot system that offers educational robot kits for use in teaching programs, robotics, and innovations in middle and secondary schools, as well as in universities. It also offers Fable Connect, a telepresence robotics system that enables schools to get homebound students back in the classroom using the robot as a communication device. The company sells its products directly, as well as through distributors and resellers. Shape Robotics A/S was founded in 2011 and is based in Farum, Denmark.",
    "website": "http://www.shaperobotics.com",
    "zipcode": "3520"
  },
  "SIM.CO": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Software - Application",
    "long_name": "SimCorp A/S",
    "market": "dk_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "SimCorp A/S",
    "state": null,
    "summary": "SimCorp A/S, together with its subsidiaries, provides investment management solutions for asset management, fund management, insurance, life/pension, central banks, asset servicing, treasury, sovereign wealth, and wealth management companies. It provides SimCorp Dimension, an integrated system, which provides multi-asset class support across the investment value chain; SimCorp Sofia, a front-to-back investment management solution for the Italian insurance market; SimCorp Gain, an enterprise data management solution for reference and market data management; and SimCorp Coric, a solution for client communications and reporting automation. The company offers front office solutions, including alternative investment, asset, order, and compliance manager; middle office solutions, such as performance, risk mitigation, and strategy manager; and back office solutions comprising cash and securities, collateral, corporate actions, fund administration, general ledger, investment accounting, and settlement manager.  It also provides data and reporting solutions that include client communications, data warehouse, reconciliation, and enterprise data manager. In addition, the company offers regulatory compliance, managed business and data, managed application, operational, training, infrastructure and platform, value acceleration, and delivery services. The company has operations in North America, EMEA, and APAC countries. SimCorp A/S was founded in 1971 and is headquartered in Copenhagen, Denmark.",
    "website": "http://www.simcorp.com",
    "zipcode": "2300"
  },
  "SLXIT.CO": {
    "city": "Aalborg",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Electronics & Computer Distribution",
    "long_name": "Seluxit A/S",
    "market": "dk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Seluxit A/S",
    "state": null,
    "summary": "Seluxit A/S provides Internet of Things solutions. It offers hardware and software, including embedded systems; Seluxit IoT platform; Wappsto, an App marketplace; and Wappsto apps that digitize products to provide Smart Home, Smart Meters, and Smart Machines solutions. The company was founded in 2006 and is based in Aalborg, Denmark.",
    "website": "http://www.seluxit.com",
    "zipcode": "9200"
  },
  "TRST.L": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Trustpilot Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "TRUSTPILOT GROUP PLC ORD GBP0.0",
    "state": null,
    "summary": "Trustpilot Group plc operates a review platform for businesses and consumers in the United Kingdom, North America, and internationally. Its online review platform that enables consumers to make purchasing decisions, and businesses to showcase their service. The company was founded in 2007 and is headquartered in Copenhagen, Denmark.",
    "website": "http://www.trustpilot.com",
    "zipcode": "1112"
  },
  "VALUER.CO": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Software - Application",
    "long_name": "Valuer Holding A/S",
    "market": "dk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Valuer Holding A/S",
    "state": null,
    "summary": "Valuer Holding A/S operates a platform for the management of workflows to corporations, accelerators, and venture funds worldwide. Its products include Innovation Themes, a solution to predict, evaluate, and prioritize innovation areas mission critical to the users' business through data-driven intelligence; and Innovation Radar, a solution that allows users to monitor the technology and business model landscapes relevant to their organization. The company also provides Diligence-as-a-Service, as well as strategy and scaling advisory services. It serves customers in the healthcare and biotechnology, cyber security, energy, mobility, industrial engineering, financial services, sustainability, and other industries. The company was founded in 2017 and is based in Copenhagen, Denmark.",
    "website": "http://www.valuer.ai",
    "zipcode": "2100"
  },
  "WIRTEK.CO": {
    "city": "Aalborg",
    "country": "Denmark",
    "currency": "DKK",
    "exchange": "CPH",
    "industry": "Information Technology Services",
    "long_name": "WirTek A/S",
    "market": "dk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "WirTek A/S",
    "state": null,
    "summary": "WirTek A/S, an IT outsourcing company, provides software solutions and electronic equipment products in Denmark. The company offers software engineering services, such as product engineering, system architecture and design, software development, quality assurance, and product re-engineering services; and electronic equipment services that builds, tests, and integrates embedded systems and devices. WirTek A/S was incorporated in 2001 and is headquartered in Aalborg, Denmark.",
    "website": "http://www.wirtek.com",
    "zipcode": "9220"
  },
  "XCL1.F": {
    "city": "Copenhagen",
    "country": "Denmark",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "SimCorp A/S",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "SIMCORP A/S  NAM.  DK 1",
    "state": null,
    "summary": "SimCorp A/S, together with its subsidiaries, provides investment management solutions for asset management, fund management, insurance, life/pension, central banks, asset servicing, treasury, sovereign wealth, and wealth management companies. It provides SimCorp Dimension, an integrated system, which provides multi-asset class support across the investment value chain; SimCorp Sofia, a front-to-back investment management solution for the Italian insurance market; SimCorp Gain, an enterprise data management solution for reference and market data management; and SimCorp Coric, a solution for client communications and reporting automation. The company offers front office solutions, including alternative investment, asset, order, and compliance manager; middle office solutions, such as performance, risk mitigation, and strategy manager; and back office solutions comprising cash and securities, collateral, corporate actions, fund administration, general ledger, investment accounting, and settlement manager.  It also provides data and reporting solutions that include client communications, data warehouse, reconciliation, and enterprise data manager. In addition, the company offers regulatory compliance, managed business and data, managed application, operational, training, infrastructure and platform, value acceleration, and delivery services. The company has operations in North America, EMEA, and APAC countries. SimCorp A/S was founded in 1971 and is headquartered in Copenhagen, Denmark.",
    "website": "http://www.simcorp.com",
    "zipcode": "2300"
  },
  "ZVR.F": {
    "city": "Vejen",
    "country": "Denmark",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronics & Computer Distribution",
    "long_name": "Solar A/S",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "SOLAR AS B  DK 100",
    "state": null,
    "summary": "Solar A/S operates as a sourcing and services company in electrical, heating and plumbing, ventilation, and climate and energy solutions in the Danish, Swedish, Norwegian, and Dutch markets. The company offers lighting fixtures and luminaries, and various installation materials; switches and sockets, and other products in relation to intelligent building systems; and cables. It also provides communication and security products and solutions, such as video surveillance equipment and accessories, burglar alarms, fire alarms, and access control systems for large installations and urban networks, as well as customized solutions for home switches, UPS, and antenna equipment for telephony. In addition, the company offers valves; solar panels and electricity, wood, pellet boilers, etc.; products for bathrooms and kitchens, as well as pipes of steel, copper, and plastic for various purposes; products for mounting and supporting the pipes; and drainage systems, cable protection systems, floor drains, cold-water pumps, and hoses and insulation products. Further, it provides logistics, professional support, and training services. The company was founded in 1919 and is headquartered in Vejen, Denmark.",
    "website": "http://www.solar.eu",
    "zipcode": "6600"
  }
}
