{
    "869.F": {
        "short_name": "ARCANE CRYPTO AB",
        "long_name": "Arcane Crypto AB",
        "summary": "Arcane Crypto AB engages in the development and investment in the projects focusing on bitcoin and digital assets in Stockholm, London, and Oslo. The company was founded in 2004 and based in Stockholm, Sweden.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "ARCANE.ST": {
        "short_name": "Arcane Crypto AB",
        "long_name": "Arcane Crypto AB",
        "summary": "Arcane Crypto AB engages in the development and investment in the projects focusing on bitcoin and digital assets in Stockholm, London, and Oslo. The company was founded in 2004 and based in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "HAV-B.ST": {
        "short_name": "Havsfrun Investment AB ser. B",
        "long_name": "Havsfrun Investment AB (publ)",
        "summary": "Havsfrun Investment AB (publ) manages a diversified portfolio of hedge funds in various markets. The company was founded in 1988 and is based in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "MANG.ST": {
        "short_name": "Mangold AB",
        "long_name": "Mangold Fondkommission AB",
        "summary": "Mangold Fondkommission AB, a securities broker, provides financial services to companies and private individuals in Sweden. The company offers corporate financial advisory services in the areas of stock market transactions, corporate bonds and other loan financing, sale of business, and other financial advice; pensions and wealth advisory services; services of a certified adviser; Mangold Insight research services; and mentoring services. It also provides issuing services in connection with transactions, such as rights issues, directed share issues, issues in kind, redemption and repurchase of shares, bond loans, convertible debentures, profit participating loans, incentive programs, split and consolidation of shares, and connecting the company to Euroclear; and market making services, including the provision of liquidity services. In addition, the company provides structured investments; asset management services; services regarding the distribution of structured products; and securities trading services for shares, equity-related instruments, and derivatives for private individuals, companies, and institutions. Mangold Fondkommission AB is based in Stockholm, Sweden. Mangold Fondkommission AB is a subsidiary of Mangold AB.",
        "currency": "SEK",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    }
}