{
    "CAPAC.ST": {
        "short_name": "Capacent Holding AB",
        "long_name": "Capacent Holding AB (publ)",
        "summary": "Capacent Holding AB (publ) provides consulting services to industrial and service companies, B2B and B2C, private equity firms, financial institutions, and public sector entities. Its services include strategy and organization, finance and performance management, operations excellence, working capital management, market and customer excellence, pricing and revenue management, and business analytics. The company was formerly known as ABB Financial Consulting. Capacent Holding AB (publ) is headquartered in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "state": null,
        "city": "Stockholm",
        "zipcode": "103 95",
        "website": "http://capacent.com",
        "market_cap": 142840560
    },
    "REJL-B.ST": {
        "short_name": "Rejlers AB ser. B",
        "long_name": "Rejlers AB (publ)",
        "summary": "Rejlers AB (publ) provides technical consultancy services to various customers in the construction and property, energy, industry, infrastructure, and telecom sectors. The company also offers IT services. It operates in Sweden, Finland, and Norway. The company was formerly known as Rejlerkoncernen AB and changed its name to Rejlers AB (publ) in July 2013. Rejlers AB (publ) was founded in 1942 and is headquartered in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "state": null,
        "city": "Stockholm",
        "zipcode": "104 25",
        "website": "http://www.rejlers.com",
        "market_cap": 2957122560
    },
    "TRG.ST": {
        "short_name": "Transcendent Group AB",
        "long_name": "Transcendent Group AB (publ)",
        "summary": "Transcendent Group AB (publ) engages in the management consulting business in Sweden and internationally. Its services include compliance, corporate governance, digital governance, information security, IT audit, internal audit, privacy, and financial risk. The company serves clients in the public and private sectors, including government agencies, businesses, and other organizations in a variety of industries. Transcendent Group AB (publ) was founded in 2001 and is based in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "state": null,
        "city": "Stockholm",
        "zipcode": "111 57",
        "website": "http://www.transcendentgroup.com",
        "market_cap": 140322112
    }
}