{
    "CCOR-B.ST": {
        "short_name": "Concordia Maritime AB ser. B",
        "long_name": "Concordia Maritime AB (publ)",
        "summary": "Concordia Maritime AB (publ) operates as a tanker shipping company in Sweden and internationally. It is involved in the shipbuilding, manning, technical, chartering, and commercial operation. The company focuses on transporting refined oil products, chemicals, and vegetable oils. As of March 31, 2020, its fleet consisted of ten P-MAX product tankers, second IMOIIMAX chemical and product tankers, and one suezmax tanker. The company was founded in 1984 and is headquartered in Gothenburg, Sweden. Concordia Maritime AB (publ) is a subsidiary of Stena Sessan AB.",
        "currency": "SEK",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Gothenburg"
    },
    "VSSAB-B.ST": {
        "short_name": "Viking Supply Ships AB ser. B",
        "long_name": "Viking Supply Ships AB (publ)",
        "summary": "Viking Supply Ships AB (publ) provides offshore and icebreaking services in Arctic and Subarctic areas. It operates through three segments: Anchor Handling Tug Supply vessels (AHTS), Services, and Ship Management. The AHTS segment operates four offshore vessels in Arctic areas. The Services segment provides consultancy services for ice management services and logistical support in the Arctic regions. The Ship Management segment is involved in commercial and operational management of five icebreakers and 1 PSV vessel. The company was formerly known as Rederi AB TransAtlantic (publ) and changed its name to Viking Supply Ships AB (publ) in April 2015. Viking Supply Ships AB (publ) was founded in 1974 is headquartered in Stenungsund, Sweden. Viking Supply Ships AB (publ) is a subsidiary of Viking Invest AS.",
        "currency": "SEK",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stenungsund"
    }
}