{
  "LEX.ST": {
    "city": "Stockholm",
    "country": "Sweden",
    "currency": "SEK",
    "exchange": "STO",
    "industry": "Textile Manufacturing",
    "long_name": "The Lexington Company AB (publ)",
    "market": "se_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "The Lexington Company AB",
    "state": null,
    "summary": "The Lexington Company AB (publ) produces and sells home textiles and apparel products. The company offers bedding products, bedspreads, blankets, and sleepwear; towels, robes, terry towels, and bathroom accessories; pillows and shams, and throws; and candles and scents, lamps and lanterns, and books, as well as fragrances and teddy bears. It also provides kitchen and dining products, such as tablecloths and runners, placemats, napkins and napkin rings, kitchen towels, mittens and potholders, aprons, dinnerware, flatware, glassware and coasters, and serveware, as well as bedding products, blankets and shams, and towels for babies. In addition, the company offers women's and men's clothing, including accessories, dresses and skirts, hoodies and sweaters, loungewear, pajamas, jackets and outerwear, pants and shorts, shirts, tees, polos, tanks, tunics and shirts, sleepwear, and robes. Further, it provides bags, scarves, caps and hats, shoes, belts and ties, and gloves. The company sells its products directly in Sweden; and through independent companies and online in Austria, Belgium, Denmark, Finland, France, Germany, Greece, Ireland, Italy, the Netherlands, Norway, Poland, Portugal, Spain, Sweden, Switzerland, the United Kingdom, and the United States. The Lexington Company AB (publ) was founded in 1997 and is headquartered in Stockholm, Sweden.",
    "website": "http://www.lexingtoncompany.com",
    "zipcode": "112 34"
  },
  "RENEW.ST": {
    "city": "Stockholm",
    "country": "Sweden",
    "currency": "SEK",
    "exchange": "STO",
    "industry": "Textile Manufacturing",
    "long_name": "Re:NewCell AB (publ)",
    "market": "se_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Re:NewCell AB",
    "state": null,
    "summary": "Re:Newcell AB operates as a textile recycling company in Sweden. It produces and sells dissolving pulp from recycled textiles under the Circulose brand name. The company's Circulose product is used as a raw material to produce regenerated fibers, such as viscose, modal, and lyocell. The company was founded in 2012 and is headquartered in Stockholm, Sweden.",
    "website": "http://www.renewcell.com",
    "zipcode": "114 36"
  }
}
