{"2321.TW": {"short_name": "TECOM CO", "long_name": "Tecom Co., Ltd.", "summary": "Tecom Co., Ltd. manufactures and markets telecommunications equipment for enterprise, carrier, and consumer markets in Taiwan and internationally. The company offers smartphone business communication systems, business phone systems, and IP phones for enterprises; and broadband access, wireless access, and cloud service devices for small to medium business and carrier sectors. It also offers video doorbell solutions for consumer, commercial, and apartment markets; smart home systems for residential building that provide video access control, video surveillance, and home alarm solutions for tenants; and portable vibration diagnosis instruments. Tecom Co., Ltd. was founded in 1980 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu"}, "2332.TW": {"short_name": "D-LINK CORP", "long_name": "D-Link Corporation", "summary": "D-Link Corporation designs, develops, manufactures, and sells networking and connectivity products to consumers, small businesses, medium to large-sized enterprises, and service providers in Taiwan and internationally. The company offers home networking products, such as Wi-Fi routers, range extenders, and home systems, as well as powerlines, adapters, switches, DSL modems and routers, and mobile Wi-Fi hotspots; cameras, smart plugs, hubs, sensors, and network video recorders; and accessories, including USB hubs. It also provides network security products, including UTM firewalls and VPN routers; camera accessories; switches, which consist of cloud managed and unmanaged switches, smart and fully managed switches, industrial switches, and switch accessories, as well as management software; and wireless products comprising cloud managed, software managed, and controller managed access points, as well as wireless controllers. In addition, the company offers mydlink application, and provides cloud services. Further, it provides Nuclias cloud access points and hubs; D-ViewCam, a video management software; CMS, a network devices and cameras management software; D-View 7, a network management software; and CWM, a central Wi-Fi management software. The company also provides marketing and after sales services. D-Link Corporation was founded in 1986 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "2345.TW": {"short_name": "ACCTON TECHNOLOGY CORP", "long_name": "Accton Technology Corporation", "summary": "Accton Technology Corporation engages in the provision of networking and communications solutions in the United States, Europe, Taiwan, and rest of Asia. It develops, manufactures, and sells computer network system products; and wireless land area network products, as well as provides technical consulting and engineering design services. The company offers data center switches, open packet transponders, cloud server appliances, and flash storage systems; carrier access solution; and wired and wireless network solutions. It also provides IoT integration solution; cloud-based video surveillance solutions; and software-defined wide-area networks, such as ARM-based virtual network edge device white boxes. Accton Technology Corporation was founded in 1988 and is headquartered in Hsinchu City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "2419.TW": {"short_name": "HITRON TECHNOLOGY", "long_name": "Hitron Technologies Inc.", "summary": "Hitron Technologies Inc., together with its subsidiaries, engages in the development, manufacture, and sale of broadband equipment products in Taiwan. The company offers data over cable interface specification (DOCSIS) products to MSOs, which support residential and business class applications. It also provides cable CPE products for various requirements, including compact high speed data, PacketCable-based voice, wireless gateway, and multimedia voice gateway. In addition, the company offers MoCA / WiFi extenders; and Wireless DOCSIS Probe, a troubleshooting tool that provides various tests required to measure DOCSIS and DVB-C networking environments. Further, it provides investment services and automotive electronics products; develops and sells auto parts; and produces and sells wireless and telecom products. Additionally, the company offers research, maintenance, technical consulting, and after services of electronic and telecom products. It also exports products to the America, Europe, Asia, and Australia. The company was founded in 1986 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "2444.TW": {"short_name": "ABOCOM SYSTEMS INC", "long_name": "AboCom Systems, Inc.", "summary": "AboCom Systems, Inc. develops and manufactures PCMCIA Ethernet cards and modems in Taiwan. The company offers netcom manufacturing, automatic factory, vertical-cavity surface-emitting laser chips, and wafer reclaim/thinning products and solutions. It also provides IoT applications for electronic shelf labels and smart parking solutions; and memory devices, such as DRAM, SSD, USB, and MicroSD cards. The company was founded in 1995 and is headquartered in Hsinchu City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "2496.TW": {"short_name": "SUCCESS PRIME CORPORATION", "long_name": "Success Prime Corporation", "summary": "Success Prime Corporation primarily engages in the education business in Taiwan. It offers education services, such as face-to-face tutoring and consulting, as well as digital learning services, including the creation of K12 education platform. The company also produces optical fiber products comprising single-mode, multimode, and special fibers, as well as optic fiber cable products, including boxed, outdoor, indoor, and armored optic fiber cables. In addition, it produces communication components, system, and sensors; provides digital informatics consulting services; and manages tutorial academy teachers and curriculum education services. Success Prime Corporation was founded in 1991 and is headquartered in Miaoli, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Miaoli"}, "2498.TW": {"short_name": "HTC CORPORATION", "long_name": "HTC Corporation", "summary": "HTC Corporation, together with its subsidiaries, designs, manufactures, assembles, processes, and sells smart mobile and virtual reality devices in Taiwan and internationally. It offers PDA phones, smartphones, and handheld devices. The company also provides marketing, repair, and after sales services; and online/download media services, as well as human resources management services. In addition, it is involved in the general investing activities; design, research, and development of application software and graphics technology; design and management of cloud synchronization technology; and development and sale of digital education platform, as well as development of virtual reality contents. Further, the company provides app stores for virtual reality, where customers can explore, create, connect, and experience the content; and healthcare, 5G connectivity, blockchain, and artificial intelligence technologies. It provides its products through telecom service providers, distributors, and retailers; and retail stores, as well as through online. HTC Corporation was founded in 1997 and is headquartered in Taoyuan, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "3047.TW": {"short_name": "EDIMAX TECHNOLOGY CO", "long_name": "EDIMAX Technology Co., Ltd.", "summary": "EDIMAX Technology Co., Ltd. engages in the design, development, manufacture, and marketing of networking solutions to SOHO and SME markets, and businesses in Europe, the United States, Asia, and internationally. It operates through Enterprise, Retail Products and Services; Telecommunication Products and Services; and Others segments. The company's products include whole home Wi-Fi systems, air quality monitoring systems, wireless routers, Wi-Fi range extenders, access points, Wi-Fi bridges, wireless adapters, home automation systems, network cameras, switches, ADSL modem routers, network adapters, print servers, KVM switches, Wi-Fi antennas, and legacy products. Its products also comprise AP controllers, media converters, and SFP/Mini GBICs, as well as accessories; and xDSL routers, Ethernet switches, PoE solutions, powerline solutions, network access controllers, load balancer solutions, network and professional surveillance cameras, VoIP solutions, home entertainment integration solutions, and other customer-oriented networking applications. The company offers its products primarily through retail and online channels, resellers, and distributors. EDIMAX Technology Co., Ltd. was founded in 1986 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "3138.TW": {"short_name": "AUDEN TECHNO CORP", "long_name": "Auden Techno Corp.", "summary": "Auden Techno Corp. researches, develops, designs, manufactures, and sells various antennas in Taiwan and internationally. It is also involved in equipment marketing, and test and certification businesses. The company offers CB electronic antennas, mobile phone GSM antennas, and wireless local-area network antennas; ultra-wideband and RFID application antennas; and miniature multi-frequency antenna modules, as well as 4G LTE/MIMO technology and biological electromagnetic wave products. Its products are used in mobile communications, automotive electronics, Internet communications, and digital and industrial applications. In addition, the company provides development, testing, mass production, and after-sales services; and antenna simulation, and design and measurement services. Auden Techno Corp. was founded in 1981 and is based in Taoyuan, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan"}, "3209.TW": {"short_name": "ALLTEK TECHNOLOGY CORP", "long_name": "Alltek Technology Corporation", "summary": "Alltek Technology Corporation operates as a communication components distributor and solution provider in Taiwan and internationally. The company offers broadband access devices used in C/O products, computer devices, servers, modems, and network communication products; wireless communication devices for use in PC, NB, servers, auto control products, mobile devices, mobile phones, and portable consumer products; and optical devices for O/E, Internet, and network communication applications. It also provides voice processing devices for use in PC, NB, servers, O/E products, gateways, network communication products, and modems; and protection devices for use in O/E products, gateways, network communication products, and modems. In addition, the company offers self-developed products for ASIC, DAA, SLIC modules, pair gains, switch routers, power management devices, memory products, display drivers, and AIS applications, as well as time-to-market and value-added services. Alltek Technology Corporation was founded in 1991 and is based in Taipei, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "3419.TW": {"short_name": "WHA YU INDUSTRIAL CO. LTD", "long_name": "Wha Yu Industrial Co., Ltd.", "summary": "Wha Yu Industrial Co., Ltd. provides antenna products for wireless transmission industry primarily in Taiwan and Hong Kong. It offers telecommunication BTS, in building coverage optimization, outdoor coverage optimization, GPS, automotive, Wi-Fi, LTE, DSRC, walkie talkie, various embedded, military, maritime, and telematics antennas, as well as NFC antennas/modules, alarm devices, RFID products, and electronic cable assemblies. The company was founded in 1981 and is headquartered in Hsinchu City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "3596.TW": {"short_name": "ARCADYAN TECHNOLOGY CORPORATION", "long_name": "Arcadyan Technology Corporation", "summary": "Arcadyan Technology Corporation, together with its subsidiaries, engages in the research, development, manufacture, and sale of wireless networking products, integrated access devices, digital home multimedia devices, and mobile broadband products worldwide. It operates in Networking Product and Digital Set-Top Box Product segments. The company provides various broadband access and digital home solutions, such as DSL CPEs, 802.11a/b/g/n client solutions, Wi-Fi modules, FTTx solutions, mobile broadband products, IP set-top boxes, power line communication products, etc. It also offers broadband/wireless/multimedia products for specialized design-in requirements, as well as add-on products to enhance products with wireless convenience. The company provides its solutions to telecom operators, ISPs, retailers, consumer electronic companies, and OEMs/ODMs. Arcadyan Technology Corporation was founded in 2003 and is headquartered in Hsinchu City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "3694.TW": {"short_name": "AZUREWAVE TECHNOLOGIES INC", "long_name": "AzureWave Technologies, Inc.", "summary": "AzureWave Technologies, Inc. manufactures and sells wireless connectivity and image processing solutions worldwide. The company offers wireless modules, including M.2 socket type, M.2 solder own, solder down stamp, wireless IOT module, and system in package products. It also provides camera modules, such as USB interface, MIPI interface, ultra slim and narrow NB, ultra slim and narrow MIPI, and biological identification/depth detection camera modules. In addition, the company offers design, manufacturing, and software services. Its products have applications in personal and industrial computers, mobile and Internet devices, consumer electronics, home appliances, automotive components, manufacturing facilities, and others. The company was founded in 2005 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "3704.TW": {"short_name": "UNIZYX HLDGS", "long_name": "Unizyx Holding Corporation", "summary": "Unizyx Holding Corporation, through its subsidiaries, provides networking solutions for telecom operators, corporates, and home users worldwide. It offers consumer devices, remote central office equipment, wired and wireless equipment, and home and cloud equipment under the Zyxel brand and MitraStar names. The company was founded in 1989 and is based in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu"}, "4906.TW": {"short_name": "GEMTEK TECHNOLOGY CO", "long_name": "Gemtek Technology Co., Ltd.", "summary": "Gemtek Technology Co., Ltd. designs, develops, manufactures, and sells wireless communications technologies and solutions in Taiwan and internationally. It offers wireless broadband products, including LTE portable routing products, indoor and outdoor routers, and micro base stations for individuals and families, as well as enterprises, factories, and other applications; and fixed broadband products, such as PON, xDSL/G.fast broadband, and DPU broadband hybrid fiber/copper wire distribution point unit products. The company also provides connected smart home products comprising full coverage seamless connection systems, ViTA smart controllers, and smart sensors; LoRa Internet of Things technologies and communication protocols; and joint design and manufacturing, as well as contract manufacturing services. In addition, it offers intelligent wireless system and vertical integration, smart vertical integration, LTE micro base station, and Internet of Things connection protocol solutions. The company was founded in 1988 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "5388.TW": {"short_name": "SERCOMM CORP", "long_name": "Sercomm Corporation", "summary": "Sercomm Corporation researches, develops, manufactures, and sells networking communication software and equipment worldwide. The company offers LTE/5G mobility solutions, including small cells, CBRS, private LTE, NB-IoT/LTE-M modules, and LTE/5G terminals; broadband access solutions, such as DOCSIS, FTTx, xDSL, broadband routers, and residential LTE/5G gateways; and IoT (Internet of Things) solutions comprising IP cameras, IoT gateways, mobile IoT devices, low power IoT sensors, and IoT cloud. It also provides enterprise equipment that include WiFi access points, business routers, switches, and IP phones; and home connectivity and entertainment products that include WiFi mesh repeaters, G.hn adapters, over-the-top set-top boxes, and smart speakers. In addition, the company offers consultation and customer services for computer information products; and sells IT products, communication products, and software. Further, it manufactures, servers, routers, OS, and related software. The company was founded in 1992 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "6142.TW": {"short_name": "CAMEO COMMUNICATIONS INC", "long_name": "Cameo Communications, Inc.", "summary": "Cameo Communications, Inc. manufactures and assembles computer network communication equipment and communication products. The company offers layer 2 management Ethernet switches, broadband, wireless client adapters, wireless LAN AP/routers, SOHO routers, Ethernet switches, media converters, USB to Ethernet converters, Web-smart switches and Ethernet NIC products, network cards and hubs, network routers, and network residential gateway products. Its products also comprise consumer and SME/enterprise Wi-Fi products; unmanaged, PoE, Web-smart managed, and bare metal switches; and cable and xDSL modem products. The company markets its products for network integrators, distributors, VARs, and other resellers in the United States, the Pacific Rim, and Europe. Cameo Communications, Inc. was founded in 1991 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "6216.TW": {"short_name": "DRAYTEK CORP", "long_name": "DrayTek Corporation", "summary": "DrayTek Corporation provides networking equipment and management systems in Taiwan. The company offers router products, such as VPN, broadband, xDSL, LTE, load-balancing, DSL modem, and fiber routers, as well as router matrix; access points; managed switches; management tools; and accessories comprising direct attach passive cooper cables, rack mount brackets, USB thermometers, wireless adapters, and antenna. DrayTek Corporation was founded in 1997 and is headquartered in Hsinchu City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "6285.TW": {"short_name": "WISTRON NEWEB CORPORATION", "long_name": "Wistron NeWeb Corporation", "summary": "Wistron NeWeb Corporation researches and develops, manufactures, and sells satellite communication systems and mobile and portable communication equipment in the Americas, Europe, and Asia. The company offers wired communication equipment, wireless communication networking equipment, electronic components, regulated telecommunication radio frequency equipment, satellite communication systems, and mobile and portable communication equipment. It provides satellite communications products, such as DTH TV dish antenna systems, single cable multi-output outdoor receiver systems and derivative products, satellite digital signal convertors, digital satellite radio receiver systems, digital HD radio receiver systems, satellite communications transmitters, 4K/8K high-definition digital satellite radio receivers, and high-frequency satellite two-way communications receivers. The company also offers mobile and home communications products, including wireless broadband access network communications equipment and modules, mobile indoor and outdoor broadband network terminal devices, embedded antennas for mobile devices, fiber-optic connectivity devices, surveillance cameras, V2X communication end devices, automotive cellular 4G/Wi-Fi/BT modules, Wi-Fi mesh routers, BLE modules and sensors, high-speed data center network switches, mobile broadband home gateways, and smart home devices with voice assistant. In addition, it provides other wireless products comprising high-frequency forward collision warning automotive radar devices, automotive cameras, mmWave transmission modules, industrial cellular modem, IoT asset-tracking devices, and RFID readers/antenna product series. Wistron NeWeb Corporation was founded in 1996 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "6416.TW": {"short_name": "CASWELL INC", "long_name": "CASwell Inc.", "summary": "CASwell Inc. engages in the design, engineering, manufacture, and sale of network computing and quality-proved platforms to system integrators, solution providers, and service providers worldwide. It offers network security and management products, such as 2U, 1U, fanless, desktop, and other core appliances; cloud computing and data center products, including data center switches and cloud storage servers; network attached storage products for large business, SMB, SOHO/home, and windows applications; and industrial control and automation products comprising industrial firewall, network, and control systems. The company also provides edge/fog computing products, such as SD-WAN/uCPE/vCPE products, SDN switches, and NFV servers; proprietary, proprietary PoE, network, and POE network adapters; and proprietary acceleration, storage proprietary, and network acceleration modules. CASwell Inc. was founded in 2007 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "6715.TW": {"short_name": "LINTES TECHNOLOGY CO LTD", "long_name": "Lintes Technology Co., Ltd.", "summary": "Lintes Technology Co., Ltd. designs, develops, and manufactures consumer electronics and communication connectivity products. The company offers active and passive cables, adaptors, travel docks, and dongles; and active optical cables. It serves original equipment manufacturers and original design manufacturers. Lintes Technology Co., Ltd. is based in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "8101.TW": {"short_name": "ARIMA COMMUNICATION CORP", "long_name": "Arima Communications Corp.", "summary": "Arima Communications Corp. researches, develops, designs, manufactures, and sells mobile communication and Internet of Things products primarily in Taiwan. Its solutions include mobile devices; tablets; and LTE wearable trackers, smart rearview mirrors, barcode scanners, and RF modules. The company was founded in 1999 and is based in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "HTJ.F": {"short_name": "HTC CORP. GDR REG S/4", "long_name": "HTC Corporation", "summary": "HTC Corporation, together with its subsidiaries, designs, manufactures, assembles, processes, and sells smart mobile and virtual reality devices in Taiwan and internationally. It offers PDA phones, smartphones, and handheld devices. The company also provides marketing, repair, and after sales services; and online/download media services, as well as human resources management services. In addition, it is involved in the general investing activities; design, research, and development of application software and graphics technology; design and management of cloud synchronization technology; and development and sale of digital education platform, as well as development of virtual reality contents. Further, the company provides app stores for virtual reality, where customers can explore, create, connect, and experience the content; and healthcare, 5G connectivity, blockchain, and artificial intelligence technologies. It provides its products through telecom service providers, distributors, and retailers; and retail stores, as well as through online. HTC Corporation was founded in 1997 and is headquartered in Taoyuan, Taiwan.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "Taiwan", "city": "Taoyuan City"}}