{
    "2314.TW": {
        "short_name": "MICROELECTRONICS TECHNOLOGY",
        "long_name": "Microelectronics Technology Inc.",
        "summary": "Microelectronics Technology Inc. designs, manufactures, and sells microwave and satellite communication products in the United States, Mainland China, and internationally. The company offers wireless communication products, including satellite communication equipment, terrestrial microwave radios for cellular backhaul, mobile transceiver base station modules and subsystems, wireless broadband access terminals, and radio frequency identification (RFID) readers and modules. It also provides low noise block down converters; very small aperture terminal RF equipment for satellite broadband or private networks applications; single and multi-carrier linear power amplifiers for use in cellular, PCS, CDMA, and WCDMA systems; microwave and millimeter-wave transceivers and outdoor units; and RFID and microwave products. The company was founded in 1972 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.mtigroup.com",
        "market_cap": 10215654400
    },
    "2321.TW": {
        "short_name": "TECOM CO",
        "long_name": "Tecom Co., Ltd.",
        "summary": "Tecom Co., Ltd. engages in the manufacture and sale of telecommunications equipment for enterprise, carrier, and consumer markets in Taiwan and internationally. The company offers smartphone business communication systems and business phone systems for enterprises; and video doorbell solutions for consumer, commercial, and apartment markets, as well as smart home systems for residential building that provide video access control, video surveillance, and home alarm solutions for tenants. It also offers vibration diagnosis instrument; smart IIoT gateways; smart vibration gauges; smart temperature sensors; smart power meters; and analog to digital and temperature sensing signal converters. Tecom Co., Ltd. was founded in 1980 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.tecom.com.tw",
        "market_cap": 311004672
    },
    "2345.TW": {
        "short_name": "ACCTON TECHNOLOGY CORP",
        "long_name": "Accton Technology Corporation",
        "summary": "Accton Technology Corporation engages in the provision of networking and communications solutions in the United States, Europe, Taiwan, and rest of Asia. It develops, manufactures, and sells computer network system products; and wireless land area network products, as well as provides technical consulting and engineering design services. The company offers data center switches, open packet transponders, cloud server appliances, and flash storage systems; carrier access solution; and wired and wireless network solutions. It also provides IoT integration solution; cloud-based video surveillance solutions; and software-defined wide-area networks, such as ARM-based virtual network edge device white boxes. Accton Technology Corporation was founded in 1988 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30077",
        "website": "http://www.accton.com",
        "market_cap": 144326721536
    },
    "2419.TW": {
        "short_name": "HITRON TECHNOLOGY",
        "long_name": "Hitron Technologies Inc.",
        "summary": "Hitron Technologies Inc., together with its subsidiaries, engages in the development, manufacture, and sale of broadband equipment products in Taiwan. The company offers data over cable interface specification (DOCSIS) products to MSOs, which support residential and business class applications. It also provides cable CPE products for various requirements, adapters and extenders, module DOCSIS 3.1, infrastructure diagnostic equipment, outdoor cable modem, and PON CPE unit. In addition, the company offers OptiMy, a software platform to manage and optimize residential Wi-Fi home networks; and hitron cloud, a cloud-based solution that monitors, manages, and optimizes home broadband gateway and Wi-Fi networks, as well as provides various apps. Further, it provides international trade; automotive electronics products; and research, development, maintenance, technical consulting, and after sales services of electronic and telecom products. The company also exports products to the United States, Europe, and Asia. Hitron Technologies Inc was incorporated in 1986 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.hitrontech.com",
        "market_cap": 6635195904
    },
    "2444.TW": {
        "short_name": "ABOCOM SYSTEMS INC",
        "long_name": "AboCom Systems, Inc.",
        "summary": "AboCom Systems, Inc. develops and manufactures PCMCIA Ethernet cards and modems in Taiwan. The company offers netcom manufacturing, automatic factory, VCSEL chip, and wafer reclaim/thinning products and solutions. It also provides IoT applications for electronic shelf labels; and memory devices, such as DRAM, SSD, USB, and MicroSD cards. AboCom Systems, Inc. was founded in 1995 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": null,
        "website": "http://www.abocom.com.tw",
        "market_cap": 1269624960
    },
    "2485.TW": {
        "short_name": "ZINWELL",
        "long_name": "Zinwell Corporation",
        "summary": "Zinwell Corporation engages in the manufacture and sale of digital cable/satellite/terrestrial receiving, broadcast and broadband communication, IPTV receiving, and wireless equipment in Taiwan. It offers digital channel stacking switch (dCSS), low-noise block downconverter (LNB), headend system, and SAT>IP products; digital home entertainment products, including wireless video sender, set top box, soundbox, and soundbar; and residential broadband products, such as G.hn, G.fast, Wi-Fi, and MoCA solutions, as well as 5G, 4G LTE, and IoT solutions. The company also provides CATV/MATV transmission products that comprise optoelectronic, CATV outdoor amplifier, CATV outdoor passive, CATV/MATV indoor amplifier, CATV outdoor passive, and satellite TV distribution services. Zinwell Corporation was founded in 1981 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "235",
        "website": "http://www.zinwell.com.tw",
        "market_cap": 6163166208
    },
    "2496.TW": {
        "short_name": "SUCCESS PRIME CORPORATION",
        "long_name": "Success Prime Corporation",
        "summary": "Success Prime Corporation primarily engages in the education business in Taiwan. It offers education services, such as face-to-face tutoring and consulting, as well as digital learning services, including the creation of K12 education platform. The company also produces optical fiber products comprising single-mode, multimode, and special fibers, as well as optic fiber cable products, including boxed, outdoor, indoor, and armored optic fiber cables. In addition, it produces communication components, system, and sensors; provides digital informatics consulting services; and manages tutorial academy teachers and curriculum education services. Success Prime Corporation was founded in 1991 and is headquartered in Miaoli, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Miaoli",
        "zipcode": "350",
        "website": "http://www.success-prime.com",
        "market_cap": 1059744384
    },
    "3047.TW": {
        "short_name": "EDIMAX TECHNOLOGY CO",
        "long_name": "EDIMAX Technology Co., Ltd.",
        "summary": "EDIMAX Technology Co., Ltd. engages in the design, development, manufacture, and marketing of networking solutions to SOHO and SME markets, and businesses in Europe, the United States, Asia, and internationally. It operates through Enterprise, Retail Products and Services; Telecommunication Products and Services; and Others segments. The company's products include whole home Wi-Fi systems, air quality monitoring systems, wireless routers, Wi-Fi range extenders, access points, Wi-Fi bridges, wireless adapters, powerline, home automation systems, network cameras, switches, ADSL modem routers, network adapters, print servers, KVM switches, Wi-Fi antennas, and legacy products. Its products also comprise EDIMAX pro, AP controllers, and SFP/Mini GBICs, as well as accessories; and indoor and semi-outdoor detection solutions, monitors, cable and cableless transmission equipment, xDSL routers, Ethernet switches, PoE solutions, powerline solutions, network access controllers, load balancer solutions, professional surveillance cameras, VoIP solutions, home entertainment integration solutions, and other customer-oriented networking applications. The company offers its products primarily through retail and online channels, resellers, and distributors. EDIMAX Technology Co., Ltd. was incorporated in 1986 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "24891",
        "website": "http://www.edimax.com.tw",
        "market_cap": 2078257536
    },
    "3062.TW": {
        "short_name": "CYBERTAN TECHNOLOGY INC",
        "long_name": "CyberTAN Technology, Inc.",
        "summary": "CyberTAN Technology, Inc. manufactures and sells broadband and wireless networking equipment for the small-office and home-office markets in Taiwan, China, and the United States. The company offers fixed broadband products, including broadband/DSL routers, cable gateways, and Wi-Fi AP bridges; mobile broadband products, such as 4G/LTE routers and satellite routers; voice over IP products comprising wired/wireless VoIP gateways, ADSL 2/2+ IAD, and VDSL2 IAD products; and wireless/SiP products consisting of wireless embedded modules, SiP modules, and IoT modules. It also provides digital home products, including DTA/IP/cable/satellite set-top-boxes and IoT gateways; and professional OEM/ODM services for the home networking and communications markets. CyberTAN Technology, Inc. was founded in 1998 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "308",
        "website": "http://www.cybertan.com.tw",
        "market_cap": 6325646336
    },
    "3138.TW": {
        "short_name": "AUDEN TECHNO CORP",
        "long_name": "Auden Techno Corp.",
        "summary": "Auden Techno Corp. researches, develops, designs, manufactures, and sells various antennas in Taiwan and internationally. It is also involved in equipment marketing, and test and certification businesses. The company offers CB electronic antennas, mobile phone GSM antennas, and wireless local-area network antennas; ultra-wideband and RFID application antennas; and miniature multi-frequency antenna modules, as well as 4G LTE/MIMO technology and biological electromagnetic wave products. Its products are used in mobile communications, automotive electronics, Internet communications, and digital and industrial applications. In addition, the company provides development, testing, mass production, and after-sales services; and antenna simulation, and design and measurement services. Auden Techno Corp. was founded in 1981 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan",
        "zipcode": null,
        "website": "http://www.auden.com.tw",
        "market_cap": 9175763968
    },
    "3152.TWO": {
        "short_name": "ADVANCED CERAMIC X CORP",
        "long_name": "Advanced Ceramic X Corporation",
        "summary": "Advanced Ceramic X Corporation designs, manufactures, and sells RF front-end devices and modules for wireless communication applications in Taiwan, China, the United States, Hong Kong, and internationally. It offers antenna switch modules; antennas; low pass, high pass, and band pass filters, as well as filter arrays; diplexers, triplexers, and saw-triplexers; baluns and baluns filters; couplers and couplers filters; power dividers; high frequency inductors; Bluetooth modules; and RF chip ceramic devices. The company was founded in 1998 and is headquartered in Hsinchu County, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30352",
        "website": "http://www.acxc.com.tw",
        "market_cap": 33645398016
    },
    "3209.TW": {
        "short_name": "ALLTEK TECHNOLOGY CORP",
        "long_name": "Alltek Technology Corporation",
        "summary": "Alltek Technology Corporation operates as a communication components distributor and solution provider in Taiwan and internationally. The company provides broadband access devices used in C/O products, computer devices, servers, modems, and network communication products; wireless communication devices for use in PC, NB, servers, auto control products, mobile devices, mobile phones, and portable consumer products; and optical devices for O/E, Internet, and network communication applications. It also offers voice processing devices for use in PC, NB, servers, O/E products, gateways, network communication products, and modems; and protection devices for use in O/E products, gateways, network communication products, and modems. In addition, the company provides self-developed products for ASIC, DAA, SLIC modules, pair gains, switch routers, power management devices, memory products, display drivers, and AIS applications, as well as time-to-market and value-added services. Alltek Technology Corporation was founded in 1991 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.alltek.com",
        "market_cap": 5344363008
    },
    "3363.TWO": {
        "short_name": "FOCI FIBER OPTIC COMMUNICATIONS",
        "long_name": "FOCI Fiber Optic Communications, Inc.",
        "summary": "FOCI Fiber Optic Communications, Inc. designs, manufactures, and markets fiber optic components and integrated modules for communication networks in Taiwan. It offers interconnects, such as connector/adaptor parts, pigtails/patchcords, and patchpanels; couplers/splitters, attenuators, and wavelength division multiplexing (WDM) products; filter WDMs, CWDMs, DWDMs, and filter devices; optical isolators and circulators, including micro optic devices; optical transceivers and active optical cables; and USB 3.0 AOC cables, sub-assemblies, pigtails/receptacles, and detectors. The company was founded in 1995 and is based in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.foci.com.tw",
        "market_cap": 2203279616
    },
    "3391.TWO": {
        "short_name": "REMOTEK",
        "long_name": "Remotek Corporation",
        "summary": "Remotek Corporation engages in the research, design, production, and sale of radio coverage solutions for 2G, 3G, and 4G mobile radio networks worldwide. The company offers digital repeaters, including PICO ICS, ICS, digital fiber optic, and digital band adjustable repeaters; distributed antenna systems, such as fiber optic repeaters and cable boosters; and off air solutions comprising low and medium power repeaters, high power repeaters, channel selective repeaters, and frequency shifting repeaters. It also provides operation and maintenance system, a management system for controlling and monitoring repeaters remotely; and accessories, such as antennas, couplers, splitters, combiners, dummy loads, coaxial cables, and connectors. In addition, the company offers RF components and related services. It serves providers of mobile communication. Remotek Corporation was founded in 1990 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "221",
        "website": "http://www.remotek.com.tw",
        "market_cap": 676644160
    },
    "3419.TW": {
        "short_name": "WHA YU INDUSTRIAL CO. LTD",
        "long_name": "Wha Yu Industrial Co., Ltd.",
        "summary": "Wha Yu Industrial Co., Ltd. provides antenna products for wireless transmission industry primarily in Taiwan and Hong Kong. It offers telecommunication BTS, in building coverage optimization, outdoor coverage optimization, GPS, automotive, Wi-Fi, LTE, DSRC, walkie talkie, various embedded, military, maritime, telematics, mmWave active, handheld game console, small cell, and dispenser antennas, as well as NFC antennas/modules, alarm devices, RFID products, electronic cable assemblies, and BSD blind spot detection radars. The company was founded in 1981 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30070",
        "website": "http://www.whayu.com",
        "market_cap": 2343355648
    },
    "3466.TWO": {
        "short_name": "SKARDIN INDUSTRIAL CORP",
        "long_name": "Skardin Industrial Corporation",
        "summary": "Skardin Industrial Corporation, a consumer electronics manufacturing company, manufactures, supplies, and exports set top box and broadband industry solutions in Taiwan and internationally. It offers STB platforms, smart home products, WIFI speakers, hybrid soundbase and sound bar audio systems, and software/middleware products. The company also provides electronics manufacturing services. Skardin Industrial Corporation was founded in 1982 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.skardin.com",
        "market_cap": 715433984
    },
    "3491.TWO": {
        "short_name": "UNIVERSAL MICROWAVE TECHNOLOGY ",
        "long_name": "Universal Microwave Technology, Inc.",
        "summary": "Universal Microwave Technology, Inc. designs, develops, and manufactures custom microwave/mm-wave devices, sub-systems, and antennas for broadband wireless communications. The company's products comprise diplexers, filters, couplers, OMT products, Eband/millimeter-wave products, distributed antenna systems, hanger clamp sets, Ku/Ka band OMT and filter assemblies, waveguide components, circulators/isolators, cable assemblies, flexible waveguides, antennas, die-casting and machined parts, and remote mount kits. Its products are used in point-to-point, cellular, VSAT, WiMAX, and LTE applications. The company was founded in 1999 and is headquartered in Keelung City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Keelung City",
        "zipcode": "206",
        "website": "http://www.umt-tw.com",
        "market_cap": 4152221440
    },
    "3558.TWO": {
        "short_name": "SENAO NETWORKS INC",
        "long_name": "Senao Networks, Inc.",
        "summary": "Senao Networks, Inc. researches, develops, designs, manufactures, and sells wireless communication products in the United States, Europe, Taiwan, and internationally. The company offers wireless network Wi-Fi systems, including outdoor mesh wireless access points (APs)/repeaters, user-end mesh wireless APs/bridges, smart cloud network management services, smart mesh connection solutions, wireless network routers, smart home mesh wireless network routers, and enterprise wireless network management software. It also provides wired network system switches, such as large enterprises network security servers, small and medium-sized enterprises network security servers, medium and large-sized enterprises network security servers, managed network switches, managed network controllers, easy/smart network switches, layer2/3 managed network switches, PoE network cable power supplies, and electrical equipment for smart power supply. In addition, the company offers cloud management service and cloud device management platforms, cloud management service wireless network base stations, and cloud management service switches; enterprise radio system products comprising single-wire, high-speed, frequency-hopping, digital, and long-range enterprise cordless communication devices; and four-wire, multi-master, high-speed, frequency-hopping, digital, and long-range enterprise cordless communication systems, as well as AP CAMs, PoE/Ethernet power supply parts, antennas, and power supply products. Further, it is involved in the development of new generation of 6GHz wireless management base stations; cloud gateways; enterprise-grade video surveillance solution; Internet of Things/Industrial Internet of Things; outdoor wireless LTE bridge APs; IP-base long-range cordless phones; and integrated 900MHz digital cordless interphones. The company offers products under the Senao and EnGenius names. Senao Networks, Inc. was founded in 1979 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.senao.com",
        "market_cap": 4621545984
    },
    "3596.TW": {
        "short_name": "ARCADYAN TECHNOLOGY CORPORATION",
        "long_name": "Arcadyan Technology Corporation",
        "summary": "Arcadyan Technology Corporation, together with its subsidiaries, engages in the research, development, manufacture, and sale of wireless networking products, integrated access devices, digital home multimedia devices, and mobile broadband products worldwide. It operates in Networking Product and Digital Set-Top Box Product segments. The company provides various broadband access and digital home solutions, such as DSL CPEs, 802.11a/b/g/n client solutions, Wi-Fi modules, FTTx solutions, mobile broadband products, IP set-top boxes, power line communication products, etc. It also offers broadband/wireless/multimedia products for specialized design-in requirements, as well as add-on products to enhance products with wireless convenience. The company provides its solutions to telecom operators, ISPs, retailers, consumer electronic companies, and OEMs/ODMs. Arcadyan Technology Corporation was founded in 2003 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30071",
        "website": "http://www.arcadyan.com",
        "market_cap": 20941887488
    },
    "3694.TW": {
        "short_name": "AZUREWAVE TECHNOLOGIES INC",
        "long_name": "AzureWave Technologies, Inc.",
        "summary": "AzureWave Technologies, Inc. manufactures and sells wireless connectivity and image processing solutions worldwide. The company offers wireless modules, including M.2 socket type, M.2 solder own, solder down stamp, wireless IOT module, and system in package products. It also provides camera modules, such as USB interface, MIPI interface, ultra slim and narrow NB, ultra slim and narrow MIPI, and biological identification/depth detection camera modules. In addition, the company offers design, manufacturing, and software services. Its products have applications in personal and industrial computers, mobile and internet devices, consumer electronics, home appliances, automotive components, manufacturing facilities, and others. The company was founded in 2005 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "231",
        "website": "http://www.azurewave.com",
        "market_cap": 3783616256
    },
    "3704.TW": {
        "short_name": "UNIZYX HLDGS",
        "long_name": "Unizyx Holding Corporation",
        "summary": "Unizyx Holding Corporation, together with its subsidiaries, provides networking solutions for telecom operators, corporates, and home users worldwide. It offers consumer devices, remote central office equipment, wired and wireless equipment, and home and cloud equipment under the Zyxel brand and MitraStar names. The company was founded in 1989 and is based in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": null,
        "website": "http://www.unizyx.com.tw",
        "market_cap": 14725300224
    },
    "4905.TWO": {
        "short_name": "TAINET COMMUNICATIONS SYSTEM CO",
        "long_name": "Tainet Communication System Corp.",
        "summary": "Tainet Communication System Corp. provides carrier class access equipment to telecom carriers, service operators, and business users worldwide. The company offers Ethernet access devices, VoIP gateway products, xDSL and analog modems, PON, optical transceivers, and interface converters. It also provides copper over fiber connectivity, VoIP gateway communication, xDSL Ethernet, and TDM over IP communication solutions. The company was founded in 1990 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "114",
        "website": "http://www.tainet.net",
        "market_cap": 2050985088
    },
    "4906.TW": {
        "short_name": "GEMTEK TECHNOLOGY CO",
        "long_name": "Gemtek Technology Co., Ltd.",
        "summary": "Gemtek Technology Co., Ltd. designs, develops, manufactures, and sells wireless communications technologies and solutions in Taiwan and internationally. It offers wireless broadband products, including LTE portable routing products, indoor and outdoor routers, and micro base stations for individuals and families, as well as enterprises, factories, and other applications; and fixed broadband products, such as PON, xDSL/G.fast broadband, and DPU broadband hybrid fiber/copper wire distribution point unit products. The company also provides connected smart home products comprising full coverage seamless connection systems, ViTA smart controllers, and smart sensors; LoRa Internet of Things technologies and communication protocols; and joint design and manufacturing, as well as contract manufacturing services. In addition, it offers intelligent wireless system and vertical integration, smart vertical integration, LTE micro base station, and Internet of Things connection protocol solutions. The company was founded in 1988 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": null,
        "website": "http://www.gemteks.com",
        "market_cap": 10942284800
    },
    "4980.TWO": {
        "short_name": "JORJIN",
        "long_name": "Jorjin Technologies Inc.",
        "summary": "Jorjin Technologies Inc. provides modular processing, sensing, and wireless connectivity solutions worldwide. It also offers wireless system in package, application processor, imaging, and audio visual modules, as well as modules for the Internet of things; and driver software, as well as design-in support services. In addition, the company distributes a range of components, such as barcode scanning modules, filters, TCXOs, chip antennas, and EMI shielding components, as well as 2, 3, and 4G modems. It serves wearable consumer electronics, automotive infotainment, cloud connected devices, and industrial mobile computing markets. The company was founded in 1997 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "22161",
        "website": "http://www.jorjin.com",
        "market_cap": 1016045504
    },
    "5348.TWO": {
        "short_name": "TRAN SYSTEM INC",
        "long_name": "TranSystem, Inc.",
        "summary": "TranSystem, Inc. designs and develops wireless communications products for the RF communications and GPS markets in Taiwan. The company offers wireless products, such as sDAS HEU, sDAS RAU, and digital MSB repeaters; DAS accessories, such as power dividers, antennas, and power over Ethernet; Wi-Fi products; MMDS downconverters, transceivers, and antennas; switching power supply with DC inserters; and WiMAX outdoor base station and outdoor CPE products. It also provides GPS products, including Bluetooth GPS products, software solutions for GPS data loggers, GPS data loggers, wired GPS products, active antennas, and engine boards, as well as tracking devices, and modules for embedded GPS applications. TranSystem, Inc. was founded in 1990 and is headquartered in Miaoli, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Miaoli",
        "zipcode": "350",
        "website": "http://www.transystem.com.tw",
        "market_cap": 212784704
    },
    "5353.TWO": {
        "short_name": "TAILYN TECHNOLOGIES INC",
        "long_name": "Tailyn Technologies, Inc.",
        "summary": "Tailyn Technologies, Inc. engages in the design and manufacture of turnkey solutions for communication and applications sectors in Taiwan. The company offers industrial Ethernet switches comprising unmanaged, lite managed, and managed Ethernet switches; carrier Ethernet products; wireless LAN products; and telecom products. It also provides design, joint-development, manufacturing, associated engineering, and logistic support services. The company was formerly known as Tailyn Communication Company, Ltd. and changed its name to Tailyn Technologies, Inc. in July 2013. Tailyn Technologies, Inc. was founded in 1980 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33852",
        "website": "http://www.tailyn.com.tw",
        "market_cap": 1293750016
    },
    "5388.TW": {
        "short_name": "SERCOMM CORP",
        "long_name": "Sercomm Corporation",
        "summary": "Sercomm Corporation researches, develops, manufactures, and sells networking communication software and equipment worldwide. The company offers LTE/5G mobility solutions, including small cells, CBRS, private LTE, NB-IoT/LTE-M modules, and LTE/5G terminals; broadband access solutions, such as DOCSIS, FTTx, xDSL, broadband routers, and residential LTE/5G gateways; and IoT (Internet of Things) solutions comprising IP cameras, IoT gateways, mobile IoT devices, low power IoT sensors, and IoT cloud. It also provides enterprise equipment that include WiFi access points, business routers, switches, and IP phones; and home connectivity and entertainment products that include WiFi mesh repeaters, G.hn adapters, over-the-top set-top boxes, and smart speakers. In addition, the company offers consultation and customer services for computer information products; and sells IT products, communication products, and software. Further, it manufactures, servers, routers, OS, and related software. The company was founded in 1992 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.sercomm.com",
        "market_cap": 16382336000
    },
    "6134.TWO": {
        "short_name": "WANSHIH ELECTRONIC CO LTD",
        "long_name": "Wanshih Electronic Co., Ltd.",
        "summary": "Wanshih Electronic Co., Ltd. operates as an OEM/ODM manufacturer of mini coaxial cable assembly for tier-one notebook computer and mobile phone companies worldwide. The company primarily provides NB and mini-coaxial cables, LCD TV cables/wire harnesses, mobile phone cables, wire harness cables, electronic components, and smart antennas/modules. Its products include external cables comprising HDMI, USB 2.0/3.0/3.1, SATA, LAN, D-SUB/DVI, RCA, VGA, BNC, automobile, lightning, and medical cables, as well as power cords; antennas, such as external Wi-Fi and LTE, built-in PCB and metal, built-in MIMO, satellite positioning, small base station, and fiberglass tube; and internal cables consisting of LVDS/eDP, consumer device, industrial, medical, and robotic cables. It also provides SMT products and assembly, such as SMT equipment comprising multi-f production, solder paste printing, 3D online solder paste, and AOI optical inspection; and various applications in automobile, consumer electronic, and 3C/AI. The company was founded in 1987 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "24891",
        "website": "http://www.wanshih.com.tw",
        "market_cap": 1364502144
    },
    "6142.TW": {
        "short_name": "CAMEO COMMUNICATIONS INC",
        "long_name": "Cameo Communications, Inc.",
        "summary": "Cameo Communications, Inc. manufactures and assembles computer network communication equipment and communication products. The company offers layer 2 management Ethernet switches, wireless client adapters, wireless LAN AP/routers, SOHO routers, Ethernet switches, media converters, USB to Ethernet converters, Web-smart switches and Ethernet NIC products, network cards and hubs, network routers, and network residential gateway products, as well as broadband products. Its products also comprise consumer and SMB/enterprise Wi-Fi products; unmanaged, PoE, Web-smart managed, and data center switches; and cable and xDSL modem products. The company markets its products for network integrators, distributors, VARs, and other resellers in the United States, the Pacific Rim, and Europe. Cameo Communications, Inc. was founded in 1991 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.cameo.com.tw",
        "market_cap": 2458312448
    },
    "6143.TWO": {
        "short_name": "NETRONIX INC",
        "long_name": "Netronix, Inc.",
        "summary": "Netronix, Inc. designs and manufactures network and e-Reader products in Taiwan and internationally. It also designs and sells ID, hardware, and software products, as well as provides electronic shelf label and electron baggage tag. The company was founded in 1997 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "302",
        "website": "http://www.netronixinc.com",
        "market_cap": 3564123904
    },
    "6148.TWO": {
        "short_name": "AZION CORPORATION",
        "long_name": "Azion Corporation",
        "summary": "Azion Corporation provides information, communication, network, telecommunications, broadband, traffic control engineering, and cloud applications services in Taiwan. The company's products include DataPilot 10, a handheld digital evidence acquisition instrument; big data platforms; Cisco data center and virtualization, Cisco cloud collaboration, and Cisco enterprise network services; information security solutions; search and exploration engine systems; storage systems; and data protection solutions. Its solutions include information and communication system integration, big data analysis and knowledge exploration, information security, digital banking and financial, and smart police solutions. It serves finance, manufacturing, retail, telecommunications, and government agencies. The company was founded in 1991 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "100",
        "website": "http://www.azion.com.tw",
        "market_cap": 595782080
    },
    "6152.TW": {
        "short_name": "PRIME ELECTRONICS&SATELLITICS I",
        "long_name": "Prime Electronics & Satellitics Inc.",
        "summary": "Prime Electronics & Satellitics Inc. develops, manufactures, and sells digital satellite communication products worldwide. The company provides headend systems; home networking products; low noise block-converters; multi-switches; set-top boxes; and satellite products for satellite TV, CATV, and IPTV markets. It serves TV operators, telcos, and distributors. Prime Electronics & Satellitics Inc. was founded in 1995 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "32063",
        "website": "http://www.pesi.com.tw",
        "market_cap": 1650541952
    },
    "6216.TW": {
        "short_name": "DRAYTEK CORP",
        "long_name": "DrayTek Corporation",
        "summary": "DrayTek Corporation provides networking equipment and management systems in Taiwan. The company offers router products, such as VPN, broadband, xDSL, LTE, load-balancing, DSL modem, and fiber routers, as well as router matrix; access points; managed switches; software/tools; and accessories comprising direct attach passive cooper cables, rack mount brackets, USB thermometers, wireless adapters, and antenna. DrayTek Corporation was founded in 1997 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30352",
        "website": "http://www.draytek.com.tw",
        "market_cap": 2179573248
    },
    "6220.TWO": {
        "short_name": "YFC-BONEAGLE ELECTRIC CO",
        "long_name": "YFC-Boneagle Electric Co., Ltd.",
        "summary": "YFC-Boneagle Electric Co., Ltd. develops, manufactures, and sells power cord sets, LAN cables, patch cords, and related networking accessories in Taiwan and internationally. The company provides power cables, including wires, power supply cords, cord sets, and portable hand lamps; electronic wires and cables comprising UL AWM cables and hook-up wires; and networking accessories, such as patch panels, keystone jacks, outlets, plugs, wiring connectors and blocks, and cable management products, as well as LAN cables and patch cords. It also offers fiber optic products, which comprise FO cables, FO patch cords, FO adapters, FO connectors, and FO enclosures. YFC-Boneagle Electric Co., Ltd. was founded in 1983 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan",
        "zipcode": "32741",
        "website": "http://www.cables.com.tw",
        "market_cap": 3103494400
    },
    "6241.TWO": {
        "short_name": "AMIGO TECHNOLOGY INC.",
        "long_name": "Amigo Technology Inc.",
        "summary": "Amigo Technology Inc., an OEM/ODM company, provides various support services related to the design, manufacture, and after-sales service for networking and communication products. It offers Wi-Fi access points, such as enterprise indoor and ruggedized access points; and mesh routers. The company was founded in 1992 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "709",
        "website": "http://www.amigo.com.tw",
        "market_cap": 454180544
    },
    "6285.TW": {
        "short_name": "WISTRON NEWEB CORPORATION",
        "long_name": "Wistron NeWeb Corporation",
        "summary": "Wistron NeWeb Corporation researches and develops, manufactures, and sells satellite communication systems and mobile and portable communication equipment in the Americas, Europe, and Asia. The company offers wired communication equipment, wireless communication networking equipment, electronic components, regulated telecommunication radio frequency equipment, satellite communication systems, and mobile and portable communication equipment. It provides satellite communications products, such as DTH TV dish antenna systems, single cable multi-output outdoor receiver systems and derivative products, satellite digital signal convertors, digital satellite radio receiver systems, digital HD radio receiver systems, satellite communications transmitters, 4K/8K high-definition digital satellite radio receivers, and high-frequency satellite two-way communications receivers. The company also offers mobile and home communications products, including wireless broadband access network communications equipment and modules, mobile indoor and outdoor broadband network terminal devices, embedded antennas for mobile devices, fiber-optic connectivity devices, surveillance cameras, V2X communication end devices, automotive cellular 4G/Wi-Fi/BT modules, Wi-Fi mesh routers, BLE modules and sensors, high-speed data center network switches, mobile broadband home gateways, and smart home devices with voice assistant. In addition, it provides other wireless products comprising high-frequency forward collision warning automotive radar devices, automotive cameras, mmWave transmission modules, industrial cellular modem, IoT asset-tracking devices, and RFID readers/antenna product series. Wistron NeWeb Corporation was founded in 1996 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "308",
        "website": "http://www.wnc.com.tw",
        "market_cap": 26958907392
    },
    "6403.TWO": {
        "short_name": "AcSiP",
        "long_name": "AcSiP Technology Corp.",
        "summary": "AcSiP Technology Corp., an Internet of Things solution company, provides wireless communication services and solutions in Taiwan. The company offers wireless connectivity solutions, including Bluetooth, NFC, Zigbee, GPS, 2G, 4G, and IoT-Wi-Fi and loT-LoRa products, as well as development kits. It also provides system integration and size shrinkage services. AcSiP Technology Corp. was founded in 2009 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23805",
        "website": "http://www.acsip.com.tw",
        "market_cap": 377350816
    },
    "6416.TW": {
        "short_name": "CASWELL INC",
        "long_name": "CASwell Inc.",
        "summary": "CASwell Inc. engages in the design, engineering, manufacture, and sale of network computing and quality-proved platforms to system integrators, solution providers, and service providers worldwide. It offers network security and management products, such as 2U, 1U, fanless desktop, desktop, and other core appliances; cloud computing and data center products, including data center switches and cloud storage servers; network attached storage products for large business, SMB, SOHO/home, and windows applications; and industrial control and automation products comprising industrial firewall and control systems. The company also provides edge/fog computing products, such as SD-WAN/uCPE/vCPE products, SDN switches, and NFV servers; proprietary, proprietary PoE, network, and POE network adapters; and proprietary acceleration, storage proprietary, and network acceleration modules. CASwell Inc. was founded in 2007 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "238",
        "website": "http://www.cas-well.com",
        "market_cap": 8548932608
    },
    "6417.TWO": {
        "short_name": "SECURITAG ASSEMBLY GROUP CO LTD",
        "long_name": "Securitag Assembly Group Co., Ltd.",
        "summary": "Securitag Assembly Group Co., Ltd. manufactures and sells RFID transponders in Taiwan and internationally. It offers cards; keyfobs; tags; and NFC sensor-enabled tag products, as well as metal, non-metal, NFC, tamper proof, and rain RFID labels. The company also provides value-added services, such as thermal transfer printing or encoding on used chips. It serves clients in access control, healthcare, automation, logistic, industrial, entertainment, and NFC markets. Securitag Assembly Group Co., Ltd. was founded in 1999 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "41280",
        "website": "http://www.sag.com.tw",
        "market_cap": 2706663936
    },
    "6426.TW": {
        "short_name": "APOGEE OPTOCOM CO",
        "long_name": "Apogee Optocom Co., Ltd.",
        "summary": "Apogee Optocom Co., Ltd. manufactures and sells communication components. The company offers active and passive optical filters. It also provides 3D sensors; data center products; OEM and ODM coating services; and coating, polish cut, and check test equipment. Apogee Optocom Co., Ltd. was founded in 2003 and is based in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "744",
        "website": "http://www.nextapogee.com.tw",
        "market_cap": 3103099904
    },
    "6465.TWO": {
        "short_name": "ATRACK TECHNOLOGY INC",
        "long_name": "ATrack Technology Inc.",
        "summary": "ATrack Technology Inc. designs, develops, manufactures, and sells GPS telematics hardware in Taiwan and internationally. It offers hardwired fleet tracking devices, plug and play GPS tracking units, and IP rated tracking devices, as well as accessories. The company's products are used in cars, trucks, containers and non-powered assets, trailers, and motorcycles. ATrack Technology Inc. was founded in 2010 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11493",
        "website": "http://www.atrack.com.tw",
        "market_cap": 512944992
    },
    "6514.TWO": {
        "short_name": "RADIATION TECHNOLOGY INC",
        "long_name": "Radiation Technology, Inc.",
        "summary": "Radiation Technology, Inc. designs, manufactures, and sells antennas worldwide. The company offers LTE/4G/BTS, IoT/intelligent, automotive, RFID/health care, GPS/transportation, and wireless communication antennas, as well as semi-rigid and flexible RF cable assembly products, RF connectors, wire harness, microwave devices, and other products, as well as medical, computer, and network cables. The company was founded in 2001 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "32063",
        "website": "http://www.rt-inc.com",
        "market_cap": 1380690048
    },
    "6530.TWO": {
        "short_name": "AXCEN PHOTONICS CORPORATION",
        "long_name": "Axcen Photonics Corporation",
        "summary": "Axcen Photonics Corporation specializes in photonic integration of optical, mechanical, and electrical design of manufacturing professional-grade optical transceiver modules in Taiwan. It offers 25G SFP28, video small form factor pluggable (SFP), compact SFP, 10G SFP+, 1x9, SFP, copper SFP, bi-directional SFP with single LC receptacle, BIDI 1x9, 2x5 small form factor (SFF), gigabit Ethernet passive optical network SFF, and coarse wavelength division multiplexing SFP transceiver modules. The company was incorporated in 2002 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "231",
        "website": "http://www.axcen.com.tw",
        "market_cap": 634499968
    },
    "6546.TWO": {
        "short_name": "AMPAK",
        "long_name": "AMPAK Technology Inc.",
        "summary": "AMPAK Technology Inc. operates as an optical communication and wireless multimedia company in Taiwan. The company operates through two business units, Wireless Multi-Media and Optical Communication. The Wireless Multi-Media business unit offers wireless multimedia products, such as Systems in Package and wireless HDMI. The Optical Communication business unit provides Tocan packaging and testing services for optoelectronic components, as well as various solutions for the optoelectronics industry. The company serves the industrial PC, energy efficiency, audio, consumer electronics, VR, UAV, wearable, medical, and automotive markets. AMPAK Technology Inc. was founded in 2000 and is based in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": null,
        "website": "http://www.ampak.com.tw",
        "market_cap": 5234160640
    },
    "6674.TW": {
        "short_name": "COMPAL BROADBAND NETWORKS INC",
        "long_name": "Compal Broadband Networks, Inc.",
        "summary": "Compal Broadband Networks, Inc. provides networking, home security, and home entertainment products in Taiwan and internationally. The company also offers wireless accessories. Its products include DOCSIS 3.1 CPE products, such as built-in WiFi 6 gateway and 2.5Gbps Ethernet to provide broadband cable services for DOCSIS user terminals; FTTx/PON products; routers; and small base station, CBRS, LTE private networks, and LTE/5G user terminal equipment. The company was founded in 2009 and is based in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "30288",
        "website": "http://www.icbn.com.tw",
        "market_cap": 1888469504
    },
    "6715.TW": {
        "short_name": "LINTES TECHNOLOGY CO LTD",
        "long_name": "Lintes Technology Co., Ltd.",
        "summary": "Lintes Technology Co., Ltd. researches, designs, develops, and manufactures consumer electronics and communication connectivity products worldwide. The company offers active and passive electric cables, adaptors, travel docks, PD chargers, and dongles, as well as active optical and high-speed transmission cables. It serves original equipment manufacturers and original design manufacturers. Lintes Technology Co., Ltd. was founded in 2011 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23553",
        "website": "http://www.lintestech.com",
        "market_cap": 6554999808
    },
    "6820.TWO": {
        "short_name": "ACON OPTICS",
        "long_name": "Acon Optics Communications Inc.",
        "summary": "Acon Optics Communications Inc. designs, manufactures, and sells fiber optical components worldwide. It offers connectors, adapters, patch cords, FTTA cables with mesh cover and angled boot, accessories, fiber optic extenders, fiber optic and copper transceivers, and water repellent materials; MPO/MTP solutions; and data center solutions, such as cassette series, panel series, and cable management. The company was founded in 2017 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "231",
        "website": "http://www.aconoptics.com",
        "market_cap": 601700032
    },
    "8034.TWO": {
        "short_name": "OPNET TECHNOLOGIES CO",
        "long_name": "OPNET Technologies Co., Ltd.",
        "summary": "OPNET Technologies Co., Ltd. designs, manufactures, and markets telecommunication network access and optical transport equipment worldwide. Its access network products include DLC/E1-MUX/IP-MUX, MSAN/SVG, Mini-DSLAM, VoIP gateway, and GPON; and transmission network products comprise CWDM/DWDM/ROADM, carrier grade switching platform, fiber optical multiplexers, TDMo-PSN, Ethernet over PDH, and G.SHDSL.bis bridges/routers. The company also offers enterprise network products, such as EPON; distribution network products that consist of telecom cables, ODF/FDC, FOSC, FDP/FDB, and box panels, as well as accessories; and submarine cable systems, including submarine power, submarine optical fiber, optical fiber composite submarine, special underwater, and high voltage power cables, as well as transoceanic communication system accessories. In addition, the company provides fiber optic sensor solutions; and supports network planning, installation, training, and maintenance services. It serves incumbent fixed-network operators, mobile operators, cable TV operators, utility companies, enterprises, and military entities. The company was founded in 1991 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30075",
        "website": "http://www.opnet.com.tw",
        "market_cap": 1093400064
    },
    "8045.TWO": {
        "short_name": "TWOWAY",
        "long_name": "TWOWAY Communications, Inc.",
        "summary": "TWOWAY Communications, Inc. develops, manufactures, and sells broadband network equipment in Taiwan and North America. The company offers broadband amplifiers and optical workstation equipment under the ACI brand name. It also provides system integration services for network contracting, diagnosis and improvement, and upgradation; and security and monitoring services. In addition, the company offers optical transmission equipment, outdoor light workstations, fiber products, adjustable automatic gain module DSIM, and optical network terminals. TWOWAY Communications, Inc. was founded in 1992 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "24891",
        "website": "http://www.twoway.com.tw",
        "market_cap": 982325632
    },
    "8048.TWO": {
        "short_name": "RUBY TECH CORPORATION",
        "long_name": "Ruby Tech Corporation",
        "summary": "Ruby Tech Corporation manufactures and sells networking products in Taiwan. It offers PoE Ethernet and industrial switches; managed, Web-smart, unmanaged, PoE, mode, and industrial converters; fiber NICs; and OLT and ONU products, and splitters, as well as HW/SW customization services. The company was founded in 1981 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.rubytech.com.tw",
        "market_cap": 1864122368
    },
    "8059.TWO": {
        "short_name": "CASTLENET TECHNOLOGY INC.",
        "long_name": "CastleNet Technology Inc.",
        "summary": "CastleNet Technology Inc. develops, manufactures, and sells network communication equipment in Taiwan. It offers data cable modems, data and EMTA gateway products, and embedded cable modem modules, as well as products in the WAN, LAN, and wireless fields to MSO, telecom, and ISP companies. It also supplies its products to Europe, Japan, and Korea. The company was founded in 1998 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "222004",
        "website": "http://www.castlenet.com.tw",
        "market_cap": 1980488960
    },
    "8089.TWO": {
        "short_name": "COMTREND CORP",
        "long_name": "Comtrend Corporation",
        "summary": "Comtrend Corporation designs and manufactures broadband communication equipment worldwide. The company offers switches, SMB wireless products, powerline and coax adapters, and power over Ethernet products. Comtrend Corporation was founded in 1990 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "241405",
        "website": "http://www.comtrend.com",
        "market_cap": 1604153344
    },
    "8097.TWO": {
        "short_name": "ATW TECHNOLOGY INC",
        "long_name": "ATW Technology Inc.",
        "summary": "ATW Technology Inc. researches, develops, manufactures, and sells wireless communication products in the United States, Europe, and Asia. It offers wireless indoor and outdoor APs/repeaters, including Wi-Fi range extenders and routers; wireless indoor network adapters, which includes Bluetooth speaker adapters, and display and wireless USB dongles; wireless outdoor adapters; indoor signal boosters; and networking adapters, such as Wi-Fi and USB adapters, PCI and PCI-E cards, modems, and modem cards. The company also provides 4G/4.5G products; switch hubs; smart IoT products; dual Wan xDSL 4G Indoor Wi-Fi routers; ADSL routers; routers with VoIP; and VDSL products. In addition, it offers cellular phone peripheral components, power adaptors, IP cameras, etc. The company was formerly known as L&K Precision Technology Co., Ltd. and changed its name to ATW Technology Inc. in September 2013. ATW Technology Inc. was founded in 1986 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "238",
        "website": "http://www.atw.com.tw",
        "market_cap": 625505344
    },
    "8101.TW": {
        "short_name": "ARIMA COMMUNICATION CORP",
        "long_name": "Arima Communications Corp.",
        "summary": "Arima Communications Corp. researches, develops, designs, manufactures, and sells mobile communication and Internet of Things products primarily in Taiwan. Its solutions include mobile devices; tablets; and LTE wearable trackers, smart rearview mirrors, barcode scanners, and RF modules. The company was founded in 1999 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23586",
        "website": "http://www.arimacomm.com.tw",
        "market_cap": 559759424
    },
    "FW3.F": {
        "short_name": "FIH MOBILE LTD  DL-,04",
        "long_name": "FIH Mobile Limited",
        "summary": "FIH Mobile Limited, an investment holding company, provides integrated manufacturing services for the handset industry worldwide. It operates through three segments: Asia, Europe, and America. The company designs, manufactures, distributes, and trades handsets and communication products, as well as offers repair services. It is also involved in the research and development activity. The company was formerly known as Foxconn International Holdings Limited and changed its name to FIH Mobile Limited in May 2013. The company was incorporated in 2000 and is headquartered in New Taipei City, Taiwan. FIH Mobile Limited is a subsidiary of Foxconn (Far East) Limited.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "236",
        "website": "http://www.fihmb.com",
        "market_cap": 1087944448
    },
    "FXCNF": {
        "short_name": "FIH MOBILE LTD",
        "long_name": "FIH Mobile Limited",
        "summary": "FIH Mobile Limited, an investment holding company, provides integrated manufacturing services for the handset industry worldwide. It operates through three segments: Asia, Europe, and America. The company designs, manufactures, distributes, and trades handsets and communication products, as well as offers repair services. It is also involved in the research and development activity. The company was formerly known as Foxconn International Holdings Limited and changed its name to FIH Mobile Limited in May 2013. The company was incorporated in 2000 and is headquartered in New Taipei City, Taiwan. FIH Mobile Limited is a subsidiary of Foxconn (Far East) Limited.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "236",
        "website": "http://www.fihmb.com",
        "market_cap": 1157886592
    },
    "FXCNY": {
        "short_name": "FIH MOBILE LTD",
        "long_name": "FIH Mobile Limited",
        "summary": "FIH Mobile Limited, an investment holding company, provides integrated manufacturing services for the handset industry worldwide. It operates through three segments: Asia, Europe, and America. The company designs, manufactures, distributes, and trades handsets and communication products, as well as offers repair services. It is also involved in the research and development activity. The company was formerly known as Foxconn International Holdings Limited and changed its name to FIH Mobile Limited in May 2013. The company was incorporated in 2000 and is headquartered in New Taipei City, Taiwan. FIH Mobile Limited is a subsidiary of Foxconn (Far East) Limited.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "236",
        "website": "http://www.fihmb.com",
        "market_cap": 1227565440
    }
}