{
    "1617.TW": {
        "short_name": "JUNG SHING WIRE CO",
        "long_name": "Jung Shing Wire Co., Ltd.",
        "summary": "Jung Shing Wire Co., Ltd. manufactures and sells magnet wires in Taiwan. The company offers general magnet wires for motors, transformers, generators, telecommunication, mobiles, auto-controlling, in-house products, electronic apparatus, and aerospace and aviation related equipment; self-bonding magnet wires; and special magnet wires, including ribbon wires, parallel-laid multi-wires, copper-clad aluminum wires, aluminum wires, litz wires, high-tension magnet wires, silver magnet wires, silver- plate magnet wires, and surge resistance magnet wires. Its products are used in motors, coils, and transformers. Jung Shing Wire Co., Ltd. was founded in 1971 and is based in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Tainan City"
    },
    "1618.TW": {
        "short_name": "HOLD-KEY ELECTRIC WIRE & CABLE ",
        "long_name": "Hold-Key Electric Wire & Cable Co., Ltd",
        "summary": "Hold-Key Electric Wire & Cable Co., Ltd manufactures and sells cable products in Taiwan. The company offers XLPE power, electric, aluminum, rubber, communication, fiber optic, EV charging, and LAN cables; cable accessories, such as cable terminations and joints, and power transformers/power capacitors; networking systems; and heat resistance and solar wires. It also exports its products. Hold-Key Electric Wire & Cable Co., Ltd was founded in 1989 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "3048.TW": {
        "short_name": "EDOM TECHNOLOGY CO",
        "long_name": "EDOM Technology Co., Ltd.",
        "summary": "EDOM Technology Co., Ltd. engages in the distribution of electronic parts, computer hardware, software, and equipment in Taiwan and internationally. The company offers analog ICs, batteries, connectors, digital logic ICs, discrete products, embedded modules, memory products, micro components, non-optical sensors, optoelectronics, passive components, test and measurement products, and other products. It has strategic partnership with PollenTech to enable the delivery of integrated HW & SW system solutions. The company serves Internet of things, mobile, consumer electronics, industrial, and automotive sectors. EDOM Technology Co., Ltd. was founded in 1996 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "3528.TW": {
        "short_name": "ANSWER TECHNOLOGY CO. LTD.",
        "long_name": "Answer Technology Co., Ltd.",
        "summary": "Answer Technology Co., Ltd. provides analog, mixed-signal, and digital signal processing integrated circuits (IC) in Taiwan. It also provides USB3.0/3.1, PCIe bridge, and switch ICs; and fabless IC design services, as well as various reference design and technology background for supporting services. In addition, the company designs, manufactures, and ships discrete and embedded magnetoresistive RAM (MRAM) and spin-torque MRAM; and offers circuit protection components and antenna products for computing, communication, consumer electronics, and automotive electronics. Further, it provides optical communications product; broadcast test and measurement equipment; design and consultancy services to broadcast, professional A/V, and image processing companies; packaged infrared sensors used for gas detection, flame detection, and gensture/motion/presence detection; and FPGAs, SoCs, MPSoCs, and 3D ICs, as well as develops various silicon intellectual properties and integrated technologies of system software/hardware. Additionally, the company offers sensor solutions for applications in various industries; Valens HDBaseT technology that provides plug-and-play digital connectivity between HD video sources and remote displays; and design services, and original IP core and application specific solutions, as well as develops ASSPs for motion control of fractional horse power stepper motors and brushless DC motors. Answer Technology Co., Ltd. was founded in 2000 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3702.TW": {
        "short_name": "WPG HOLDINGS LIMITED",
        "long_name": "WPG Holdings Limited",
        "summary": "WPG Holdings Limited distributes semiconductor, electronic, and electrical components in Taiwan, Mainland China, and internationally. The company provides core components, such as chipsets, graphics/audio/video controllers, smartphone chips, network/modem chipsets, CPU/MPU, RISC CPU, etc.; analog IC and mixed signal components, including bipolar, CMOS operational amplifiers, comparators, digital/analog converters, power supply controllers, audio and video amplifiers or controllers, etc.; and discrete logic IC components comprising of diodes, rectifiers, transistors, thyristors, insulated-gate bipolar transistors, optical transistors, logic ICs, etc. It also offers memory components, such as DRAM, SRAM, EPROM, EEPROM, flash, MCP, etc.; optical components, which includes LCD, sensor, LED, etc.; and passive components, connectors, and magnetic components, including resistors, capacitors, inductors, magnetic components, cables, connectors, mechanics, electro mechanics, circuit protection, materials, batteries, filters, oscillators, etc., as well as non-electronic components. In addition, the company operates children theme parks; and engages in the investment activities and general trading business. Further, it offers various value-added services, such as special delivery, market information, technical support and tools, financial support, turnkey solution, warehousing, logistics, and e-commerce services; and computer software, computer and its peripherals, and information products. WPG Holdings Limited was founded in 2005 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "3702A.TW": {
        "short_name": "WPG HOLDINGS LIMITED",
        "long_name": "WPG Holdings Limited",
        "summary": "WPG Holdings Limited distributes semiconductor, electronic, and electrical components in Taiwan, Mainland China, and internationally. The company provides core components, such as chipsets, graphics/audio/video controllers, smartphone chips, network/modem chipsets, CPU/MPU, RISC CPU, etc.; analog IC and mixed signal components, including bipolar, CMOS operational amplifiers, comparators, digital/analog converters, power supply controllers, audio and video amplifiers or controllers, etc.; and discrete logic IC components comprising of diodes, rectifiers, transistors, thyristors, insulated-gate bipolar transistors, optical transistors, logic ICs, etc. It also offers memory components, such as DRAM, SRAM, EPROM, EEPROM, flash, MCP, etc.; optical components, which includes LCD, sensor, LED, etc.; and passive components, connectors, and magnetic components, including resistors, capacitors, inductors, magnetic components, cables, connectors, mechanics, electro mechanics, circuit protection, materials, batteries, filters, oscillators, etc., as well as non-electronic components. In addition, the company operates children theme parks; and engages in the investment activities and general trading business. Further, it offers various value-added services, such as special delivery, market information, technical support and tools, financial support, turnkey solution, warehousing, logistics, and e-commerce services; and computer software, computer and its peripherals, and information products. WPG Holdings Limited was founded in 2005 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "6189.TW": {
        "short_name": "PROMATE ELECTRONIC CO",
        "long_name": "Promate Electronic Co.,Ltd.",
        "summary": "Promate Electronic Co.,Ltd. operates as a franchised distributor of semi-conductor products in Taiwan and internationally. The company distributes electronic components, such as integrated circuits for analog, communication, computer, consumer, display, and LED solutions; and value added design-in services for IT, industrial, and automotive industries. It also provides system integration solutions in the areas of software, optical, mechanical, and electrical engineering integration, as well as product development and manufacturing. In addition, the company offers consumer electronics, such as TFT LCD monitors and TVs, and Netbooks, as well as display and embedded solutions. Promate Electronic Co.,Ltd. was founded in 1986 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "6192.TW": {
        "short_name": "LUMAX INTERNATIONAL CORP",
        "long_name": "Lumax International Corp., Ltd.",
        "summary": "Lumax International Corp., Ltd. engages in the wholesale of electronic materials in Taiwan and China. It sells and installs process-control devices or systems, as well as provides maintenance services. The company also offers process automation consultancy during plant buildup, hardware/system installation, project management, and control valve maintenance for petrochemical, electronic, steel, and other non-tech enterprises; hardware product portfolio for calibration, inspection, and maintenance of control valves, switch valves, measurement instruments, analyzing instruments, and others; and control valve repair services, Lumax valves, and VOC anti-leakage solutions. In addition, it provides telecommunication materials and electronic components. Further, the company engages in international and transit trade, warehousing, and processing activities; producing insulating materials, power supplies, and computer connectors with thermostat and bearing high pressure; and processing thermal transfer materials, tape materials, LCD, etc., as well as provides installation and maintenance services for valves and calibration instruments. Additionally, it manufactures and designs computer systems and measuring appliance industry automation instruments; installs mechanical and electrical equipment; imports and exports goods and technology products; and provides assembly, repair, and instrument calibration of mechanical/electrical products. Lumax International Corp., Ltd. was founded in 1975 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei City"
    },
    "OMPS": {
        "short_name": "OMPHALOS CORPORATION",
        "long_name": "Omphalos, Corp.",
        "summary": "Omphalos, Corp. manufactures and supplies a range of equipment and parts for printed circuit board manufacturers in Taiwan and China. It offers reflow soldering ovens and automated optical inspection machines. The company is based in Taoyuan City, Taiwan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    }
}