{"003019.SZ": {"short_name": "TES TOUCH EMBEDDED", "long_name": "TES Touch Embedded Solutions (Xiamen) Co., Ltd.", "summary": "TES Touch Embedded Solutions (Xiamen) Co., Ltd., a JDM/ODM company, engages in the research, development, design, manufacture, and sale of touchscreen products in Taiwan and internationally. The company's products include open frame monitors, touch display modules, desktop monitors, panel PCs/AiO systems, KIOSK/SCO, digital signage solutions, box PCs, and PCBA. It offers products for smart retail, digital signage, healthcare, financial, and embedded applications in industry, business, hospitality, medical, financial, retail point-of-sale, and other fields. The company was founded in 2015 and is headquartered in Taipei City, Taiwan.", "currency": "CNY", "sector": "Technology", "industry": "Electronic Components", "exchange": "SHZ", "market": "cn_market", "country": "Taiwan", "city": "Taipei City"}, "0FJ.F": {"short_name": "FOXCONN IN.T.DL-,01953125", "long_name": "FIT Hon Teng Limited", "summary": "FIT Hon Teng Limited engages in the design, development, production, and sale of interconnect solutions and related products in Taiwan, Mainland China, the United States, Hong Kong, Singapore, and internationally. The company offers cable components, including an array of input/output (I/O) cable assemblies, as well as wire harness and power cords. It also provides connector components comprising I/O connectors, sockets, SAS connectors, power and backplane connectors, memory/edge cards, terminal blocks, and wire to board/board to board connectors. In addition, the company offers optical modules, such as active optical cables, optical transceiver, and embedded optical modules. Further, it provides radio frequency antenna cable and module assemblies; wireless charging products and components; and accessories, such as headsets, speaker systems, and power and cable accessories. The company's interconnect solutions provide functionality to computer and consumer electronics, mobile and wireless devices, and communications infrastructure, including cloud computing, as well as other end markets, such as automotive, industrial, and medical. It also engages in the structure cabling, installation, and maintenance of intelligent control system, as well as research, development, and manufacture of batteries. The company was formerly known as New Wing International Holdings Limited and changed its name to FIT Hon Teng Limited in June 2013. The company was founded in 2013 and is headquartered in New Taipei City, Taiwan. Foxconn FIT Hon Teng Limited is a subsidiary of Foxconn (Far East) Limited.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "Taiwan", "city": "New Taipei City"}, "1582.TW": {"short_name": "SYNCMOLD ENTERPRISE CORP", "long_name": "Syncmold Enterprise Corp.", "summary": "Syncmold Enterprise Corp. manufactures and sells LCD/LED monitor stands and plastic molding products in Taiwan. The company offers stands and hinges; and injection and molding products. It designs and manufactures plastic molds and plastics injection; engages in the assembling of monitor, AIO, and TV stand products as well as manufactures metal stamping and metal die-casting products, and parts of monitor stands. The company was formerly known as Syncmold Ltd. and changed its name to Syncmold Enterprise Corp. in 1988. Syncmold Enterprise Corp. was founded in 1979 and is based in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "2313.TW": {"short_name": "COMPEQ MANUFACTURING", "long_name": "Compeq Manufacturing Co., Ltd.", "summary": "Compeq Manufacturing Co., Ltd. manufactures and sells printed-circuit boards (PCBs) in Taiwan, the United States, Asia, Europe, and internationally. It provides regular multi-layered, high density interconnection, high layer count, flexible, and rigid-flex PCBs, as well as surface mount devices; and offers module assembly services. The company was founded in 1973 and is headquartered in Taoyuan City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "2316.TW": {"short_name": "WUS PRINTED CIRCUIT CO", "long_name": "WUS Printed Circuit Co., Ltd.", "summary": "WUS Printed Circuit Co., Ltd. engages in the manufacture and sale of various printed circuit boards in Taiwan. The company offers multilayer and mobile phones boards. It also provides communication RF modules, embedded passives, and high-density microvia (HDI) products. Its products are used in add-on cards, motherboards, telecom products, radio base stations, mobile phones, digital cameras, notebooks, and other digital and entertainment products. WUS Printed Circuit Co., Ltd. was founded in 1972 and is based in Kaohsiung, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Kaohsiung"}, "2327.TW": {"short_name": "YAGEO CORP", "long_name": "Yageo Corporation", "summary": "Yageo Corporation manufactures and sells passive components worldwide. The company offers automotive, current sensing, sulfur resistant, thin film precision, thick film precision, thick film general purpose, array/network, high voltage, surge, lead free, MLV, Ni/Au termination, RF attenuator, and trimmable chip resistors; and MLCCs, such as general purpose, automotive, high voltage, high capacitance, array, low inductance, high-frequency, and soft termination capacitors. It also provides through-hole resistors comprising carbon film, metal film, metal glazed film, metal oxide film, zero and low ohmic, jumper wire, cement, aluminum housed, wire wound, and other resistors; and wireless components consisting of PCB/FPCB antennas, metal antennas, ceramic patch antennas, ceramic chip antennas, and active antennas that address WWAN, WLAN/BT/ISM, GNSS, and Sub-GHz/short-range technologies, LTCC filters, and X2Y. In addition, the company offers electrolytic capacitors, including miniature, screw terminal, surface mount, snap-in, and polymer capacitors; and inductors and coils, such as chip beads, multilayer chip inductors, wire wound chip inductors, and power inductors. Further, it provides circuit protection solutions, including overvoltage protection components, such as TVS, MOV, GDT, SPG, ESD, and TSS; and overcurrent protection components, such as PPTC and NTC. Additionally, Yageo Corporation offers logistics and electronic data interchange services, as well as operates an e-commerce portal. The company offers its products for various applications, including consumer electronics, computers and peripherals, telecommunications, industrial, automotive, and alternative energy applications. It serves EMS, ODM, and OEM customers, as well as distributors. Yageo Corporation was founded in 1977 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "2328.TW": {"short_name": "PAN INTERNATIONAL INDUSTRIAL", "long_name": "Pan-International Industrial Corp.", "summary": "Pan-International Industrial Corp. provides electronic manufacturing services to technology companies worldwide. It offers integrated manufacturing services for bulk wires, cables, and connectors; cable assemblies; printed circuit board fabrications; printed circuit board assemblies; and turnkey systems assemblies. The company also provides engineering services and logistics services. It serves the automotive, communications, computing, consumer, industrial, and healthcare markets. Pan-International Industrial Corp. was founded in 1971 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "2355.TW": {"short_name": "CHIN-POON INDUSTRIAL", "long_name": "Chin-Poon Industrial Co., Ltd.", "summary": "Chin-Poon Industrial Co., Ltd. engages in the manufacturing, trading, and selling of printed circuit boards(PCB), electronic materials, and insulation boards in Taiwan, Germany, China, the United States, Hungary, and internationally. The company offers HDI products for mobile phone, PDA, V8, and digital camera applications; and double side, single side, heavy copper, and multi-layer boards, as well as sliver and carbon jumpers for consumer, telecom, computer peripheral, industrial, and aero industrial applications. It also provides silver through hole boards for telecom and computer peripheral applications; copper though hole boards for consumer applications; and metal PCB products for power supply, ABS, engine control module, lighting fixture, and back light module applications. In addition, the company imports and exports its products. Chin-Poon Industrial Co., Ltd. was founded in 1979 and is headquartered in Taoyuan, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "2359.TW": {"short_name": "SOLOMON TECHNOLOGY CORP", "long_name": "Solomon Technology Corporation", "summary": "Solomon Technology Corporation operates as an electronic components sales agency primarily in the Asia-Pacific region and China. The company offers automation products, including software, signal conditioner, sensor and switching, relay and timer, button and signaling device, power, motion control, illumination control, energy monitoring, connection device, condition monitoring, security, industrial Ethernet and communication, motor control, I/O module, computer and operator interface, circuit and load protection, inverter and motor, and programmable controller products. It also provides intellectual automation products, such as industrial networking device data acquisition systems; machine vision products; system integration products comprising robot automatic wear belt machines, robot tracking synchronization system, glue dispensing machine, and pickÂ\u0096up and down trolley; industrial networking products; robotic arms and finger adaptive gripper products for robot applications. In addition, the company offers LCD products; various electronic components; and ODM, OEM, light control, trash can, hand dryer, and soap dispenser products, as well as accessories. Solomon Technology Corporation was founded in 1973 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "2368.TW": {"short_name": "GOLD CIRCUIT ELECTRONICS CO", "long_name": "Gold Circuit Electronics Ltd.", "summary": "Gold Circuit Electronics Ltd. manufactures and sells computer-related products worldwide. It offers servers, workstations, notebook personal computers, desktop personal computers, etc. The company's products are used in telecommunication, networking, cell phones, high-current power supplies, storage, automotive, and other fields. Gold Circuit Electronics Ltd. was founded in 1981 and is headquartered in Taoyuan City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "2374.TW": {"short_name": "ABILITY ENTERPRISE CO LTD", "long_name": "Ability Enterprise Co., Ltd.", "summary": "Ability Enterprise Co., Ltd. operates as an ODM/OEM for optical and image input devices. The company offers consumer imaging products, such as digital still, sports, and wearable cameras; imaging system products comprising edge AI, AIoT, home, and 3D depth and machine vision cameras; and camera modules, including high-end camera modules, gesture recognition systems, and automotive camera systems. It serves customers primarily in the United States, Brazil, Europe, China, and Japan. The company was founded in 1965 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "2375.TW": {"short_name": "KAIMEI ELECTRONIC CORP", "long_name": "Kaimei Electronic Corp.", "summary": "Kaimei Electronic Corp. manufactures and sells capacitors and motor fans. Its products include conductive polymer aluminum solid, conductive polymer hybrid, and aluminum electrolytic capacitors; and DC fans, DC blowers, AC fans, and accessories. The company sells its products in approximately 60 countries worldwide. Kaimei Electronic Corp. was founded in 1978 and is based in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "2392.TW": {"short_name": "CHENG UEI PRECISION INDUSTRY CO", "long_name": "Cheng Uei Precision Industry Co., Ltd.", "summary": "Cheng Uei Precision Industry Co., Ltd. designs, manufactures, and sells connectors, cable assemblies, power management devices, and battery packs to communication devices, computers, and consumer electronics manufacturers worldwide. It also provides FPCs; camera modules; plastic and metal parts, including adapter shells, connector parts, charger shells, USB storage, and double injection parts; and audio products, such as wired headsets and headphones, wireless headphones, speakers, and Bluetooth audio adapters. In addition, the company offers power banks, adapters, and supply products, as well as batteries; wearable devices and sports sensors; Internet of Things; optical lens for mobile phone, NB, PC, projector, automobile, etc., as well as mega pixel lens and lens modules; computer memory modules, flash memory storage devices, and peripherals; and power management services to electricity industry. Further, it provides OEM/ODM for image related products, including LCD monitors, MFPs, scanners, LCD projectors, and printing devices; and power supply cord sets, AC extension cords, traveler kits, and adaptor plugs. Additionally, the company offers accessories, including gaming controllers, docking stations, webcams, wireless mouses, automobile gadgets, remote controls, and card readers; battery modules, battery management systems, and automotive products; and USB, mini coaxial, thunderbolt, lightning, HDMI, mouse, and monitor cables, as well as dongles. It also operates a store, which offers a range of Apple products; and engages in automotive electronic product manufacturing, including automotive electronics parts, automotive air-conditioning electronic sensors and automotive navigation systems OEM/ODM, and lithium ion battery solutions for electric vehicles and hybrid electric vehicles. The company was founded in 1986 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "2402.TW": {"short_name": "ICHIA TECHNOLOGIES INC", "long_name": "Ichia Technologies, Inc.", "summary": "Ichia Technologies, Inc. manufactures and sells electronic components worldwide. The company offers single sided, double sided, and multi-layer FPC boards for applications in consumer, industrial, optical fiber communication, and automotive products; and plastic, silicon rubber, and plastic + silicon rubber modules for automotive parts. It also provides FPC and MVI total solutions, auto parts solutions, wearable device solutions, and water proof products. The company was founded in 1983 and is headquartered in Taoyuan, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan"}, "2409.TW": {"short_name": "AU OPTRONICS CORPORATION", "long_name": "AU Optronics Corp.", "summary": "AU Optronics Corp. designs, develops, manufactures, assembles, and sells thin film transistor liquid crystal displays (TFT-LCDs) and other flat panel displays. The company operates in two segments, Display and Energy. The Display segment designs, develops, manufactures, assembles, and markets flat panel displays for use in televisions, monitors, mobile PCs and devices, automobiles, industrial PCs, automated teller machines, point of sale terminals, pachinko machines, medical equipment, etc. This segment serves original equipment manufacturing service providers; and brand companies. The Energy segment manufactures and sells solar materials, including ingots, solar wafers, and solar modules, as well as provides technical engineering and maintenance services for solar system projects. This segment sells its ingot and solar wafer products primarily to solar cell manufacturers; and solar modules to installers, solar system integrators, property developers, and other value-added resellers. The company also sells and leases content management system and hardware; plans, designs, and develops construction for environmental protection and related project management; and manufactures and sells TFT-LCD modules and panels, TV sets, backlight modules, automotive parts, precision plastic parts, and motorized treadmills. In addition, it develops and sells software and hardware for health care industry; provides software and hardware integration system and equipment relating to intelligent manufacturing, as well as related consulting services; and engages in venture capital investment activities. The company operates in the People's Republic of China, Taiwan, Japan, Singapore, and internationally. AU Optronics Corp. was founded in 1996 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "2428.TW": {"short_name": "THINKING ELECTRONIC INDL", "long_name": "Thinking Electronic Industrial Co., Ltd.", "summary": "Thinking Electronic Industrial Co., Ltd. provides various protective circuit components. It offers over-voltage, over-temperature, and over-current protection components. The company's products portfolio includes negative temperature coefficient, ceramic positive temperature, and polymer positive temperature coefficient thermistors; zinc oxide varistors; temperature sensors; gas discharge tubes; ESD suppressors; TVS diodes; and spark gap protectors. Its products are used in automotive electronics, telecom equipment, smart home appliances, power supply, consumer electronics, lighting, security, renewable energy, and medical applications. The company distributes its products in Asia, Europe, and the Americas. Thinking Electronic Industrial Co., Ltd. was founded in 1979 and is based in Kaohsiung City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Kaohsiung City"}, "2429.TW": {"short_name": "PAL WONN (TW)CO.LT", "long_name": "Abonmax Co., Ltd", "summary": "Abonmax Co., Ltd manufactures and sells double-sided and multi-layer circuit boards in Taiwan and internationally. It offers interactive whiteboards, flash drives and micro SD cards, and SSD products. The company was formerly known as Pal Wonn (Taiwan) Co., Ltd. and changed its name to Abonmax Co., Ltd in December 2017. Abonmax Co., Ltd was founded in 1978 and is based in Taoyuan City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "2456.TW": {"short_name": "CHILISIN ELECTRONICS CORP", "long_name": "Chilisin Electronics Corp.", "summary": "Chilisin Electronics Corp. manufactures and sells inductors worldwide. The company offers power inductors, EMI-common mode chokes, EMI-beads, RF-signal inductors, RF-passives/antennas, RF-wireless power transformers, LAN transformers, and resistors and current sensors. Its products are used in automotive, industrial server/datacenter, communication, mobile and tablet, computer/laptop, and consumer applications. The company was founded in 1972 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu"}, "2459.TW": {"short_name": "AUDIX CORP", "long_name": "Audix Corporation", "summary": "Audix Corporation manufactures and distributes electronic components. The company manufactures electronic components, such as relays, transformers, chokes, and couplers; precision molds and finished products, including precision pressing molds and products; precision coupler parts, plastic parts for electronics and electric appliances, and plastic parts for medical devices; and coupler assemblies. It also designs, develops, and manufactures automated production equipment for CCFL and electronics; and equipment and jigs for the assembly of automobile components, as well as offers electronic switches for automobiles. In addition, the company distributes electronic components of various brands to semiconductor and consumer electronic product manufacturers. Further, it offers services for safety verification and EMC authentication, as well as for the development of software/hardware products; anechoic chamber design and construction services; and chemistry examination services. The company operates in Taiwan, Hong Kong, China, and Japan. Audix Corporation was founded in 1980 and is based in Taipei, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "2472.TW": {"short_name": "LELON ELECTRONICS", "long_name": "Lelon Electronics Corp.", "summary": "Lelon Electronics Corp. develops, manufactures, and markets electrolytic capacitors worldwide. Its electrolytic capacitors include aluminum electrolytic capacitors, such as radial, leaded, SMD, snap-in, and screw terminal; organic conductive polymer capacitors; conductive polymer hybrid capacitors; and flame retardants. The company also produces formed aluminum foils and automatic manufacturing equipment. Its products are used in automotive electronics, telecommunication, cloud computing, and power electronics application. The company was founded in 1976 and is headquartered in Taichung, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung"}, "2484.TW": {"short_name": "SIWARD CRYSTAL TECHNOLOGY CO", "long_name": "Siward Crystal Technology Co., Ltd.", "summary": "Siward Crystal Technology Co., Ltd. manufactures and sells crystal and oscillator solutions worldwide. The company offers tuning fork ceramic SMD products; crystal products, such as metal DIP and SMD, ceramic SMD, and glass weld SMD products; oscillator ceramic SMD products; automotive, TCXO, VCTCXO, and VCXO ceramic SMD products; and RFID PCB tag and inlay/label products. Its products are used in various applications, such as mobile communication, tablet PCs, GPS, computer clocks, DSC, AV machines, etc. Siward Crystal Technology Co., Ltd. was founded in 1988 and is headquartered in Taichung City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung City"}, "2486.TW": {"short_name": "I-CHIUN PRECISION INDUSTRY CO", "long_name": "I-Chiun Precision Industry Co., Ltd.", "summary": "I-Chiun Precision Industry Co., Ltd. develops, manufactures, and sells high-tech precision electronics and related applications worldwide. The company offers optoelectronic lead frames, miniature electrical products, small motors, and 3C products, as well as components for 3C products, such as mobile phones, PDAs, computers, automobiles, office automation equipment, stereos, home appliances, communication equipment, cameras, and medical devices. It also provides SMD LED products for use in mobile phones, notebook computer displays, TV back lights, and streetlights; plug-in lamp LED products for use in remote controls, flashlights, signboards, and traffic signals; and photo coupler products to protect electronic components in household appliances, such as transistors. In addition, the company offers LCD products, including lamp reflectors and covers, front and back bezels, and ground clips for use in global positioning systems, digital cameras, LCD products, and notebook computers. Further, it provides heat spreaders, such as flip chip-lids/rings, flip chip-hats, and flip chip-flat tops. The company was founded in 1977 and is based in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "3008.TW": {"short_name": "LARGAN PRECISION CO", "long_name": "LARGAN Precision Co.,Ltd", "summary": "LARGAN Precision Co.,Ltd, together with its subsidiary, designs, manufactures, and sells photographic and optical equipment. The company offers optical lenses, which are used in perspective mirror, single and double binoculars, fax machines, microscope, scanners, multifunction printers, mobile phone lenses, drone camera lenses, mobile 3D structured light lenses, tablets, motion-controlled gaming systems, laptop computer lenses, smart TV lenses, IP camera lenses, and automobile lenses. It also engages in the die manufacturing; wholesale of precision instruments; and medical materials and equipment manufacturing. The company was founded in 1987 and is headquartered in Taichung, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung"}, "3011.TW": {"short_name": "JI-HAW INDUSTRIAL CO", "long_name": "Ji-Haw Industrial Co.,Ltd.", "summary": "Ji-Haw Industrial Co., Ltd. engages in the research, manufacture, and marketing of information technology and communication cords and connectors in Taiwan, China, and Thailand. The company offers electronic external and internal cables; single and multiple function dongles; low voltage differential signaling cables; flexible flat cables; and fiber optics passive components, as well as cables and wires for induction systems, steering wheels and systems, automatic sunroofs, cooling fan engines, and seat belt systems. It also provides audio and video cables that include DVI, DisplayPort, HDMI, and VGA cables. In addition, the company offers ceramic ferrules for fiber optic connectors, flexible flat cables, fiber optic patch cords, digital multi-media products, and IT devices. The company was founded in 1983 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "3023.TW": {"short_name": "SINBON ELECTRONICS CO LTD", "long_name": "SINBON Electronics Co., Ltd.", "summary": "SINBON Electronics Co., Ltd. manufactures and sells computer peripherals, connectors, wires, and other parts in Mainland China, the United States, Taiwan, and internationally. The company operates through Cable, Electronic, and Management operation segments. It offers PCMIA signal cables, computers and peripherals I/O cables, USB link cables, flat cables, barcode scanner I/O interface modules, LCD flex boards, and LCD ultra-thin co-axial signal cables; various types of connectors used in network communications, computer peripherals, and consumer electronic products; and sweep receivers, USB pen drives, and consumer electronic products. The company also provides power rectifiers; mobile phone link cables, mobile phone connectors, and wireless antennas; RFID; fiber optic connectors, as well as LED, LCM, and high-frequency co-axial cables; and parts of automotive, medical health, and industrial products. It serves medical health, automotive and aviation, green energy, and communication industries, as well as industrial applications. The company was founded in 1989 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "3026.TW": {"short_name": "HOLY STONE ENTERPRISE", "long_name": "Holy Stone Enterprise Co.,Ltd.", "summary": "Holy Stone Enterprise Co.,Ltd. manufactures and sells multilayer ceramic capacitors (MLCCs) under the HEC brand name worldwide. The company offers its MLCCs for PoE circuits, switching power supplies, battery management systems, automotive touchscreen LCD modules, LED lightings, termination MLCCs, trackpads, SAR P-sensors, RF filters, e-compasses, ambient lights/proximity sensors, crystals, and oscillators, and PIR infrared detectors. It also distributes other active and consumer electronics components; and IC, peripheral, and power components, as well as memory products. Holy Stone Enterprise Co.,Ltd. was founded in 1981 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "3037.TW": {"short_name": "UNIMICRON TECHNOLOGY", "long_name": "Unimicron Technology Corp.", "summary": "Unimicron Technology Corp. engages in the development, manufacturing, processing, and sale of printed circuit boards, electrical equipment, electronic products, and testing and burn-in systems for integrated circuit products worldwide. It also provides IC testing and pre-burning, conducting IC testing and burn-in processes, screening out defective ICs, and backend services for packaging and testing processes; and HDIs, FPCs, RFs, and IC carriers, as well as connectors, and TP and ECRM. The company was founded in 1990 and is headquartered in Taoyuan City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "3042.TW": {"short_name": "TXC CORPN", "long_name": "TXC Corporation", "summary": "TXC Corporation engages in the research, design, development, production, and sale of crystal and oscillators products in Taiwan and internationally. The company's products include crystals, oscillators, and sensors, as well as automotive crystals. Its products are used in various applications, including mobile communication, wearable devices, Internet of Things, server, storage, automotive, telecommunication, and medical devices. TXC Corporation was founded in 1983 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "3044.TW": {"short_name": "TRIPOD TECHNOLOGY CORP", "long_name": "Tripod Technology Corporation", "summary": "Tripod Technology Corporation processes, manufactures and sells printed circuit boards (PCBs) boards and other related components in Taiwan, China, Vietnam, Thailand, South Korea, Malaysia, and internationally. The company offers various PCBs for memory modules, TFT-LCDs, hard disk drives, notebook computers, and server/work stations, as well as handsets and automotive products; and other services. It also engages in the manufacture and wholesale of chemical materials and electronic parts; trading of PCBs and raw materials of electronic parts; manufacture of electronic cash registers; and wholesale, import, and export of electronic products. In addition, the company is also involved in the development, sale, and rental of commercial housing and own-built commercial housing; and investment activities. Further, it provides management services. Tripod Technology Corporation was founded in 1991 and is headquartered in Taoyuan, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "3049.TW": {"short_name": "HANNSTOUCH SOLUTION INCORPORATE", "long_name": "HannsTouch Solution Incorporated", "summary": "HannsTouch Solution Incorporated engages in the production and sale of touch panels in Taiwan. It offers touching solutions for AMOLED and LCD monitors, wearable devices, cellphones, tablets, laptops, one-piece forming PC and industrial monitors, etc.; and TFT backplane solutions for RFID, E-book, E-board, etc. The company was founded in 1999 and is based in Tainan City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Tainan City"}, "3060.TW": {"short_name": "MIN AIK TECHNOLOGY", "long_name": "Min Aik Technology Co., Ltd.", "summary": "Min Aik Technology Co., Ltd. engages in the manufacturing of ultra-clean and precision components for the hard disk drive industry in Taiwan. The company provides clean room assembly, tooling design fabrication, sheet metal precision stamping tumbling plating, plastic injection molding, and in-house automation design and fabrication solutions, as well as chemical lab facilities and, QA system. It offers OEM/ODM services; contract design services; measurement and analysis services; and strategic integration services to companies in the computer, networking, communications, consumer, and medical industries. The company was incorporated in 1979 and is headquartered in Taoyuan, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "3229.TW": {"short_name": "CHEER TIME ENTERPRISE CO", "long_name": "Cheer Time Enterprise Co., Ltd", "summary": "Cheer Time Enterprise Co., Ltd manufactures and sells printed circuit boards in Taiwan. The company offers high density interconnect, teflon, ceramics, load board, aluminum single/double layer, and rigid-flex boards, as well as special process products, such as copper plated on board edges, blind drill holes, countersink/counterbore holes, plated castellated holes, and VIA IN/ON PAD. Its products are used in various industries, such as GPS, LED, automobile, light bar, load board (DUT board), IP CAM, industrial computer, etc. The company was founded in 1987 and is based in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "3305.TW": {"short_name": "SHENMAO TECHNOLOGY INC", "long_name": "Shenmao Technology Inc", "summary": "Shenmao Technology Inc. manufactures and sells solder materials for the electronic industry worldwide. It offers SMT assembly materials, including tin lead, lead-free, water soluble, package on package, low temperature, and halogen free solder pastes, as well as adhesives; and semiconductor packaging materials, such as BGA spheres and bumping solder pastes. The company also provides wave solder assembly products comprising solder bars, cored solder wires, lead free solder wires, and halogens free solder wires; liquid fluxes; solder preforms and ribbons; and PV ribbons. Shenmao Technology Inc. was founded in 1973 and is headquartered in Taoyuan, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "3311.TW": {"short_name": "SILITECH TECHNOLOGY CORPORATION", "long_name": "Silitech Technology Corporation", "summary": "Silitech Technology Corporation engages in the manufacture and sale of modules and rubber (plastic) products in China, Malaysia, Taiwan, the United States, India, and internationally. It offers various products, including mobile keypads, cover glasses, modules, auto parts, lighting modules, and accessories. The company's products are used in wearable device, automotive component, communication supply, and toy product applications. Silitech Technology Corporation was founded in 2001 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "3321.TW": {"short_name": "UNIFLEX TECHNOLOGY INC", "long_name": "Uniflex Technology Inc.", "summary": "Uniflex Technology Inc. designs, manufactures, and sells flexible printed circuit (FPC) boards in Taiwan. It offers single-sided, double-sided, double access, and multi-layer FPC boards for use in various applications, such as information technology, communication, consumer electronics, automotive, medical equipment, and industrial equipment. The company was founded in 1990 and is based in Taoyuan, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan"}, "3338.TW": {"short_name": "TAISOL ELECTRONICS CO", "long_name": "TaiSol Electronics Co., Ltd.", "summary": "TaiSol Electronics Co., Ltd. designs, manufactures, and sells thermal management, connectors, and mobile commerce solutions in Taiwan, China, Japan, and the United States. The company offers passive and active thermal management products, including cold forged, extruded, folded fin, die-cast, brazing, and heat pipe/vapor chamber heat sinks, as well as thermal solutions for PCs, laptops, tablets, smart mobile divides, etc. It also provides semiconductor thermal management solutions, such as DT, AIO, and NB thermal modules, as well as cooling solutions for server and cloud computing applications; light-emitting diode (LED) and laser diode cooling solutions, and LED downlight and stage light cooling solutions; and optical communication and telecom cooling solutions. In addition, the company offers industrial application cooling solutions; power inverter cooling solutions; industrial robots; and control rack heat exchangers, as well as heat pipe products, including multiple heat pipes, embedded heat pipes, high-power heat pipes, vapor chambers, and looped heat pipes. Further, it provides computer electrical and electronic connectors. TaiSol Electronics Co., Ltd. was founded in 1994 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "3416.TW": {"short_name": "WINMATE COMMUNICATION INC", "long_name": "WinMate Inc.", "summary": "WinMate Inc. manufactures and sells industrial displays and touch screens worldwide. The company offers rugged mobile solutions, including rugged mobile computers and tablets, and ultra rugged tablets; rugged industrial systems, such as industrial panel PCs and application ready panel PCs, multi-touch HMI and chassis HMI, self-interactive KIOSK, and IP67; and rugged industrial displays, including USB type-C displays, power over ethernet touch monitors, multi touch displays, sunlight readable displays, temperature displays, rack LCD/ 1Uconsole drawer, medical grade 4K and multi touch monitors, and LCD scale boards. Its rugged embedded computing products comprise IoT gateway, single board computers, EAC PRO, M-series and marine EAC box PC, 2U-rack IPC, and DIN rail, as well as ARM, fan less, standard, and full IP65 box PCs; vehicle mounted computers include FM07 series, M101BK, FM08, FM10, FM10Q, and FM10A; and digital signage and bartype products consist of open pluggable specification modules, digital signage and bartype panel PCs, digital signage box PCs, embedded players, and bartype displays. In addition, the company offers healthcare solutions, such as healthcare grade 4K monitors, multi-touch monitors, and mobile solutions. The company serves industrial IIoT and edge computing, healthcare, food, beverage and chemical, retail, oil and gas, vehicle diagnostic, warehouse and logistics, marine, military, field services, heavy duty, factory automation, railway, smart-grid, and public safety industries. WinMate Inc. was founded in 1996 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "3481.TW": {"short_name": "INNOLUX CORPORATION", "long_name": "Innolux Corporation", "summary": "Innolux Corporation, together with its subsidiaries, researches, designs, develops, manufactures, and sells TFT-LCD panels, modules, and monitors of liquid crystal displays (LCD), color filters, and low temperature poly-silicon TFT-LCDs. It offers TFT-LCD panel modules and open cells for LCDs, billboards, desktop monitors, and notebooks, as well as for small and medium size products that are used to manufacture tablet computers, portable audio players, GPS for automobiles, aviation, smart home, and mobile phones. The company also provides various touch panels, including glass/glass capacitive, glass/film/film capacitive, and one glass capacitive touch panels. In addition, it imports and exports LCD display and electronics parts, as well as provides products for medical, industrial, and educational purposes. Further, the company is involved in the research, development, testing, and maintenance activities; and distribution, general investment, and storage businesses. It operates in Taiwan, China, Hong Kong, Europe, the United States, and internationally. Innolux Corporation has a strategic collaboration with E Ink Holdings Inc. to focus on expanding electronic paper products in IoT and smart city applications. The company was formerly known as Chimei Innolux Corporation and changed its name to Innolux Corporation in December 2012. Innolux Corporation was founded in 2003 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "3533.TW": {"short_name": "LOTES CO LTD", "long_name": "Lotes Co., Ltd", "summary": "Lotes Co., Ltd designs, manufactures, and sells connectors and CPU sockets for notebook and personal computers, mobile electronic devices, etc. under the LOTES brand in Taiwan, Mainland China, and internationally. The company's products include slot/edge card connectors; I/O series connectors, such as SlimSAS, OcuLink, optical fiber connectors, audio jack, RJ45, display port, HDMI, SATA/SAS, USB, Gen Z connectors, and sim card connectors; USB, fan, wire harness, DC and other cables; and battery connectors and holders. It also offers automotive connectors; and other products comprising of RF, BTB, FPC, and power connectors, as well as SPI sockets. In addition, the company researches and develops, and manages electronic components and assemblies, calculator parts, molds, plastic raw materials, industrial robots, intelligent floor sweeping robots and components, and industrial cameras, as well as import and export of goods and technologies; provides electrical and audio -visual electronic products; and develops and produces optical communication measuring instruments and optical transceivers, and related technical services. Further, it engages in property development, home rental, landscaping, and interior decoration activities; reinvestment activities; and offers surface treatment for various hardware and plastic products. Lotes Co., Ltd was founded in 1986 and is headquartered in Keelung, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Keelung"}, "3536.TW": {"short_name": "SINTRONIC TECHNOLOGY INC.", "long_name": "Sintronic Technology Inc.", "summary": "Sintronic Technology Inc. engages in the research and development, manufacture, and sale of precision ceramics and UVC sterilization products worldwide. The company offers life medical products, such as medical face masks; UVC products, including sterilization tumblers, UVC LED water sterilizers, and UVC mini sterilizers; and precision ceramics for material applications. It serves customers in opto-electronics industry. The company was formerly known as MIT Advanced Technology Inc. and changed its name to Sintronic Technology Inc. in November 2004. Sintronic Technology Inc. was founded in 2000 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "3543.TW": {"short_name": "JOCHU TECHNOLOGY CO LTD", "long_name": "Jochu Technology Co., Ltd.", "summary": "Jochu Technology Co., Ltd. primarily develops and manufactures optronics metal components in Taiwan and internationally. The company offers metal bezels and metal back covers. It also undertakes metal works of household furniture; and provides assistive devices of movement for elderly and disabilities, exoskeletons for heavy workload personnel, and household health care products. The company was founded in 2000 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "3563.TW": {"short_name": "MACHVISION INC.", "long_name": "Machvision Inc.", "summary": "Machvision Inc. develops and sells machine vision systems for semiconductor and printed circuit board (PCB) industry in Taiwan. The company provides drilling and routing measuring series products, including Hole-AOI systems that measure the position, diameter, and roughness of a drilled hole; and EZ3D system, which is designed to perform automatic and accurate dimensional measuring systems. It also offers IC substrate, HDI, and FPCB inspection and measuring series products, such as 3D AOI systems, solid measuring viewers, and LaserVia AOIM inspection systems; AFI, FPCB AVI, and Wafer AVI inspecting systems; and CSPAFI integrating AOI+AVI algorithm and fast-capturing-multi-illumination optical systems. In addition, the company provides wiring inspection series, which includes circuit AOI system for PCB/FPC, verification, and repair; ArtWork AOI products; and LineGauge systems for use in optical measurements and QC reporting applications. Machvision Inc. was founded in 1998 and is headquartered in Hsinchu City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "3593.TW": {"short_name": "LOGAH TECHNOLOGY CORP.", "long_name": "Logah Technology Corp.", "summary": "Logah Technology Corp. engages in the design, development, and manufacture of professional precision molds, precision plastic parts forming, spraying, printing, hot-melting, automatic pinning, electroplating, and assembly products in Taiwan. The company also offers two-color, nitrogen, in-mold, RHCM cold and hot high-gloss molding products. In addition, it provides plastic shell products, such as household appliances, outdoor sports equipment, LCD TVs, AIO computers, electroacoustic, Netcom, power supplies, car materials, etc.; and automotive interior and energy parts, speakers, tablets, vacuum cleaners, mobile phones, headphones, chargers, and power banks. Logah Technology Corp. was founded in 2003 and is headquartered in Kaohsiung, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Kaohsiung"}, "3605.TW": {"short_name": "ACES ELECTRONIC CO. LTD.", "long_name": "ACES Electronics Co., Ltd.", "summary": "ACES Electronics Co., Ltd. researches, develops, manufactures, and sells electronic connectors Taiwan and internationally. It offers board to board, wire-to-board, FFC/FPC, card, pin header, mini and micro luck, RJ, power, SATA, SAS, universal serial bus (USB), and USB type C connectors. The company also provides battery and high definition multimedia interface connectors; DC power jacks; and camera modules, device and harness, and EV products. Its products are used various applications, such as transportation, telecom/datacom, computer and peripherals, industrial, medical, smart home appliances, cloud computing and server, automotive, and consumer electronics. ACES Electronics Co., Ltd. was founded in 1996 and is headquartered in Taoyuan City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "3645.TW": {"short_name": "TAIMIDE TECH INC", "long_name": "Taimide Tech. Inc.", "summary": "Taimide Tech. Inc. engages in the manufacture and sale of polyimide films (PI) in Taiwan and China. The company provides a range of polyimide films for use in flexible printed circuit boards (FPCB), coverlays, stiffeners, composited PIs, 3L FCCLs, general industry, heat-resistant tapes, pressure sensitive tapes, rigid-flex PCBs, flexible displays, flexible electronics, LED light bars, barcodes, etc. Taimide Tech. Inc. was founded in 2000 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "3653.TW": {"short_name": "JENTECH PRECISION INDUSTRIAL CO", "long_name": "Jentech Precision Industrial Co., Ltd", "summary": "Jentech Precision Industrial Co., Ltd. manufactures and sells precision metal stampings, insert and injection moldings, and machining and assembly solution worldwide. The company's principal products include thermal heat spreaders, Semiconductor Leadframes, SMD LED Leadframes, EMI sheilding cases, RF coaxial connectors, TV tuner metal chassis, HDD and floppy drive components, and DPC thin-film ceramic substrate components. Its products are used in medical, consumer electronics, semiconductor, automotive, appliance, microelectronic, and other industries. Jentech Precision Industrial Co., Ltd. was founded in 1987 and is headquartered in Taoyuan, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "3673.TW": {"short_name": "TPK HOLDING CO LTD", "long_name": "TPK Holding Co., Ltd.", "summary": "TPK Holding Co., Ltd., together with its subsidiaries, develops, manufactures, and sells touch modules, touch displays, and indium tin oxide glass-related products in North America, Asia, and internationally. It offers various types of structure products, such as glass-glass and glass-film-film, as well as single glass solution. The company's products are used in various mobile and consumer electronics devices, such as wearable devices, smartphones, GPS, PMP, tablet PCs, notebook PCs, ultrabook PCs, AIO PCs, entertainment system screens in automobiles, and electronic book readers. It also provides touch panel (TP) solutions for other product domains, including gambling systems, industrial control systems, medical products, handheld game consoles, and touch remote controls. In addition, the company offers protective film and optical adhesive products. Its products are used in various businesses, such as retailing, service, banking, airport service, game consoles, display systems, and auto industries. TPK Holding Co., Ltd. was founded in 2003 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "3679.TW": {"short_name": "NISHOKU TECHNOLOGY", "long_name": "Nishoku Technology Inc.", "summary": "Nishoku Technology Inc. designs and manufactures single and double steel plastic injection molds in Taiwan and internationally. The company offers consumer products, including wireless bluetooth speaker, display cases, and VR glass; computer products, such as mouse and accessories for notebook/desktop/tablet PC. It also provides function key, control console, overhead console, side mirror direction light, auto interior light, and car handle for interior and exterior auto products. In addition, the company offers communication products, including phone keypad and walkie-talkie. Nishoku Technology Inc. was founded in 1980 and is based in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "3714.TW": {"short_name": "ENNOSTAR INC", "long_name": "ENNOSTAR Inc.", "summary": "ENNOSTAR Inc. engages in the research and development, manufacture, and sale of compound semiconductors in Taiwan. The company's products include epitaxial and chip, package and modules, and special compound semiconductors. Its products are used in displays, professional lighting, automotive, and sensing applications. The company was formerly known as EPISTAR Corporation. ENNOSTAR Inc. was founded in 1996 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "4555.TW": {"short_name": "TAIWAN CHELIC CORP LTD", "long_name": "TAIWAN CHELIC Co., Ltd.", "summary": "TAIWAN CHELIC Co., Ltd. manufactures and sells pneumatic and electric actuator automation components in Taiwan and internationally. The company provides air source units; control valves; miniature, standard, stopper, dual rod, compact, slide table, guide, rod less, clamp, and rotary cylinders; grippers; vacuum equipment; and fitting/auxiliary equipment. It also offers accessories for pressure switches and sensing components. The company's products are used in production facilities, inspection machines, packing machines, forming machines, repairmen equipment, and factory automation applications. The company was founded in 1986 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "4956.TW": {"short_name": "EPILEDS TECHNOLOGIES INC", "long_name": "Epileds Technologies, Inc.", "summary": "Epileds Technologies, Inc. researches and develops, designs, manufactures, and sells blue, green, red, and white light LED wafers and chips in Taiwan and internationally. The company offers AlGalnP LED Chips with wavelength ranging from 580 to 860nm; and InGaN LED chips with wavelength from 380 to 550nm. Its LED wafers and chips are used in a range of applications, including landscape lighting, plant lighting, engineering illumination, CCTV, and medical devices cosmetics, and others; indicators of consumer electronics, light source of fax machines and scanners, backlight source of LCD monitors, indoor or outdoor display boards, automotive lightings, traffic signals, and illuminators; and high voltage LED chip, white light illumination, UV, and other applications. Epileds Technologies, Inc. was founded in 2006 and is based in Tainan, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Tainan City"}, "4976.TW": {"short_name": "CALIN TECHNOLOGY CO LTD.", "long_name": "Calin Technology Co., Ltd.", "summary": "Calin Technology Co., Ltd. manufactures and sells high-precision optical lens and components. Its products include automotive camera, security camera, projector lens, digital camera lens, DSLR, industrial lenses, and medical endoscopy lens. The company also offers aspherical glass molding lens, glass grinding, and injection-optical lenses. In addition, it provides customized development and assembly services. The company was founded in 2002 and is headquartered in Taichung, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung"}, "5469.TW": {"short_name": "HANNSTAR BOARD CORP", "long_name": "HannStar Board Corp.", "summary": "HannStar Board Corp. manufactures, fabricates, and sells print circuit boards in Taiwan. The company provides telecom, server, back plane, card, and NB products. Its products are used in computer and peripheral; cellular phones, networking equipment, and telecom systems; game consoles, set top boxes, televisions, and printers; and car control panels, automotive navigation systems, and digital products for official or entertaining services applications. The company was formerly known as Pacific Science and Technology Industrial Co., Ltd. and changed its name to HannStar Board Corp. in December 1998. HannStar Board Corp. was founded in 1989 and is based in Taipei, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "6088.HK": {"short_name": "FIT HON TENG", "long_name": "FIT Hon Teng Limited", "summary": "FIT Hon Teng Limited engages in the design, development, production, and sale of interconnect solutions and related products in Taiwan, Mainland China, the United States, Hong Kong, Singapore, and internationally. The company offers cable components, including an array of input/output (I/O) cable assemblies, as well as wire harness and power cords. It also provides connector components comprising I/O connectors, sockets, SAS connectors, power and backplane connectors, memory/edge cards, terminal blocks, and wire to board/board to board connectors. In addition, the company offers optical modules, such as active optical cables, optical transceiver, and embedded optical modules. Further, it provides radio frequency antenna cable and module assemblies; wireless charging products and components; and accessories, such as headsets, speaker systems, and power and cable accessories. The company's interconnect solutions provide functionality to computer and consumer electronics, mobile and wireless devices, and communications infrastructure, including cloud computing, as well as other end markets, such as automotive, industrial, and medical. It also engages in the structure cabling, installation, and maintenance of intelligent control system, as well as research, development, and manufacture of batteries. The company was formerly known as New Wing International Holdings Limited and changed its name to FIT Hon Teng Limited in June 2013. The company was founded in 2013 and is headquartered in New Taipei City, Taiwan. Foxconn FIT Hon Teng Limited is a subsidiary of Foxconn (Far East) Limited.", "currency": "HKD", "sector": "Technology", "industry": "Electronic Components", "exchange": "HKG", "market": "hk_market", "country": "Taiwan", "city": "New Taipei City"}, "6108.TW": {"short_name": "APCB INC", "long_name": "APCB Inc.", "summary": "APCB Inc. produces and sells multi-layer PCB products for application in consumer electronic sector in Taiwan and internationally. The company provides camera module boards for use in security controls, notebooks, monitors, mobile phones, and tablets; TFT-LCD boards for LCDs, TVs, mobile phones, and backlight modules; and consumer electronic boards for use in projectors, type c modules, smart meters, mobile phones, notebooks, and games. It also offers RF module boards used in mobile phones, PCs, notebooks, and tablets; industrial control boards for PLC control panels, variable electrical appliances, electric control doors, servers, and power supply units; automotive boards for use in body control systems, dashboards, sensors boards, and head lamp; MCPCBs for LED thermal modules, LED packaging, and lighting; and memory module boards for use in SSD and USB. APCB Inc. was founded in 1981 and is based in Taipei, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "6120.TW": {"short_name": "DARWIN PRECISIONS CORPORATION", "long_name": "Darwin Precisions Corporation", "summary": "Darwin Precisions Corporation manufactures and sells backlight module technology in Taiwan. It provides optoelectronic products, including backlight and panel modules, NB display modules, touch module laminations, and SET machines; lighting application products, such as LED panel light, LED kitchen light, light guide plates, and application development products; and acrylic sheets, including optical grade acrylic boards, cover lens, Pika Pika, and PMMA. The company also offers precision metal stamping parts, such as backplane, frames, and covering cover; optical components consisting of LGP light guides; precision injection products, such as TV appearance, plastic front frame/back cover, and plastic frame; precision molds; and electronic paper applications. Its products are used in LCD TVs, personal monitors, notebook computers, and automotive displays. The company was formerly known as Forhouse Corporation and changed its name to Darwin Precisions Corporation in 2015. Darwin Precisions Corporation was founded in 1989 and is headquartered in Hsinchu City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "6141.TW": {"short_name": "PLOTECH CO LTD", "long_name": "Plotech Co.,Ltd", "summary": "Plotech Co.,Ltd manufactures and sells printed circuit boards in Taiwan and China. The company was founded in 1990 and is headquartered in Taoyuan City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "6153.TW": {"short_name": "CAREER TECHNOLOGY CO", "long_name": "Career Technology (Mfg.) Co., Ltd.", "summary": "Career Technology (Mfg.) Co., Ltd. manufactures and sells flexible printed circuits in Taiwan and internationally. The company provides single-sided, double-sided, double access, and multilayer flex circuits; gap structures; and rigid-flex boards, as well as component assemblies. Its products are used in various applications, such as mobile phones, touch panels, tablet PCs, digital cameras, flat displays, notebooks, GPS, autotronics, ultrabooks, wearable devices, and virtual reality, as well as in medical instrument market segments. The company was founded in 1992 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "6205.TW": {"short_name": "CHANT SINCERE CO", "long_name": "Chant Sincere Co., Ltd.", "summary": "Chant Sincere Co., Ltd. designs, manufactures, and sells connectors and cables in Taiwan and internationally. The company's principal products include I/O connectors, board-to-board connectors, waterproof connectors, industrial connectors, automotive connectors, memory card connectors and adaptors, high-speed connectors and cables, and audio and video connectors and cables. Its products are used in various industries, such as computing, industrial and automation, telecommunication, automotive, waterproof, consumer, and medical industries. The company was founded in 1985 and is based in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "6209.TW": {"short_name": "KINKO OPTICAL CO", "long_name": "Kinko Optical Co., Ltd.", "summary": "Kinko Optical Co., Ltd. designs, develops, produces, and sells optical components and lens worldwide. The company offers digital single-lens reflex camera, 3D sensing, mobile phone, projector, NB, surveillance, IP camera, security camera, automotive, panoramic camera, Internet of Things, industrial camera, telescope, and sports camera lenses. It also provides spherical and aspherical glass lens OEM, and lens ODM services. The company was founded in 1980 and is headquartered in Taichung, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung"}, "6213.TW": {"short_name": "ITEQ CORP", "long_name": "ITEQ Corporation", "summary": "ITEQ Corporation manufactures and sells copper clad laminate materials used for fabrication of printed circuit boards in Taiwan and Asia. It offers mass lamination boards, copper clad laminates, prepreg products, and electronic components. The company's products are used in various application areas, such as computational and communications applications comprising servers, storage, and switches; radio frequency and microwave devices, consisting of 5G and mmWaves; automotive applications, including advanced driver assist systems; and high density interconnect solutions, which include smartphones. It also exports its products. The company was founded in 1997 and is headquartered in Hsinchu City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "6224.TW": {"short_name": "POLYTRONICS TECHNOLOGY CORP", "long_name": "Polytronics Technology Corporation", "summary": "Polytronics Technology Corp. engages in the research, development, manufacture, and sale of circuit protection and thermal management devices for high-density electronics systems. It provides EVERFUSE polymeric positive temperature coefficient products, including surface-mount devices for computers, portable electronics, game consoles, telephony and broadband products, mobile phones, industrial controls, batteries, and multimedia products; radial-leaded devices for AC/DC adapters, power supply products, USB hubs and accessories, computer accessories and related applications, medical equipment, industrial controls, and automotive and motor protection products; and battery device products for mobile phones, laptops and netbooks, PDAs, portable multimedia players, MP3s, and game consoles. The company also offers telecom products for xDSL, VoIP, MDF module, Ethernet, and telecom analog and digital line card applications, as well as for modem, telephone, and facsimile machines; thermal conductive boards for automotive lighting, power module, solar cell, IC packing, and LED applications; current limiting modules for note book, cell phone, security system, and automotive applications; surface mount fuses; transient voltage suppressor diodes; thyristor surge suppressor devices; electrostatic discharge protectors; metal oxide varistors and potentiometers; gas discharge tubes; thermal setable pads; thermal dissipation coating materials; thermal conductive inks; heat dispersing materials; and overvoltage protection element and related semi-finished goods, modules, and heat conductive substrates. In addition, it engages in the investments and general business operations; and production and sale of resistors, discrete semiconductor devices, and other resistive elements. The company operates in Taiwan, China, the United States, and internationally. Polytronics Technology Corp. was founded in 1997 and is based in Hsinchu City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "6230.TW": {"short_name": "NIDEC CHAUN-CHOUNG TECHNOLOGY C", "long_name": "Nidec Chaun-Choung Technology Corporation", "summary": "Nidec Chaun-Choung Technology Corporation manufactures, processes, and trades in heat transfer components worldwide. The company's main products include thermal modules, heat sinks, heat pipes, and vapor chambers. It offers heat transfer devices for smartphones, desktops, notebooks, servers, network communication, game consoles, and household appliances. The company was formerly known as Chaun-Choung Technology Corp. and changed its name to Nidec Chaun-Choung Technology Corporation in January 2021. Nidec Chaun-Choung Technology Corporation was founded in 1973 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "6288.TW": {"short_name": "EXCELLENCE OPTOELECTRONIC INC", "long_name": "Excellence Optoelectronics Inc.", "summary": "Excellence Optoelectronics Inc. designs, manufactures, and sells opto-electronic technologies and products in Taiwan and internationally. The company offers LED lamps with AlInGaP and InGaN chip materials. It also provides LED street lighting, high/low bay, shoe box, wall pack, and patio light products; Led light modules; Led components for lighting; LED traffic signals, such as ball signals, arrow signals, pedestrian signals, vehicle countdown, bicycle signals, and tram way signals; and automotive light modules for ODM/OEM services. The company was founded in 1995 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "6289.TW": {"short_name": "ARIMA OPTOELECTRONICS CORPORATI", "long_name": "Arima Optoelectronics Corp.", "summary": "Arima Optoelectronics Corp. operates in the optoelectronics market. It offers UHB LED and LD dice, and epitaxial wafer products to LED manufacturers in Taiwan and internationally. The company was founded in 1998 and is based in Hsinchu City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "6405.TW": {"short_name": "ONANO INDUSTRIAL CORP", "long_name": "Onano Industrial Corp.", "summary": "Onano Industrial Corp. provides opto-electronic glass slimming solutions in Taiwan. The company offers slimming, polishing, and film coating services for TFT-LCD, OLED, solar cell glass, etc.; PV panel slimming; anti-glare treatment; opto-electronic coating; and OGS strengthening products. Its products are used in various applications, including smart phones, tablets, ultra-thin laptops, consumer electronics, LCD displays, etc. The company was founded in 2004 and is based in Taoyuan, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "6442.TW": {"short_name": "EZCONN CORPORATION", "long_name": "EZconn Corporation", "summary": "EZconn Corporation, together with its subsidiaries, manufactures and sells precision metal and optical fiber components of various electronic products in Taiwan, Asia, the United States, and Europe. The company offers RF coaxial connectors, precision adaptors, jumpers, surge arrestors, filters, amplifiers, and dipolar antennas, as well as CATV connector / components, shielding can for STB/ cable modem, microwave connector / dipole antenna, base station connector / arrester, LAB adaptor, and automotive connection system products for use in lightning protectors, antennas, filters, RF connectors, and POE home terminal AV/data MoCA filters. It also provides equipment distribution products, including OSA, passive, advanced, and other fiber optics products for access, metro-core/long haul, and transceiver applications; and ODM services. EZconn Corporation was founded in 1971 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "6449.TW": {"short_name": "APAQ TECHNOLOGY CO LTD", "long_name": "Apaq Technology Co., Ltd.", "summary": "Apaq Technology Co., Ltd. researches, develops, manufactures, and sells electronic components in China, Taiwan, and internationally. It offers aluminum solid capacitors, aluminum liquid electrolytic capacitors, and general electronic components; and coiled and chip-type conductive polymer solid state capacitors. The company was founded in 2005 and is headquartered in Miaoli, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Miaoli"}, "6698.TW": {"short_name": "FINEMAT APPLIED MATERIALS CO LT", "long_name": "FineMat Applied Materials Co., Ltd.", "summary": "FineMat Applied Materials Co., Ltd. develops and manufactures high-precision metal masks based on precision etching technology in Taiwan. It offers high-precision metal mask for display; flexible OLED display metal mask fabrication and Web services; OLED and semiconductor recycle and cleaning services; and products for various types of precision etching applications, as well as full-size precision frame manufacturing services. The company also provides design consulting, mask etching, frame preparation, spot welding, and cleaning and regeneration services. It offers its products for the OLED display panel industry; and products to biomedical equipment and optical lens masks. The company was formerly known as Yiqiang Technology Co., Ltd. and changed its name to FineMat Applied Materials Co., Ltd. in 2012. FineMat Applied Materials Co., Ltd. was founded in 2007 and is based in Tainan City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Tainan City"}, "8039.TW": {"short_name": "TAIFLEX SCIENTIFIC CO", "long_name": "Taiflex Scientific Co., Ltd.", "summary": "Taiflex Scientific Co., Ltd. engages in the manufacture, wholesale, and retail of electronic materials and components in Taiwan. The company offers polymer film based copper clad laminates, cover layers, photovoltaic module back sheets, flexible copper-cladded laminates, optical film materials, bonding sheets, composited PI sheets, and PI type stiffeners. It provides electronic materials for applications in cell phones, music players, DSC/DVC, HDD, and tablets; and energy materials for solar powered cell phones, rooftop systems, and vehicles, as well as solar street lamps and utility scale applications. The company was founded in 1997 and is headquartered in Kaohsiung, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Kaohsiung"}, "8046.TW": {"short_name": "NAN YA PRINTED CIRCUIT BOARD CO", "long_name": "Nan Ya Printed Circuit Board Corporation", "summary": "Nan Ya Printed Circuit Board Corporation manufactures and sells printed circuit boards (PCBs) and IC substrates in Taiwan. It offers conventional PCBs that are used in the motherboards of desktops and notebooks, and home electrical appliances; high density interconnection PCBs that are used in smart phones, game consoles, GPS, PDAs, automobile appliances, and MP3 players; and rigid-flex PCBs for use in high-end portable devices and notebooks. The company also provides flip chip substrates comprising pin/land grid arrays for microprocessors; and ball grid arrays for graphic microprocessors, northbridge chipsets, high-end ASIC chipsets, and set-top box chipsets. In addition, it offers wire bond substrates for MCP, southbridge chipsets, communication, and networking applications; and for use in memory, portable devices, handsets, consumer electronics, and PC peripheral device applications. The company was founded in 1985 and is headquartered in Taipei City, Taiwan. Nan Ya Printed Circuit Board Corporation is a subsidiary of Nan Ya Plastics Corporation.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "8103.TW": {"short_name": "CVILUX CORPORATION", "long_name": "CviLux Corporation", "summary": "CviLux Corporation manufactures and sells connectors, flat flexible cables (FFC), and wire harnesses in Taiwan and internationally. The company's connectors include board to board, CCFL, coaxial, combo D-sub, DVI, FFC/FPC, IEEE, LVDS, memory card, mini-DIN, power, serial ATA, telephone/modular jack, USB, wire to board crimp style, wire to board insulation displacement, and ribbon cable connectors, as well as application tooling and IC sockets. It also offers cable assemblies; PCBA turnkey solutions; LVDS cables; and fiber optics connectors and cables. The company's products are used in consumer electronics, computers, communication, and electro-optical industries. The company was founded in 1990 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "8104.TW": {"short_name": "RITDISPLAY CORPORATION", "long_name": "RiTdisplay Corporation", "summary": "RiTdisplay Corporation engages in the research and development, and manufacture of organic light-emitting diodes in Taiwan and internationally. It also provides various flat-panel display products. The company was founded in 1997 and is based in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "8213.TW": {"short_name": "TAIWAN PCB TECHVEST CO", "long_name": "Taiwan Pcb Techvest Co., Ltd.", "summary": "Taiwan Pcb Techvest Co., Ltd., a professional manufacturing service company, manufactures and sells electronic components and printed circuit boards (PCBs). It offers PCBs for notebooks, servers, memory modules, etc., as well as LCD products. The company was founded in 1998 and is based in Tao Yuan City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Tao Yuan City"}, "8215.TW": {"short_name": "BENQ MATERIALS CORPORATION", "long_name": "BenQ Materials Corporation", "summary": "BenQ Materials Corporation manufactures and sells material science products in Taiwan and internationally. Its product lines includes functional films, including polarizer films; optical films for touch panels; e-paper, a waterproof and surface treatment film for touch panel function; industrial tapes; and smart optical films. The company also provides healthcare products, including hydrocolloid dressings for moist wound management and silicone gel for scar prevention; clinical solution for rapid hemorrhage control of traumatic injury in the pre hospital setting; acne care products; and contact lenses. In addition, it offers separator, a component in liquid electrolyte batteries; and aluminum foil for lithium-ion battery of mobile devices or autos. The company was formerly known as Daxon Technology Inc. and changed its name to BenQ Materials Corporation in June 2010. BenQ Materials Corporation was founded in 1998 and is headquartered in Taoyuan, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "AU7A.F": {"short_name": "AU OPTRONICS CORP. ADR/10", "long_name": "AU Optronics Corp.", "summary": "AU Optronics Corp. designs, develops, manufactures, assembles, and sells thin film transistor liquid crystal displays (TFT-LCDs) and other flat panel displays. The company operates in two segments, Display and Energy. The Display segment designs, develops, manufactures, assembles, and markets flat panel displays for use in televisions, monitors, mobile PCs and devices, automobiles, industrial PCs, automated teller machines, point of sale terminals, pachinko machines, medical equipment, etc. This segment serves original equipment manufacturing service providers; and brand companies. The Energy segment manufactures and sells solar materials, including ingots, solar wafers, and solar modules, as well as provides technical engineering and maintenance services for solar system projects. This segment sells its ingot and solar wafer products primarily to solar cell manufacturers; and solar modules to installers, solar system integrators, property developers, and other value-added resellers. The company also sells and leases content management system and hardware; plans, designs, and develops construction for environmental protection and related project management; and manufactures and sells TFT-LCD modules and panels, TV sets, backlight modules, automotive parts, precision plastic parts, and motorized treadmills. In addition, it develops and sells software and hardware for health care industry; provides software and hardware integration system and equipment relating to intelligent manufacturing, as well as related consulting services; and engages in venture capital investment activities. The company operates in the People's Republic of China, Taiwan, Japan, Singapore, and internationally. AU Optronics Corp. was founded in 1996 and is headquartered in Hsinchu, Taiwan.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "Taiwan", "city": "Hsinchu City"}, "AUOTY": {"short_name": "AU OPTRONICS CORPORATION SPON A", "long_name": "AU Optronics Corp.", "summary": "AU Optronics Corp. designs, develops, manufactures, assembles, and sells thin film transistor liquid crystal displays (TFT-LCDs) and other flat panel displays. The company operates in two segments, Display and Energy. The Display segment designs, develops, manufactures, assembles, and markets flat panel displays for use in televisions, monitors, mobile PCs and devices, automobiles, industrial PCs, automated teller machines, point of sale terminals, pachinko machines, medical equipment, etc. This segment serves original equipment manufacturing service providers; and brand companies. The Energy segment manufactures and sells solar materials, including ingots, solar wafers, and solar modules, as well as provides technical engineering and maintenance services for solar system projects. This segment sells its ingot and solar wafer products primarily to solar cell manufacturers; and solar modules to installers, solar system integrators, property developers, and other value-added resellers. The company also sells and leases content management system and hardware; plans, designs, and develops construction for environmental protection and related project management; and manufactures and sells TFT-LCD modules and panels, TV sets, backlight modules, automotive parts, precision plastic parts, and motorized treadmills. In addition, it develops and sells software and hardware for health care industry; provides software and hardware integration system and equipment relating to intelligent manufacturing, as well as related consulting services; and engages in venture capital investment activities. The company operates in the People's Republic of China, Taiwan, Japan, Singapore, and internationally. AU Optronics Corp. was founded in 1996 and is headquartered in Hsinchu, Taiwan.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "Taiwan", "city": "Hsinchu City"}, "FITGF": {"short_name": "FIT HON TENG LTD", "long_name": "FIT Hon Teng Limited", "summary": "FIT Hon Teng Limited engages in the design, development, production, and sale of interconnect solutions and related products in Taiwan, Mainland China, the United States, Hong Kong, Singapore, and internationally. The company offers cable components, including an array of input/output (I/O) cable assemblies, as well as wire harness and power cords. It also provides connector components comprising I/O connectors, sockets, SAS connectors, power and backplane connectors, memory/edge cards, terminal blocks, and wire to board/board to board connectors. In addition, the company offers optical modules, such as active optical cables, optical transceiver, and embedded optical modules. Further, it provides radio frequency antenna cable and module assemblies; wireless charging products and components; and accessories, such as headsets, speaker systems, and power and cable accessories. The company's interconnect solutions provide functionality to computer and consumer electronics, mobile and wireless devices, and communications infrastructure, including cloud computing, as well as other end markets, such as automotive, industrial, and medical. It also engages in the structure cabling, installation, and maintenance of intelligent control system, as well as research, development, and manufacture of batteries. The company was formerly known as New Wing International Holdings Limited and changed its name to FIT Hon Teng Limited in June 2013. The company was founded in 2013 and is headquartered in New Taipei City, Taiwan. Foxconn FIT Hon Teng Limited is a subsidiary of Foxconn (Far East) Limited.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "Taiwan", "city": "New Taipei City"}, "HHP2.F": {"short_name": "HON HAI PR.IND.SP.GDR S/1", "long_name": "Hon Hai Precision Industry Co., Ltd.", "summary": "Hon Hai Precision Industry Co., Ltd. provides technology solutions in Japan, Ireland, the United States, Europe, Singapore, China, Hong Kong, and internationally. The company manufactures, sells, and services connectors, cases, thermal modules, wired/wireless communication products, optical products, power supply modules, and assemblies for use in the information technology, communications, automotive equipment, precision molding, automobile, and consumer electronics industries. It also manufactures automobile wires/electronic devices and electronic components, as well as machinery and equipment; and provides services of planning, advisory, and business management, as well as software and electronic information application, logistics, export processing, construction, leasing, and information/software services. In addition, the company manufactures and sells application modules and network cables assemblies; develops educational technology; holds patent applications; manufactures and trades in portable cameras; and retails office machinery and equipment, and electronic appliances. Further, it is involved in the reinvestment in the businesses relating to robots, automatic equipment, molds, parts, and accessories and corresponding services; software development, repair and after-sale services, and rental services of robots; leasing services. Additionally, the company manufactures and sells computer and data processing equipment, WIFI cards and modules, CFTVs, DVRs, Bluetooth modules, set-top boxes, and optical network terminals. It is also involved in the data storage; manufacturing of wire or wireless communication; installation of computer and satellite TV channels; and provision of mobile phone services, as well as telecom-related business. The company was founded in 1974 and is headquartered in New Taipei City, Taiwan.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "Taiwan", "city": "New Taipei City"}, "HNHAF": {"short_name": "HON HAI PRECISION INDUSTRY", "long_name": "Hon Hai Precision Industry Co., Ltd.", "summary": "Hon Hai Precision Industry Co., Ltd. provides technology solutions in Japan, Ireland, the United States, Europe, Singapore, China, Hong Kong, and internationally. The company manufactures, sells, and services connectors, cases, thermal modules, wired/wireless communication products, optical products, power supply modules, and assemblies for use in the information technology, communications, automotive equipment, precision molding, automobile, and consumer electronics industries. It also manufactures automobile wires/electronic devices and electronic components, as well as machinery and equipment; and provides services of planning, advisory, and business management, as well as software and electronic information application, logistics, export processing, construction, leasing, and information/software services. In addition, the company manufactures and sells application modules and network cables assemblies; develops educational technology; holds patent applications; manufactures and trades in portable cameras; and retails office machinery and equipment, and electronic appliances. Further, it is involved in the reinvestment in the businesses relating to robots, automatic equipment, molds, parts, and accessories and corresponding services; software development, repair and after-sale services, and rental services of robots; leasing services. Additionally, the company manufactures and sells computer and data processing equipment, WIFI cards and modules, CFTVs, DVRs, Bluetooth modules, set-top boxes, and optical network terminals. It is also involved in the data storage; manufacturing of wire or wireless communication; installation of computer and satellite TV channels; and provision of mobile phone services, as well as telecom-related business. The company was founded in 1974 and is headquartered in New Taipei City, Taiwan.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "Taiwan", "city": "New Taipei City"}, "HNHPF": {"short_name": "HON HAI PRECISION INDUSTRY", "long_name": "Hon Hai Precision Industry Co., Ltd.", "summary": "Hon Hai Precision Industry Co., Ltd. provides technology solutions in Japan, Ireland, the United States, Europe, Singapore, China, Hong Kong, and internationally. The company manufactures, sells, and services connectors, cases, thermal modules, wired/wireless communication products, optical products, power supply modules, and assemblies for use in the information technology, communications, automotive equipment, precision molding, automobile, and consumer electronics industries. It also manufactures automobile wires/electronic devices and electronic components, as well as machinery and equipment; and provides services of planning, advisory, and business management, as well as software and electronic information application, logistics, export processing, construction, leasing, and information/software services. In addition, the company manufactures and sells application modules and network cables assemblies; develops educational technology; holds patent applications; manufactures and trades in portable cameras; and retails office machinery and equipment, and electronic appliances. Further, it is involved in the reinvestment in the businesses relating to robots, automatic equipment, molds, parts, and accessories and corresponding services; software development, repair and after-sale services, and rental services of robots; leasing services. Additionally, the company manufactures and sells computer and data processing equipment, WIFI cards and modules, CFTVs, DVRs, Bluetooth modules, set-top boxes, and optical network terminals. It is also involved in the data storage; manufacturing of wire or wireless communication; installation of computer and satellite TV channels; and provision of mobile phone services, as well as telecom-related business. The company was founded in 1974 and is headquartered in New Taipei City, Taiwan.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "Taiwan", "city": "New Taipei City"}}