{
    "1617.TW": {
        "short_name": "JUNG SHING WIRE CO",
        "long_name": "Jung Shing Wire Co., Ltd.",
        "summary": "Jung Shing Wire Co., Ltd. manufactures and sells magnet wires in Taiwan. The company offers general magnet wires for motors, transformers, generators, telecommunication, mobiles, auto-controlling, in-house products, electronic apparatus, and aerospace and aviation related equipment; self-bonding magnet wires; and special magnet wires, including ribbon wires, parallel-laid multi-wires, copper-clad aluminum wires, aluminum wires, litz wires, high-tension magnet wires, silver magnet wires, silver- plate magnet wires, and surge resistance magnet wires. Its products are used in motors, coils, and transformers. Jung Shing Wire Co., Ltd. was founded in 1971 and is based in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "71757",
        "website": "http://www.jswire.com.tw",
        "market_cap": "Micro Cap"
    },
    "3048.TW": {
        "short_name": "EDOM TECHNOLOGY CO",
        "long_name": "EDOM Technology Co., Ltd.",
        "summary": "EDOM Technology Co., Ltd. engages in the distribution of electronic parts, computer hardware, software, and equipment in Taiwan and internationally. The company offers analog ICs, batteries, connectors, digital logic ICs, discrete products, embedded modules, memory products, micro components, non-optical sensors, optoelectronics, passive components, test and measurement products, and other products. It has strategic partnership with PollenTech to enable the delivery of integrated HW & SW system solutions. The company serves Internet of things, mobile, consumer electronics, industrial, and automotive sectors. EDOM Technology Co., Ltd. was founded in 1996 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.edomtech.com/tw",
        "market_cap": "Micro Cap"
    },
    "3232.TWO": {
        "short_name": "SENTRONIC INTERNATIONAL CORP",
        "long_name": "Sentronic International Corp.",
        "summary": "Sentronic International Corp. provides semiconductor components, liquid crystal displays, optical pickups, light-emitting diodes, micro motors, decentralized components, etc. The company was founded in 1987 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "221",
        "website": "http://www.sentronic.com.tw",
        "market_cap": "Nano Cap"
    },
    "3287.TWO": {
        "short_name": "KWORLD COMPUTER CO",
        "long_name": "Kworld Computer Co.,Ltd",
        "summary": "Kworld Computer Co., Ltd provides digital entertainment products in Taiwan and internationally. It offers gaming earphones; and wall and car chargers, as well as TV/video drivers, analog TV tuner cards, and hybrid TV tuner sticks. The company was founded in 1999 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23585",
        "website": "http://www.kworld-global.com",
        "market_cap": "Nano Cap"
    },
    "3325.TWO": {
        "short_name": "CASING MACRON TECHNOLOGY CO",
        "long_name": "Casing Macron Technology Co., Ltd.",
        "summary": "Casing Macron Technology Co., Ltd. designs, manufactures, markets, and sells computing products. It offers PC chassis and switching power supply products; peripheral devices, such as card readers, mouse, speakers, and barebone systems; and PC cases, including slim, mini tower, middle tower, mini ITX, server, and gamming PC cases. The company also provides water filter systems and temperature drinking water devices. In addition, it offers OEM and ODM services. The company was founded in 1994 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.casing.com.tw",
        "market_cap": "Micro Cap"
    },
    "3444.TWO": {
        "short_name": "NICHING INDUSTRIAL CORP",
        "long_name": "Niching Industrial Corporation",
        "summary": "Niching Industrial Corporation markets and sells semiconductor, flat panel display, light-emitting diode (LED), green energy, and nanotechnology products worldwide. The company provides PCB for solid-state drives and memory modules, substrates for IC packaging, capillary wedges, die collet needles, special gas, dispensing nozzles, and die attach films, as well as reclaim, Al coating, dummy, and daisy chain wafers. It also offers screen printing silver paste, Nano imprint silver paste, gravure off set silver paste, low-temperature sintering Ag paste, and low temp adhesive silver paste, as well as printing paste for laser etching and silver ink; chip trays, ABS reels, sputtering targets, and emboss spacers for the LCD industry; and LED tabs and lead frames for the LED industry. In addition, the company provides adhesives for temporary bonding, metal springs for VCM, CPD dryers, and Nano porous materials, substrate for stretchable and flexible modules, and wireless power charging coils. Further, it manufactures and sells touch Nano silver products. Niching Industrial Corporation was founded in 1993 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "40755",
        "website": "http://www.niching.com.tw",
        "market_cap": "Micro Cap"
    },
    "3483.TWO": {
        "short_name": "FORCECON TECH. CO. LTD",
        "long_name": "Forcecon Technology Co., Ltd.",
        "summary": "Forcecon Technology Co., Ltd. engages in the research, development, production, and sale of thermal management products in Taiwan and internationally. The company offers DC axial and blower fans, thermal module active and passive products, vapor chambers, and heat pipes for use in computers, VGA, LED lightings, servers, automobiles, smart-phones, and bio-technology science fields. It serves ODM and OEM customers. The company was founded in 1997 and is headquartered in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "30252",
        "website": "http://www.forcecon.com",
        "market_cap": "Micro Cap"
    },
    "3528.TW": {
        "short_name": "ANSWER TECHNOLOGY CO. LTD.",
        "long_name": "Answer Technology Co., Ltd.",
        "summary": "Answer Technology Co., Ltd. provides analog, mixed-signal, and digital signal processing integrated circuits (IC) in Taiwan. It also provides USB3.0/3.1, PCIe bridge, and switch ICs; and fabless IC design services, as well as various reference design and technology background for supporting services. In addition, the company designs, manufactures, and ships discrete and embedded magnetoresistive RAM (MRAM) and spin-torque MRAM; and offers circuit protection components and antenna products for computing, communication, consumer electronics, and automotive electronics. Further, it provides optical communications product; broadcast test and measurement equipment; design and consultancy services to broadcast, professional A/V, and image processing companies; packaged infrared sensors used for gas detection, flame detection, and gensture/motion/presence detection; and FPGAs, SoCs, MPSoCs, and 3D ICs, as well as develops various silicon intellectual properties and integrated technologies of system software/hardware. Additionally, the company offers sensor solutions for applications in various industries; Valens HDBaseT technology that provides plug-and-play digital connectivity between HD video sources and remote displays; and design services, and original IP core and application specific solutions, as well as develops ASSPs for motion control of fractional horse power stepper motors and brushless DC motors. Answer Technology Co., Ltd. was founded in 2000 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "221",
        "website": "http://www.anstek.com.tw",
        "market_cap": "Micro Cap"
    },
    "3702.TW": {
        "short_name": "WPG HOLDINGS LIMITED",
        "long_name": "WPG Holdings Limited",
        "summary": "WPG Holdings Limited distributes semiconductor, electronic, and electrical components in Taiwan, Mainland China, and internationally. The company provides core components, such as chipsets, graphics/audio/video controllers, smartphone chips, network/modem chipsets, CPU/MPU, RISC CPU, etc.; analog IC and mixed signal components, including bipolar, CMOS operational amplifiers, comparators, digital/analog converters, power supply controllers, audio and video amplifiers or controllers, etc.; and discrete logic IC components comprising of diodes, rectifiers, transistors, thyristors, insulated-gate bipolar transistors, optical transistors, logic ICs, etc. It also offers memory components, such as DRAM, SRAM, EPROM, EEPROM, flash, MCP, etc.; optical components, which includes LCD, sensor, LED, etc.; and passive components, connectors, and magnetic components, including resistors, capacitors, inductors, magnetic components, cables, connectors, mechanics, electro mechanics, circuit protection, materials, batteries, filters, oscillators, etc., as well as non-electronic components. In addition, the company operates children theme parks; and engages in the investment activities and general trading business. Further, it offers various value-added services, such as special delivery, market information, technical support and tools, financial support, turnkey solution, warehousing, logistics, and e-commerce services; and computer software, computer and its peripherals, and information products. WPG Holdings Limited was founded in 2005 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.wpgholdings.com",
        "market_cap": "Mid Cap"
    },
    "3702A.TW": {
        "short_name": "WPG HOLDINGS LIMITED",
        "long_name": "WPG Holdings Limited",
        "summary": "WPG Holdings Limited distributes semiconductor, electronic, and electrical components in Taiwan, Mainland China, and internationally. The company provides core components, such as chipsets, graphics/audio/video controllers, smartphone chips, network/modem chipsets, CPU/MPU, RISC CPU, etc.; analog IC and mixed signal components, including bipolar, CMOS operational amplifiers, comparators, digital/analog converters, power supply controllers, audio and video amplifiers or controllers, etc.; and discrete logic IC components comprising of diodes, rectifiers, transistors, thyristors, insulated-gate bipolar transistors, optical transistors, logic ICs, etc. It also offers memory components, such as DRAM, SRAM, EPROM, EEPROM, flash, MCP, etc.; optical components, which includes LCD, sensor, LED, etc.; and passive components, connectors, and magnetic components, including resistors, capacitors, inductors, magnetic components, cables, connectors, mechanics, electro mechanics, circuit protection, materials, batteries, filters, oscillators, etc., as well as non-electronic components. In addition, the company operates children theme parks; and engages in the investment activities and general trading business. Further, it offers various value-added services, such as special delivery, market information, technical support and tools, financial support, turnkey solution, warehousing, logistics, and e-commerce services; and computer software, computer and its peripherals, and information products. WPG Holdings Limited was founded in 2005 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.wpgholdings.com",
        "market_cap": null
    },
    "6118.TWO": {
        "short_name": "XANDER INTERNATIONAL CORP",
        "long_name": "Xander International Corp.",
        "summary": "Xander International Corp. sells information and commercial products in Taiwan. It offers audio and video multimedia products, DIY components, computer peripherals, computer systems, network/monitoring/software products, storage devices, transaction equipment, car/outdoor products, living appliances, and combination goods. The company was founded in 1997 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.xander.com.tw",
        "market_cap": "Nano Cap"
    },
    "6123.TWO": {
        "short_name": "GRANDTECH C.G. SYSTEMS INC",
        "long_name": "GrandTech C.G. Systems Inc.",
        "summary": "GrandTech C.G. Systems Inc. operates as a distributor of graphics, imaging, and multimedia design software. The company distributes 2D and 3D professional software products; digital printing equipment and solutions; and IT software and hardware products for enterprises, as well as IT integration and cloud services. It operates in Taiwan, Hong Kong, China, Singapore, Malaysia, Indonesia, and internationally. The company was founded in 1991 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.grandtech.com",
        "market_cap": "Micro Cap"
    },
    "6150.TWO": {
        "short_name": "TUL CORPORATION",
        "long_name": "TUL Corporation",
        "summary": "TUL Corporation develops and markets hardware solutions in IT industry worldwide. The company offers gaming and embedded graphics cards, SoC based mainboards and systems, FPGA products, thunderbolt adopters, and SSD storage solutions. It serves OEMs, distributors, VARs, and system integrators. The company was formerly known as C.P. Technologies and changed its name to TUL Corporation in March 2004. TUL Corporation was founded in 1997 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "221",
        "website": "http://www.tul.com.tw",
        "market_cap": "Micro Cap"
    },
    "6154.TWO": {
        "short_name": "SUNFAR COMPUTER CO",
        "long_name": "Sunfar Computer Co., Ltd",
        "summary": "Sunfar Computer Co., Ltd sells various goods for consumers in Taiwan. It offers home appliances, personal computer hardware and peripheral equipment, computer supplies and consumables, computer software and books, consumer electronics and communications, etc., as well as OA merchandise and maintenance services. The company provides its products through 64 stores and online shopping platform. Sunfar Computer Co., Ltd was founded in 1982 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "80750",
        "website": "http://www.sunfar.com.tw",
        "market_cap": "Nano Cap"
    },
    "6189.TW": {
        "short_name": "PROMATE ELECTRONIC CO",
        "long_name": "Promate Electronic Co.,Ltd.",
        "summary": "Promate Electronic Co.,Ltd. operates as a franchised distributor of semi-conductor products in Taiwan. The company distributes electronic components, such as integrated circuits for analog, communication, computer, consumer, display, and LED solutions; and value added design-in services for IT, industrial, communication, consumer electronic, and automotive industries. It also provides system integration solutions in the areas of software, optical, mechanical, and electrical engineering integration, as well as product development and manufacturing. In addition, the company offers consumer electronics, such as TFT LCD monitors and TVs, and Netbooks, as well as display and embedded solutions. Promate Electronic Co.,Ltd. was founded in 1986 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11442",
        "website": "http://www.promate.com.tw",
        "market_cap": "Micro Cap"
    },
    "6192.TW": {
        "short_name": "LUMAX INTERNATIONAL CORP",
        "long_name": "Lumax International Corp., Ltd.",
        "summary": "Lumax International Corp., Ltd. engages in the wholesale of electronic materials in Taiwan and China. It sells and installs process-control devices or systems, as well as provides maintenance services. The company also offers process automation consultancy during plant buildup, hardware/system installation, project management, and control valve maintenance for petrochemical, electronic, steel, and other non-tech enterprises; hardware product portfolio for calibration, inspection, and maintenance of control valves, switch valves, measurement instruments, analyzing instruments, and others; and control valve repair services, Lumax valves, and VOC anti-leakage solutions. In addition, it provides telecommunication materials and electronic components. Further, the company engages in international and transit trade, warehousing, and processing activities; producing insulating materials, power supplies, and computer connectors with thermostat and bearing high pressure; and processing thermal transfer materials, tape materials, LCD, etc., as well as provides installation and maintenance services for valves and calibration instruments. Additionally, it manufactures and designs computer systems and measuring appliance industry automation instruments; installs mechanical and electrical equipment; imports and exports goods and technology products; and provides assembly, repair, and instrument calibration of mechanical/electrical products. Lumax International Corp., Ltd. was founded in 1975 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "115",
        "website": "http://www.elumax.com",
        "market_cap": "Micro Cap"
    },
    "6227.TWO": {
        "short_name": "MACNICA GALAXY INC",
        "long_name": "Macnica Galaxy Inc.",
        "summary": "Macnica Galaxy Inc. distributes IC products and services in Taiwan and internationally. It offers software, artificial intelligence, and Internet of Things products, as well as semiconductors to customers in the cloud, Internet of Things, communication, industrial electronics, and automotive industries. The company was formerly known as Galaxy Far East Corporation and changed its name to Macnica Galaxy Inc. in July 2017. The company was founded in 1979 and is headquartered in New Taipei City, Taiwan. Macnica Galaxy Inc. is a subsidiary of Macnica Chungju Co., Ltd.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.macnica.com.tw",
        "market_cap": "Micro Cap"
    },
    "6265.TWO": {
        "short_name": "KUEN CHAANG UPPERTECH CORP",
        "long_name": "Kuen Chaang Uppertech Corp.",
        "summary": "Kuen Chaang Uppertech Corp. engages in the electronic component channel business in Taiwan. It is also involved in the semiconductor business. The company was founded in 1987 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "231",
        "website": "http://www.kc-uppertech.com",
        "market_cap": "Nano Cap"
    },
    "6776.TW": {
        "short_name": "WEBLINK INTERNATIONAL INC",
        "long_name": "Weblink International Inc.",
        "summary": "Weblink International, Inc. owns and operates stores that sell software and information technology products in Taiwan. Its stores offer commercial and home information electronics, application software products, digital entertainment products, system integration, lifestyle products, SMBs solution services etc. It also sells products online. The company was founded in 1997 and is based in Taipei, Taiwan. Weblink International, Inc. is a subsidiary of Acer Incorporated.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "100",
        "website": "http://www.weblink.com.tw",
        "market_cap": "Micro Cap"
    },
    "8067.TWO": {
        "short_name": "GISH INTERNATIONAL CO",
        "long_name": "Gish International Co., Ltd",
        "summary": "Gish International Co., Ltd operates as a distribution company in Japan, Singapore, China, Canada, the United States, Australia, and Chile. It offers a range of products, including fragrances and beauty products. The company was founded in 1989 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.gish-int.com",
        "market_cap": "Nano Cap"
    },
    "8068.TWO": {
        "short_name": "CHANDER ELECTRONICS CORP",
        "long_name": "Chander Electronics Corp.",
        "summary": "Chander Electronics Corp. engages in the distribution and maintenance of electronic components, integrated circuits, and design and test equipment. The company is also involved in the maintenance of computers and related spare parts; and analysis, planning, designing, development, import and export, distribution, and maintenance of computer and software systems. It also provides cloud services. The company was incorporated in 1997 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.chander.com.tw",
        "market_cap": "Nano Cap"
    },
    "8070.TW": {
        "short_name": "CHANG WAH ELECTROMATERIALS INC",
        "long_name": "Chang Wah Electromaterials Inc.",
        "summary": "Chang Wah Electromaterials Inc. operates as an agency for packaging materials and equipment in Taiwan. The company offers various IC packaging materials; IC packaging devices, such as auto molding, trim and form, and package sawing equipment, as well as fluid dispensing systems; and TFT-LCD products. It also provides LED mold technology with liquid compound/compression mold and LED lead frames for ejection molding; EMC LED lead frames for transfer molding; and solar power systems. The company was founded in 1989 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "811",
        "website": "http://www.cwei.com.tw",
        "market_cap": "Small Cap"
    },
    "OMPS": {
        "short_name": "OMPHALOS CORPORATION",
        "long_name": "Omphalos, Corp.",
        "summary": "Omphalos, Corp. manufactures and supplies a range of equipment and parts for printed circuit board manufacturers in Taiwan and China. It offers reflow soldering ovens and automated optical inspection machines. The company is based in Taoyuan City, Taiwan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "338",
        "website": null,
        "market_cap": "Nano Cap"
    }
}