{
    "2360.TW": {
        "short_name": "CHROMA ATE INC",
        "long_name": "Chroma ATE Inc.",
        "summary": "Chroma ATE Inc. designs, assembles, calibrates, manufactures, sells, repairs, and maintains software/hardware for computers and peripherals, computerized automatic test systems, electronic test instruments, signal generators, power supplies, and telecom power supplies under the Chroma brand worldwide. The company provides video and color test solutions; flat panel display test solutions; electrical safety testing solutions; and LED/lighting and driver test solutions. It also offers photovoltaic/inverter test and automation solutions; automated optical inspection solutions; power electronics test solutions; battery test and automation solutions; passive component, electric vehicle, and semiconductor/IC test solutions; PXI test and measurement solutions; and intelligent manufacturing system solutions. In addition, the company provides photonics, and RF and wireless test solutions, as well as turnkey test and automation solutions. Further, it offers warranty, calibration and repair, instrument and test system calibration and repair, customer-site installation, product upgrade, training, technical support, and product support services, as well as replacement parts. The company's products are used in information technology, communication, aerospace, defense, and other industries. Chroma ATE Inc. was incorporated in 1984 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "333001",
        "website": "http://www.chromaate.com",
        "market_cap": "Large Cap"
    },
    "3059.TW": {
        "short_name": "ALTEK CORP",
        "long_name": "Altek Corporation",
        "summary": "Altek Corporation engages in the development, manufacture, and sale of digital image technology application products. The company provides AI cameras and edge boxes, and PI cameras for home, banking and finance, hotel, retail, and industrial applications; imaging chips for image quality enhancement, face detection, etc.; and 3D sensing modules and solutions for robots, augmented reality/virtual reality devices, surveillance devices, and face payment systems. It offers automobile camera systems, including image assistance system/ mega pixel HD camera, IR camera, AVM, and ADAS for driver monitoring system; and medical imaging solutions, such as glucose meter, intelligent insulin delivery system, and disposable endoscope camera system. In addition, the company offers optical components; manufactures and sells digital still cameras and its accessories; research, development, manufacture, and sale of medical electronic equipment; wholesale, import, and export of digital cameras, digital video cameras, and related accessories; and research, design, and sales of imaging technologies, and electronic software and hardware. It operates in Asia, Europe, the United States, and Taiwan. The company was formerly known as Asia Imagination Corporation and changed its name to Altek Corporation in February 1997. Altek Corporation was founded in 1996 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": null,
        "website": "http://www.altek.com.tw",
        "market_cap": "Mid Cap"
    },
    "3306.TWO": {
        "short_name": "ROYALTEK COMPANY LTD",
        "long_name": "RoyalTek Company Ltd.",
        "summary": "RoyalTek Company Ltd. develops, manufactures, and sells global positioning system (GPS) products worldwide. Its products primarily include audio video navigation systems, portable navigation devices, driving assistance systems, driving video recorders, electronic accessories for automobiles, and engine boards for GPS. The company also offers ODM/OEM services for car electronics and driver assistance systems. It serves automotive, navigation, safety, leisure, sports, multimedia, mountaineering, tourism, and other industries. RoyalTek Company Ltd. was founded in 1997 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33383",
        "website": "http://www.royaltek.com",
        "market_cap": "Small Cap"
    },
    "3499.TWO": {
        "short_name": "GLOBALSAT WORLDCOM CORPORATION",
        "long_name": "GlobalSat WorldCom Corporation",
        "summary": "GlobalSat WorldCom Corporation manufactures and sells GPS receivers and module makers worldwide. It offers sports and outdoor products, such as Bike Computer, GPS Watch, Heart Rate Monitor, Triathlon Watch, and Wrist Band GPS cycling; and tracking devices, including asset tracker, AVL tracker, personal tracker, animal tracker. The company also provides IoT/M2M products comprising LoRaWAN devices, NB-loT Sigfox, LoRa M.O.S.T; accessories, which include GPS modules, GPS engine boards, GPS data loggers, wireless locators, and GPS active antennas. In addition, it provides customization services of electronic designs, system integration, and software development to meet the project requirements. The company's products are bundled into the clients' system products, such as tablet PCs, notebooks, and smartphones. It primarily exports its products to Europe and North America, as well as sells its products in other regions through channel distributors. The company was founded in 2000 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.globalsat.com.tw",
        "market_cap": "Small Cap"
    },
    "3587.TWO": {
        "short_name": "MATERIALS ANALYSIS TECHNOLOGY I",
        "long_name": "Materials Analysis Technology Inc.",
        "summary": "Materials Analysis Technology Inc. provides laboratory services in the areas of materials analysis, failure analysis, and reliability testing in Taiwan, China, Japan, Singapore, Malaysia, and internationally. The company offers reliability, non-destructive, electrical failure, materials, surface, and total solutions, as well as circuit edit and sample preparation solutions. Its products are used for various applications in IC, LED, biological and Nano, solar cell, and other industries. The company was founded in 2002 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.ma-tek.com",
        "market_cap": "Mid Cap"
    },
    "4549.TWO": {
        "short_name": "FINETEK CO LTD(TW)",
        "long_name": "FineTek Co., Ltd.",
        "summary": "FineTek Co., Ltd. manufactures and sells process automation, flow metering, wireless communication technology, and tank gauging systems in Taiwan and internationally. The company offers liquid and solid point switches; liquid and solid level transmitters; flow measurement switches and transmitters; pressure level transmitters and switches; temperature transmitters and thermocouples; and grain monitoring systems, including temperature and level monitoring transmitters, multi-point temperature sensors, materials management systems, and remote control units. It also provides wireless products, such as hublinks, coordinators, routers, and end devices; pneumatic products comprising air hammers, pneumatic vibrators, diaphragm valves, dust collector systems, and air pads; safety products, such as isolated safety barriers, speed monitors, conveyer belt misalignment switches, and safety cable pull switches. In addition, the company offers digital controllers/digital meters consisting of digital display panel meters and temperature controllers. Its products and solutions are used in various industries, including cement, hydraulic, petrochemical, food and beverage, chemical, water and wastewater treatment, electronics, power generation, construction, maritime, and steel industries. FineTek Co., Ltd. was founded in 1979 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "236",
        "website": "http://www.fine-tek.com",
        "market_cap": "Mid Cap"
    },
    "5309.TWO": {
        "short_name": "SYSGRATION",
        "long_name": "Sysgration Ltd.",
        "summary": "Sysgration Ltd. provides industrial IoT, automotive electronics, energy management, and redundant power supply solutions in Taiwan. It offers integration and mobile apps to control various vehicle on-board devices; real-time and wireless location tracking technology products for animals and assets; and smart retail services to connect vending machines for real-time telemetry and user behavior analytics services. The company also provides internal and external BLE TPMS products; and commercial solar and container based solar energy storage systems. In addition, it offers battery pack products, such as power stations, EV battery packs, and UPS LIB packs; rackmount solutions comprising slim type, CRPS, flex ATX, flex RPS, narrow type, battery backup PSU, and PSII mini RPS products; and power supply and battery backup centralized solutions. The company was founded in 1977 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11494",
        "website": "http://www.sysgration.com",
        "market_cap": "Mid Cap"
    },
    "6516.TWO": {
        "short_name": "KINGWAYTEK TECHNOLOGY CO LTD",
        "long_name": "Kingwaytek Technology Co., Ltd.",
        "summary": "Kingwaytek Technology Co., Ltd. produces electronic maps and develops GIS systems in Taiwan. It offers telecommunications maps, 3D maps, and high-definition maps for self-driving cars; and Leke navigation wang quan 3D, a mobile navigation software that provides 3D map, traffic lights along the way, road markings, signs, surrounding landmarks, viaducts, and navigation guidelines under the bridge. The company also provides Leke navigation king TM series that offers professional car networking navigation software for vehicle use; and Leker interchange, a transfer and pedestrian route guidance service. In addition, it offers big data services that are used in smart traffic diversion and enhancing public transport services; Leke store; and LE bus owner service. The company was founded in 2007 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "100",
        "website": "http://www.kingwaytek.com",
        "market_cap": "Mid Cap"
    },
    "7558.TWO": {
        "short_name": "BRYTON",
        "long_name": "Bryton Inc.",
        "summary": "Bryton Inc. develops, sells, and retails GPS cycle computers and accessories in Taiwan and internationally. It also operates an online store for products. The company was founded in 1998 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.brytonsport.com",
        "market_cap": "Small Cap"
    },
    "8289.TWO": {
        "short_name": "TAITIEN ELECTRONICS CO",
        "long_name": "Taitien Electronics Co., Ltd.",
        "summary": "Taitien Electronics Co., Ltd. manufactures and sells quartz frequency control components in Taiwan, the United States, Europe, and China. Its products include crystal units, crystal oscillators, VCXO, TCXO, OCXO, QCM, equipment, mini oven, and timing modules. The company serves automotive, consumer electronics, information technology, and telecommunication industries. Taitien Electronics Co., Ltd. was founded in 1976 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "238",
        "website": "http://www.taitien.com.tw",
        "market_cap": "Small Cap"
    }
}