{
    "2302.TW": {
        "short_name": "RECTRON",
        "long_name": "Rectron Limited",
        "summary": "Rectron Limited manufactures and sells discrete semiconductors in Taiwan and internationally. Its products include bridge rectifiers, ESD diodes, high voltage products, recovery rectifiers, schottky diodes, signal-switching diodes, silicon carbide schottky, standard rectifiers, transistors, TVS and zener diodes, MOSFET, and other products. Rectron Limited was founded in 1976 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "2338.TW": {
        "short_name": "TAIWAN MASK CORP",
        "long_name": "Taiwan Mask Corporation",
        "summary": "Taiwan Mask Corporation engages in the design, development, production, and sale of photomasks and integrated circuits for the semiconductor industry. The company also provides technology assistance, consultation, inspection, and maintenance services for masks and circuits; foundry services to semiconductor design companies; and packaging and testing services. In addition, it manufactures and sells medical wares. The company has operations in Taiwan, Asia, the Americas, and internationally. Taiwan Mask Corporation was founded in 1988 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "2369.TW": {
        "short_name": "LINGSEN PRECISION INDUSTRIES",
        "long_name": "Lingsen Precision Industries, Ltd.",
        "summary": "Lingsen Precision Industries, Ltd. operates in semiconductor industry in Taiwan, the United States, Europe, Japan, and China. It offers assembly and testing services. The company was founded in 1970 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "2436.TW": {
        "short_name": "WELTREND SEMI-CONDUCTOR INC",
        "long_name": "Weltrend Semiconductor, Inc.",
        "summary": "Weltrend Semiconductor, Inc., a fabless semiconductor company, engages in planning, designing, testing, developing, and distributing integrated circuit (IC) products in Taiwan and internationally. The company offers display ICs, including advanced driver assistance system SoC, display MCU, FPD SoC, 3D active shutter glasses ICs and smart projectors; and consumer ICs, such as consumer MCUs, touch device controllers, heart rate monitors, USB HID controllers, boosted NFC card solutions, and MSR and barcode decoders. It also provides power management and analog ICs comprising USB power and charging port controllers, motor drivers, LED drivers, SPS supervisors, and OP amplifiers; and microcontrollers include 8-bit ADC type MCUs, Andes and Arm based 32-bit MCUs products, and BLDC motor control ICs. In addition, the company distributes electronic components. Weltrend Semiconductor, Inc. was founded in 1989 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "2441.TW": {
        "short_name": "GREATEK ELECTRONICS INC",
        "long_name": "Greatek Electronics Inc.",
        "summary": "Greatek Electronics Inc. engages in the packaging and testing of various integrated circuits (IC) in Taiwan. The company offers wafer and final testing services, including testing program development, platform conversion, devices correlation, engineering, test peripheral equipment, and spare parts development service for logic, mix mode, and analog devices; IC semiconductor package assembly service; and package design services for electrical and thermal characterization. It also provides leadframe base packages, including P-DIP, transistor outline/small outline transistor/thin small outline transistor packages, small-outline packages (SOP), mini-SOP, shrink SOP, thin shrink SOP, small outline J-leaded and plastic leaded chip carrier packages, quad flat package (QFP), low profile QFP, and thin QFP. The company was formerly known as He Teh Integrated Circuit Co. Ltd. Greatek Electronics Inc. was founded in 1972 and is based in Miaoli, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Miaoli"
    },
    "2455.TW": {
        "short_name": "VISUAL PHOTONICS EPITAXY CO LTD",
        "long_name": "Visual Photonics Epitaxy Co., Ltd.",
        "summary": "Visual Photonics Epitaxy Co., Ltd. provides solutions for wireless and optical fiber communications, and solar cell applications. The company offers GaAs heterojunction bipolar transistor (HBT), low turn-on voltage HBT, high voltage HBT, InP HBT and HEMT, GaAs PHEMT and BiHEMT, and GaN epi wafers. It also provides GaAs PD, InGaAs PD and APD, Zn diffusion ready InGaAs PD and APD, long wavelength InGaAs PD, F-P and DFB LD, and VCSEL epi wafers; and solar cell epi wafers, as well as customerized epi foundry services. The company was founded in 1996 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "2481.TW": {
        "short_name": "PAN JIT INTERNATIONAL INC",
        "long_name": "Panjit International Inc.",
        "summary": "Panjit International Inc. designs, manufactures, and sells semiconductors in China, North America, Germany, Korea, and internationally. It offers low/medium/high voltage MOSFETs; Schottky rectifiers and diodes; SiC Schottky barrier diodes; diode rectifiers; protection devices, such as Zener diodes, ESD protection devices, transient voltage suppressors, and load dump transient voltage suppressors; bipolar junction transistors; bridge rectifiers; and packing information solutions. Its products are used in automotive, industrial, and power supply applications. The company was founded in 1986 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Kaohsiung"
    },
    "2493.TW": {
        "short_name": "AMPOC FAR EAST CO",
        "long_name": "Ampoc Far-East Co., Ltd.",
        "summary": "Ampoc Far-East Co., Ltd. manufactures and sells equipment and materials for the electronic industry in Taiwan. Its products have applications in printed circuit boards, FPD and touch panels, IC packaging, light emitting diode and OLED, solar cells, IC wafers and substrates, passive devices and components, MEMS, consumables and others, and inspection tools. The company provides its products in Mainland China and Hong Kong through its service centers and distribution channels. AMPOC Far-East Co., Ltd. was founded in 1980 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "3016.TW": {
        "short_name": "EPISIL PRECISION INCORPORATION",
        "long_name": "Episil-Precision Inc.",
        "summary": "Episil-Precision Inc. engages in the research, development, production, and sale of epitaxial Si/SiC/GaN wafers in Taiwan and internationally. The company offers epitaxial wafers, such as silicon epitaxial, SiC on SiC epitaxial, and GaN on Si epitaxial wafers for use in power discretes, power ICs, image sensors, graded Epis, buried layer Epis, and multi-layer Epis. It also provides buried layer epitaxial services. The company was founded in 1998 and is headquartered in Hsinchu City, Taiwan. Episil-Precision Inc. is a subsidiary of Episil Holding Inc.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "3028.TW": {
        "short_name": "ZENITRON CORP",
        "long_name": "Zenitron Corporation",
        "summary": "Zenitron Corporation distributes semiconductor components in Taiwan and Greater China. The company offers supplier line cards; and IT, handheld, telecom and networking, IoT, industrial electronics, consumer, automotive, and power supply products, as well as digital products. It also provides application design solutions, such as power management, home appliance, IoT, peripheral/human machine interface, telecommunications and networking, and video display. In addition, the company offers turnkey solutions and design consultations services. Zenitron Corporation was founded in 1982 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "3033.TW": {
        "short_name": "WEIKENG INDUSTRIAL CO",
        "long_name": "Weikeng Industrial Co., Ltd.",
        "summary": "Weikeng Industrial Co., Ltd. distributes electronic components and peripherals for computing, communications, consumer, automotive, and industrial applications in Taiwan. The company offers storage, micro controller, embedded processor, power discrete IC, sensing and display, discrete and passive components, programmable logic and display systems, ESD protection, connectors, digital audio/video, and USB products. It also offers technical support services; and data center, IoT application, data and communications, automotive, networking, industrial electronics, and consumer solutions. Weikeng Industrial Co., Ltd. was founded in 1977 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "3035.TW": {
        "short_name": "FARADAY TECHNOLOGY",
        "long_name": "Faraday Technology Corporation",
        "summary": "Faraday Technology Corporation operates as a fabless ASIC/SoC and silicon intellectual property (IP) provider worldwide. The company offers SoC design services and evaluation platforms; and ASIC services. It also provides IP products, including library and memory compilers, processor cores, analog IPs, peripheral IPs, and interface IPs. The company offers design solutions for a range of applications comprising consumer electronics, multimedia, display, communication, networking, and PC peripheral/storage. Faraday Technology Corporation was founded in 1993 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "3055.TW": {
        "short_name": "SPIROX CORP",
        "long_name": "Spirox Corporation",
        "summary": "Spirox Corporation provides integrated solutions to the semiconductor, electronics manufacturing, telecom, and automobile markets worldwide. The company offers wafer level test handlers, analog/mixed signal and logic options, thermal chuck systems, memory testers, thermal and inverted emission microscopes, semiconductor test systems, mass production test handlers, automatic probers, power device test systems, fluxless reflow systems, wafer inspection systems, probe cards, docking interfaces, LCD driver IC test systems, and memory test systems. It has partnerships with AFORE Oy; ERS electronic GmbH; EXICON Co., Ltd.; Hamamatsu Corporation; HANWA Electronic Ind. Co., Ltd.; INTEKPLUS CO., Ltd.; Osai A.S.; SEMICS Inc.; ShibaSoku Corporation; STI Co. Ltd.; Toray Engineering Co., Ltd.; Translarity Inc.; Turbodynamics GmbH; Wintest Corp.; and YIK Corporation. The company was founded in 1987 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "3081.TWO": {
        "short_name": "LAND MARK OPTOELECTRONICS CORP",
        "long_name": "LandMark Optoelectronics Corporation",
        "summary": "LandMark Optoelectronics Corporation produces and supplies gallium arsenide (GaAS) and indium phosphide (InP) based epitaxial wafers for optical communication, industrial application, and special-purpose usages in Taiwan, the United States, Mainland China, and internationally. It offers InP laser diode (LD) epi wafers for use in LDs used for optics communications; photo-detector epi wafers for use in photo detectors, avalanched detectors, and laser efficiency monitoring for optics communications; and GaAs LD epi wafers for use in high-efficiency laser manufacturing, bar code scanners, GPS systems, 3D sensors, detectors for Lidar autonomous cars, aesthetic medicine machines, and information center communication equipment, as well as provides optical semi-conductors, LDs, and InAlGaP/AlGalnAs. In addition, the company provides Zn-diffusion services for photo detectors; and grating forming and regrowth services for distributed feedback, as well as selected area growth services. LandMark Optoelectronics Corporation was founded in 1997 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Tainan City"
    },
    "3150.TWO": {
        "short_name": "SYNCOMM",
        "long_name": "Syncomm Technology Corp.",
        "summary": "Syncomm Technology Corp. operates as a fabless semiconductor company worldwide. It offers portable products, wireless SOC integrating audio and data processors, and wireless digital modules for use in smart TVs, computers, and mobile devices, as well as PC peripheral, console gaming, portable accessory, and home audio applications. The company was founded in 1998 and is based in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu"
    },
    "3264.TWO": {
        "short_name": "ARDENTEC CORPORATION",
        "long_name": "Ardentec Corporation",
        "summary": "Ardentec Corporation provides semiconductor testing solutions in memory, logic, and mixed-signal ICs (integrated circuits) to integrated device manufacturers, pure play wafer foundry companies, and fabless design companies. The company offers testing services comprising engineering services before mass production, such as test engineering consultations and recommendations for design, test plan and test program development, test program cross-platform conversion, complete product characterization, and laser program development and analysis; and mass production engineering services consisting of suggestions and services of test time reduction, yield analysis and enhancement, laser repair yield analysis and improvement, timely retrieval of test data on secured Internet, test program management system, test data analysis and periodical report provision, and outlier management services, as well as stable testing services. It also provides probe card design and consultant, outsourced manufacturing, and maintenance and system management for repair record and tracking services; wafer level chip scale packaging backend process services; and wafer probing platforms. In addition, the company offers certification, and quality system and assurance structure services, as well as quality, information security, and hazardous substance free policy services; and IT policy, IT service architecture, and testing information services. Further, it provides testing and assembly services; electronic ICs, diodes, transistors, and semiconductor devices; IC devices testing and trimming services; ICs, module, and component testing services; and manufactures electronic components. Additionally, the company offers burn in testing of wafer types; wafer testing for LCD driver ICs and analog ICs; and wafer and final testing of radio frequency ICs. It operates in the United States, Taiwan, Singapore, Korea, China, and internationally. The company was founded in 1999 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "3265.TWO": {
        "short_name": "WINSTEK SEMICONDUCTOR CO LTD",
        "long_name": "Winstek Semiconductor Co., Ltd.",
        "summary": "Winstek Semiconductor Co., Ltd. engages in the research, development, and testing of integrated circuits in Taiwan. The company operates through two divisions, Testing and Packaging. It offers wafer sort, final and post test, engineering support, and test platforms services; copper pillar bump, wafer level chip scale package, lead free bump, plating bump / ball drop, and backside metallization services; die processing services, wafer thinning, singulation, and flip chip packaging services; and failure analysis and reliability test services. The company was formerly known as Stats ChipPac Taiwan Semiconductor Corp. and changed its name to Winstek Semiconductor Co., Ltd. in June 2015. Winstek Semiconductor Co., Ltd. was founded in 2000 and is headquartered in Hsinchu, Taiwan. Winstek Semiconductor Co., Ltd. is a subsidiary of Singapore Merchants Bloomeria Limited.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "3490.TWO": {
        "short_name": "SINGLE WELL INDUSTRIAL CORPORAT",
        "long_name": "Single Well Industrial Corporation",
        "summary": "Single Well Industrial Corporation designs, produces, and sells molds and auto machines in Taiwan, Japan, and internationally. The company offers semi-conductor and LED molding, IC molding, deflashing, trimming, and forming dies, as well as parts of dies, including overhauling on molding dies. It also provides deflash/trim/singulator auto machines, test products, handlers, tapings, auto loaders, solder dippings, epoxy dispensing products, insert tubes, manu press, and parts. In addition, the company offers package molds, such as resistors/diodes and sim/flash drives; and automated machineries, including photo couplers, high powers, semiconductors, LEDs, and IRMs, as well as engages in solar energy business. It serves manufacturers of electronic parts and semi-conductors. Single Well Industrial Corporation was founded in 1989 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3532.TW": {
        "short_name": "FORMOSA SUMCO TECHNOLOGY CORP",
        "long_name": "Formosa Sumco Technology Corporation",
        "summary": "Formosa Sumco Technology Corporation manufactures, sells, and trades in primarily in Taiwan. It offers polished, annealed, epitaxial, and test wafers. The company was founded in 1995 and is headquartered in Yunlin, Taiwan. Formosa Sumco Technology Corporation is a subsidiary of Sumco Techxiv Corporation.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Yunlin"
    },
    "3551.TWO": {
        "short_name": "SHIH HER TECHNOLOGIES INC.",
        "long_name": "Shih Her Technologies Inc.",
        "summary": "Shih Her Technologies Inc. provides precision clean and reborn treatment for semiconductor, photoelectricity, and solar energy's manufacturing equipment parts. The company was founded in 1977 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "3685.TWO": {
        "short_name": "TRADETOOL AUTO CO LTD",
        "long_name": "Tradetool Auto Co., Ltd.",
        "summary": "Tradetool Auto Co., Ltd. develops and sells automotive optics, metal stamping, and welding parts in Taiwan. The company offers automotive metal parts, such as metal parts stamping, metal component welding, and stamping die products. It also provides automotive optics parts, including display optical injection component; LED headlight lens and lens core; and head up displays (HUD) comprising HUD freeform mirror injection and coating, HUD freeform mirrors, HUD combiners, and VR lens. The company was formerly known as Jeng Shiang Precision Ind. Co., Ltd. and changed its name to Tradetool Auto Co., Ltd. in May 2016. Tradetool Auto Co., Ltd. was founded in 1980 and is headquartered in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung City"
    },
    "3688.TWO": {
        "short_name": "HLJ",
        "long_name": "HLJ Technology Co., Ltd.",
        "summary": "HLJ Technology Co., Ltd. manufactures and sells photoelectric semiconductors. The company offers epitaxial wafer, optical communication, light-sensor, and lighting products for proximity sensor, high-speed optical fiber communication, gesture recognition, optical sensor, laser monitor, time of flight, long distance night vision surveillance system, and optical communication applications. It also provides foundry and design services. The company was incorporated in 2001 and is based in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "4760.TWO": {
        "short_name": "AMPLE ELECTRONIC TECHNOLOGY CO ",
        "long_name": "Ample Electronic Technology Co.,Ltd.",
        "summary": "Ample Electronic Technology Co.,Ltd. produces and sells thick-film conductors in Taiwan. It offers pastes for terminal and internal electrodes of passive components, copper and silver paste products, and solar cells; and conductive silver pastes for touch panels, membrane switches, and LED and IC packages. The company was founded in 2007 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Kaohsiung"
    },
    "4944.TWO": {
        "short_name": "CRYSTALWISE TECHNOLOGY INC.",
        "long_name": "Crystalwise Technology Inc.",
        "summary": "Crystalwise Technology Inc. manufactures and sells hard substrates in Taiwan. The company offers CMOS, GaAs, and CZ wafers, as well as various types of substrates. Its products include sapphire substrate used for blue-light/green-light LED; substrates used for surface acoustic wave filter devices; sapphire cover glasses for smart phones and smart watches, as well as sapphire camera lens and sapphire finger sensor lens; sapphire function, power, volume, etc. keys for phone; sapphire window and heat spread substrates for LED products; and other type of substrate used in optronic and semiconductor industries. The company serves semiconductor, optoelectronics, optical fiber communications, wireless communications, and other industries. Crystalwise Technology Inc. was founded in 2000 and is headquartered in Miaoli, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Miaoli"
    },
    "5222.TWO": {
        "short_name": "TRANSCOM",
        "long_name": "Transcom, Inc.",
        "summary": "Transcom, Inc. operates as a microwave device and subsystem company in Taiwan and internationally. The company offers wideband and narrowband solid-state power amplifiers; MIC and transceiver modules; FET chips; packaged FETs; monolithic microwave integrated circuits (MMIC); hybrid ICs; directional couplers; power dividers; fixed attenuators and termination; and MIS chip capacitors. It also provides MMIC foundry services. Transcom, Inc. was founded in 1998 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Tainan City"
    },
    "5272.TWO": {
        "short_name": "AMICCOM ELECTRONICS CORPORATION",
        "long_name": "AMICCOM Electronics Corporation",
        "summary": "AMICCOM Electronics Corporation, a semiconductor company, provides RF ICs in Taiwan. The company offers 2.4 GHz, sub 1GHz, and 5.8/5.2 GHz short range devices, as well as wireless audio, Bluetooth LE/Zigbee, and satellite/LNB/DBS products. Its products are used in thermometer and voice remote control applications. The company was founded in 2005 and is headquartered in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Zhubei"
    },
    "5351.TWO": {
        "short_name": "ETRON TECHNOLOGY INC",
        "long_name": "Etron Technology, Inc.",
        "summary": "Etron Technology, Inc. develops buffer memory and system-on-chips in the United States, Europe, Japan, and Asian countries. The company offers known-good-die-memory integrated circuits (ICs), specialty dynamic random access memories (DRAMs), automotive DRAMs, consumer electronic DRAMs, and industrial DRAMs; and system ICs, including USB 3.0 host and flash drive controllers, Webcam controllers, and depth map controllers. It also provides eDRAM-by-dies, DRAM design-and-dies, and DRAM design-and-die foundry services, as well as boot device solutions. The company offers its products for use in AIOT, display panel, VR/AR, robot, automobile, communication, and computer applications. Etron Technology, Inc. was founded in 1991 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu"
    },
    "5434.TW": {
        "short_name": "TOPCO SCIENTIFIC CO",
        "long_name": "Topco Scientific Co.,Ltd.",
        "summary": "Topco Scientific Co., Ltd. provides precision materials, processing equipment, and components for semiconductor and opto-electronic industries in Taiwan, China, and internationally. It also offers semiconductor related products, such as wafer and wafer processing materials; wafer carriers; thin films; photolithography materials; etching and furnace products, including quartz glass products, chemical, and special gases; CMP slurry products; package and testing related materials and equipment; and semiconductor equipment. In addition, the company offers LCD related equipment and materials; LED related photoelectric related products; solar materials comprising conductive paste for solar cells, quartz crucibles, SiC powder, coolants, diamond wires, chemicals, and special gases; and electronic materials. Further, it undertakes water treatment, clean room and electromechanical, and public construction projects; and solar power plant projects, as well as provides IC foundry services. The company was founded in 1990 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "5443.TWO": {
        "short_name": "GALLANT PRECISION MACHINING CO",
        "long_name": "Gallant Precision Machining Co., Ltd.",
        "summary": "Gallant Precision Machining Co., Ltd. engages in the research and development, production, manufacture, and sale of FPD, semiconductor, intelligent automatic, and biomedical equipment in Taiwan, China, and internationally. The company provides molds and machinery, metal and mold parts, stamping and die-cast parts, and automated manufacturing systems, as well as unit equipment. Its products comprise FT-LCD / OLED / flexible OLED display process equipment, including TEG probers, and array testers, cleaners, and wet etchings; edge grinding and polarizer attachment machines, cell and in-process tester, and thinned glass surface defect inspection equipment; edge /plasma and excimer UV cleaners; panel surface inspection and burr checker system; cassette station, loader / unloader and automation, and dense packer / unpacker C/V, buffer etc.; semiconductor failure analysis testing equipment; and trim/form, auto molding, IC substrate punch, die set/kit for trim/form, fully auto panel molding systems, and auto sealing machine molds, as well as FC bump coin lamination equipment. The company also offers grain pick/place, IC bonding, IC die multi-face inspection and sorting, and heat sink covering machines; laser marking machines; substrate, strip, and panel grinders; batch etchers, stripers, developers, and cleaners; wafer surface defect inspection machine and white light interference measurement system; intelligent logistics and factory integration, solar cell automation handling, intelligent diagnosis and preventive maintenance, and robot handling and machining systems, as well as process automation equipment and lithium ion battery core seal welding and lamination device products. In addition, it engages in wholesale and retail of contact lenses and related care products. Gallant Precision Machining Co., Ltd. was founded in 1978 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "5483.TWO": {
        "short_name": "SINO-AMERICAN SILICON PRODUCTS ",
        "long_name": "Sino-American Silicon Products Inc.",
        "summary": "Sino-American Silicon Products Inc. researches, develops, designs, manufactures, trades, and sells semiconductor ingots and wafers, varistors, optoelectronics, and communication wafer materials. It provides CZ/FZ/NTD silicon ingots, Epi wafers, polished wafers, antimony-doped wafers, etched wafers, TVS wafers, arsenic-doped wafers, ultra-thin wafers, deep diffusion wafers, solar ingot and wafers, cells, modules, and sapphire wafers. The company also investment activities; and solar power generation business. It operates in Taiwan, Japan, Korea, rest of Asia, the United States, Europe, and internationally. The company was founded in 1981 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "6176.TW": {
        "short_name": "RADIANT OPTO-ELECTRONICS CORP",
        "long_name": "Radiant Opto-Electronics Corporation",
        "summary": "Radiant Opto-Electronics Corporation designs, manufactures, assembles, and markets backlight modules and light guide plates for liquid crystal display (LCD) panels in Asia, Europe, and the United States. The company's backlight modules are used in various applications, including smartphones, DSC, smart speakers, vehicle panels, tablets, notebooks, dashboards, pocket TVs, DVD players, car navigations, monitors, all in one PCs, and TFT LCD TVs. Radiant Opto-Electronics Corporation was founded in 1995 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Kaohsiung"
    },
    "6182.TWO": {
        "short_name": "WAFER WORKS CORPORATION",
        "long_name": "Wafer Works Corporation",
        "summary": "Wafer Works Corporation engages in the manufacture and supply of silicon wafers worldwide. It offers polished silicon and epitaxial wafers, as well as single crystal ingots and doped silicon wafers used in semiconductor devices for power and digital applications. The company supplies its products through sales representatives. Wafer Works Corporation was founded in 1997 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "6218.TWO": {
        "short_name": "HAUMAN TECHNOLOGIES CORP",
        "long_name": "Hauman Technologies Corp.",
        "summary": "Hauman Technologies Corp. develops products and solutions for information technology, semiconductor, optoelectronics, and photovoltaic industries in Taiwan, Mainland China, and the United States. The company offers hardware and software products; and application services, including planning, marketing, sales, installation, training, system maintenance, and integration services to the government agencies, institutions of higher learning, research institutes, financial institutions, and multinational corporations. It also provides materials, equipment, and automatic packaging and testing instruments; and wafer probers, IC test handlers, underfill dispensers, package inspection solutions, ATE testers, LED probers and sorters, X-ray inspection systems, solar cell texturing and manufacturing AOI systems, ESD monitoring systems, cleaning systems, sealing machines, cutters, forming machines, machine vision systems, texturing systems, automatic inspection systems, LED and LCD process, etc. The company was formerly known as Hauman Enterprise and changed its name to Hauman Technologies Corp. in 2000. The company was founded in 1979 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "6239.TW": {
        "short_name": "POWERTECH TECHNOLOGY INC",
        "long_name": "Powertech Technology Inc.",
        "summary": "Powertech Technology Inc., together with its subsidiaries, researches, designs, develops, assembles, manufactures, packages, tests, and sells various integrated circuit (IC) products worldwide. The company provides IC backend services, which include IC chip probing, packaging, final testing, and burn in to end products. It also offers Quad Flat No Lead package services for electrical interconnection in handheld devices, such as cellular phones, PDAs, MP3s, game consoles, and other portable products; redistribution layer services for au or cu wire bonding; copper pillar and lead-free bumping services; chip scale package and chip on wafer for packaging CMOS image sensors; FBGA (BOC) packages; and FBGA packages for smart phones, tablets, and SSD products. In addition, the company provides thin smaller outline packages for various devices, including ROM, NOR, NAND Flash, SDRAM, and DDR; packaging and testing services for the memory card-micro SD cards; multi-chip packages for various handheld or data storage devices, such as cellular phones, PDAs, mobile game platforms, digital consumer devices, removable memory cards, USB drives, etc.; and system-in-packages for graphics processor, CPU, digital mobile TV, GPS, Wi-Fi, Wimax, Bluetooth, baseband, air bag detector, tire pressure gauge, keyless products, etc. Further, it offers package-on-package/package-in-package services for space savings, enhanced wafer thinning technology, control on warpage, and eliminated die cracks; FCBGA packages for chipsets and microprocessors; and FCCSP packages for graphic memory products and cellular phones. Additionally, the company is involved in the semiconductor testing and assembly; and the investment businesses, as well as provides wafer probing test services. Powertech Technology Inc. was founded in 1997 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "6257.TW": {
        "short_name": "SIGURD MICROELECTRONICS CORP",
        "long_name": "Sigurd Microelectronics Corporation",
        "summary": "Sigurd Microelectronics Corporation, together with its subsidiaries, engages in the design, processing, testing, burn-in treatment, manufacture, and trading of integrated circuits in Taiwan, Singapore, China, the United states, and internationally. The company provides testing services for various IC and wafers; TSOT and STO packaging; quad flat no lead packaging; RF module packaging and testing; photosenaor packaging and testing; wafer level chip scale package technology; solder bumping; and Cu-pillar. It also offers assembly services comprise wafer grinding and chip sawing, and MEMS, multi-chip ICs, RF modules, optical device, and analog/power ICs assembly services. In addition, the company provides research and development, and engineering services, including mass production, test engineering, and assembly engineering solutions. Further, it is involved in manufacture and sale of medical equipment; provision of digital information supply services; and commodity broker businesses. The company serves semiconductor design houses, IDMs, and wafer foundries. The company was formerly known as More Power Electronic Co., Ltd. Sigurd Microelectronics Corporation was founded in 1988 and is headquartered in Hsin-Chu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "6278.TW": {
        "short_name": "TAIWAN SURFACE MOUNTING TECHNOL",
        "long_name": "Taiwan Surface Mounting Technology Corp.",
        "summary": "Taiwan Surface Mounting Technology Corp. provides LCD surface-mount technology production solutions in Mainland China, Taiwan, Europe, the United States, Asia, and internationally. It offers digital camera and cellular phone LCD panel control boards; notebook and television TFT-LCD panel control boards; LED TV power supply control boards; and LCD TV inverter control boards. The company also provides micro projector and touch panel control boards, wireless controllers, DVD R/W control boards, TV set control boards, refrigerator display panels, and lighting application control boards; and digital camera/cellular, automotive dashboard panel, note book, and PC/LCD television backlight bars. Taiwan Surface Mounting Technology Corp. was founded in 1990 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "6532.TWO": {
        "short_name": "CALITECH CO LTD",
        "long_name": "Calitech Co., Ltd.",
        "summary": "Calitech Co., Ltd. develops technology solutions for semiconductor, III/V, MEMS, LED, and display industries worldwide. The company offers semiconductor critical components for applications in chemical mechanical polishing fabrication equipment, etching, chemical vapor deposition, physical vapor deposition, etc. It also provides systems, such as spray solvent tools, spray acid tools, and spin rinse dryers; and electrostatic chucks for semiconductor and other industries. The company was founded in 1998 and is based in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "6683.TWO": {
        "short_name": "KEYSTONE MICROTECH CO",
        "long_name": "Keystone Microtech Corporation",
        "summary": "Keystone Microtech Corporation operates in the semiconductor industry. It offers load boards, probe cards/substrate, and modules for load boards/probe cards. The company was founded in 2006 and is headquartered in Zhubei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Zhubei City"
    },
    "6684.TWO": {
        "short_name": "Algoltek",
        "long_name": "Algoltek, Inc.",
        "summary": "Algoltek, Inc. provides building bloc IPs in Taiwan. The company offers solutions for video conversion in various formats, such as MHL, HDMI, VGA, DisplayPort, and type-C ALT mode; ASIC solutions for switching/splitting video signal between sink and source devices; signal extension and redriver solutions; and protocol controls for power delivery application. It also provides design assistance that enables IC designers to accelerate SoC designs from planning to SoC silicon. Algoltek, Inc. was founded in 2010 and is based in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Zhubei"
    },
    "6735.TWO": {
        "short_name": "AMIDA",
        "long_name": "AMIDA Technology, Inc.",
        "summary": "AMIDA Technology, Inc. develops and provides electronic testing and measurement solutions for the semiconductor and optical industries in Taiwan. The company offers CMOS image sensing testers and VCSEL wafer measurement systems; analog and mixed signal testers; and high power 3600 series testers. It also provides PCI modules, such as GPIB cards with PCI interfaces; time interval counter modules for PCI computers; and single-channel PCI-based arbitrary waveform generators. The company was founded in 2002 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6787.TWO": {
        "short_name": "KINGRAYTECH",
        "long_name": "Kingray Technology Corporation, Ltd.",
        "summary": "Kingray Technology Corporation, Ltd. engages in the semiconductor wafer, diode, and LED epitaxil wafer business. It offers narrow band pass filters, new blue glasses, organic blue glasses, blue glass filters, reflective and UV IR cut filters, optical filters, rectangle and octagon OEM dicing products, and circular OEM drills; high reflective filters, anti-reflective filters, IR pass filters, beam spiltters, and dichroic color filters; and mobile phone camera module assemblies and security surveillance camera modules. The company was founded in 1999 and is based in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu"
    },
    "8064.TWO": {
        "short_name": "CONTREL TECHNOLOGY CO LTD",
        "long_name": "Contrel Technology Co., Ltd.",
        "summary": "Contrel Technology Co., Ltd. engages in the research, development, manufacture, and sale of LCD equipment in Taiwan and internationally. The company offers panel automation products, such as CF/TFT whole plant, LCD whole factory panel, and RTP/RTS whole line panel transmission equipment integration system, as well as pack/unpack equipment; panel process equipment; and glass appearance inspection, burr check, electrical testing, light on test, MACRO, and mini LED test equipment, as well as PAD inspection machine. It also provides semiconductor automation solutions, such as EFEM integrated system, OHS automated handling system, storage systems, and automatic optical inspection products, as well as laser cutting, pattering, drilling, and repair equipment. In addition, the company offers laser equipment, including TFT array and LCD cell repair equipment, LCD bright point repair systems, OLED dark point repair equipment, circuit missing line repair machine, carbonization machine, glass cutting machine, OLED mask clean equipment, and laser marking/automatic optical inspection systems; logistic systems, including sorting system, automatic warehouse and handling system, and intelligent logistics equipment; LED vacuum coating equipment, such as glue, evaporation, optical, and continuous sputtering machine; and micro nano products. Contrel Technology Co., Ltd. was founded in 1998 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Tainan City"
    },
    "AYN.SI": {
        "short_name": "Global Testing",
        "long_name": "Global Testing Corporation Limited",
        "summary": "Global Testing Corporation Limited, an investment holding company, engages in the semiconductor testing business in Singapore, the United States, Taiwan, the People's Republic of China, Japan, and internationally. It offers testing services, such as wafer sorting and final testing to the semiconductor industry, focusing on logic and mixed signal semiconductors used in consumer electronics and communication devices. The company also provides test program development, conversion, and optimization services; and load board and probe card design services, as well as leases its customers for trial and pilot testing purposes on an ad hoc basis. In addition, it offers wafer testing services to the automotive devices industry. The company was founded in 1998 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    }
}