{"2342.TW": {"short_name": "MOSEL VITELIC INC", "long_name": "Mosel Vitelic Inc.", "summary": "Mosel Vitelic Inc. manufactures and sells power semiconductor components and power management ICs in Taiwan. It primarily offers trench power metal oxide semiconductor field effect transistors, trench insulated gate bipolar transistors, analog ICs, and diodes that are used in computers, LCD screens and TVs, mobile phone batteries, machine tools, LED lighting, power supplies, automotive electronics, and other fields. Mosel Vitelic Inc. was founded in 1987 and is based in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "2344.TW": {"short_name": "WINBOND ELECTRONIC CORP", "long_name": "Winbond Electronics Corporation", "summary": "Winbond Electronics Corporation, together with its subsidiaries, designs, develops, manufactures, and markets very large scale integration integrated circuits (ICs) for various microelectronic applications in Asia, the United States, Europe, and internationally. It operates through DRAM IC Product, Flash Memory product, and Logic IC Product segments. The company offers mobile dynamic random access memory (DRAM) devices, including pseudo static random access memory (SRAM), low power double-data-rate (DDR) synchronous dynamic random access memory (SDRAM), low power SDR SDRAM, and known good die (KGD) products, as well as low power DDR1, DD2, DDR3, and DD4/4X SDRAM products. It also provides specialty DRAM products, such as SDRAM, DDR SDRAM, DDR2 SDRAM, DDR3 SDRAM, and KGD products; code storage flash memory products comprising serial NOR, SPI and SLC NAND, and TrustME secure flash memory products, as well as parallel flash, serial flash, authentication flash, and KGD products; and logic IC products. The company's products are used in computing, communication, and consumer electronics; automotive and industrial electronics, and medical electronics; wearable devices; cell phones, tablets, low power mobile handheld devices, and Internet of things; and personal computers and their peripherals, mobile handheld devices and their peripheral modules, network communications products, and household appliance modules, etc. It markets its products through distributors and online. Further, it is involved in the research, development, design, sale, and after-sales service of semiconductors and 6 inch wafer products; electronic commerce and product marketing; provision of test, OEM, repair, software consultation, and computer software services; and wholesale business for computer, supplements, and software, as well as project sale. The company was founded in 1987 and is headquartered in Taichung, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung"}, "2393.TW": {"short_name": "EVERLIGHT ELECTRONICS CO", "long_name": "Everlight Electronics Co., Ltd.", "summary": "Everlight Electronics Co., Ltd. provides LEDs, lamps, lighting components, LED lighting modules, opto-couplers, and infrared components for various applications worldwide. The company offers visible LED products, including horticulture, automotive, flash, UV, and SMD LEDs, as well as COB, LED lamps, and LED digital displays; infrared LED and silicon detectors; infrared receiver modules; optic fiber devices; and optical switch products. It also provides optical ICs comprising ambient light, proximity, and RGB color sensors; photo couplers, IGBT, and SSR products, such as solid state relays, photo darlington products, high speed products, schmitt triggers, photo transistora, and triac drivers; and RoHS/REACH products. The company's products are used in TV-monitors, home appliances, mobile devices, indoor and outdoor signage products, digital displays, and LED light bars, as well as for lighting, automotive, and industrial applications. Everlight Electronics Co., Ltd. was founded in 1983 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "2401.TW": {"short_name": "SUNPLUS TECHNOLOGY", "long_name": "Sunplus Technology Company Limited", "summary": "Sunplus Technology Company Limited, together with its subsidiaries, researches, develops, designs, tests, and sells consumer integrated circuits (ICs) for multimedia audio/video, single-chip microcontrollers, and digital signal processors primarily in the Asia, Taiwan, and internationally. The company provides media player ICs for DVD player and portable DVD player; audio ICs for karoke, soundbar, and boom box, as well as party and DJ speaker; automotive ICs for application in infotainment, driver assistance, and display audio; and ultra-low power ECG sensor AFE IC, a wearable solutions for measuring electrocardiogram. It also offers Internet protocol (IP) solutions, such as high-speed I/O IP, high performance data conversion IP (ADC/DAC/AFE), and analog IP development for application in consumer, portable, and connected devices; and PLUS1 series ICs for industrial control, smart devices, smart vision, voice recognition, maker market, and high computing power demand applications. In addition, the company engages in management consulting; investments, system integration, market research survey, and information management and education services, as well as developing, manufacturing, and selling of computer software. Further, it is involved in building rental and property management activities. Sunplus Technology Company Limited was founded in 1990 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "2408.TW": {"short_name": "NANYA TECHNOLOGY CORPORATION", "long_name": "Nanya Technology Corporation", "summary": "Nanya Technology Corporation manufactures and sells dynamic random access memory (DRAM) and other memory products in Taiwan and internationally. The company's products have applications in mobile phones, servers, PC, consumer electronics, and automotive applications. Nanya Technology Corporation was founded in 1995 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "2426.TW": {"short_name": "TYNTEK CORP", "long_name": "Tyntek Corporation", "summary": "Tyntek Corporation manufactures and sells LED chips. The company offers visible LED, ultra HB LED, infrared LED, InGaAs/InP, and GaP/GaP regulator chips; SI products, such as Si submount, Si resistor, Si zener diode, ambient sensor, Si photo-transistor, Si photo-diode, and other chips; and optical fiber communication device products, including InGaAs/InP PD and LED chips. It also provides LED, and indoor and outdoor lighting products, as well as car, truck, motorcycle, and bicycle lighting products; and professional blue LED manufacturing services. The company was founded in 1987 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu"}, "2434.TW": {"short_name": "MOSPEC SEMICONDUCTOR CORP", "long_name": "Mospec Semiconductor Corp.", "summary": "Mospec Semiconductor Corp. produces and sells semiconductor products primarily in Taiwan. The company offers solar cells, epitaxial silicon wafers, polished prime wafers, and wafer reclamation products, as well as surface mount devices. It also provides discrete components, such as schottky barrier rectifiers, fast recovery rectifier diodes, ultra-fast rectifier diodes, high efficiency rectifier diodes, transient voltage suppressor diodes, small signal schottky diodes, and mini dip bridges; and power transistors, such as Darlington and switching transistors. In addition, the company offers foundry services for silicon epitaxy, wafer fabrication, and semiconductor packaging. Mospec Semiconductor Corp. was founded in 1987 and is headquartered in Tainan City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Tainan City"}, "2458.TW": {"short_name": "ELAN MICROELECTRONICS CORP", "long_name": "ELAN Microelectronics Corporation", "summary": "ELAN Microelectronics Corporation manufactures and sells neural network and fuzzy processors, digital signal processors, 8-bit RISC micro-controllers, and integrated circuits in Taiwan, China, Hong Kong, and internationally. It operates through seven segments: Consumer Touch Control Business Unit, Laptop Input Device Business Unit, Network Communication Business Unit, Image Processing Design Business Unit, Product Safety Surveillance Business Unit, Investment Business Unit, and Sales Department and Other Departments. The company's products include consumer touch control ICs, notebook input devices modules, network communication ICs, video process ICs, and safety monitoring modules. It also engages in the manufacture and sale of safety surveillance systems; electronic devices; discrete multi-tone chips, client chips, PON to OLT and ONU chips, and GHN chips; digital image-process chips; and Web cameras and servers, as well as system design and information on applications expansion activities. The company's touchscreen controllers and touchpad module solutions are used in notebook PCs, smartphones, tablets, and wearable devices. ELAN Microelectronics Corporation was founded in 1994 and is headquartered in Hsinchu City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "2478.TW": {"short_name": "TA-I TECHNOLOGY", "long_name": "TA-I Technology Co., Ltd.", "summary": "TA-I Technology Co., Ltd. manufactures and supplies chip resistors in Taiwan and internationally. The company's products include chip resistor arrays, current sensing chip resistors, over current and over voltage protection products, and temperature sensitive resistors. Its components are applied to products in the field of 3C, including motherboards, notebooks, LCD TVs, STBs, scanners, video cards, modem cards, sound cards, mobile phones, digital cameras, LCDs, etc. The company was founded in 1989 and is based in Taoyuan, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "3034.TW": {"short_name": "NOVATEK MICROELECTRONICS", "long_name": "Novatek Microelectronics Corp.", "summary": "Novatek Microelectronics Corp., together with its subsidiaries, research, develop, manufacture, and sell integrated circuit chips for speech, communication, computer peripheral, LCD driver IC system, embedded MCU, DSP, and system applications. The company offers display driver ICs for LCD displays, televisions (TVs), notebook computers, desktop monitors, cameras, tablet PCs, automotive display screens, smart phones, and mobile phones; and system on chips products for digital and smart TVs, notebook computers, desktop monitors, set-top boxes, mobile phones, tablet PCs, camera modules, dashcam recording, IP cams, car backup camera modules, automotive safety assistance systems, and multimedia and mobile phone camera module applications. It is also involved in the trading and consulting of electronic spare parts; and provision of design, development, amendment, testing, and related consulting services for multimedia VLSI software. The company has operations in Taiwan, Asia, and internationally. Novatek Microelectronics Corp. was founded in 1997 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "3094.TW": {"short_name": "DAVICOM SEMICONDUCTOR INC.", "long_name": "Davicom Semiconductor, Inc.", "summary": "Davicom Semiconductor, Inc. engages in the research, development, manufacture, and sale of communication network integrated circuits in Taiwan and internationally. The company offers ethernet, ethernet switch controller, industrial embedded transceiver, ethernet converter, dongle, and video decoder with safety monitoring. It also provides local area network chipsets for use in computer communications application on the network cards, hubs, and switches, as well as for use in local network resources to transfer and share; wide area network chipsets that are used as a remote access for data and video transmission; and video decoder chipsets, which are used for camera image signal decoding in closed-circuit television security monitoring systems, or DVR/NVR systems. In addition, the company offers electronic paper display products for low-power applications and equipment, such as financial smart cards, electronic shelf labels, wearing equipment, etc.; and microcontroller units for use in motor control, analogy digital signal, RFID, financial smart cards, electronic shelf labels, wearable equipment, etc. Further, it also provides wireless communication machinery and equipment. The company was founded in 1996 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "3189.TW": {"short_name": "KINSUS INTERCONNECT TECHNOLOGY ", "long_name": "Kinsus Interconnect Technology Corp.", "summary": "Kinsus Interconnect Technology Corp. primarily researches, develops, designs, manufactures, and sells electronic products in Taiwan and internationally. The company operates in two segments, IC Substrate and Printed Circuit Board (PCB). It offers plastic ball grid array, multi-chip-module ball grid array (BGA), chip scale package (CSP) mini-BGA, high dissipation cavity down, thermal enhanced BGA, flip chip, flip chip CSP, flip chip film chip on flex, core-less, all layer build up, embedded pattern and passive, high density copper bump, high band width package-on-package, core-less embedded passive, and radio frequency module substrates. The company also provides system in package, a carrier substrate that provides a platform for multiple chips or packages or passive components assembly; and PCBs and related products, and electronic components, as well as after sales services. In addition, the company is involved in the wholesale and retail-sale of electronic materials; sale of medical equipment; provision of consultation services for business operation and management; and investment and trading activities. Its products are used for modules in handset and wearable devices, microprocessors, controllers, graphic and application processors, ASIC, PC chipsets, connectivity, power management, memory, power amplifier, front end and WiFi connectivity modules, and field programmable gate array applications. The company primarily serves IC packaging, design, and system businesses, as well as manufacturers of electronic products. The company was founded in 2000 and is headquartered in Taoyuan City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "3346.TW": {"short_name": "LASTER TECH CORPORATION LTD", "long_name": "Laster Tech Co., Ltd.", "summary": "Laster Tech Co., Ltd. manufactures and sells LED lighting products in Taiwan and internationally. It offers chip products, such as Lumileds LED chips; industrial, indoor, outdoor, and landscape lighting products; and LED automotive lighting products to car manufacturers. Laster Tech Co., Ltd. was founded in 1999 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "3413.TW": {"short_name": "FOXSEMICON INTEGRATED TECHNOLOG", "long_name": "Foxsemicon Integrated Technology Inc.", "summary": "Foxsemicon Integrated Technology Inc. provides design and manufacturing services for semiconductor and TFT-LCD equipment manufacturing, and integrated system equipment in Taiwan. The company's services and products include equipment components, modules, solar energy equipment, and total systems used in the semiconductor and TFT-LCD industries. Foxsemicon Integrated Technology Inc. was founded in 2001 and is headquartered in Jhunan, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Jhunan"}, "3443.TW": {"short_name": "GLOBAL UNICHIP CORP.", "long_name": "Global Unichip Corp.", "summary": "Global Unichip Corp. engages in the research, development, production, testing, and sale of embedded memory components, logic, and analog components for various application ICs. The company offers designing, wafer manufacturing, packaging, and testing services for ASIC and wafer products; circuit design cell library and various intellectual properties (IPs) required in the process of product design; circuit layouts for mask making; and subcontract mask making, wafer manufacturing, dicing, and packaging to vendors, as well as conducts testing. It also integrates multiple design projects of various customers on single mask and by a wafer engineer run; and provides customization, consulting, designing, technical support, and IP licensing services, as well as provides cell libraries; and EDA tools. In addition, the company offers system on a chip (SoC) design services, such as technology design, design methodology, low power solution, and testability design services; SoC manufacturing services consisting of packaging, testing and product engineering, and quality and reliability, as well as supply chain management services; and IP portfolio, including synthesizable implementation IP, and hardened PHYs and verification IP for ASIC, FPGA, and SoC designs. It operates in Taiwan, China, the United States, Japan, Europe, and Korea. Global Unichip Corp. was founded in 1998 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "3530.TW": {"short_name": "SILICON OPTRONICS INC", "long_name": "Silicon Optronics, Inc.", "summary": "Silicon Optronics, Inc., together with its subsidiaries, operates as a complementary metal-oxide-semiconductor image sensor design company in Taiwan, Hong Kong, the United States, India, Korea, and the Philippines. The company offers area sensors, including raw or SOC sensors for applications in smart phones and tablets, PC cams and Webcams, digital still cameras, and security and surveillance systems; and linear sensors for use in document scanners, multifunction printers, barcode scanners, fax machines, counterfeit money scanners, and portable scanners. It also engages in the investment business. Silicon Optronics, Inc. was founded in 2004 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "3545.TW": {"short_name": "FOCALTECH SYSTEMS CO LTD", "long_name": "FocalTech Systems Co., Ltd.", "summary": "FocalTech Systems Co., Ltd. provides LCD display driver solutions worldwide. The offers IDC, fingerprint identification, display driver, and touch chips. It also provides human-machine interface solutions, including 2D touch controller, super in- cell IDC, fingerprint sensor, and display driver for smart electronic devices. The company was founded in 2005 and is based in Hsinchu City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "3588.TW": {"short_name": "LEADTREND TECHNOLOGY CORPORATIO", "long_name": "Leadtrend Technology Corporation", "summary": "Leadtrend Technology Corporation operates as an IC fables company primarily in Taiwan. The company offers AC-DC controllers, such as primary side regulator controllers, isolated green mode products, isolated high voltage green mode products, synchronous rectification drivers, and transition mode PFC controllers; USB type-c port controllers; and LED application products, including 3 in 1 flexible dimming processors, AC/DC LED lighting controllers/drivers, current ripple suppressors, and CC/CV secondary side controllers. Its products are used in technical articles, networking, notebooks, monitors/TVs, chargers, and LED lightings. The company was founded in 2002 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "3661.TW": {"short_name": "ALCHIP TECHNOLOGIES LIMITD", "long_name": "Alchip Technologies, Limited", "summary": "Alchip Technologies, Limited, together with its subsidiaries, provides silicon design and manufacturing solutions for application specific integrated circuit and System on chip (SoC) companies. It offers SoC design, production, and IP solutions, as well as multi project wafer services. The company's products are primarily used in network, storage, and computing devices; HDTVs, mobile phones, digital cameras/video cameras, entertainment systems, portable media players, tablet PC master chips, and peripheral chips; and surveillance systems, entertainment machines, and medical equipment and instruments. It operates in China, Japan, the United States, Taiwan, Europe, and internationally. The company was founded in 2003 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "4919.TW": {"short_name": "NUVOTON TECHNOLOGY CORPORATION", "long_name": "Nuvoton Technology Corporation", "summary": "Nuvoton Technology Corporation, together with its subsidiaries, operates as a digital/analog/mixed signal semiconductor company in the United States, Europe, Asia, and internationally. It operates through General Integrated Circuit (IC) Product and Foundry Service segments. The company engages in the research, design, development, manufacture, and sale of logic ICs; and manufacture, testing, and OEM of 6-inch wafers. It also researches, designs, develops, manufactures, and sells microcontrollers; microprocessors; application specific SoCs devices; audio amplifiers, CODECs, converters, and enhancements; and ISD voice ICs, including ISD ChipCorder products and Voiceband CODECs. In addition, the company provides cloud computing products comprising embedded controllers, hardware monitors, I/O and security devices, iBMC products, and voltage level shifters; power management products, which consist of power switches and voltage regulators; and Internet of things (IoT) solutions. Further, it operates IoT for various IoT solutions; operates emWin platform for graphical user interface solution to create graphics for the embedded system; and offers professional semiconductor foundry services. Additionally, the company engages in the wholesale of computers, supplements, and software; and provides computer software services. Its products are used in automotive, computing, medical, portable devices, audio/video products, and consumer and industrial electronics, as well IoT security and smart home appliances. The company was founded in 2008 and is headquartered in Hsinchu, Taiwan. Nuvoton Technology Corporation is a subsidiary of Winbond Electronics Corporation.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "4961.TW": {"short_name": "FITIPOWER INTEGRATED TECHNOLOGY", "long_name": "Fitipower Integrated Technology Inc.", "summary": "Fitipower Integrated Technology Inc. research, design, and development of LCD driver ICs and analogs, and digital and mixed-signal power management ICs in Taiwan. Its power management products comprise buck DC-DC, boost DC-DC, linear regulator, LCD power, power switch, WLED driver, reset IC, and motor driver, as well as other products, such as PMUs, A SICs, etc.; and display driver products include AV/tablet, DSC, NBMNT, TV, and gate products. The company's products are used for various applications consisting of LCD-TVs, notebooks, networking, portable devices, set-top boxes, CCTV/security, desktops, LED lighting, and TFT-LCD driver products. Fitipower Integrated Technology Inc. was founded in 1995 and is headquartered in Hsinchu City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "4968.TW": {"short_name": "RICHWAVE TECHNOLOGY CORPORATION", "long_name": "RichWave Technology Corporation", "summary": "RichWave Technology Corporation designs, develops, and sells radio frequency integrated circuits in Taiwan. The company offers a portfolio of RF front-end components for Wi-Fi, such as power amplifiers, low noise amplifiers, switch products, and front-end modules. It also provides mobile products, including LTE switch modules, LTE and GPS LNA products, LTE femtocell/small cell power amplifiers, and antenna switches; wireless video/audio transmission chipsets for ISM bands; motion detection sensor and single-chip broadcast IC tuner solutions, including analog functions, channel selection filters, and demodulators, as well as RF components for the Internet of things market. Its products used in AP/ router, wearable device, cellular phone, MiFi, PC/tablet, gaming, set-top box, USB dongle, drone, surveillance, consumer electronics, infotainment, and telematics applications. The company was founded in 2004 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "5269.TW": {"short_name": "ASMEDIA TECHNOLOGY INC", "long_name": "ASMedia Technology Inc.", "summary": "ASMedia Technology Inc. operates in the IC design field. It offers high speed digital switches, USB 3.1 gen 1/gen 2 controllers, PCIE bridge controllers, and SATA controllers. The company was founded in 2004 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "5471.TW": {"short_name": "SONIX TECHNOLOGY CO", "long_name": "Sonix Technology Co.,Ltd.", "summary": "Sonix Technology Co.,Ltd. designs, develops, manufactures, and sells integrated circuits (ICs) in Taiwan and internationally. The company provides microcontrollers for use in computer peripherals, communication products, remote controllers, intelligent charging, home appliances, car alarm systems, security systems, electronic scales, thermometers, blood pressure monitors, tire gauges, and health equipment. It also offers voice controllers for interactive and educational electronic toys, handheld games, educational learning appliances, and other devices; and a range of video/image controllers. In addition, the company provides wireless video and audio solutions for remote control toys, baby monitors, and wireless home security systems; optical identification device chipsets for education, entertainment, and digital home appliances; multimedia network platforms for consumer Wi-Fi IP cameras makers; and USB controllers. Sonix Technology Co.,Ltd. as founded in 1996 and is headquartered in Zhubei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Zhubei"}, "6168.TW": {"short_name": "HARVATEK CORP", "long_name": "Harvatek Corporation", "summary": "Harvatek Corporation designs, manufactures, tests, exports, and sells semiconductor chips and LEDs in Taiwan and internationally. The company provides visible LED products, such as PCB, lead frame, lamp, PLCC, and yarn products, as well as digital displays; infrared LED products, including emitters, phototransistors, photodiodes, interrupters, and light sensors; UVC LED products comprising water tank types, water flow types, and air puri products; and OD CSP modules/self-made equipment. Its products are used in house appliances, gaming accessories, optical touch screens, mobile devices, wearables, and security measures. The company serves OEM manufacturers, trade retailers, and design houses. Harvatek Corporation was founded in 1995 and is headquartered in Hsinchu City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "6202.TW": {"short_name": "HOLTEK SEMICONDUCTOR INC", "long_name": "Holtek Semiconductor Inc.", "summary": "Holtek Semiconductor Inc. researches, develops, produces, manufactures, and sells integrated circuits. The company provides a range of general purpose and specialized types of microcontrollers for use in the areas of voice, communication, computer peripheral, household appliance, medical equipment, automotive, security, etc.; and power management devices, LCD and LED drive/control chips, ultra-high resolution fingerprint identification sensors, various sensor modules, and other peripheral devices. It also offers MCU that are used for general purpose, LCD display, 1.8V~5.5V, USB, motor control, OPA, health and measurement, security and safety, touch, voice and music, battery and power management, and special purpose; and wireless and communication devices, display drivers, modules, EEPROM memory, and analog and video devices. The company was founded in 1998 and is headquartered in Hsinchu City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "6515.TW": {"short_name": "WINWAY TECHNOLOGY CO LTD", "long_name": "WinWay Technology Co., Ltd.", "summary": "WinWay Technology Co., Ltd. manufactures and supplies integrated circuit testing interfaces worldwide. Its products include high performance test sockets, changeover kits of handler, CMOS/RF/memory module test sockets, high performance heat sinks/manual lids, active thermal controllers, direct docking probe cards, and automated test equipment load boards for use in characterization, wafer test, automated test equipment, and system-level test applications. It also provides technical support and customer services. The company serves semiconductor, opto-electronic, and IT industries. WinWay Technology Co., Ltd. was founded in 2001 and is headquartered in Kaohsiung, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Kaohsiung"}, "6531.TW": {"short_name": "AP MEMORY TECHNOLOGY CORPORATIO", "long_name": "AP Memory Technology Corporation", "summary": "AP Memory Technology Corporation operates as a semiconductor company in Taiwan and internationally. It offers low power DRAM, PSRAM and IoT RAM, and standard DRAM products used in Internet of Things, connectivity and mobile, automotive, consumer, and industrial applications. The company was founded in 2011 and is headquartered in Zhubei, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Zhubei"}, "6533.TW": {"short_name": "ANDES TECHNOLOGY CORPORATION", "long_name": "Andes Technology Corporation", "summary": "Andes Technology Corporation develops processors and related SoC platforms worldwide. The company offers AndeStar Architecture, a patented 32-bit/64-bit RISC-style CPU architecture; AndesCore, a series of 32 and 64-bit CPUs for use in embedded applications; Andes Custom Extension that allows designers design their own CPU instructions on the already performance optimized AndesCore processors; and AndeShape Platform that contains three categories of products for system development with AndesCore processors. It also provides AndeSight IDE, an eclipse-based IDE that provides solutions to develop embedded applications; and AndeSoft SW Stack, which provides a set of software components, such as real-time operating system, Linux kernel and drivers, libraries, middleware, and application frameworks. The company offers RISC-V Solutions; network security solution; and replacement solutions for embedded applications, as well as licensing CPU IP and provides related services. Andes Technology Corporation was founded in 2005 is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "6552.TW": {"short_name": "JMC ELECTRONICS CO LTD", "long_name": "JMC Electronics Co., Ltd.", "summary": "JMC Electronics Co., Ltd. produces reel to reel chip on film that is applied to LCD in Taiwan. The company was formerly known as Sumiko Electronics Taiwan Co., Ltd. and changed its name to JMC Electronics Co., Ltd. in 2014. JMC Electronics Co., Ltd. was founded in 1973 and is based in Kaohsiung, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Kaohsiung"}, "6LD1.F": {"short_name": "SEMILEDS CORP.  DL-,01", "long_name": "SemiLEDs Corporation", "summary": "SemiLEDs Corporation develops, manufactures, and sells light emitting diode (LED) chips, LED components, and LED modules and systems in the United States, Taiwan, the Netherlands, Germany, Japan, Ireland, and internationally. The company also sells enhanced vertical, LED product series in blue, white, green, and UV; LED chips to packagers or distributors; and lighting products primarily to original design manufacturers of lighting products and the end-users of lighting devices, as well as packages and sells its LED chips into LED components to distributors. Its products are used for general lighting applications, including commercial, industrial, and residential lighting; and specialty industrial applications, such as ultraviolet or UV, curing of polymers, LED light therapy in medical/cosmetic applications, counterfeit detection, LED lighting for horticulture applications, architectural lighting, and entertainment lighting. SemiLEDs Corporation was founded in 2005 and is headquartered in Chunan, Taiwan.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductors", "exchange": "FRA", "market": "dr_market", "country": "Taiwan", "city": "Chu-Nan"}, "8016.TW": {"short_name": "SITRONIX TECHNOLOGY CORP", "long_name": "Sitronix Technology Corporation", "summary": "Sino-American Silicon Products Inc. researches, develops, designs, manufactures, trades, and sells semiconductor ingots and wafers, varistors, optoelectronics, and communication wafer materials. It provides CZ/FZ/NTD silicon ingots, Epi wafers, polished wafers, antimony-doped wafers, etched wafers, TVS wafers, arsenic-doped wafers, ultra-thin wafers, deep diffusion wafers, solar ingot and wafers, cells, modules, and sapphire wafers. The company is also involved in the investment activities; and solar power generation business. It operates in Taiwan, Japan, Korea, rest of Asia, the United States, Europe, and internationally. The company was founded in 1981 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Zhubei"}, "8150.TW": {"short_name": "CHIPMOS TECHNOLOGIES INC", "long_name": "ChipMOS TECHNOLOGIES INC.", "summary": "ChipMOS TECHNOLOGIES INC. researches, develops, manufactures, and sells high integration and high precision integrated circuits, and related assembly and testing services. The company operates through Testing; Assembly; Testing and Assembly for Liquid Crystal Display and Other Flat-Panel Display Driver Semiconductors; and Bumping segments. It provides a range of back-end assembly and test services, including engineering test, wafer probing and final test of memory and logic/mixed-signal semiconductors, as well as leadframe-and organic substrate-based package assembly services for memory and logic/mixed-signal semiconductors; and gold bumping, reel to reel assembly, and test services for LCD and other flat-panel display driver semiconductors. The company's semiconductors are used in personal computers; graphics applications, such as game consoles; communications equipment; mobile products comprising cellular handsets, tablets, and consumer electronic products; and automotive/industry and display applications, such as display panels. It serves customers in Taiwan, Japan, Singapore, and internationally. The company was founded in 1997 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "8271.TW": {"short_name": "APACER TECHNOLOGY INC", "long_name": "Apacer Technology Inc.", "summary": "Apacer Technology Inc. researches, designs, develops, manufactures, and markets industrial solid-state drives (SSD), consumer digital products, and memory modules in Asia, the United States, and Europe. It offers industrial solutions, such as SSDs, memory modules, and storage devices for network communication, military, medical, vehicular, and other applications; and consumer products, including SSDs, memory modules, memory cards, USB flash drives, portable hard drives, and other computer and mobile peripherals. The company was founded in 1997 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductors", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "ASX": {"short_name": "ASE Technology Holding Co., Ltd", "long_name": "ASE Technology Holding Co., Ltd.", "summary": "ASE Technology Holding Co., Ltd. provides a range of semiconductors packaging and testing, and electronic manufacturing services in the United States, Taiwan, Asia, Europe, and internationally. The company offers packaging services, including flip chip ball grid array (BGA), flip chip chip scale package (CSP), advanced chip scale packages, quad flat packages, thin quad flat packages, bump chip carrier and quad flat no-lead (QFN) packages, advanced QFN packages, plastic BGAs, and 3D chip packages; stacked die solutions in various package types; and copper and silver wire bonding solutions, as well as module-based solutions. It also provides advanced packages, such as flip chip BGA; heat-spreader FCBGA; flip-chip CSP; hybrid FCCSP; flip chip package in package and package on package (POP); advanced single sided substrate; high-bandwidth POP; fan-out wafer level packaging; SESUB; and substrate interposer packages. In addition, the company offers IC wire bonding packages; system-in-package products (SiP) and modules; and interconnect materials, as well as assembles automotive electronic products. Further, it provides a range of semiconductor testing services, including front-end engineering testing, wafer probing, logic/mixed-signal/RF module and SiP/MEMS/discrete final testing, and other test-related services, as well as drop shipment services. Additionally, the company develops, constructs, sells, leases, and manages real estate properties; produces substrates; offers information software, equipment leasing, financing, investment advisory, warehousing management, logistics, and after sales services; manufactures computer assistance systems and related peripherals, electronic components, communication peripherals, telecommunications equipment, motherboards, and car components; imports and exports various products and technology. ASE Technology Holding Co., Ltd. was founded in 1984 and is based in Kaohsiung, Taiwan.", "currency": "USD", "sector": "Technology", "industry": "Semiconductors", "exchange": "NYQ", "market": "us_market", "country": "Taiwan", "city": "Kaohsiung"}, "CPIA.F": {"short_name": "CHIPMOS TECH.ADR 20 TA10", "long_name": "ChipMOS TECHNOLOGIES INC.", "summary": "ChipMOS TECHNOLOGIES INC. researches, develops, manufactures, and sells high integration and high precision integrated circuits, and related assembly and testing services. The company operates through Testing; Assembly; Testing and Assembly for Liquid Crystal Display and Other Flat-Panel Display Driver Semiconductors; and Bumping segments. It provides a range of back-end assembly and test services, including engineering test, wafer probing and final test of memory and logic/mixed-signal semiconductors, as well as leadframe-and organic substrate-based package assembly services for memory and logic/mixed-signal semiconductors; and gold bumping, reel to reel assembly, and test services for LCD and other flat-panel display driver semiconductors. The company's semiconductors are used in personal computers; graphics applications, such as game consoles; communications equipment; mobile products comprising cellular handsets, tablets, and consumer electronic products; and automotive/industry and display applications, such as display panels. It serves customers in Taiwan, Japan, Singapore, and internationally. The company was founded in 1997 and is headquartered in Hsinchu, Taiwan.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductors", "exchange": "FRA", "market": "dr_market", "country": "Taiwan", "city": "Hsinchu City"}, "H6Q.F": {"short_name": "HIMAX TECH.INC. ADR 1", "long_name": "Himax Technologies, Inc.", "summary": "Himax Technologies, Inc., a fabless semiconductor company, provides display imaging processing technologies in China, Taiwan, the Philippines, Korea, Japan, Europe, and the United States. The company operates in two segments, Driver IC and Non-Driver Products. It offers display driver integrated circuits (ICs) and timing controllers that are used in televisions, laptops, monitors, mobile phones, tablets, digital cameras, car navigation, virtual reality devices, and other consumer electronic devices. The company also designs and provides controllers for touch sensor displays; in-cell touch and display driver integration single-chip solutions; light-emitting diode driver and power management ICs; and liquid crystal on silicon micro-displays for augmented reality (AR) devices and head-up displays for automotive industry. In addition, it offers digital camera solutions, including complementary metal oxide semiconductor image sensors and wafer level optics for AR devices, 3D sensing, machine vision, and ultra-low power smart sensing, which are used in various applications, such as mobile phone, tablet, laptop, TV, PC camera, automobile, security, medical devices, home appliance, and Internet of Things. The company markets its display drivers and display-related products to panel manufacturers, agents or distributors, module manufacturers, and assembly houses; and non-driver products to camera module manufacturers, optical engine manufacturers, and television system manufacturers. Himax Technologies, Inc. was founded in 2001 and is headquartered in Tainan City, Taiwan.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductors", "exchange": "FRA", "market": "dr_market", "country": "Taiwan", "city": "Tainan City"}, "HIMX": {"short_name": "Himax Technologies, Inc.", "long_name": "Himax Technologies, Inc.", "summary": "Himax Technologies, Inc., a fabless semiconductor company, provides display imaging processing technologies in China, Taiwan, the Philippines, Korea, Japan, Europe, and the United States. The company operates in two segments, Driver IC and Non-Driver Products. It offers display driver integrated circuits (ICs) and timing controllers that are used in televisions, laptops, monitors, mobile phones, tablets, digital cameras, car navigation, virtual reality devices, and other consumer electronic devices. The company also designs and provides controllers for touch sensor displays; in-cell touch and display driver integration single-chip solutions; light-emitting diode driver and power management ICs; and liquid crystal on silicon micro-displays for augmented reality (AR) devices and head-up displays for automotive industry. In addition, it offers digital camera solutions, including complementary metal oxide semiconductor image sensors and wafer level optics for AR devices, 3D sensing, machine vision, and ultra-low power smart sensing, which are used in various applications, such as mobile phone, tablet, laptop, TV, PC camera, automobile, security, medical devices, home appliance, and Internet of Things. The company markets its display drivers and display-related products to panel manufacturers, agents or distributors, module manufacturers, and assembly houses; and non-driver products to camera module manufacturers, optical engine manufacturers, and television system manufacturers. Himax Technologies, Inc. was founded in 2001 and is headquartered in Tainan City, Taiwan.", "currency": "USD", "sector": "Technology", "industry": "Semiconductors", "exchange": "NMS", "market": "us_market", "country": "Taiwan", "city": "Tainan City"}, "IMOS": {"short_name": "ChipMOS TECHNOLOGIES INC.", "long_name": "ChipMOS TECHNOLOGIES INC.", "summary": "ChipMOS TECHNOLOGIES INC. researches, develops, manufactures, and sells high integration and high precision integrated circuits, and related assembly and testing services. The company operates through Testing; Assembly; Testing and Assembly for Liquid Crystal Display and Other Flat-Panel Display Driver Semiconductors; and Bumping segments. It provides a range of back-end assembly and test services, including engineering test, wafer probing and final test of memory and logic/mixed-signal semiconductors, as well as leadframe-and organic substrate-based package assembly services for memory and logic/mixed-signal semiconductors; and gold bumping, reel to reel assembly, and test services for LCD and other flat-panel display driver semiconductors. The company's semiconductors are used in personal computers; graphics applications, such as game consoles; communications equipment; mobile products comprising cellular handsets, tablets, and consumer electronic products; and automotive/industry and display applications, such as display panels. It serves customers in Taiwan, Japan, Singapore, and internationally. The company was founded in 1997 and is headquartered in Hsinchu, Taiwan.", "currency": "USD", "sector": "Technology", "industry": "Semiconductors", "exchange": "NMS", "market": "us_market", "country": "Taiwan", "city": "Hsinchu City"}, "LEDS": {"short_name": "SemiLEDS Corporation", "long_name": "SemiLEDs Corporation", "summary": "SemiLEDs Corporation develops, manufactures, and sells light emitting diode (LED) chips, LED components, and LED modules and systems in the United States, Taiwan, the Netherlands, Germany, Japan, Ireland, and internationally. The company also sells enhanced vertical, LED product series in blue, white, green, and UV; LED chips to packagers or distributors; and lighting products primarily to original design manufacturers of lighting products and the end-users of lighting devices, as well as packages and sells its LED chips into LED components to distributors. Its products are used for general lighting applications, including commercial, industrial, and residential lighting; and specialty industrial applications, such as ultraviolet or UV, curing of polymers, LED light therapy in medical/cosmetic applications, counterfeit detection, LED lighting for horticulture applications, architectural lighting, and entertainment lighting. SemiLEDs Corporation was founded in 2005 and is headquartered in Chunan, Taiwan.", "currency": "USD", "sector": "Technology", "industry": "Semiconductors", "exchange": "NCM", "market": "us_market", "country": "Taiwan", "city": "Chu-Nan"}, "TSFA.F": {"short_name": "TAIWAN SEMICON.MANU.ADR/5", "long_name": "Taiwan Semiconductor Manufacturing Company Limited", "summary": "Taiwan Semiconductor Manufacturing Company Limited manufactures and sells integrated circuits and semiconductors. It also offers customer service, account management, and engineering services. The company serves customers in computer, communications, consumer, and industrial and standard segments in North America, Europe, Japan, China, and South Korea. Taiwan Semiconductor Manufacturing Company Limited was founded in 1987 and is headquartered in HsinChu, Taiwan.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductors", "exchange": "FRA", "market": "dr_market", "country": "Taiwan", "city": "Hsinchu"}, "TSFA.VI": {"short_name": "TAIWAN SEMICONDUCTOR-SP ADR", "long_name": "Taiwan Semiconductor Manufacturing Company Limited", "summary": "Taiwan Semiconductor Manufacturing Company Limited manufactures and sells integrated circuits and semiconductors. It also offers customer service, account management, and engineering services. The company serves customers in computer, communications, consumer, and industrial and standard segments in North America, Europe, Japan, China, and South Korea. Taiwan Semiconductor Manufacturing Company Limited was founded in 1987 and is headquartered in HsinChu, Taiwan.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductors", "exchange": "VIE", "market": "at_market", "country": "Taiwan", "city": "Hsinchu"}, "TSM": {"short_name": "Taiwan Semiconductor Manufactur", "long_name": "Taiwan Semiconductor Manufacturing Company Limited", "summary": "Taiwan Semiconductor Manufacturing Company Limited manufactures and sells integrated circuits and semiconductors. It also offers customer service, account management, and engineering services. The company serves customers in computer, communications, consumer, and industrial and standard segments in North America, Europe, Japan, China, and South Korea. Taiwan Semiconductor Manufacturing Company Limited was founded in 1987 and is headquartered in HsinChu, Taiwan.", "currency": "USD", "sector": "Technology", "industry": "Semiconductors", "exchange": "NYQ", "market": "us_market", "country": "Taiwan", "city": "Hsinchu"}, "TSMN.MX": {"short_name": "TAIWAN SEMICONDUCTOR MANUFACTUR", "long_name": "Taiwan Semiconductor Manufacturing Company Limited", "summary": "Taiwan Semiconductor Manufacturing Company Limited manufactures and sells integrated circuits and semiconductors. It also offers customer service, account management, and engineering services. The company serves customers in computer, communications, consumer, and industrial and standard segments in North America, Europe, Japan, China, and South Korea. Taiwan Semiconductor Manufacturing Company Limited was founded in 1987 and is headquartered in HsinChu, Taiwan.", "currency": "MXN", "sector": "Technology", "industry": "Semiconductors", "exchange": "MEX", "market": "mx_market", "country": "Taiwan", "city": "Hsinchu"}, "UMC": {"short_name": "United Microelectronics Corpora", "long_name": "United Microelectronics Corporation", "summary": "United Microelectronics Corporation operates as a semiconductor wafer foundry in Taiwan, Singapore, China, Hong Kong, Japan, the United States, Europe, and internationally. The company operates through Wafer Fabrication and New Business segments. It provides circuit design, mask tooling, wafer fabrication, and assembly and testing services. The company also researches, develops, and manufactures products in the solar energy and LED industries. It serves fabless design companies and integrated device manufacturers. United Microelectronics Corporation was founded in 1980 and is headquartered in Hsinchu City, Taiwan.", "currency": "USD", "sector": "Technology", "industry": "Semiconductors", "exchange": "NYQ", "market": "us_market", "country": "Taiwan", "city": "Hsinchu City"}, "UMCB.F": {"short_name": "UTD MICROELECTR.ADR NEW/5", "long_name": "United Microelectronics Corporation", "summary": "United Microelectronics Corporation operates as a semiconductor wafer foundry in Taiwan, Singapore, China, Hong Kong, Japan, the United States, Europe, and internationally. The company operates through Wafer Fabrication and New Business segments. It provides circuit design, mask tooling, wafer fabrication, and assembly and testing services. The company also researches, develops, and manufactures products in the solar energy and LED industries. It serves fabless design companies and integrated device manufacturers. United Microelectronics Corporation was founded in 1980 and is headquartered in Hsinchu City, Taiwan.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductors", "exchange": "FRA", "market": "dr_market", "country": "Taiwan", "city": "Hsinchu City"}}