{
    "5212.TWO": {
        "short_name": "HYWEB TECHNOLOGY",
        "long_name": "Hyweb Technology Co., Ltd.",
        "summary": "Hyweb Technology Co., Ltd. engages in the research and development of electronic government, book education, and electronic payment related software technology in China and internationally. Its products include HyCMS, a website management platform; Greeting, a paperless conference system; HyEIP, an administrative information portal; HyCase, an application review process engine; and eServices, a customer service system. The company's products also comprise HyRead, an e-book solution and mobile library-reading display machine; HyLib, a library automation system; Jumper, a library resource exploration service system; and SpaceMe, a space management solution. In addition, its products consist of HyLoyal, a bonus points management system; HyPro, a credit card/debit card system; and HyPstar, a card data preparation system. Further, the company offers UHF RFID chip tags, security detection doors, self-checking machines, automatic book borrowing and returning station systems, librarian work systems, and book searching/counting machines; and various consumer finance, retail banking, and payment solutions. Hyweb Technology Co., Ltd. was founded in 1998 and is headquartered in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Zhubei"
    },
    "6462.TWO": {
        "short_name": "EGIS TECHNOLOGY INC",
        "long_name": "Egis Technology Inc.",
        "summary": "Egis Technology Inc. engages in the IC design, research, development, testing, and sale of capacitive fingerprint sensors worldwide. It offers universal 2nd factor fingerprint dongle and mobile authentication solutions, and wearable devices. The company was founded in 2007 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "6565.TWO": {
        "short_name": "THROUGHTEK CO LTD",
        "long_name": "ThroughTek Co., Ltd.",
        "summary": "ThroughTek Co., Ltd. provides solutions for Internet of Things (IoT) cloud services platforms. The company operates Kalay Platform, which provides customized app services to help customers deploy smart products and accelerate its time-to-market, as well as integrates video surveillance equipment, smart consumer products, and various sensors to allow brand name manufacturers, telecoms providers, system integration providers, hardware manufacturers, and other service providers to offer smart solutions. Its Kalay platform offers cloud services, including point-to-point and IoT connection, account and device management, video surveillance and cloud storage, push notifications, over the air, and smart assistant services. The company serves smart home, agriculture, and connected car industries. ThroughTek Co., Ltd. was founded in 2008 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "6689.TWO": {
        "short_name": "ECV",
        "long_name": "eCloudvalley Digital Technology Co., Ltd.",
        "summary": "eCloudvalley Digital Technology Co., Ltd. operates as a cloud managed service provider and storage product distributor in Taiwan and internationally. The company offers cloud storage, disaster backup, server hosting, server monitoring, and Amazon Web Services (AWS) training; and solution for management consultant roles, such as examining existing information security risks, system architecture weaknesses, improving system performance, and lowering corporate expense on IT. It serves traditional industries; public sectors; banks; and media, gaming, and travel industries, as well as startups. eCloudvalley Digital Technology Co., Ltd. was founded in 2013 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "7547.TWO": {
        "short_name": "INTUMIT",
        "long_name": "Intumit Inc.",
        "summary": "Intumit, Inc. provides artificial intelligence and CX solutions primarily in China. The company's products include SmartRobot, a solution to help enterprises in establishing automate smart service platforms across Websites, FB Messenger, LINE, WeChat, WhatsApp, Microsoft Services, APPs, and other channels; SmartKMS, a cognitive knowledge management system; SmartWork, a Microsoft 365 internal helpdesk; WFH solutions, a personal internal helpdesk assistant for information technology, human resource, call centers, and other areas; AOG, a Google assistant solution; SmartForce, a solution for customer interaction; SmartNow, a workplace management solution; SmartXP, a customer engagement solution; and Smartonnect, a solution to collect customers' interests and info from conversations and speech dialogues. It primarily serves financial services, insurance, healthcare, retail/FMCG, public service/education, tourism/transportation, and manufacturing sectors. The company was founded in 1999 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "8298.TWO": {
        "short_name": "Genie",
        "long_name": "Genie Networks Limited",
        "summary": "Genie Networks Limited provides networking and security solutions worldwide. The company offers GenieATM, GenieATM FLB, GenieATM visual portal, GenieATM MSP server, GenieAnalytics, and GenieAnalytics deep trace. It also offers network visibility, DDos protection, managed service enabling, and big data traffic analytics solutions. The company serves Internet service providers, government organizations, academic institutions, and large-scale enterprises. Genie Networks Limited was founded in 2000 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "KSIH": {
        "short_name": "KS INTL HLDGS CORP",
        "long_name": "KS International Holdings Corporation",
        "summary": "KS International Holdings Corporation focuses on providing solutions and services to individuals seeking to become Internet-based retailers. It operates a Web site, kachingkaching.com, which provides individual Web Store owners with the ability to create, manage, and earn money from product sales generated from their individual online Web stores. The company provides Web Store owners with solutions and resources necessary to create, design, and maintain a Web Store; access to a range of retail goods at competitive prices; and order fulfillment, customer service, and other back-office functions, which assist Web Store Owners with tracking and managing orders and sales from their Web Stores. Its store products include books, DVDs, computers, software, kitchen products, home and garden products, pet supplies, cosmetics and fragrance products, health and wellness products, consumer electronics, cameras, and office supplies. The company was formerly known as KaChing KaChing, Inc. and changed its name to KS International Holdings Corporation in December 2013. KS International Holdings Corporation was founded in 2009 and is headquartered in Taipei City, Taiwan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Taiwan",
        "city": "Taipei City"
    }
}