{
    "000002.SZ": {
        "short_name": "CHINA VANKE CO",
        "long_name": "China Vanke Co., Ltd.",
        "summary": "China Vanke Co., Ltd., a real-estate company, develops and sells properties in the People's Republic of China. The company operates through Property Development and Property Management segments. It develops residential, retail, and office properties; and other ancillary facilities. The company also provides property management and related services to purchasers and tenants of its own developed residential properties and shopping arcades, as well as to the external property developers; and undertakes construction contracts. In addition, it is involved in logistics and warehousing, ski resorts, education, and elderly care activities; and rents housing properties. China Vanke Co., Ltd. was founded in 1984 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "000005.SZ": {
        "short_name": "SHN FOUNTAIN CORP",
        "long_name": "Shenzhen Fountain Corporation",
        "summary": "Shenzhen Fountain Corporation engages in real estate development, clean energy, transportation, and waste management activities in China. The company operates various fleets of electric vehicles (EVs) at residential and tourism developments under the HANSOME EValet brand, as well as light truck EVs for intra city logistics; and provides power-charging infrastructure at various transportation hubs and residential communities. It also develops low carbon neighborhood; and operates city chilling stations to provide cooling services to the communities, and infrastructure for cold chain food and beverage storage and logistics, as well as cold chain retail spaces and EV cold chain distributors. Shenzhen Fountain Corporation was founded in 1990 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "000014.SZ": {
        "short_name": "SHAHE INDUSTRIAL C",
        "long_name": "Shahe Industrial Co., Ltd",
        "summary": "Shahe Industrial Co., Ltd. develops, operates, and manages real estate properties in China. The company was founded in 1987 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "000502.SZ": {
        "short_name": "LVJING HOLDING CO",
        "long_name": "Lvjing Holding Co., Ltd.",
        "summary": "Lvjing Holding Co., Ltd. engages in real estate development business in China. Its project portfolio comprises villas, houses, merchants, and their supporting facilities. The company was founded in 1988 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "000514.SZ": {
        "short_name": "CHONGQING YUKAIFA",
        "long_name": "Chongqing Yukaifa Co., Ltd",
        "summary": "Chongqing Yukaifa Co., Ltd. operates as a real estate development company in China. It is also involved in municipal asset, exhibition, and property management businesses. The company was founded in 1978 and is based in Chongqing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Chongqing"
    },
    "000517.SZ": {
        "short_name": "RONGAN PROPERTY CO",
        "long_name": "Rongan Property Co.,Ltd.",
        "summary": "Rongan Property Co.,Ltd. develops and sells real estate properties in China. The company develops residential properties for home buyers and upper sizers; and commercial properties. It also operates and leases office buildings and mixed-use commercial buildings; and provides property development operating and management services, including planning, design, development management, marketing, and client management services. In addition, the company offers professional property management services for residential and commercial office buildings. Rongan Property Co.,Ltd. was founded in 1965 and is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Ningbo"
    },
    "000558.SZ": {
        "short_name": "LANDER SPORTS DEVE",
        "long_name": "Lander Sports Development Co.,Ltd.",
        "summary": "Lander Sports Development Co. Ltd. develops, constructs, and manages sporting facilities in Mainland China and internationally. The company's sports facilities include public fitness centers, city sports and leisure squares, city sports and leisure stadiums, city single sports venues, city fitness clubs, and city community sports convenience stores. It also offers sports financing and financial services, such as leasing of sports assets; and sports-related property and personal insurance products, as well as online lottery products. In addition, the company organizes sports events and tournaments, including football, basketball, and winter sports; operates sports clubs, and training and coaching facilities; provides sports media services; and develops technology platforms for domestic venue reservations, social news and information on sporting events, and sports recruitment. The company was formerly known as Lander Real Estate Co., Ltd. and changed its name to Lander Sports Development Co. Ltd. in August 2015. Lander Sports Development Co. Ltd. was founded in 1995 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "000567.SZ": {
        "short_name": "HAINAN HAIDE IND C",
        "long_name": "Hainan Haide Capital Management Co., Ltd.",
        "summary": "Hainan Haide Capital Management Co., Ltd. develops and sells residential real estate properties in China. It also operates a hotel. The company was formerly known as Hainan Haide Industry Co.,Ltd and changed its name to Hainan Haide Capital Management Co., Ltd. is based in Haikou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Haikou"
    },
    "000573.SZ": {
        "short_name": "DONGGUAN WINNERWAY",
        "long_name": "DongGuan Winnerway Industry Zone LTD.",
        "summary": "DongGuan Winnerway Industry Zone LTD. engages in the real estate development business primarily in China. The company develops commercial and residential projects. It is also involved in the coal mining business; and development and construction of hydropower projects. The company was founded in 1992 and is based in Dongguan, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Dongguan"
    },
    "000616.SZ": {
        "short_name": "HNA INVESTMENT GP",
        "long_name": "HNA Investment Group Co., Ltd.",
        "summary": "HNA Investment Group Co., Ltd. engages in the real estate development and investment, fund, medical care, health, insurance, and pension businesses in China. The company was founded in 1993 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "000631.SZ": {
        "short_name": "SHUNFA HENGYE CORP",
        "long_name": "Shunfa Hengye Corporation",
        "summary": "Shunfa Hengye Corporation operates as a real estate development company in China. It engages in the investment, development, operation, and management of residential, office, and hotel properties. The company is also involved in the architectural decoration and material sales activities. In addition, it provides property services, such as consulting, real estate agency, and greening project services. The company was formerly known as Zhejiang Wanxiang Real Estate Development Co., Ltd. The company was founded in 1997 and is based in Xiaoshan, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Xiaoshan"
    },
    "000632.SZ": {
        "short_name": "FUJIAN SANMU GROUP",
        "long_name": "Fujian Sanmu Group Co., Ltd.",
        "summary": "Fujian Sanmu Group Co., Ltd. engages in the import and export trade business in China. It is also involved in the real estate development; and commercial tourism asset operation. The company is based in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Fuzhou"
    },
    "000656.SZ": {
        "short_name": "JINKE PROPERTY GRO",
        "long_name": "Jinke Property Group Co., Ltd.",
        "summary": "Jinke Property Group Co., Ltd. primarily operates as a real estate development company in China. It develops residential, industrial, and commercial properties. The company also provides property management services for residential properties, commercial centers, office buildings, universities, government properties, hotel clubs, and others; generates wind power; and operates hotels. In addition, it offers asset management, industrial investment, and wealth management services, as well as real estate funds; landscape design and planning services; and architectural decoration services for hotels, shopping malls, banks, and office buildings. The company was formerly known as Chongqing Dongyuan Industrial Development Co., Ltd. and changed its name to Jinke Property Group Co., Ltd. in June 2011. Jinke Property Group Co., Ltd. was founded in 1994 and is based in Chongqing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Chongqing"
    },
    "000667.SZ": {
        "short_name": "MYHOME REAL ESTATE",
        "long_name": "Myhome Real Estate Development Group Co., Ltd.",
        "summary": "Myhome Real Estate Development Group Co., Ltd. engages in the development of real estate properties in China. It also develops urban lands; provides urban and rural construction services; and constructs fabricated buildings and industrial towns, as well as engages in agriculture business. The company was formerly known as Milord Real Estate Development Group CO., LTD. and changed its name to Myhome Real Estate Development Group Co., Ltd. in February 2014. Myhome Real Estate Development Group Co., Ltd. was founded in 1989 and is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Wuhan"
    },
    "000668.SZ": {
        "short_name": "RONGFENG HOLDING G",
        "long_name": "Rongfeng Holding Group Co.,Ltd.",
        "summary": "Rongfeng Holding Group Co., Ltd. operates as a real estate development company in China. The company is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "000671.SZ": {
        "short_name": "SUNSHINE CITY GRP",
        "long_name": "Yango Group Co., Ltd",
        "summary": "Yango Group Co., Ltd develops and operates real estate properties in China. It develops residential and commercial building, hotel, and industrial projects. The company was founded in 1995 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "000711.SZ": {
        "short_name": "KINGLAND TECHNOLOG",
        "long_name": "Kingland Technology Co.,Ltd.",
        "summary": "Kingland Technology Co.,Ltd. provides solutions for the ecological environment in China. The company plans, invests, constructs, and operates green smart ecological environment. It provides ecological water-saving operation services, such as water resources and water ecological construction services; garden construction and landscape design services; clean energy technology services; water conservancy engineering services; Internet of Things ecological cloud services focusing on the ecological environment; eco-industry investment services; and enterprise-level innovation incubator services focusing on the new technology startup teams and small and micro companies. The company was formerly known as Heilongjiang Kingland Technology Co., Ltd. and changed its name to Kingland Technology Co.,Ltd. in July 2016. Kingland Technology Co.,Ltd. was founded in 1993 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "000718.SZ": {
        "short_name": "SUNING UNIVERSAL",
        "long_name": "Suning Universal Co.,Ltd",
        "summary": "Suning Universal Co.,Ltd operates as a real estate development company in China. The company projects include commercial estates, residential properties, and hotels. It also provides building materials. Suning Universal Co.,Ltd was founded in 1987 and is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Nanjing"
    },
    "000732.SZ": {
        "short_name": "TAHOE GROUP CO LTD",
        "long_name": "Tahoe Group Co.,Ltd",
        "summary": "Tahoe Group Co., Ltd. primarily engages in real estate business in China. The company develops residential and commercial projects, office buildings, serviced apartments, and commercial pedestrian streets, urban complexes, as well as operates hotels. It also provides property management services. The company was founded in 1996 and is headquartered in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Fuzhou"
    },
    "000736.SZ": {
        "short_name": "CCCG REAL ESTATE C",
        "long_name": "CCCG Real Estate Corporation Limited",
        "summary": "CCCG Real Estate Corporation Limited engages in the development, operation, and sale of real estate properties in China. It operates through Real Estate Development and Sales, and Property and Leasing segments. It develops various residential and commercial real estate projects, as well as offers property leasing services. The company was formerly known as China Real Estate Corporation Limited and changed its name to CCCG Real Estate Corporation Limited in October 2017. The company was founded in 1993 and is based in Chongqing, China. CCCG Real Estate Corporation Limited is a subsidiary of CCCC Real Estate Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Chongqing"
    },
    "000797.SZ": {
        "short_name": "CHINA WUYI",
        "long_name": "China Wuyi Co., Ltd.",
        "summary": "China Wuyi Co., Ltd., together with its subsidiaries, engages in the real estate investment and development activities. It also provides real estate property management services; domestic and international project contracting and investment services; capital operation and financing, and build-operate-transfer services; high-tech development and co-operation; decorating and finishing; and technology and labor service cooperation, etc. In addition, the company is involved in the trading, import, and export of construction materials and equipment; provision of construction, engineering, and general contracting services for house-building and decoration projects; and construction of public infrastructure projects, such as roads and bridges, airports, hospitals, conference centers, and municipal buildings. It has operations in Southeast Asia, the Middle East, and African markets. The company is based in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Fuzhou"
    },
    "000809.SZ": {
        "short_name": "TIELING NEWCITY",
        "long_name": "Tieling Newcity Investment Holding (Group) Limited",
        "summary": "Tieling Newcity Investment Holding (Group) Limited engages in urban infrastructure construction activities in China. It is also involved in land development, water supply, sewage treatment, taxi operation, and advertising media businesses. The company was founded in 2006 and is based in Tieling, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Tieling"
    },
    "000861.SZ": {
        "short_name": "GUANGDONG HIGHSUN",
        "long_name": "Guangdong Highsun Group Co.,Ltd.",
        "summary": "Guangdong Highsun Group Co.,Ltd. primarily owns and operates urban complexes for leased property operations and self-built real estate projects in China. It owns various shopping centers, theme malls, professional wholesale markets, and commercial complexes. The company also offers smart warehousing and logistics services, industrial parks, cloud data, hotel services, and new energy vehicles and charging operations. In addition, it provides Internet microfinance, financial leasing, commercial factoring, third-party payment services, and other licenses. The company was founded in 1991 and is headquartered in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "000863.SZ": {
        "short_name": "SANXIANG IMPRESSIO",
        "long_name": "Sanxiang Impression Co., Ltd.",
        "summary": "Sanxiang Impression Co., Ltd. develops and operates real estate properties in China. The company offers integrating construction, installation, building materials processing, decoration design, real estate agencies, advertising communication, and property management services. It also conducts cultural performances and experiential scene drama. The company was formerly known as Sanxiang Co., Ltd and changed its name to Sanxiang Impression Co., Ltd. in October 2016. Sanxiang Impression Co., Ltd. was founded in 1996 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "000897.SZ": {
        "short_name": "TIANJIN JINBIN DEV",
        "long_name": "Tianjin Jinbin Development Co., Ltd.",
        "summary": "Tianjin Jinbin Development Co., Ltd. engages in the real estate development business in China. It develops industrial parks, and commercial and mid-to-high-end residential real estate properties. The company was founded in 1998 and is based in Tianjin, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Tianjin"
    },
    "000918.SZ": {
        "short_name": "CHINA CALXON GROUP",
        "long_name": "China Calxon Group Co., Ltd.",
        "summary": "China Calxon Group Co., Ltd. engages in real estate development and commercial asset management business in China. It develops residential, commercial, office, and urban complexes, as well as provides property management and consulting services for urban complexes, hotel-style apartments, villas, residential quarters, office buildings, and commercial buildings. China Calxon Group Co., Ltd. is based in Shanghai, China. As of August 1, 2016, China Calxon Group Co., Ltd. operates as a subsidiary of Guangzhou Kailong Real Estate Company Limited.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "000965.SZ": {
        "short_name": "T/TIANBAO INFRASTR",
        "long_name": "Tianjin Tianbao Infrastructure Co., Ltd.",
        "summary": "Tianjin Tianbao Infrastructure Co., Ltd. engages in the real estate development and infrastructure construction businesses in China. It is also involved in the development of industrial parks; equity investment business; and property management activities. The company is headquartered in Tianjin, China. Tianjin Tianbao Infrastructure Co., Ltd. is a subsidiary of Tianjin T&B Holding Co., Ltd.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Tianjin"
    },
    "000981.SZ": {
        "short_name": "YINYI CO LTD",
        "long_name": "Yinyi Co.,Ltd.",
        "summary": "Yinyi Co., Ltd., through its subsidiaries, manufactures and sells CVT stepless transmissions, dual clutch transmissions, hybrid powertrain systems, and electric powertrain systems in China and internationally. The company also researches, develops, designs, produces, and sells gas generators. In addition, it develops and manages real estate properties, such as residential, commercial office, and hotel projects; and operates as a real estate agent. The company is headquartered in Ningbo, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Ningbo"
    },
    "001979.SZ": {
        "short_name": "CHINA MERCHANTS SH",
        "long_name": "China Merchants Shekou Industrial Zone Holdings Co., Ltd.",
        "summary": "China Merchants Shekou Industrial Zone Holdings Co., Ltd. engages in the development and operation of industrial parks, and residential and commercial real estate properties in China. It also operates in the cruise industry. The company was formerly known as China Merchants Shekou Industrial Zone Company Limited. The company was founded in 1979 and is headquartered in Shenzhen, China. China Merchants Shekou Industrial Zone Holdings Co., Ltd. is a subsidiary of China Merchants Group Limited.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "002016.SZ": {
        "short_name": "GUANGDONG SHIRONGZ",
        "long_name": "Guangdong Shirongzhaoye Co., Ltd.",
        "summary": "Guangdong Shirongzhaoye Co., Ltd. engages in the real estate development business in China. The company was founded in 2000 and is based in Zhuhai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Zhuhai"
    },
    "002077.SZ": {
        "short_name": "JIANGSU DAGANG CO",
        "long_name": "Jiangsu Dagang Co., Ltd.",
        "summary": "Jiangsu Dagang Co., Ltd. engages in the real estate development and construction business in China. The company develops central park, a residential area integrating elevator garden houses, courtyard villas, double-family villas, superimposed villas, and high-end clubs; and villa communities, as well as offers services, such as docking, loading and unloading, warehousing, water supply, and solid waste disposal for enterprises. It is also involved in the research and development, production, and sale of laser equipment. The company was founded in 2000 and is based in Zhenjiang, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Zhenjiang"
    },
    "002133.SZ": {
        "short_name": "COSMOS GROUP CO LT",
        "long_name": "Cosmos Group Co., Ltd.",
        "summary": "Cosmos Group Co., Ltd. engages in the real estate development business in China. It primarily develops apartments, plazas, buildings, golf villas, and other properties. The company was founded in 1984 and is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "002146.SZ": {
        "short_name": "RISESUN REAL EST D",
        "long_name": "RiseSun Real Estate Development Co.,Ltd",
        "summary": "RiseSun Real Estate Development Co.,Ltd develops and sells real estate properties in China. The company was founded in 1996 and is headquartered in Langfang, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Langfang"
    },
    "002208.SZ": {
        "short_name": "HEFEI URBAN CONSTR",
        "long_name": "Hefei Urban Construction Development Co., Ltd",
        "summary": "Hefei Urban Construction Development Co., Ltd. engages in the real estate development business under the Amber brand name. The company develops and constructs residential, commercial, and office buildings. It operates primarily in Hefei, Chaohu, Feidong, Bengbu, Xuancheng, Guangde, Sanya, Hainan, China, and internationally. The company is based in Hefei, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Hefei"
    },
    "002244.SZ": {
        "short_name": "HANGZHOU BINJIANG",
        "long_name": "Hangzhou Binjiang Real Estate Group Co.,Ltd",
        "summary": "Hangzhou Binjiang Real Estate Group Co.,Ltd, a real estate company, engages in the real estate development business in China. It is also involved in the sale and rental of apartments. The company was founded in 1992 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "002305.SZ": {
        "short_name": "LANGOLD REAL ESTAT",
        "long_name": "Langold Real Estate Co., Ltd.",
        "summary": "Langold Real Estate Co., Ltd. operates as a real estate development company in China. It develops and operates shopping centers, hotels, residential and office buildings, apartments, industrial parks, and other properties. The company was founded in 1998 and is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Wuhan"
    },
    "002314.SZ": {
        "short_name": "SHENZHEN NEW NANSH",
        "long_name": "Shenzhen New Nanshan Holding (Group) Co., Ltd.",
        "summary": "Shenzhen New Nanshan Holding (Group) Co., Ltd. manufactures, sells, and operates prefabricated buildings in China. The company's products include Tetris Space buildings, Flat-Pack modular products, Easy House, Yahgee Domus, containers, and PREKIT eco-friendly products, as well as accessories, such as portal frame structures, foldable sheds, mini sheds and removable fences, construction sites, events, scene spots, and others. It sells its products to approximately 100 countries and areas. The company was formerly known as Yahgee Modular House Co., Ltd. and changed its name to Shenzhen New Nanshan Holding (Group) Co., Ltd. in November 2015. The company was founded in 2001 and is headquartered in Shenzhen, China. Shenzhen New Nanshan Holding (Group) Co., Ltd. is a subsidiary of China Nanshan Development (Group) Incorporation.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "002968.SZ": {
        "short_name": "CHONGQING NEW DAZH",
        "long_name": "Chongqing New Dazheng Property Group Co.,Ltd.",
        "summary": "Chongqing New Dazheng Property Group Co.,Ltd. manages and operates public buildings and facilities in China. It manages schools, offices, aviation properties, public properties, and commercial and residential properties. The company was founded in 1998 and is based in Yuzhong, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Yuzhong"
    },
    "0059.HK": {
        "short_name": "SKYFAME REALTY",
        "long_name": "Skyfame Realty (Holdings) Limited",
        "summary": "Skyfame Realty (Holdings) Limited, an investment holding company, engages in the property development, investment, and management activities in the People's Republic of China. The company develops a range of properties, such as residential and commercial properties, offices, serviced apartments, and hotels. It is also involved in provision of services in the youth community development projects; operation of a hospital; and technology operating services activities. The company is headquartered in Guangzhou, China. Skyfame Realty (Holdings) Limited is a subsidiary of Cosmos Tianyu Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "0272.HK": {
        "short_name": "SHUI ON LAND",
        "long_name": "Shui On Land Limited",
        "summary": "Shui On Land Limited, an investment holding company, develops and sells properties in the Chinese Mainland. It operates through three segments: Property Development, Property Investment, and Construction. The Property Development segment develops and sells properties, such as residential, office, retail, entertainment, and cultural properties. The Property Investment segment leases offices and commercial/mall properties; provides property management services; and operates hotels. The Construction segment engages in the construction, interior fitting-out, renovation, and maintenance of building premises, as well as the provision of related consultancy services. The company also engages in the development of science and technology; and retail business. In addition, it provides business and hotel management, food and beverage, management, secretarial, education and business information consultancy, cultural diffusion, debt financing, construction, electronic commerce, and decoration services. The company was founded in 2004 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "0410.HK": {
        "short_name": "SOHO CHINA",
        "long_name": "SOHO China Limited",
        "summary": "SOHO China Limited, together with its subsidiaries, engages in the real estate development, and property leasing and management activities in People's Republic of China. The company operates in two segments, Properties Development and Properties Investment. It also operates serviced apartments. SOHO China Limited was founded in 1995 and is headquartered in Beijing, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "0496.HK": {
        "short_name": "KASEN",
        "long_name": "Kasen International Holdings Limited",
        "summary": "Kasen International Holdings Limited, an investment holding company, manufactures and sells upholstered furniture in the United States, the People's Republic of China, Europe, and internationally. It operates through Manufacturing, Properties Development, and Others segments. The company produces and sells sofas, dining chairs, and other furniture products; and glass fiber reinforced plastic products. It also develops properties; operates resorts; and provides property management and tourism resort-related services. In addition, the company engages in the operation of a restaurant and hotel, waterpark, and provision of travel-related services; wood processing activities; and trading of leather products, as well as paper making business. Kasen International Holdings Limited was founded in 1995 and is headquartered in Haining, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Haining"
    },
    "0733.HK": {
        "short_name": "HOPEFLUENT",
        "long_name": "Hopefluent Group Holdings Limited",
        "summary": "Hopefluent Group Holdings Limited, an investment holding company, provides real estate agency services in the People's Republic of China and Australia. It operates through Property Real Estate Agency and Financial Services segments. The company offers first hand real estate services to property developers; secondary property real estate services; and mortgage referral and loan financing services to individuals or companies. It also provides advertising and marketing, and microcredit services, as well as investment and consulting services. Hopefluent Group Holdings Limited was founded in 1995 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "0747.HK": {
        "short_name": "SHENYANG PUBLIC",
        "long_name": "Shenyang Public Utility Holdings Company Limited",
        "summary": "Shenyang Public Utility Holdings Company Limited, an investment holding company, engages in the construction of infrastructure and development of properties in the People's Republic of China and Hong Kong. It is also involved in property investment; securities investment; credit business; and logistics, freight forwarding, warehousing and distribution services. The company was founded in 1999 and is based in Shenyang, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenyang"
    },
    "0846.HK": {
        "short_name": "MINGFA GROUP",
        "long_name": "Mingfa Group (International) Co., Ltd.",
        "summary": "Mingfa Group (International) Co., Ltd., an investment holding company, engages in the property development and investment, and hotel operation businesses in the People's Republic of China. The company operates through three segments: Property Development, Hotel, and Property Investment and Management. The Property Development segment develops commercial and residential real estate properties. The Hotel segment is involved in the operation of hotels. The Property Investment and Management segment invests in properties; and offers management and security services to residential, hotel, and commercial properties. It is also involved in the manufacture and sale of furniture; trade of construction materials; and provision of sports, as well as consultancy services. Mingfa Group (International) Co., Ltd. was founded in 1994 and is based in Nanjing, the People's Republic of China. Mingfa Group (International) Co., Ltd. operates as a subsidiary of Galaxy Earnest Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Nanjing"
    },
    "0873.HK": {
        "short_name": "SHIMAO SERVICES",
        "long_name": "Shimao Services Holdings Limited",
        "summary": "Shimao Services Holdings Limited, an investment holding company, provides property management and community living services in the People's Republic of China. The company offers property management services, including security, cleaning, greening and gardening, repair, and maintenance services to property developers, property owners, and residents. It also provides community value added services, such as community asset management services; carpark sales related services; home improvement services comprising marketing and promotional services through its online More+ platform and offline marketing and promotional activities, as well as home furnishing services; and other services primarily consisting of housekeeping, and home electronics repair and maintenance services, as well as sells software and hardware used in smart community solutions to property owners and residents. In addition, the company offers value-added services, such as sales office management services; preliminary planning and design consultancy services; and repair and maintenance services to non-property owners. Shimao Services Holdings Limited was founded in 2005 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "0884.HK": {
        "short_name": "CIFI HOLD GP",
        "long_name": "CIFI Holdings (Group) Co. Ltd.",
        "summary": "CIFI Holdings (Group) Co. Ltd., an investment holding company, invests in, develops, and manages properties in the People's Republic of China. The company operates through Sales of Properties; Property Investment; and Project Management and Other Property Related Services segments. It develops and sells office and commercial premises, and residential properties; leases investment properties; and offers project management and other property related services. The company also provides property construction, agency, and information consulting services; and consultancy, investment management and consultation, and business management services. As of December 31, 2019, it had a land bank with total and attributable gross floor area of approximately 50.7 million square meters and 26.5 million square meters. CIFI Holdings (Group) Co. Ltd. was founded in 2000 and is headquartered in Shanghai, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "0960.HK": {
        "short_name": "LONGFOR GROUP",
        "long_name": "Longfor Group Holdings Limited",
        "summary": "Longfor Group Holdings Limited, an investment holding company, engages in property development, investment, and management businesses in China. Its Property Development segment develops and sells office and commercial premises, and residential properties. The company's Property Investment segment leases investment properties, including shopping malls and rental housing. Its Property Management and Related Services and Others segment provides property management and related services, as well as hotel operation and other services. The company was formerly known as Longfor Properties Co. Ltd. and changed its name to Longfor Group Holdings Limited in June 2018. Longfor Group Holdings Limited was founded in 1993 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "0IW.F": {
        "short_name": "DAFA PROPERTIES GR.",
        "long_name": "DaFa Properties Group Limited",
        "summary": "DaFa Properties Group Limited, an investment holding company, operates as a real estate developer in the Yangtze River Delta Region in the People's Republic of China. The company is involved in the development and sale of residential properties; development, operation, and management of commercial and mixed-use properties; and provision of management consulting services. As of December 31, 2019, it had a portfolio of 69 projects consisting of 63 residential properties, two residential and commercial complexes, two commercial complexes, one office floor, and one residential and service apartment. DaFa Properties Group Limited was founded in 1996 and is headquartered in Shanghai, China. DaFa Properties Group Limited is a subsidiary of Splendid Sun Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    },
    "0RJ.F": {
        "short_name": "REDSUN PROPERTIES GROUP",
        "long_name": "Redsun Properties Group Limited",
        "summary": "Redsun Properties Group Limited engages in the property development business in the People's Republic of China. It operates in three segments: Property Development, Commercial Property Investment and Operation, and Hotel Operations. The company focuses on the development of residential properties; and development, operation, and management of commercial and other properties. It also leases properties; operates hotels; sells construction materials; and provides housekeeping and scientific research and technology services. The company was incorporated in 2017 and is headquartered in Shanghai, the People's Republic of China. Redsun Properties Group Limited is a subsidiary of Redsun Properties Group (Holdings) Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    },
    "1030.HK": {
        "short_name": "SEAZEN",
        "long_name": "Seazen Group Limited",
        "summary": "Seazen Group Limited, together with its subsidiaries, engages in the investment, development, and sale of properties in the People's Republic of China. The company operates through two segments, A Share Company and Non-A Share Companies. It primarily develops and sells residential properties and mixed-use complexes, as well as provides commercial property management and other services. As of December 31, 2019, the company had total land bank of approximately 124 million square meters. It also provides construction design and consulting, asset operation and management, marketing research, consulting, department store management, apartment leasing, property and cost consulting, office space rental, information technology, and children entertainment, as well as hotel, and conference, and cinema management services. In addition, the company offers securities and future brokerage, book running, placing management, and money lending services, as well as dealing and advising services of securities. Further, it provides architecture designing and care services; and is involved in the maintenance and leasing energy equipment, as well as designs, manufactures, and sells auto parts. The company was formerly known as Future Land Development Holdings Limited and changed its name to Seazen Group Limited in November 2019. The company was founded in 1996 and is headquartered in Shanghai, the People's Republic of China. Seazen Group Limited is a subsidiary of Wealth Zone Hong Kong Investments Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "1153.HK": {
        "short_name": "JIAYUAN SER",
        "long_name": "Jiayuan Services Holdings Limited",
        "summary": "Jiayuan Services Holdings Limited operates as a property management service provider in Zhejiang province, the Peoples Republic of China. Its services primarily include property management services to property developers, property owners, and residents, primarily comprising cleaning, security, gardening and landscaping, and repair and maintenance services; value-added services to non-property owners, primarily comprising sales management services, preliminary planning and design consultancy services, pre-delivery cleaning and inspection services, car park sales assistance services, and other customized services; and community value-added services to property owners and residents, primarily comprising home-living services, common area value-added services, and car park leasing assistance services, as well as sells groceries to property owners. The company was founded in 2004 and is headquartered in Jiaxing, the Peoples Republic of China. Jiayuan Services Holdings Limited(SEHK:1153) operates independently of Jiayuan International Group Limited as of December 9, 2020.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Jiaxing"
    },
    "1209.HK": {
        "short_name": "CHINA RES MIXC",
        "long_name": "China Resources Mixc Lifestyle Services Limited",
        "summary": "China Resources Mixc Lifestyle Services Limited, an investment holding company, provides property management and commercial operational services in the People's Republic of China. The company offers management services for residential properties and other non-commercial properties, such as stadiums, and parks and industrial parks, as well as various services to families and residents in the communities to meet their living needs. It also provides commercial operational and property management services covering commercial properties under its management include shopping malls and office buildings; commercial operational services, such as pre-opening and operation management services to shopping malls; property management and other services, principally comprising security, cleaning and greening, and repair and maintenance, as well as other value-added services; and commercial subleasing services, where it leases shopping malls from their owners and sublease to tenants, such as retail stores and supermarkets. In addition, the company offers thermal energy supply, as well as construction and decoration services. Its customers primarily consist of property developers, property owners, property owners' associations, residents, and tenants. The company provides commercial operational services to shopping malls under principal brands, namely Â\u0091MIXC' and Â\u0091MIXONE'. As of June 30, 2020, it managed 22 shopping mall projects under MIXC and 26 shopping mall projects under MIXONE. The company was founded in 1994 and is headquartered in Shenzhen, China. China Resources Mixc Lifestyle Services Limited is a subsidiary of China Resources Land Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "1232.HK": {
        "short_name": "GW TIANDI",
        "long_name": "Golden Wheel Tiandi Holdings Company Limited",
        "summary": "Golden Wheel Tiandi Holdings Company Limited, an investment holding company, owns, develops, and operates integrated commercial and residential properties in Mainland China and Hong Kong. The company operates in three segments: Property Development, Property Leasing, and Hotel Operation. It develops and sells properties; and offers property leasing services, including the lease of self-owned properties and sub-lease of rented properties, as well as operates hotels. The company also develops and operates shopping malls and integrated commercial projects in Jiangsu and Hunan provinces; and provides property decoration services. As of December 31, 2019, the company had a land bank of approximately 1,711,270 square meters. Golden Wheel Tiandi Holdings Company Limited was founded in 1994 and is headquartered in Nanjing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Nanjing"
    },
    "1379.HK": {
        "short_name": "WENLING MCT",
        "long_name": "Wenling Zhejiang Measuring and Cutting Tools Trading Centre Company Limited",
        "summary": "Wenling Zhejiang Measuring and Cutting Tools Trading Centre Company Limited engages in property leasing business in Mainland China. It also provides property management and support services, as well as e-commerce technology development services. The company was founded in 2003 and is headquartered in Wenling, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Wenling"
    },
    "1396.HK": {
        "short_name": "GD-HKGBA HLDGS",
        "long_name": "Guangdong - Hong Kong Greater Bay Area Holdings Limited",
        "summary": "Guangdong - Hong Kong Greater Bay Area Holdings Limited, together with its subsidiaries, develops, operates, and sells commercial trade and logistics centers, and residential properties in the People's Republic of China. The company's trade centers are used for the wholesale and retail sale of a range of products, including hardware, electric tools, building materials, furniture and home furnishings, home electronics, apparels, and small goods. It is also provides property management, investment management, and finance leasing services. The company was formerly known as Hydoo International Holding Limited and changed its name to Guangdong - Hong Kong Greater Bay Area Holdings Limited in August 2020. The company was founded in 1995 and is headquartered in Shenzhen, the People's Republic of China. Guangdong - Hong Kong Greater Bay Area Holdings Limited is a subsidiary of China Guangdong Â\u0096 Hong Kong Greater Bay Area Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "1427.HK": {
        "short_name": "CH TIANBAO GP",
        "long_name": "China Tianbao Group Development Company Limited",
        "summary": "China Tianbao Group Development Company Limited operates as a property developer and construction company in the People's Republic of China. The company operates through two segments, Property Development and Construction Contracting. The Construction Contracting segment provides construction contracting services primarily as a general contractor for building construction projects; and infrastructure construction projects, such as urban roads, bridges, facilities for water supply and treatment, urban pipelines, city squares, and street lighting. It also undertakes industrial and commercial construction projects comprising steel structure, landscaping for gardens, industrial construction, and preservation of antiquities and historical buildings. This segment serves property developers and local government entities. The Property Development segment develops and sells residential properties, as well as leases and operates investment property. The company was founded in 1998 and is headquartered in Zhuozhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Zhuozhou"
    },
    "1502.HK": {
        "short_name": "FIN STREET PPT",
        "long_name": "Financial Street Property Co., Limited",
        "summary": "Financial Street Property Co., Limited operates as a property management company in the People's Republic of China. It manages various types of business properties, such as office and commercial buildings, business complexes, low-density office parks, public properties, hospitals, college properties, and residences. The company also provides community pension, real estate brokerage, and catering services, as well as operates hotels. Its customers include national financial regulatory agencies, financial bank headquarters, and large state-owned enterprises and businesses. The company was founded in 1994 and is headquartered in Beijing, China. Financial Street Property Co., Limited is a subsidiary of Beijing Huarong Zonghe Investment Co., Ltd.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "1516.HK": {
        "short_name": "SUNAC SERVICES",
        "long_name": "Sunac Services Holdings Limited",
        "summary": "Sunac Services Holdings Limited provides property management services, value-added services to non-property owners, and community value-added services in the People's Republic of China. The company's property management services comprise a range of services to property owners and residents, as well as property developers, including security, cleaning, greening, gardening, and repair and maintenance services for the operation of common area facilities. Its property management portfolio covers residential properties, primarily mid- to high-end ones, and non-residential properties, such as commercial, public, and other properties. The company's value-added services comprise sales assistance services to property developers to assist with their sales and marketing activities at property sales venues and display units; consultancy and other value-added services to non-property owners, such as consultancy, pre-delivery, and engineering services, principally to property developers with a small portion to other property management companies; and property agency services to property developers primarily in respect of tourism and vacation projects. Its community value-added services include property interior decoration services, community space operation services, real estate brokerage services, and sale of use rights of car park spaces; and community living services, such as housekeeping, group purchase, and tourism services to property owners and residents of its managed properties to address their daily lifestyle needs. The company was founded in 2004 and is headquartered in Tianjin, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Tianjin"
    },
    "1528.HK": {
        "short_name": "RS MACALLINE",
        "long_name": "Red Star Macalline Group Corporation Ltd.",
        "summary": "Red Star Macalline Group Corporation Ltd. operates and manages home improvement and furnishings shopping malls. The company operates its shopping malls under the Red Star Macalline brand name. As of December 31, 2020, it operated 92 Portfolio shopping malls and 273 managed shopping malls; 11 home furnishing shopping malls through strategic cooperation; and 476 home improvement material stores/industry streets. The company also engages in the leasing of floor areas to the tenants; retail sale of home furnishing merchandise, as well as provision of related decorating services; and sale of pre-paid cards. In addition, it offers Internet home decoration, Internet retail, and logistics and delivery services; joint marketing; and shopping mall design, construction, consultation, and home design and decoration services, as well as construction site coordination and supervision services. Further, the company provides site leasing management, warehouse logistics, asset and investment management, exhibition, financing, equipment leasing, and enterprise management services. The company was formerly known as Shanghai Red Star Macalline Home Living and Decorating Company Limited and changed its name to Red Star Macalline Group Corporation Ltd. in 2011. The company was founded in 2007 and is headquartered in Shanghai, the People's Republic of China. Red Star Macalline Group Corporation Ltd. is a subsidiary of Red Star Macalline Holding Group Company Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "1570.HK": {
        "short_name": "WEIYE HOLDINGS",
        "long_name": "Weiye Holdings Limited",
        "summary": "Weiye Holdings Limited, an investment holding company, develops residential and commercial properties in the People's Republic of China, Singapore, and internationally. It operates in two segments, Property Development and Equipment Manufacturing. The company also constructs resettlement houses and leases investment properties. In addition, it manufactures, trades in, and wholesales heating, ventilation, air-conditioning, air purification, and clean room equipment, including fan filter units, air showers, clean booths, pass boxes, clean hand dryers, clean benches, deflection grilles, and air diffusers. Further, the company trades in building construction materials; provides property management services; and offers logistics management, ancillary, technology consultation and transfer, and after-sales services, as well as agency services. Weiye Holdings Limited was incorporated in 1984 and is headquartered in Shenzhen, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "1622.HK": {
        "short_name": "REDCO GROUP",
        "long_name": "Redco Properties Group Limited",
        "summary": "Redco Properties Group Limited, an investment holding company, engages in the property development and investment activities in the People's Republic of China. The company operates through Greater Western Taiwan Straits Economic Zone; Central and Western Regions; Bohai Economic Rim; Greater Bay Area Pearl; River Delta Region; and Others segments. It develops residential and commercial properties. The company is also involved in the provision of construction design and cost consulting, construction and sea reclamation, project management, and healthcare services. In addition, it trades in construction materials and provides property management services. Redco Properties Group Limited was founded in 1992 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "1628.HK": {
        "short_name": "YUZHOU GROUP",
        "long_name": "Yuzhou Group Holdings Company Limited",
        "summary": "Yuzhou Group Holdings Company Limited, an investment holding company, engages in the property development activities in the People's Republic of China. It is involved in the boutique housing development, investment property operations, hotel operation management, and property management businesses. The company develops residential, retail, and commercial properties. It has a land bank area of approximately 20.12 million square meters. The company was formerly known as Yuzhou Properties Company Limited and changed its name to Yuzhou Group Holdings Company Limited in June 2020. Yuzhou Group Holdings Company Limited was founded in 1994 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "1638.HK": {
        "short_name": "KAISA GROUP",
        "long_name": "Kaisa Group Holdings Ltd.",
        "summary": "Kaisa Group Holdings Ltd., an investment holding company, engages in the property investment, development, and management businesses in the People's Republic of China. It develops villas, townhouses, residential and commercial buildings, and office buildings. The company is also involved in the hotel and catering, cinema, and department stores and cultural center operations, as well as waterway passenger and cargo transportation, and healthcare business. In addition, it offers commerce management and construction engineering services. Kaisa Group Holdings Ltd. was founded in 1999 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "1755.HK": {
        "short_name": "S-ENJOY SERVICE",
        "long_name": "S-Enjoy Service Group Co., Limited",
        "summary": "S-Enjoy Service Group Co., Limited, an investment holding company, provides property management and related value-added services for property developers in the People's Republic of China. It offers a range of property management services, including property and equipment maintenance, security, cleaning, gardening, public area maintenance, and other property management related services. The company also manages a portfolio of properties comprising residential properties and non-residential properties, including office buildings, mixed-purpose complexes, factories, parks, and industrial zones. In addition, it offers value-added services, such as property developer-related services, which include sales office, consultancy and building inspection services; community-related services, including public resources management, extensive decoration, orange app operation, and asset management services; and professional services that comprises repair and maintenance, and engineering subcontracting services. Further, the company provides management consultation, engineering, and software development and maintenance services. The company was formerly known as Xinchengyue Holdings Limited. S-Enjoy Service Group Co., Limited was incorporated in 2018 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "1777.HK": {
        "short_name": "FANTASIA",
        "long_name": "Fantasia Holdings Group Co., Limited",
        "summary": "Fantasia Holdings Group Co., Limited, an investment holding company, invests in, develops, sells, and leases commercial and residential properties primarily in the People's Republic of China. It operates through six segments: Property Development, Property Investment, Property Agency Services, Property Operation Services, Hotel Operation, and Others. The company engages in the development of urban complexes, upscale boutique residences, and mid-to-high end residence projects; the provision of hotel accommodation, property management, value-added, engineering, and travel agency services; and manufacture and sale of fuel pumps. It also provides community services through online platform; and wealth management, finance lease, petty loans, P2P, funds and factoring, consumer finance, insurance, payment services, etc. for enterprises and individuals, as well as operates and manages various city complexes, shopping centers, etc. In addition, the company operates golfs, high-end city clubs, private clubs, theme parks, art museums, etc.; and develops various home-based care service stations, daytime care centers, and senior citizen apartments, which provide home care, health care, rehabilitation therapy, nutrition catering, and spiritual solace, as well as education services. The company was founded in 1996 and is headquartered in Shenzhen, the People's Republic of China. Fantasia Holdings Group Co., Limited is a subsidiary of Fantasy Pearl International Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "1778.HK": {
        "short_name": "COLOUR LIFE",
        "long_name": "Colour Life Services Group Co., Limited",
        "summary": "Colour Life Services Group Co., Limited, an investment holding company, provides property management and community services through an online platform in the People's Republic of China. It offers services to communities under commission and lump sum basis; pre-sale services to property developers; and consultancy services to property management companies. The company also provides community leasing, sale, and other value-added services, which primarily include the provision of online promotion, sales and rental assistance, and others. In addition, it offers engineering services, such as the provision of equipment installation, repair and maintenance, automation and other equipment upgradation, and energy-saving services. The company was founded in 2002 and is headquartered in Shenzhen, the People's Republic of China. Colour Life Services Group Co., Limited is a subsidiary of Fantasia Holdings Group Co., Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "1813.HK": {
        "short_name": "KWG GROUP",
        "long_name": "KWG Group Holdings Limited",
        "summary": "KWG Group Holdings Limited, an investment holding company, engages in the investment, development, management, and sale of real estate properties. It operates through four segments: Property Development, Property Investment, Hotel Operation, and Property Management. The company's properties portfolio include mid- to high-end residential properties, serviced apartments, villas, office buildings, hotels, and shopping malls. It also engages in the operation of hotels; and provision of food and beverage sales and other ancillary services. The company was formerly known as KWG Property Holding Limited and changed its name to KWG Group Holdings Limited in August 2018. KWG Group Holdings Limited was founded in 1995 and is headquartered in Guangzhou, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "1862.HK": {
        "short_name": "JINGRUI HLDGS",
        "long_name": "Jingrui Holdings Limited",
        "summary": "Jingrui Holdings Limited, an investment holding company, engages in property development business in the People's Republic of China. The company operates through Property Development Platform, Office and Apartment Platform, and All Other Platforms segments. It develops residential and commercial properties. It also invests in office buildings and apartments; and provides management and security services to residential and commercial properties. In addition, the company is involved in building decoration engineering, urban infrastructure development, customized decoration, and information technology businesses. Jingrui Holdings Limited was founded in 1993 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "1895.HK": {
        "short_name": "XINYUAN PM",
        "long_name": "Xinyuan Property Management Service (Cayman) Ltd.",
        "summary": "Xinyuan Property Management Service (Cayman) Ltd. provides property management services in the People's Republic of China. The company offers property management services, including cleaning and sanitation, safety and security, gardening, parking space management, and facilities maintenance services for complexes, residential properties, and office buildings. It also provides a range of value-added services, such as utility fee payment, common area resources management, home living, and property cleaning and delivery services. In addition, the company offers pre-delivery services comprising sales assistance, property sales venues management, and property sales venues warm-up services; consulting services, such as advisory, and referral and management services; and property decoration, real estate marketing, event planning and execution, and engineering services. It serves property developers, owners, and occupants. The company has a strategic cooperation agreement with CCBC Zhengzhou. Xinyuan Property Management Service (Cayman) Ltd. was founded in 1998 and is headquartered in Zhengzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Zhengzhou"
    },
    "18V.F": {
        "short_name": "CHINA VANKE CO.LTD H YC 1",
        "long_name": "China Vanke Co., Ltd.",
        "summary": "China Vanke Co., Ltd., a real-estate company, develops and sells properties in the People's Republic of China. The company operates through Property Development and Property Management segments. It develops residential, retail, and office properties; and other ancillary facilities. The company also provides property management and related services to purchasers and tenants of its own developed residential properties and shopping arcades, as well as to the external property developers; and undertakes construction contracts. In addition, it is involved in logistics and warehousing, ski resorts, education, and elderly care activities; and rents housing properties. China Vanke Co., Ltd. was founded in 1984 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "1918.HK": {
        "short_name": "SUNAC",
        "long_name": "Sunac China Holdings Limited",
        "summary": "Sunac China Holdings Limited, together with its subsidiaries, invests in, develops, and sells residential and commercial properties in the People's Republic of China. The company provides conferences and exhibitions, tourism and vacations, theme parks, hotel operations, medical and health care, IP development and operation, and film and television content production and distribution services. It is also involved in property services, commercial operations, property management, fitting and decoration, and cultural and tourism city construction and operation activities. The company was founded in 2003 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "1922.HK": {
        "short_name": "YINCHENG LS",
        "long_name": "Yincheng Life Service CO., Ltd.",
        "summary": "Yincheng Life Service CO., Ltd., an investment holding company, provides property management services in the People's Republic of China. The company offers property management services, including security, cleaning, car park management, gardening and landscaping, daily repair and maintenance of equipment and machinery, and ancillary customer services, as well as repair and maintenance of specialized elevators, escalators, and mechanical car park equipment; and community value-added services, such as common area value-added, fitness, and community convenience. It provides its services for various properties, including residential properties and non-residential properties comprising government facilities, financial institutions, property sales offices, parks, highway service area, industrial parks, mixed-use properties, schools, and office buildings. As of December 31, 2019, the company had a portfolio of 239 properties, including 116 residential properties, and 123 non-residential properties; and served 140,000 households. The company was founded in 1997 and is headquartered in Nanjing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Nanjing"
    },
    "1941.HK": {
        "short_name": "YE XING GROUP",
        "long_name": "Ye Xing Group Holdings Limited",
        "summary": "Ye Xing Group Holdings Limited, an investment holding company, provides property management and related services for residential and non-residential properties in the People's Republic of China. The company's property management services include repair and maintenance, security, cleaning and gardening, and car parking space management and leasing, as well as other property management related services covering office buildings and shopping malls, shop spaces, and other facilities, such as stadiums. It also offers property developer related services comprising sales assistance, pre-delivery cleaning and preparation, post-delivery repair, and planning and design consultancy and inspection; and value-added services, such as home living and common area leasing services. The company's customers primarily consist of property developers, tenants, and residents of managed properties. Ye Xing Group Holdings Limited was founded in 2003 and is headquartered in Beijing, China. Ye Xing Group Holdings Limited is a subsidiary of Ascendor Futur Holding Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "1971.HK": {
        "short_name": "RSUN SER",
        "long_name": "Redsun Services Group Limited",
        "summary": "Redsun Services Group Limited, an investment holding company, provides community services in Jiangsu Province, China. The company offers property management services, such as security, cleaning, greening and gardening, facility management, and repairs and maintenance to property owners, residents, and tenants covering residential, commercial, and other properties; and to a variety of commercial properties comprising shopping malls, home improvement and furnishings malls, hotels, and theme parks, as well as to other properties consisting of office buildings and schools. It also provides value-added services to non-property owners, including consulting services to other property management companies; preliminary planning and design consultancy services to property developers for property development projects; sales assistance services to property developers at property sales venues and display units, including visitor reception, cleaning, security inspection, and maintenance; and other value-added services to property developers, such as inspection services. In addition, the company offers community value-added services to residential property owners and residents, which include property brokerage, property decoration, community convenience services, assets management, and common area value-added services. Further, it provides installation, household, decoration, software maintenance, pension, and system development services. The company was founded in 2003 and is headquartered in Nanjing, China. Redsun Services Group Limited is a subsidiary of Redsun Services Group (Holdings) Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Nanjing"
    },
    "1995.HK": {
        "short_name": "EVERSUNSHINE LS",
        "long_name": "Ever Sunshine Lifestyle Services Group Limited",
        "summary": "Ever Sunshine Lifestyle Services Group Limited provides property management services in the People's Republic of China. It offers services for residential and non-residential properties, such as office buildings, shopping malls, government buildings, schools, exhibition centers, highway services stations, subway rail transit industrial parks, and hospitals. The company also provides value added services to non-property owners, including sales assistance, additional tailored, housing repair, pre-delivery inspection, and preliminary planning and design consultancy services. In addition, it offers community value-added services to property owners and residents, which include home living services, property agency services, and common area value-added services, as well as parking space management, leasing, and sales services. Further, the company provides construction and maintenance services. Ever Sunshine Lifestyle Services Group Limited was incorporated in 2018 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "1996.HK": {
        "short_name": "RSUN PPT",
        "long_name": "Redsun Properties Group Limited",
        "summary": "Redsun Properties Group Limited engages in the property development business in the People's Republic of China. It operates in three segments: Property Development, Commercial Property Investment and Operation, and Hotel Operations. The company focuses on the development of residential properties; and development, operation, and management of commercial and other properties. It also leases properties; operates hotels; sells construction materials; and provides housekeeping and scientific research and technology services. The company was incorporated in 2017 and is headquartered in Shanghai, the People's Republic of China. Redsun Properties Group Limited is a subsidiary of Redsun Properties Group (Holdings) Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "1LUA.F": {
        "short_name": "LEJU HOLDINGS LTD ADR 1",
        "long_name": "Leju Holdings Limited",
        "summary": "Leju Holdings Limited, through its subsidiaries, provides online to offline (O2O) real estate services in the People's Republic of China. The company offers real estate e-commerce, online advertising, and online listing services through its online platform, which comprises websites covering 386 cities and various mobile applications. It also operates various real estate and home furnishing Websites of SINA Corporation (SINA); and official accounts on Weixin, a social communication platform and Weibo, a microblog. In addition, the company provides selling discount coupons; and facilitating online property viewing, physical property visits, marketing events, and pre-sale customer support, as well as home furnishing business transactions on its platform for new residential properties. Further, it sells advertising primarily on the SINA new residential properties and home furnishing websites; and acts as an advertising agent for the SINA home page and non-real estate Websites with respect to advertising sold to real estate developers and home furnishing suppliers. Additionally, the company offers fee-based online property listing services to real estate agents; and services to individual property sellers. Leju Holdings Limited was incorporated in 2013 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "1VC.F": {
        "short_name": "E-H.(CH)ENT. H. DL-,00001",
        "long_name": "E-House (China) Enterprise Holdings Limited",
        "summary": "E-House (China) Enterprise Holdings Limited, an investment holding company, provides real estate transaction services in China. It primarily offers real estate agency, real estate data and consulting, and real estate brokerage network services to real estate developers, brokerage firms, banks, investors, and government and non-profit organizations. The company also provides technology and information development and consulting services, and real estate marketing services. E-House (China) Enterprise Holdings Limited was founded in 2000 and is headquartered in Shanghai, China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    },
    "2007.HK": {
        "short_name": "COUNTRY GARDEN",
        "long_name": "Country Garden Holdings Company Limited",
        "summary": "Country Garden Holdings Company Limited, an investment holding company, invests, develops, and constructs real estae properties primarily in Mainland China. The company operates through two segments, Property Development and Construction. It develops residential projects, such as townhouses and condos; and car-parks and retail shops. The company also develops, operates, and manages hotels. In addition, it is researches and develops robot intelligence; develops electronic hardware and biomass energy; sells food; and provides interior decoration, landscape design, agriculture and animal husbandry, investment consulting, cultural activity planning, and real estate consulting services. Country Garden Holdings Company Limited was founded in 1992 and is headquartered in Foshan, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Foshan"
    },
    "2019.HK": {
        "short_name": "DEXIN CHINA",
        "long_name": "Dexin China Holdings Company Limited",
        "summary": "Dexin China Holdings Company Limited, an investment holding company, engages in the property development business in China. It operates through three segments: Property Development and Constructions, Property Investment, and Other Businesses. The company develops residential and commercial properties; and develops, operates, and manages commercial and mixed use properties. It is also involved in property construction and project management activities; lease of commercial properties; and hotel operation activities. The company was founded in 1993 and is headquartered in Hangzhou, China. Dexin China Holdings Company Limited is a subsidiary of Tak Shin International Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "2048.HK": {
        "short_name": "E-HOUSE ENT",
        "long_name": "E-House (China) Enterprise Holdings Limited",
        "summary": "E-House (China) Enterprise Holdings Limited, an investment holding company, provides real estate transaction services in China. It primarily offers real estate agency, real estate data and consulting, and real estate brokerage network services to real estate developers, brokerage firms, banks, investors, and government and non-profit organizations. The company also provides technology and information development and consulting services, and real estate marketing services. E-House (China) Enterprise Holdings Limited was founded in 2000 and is headquartered in Shanghai, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "2088.HK": {
        "short_name": "XIWANG PROPERTY",
        "long_name": "Xiwang Property Holdings Company Limited",
        "summary": "Xiwang Property Holdings Company Limited, together with its subsidiaries, develops properties in the People's Republic of China. The company develops residential and commercial projects. It also invests in properties. The company was formerly known as Xiwang Sugar Holdings Company Limited and changed its name to Xiwang Property Holdings Company Limited in August 2013. The company was founded in 2001 and is headquartered in Zouping County, the People's Republic of China. Xiwang Property Holdings Company Limited is a subsidiary of Xiwang Investment Company Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Zouping"
    },
    "2103.HK": {
        "short_name": "SINIC HOLDINGS",
        "long_name": "Sinic Holdings (Group) Company Limited",
        "summary": "Sinic Holdings (Group) Company Limited, an investment holding company, engages in the property development and leasing activities in the People's Republic of China. The company develops and sells residential and commercial properties. It also develops, operates, and manages commercial properties, including shopping centers, apartments, and office buildings, as well as manages hotels; and provides consulting services to independent third parties. The company was founded in 2010 and is headquartered in Shanghai, the People's Republic of China. Sinic Holdings (Group) Company Limited is a subsidiary of Sinic Holdings Group Company Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "2107.HK": {
        "short_name": "FIRST SERVICE",
        "long_name": "First Service Holding Limited",
        "summary": "First Service Holding Limited provides property management services and green living solutions in the People's Republic of China and internationally. The company operates in two segments, First Property Management and First Living. It primarily offers property management services comprising cleaning, security, gardening, and repair and maintenance to property developers, property owners, and residents. The company's portfolio of properties under management includes residential properties; and non-residential properties comprising office buildings, government facilities, hotels, and shopping centers. It also provides green living solutions consisting of energy operation, green technology consulting, and systems installation services, as well as sells AIRDINO systems. In addition, the company offers value-added services to non-property owners, property owners, and residents. Its value-added services comprise sales assistance, and preliminary planning and design consultancy services, including on-site design consulting, construction stage inspection, sales assistance consulting, and pre-delivery inspection to non-property owners; and community value-added services consisting of parking space management, communal area leasing, and home living services. First Service Holding Limited was founded in 1999 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "2117.HK": {
        "short_name": "DATANG GROUP",
        "long_name": "Datang Group Holdings Limited",
        "summary": "Datang Group Holdings Limited engages in the development of residential and commercial properties in China. Its portfolio of commercial properties comprises office buildings, hotels, shopping centers, and others. The company focuses on selected economic regions in China, including the Western Taiwan Strait Economic Region, Beibu Gulf Region and Neighboring Cities, Beijing-Tianjin-Hebei Region, Midstream Parts of the Yangtze River Region, Yangtze River Delta Region, and Chengdu-Chongqing Region. It serves local governments, as well as individual and corporate purchasers of residential and commercial properties. The company was incorporated in 2018 and is headquartered in Xiamen, China. Datang Group Holdings Limited operates as a subsidiary of Dynasty International Co. Ltd.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Xiamen"
    },
    "2146.HK": {
        "short_name": "ROISERV",
        "long_name": "Roiserv Lifestyle Services Co., Ltd.",
        "summary": "Roiserv Lifestyle Services Co., Ltd. provides property management services in China. The company's property portfolio comprises residential properties; non-residential properties, such as shopping malls, office buildings, and serviced apartments; and public and other properties, including industry parks, schools, factories, fitness and indoor swimming pool, and parks. It also offers community, asset operation, product delivery, home, catering, and community health keeping services. Further, the company engages in managing parking lots; providing leasing services; operating and managing convenience store; online sales business; commodity and food retail; and repair and maintenance of elevators. The company was formerly known as Langfang Rongsheng Property Service Co., Ltd The company was founded in 2000 and is headquartered in Langfang, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Langfang"
    },
    "2168.HK": {
        "short_name": "KAISA PROSPER",
        "long_name": "Kaisa Prosperity Holdings Limited",
        "summary": "Kaisa Prosperity Holdings Limited, an investment holding company, provides property management services in China. Its property management services include management of properties, maintenance and repair of buildings and ancillary facilities, community security management, car-park management, equipment installation, and property consulting services. It also provides pre-delivery services, such as construction sites management, which includes security, cleaning, and maintenance services; and display units and property sales venues management. In addition, the company offers community value-added services consisting of spatial resources leasing and car parking, housing rental and sales, decoration and renovation, wealth management, education, group-buying activities, themed tours, and home delivery services through offline and online channels; and smart solution services, such as automation and other hardware and equipment installation services, as well as sells automation products. Further, it develops and sells computer networks. The company offers its services to residential and non-residential properties, comprising commercial properties, office buildings, arenas and stadiums, government buildings, public facilities, and industrial parks. The company was formerly known as Kaisa Property Holdings Limited and changed its name to Kaisa Prosperity Holdings Limited in July 2019. The company was founded in 1999 and is headquartered in Shenzhen, the People's Republic of China. Kaisa Prosperity Holdings Limited is a subsidiary of Ye Chang Investment Company Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "2202.HK": {
        "short_name": "CHINA VANKE",
        "long_name": "China Vanke Co., Ltd.",
        "summary": "China Vanke Co., Ltd., a real-estate company, develops and sells properties in the People's Republic of China. The company operates through Property Development and Property Management segments. It develops residential, retail, and office properties; and other ancillary facilities. The company also provides property management and related services to purchasers and tenants of its own developed residential properties and shopping arcades, as well as to the external property developers; and undertakes construction contracts. In addition, it is involved in logistics and warehousing, ski resorts, education, and elderly care activities; and rents housing properties. China Vanke Co., Ltd. was founded in 1984 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "2329.HK": {
        "short_name": "GUORUI PPT",
        "long_name": "Guorui Properties Limited",
        "summary": "Guorui Properties Limited, an investment holding company, primarily engages in the development of real estate properties in the People's Republic of China. The company operates through four segments: Property Development, Primary Land Construction and Development Services, Property Investment, and Property Management and Related Services. The Property Development segment develops and sells commercial and residential properties. The Primary Land Construction and Development Services segment provides primary land development services, including services for resettlement, and construction of land infrastructure and ancillary public facilities on land owned by the local governments. The Property Investment segment engages in the rental of investment properties. The Property Management and Related Services segment offers property management and related services. Its principal customers include individual purchasers for residential properties, as well as various types of corporations and other business entities for commercial properties. The company was founded in 1994 and is headquartered in Beijing, China. Guorui Properties Limited is a subsidiary of Alltogether Land Company Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "2599.HK": {
        "short_name": "SHINSUN HOLD GP",
        "long_name": "Shinsun Holdings (Group) Co., Ltd.",
        "summary": "Shinsun Holdings (Group) Co., Ltd., an investment holding company, engages in property development and leasing; and the provision of property management services. The company focusing on the development of residential properties. It is also involved in cultural tourism; hotel operations; and wholesale and retail business. Shinsun Holdings (Group) Co., Ltd. was incorporated in 2019 and is Headquartered in Shanghai, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "2606.HK": {
        "short_name": "LANGUANGJUSTBON",
        "long_name": "Sichuan Languang Justbon Services Group Co., Ltd.",
        "summary": "Sichuan Languang Justbon Services Group Co., Ltd. provides property management services in China. It offers property management services, including security, cleaning, greening and gardening, repairs and maintenance services; consultancy services; and community value-added services. It serves property developers, property owners, and residents. The company was founded in 2000 and is based in Chengdu, the People's Republic of China. Sichuan Languang Justbon Services Group Co., Ltd. is a subsidiary of Sichuan Languang Hejun Industrial Co., Ltd.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Chengdu"
    },
    "2608.HK": {
        "short_name": "SUNSHINE 100",
        "long_name": "Sunshine 100 China Holdings Ltd",
        "summary": "Sunshine 100 China Holdings Ltd invests, develops, and manages real estate properties in the People's Republic of China. It operates through five segments: Mixed-Use Business Complexes, Multi-Functional Residential Communities, Investment Properties, Property Management and Hotel Operation, and Light-Asset Operation. The Mixed-Use Business Complexes segment develops and sells business complex products. The Multi-Functional Residential Communities segment engages in the development and sale of residential properties; and development of land. The Investment Properties segment leases offices and commercial premises. The Property Management and Hotel Operation segment provides property management and hotel accommodation services. The Light-Asset Operation segment provides property selling agency and brand-use services. The company was founded in 1992 and is headquartered in Beijing, the People's Republic of China. Sunshine 100 China Holdings Ltd is a subsidiary of Joywise Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "2699.HK": {
        "short_name": "XINMING CHINA",
        "long_name": "Xinming China Holdings Limited",
        "summary": "Xinming China Holdings Limited, an investment holding company, operates as an integrated residential and commercial property developer in the People's Republic of China. The company operates through three segments: Property Development, Property Leasing, and Others. It develops residential units and ancillary facilities, including mid-rise apartments, high-rise apartments, and townhouses, as well as street-level retail outlets and other facilities, such as clubhouses and swimming pools. The company also invests in and leases commercial properties; and provides property management services to the owners of residential properties. As of December 31, 2019, it leased out an area of approximately 167,327.3 square meters. The company was founded in 2014 and is based in Hangzhou, China. Xinming China Holdings Limited is a subsidiary of Xinxing Company Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "26X.F": {
        "short_name": "DEXIN CHINA HLD. DL-,0005",
        "long_name": "Dexin China Holdings Company Limited",
        "summary": "Dexin China Holdings Company Limited, an investment holding company, engages in the property development business in China. It operates through three segments: Property Development and Constructions, Property Investment, and Other Businesses. The company develops residential and commercial properties; and develops, operates, and manages commercial and mixed use properties. It is also involved in property construction and project management activities; lease of commercial properties; and hotel operation activities. The company was founded in 1993 and is headquartered in Hangzhou, China. Dexin China Holdings Company Limited is a subsidiary of Tak Shin International Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "2777.HK": {
        "short_name": "R&F PROPERTIES",
        "long_name": "Guangzhou R&F Properties Co., Ltd.",
        "summary": "Guangzhou R&F Properties Co., Ltd., together with its subsidiaries, engages in the development and sale of residential and commercial properties in the People's Republic of China, Malaysia, Cambodia, Korea, the United Kingdom, and Australia. The company invests in and develops various properties, including hotels, office buildings, shopping malls, logistic parks, and other retail properties in Beijing, Guangzhou, and other cities. It is also involved in the operation and management of hotels; provides property management and leasing, and architectural and engineering design services, as well as marketing development services; and operates a construction company and football club. Guangzhou R&F Properties Co., Ltd. was founded in 1994 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "3301.HK": {
        "short_name": "RONSHINECHINA",
        "long_name": "Ronshine China Holdings Limited",
        "summary": "Ronshine China Holdings Limited, an investment holding company, engages in the property development business. It is involved in the development of mid-to high-end residential properties and commercial properties in cities in the Western Taiwan Straits Economic Zone, Yangtze River Delta Economic Region, and selected first-and second-tier cities in the People's Republic of China. The company was formerly known as Ronshine China Holdings Limited. Ronshin Group was founded in 2003 and is headquartered in Shanghai, China. Ronshine China Holdings Limited is a subsidiary of Dingxin Company Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "3316.HK": {
        "short_name": "BINJIANG SER",
        "long_name": "Binjiang Service Group Co. Ltd.",
        "summary": "Binjiang Service Group Co. Ltd. provides property management and related services in the People's Republic of China. Its property management services include security, cleaning, gardening, repair, maintenance, and ancillary services to common area of residential and non-residential properties, such as commercial properties, office buildings, corporate headquarter buildings, public facilities, industrial parks, and government buildings. The company also offers value-added services to non-property owners comprising pre-delivery, consulting, and community space services primarily to property developers. In addition, it provides value-added services to property owners, which include home living, community value-added, customized interior furnishing, and property agent services; and personal training at club houses, business center and/or parking lot management services, and customized interior furnishing services, as well as engages in the sale of store rooms and furniture. Further, the company offers decoration, advertisement design, producing, and releasing services; and brokerages services. It serves property owners and residents, property developers, and property management companies. The company was founded in 1995 and is headquartered in Hangzhou, China. Binjiang Service Group Co. Ltd. is a subsidiary of Great Dragon Ventures Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "3319.HK": {
        "short_name": "A-LIVING",
        "long_name": "A-Living Smart City Services Co., Ltd.",
        "summary": "A-Living Smart City Services Co., Ltd., together with its subsidiaries, provide property management, sale, and inspection services in the People's Republic of China. It operates through four segments: Property Management Services, Asset Management Services, Public Services, and Community Commercial Services. The company offers property management services, including security, cleaning, greening, gardening, repair and maintenance, etc.; and extended value-added services for property developers, such as sales center property management services, as well as other extended value-added services comprising property agency services and housing inspection services. It also provides community asset management services that include club house operation, property lease, community-based advertising, parking lot management, community property operation, and secondhand property agency services; and home improvement services, which comprise turnkey furnishing services. In addition, the company builds smart communities, as well as provides advertising and tourism services. Further, it provides software engineering, travel agency, real estate marketing, information technology consulting, enterprise management consulting, hotel management, community, and engineering consulting services. The company was founded in 1997 and is headquartered in Guangzhou, China. A-Living Smart City Services Co., Ltd. is a subsidiary of Zhongshan A-Living Enterprise Management Services Co., Ltd.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "3377.HK": {
        "short_name": "SINO-OCEAN GP",
        "long_name": "Sino-Ocean Group Holding Limited",
        "summary": "Sino-Ocean Group Holding Limited, an investment holding company, engages in the property investment and development activities in the People's Republic of China. The company develops residential properties; invests in office premises, shopping malls, and commercial complexes; and rents apartments. It also provides property management, renovation, consultancy, land development, investment management, and senior housing services, as well as property sales agency and upfitting services. In addition, the company is involved in the environmental technology businesses. The company was formerly known as Sino-Ocean Land Holdings Limited and changed its name to Sino-Ocean Group Holding Limited in May 2016. Sino-Ocean Group Holding Limited was founded in 1993 and is based in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "3380.HK": {
        "short_name": "LOGAN GROUP",
        "long_name": "Logan Group Company Limited",
        "summary": "Logan Group Company Limited, an investment holding company, operates as an integrated property developer in the People's Republic of China. It operates through four segments: Property Development, Property Leasing, Construction and Decoration Contracts, and Primary Land Development. The Property Development segment develops and sells residential properties and retail shops. The Property Leasing segment leases office units and retail shops. The Construction and Decoration Contracts segment constructs office premises and residential buildings, as well as provides decoration services. The Primary Land Development segment sells land for development. The company was formerly known as Logan Property Holdings Company Limited and changed its name to Logan Group Company Limited in June 2020. The company was founded in 1996 and is headquartered in Shenzhen, the People's Republic of China. Logan Group Company Limited is a subsidiary of Junxi Investments Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "3383.HK": {
        "short_name": "AGILE GROUP",
        "long_name": "Agile Group Holdings Limited",
        "summary": "Agile Group Holdings Limited, an investment holding company, engages in the property development, property management, hotel operation, property investment, environmental protection, and other businesses in the People's Republic of China. As of December 31, 2019, the company had a land bank with a total gross floor area of 39.70 million square meters in 75 cities located in Southern China region, Eastern China region, Western China region, Central China region, Hainan and Yunnan region, Northeast China region, Northern China region, Hong Kong, and internationally. It also provides property management services covering 80 cities in 28 provinces and municipalities, including a gross floor area of 233.99 million square meters; asset management services; and tourism management, advertising, building inspection, and management consulting services. In addition, the company is involved in the operation of hotels, shopping malls, office buildings, and community retail malls. Further, it provides hazardous waste treatment, water treatment, and solid waste treatment services; green ecological landscape, home decoration, design consulting, engineering construction, and materials trading services; and real estate construction management services. The company was formerly known as Agile Property Holdings Limited and changed its name to Agile Group Holdings Limited in July 2016. The company was founded in 1985 and is headquartered in Guangzhou, the People's Republic of China. Agile Group Holdings Limited is a subsidiary of Top Coast Investment Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "3603.HK": {
        "short_name": "XINJI SHAXI",
        "long_name": "Xinji Shaxi Group Co., Ltd",
        "summary": "Xinji Shaxi Group Co., Ltd, an investment holding company, operates and manages hospitality supplies and home furnishing shopping malls in the People's Republic of China. The company has three shopping malls for hospitality supplies and two shopping malls for home furnishings. It also rents hospitality supplies; provides exhibition management services; and operates an online shopping mall. The company was founded in 2002 and is based in Guangzhou, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "3639.HK": {
        "short_name": "YIDA CHINA",
        "long_name": "Yida China Holdings Limited",
        "summary": "Yida China Holdings Limited, an investment holding company, develops and operates business parks in the People's Republic of China. The company's Property Development segment develops and sells properties. Its Property Investment segment invests in and rents properties. The company's Business Park Operation and Management segment provides operation and management services to the business park projects owned by the local governments or other independent third parties. Its Construction, Decoration and Landscaping segment engages in property construction business; and the provision of interior decoration services to property buyers, as well as landscaping services to property projects. The company's Property Management segment provides management services to properties. Yida China Holdings Limited's property portfolio includes multifunctional integrated residential community projects, office properties, and residential properties. Yida China Holdings Limited was founded in 1988 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "3662.HK": {
        "short_name": "AOYUAN HEALTHY",
        "long_name": "Aoyuan Healthy Life Group Company Limited",
        "summary": "Aoyuan Healthy Life Group Company Limited, through its subsidiaries, provides property management and commercial operational services in the People's Republic of China. The company offers property management services for high-end residence communities, commercial complexes, apartments, office buildings, villas, tourist towns, etc.; sales assistance services to property developers comprising cleaning, security, and maintenance of pre-display units and sales offices; and community-value added services to property owners or residents. As of December 31, 2019, the company provided property management services to 94 properties in 38 cities covering 13 provinces, municipalities, and autonomous regions in China involving a total gross floor area of 15.1 million square meters. It also provides commercial operational services for shopping malls comprising pre-planning, commercial design, technical consultation, business tenant sourcing agency, preparation for business grand opening, and asset operation, etc. In addition, the company offers traditional Chinese medicine, medical beauty, elderly care, and telecommunication services. Aoyuan Healthy Life Group Company Limited was founded in 2000 and is based in Guangzhou, the People's Republic of China. Aoyuan Healthy Life Group Company Limited is a subsidiary of Main Trend Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "3883.HK": {
        "short_name": "CHINA AOYUAN",
        "long_name": "China Aoyuan Group Limited",
        "summary": "China Aoyuan Group Limited engages in the development of commercial real estate properties in Mainland China, Hong Kong, Australia, and Canada. The company operates through Property Development, Property Investment, and Others segments. It also acquires and develops various real estate projects; and develops and operates cultural tourism, hotel management, sports development, and healthy resort projects. In addition, the company imports and export goods, such as maternal and child care products, cosmetics and skin care products, clothing and bags, food and beverages, household goods, and parallel imported vehicles. Further, it provides medical service platform combining online and offline services; consultancy services; construction services; and financing services. The company was formerly known as China Aoyuan Property Group Limited and changed its name to China Aoyuan Group Limited in November 2018. China Aoyuan Group Limited was founded in 1996 and is headquartered in Guangzhou, the People's Republic of China. The company is a subsidiary of Ace Rise Profits.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "3990.HK": {
        "short_name": "MIDEA REAL EST",
        "long_name": "Midea Real Estate Holding Limited",
        "summary": "Midea Real Estate Holding Limited, an investment holding company, operates as a property developer in the People's Republic of China. It develops and sells residential and industrial properties; and provides commercial and residential property management services, as well as support services for preliminary sales of real estate developments, and other value-added property services. The company also invests in and operates commercial properties, such as urban complexes, community neighbourhood, shopping malls, characteristic commerce, cultural tourism projects, long-term rental apartments, offices, hotels, and other shops. In addition, it is involved in prefabricated construction and smart home solutions businesses. Midea Real Estate Holding Limited was founded in 2004 and is headquartered in Foshan, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Foshan"
    },
    "3S5.F": {
        "short_name": "RED STAR MACAL.GR.H  YC 1",
        "long_name": "Red Star Macalline Group Corporation Ltd.",
        "summary": "Red Star Macalline Group Corporation Ltd. operates and manages home improvement and furnishings shopping malls. The company operates its shopping malls under the Red Star Macalline brand name. As of December 31, 2020, it operated 92 Portfolio shopping malls and 273 managed shopping malls; 11 home furnishing shopping malls through strategic cooperation; and 476 home improvement material stores/industry streets. The company also engages in the leasing of floor areas to the tenants; retail sale of home furnishing merchandise, as well as provision of related decorating services; and sale of pre-paid cards. In addition, it offers Internet home decoration, Internet retail, and logistics and delivery services; joint marketing; and shopping mall design, construction, consultation, and home design and decoration services, as well as construction site coordination and supervision services. Further, the company provides site leasing management, warehouse logistics, asset and investment management, exhibition, financing, equipment leasing, and enterprise management services. The company was formerly known as Shanghai Red Star Macalline Home Living and Decorating Company Limited and changed its name to Red Star Macalline Group Corporation Ltd. in 2011. The company was founded in 2007 and is headquartered in Shanghai, the People's Republic of China. Red Star Macalline Group Corporation Ltd. is a subsidiary of Red Star Macalline Holding Group Company Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    },
    "3SD.F": {
        "short_name": "SINO-OCEAN GROUP HLDG LTD",
        "long_name": "Sino-Ocean Group Holding Limited",
        "summary": "Sino-Ocean Group Holding Limited, an investment holding company, engages in the property investment and development activities in the People's Republic of China. The company develops residential properties; invests in office premises, shopping malls, and commercial complexes; and rents apartments. It also provides property management, renovation, consultancy, land development, investment management, and senior housing services, as well as property sales agency and upfitting services. In addition, the company is involved in the environmental technology businesses. The company was formerly known as Sino-Ocean Land Holdings Limited and changed its name to Sino-Ocean Group Holding Limited in May 2016. Sino-Ocean Group Holding Limited was founded in 1993 and is based in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "3XRA.F": {
        "short_name": "XINYUAN REAL ESTATE ADR 1",
        "long_name": "Xinyuan Real Estate Co., Ltd.",
        "summary": "Xinyuan Real Estate Co., Ltd., together with its subsidiaries, engages in residential real estate development in the People's Republic of China, the United States, and internationally. It develops residential projects, such as multi-layer apartment buildings, sub-high-rise apartment buildings, high-rise apartment buildings; and auxiliary services and amenities, such as retail outlets, leisure and health facilities, kindergartens, and schools, as well as office, mixed-use, and commercial properties. The company also acquires development sites through public auctions of government land and direct negotiations. In addition, it provides property management services for its developments and other real estate-related services. Further, the company offers landscaping engineering and management, real estate consulting and marketing, leasing management, management consulting, and technical services; operates retail stores; and installs intercom systems. Xinyuan Real Estate Co., Ltd. was founded in 1997 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "3XU.F": {
        "short_name": "HUIJING HLDG.CO.LTD HD-01",
        "long_name": "Huijing Holdings Company Limited",
        "summary": "Huijing Holdings Company Limited, an investment holding company, engages in the property development and investment activities primarily in Mainland China. It develops residential properties, such as townhouses, mansions, and villas, as well as commercial properties comprising retail outlets, shopping malls, offices, and hotels; and urban renewal projects. The company was founded in 2004 and is headquartered in Dongguan, the People's Republic of China. Huijing Holdings Company Limited is a subsidiary of Wui Ying Holdings Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Dongguan"
    },
    "47C.F": {
        "short_name": "CHINA AOYUAN GROUP HD-,01",
        "long_name": "China Aoyuan Group Limited",
        "summary": "China Aoyuan Group Limited engages in the development of commercial real estate properties in Mainland China, Hong Kong, Australia, and Canada. The company operates through Property Development, Property Investment, and Others segments. It also acquires and develops various real estate projects; and develops and operates cultural tourism, hotel management, sports development, and healthy resort projects. In addition, the company imports and export goods, such as maternal and child care products, cosmetics and skin care products, clothing and bags, food and beverages, household goods, and parallel imported vehicles. Further, it provides medical service platform combining online and offline services; consultancy services; construction services; and financing services. The company was formerly known as China Aoyuan Property Group Limited and changed its name to China Aoyuan Group Limited in November 2018. China Aoyuan Group Limited was founded in 1996 and is headquartered in Guangzhou, the People's Republic of China. The company is a subsidiary of Ace Rise Profits.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "52J.F": {
        "short_name": "GANGLONG CHINA PR.GR.LTD",
        "long_name": "Ganglong China Property Group Limited",
        "summary": "Ganglong China Property Group Limited engages in the development and sale of residential properties in the People's Republic of China. Its property development projects include retail units, car parks, and ancillary areas. The company was founded in 2007 and is headquartered in Shanghai, China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    },
    "5YQ.F": {
        "short_name": "SUNKWAN P.G.  DL-,000001",
        "long_name": "Sunkwan Properties Group Limited",
        "summary": "Sunkwan Properties Group Limited engages in property development activities in China. The company is based in Shanghai, China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    },
    "600064.SS": {
        "short_name": "NANJING GAOKE COMPANY LIMITED",
        "long_name": "Nanjing Gaoke Company Limited",
        "summary": "Nanjing Gaoke Company Limited engages in real estate development business in China. The company's property portfolio includes ordinary residential properties, high-grade villas, commercial real estate properties, affordable housing properties, and other fields. The company also provides environmental protection project construction; municipal infrastructure construction; engineering design; property management; self-owned housing; and construction and installation services. In addition, the company is involved in industrial investment, venture capital investment, investment management, equity investment, and consulting activities; and provision of financial services. Further, it engages in sewage treatment, water supply, and flood control activities; and research and development, production, and sale of pediatric, cardiovascular and cerebrovascular, anti-infective, digestive system, anti-tumor, and external medicine products. Nanjing Gaoke Company Limited was founded in 1992 and is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Nanjing"
    },
    "600077.SS": {
        "short_name": "SUNDY LAND INVESTMENT CO LTD",
        "long_name": "Sundy Land Investment Co., Ltd.",
        "summary": "Sundy Land Investment Co., Ltd. operates as a real estate development company in China. The company's product line comprises various property types, including apartments, high-end villas, and rough and fine houses. Sundy Land Investment Co., Ltd. was founded in 1984 and is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "600159.SS": {
        "short_name": "BEIJING DALONG WEIYE REAL EST D",
        "long_name": "Beijing Dalong Weiye Real Estate Development Co.,Ltd",
        "summary": "Beijing Dalong Weiye Real Estate Development Co.,Ltd engages in the real estate development activities in China. It is also involved in the building construction, ecological gardening, finance, technology, and cultural media businesses. The company was founded in 1987 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "600162.SS": {
        "short_name": "SHENZHEN HEUNGKONG HOLDING CO. ",
        "long_name": "Shenzhen HeungKong Holding Co.,Ltd",
        "summary": "Shenzhen HeungKong Holding Co.,Ltd engages in the development of commercial real estate properties. It also invests in and operates shops. The company is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "600173.SS": {
        "short_name": "WOLONG REAL ESTATE GROUP CO. LT",
        "long_name": "Wolong Real Estate Group Co.,Ltd.",
        "summary": "Wolong Real Estate Group Co., Ltd. engages in the real estate development business in China. The company was formerly known as Zhejiang Wolong Real Estate Co., Ltd and changed its name to Wolong Real Estate Group Co., Ltd. in January 2008. Wolong Real Estate Group Co., Ltd. was founded in 1994 and is based in Shaoxing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shaoxing"
    },
    "600208.SS": {
        "short_name": "XINHU ZHONGBAO CO. LTD.",
        "long_name": "Xinhu Zhongbao Co.,Ltd.",
        "summary": "Xinhu Zhongbao Co.,Ltd. engages in the real estate, financial service, and financial technology businesses in China. The company develops real estate projects. Xinhu Zhongbao Co.,Ltd. is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "600215.SS": {
        "short_name": "CHANGCHUN JINGKAI (GROUP) CO LT",
        "long_name": "Changchun jingkai Group Co., Ltd",
        "summary": "Changchun jingkai Group Co., Ltd engages in the real estate development and infrastructure construction businesses in China. It is involved in the commercial and residential land development activities. The company was founded in 1993 and is based in Changchun, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Changchun"
    },
    "600223.SS": {
        "short_name": "LUSHANG HEALTH INDUSTRY DEVELOP",
        "long_name": "Lushang Health Industry Development Co.,Ltd.",
        "summary": "Lushang Health Industry Development Co.,Ltd. operates as a real estate development company in China. It develops boutique houses, urban complexes, shopping malls, grade A office buildings, high-star hotels, and other projects. The company was formerly known as Lushang Property Co., Ltd. and changed its name to Lushang Health Industry Development Co.,Ltd. in June 2019. The company is based in Jinan, China. Lushang Health Industry Development Co.,Ltd. is a subsidiary of Shandong Commercial Group Co, Ltd.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Jinan"
    },
    "600225.SS": {
        "short_name": "TIANJIN SONGJIANG CO.  LTD",
        "long_name": "Tianjin Songjiang Co., Ltd.",
        "summary": "Tianjin Songjiang Co., Ltd. develops and sells real estate properties in China. The company is based in Tianjin, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Tianjin"
    },
    "600246.SS": {
        "short_name": "VANTONE NEO DEVELOPMENT GROUP C",
        "long_name": "Beijing Vantone Real Estate Co., Ltd.",
        "summary": "Beijing Vantone Real Estate Co., Ltd., together with its subsidiaries, engages in the development and sale of residential and commercial properties. It operates under the New Homeland Series, International Series, Washway Collection, Public Collection, and Wantong Center brand names primarily in Beijing, Tianjin, Shanghai, and Hangzhou in China. The company was formerly known as Beijing Vantone Pioneer Real Estate Co., Ltd and changed its name to Beijing Vantone Real Estate Co., Ltd. in 2007. Beijing Vantone Real Estate Co., Ltd. was founded in 1998 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "600275.SS": {
        "short_name": "HUBEI WUCHANGYU CO. LTD.",
        "long_name": "Hubei Wuchangyu Co.,Ltd.",
        "summary": "Hubei Wuchangyu Co., Ltd. engages in real estate business in China. The company develops, operates, and distributes commercial properties, as well as provides housings leasing and broking services. It also cultivates fresh water fishes and other aquatic products. The company is based in Ezhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Ezhou"
    },
    "600325.SS": {
        "short_name": "HUAFA INDUSTRIAL CO LTD",
        "long_name": "Huafa Industrial Co.,Ltd.Zhuhai",
        "summary": "Huafa Industrial Co.,Ltd. Zhuhai operates as a real estate company in China. The company develops residential, commercial, tourism, land, and housing properties. It operates under the Hongjing Garden, Huafa New City, Huafa Century City, Huafa Shuijun, and Huasheng State Manor brand names. The company was founded in 1980 and is based in Zhuhai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Zhuhai"
    },
    "600383.SS": {
        "short_name": "GEMDALE CORPORATION",
        "long_name": "Gemdale Corporation",
        "summary": "Gemdale Corporation engages in real estate business in China and internationally. The company engages in development, sale, and operation of residential and commercial properties, such as apartments, boutique residences, office buildings, commercial complexes, industrial parks, hotels, etc. It also engages in real estate financing; sports industry cluster operations, with a focus on tennis; property services and community operations; and provision of decoration products and services for residences. In addition, it offers agent construction services; and operates as K12 private bilingual international school. The company was founded in 1988 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "600393.SS": {
        "short_name": "GUANGZHOU YUETAI GROUP CO LTD",
        "long_name": "Guangzhou Yuetai Group Co., Ltd.",
        "summary": "Guangzhou Yuetai Group Co., Ltd. engages in the real estate development, construction, operation, and management businesses in China and internationally. It primarily operates under the Yuetai brand name. The company was formerly known as Guangzhou Donghua Enterprise Co., Ltd. and changed its name to Guangzhou Yuetai Group Co., Ltd. in May 2016. The company was founded in 1979 and is headquartered in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "600466.SS": {
        "short_name": "SICHUAN LANGUANG DEVELOPMENT CO",
        "long_name": "Sichuan Languang Development Co., Ltd.",
        "summary": "Sichuan Languang Development Co., Ltd. engages in real estate and pharmaceutical manufacturing businesses in China. The company develops and operates residential properties; and commercial properties, including cultural tourism, hotel, and office buildings, as well as offers landscape and decoration services. It also researches and develops stem cell bio-ink technology for 3D bio-printing; and researches and develops, and marketing of pharmaceuticals and medical devices. The company was formerly known as Sichuan Di Kang Technology Pharmaceutical Co., Ltd. and changed its name to Sichuan Languang Development Co., Ltd. in April 2015. Sichuan Languang Development Co., Ltd. was founded in 1993 and is based in Chengdu, the People's Republic of China. Sichuan Languang Development Co., Ltd. is a subsidiary of Blue Light Investment Holdings Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Chengdu"
    },
    "600503.SS": {
        "short_name": "DELUXE FAMILY CO. LTD.",
        "long_name": "Deluxe Family Co., Ltd.",
        "summary": "Deluxe Family Co., Ltd. engages in the development and distribution of real estate properties in Shanghai and other Eastern China markets. The company develops and operates residential communities. It is also involved in the construction of green facilities and decoration engineering; and commercial investment, as well as the provision of investment consulting services. In addition, the company engages in the financial, bio-pharmaceuticals, new energy, environmental protection, and other equity investment operations. Deluxe Family Co., Ltd. was founded in 1994 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "600515.SS": {
        "short_name": "HAINAN HNA INFRASTRUCTURE INVES",
        "long_name": "HNA Infrastructure Investment Group Co., LTD",
        "summary": "HNA Infrastructure Investment Group Co., LTD engages in the development and management of infrastructure, real estate, and urban complex projects. The company develops, constructs, and manages urban complexes and tourism scenic areas. It is also involved in the investment, engineering, construction, operation, and management of airports; construction of offshore projects; operation and management of hotel; and duty-free business. In addition, the company provides EPC general contracting and management; and professional consulting services. HNA Infrastructure Investment Group Co., LTD is based in Haikou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Haikou"
    },
    "600533.SS": {
        "short_name": "NANJING CHIXIA DEVELOPMENT",
        "long_name": "Nanjing Chixia Development Co., Ltd.",
        "summary": "Nanjing Chixia Development Co., Ltd. engages in the development of real estate properties in China. It is also involved in the development and construction of residential and office buildings, public buildings, and commercial housing projects; sale of commercial houses; leasing activities; planning, design, and construction of garden landscapes; and construction management activities. The company also offers after-sales services. The company was founded in 1984 and is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Nanjing"
    },
    "600604.SS": {
        "short_name": "SHANGHAI SHIBEI HI-TECH CO LTD",
        "long_name": "Shanghai Shibei Hi-Tech Co.,Ltd.",
        "summary": "Shanghai Shibei Hi-Tech Co.,Ltd. invests in, develops, rents, and sells real estate properties in China. The company was founded in 1923 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "600615.SS": {
        "short_name": "SHANGHAI FENGHWA GROUP CO. LTD.",
        "long_name": "Shanghai Fenghwa Group Co., Ltd",
        "summary": "Shanghai Fenghwa Group Co., Ltd engages in the property and hotel management business. It also provides house leasing, industrial investment management, etc. services. The company was formerly known as Shanghai Fenghwa Ballpen Co., Ltd. and changed its name to Shanghai Fenghwa Group Co., Ltd in October 2001. The company was founded in 1992 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "600620.SS": {
        "short_name": "SHANGHAI TIANCHEN CO LTD",
        "long_name": "Shanghai Tianchen Co., Ltd",
        "summary": "Shanghai Tianchen Co., Ltd, together with its subsidiaries, provides real estate and transportation logistics services in China. The company develops, constructs, operates, and sells real estate properties, including commercial, residential, and office properties, as well as transforms old areas. It also provides real estate advertising services. The company was formerly known as Shanghai Union Agricultural Co., Ltd. Shanghai Tianchen Co., Ltd was founded in 1992 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "600622.SS": {
        "short_name": "EVERBRIGHT JIABAO CO LTD",
        "long_name": "Everbright JiabaoCo.,Ltd.",
        "summary": "Everbright JiabaoCo.,Ltd. primarily develops real estate properties in China. The company also manages real estate properties, such as commercial, complex, office, residential, and industrial real estate properties. In addition, it provides electric light sources and nuclear power materials for rare metal forgings. Everbright JiabaoCo.,Ltd. is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "600638.SS": {
        "short_name": "SHANGHAI NEW HUANG PU INDUSTRIA",
        "long_name": "Shanghai New Huang Pu Industrial Group Co., Ltd.",
        "summary": "Shanghai New Huang Pu Industrial Group Co., Ltd. engages in the real estate business in China. The company develops commercial buildings and residential communities. It is also involved in the financial investment and futures, park construction and management, professional electronics market operations, property management, real estate services and consulting, service trade, etc. businesses. The company was formerly known as Shanghai New Huang Pu Real Estate Co.,Ltd. Shanghai New Huang Pu Industrial Group Co., Ltd. was founded in 1992 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "600639.SS": {
        "short_name": "SHANGHAI JINQIAO EXP PROCESS ZN",
        "long_name": "Shanghai Jinqiao Export Processing Zone Development Co., Ltd.",
        "summary": "Shanghai Jinqiao Export Processing Zone Development Co., Ltd. develops, invests in, and operates real estate properties in China. Its property portfolio comprises office and factory buildings, villas, and service apartments. The company was founded in 1992 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "600641.SS": {
        "short_name": "SHANGHAI WANYE ENTERPRISES CO L",
        "long_name": "Shanghai Wanye Enterprises Co.,Ltd",
        "summary": "Shanghai Wanye Enterprises Co.,Ltd engages in the residential real estate development business. The company was founded in 1991 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "600647.SS": {
        "short_name": "SHANGHAI TONGDA VENTURE CAPITAL",
        "long_name": "Shanghai Tongda Venture Capital Co., Ltd.",
        "summary": "Shanghai Tongda Venture Capital Co., Ltd. engages in the real estate development business in China. It is also involved in equity investment, capital market operation, asset trading, financial non-performing asset disposal, industrial investment, asset management, and agriculture business. In addition, the company offers various financial services, such as securities, futures, funds, insurance, and trust. The company was formerly known as Shanghai New Asia Fast Food Co., Ltd. The company was founded in 1991 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "600657.SS": {
        "short_name": "CINDA REAL ESTATE CO LTD",
        "long_name": "Cinda Real Estate Co., Ltd.",
        "summary": "Cinda Real Estate Co., Ltd. operates as a real estate development company in China. The company provides commercial property management; property services; and real estate professional services. Cinda Real Estate Co., Ltd. is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "600663.SS": {
        "short_name": "SHANGHAI LUJIAZUI FIN & TRADE Z",
        "long_name": "Shanghai Lujiazui Finance & Trade Zone Development Co., Ltd.",
        "summary": "Shanghai Lujiazui Finance & Trade Zone Development Co., Ltd. operates as a real estate company. The company develops, operates, sells, and leases real estate properties. Its property portfolio include office, research and development, residential, business, exhibition center, hotels, regional development, and charitable projects. The company was founded in 1992 and is based in Shanghai, China. Shanghai Lujiazui Finance & Trade Zone Development Co., Ltd. is a subsidiary of Shanghai Lujiazui Development (Group) Company Limited.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "600665.SS": {
        "short_name": "TANDE CO. LTD.",
        "long_name": "Tande Co., Ltd.",
        "summary": "Tande Co., Ltd. operates as a real estate development company in China. It also provides property management and real estate agency services. The company is based in Xi'an, China. Tande Co., Ltd. is a subsidiary of Xi'an Gaoke (Group) Corporation.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Xi'an"
    },
    "600684.SS": {
        "short_name": "GUANGZHOU PEARL RIVER INDUSTRIA",
        "long_name": "Guangzhou Pearl River Industrial Development Co., Ltd.",
        "summary": "Guangzhou Pearl River Industrial Development Co., Ltd. operates as a real estate development company in China. It engages in property investment, property management, and other businesses. The company develops, sells, and leases commercial and residential properties; develops office building, hotel, tourism, health, and other commercial real estate properties; and provides related after-sale services for office and supporting facilities. It also engages in the hotel management, wholesale and retail trading, parking lot management, venue rental, swimming pool and fitness room operation, and tourism businesses. The company was formerly known as Guangzhou Pearl River Real Estate Co. Guangzhou Pearl River Industrial Development Co., Ltd. was founded in 1985 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "600724.SS": {
        "short_name": "NINGBO FUDA CO LTD",
        "long_name": "Ningbo Fuda Company Limited",
        "summary": "Ningbo Fuda Company Limited engages in the real estate development business in China. It develops residential properties; and invests in, develops, operates, and manages commercial real estate projects, as well as offers cement building materials. The company was founded in 1989 and is based in Yuyao, China. Ningbo Fuda Company Limited is a subsidiary of Ningbo Urban Construction Investment Holding Co.,Ltd.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Yuyao"
    },
    "600743.SS": {
        "short_name": "HUAYUAN PROPERTY CO LTD",
        "long_name": "Huayuan Property Co.,Ltd.",
        "summary": "Hua Yuan Property Co.,Ltd. engages in the development, operation, and management of real estate properties. The company is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "600766.SS": {
        "short_name": "YANTAI YUANCHENG GOLD CO LTD",
        "long_name": "YanTai Yuancheng Gold Co., Ltd.",
        "summary": "YanTai Yuancheng Gold Co., Ltd. primarily engages in real estate development and property management activities in China. The company specializes on the reconstruction of old town; and development of residential communities in the urban district in Yantai in Shandong province. It also engages in the wholesale and retail of commodities. The company was formerly known as YanTai Yuancheng Enterprise Group Co., Ltd. YanTai Yuancheng Gold Co., Ltd. is based in Yantai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Yantai"
    },
    "600773.SS": {
        "short_name": "TIBET URBAN DEVELOPMENT AND INV",
        "long_name": "Tibet Urban Development and Investment Co.,LTD",
        "summary": "Tibet Urban Development and Investment Co.,LTD, together with its subsidiaries, develops, operates, manages, and sells real estate properties in China. The company engages in the renovation of old areas, commercial housing, villas, and office buildings, as well as housing development and leasing activities. It also offers property management services; real estate agency services; and secured loans, mortgage loans, credit loans, financing consultancy services, etc. In addition, the company operates and manages a hotel, Holiday Inn Express Shanghai North, and shopping parks; develops, constructs, and operates beach reclamation projects. Further, it develops and produces lithium carbonate, carbon nanotubes, potassium chloride, boron, and non-ferrous metal minerals; and engages in mining activities. Tibet Urban Development and Investment Co.,LTD was founded in 1996 and is headquartered in Lhasa, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Lhasa"
    },
    "600791.SS": {
        "short_name": "BEIH-PROPERTY CO LTD",
        "long_name": "BEH-Property Co., Ltd",
        "summary": "BEH-Property Co., Ltd operates as a real estate development company in China. The company undertakes residential, and other construction and development projects. BEH-Property Co., Ltd is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "600807.SS": {
        "short_name": "JINAN HIGH-TECH DEVELOPMENT CO ",
        "long_name": "Jinan High-tech Development Co., Ltd.",
        "summary": "Jinan High-tech Development Co., Ltd., together with its subsidiaries, engages in real estate, mining, finance, venture capital, and other businesses in China. The company is involved in the development of residential, commercial, tourism, and education real estate properties. It also engages in prospecting, mining, and processing of a gold source tenement with a span of approximately 120 kilometers. In addition, the company is involved in finance activities; and venture capital business, including investment in primary market, equity, secondary market, and debt and non-performing asset disposition activities. Jinan High-tech Development Co., Ltd. is based in Jinan, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Jinan"
    },
    "600823.SS": {
        "short_name": "SHANGHAI SHIMAO CO LTD",
        "long_name": "Shanghai Shimao Co., Ltd.",
        "summary": "Shanghai Shimao Co., Ltd. engages in the commercial real estate development activities in China. It develops, operates, and sells residential and commercial real estate projects, as well as engages in the operation management of commercial complexes. The company was founded in 1994 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "600848.SS": {
        "short_name": "SHANGHAI LINGANG HOLDINGS CORPO",
        "long_name": "Shanghai Lingang Holdings Co.,Ltd.",
        "summary": "Shanghai Lingang Holdings Co.,Ltd. develops, rents, and sells industrial carriers in China. The company's industrial carriers portfolio include technology research and development buildings, headquarters business buildings, bonded logistics warehouses, etc. It is also involved in the park operations and industrial investment activities. The company was formerly known as Shanghai Automation Instrumentation Co., Ltd. and changed its name to Shanghai Lingang Holdings Co.,Ltd in November 2015. Shanghai Lingang Holdings Co.,Ltd. was founded in 1994 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "600872.SS": {
        "short_name": "JONJEE HI-TECH INDUSTRIAL & COM",
        "long_name": "Jonjee Hi-tech Industrial & Commercial Holding Co., Ltd.",
        "summary": "Jonjee Hi-tech Industrial & Commercial Holding Co., Ltd. produces and sells seasoning products in China and internationally. Its products include soy sauce, chicken distillate, oyster sauce, preserved bean curd, vinegar, and other seasoning products. The company also provides facilities and services, such as land, factory buildings, and staff dormitories with public facilities; inspection services for construction and safety control; registration for establishing enterprises; real estate management services in the parks; and public environment administration services, etc. In addition, it is involved in the manufacture and sale of precision forging parts of automobiles and motor eyelets; precision forging parts of automobile and motor eyelets; temperature pipe valves; and other machined products, as well as rental and sale of real estate properties. Further, the company produces batteries in various kinds, including rechargeable batteries and battery packs, which are be applied in power tools, R/C toys, emergency lighting, electrical home appliance, portable computers, and cellular and cordless phones. The company was formerly known as Zhongshan Torch Hi-tech Industrial & Commercial Co., Ltd. and changed its name to Jonjee Hi-tech Industrial & Commercial Holding Co., Ltd. in February 2001. Jonjee Hi-tech Industrial & Commercial Holding Co., Ltd. was founded in 1993 and is based in Zhongshan, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Zhongshan"
    },
    "601155.SS": {
        "short_name": "SEAZEN HOLDINGS CO LTD",
        "long_name": "Seazen Holdings Co., Ltd",
        "summary": "Seazen Holdings Co., Ltd engages in real estate development business in China. The company is involved in the development of urban complex projects and residential properties. It also provides business and commercial management services. The company was formerly known as Future Land Holdings Co., Ltd. The company was founded in 1993 and is headquartered in Shanghai, the People's Republic of China. Seazen Holdings Co., Ltd. is a subsidiary of Fuyu Development Co., Ltd.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "601828.SS": {
        "short_name": "RED STAR MACALLINE GROUP CORP L",
        "long_name": "Red Star Macalline Group Corporation Ltd.",
        "summary": "Red Star Macalline Group Corporation Ltd. operates and manages home improvement and furnishings shopping malls. The company operates its shopping malls under the Red Star Macalline brand name. As of December 31, 2020, it operated 92 Portfolio shopping malls and 273 managed shopping malls; 11 home furnishing shopping malls through strategic cooperation; and 476 home improvement material stores/industry streets. The company also engages in the leasing of floor areas to the tenants; retail sale of home furnishing merchandise, as well as provision of related decorating services; and sale of pre-paid cards. In addition, it offers Internet home decoration, Internet retail, and logistics and delivery services; joint marketing; and shopping mall design, construction, consultation, and home design and decoration services, as well as construction site coordination and supervision services. Further, the company provides site leasing management, warehouse logistics, asset and investment management, exhibition, financing, equipment leasing, and enterprise management services. The company was formerly known as Shanghai Red Star Macalline Home Living and Decorating Company Limited and changed its name to Red Star Macalline Group Corporation Ltd. in 2011. The company was founded in 2007 and is headquartered in Shanghai, the People's Republic of China. Red Star Macalline Group Corporation Ltd. is a subsidiary of Red Star Macalline Holding Group Company Limited.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "603506.SS": {
        "short_name": "NACITY PROPERTY SERVICE GROUP C",
        "long_name": "Nacity Property Service Group Co., Ltd.",
        "summary": "Nacity Property Service Group Co., Ltd. provides real estate property management services in China. It offers case, consultancy, and value-added services for residential properties, commercial complexes, office buildings, industrial parks, schools, banks, and public construction projects, and various other properties. The company was formerly known as Nacity Property Service Co., Ltd. The company was founded in 1993 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "6093.HK": {
        "short_name": "HEVOL SERVICES",
        "long_name": "Hevol Services Group Co. Limited",
        "summary": "Hevol Services Group Co. Limited, an investment holding company, provides property management and value-added services in the People's Republic of China. The company provides security, cleaning, greening, gardening, and repair and maintenance services to property owners and residents, as well as property developers. It also offers community value-added services comprises home-living services, including property repair and maintenance, cleaning, interior decoration, collection of electricity tariffs, purchase assistance, and accommodation and catering services to property owners; leasing of common areas, such as swimming pools, car parking spaces, and advertising spaces to third party contractors; and organizing of community cultural activities, which include community sports events, community carnivals, elderly care, and community festival celebrations for residents. In addition, the company provides value-added services, including sales assistance services and management consultation services for the property development projects developed by property developers. The company was incorporated in 2018 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "6111.HK": {
        "short_name": "DAFA PPT",
        "long_name": "DaFa Properties Group Limited",
        "summary": "DaFa Properties Group Limited, an investment holding company, operates as a real estate developer in the Yangtze River Delta Region in the People's Republic of China. The company is involved in the development and sale of residential properties; development, operation, and management of commercial and mixed-use properties; and provision of management consulting services. As of December 31, 2019, it had a portfolio of 69 projects consisting of 63 residential properties, two residential and commercial complexes, two commercial complexes, one office floor, and one residential and service apartment. DaFa Properties Group Limited was founded in 1996 and is headquartered in Shanghai, China. DaFa Properties Group Limited is a subsidiary of Splendid Sun Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "6166.HK": {
        "short_name": "CHINA VAST",
        "long_name": "China VAST Industrial Urban Development Company Limited",
        "summary": "China VAST Industrial Urban Development Company Limited, an investment holding company, plans, develops, and operates large-scale industrial town projects in the People's Republic of China. It operates through Industrial Towns Development, Property Development, and Property Leasing segments. The company develops residential, commercial, and industrial projects, including residence, apartment, villa, retail stores, and office buildings. It is also involved in the property leasing, infrastructure and project investment, consulting, asset management, and land infrastructure maintenance activities, as well as offers Internet information technology services. The company was founded in 1995 and is headquartered in Beijing, the People's Republic of China. China VAST Industrial Urban Development Company Limited is a subsidiary of Profit East Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "6666.HK": {
        "short_name": "EVERG SERVICES",
        "long_name": "Evergrande Property Services Group Limited",
        "summary": "Evergrande Property Services Group Limited provides property management services in the People's Republic of China. The company manages a portfolio of properties, including mid- to high-end residential properties, offices buildings, commercial properties, theme and industrial parks, healthcare complexes, themed towns, schools, and others. It offers property management services, including butler, security, cleaning and greening, and repair and maintenance services to property owners, residents, and property developers, as well as tenants in non-residential properties. The company also provides value-added services, such as preliminary property management services comprising construction site management; sales office management services comprising management of property developers' sales offices and show flats; property consulting services; pre-delivery services consisting; properties repair and maintenance services; and property transaction assistance services to non-property owners. In addition, it offers community value-added services primarily to property owners and residents that include community operations services, such as community space management services; other services, including group purchase facilitations, electric vehicle charging stations, and potable water stations; community asset management services comprising parking space rental services; second-hand property transaction assistance services; recreation center operations services; and community living services, such as housekeeping, home furnishing, and repair and maintenance. The company was founded in 1997 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "6668.HK": {
        "short_name": "E-STAR CM",
        "long_name": "E-Star Commercial Management Company Limited",
        "summary": "E-Star Commercial Management Company Limited, an investment holding company, provides commercial operational services to owners or tenants in respect of commercial properties in the People's Republic of China. It operates through three segments: Entrusted Management Service Model; Brand and Management Output Service Model; and Sublease Service Model. The company offers positioning, construction consultancy, and tenant sourcing services, which primarily include market positioning, business planning consultancy, design and construction consultancy, and tenant sourcing; and operational management services principally comprising formulating operation strategies, conducting marketing and promotional events, tenant and property management, and rent collection. It also provides property leasing services, such as sublease of commercial spaces in the commercial properties managed under the sublease service model to tenants; and value-added services primarily consisting of management of common areas in the shopping centers, which customers could rent for a short period for pop-up shops and promotional settings, and management of advertising spaces, such as LED boards and interior and exterior facades of the shopping centers. The company offers commercial operational services under the brands of COCO Park, COCO City, COCO Garden, iCO, and Top Living. It serves shopping centers, commercial complexes, luxury home furnishing shopping centers, and office buildings, as well as leases commercial spaces to tenants. The company was founded in 2004 and is headquartered in Shenzhen, China. E-Star Commercial Management Company Limited is a subsidiary of Go Star Investment Holding Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "6677.HK": {
        "short_name": "SINO-OCEAN SERV",
        "long_name": "Sino-Ocean Service Holding Limited",
        "summary": "Sino-Ocean Service Holding Limited, an investment holding company, primarily offers property management services in the People's Republic of China. The company's property management services comprising security, cleaning, greening, gardening, and repair and maintenance services to property owners and residents, as well as property developers. Its property management portfolio covers residential and nonresidential properties, such as commercial properties comprising office buildings, shopping malls, and hotels; and public and other properties consisting of hospitals, public service facilities, government buildings, and schools. The company's value-added services, such as pre-delivery services to property developers to assist with their sales and marketing activities at property sales venues and display units; consultancy services to assist with the overall planning and management of pre-sale activities; and property engineering services. Its community value-added services include carpark management, utility management, and community space operation services; community living services, such as home decoration, purchase assistance, turnkey furnishing and move-in, housekeeping, and other bespoken services; and property brokerage services to property owners and residents of its managed properties. Sino-Ocean Service Holding Limited also offers information technology services. The company was founded in 1997 and is headquartered in Beijing, China. Sino-Ocean Service Holding Limited is a subsidiary of Shine Wind Development Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "6900.HK": {
        "short_name": "SUNKWAN PPT",
        "long_name": "Sunkwan Properties Group Limited",
        "summary": "Sunkwan Properties Group Limited engages in property development activities in China. The company is based in Shanghai, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "6968.HK": {
        "short_name": "GANGLONG CHINA",
        "long_name": "Ganglong China Property Group Limited",
        "summary": "Ganglong China Property Group Limited engages in the development and sale of residential properties in the People's Republic of China. Its property development projects include retail units, car parks, and ancillary areas. The company was founded in 2007 and is headquartered in Shanghai, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "6989.HK": {
        "short_name": "EXCELLENCE CM",
        "long_name": "Excellence Commercial Property & Facilities Management Group Limited",
        "summary": "Excellence Commercial Property & Facilities Management Group Limited provides commercial property management services in China. It operates through three segments: Property Management Services, Finance Services, and Other Services. The Property Management Services segment offers property management services to property developers, property owners, and tenants, as well as value-added services to such customers, including asset services, which comprise preliminary property consulting, second-hand property leasing and sales agency, asset-light property and space operation, and corporate services. It serves commercial properties, including office buildings and commercial complexes; corporate buildings, and office and R&D parks; public and industrial properties comprising government properties, educational properties, medical properties, storage and logistics centers, and industrial parks; and residential properties, such as residential communities and apartments. The Finance Services segment principally provides micro-lending services to small and medium enterprises, individual business proprietors, and individuals. The Other Services segment offers software development and apartment rental services. The company also provides corporate and specialized value-added, as well as technical maintenance services. Excellence Commercial Property & Facilities Management Group Limited was founded in 1999 and is headquartered in Shenzhen, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "6999.HK": {
        "short_name": "LEADING HLDGS",
        "long_name": "Leading Holdings Group Limited",
        "summary": "Leading Holdings Group Limited engages in the property development business in China. It operates through Property Development, Commercial Property Investment and Operation, and Hotel Operations segments. The company engages in the development and sale of residential properties for home upgraders; and commercial properties, including office buildings, shopping blocks, commercial complexes, and apartments. It also holds various commercial properties for further investment purpose; engages in hotel management business; and provides project management services. The company was formerly known as Leading China Holdings Limited. Leading Holdings Group Limited was founded in 1999 and is headquartered in Chengdu, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Chengdu"
    },
    "6CI.F": {
        "short_name": "CIFI HLDGS GRP CO.HD -,10",
        "long_name": "CIFI Holdings (Group) Co. Ltd.",
        "summary": "CIFI Holdings (Group) Co. Ltd., an investment holding company, invests in, develops, and manages properties in the People's Republic of China. The company operates through Sales of Properties; Property Investment; and Project Management and Other Property Related Services segments. It develops and sells office and commercial premises, and residential properties; leases investment properties; and offers project management and other property related services. The company also provides property construction, agency, and information consulting services; and consultancy, investment management and consultation, and business management services. As of December 31, 2019, it had a land bank with total and attributable gross floor area of approximately 50.7 million square meters and 26.5 million square meters. CIFI Holdings (Group) Co. Ltd. was founded in 2000 and is headquartered in Shanghai, China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    },
    "6FLA.F": {
        "short_name": "SEAZEN GROUP LTD. HD-,001",
        "long_name": "Seazen Group Limited",
        "summary": "Seazen Group Limited, together with its subsidiaries, engages in the investment, development, and sale of properties in the People's Republic of China. The company operates through two segments, A Share Company and Non-A Share Companies. It primarily develops and sells residential properties and mixed-use complexes, as well as provides commercial property management and other services. As of December 31, 2019, the company had total land bank of approximately 124 million square meters. It also provides construction design and consulting, asset operation and management, marketing research, consulting, department store management, apartment leasing, property and cost consulting, office space rental, information technology, and children entertainment, as well as hotel, and conference, and cinema management services. In addition, the company offers securities and future brokerage, book running, placing management, and money lending services, as well as dealing and advising services of securities. Further, it provides architecture designing and care services; and is involved in the maintenance and leasing energy equipment, as well as designs, manufactures, and sells auto parts. The company was formerly known as Future Land Development Holdings Limited and changed its name to Seazen Group Limited in November 2019. The company was founded in 1996 and is headquartered in Shanghai, the People's Republic of China. Seazen Group Limited is a subsidiary of Wealth Zone Hong Kong Investments Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    },
    "8030.HK": {
        "short_name": "FLYING FIN",
        "long_name": "Flying Financial Service Holdings Limited",
        "summary": "Flying Financial Service Holdings Limited, an investment holding company, engages in the provision of financial services to property developers and real estate development activities in the People's Republic of China. It operates through four segments: Investment in Property Development Projects; Operation of Financial Services Platform; Provision of Entrusted Loan, Pawn Loan, Other Loan Services, and Financial Consultation Services; and Finance Lease Services. The company offers short-term and long-term financial consultation services; and entrusted, pawn, and other loans to borrowers and financial institutions. It also provides long-term finance lease; investment income services; and operates a financial services platform. The company was founded in 2001 and is headquartered in Shenzhen, China. Flying Financial Service Holdings Limited is a subsidiary of Ming Cheng Investments Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "8KI.F": {
        "short_name": "REDCO PRP GROUP LTD -,05",
        "long_name": "Redco Properties Group Limited",
        "summary": "Redco Properties Group Limited, an investment holding company, engages in the property development and investment activities in the People's Republic of China. The company operates through Greater Western Taiwan Straits Economic Zone; Central and Western Regions; Bohai Economic Rim; Greater Bay Area Pearl; River Delta Region; and Others segments. It develops residential and commercial properties. The company is also involved in the provision of construction design and cost consulting, construction and sea reclamation, project management, and healthcare services. In addition, it trades in construction materials and provides property management services. Redco Properties Group Limited was founded in 1992 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "900902.SS": {
        "short_name": "SHANGHAI SHIBEI HI-TECH CO LTD",
        "long_name": "Shanghai Shibei Hi-Tech Co.,Ltd.",
        "summary": "Shanghai Shibei Hi-Tech Co.,Ltd. invests in, develops, rents, and sells real estate properties in China. The company was founded in 1923 and is based in Shanghai, China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "900911.SS": {
        "short_name": "SHANGHAI JINQIAO EXP PROCESS ZN",
        "long_name": "Shanghai Jinqiao Export Processing Zone Development Co., Ltd.",
        "summary": "Shanghai Jinqiao Export Processing Zone Development Co., Ltd. develops, invests in, and operates real estate properties in China. Its property portfolio comprises office and factory buildings, villas, and service apartments. The company was founded in 1992 and is based in Shanghai, China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "900928.SS": {
        "short_name": "SHANGHAI LINGANG HOLDINGS CORPO",
        "long_name": "Shanghai Lingang Holdings Co.,Ltd.",
        "summary": "Shanghai Lingang Holdings Co.,Ltd. develops, rents, and sells industrial carriers in China. The company's industrial carriers portfolio include technology research and development buildings, headquarters business buildings, bonded logistics warehouses, etc. It is also involved in the park operations and industrial investment activities. The company was formerly known as Shanghai Automation Instrumentation Co., Ltd. and changed its name to Shanghai Lingang Holdings Co.,Ltd in November 2015. Shanghai Lingang Holdings Co.,Ltd. was founded in 1994 and is based in Shanghai, China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "900932.SS": {
        "short_name": "SHANGHAI LUJIAZUI FIN & TRADE Z",
        "long_name": "Shanghai Lujiazui Finance & Trade Zone Development Co., Ltd.",
        "summary": "Shanghai Lujiazui Finance & Trade Zone Development Co., Ltd. operates as a real estate company. The company develops, operates, sells, and leases real estate properties. Its property portfolio include office, research and development, residential, business, exhibition center, hotels, regional development, and charitable projects. The company was founded in 1992 and is based in Shanghai, China. Shanghai Lujiazui Finance & Trade Zone Development Co., Ltd. is a subsidiary of Shanghai Lujiazui Development (Group) Company Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "9608.HK": {
        "short_name": "SUNDY SERVICE",
        "long_name": "Sundy Service Group Co. Ltd",
        "summary": "Sundy Service Group Co. Ltd operates as an integrated property management service provider in the property management industry in Zhejiang province, the People's Republic of China. The company provides property management services to 33 properties, including 16 residential properties and 17 non-residential properties. It offers property management services, including security, cleaning, gardening, repair, and maintenance of common areas and common facilities and ancillary services; value-added services to non-property owners, primarily property developers, including consulting services, sales assistance services, and pre-delivery services; and community value-added services to property owners and residents, including property repair and maintenance, waste cleaning, utility fee collection, remodeling, and decoration and community space services, as well as engages in hotel and long-term rental apartment businesses. The company was formerly known as SUNDY HUIDU LIMITED and changed its name to Sundy Service Group Co. Ltd in September 2017. Sundy Service Group Co. Ltd was founded in 1995 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "9666.HK": {
        "short_name": "JINKE SERVICES",
        "long_name": "Jinke Smart Services Group Co., Ltd.",
        "summary": "Jinke Smart Services Group Co., Ltd. provides property management services to property developers and property owners in China. It offers cleaning, security, greening, repair and maintenance, public area maintenance, and other property management-related services; consultancy services for property developers and property management companies; and smart living technology solutions comprising smart design, smart on-site, and smart integrated operation platform services. The company provides its services to residential and non-residential properties, including mid-to high-end residential properties, commercial and office buildings, industrial parks, educational institutions, and hospitals. The company was formerly known as Jinke Property Service Group Co., Ltd. The company was founded in 2000 and is headquartered in Chongqing, China. Jinke Smart Services Group Co., Ltd. is a subsidiary of Jinke Property Group Co., Ltd.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Chongqing"
    },
    "9916.HK": {
        "short_name": "XINGYE WULIAN",
        "long_name": "Xingye Wulian Service Group Co. Ltd.",
        "summary": "Xingye Wulian Service Group Co. Ltd., an investment holding company, engages in the property management and value-added, property engineering, and ancillary food supply services in Mainland China. The company's property management services include security, cleaning, greening and gardening, parking space management, repair and maintenance, and customer services; and value-added services consisting of repair and maintenance, renovation waste clearance, intermediary leasing services, etc. for office buildings, governmental buildings, and industrial parks, etc. Its property engineering services comprises planning, designing, and installation of security and surveillance, access control, carpark management, and construction site management systems. The company was founded in 1999 and is headquartered in Zhengzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Zhengzhou"
    },
    "9928.HK": {
        "short_name": "TIMES NEIGHBOR",
        "long_name": "Times Neighborhood Holdings Limited",
        "summary": "Times Neighborhood Holdings Limited provides property management and other relevant services primarily to property developers, property owners and residents, and governmental authorities in the People's Republic of China. The company offers property management services for residential properties non-residential properties. The company also provides community value-added services for owners and tenants, including public space leasing and parking space management, and life services for daily needs, including characteristic butler service, community shopping, community announcement, bill payment service, home appliances maintenance and repair, and community event organization service. In addition, it offers elevator services, including sale, installation, repair, and maintenance; intelligent engineering services, including intelligent community supporting services, as well as build intelligent communities with facilities. It manages a portfolio of residential properties; and non-residential properties, such as commercial properties and office buildings, government buildings, industry parks, public facilities, hospitals, airports, schools, and municipal sanitation. The company was founded in 1998 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "9968.HK": {
        "short_name": "HUIJING HLDGS",
        "long_name": "Huijing Holdings Company Limited",
        "summary": "Huijing Holdings Company Limited, an investment holding company, engages in the property development and investment activities primarily in Mainland China. It develops residential properties, such as townhouses, mansions, and villas, as well as commercial properties comprising retail outlets, shopping malls, offices, and hotels; and urban renewal projects. The company was founded in 2004 and is headquartered in Dongguan, the People's Republic of China. Huijing Holdings Company Limited is a subsidiary of Wui Ying Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Dongguan"
    },
    "9978.HK": {
        "short_name": "FINELANDSERVICE",
        "long_name": "Fineland Real Estate Services Group Limited",
        "summary": "Fineland Real Estate Services Group Limited, through its subsidiaries, provides real estate agency services, property research and consultancy, and integrated services in the People's Republic of China. Its property research and consultancy services include macroeconomic analysis of the market, analysis on investment return, market environment analysis, studies on project conditions, development and positioning, formulating planning and development strategies of the project, recommendations on construction and mix of properties, and recommendations on sales and marketing strategies. The company's real estate agency services comprise marketing research and analysis, target customers analysis, the assessment of market entrance, the strategy of advertising, media, promotion and pricing settling, and the management of selling and after-sales services for the primary market. It also provides secondary market real estate agency services to owners looking to sell or lease their properties, and to potential buyers or tenants looking to buy or rent properties. In addition, the company offers a range of value-added services to customers, including property developers, individual customers, and companies, which include Zhaoshangyi that assists property developers with primary market development projects that have commercial units identify and approach prospective lessees; and operates One-stop Service Centre that provides value-added services, such as rent collection, property repair and maintenance, and design and furnishing services, as well as assists purchasers to obtain ownership certificates and apply for mortgages from banks. The company was incorporated in 2017 and is headquartered in Guangzhou, the People's Republic of China. Fineland Real Estate Services Group Limited is a subsidiary of Mansion Green Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "9983.HK": {
        "short_name": "CC NEW LIFE",
        "long_name": "Central China New Life Limited",
        "summary": "Central China New Life Limited, an investment holding company, provides property management services in central China. It operates through three segments: Property Management and Value-Added Services, Lifestyle Services, and Commercial Property Management and Consultation Services. The company manages a portfolio of properties, including residential properties, shopping malls, cultural tourism complexes, commercial apartments, office buildings, schools, and properties of governmental agencies. It also offers consultancy services to property developers, community value-added services, intelligent community services, personalized services to VIPs of the Central China Consumer Club, and real estate marketing services. In addition, the company operates Jianye + platform, an online to offline one-stop service platform that provides customers with goods and services; and offers travel services, as well as management services in Cuisine Henan Foodcourts. Further, it engages in the provision of hotel management and operation services; and management services for agricultural and cultural tourism projects, as well as in the commercial real-estate operations. Additionally, the company provides consultation, engineering installation, and software development of intelligent technology solutions; and property agency services for secondary properties. The company was founded in 1994 and is headquartered in Zhengzhou, China. Central China New Life Limited is a subsidiary of Enjoy Start Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Zhengzhou"
    },
    "9993.HK": {
        "short_name": "RADIANCE HLDGS",
        "long_name": "Radiance Holdings (Group) Co. Limited",
        "summary": "Radiance Holdings (Group) Co. Limited operates as a real estate development company in China. The company develops and sells residential and commercial properties. It also engages in leasing commercial properties; and provision of management consulting services. As of July 31, 2020, the company had a gross floor area of 25,630,941 square meters of residential properties; and 3,450,816 square meters of non-residential properties. Radiance Holdings (Group) Co. Limited was founded in 1996 and is headquartered in Beijing, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "AGPYF": {
        "short_name": "AGILE GROUP HOLDING LTD",
        "long_name": "Agile Group Holdings Limited",
        "summary": "Agile Group Holdings Limited, an investment holding company, engages in the property development, property management, hotel operation, property investment, environmental protection, and other businesses in the People's Republic of China. As of December 31, 2019, the company had a land bank with a total gross floor area of 39.70 million square meters in 75 cities located in Southern China region, Eastern China region, Western China region, Central China region, Hainan and Yunnan region, Northeast China region, Northern China region, Hong Kong, and internationally. It also provides property management services covering 80 cities in 28 provinces and municipalities, including a gross floor area of 233.99 million square meters; asset management services; and tourism management, advertising, building inspection, and management consulting services. In addition, the company is involved in the operation of hotels, shopping malls, office buildings, and community retail malls. Further, it provides hazardous waste treatment, water treatment, and solid waste treatment services; green ecological landscape, home decoration, design consulting, engineering construction, and materials trading services; and real estate construction management services. The company was formerly known as Agile Property Holdings Limited and changed its name to Agile Group Holdings Limited in July 2016. The company was founded in 1985 and is headquartered in Guangzhou, the People's Republic of China. Agile Group Holdings Limited is a subsidiary of Top Coast Investment Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "AGPYY": {
        "short_name": "AGILE GROUP HOLDING LTD",
        "long_name": "Agile Group Holdings Limited",
        "summary": "Agile Group Holdings Limited, an investment holding company, engages in the property development, property management, hotel operation, property investment, environmental protection, and other businesses in the People's Republic of China. As of December 31, 2019, the company had a land bank with a total gross floor area of 39.70 million square meters in 75 cities located in Southern China region, Eastern China region, Western China region, Central China region, Hainan and Yunnan region, Northeast China region, Northern China region, Hong Kong, and internationally. It also provides property management services covering 80 cities in 28 provinces and municipalities, including a gross floor area of 233.99 million square meters; asset management services; and tourism management, advertising, building inspection, and management consulting services. In addition, the company is involved in the operation of hotels, shopping malls, office buildings, and community retail malls. Further, it provides hazardous waste treatment, water treatment, and solid waste treatment services; green ecological landscape, home decoration, design consulting, engineering construction, and materials trading services; and real estate construction management services. The company was formerly known as Agile Property Holdings Limited and changed its name to Agile Group Holdings Limited in July 2016. The company was founded in 1985 and is headquartered in Guangzhou, the People's Republic of China. Agile Group Holdings Limited is a subsidiary of Top Coast Investment Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "BEIJF": {
        "short_name": "BEIJING NORTH STAR CO",
        "long_name": "Beijing North Star Company Limited",
        "summary": "Beijing North Star Company Limited engages in the development and investment of properties and hotels in the People's Republic of China. It is involved in the property leasing, land and property development, property investment and management, and provision of food and beverage and trading services, as well as develops and sells residential units, apartments, villas, and offices. The company also operates hotels, apartments, office buildings, restaurants, conference centers, and convention and exhibition centers. In addition, it provides multimedia information network development, system integration, software development, and investment management services; and hotel and restaurant management consulting services. Beijing North Star Company Limited was founded in 1997 and is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "BEJ.F": {
        "short_name": "BEIJING CAP. LAND H  YC1",
        "long_name": "Beijing Capital Land Ltd.",
        "summary": "Beijing Capital Land Ltd., together with its subsidiaries, engages in the real estate development and investment activities in the People's Republic of China. It develops residences and office buildings, as well as land; and operates commercial real estate properties. The company also provides property consulting, management, and leasing. As of December 31, 2019, it had 16.61 million square meters of land bank and 12.42 million square meters of total ground area. The company was founded in 2002 and is headquartered in Beijing, the People's Republic of China. Beijing Capital Land Ltd. is a subsidiary of Beijing Capital Group Co., Ltd.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "BEKE": {
        "short_name": "KE Holdings Inc",
        "long_name": "KE Holdings Inc.",
        "summary": "KE Holdings Inc. operates an integrated online and offline platform for housing transactions and services in the People's Republic of China. The company facilitates various housing transactions ranging from existing and new home sales and home rentals to home renovation, real estate financial solutions, and other services. It also owns and operates Lianjia, a real estate brokerage branded store. The company was founded in 2001 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "BTF.SI": {
        "short_name": "Debao Property^",
        "long_name": "Debao Property Development Ltd.",
        "summary": "Debao Property Development Ltd., an investment holding company, operates as an integrated property developer in the People's Republic of China. The company operates through four segments: Property Development, Construction Contract, Property Investment, and Property Management. It develops residential and commercial properties. The company also provides property investment and management services. In addition, it is involved in the construction activities. The company was founded in 2000 and is based in Foshan, the People's Republic of China.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "city": "Foshan"
    },
    "CHVKF": {
        "short_name": "CHINA VANKE CO. LTD",
        "long_name": "China Vanke Co., Ltd.",
        "summary": "China Vanke Co., Ltd., a real-estate company, develops and sells properties in the People's Republic of China. The company operates through Property Development and Property Management segments. It develops residential, retail, and office properties; and other ancillary facilities. The company also provides property management and related services to purchasers and tenants of its own developed residential properties and shopping arcades, as well as to the external property developers; and undertakes construction contracts. In addition, it is involved in logistics and warehousing, ski resorts, education, and elderly care activities; and rents housing properties. China Vanke Co., Ltd. was founded in 1984 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "CTRGF": {
        "short_name": "COUNTRY GARDEN SVCS HLDGS CO LT",
        "long_name": "Country Garden Services Holdings Company Limited",
        "summary": "Country Garden Services Holdings Company Limited, an investment holding company, provides property management services to property owners, residents, and property developers in the People's Republic of China. It offers security, cleaning, greening, gardening, and repair and maintenance services for residential communities. The company's property management portfolio also covers non-residential properties, including commercial properties, office buildings, multi-purpose complexes, government, hospitals, other public facilities, industrial park, highway service stations, parks, scenic areas, and schools. As of December, 2018, it managed 840 properties. The company also provides community value-added services comprising home living services, such as purchase assistance, housekeeping, greening, gardening, turnkey furnishing and move-in, group purchase, and other bespoke services; real estate brokerage services, including real estate agency, real estate investment consultancy, property short-term lease, hosting services, and property insurance; and community area services, including venue operation and community media. In addition, it offers consultancy services to property developers for the management of their pre-sale activities, as well as consultancy services for properties managed by other property management companies; and cleaning, greening, repair, and maintenance services to property developers at the pre-delivery stage. Further, the company provides sales and leasing agency services of unsold parking spaces and properties; and E-commerce services. The company was founded in 1992 and is headquartered in Foshan, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Foshan"
    },
    "CTRYF": {
        "short_name": "COUNTRY GARDEN HLDGS CO LTD",
        "long_name": "Country Garden Holdings Company Limited",
        "summary": "Country Garden Holdings Company Limited, an investment holding company, invests, develops, and constructs real estae properties primarily in Mainland China. The company operates through two segments, Property Development and Construction. It develops residential projects, such as townhouses and condos; and car-parks and retail shops. The company also develops, operates, and manages hotels. In addition, it is researches and develops robot intelligence; develops electronic hardware and biomass energy; sells food; and provides interior decoration, landscape design, agriculture and animal husbandry, investment consulting, cultural activity planning, and real estate consulting services. Country Garden Holdings Company Limited was founded in 1992 and is headquartered in Foshan, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Foshan"
    },
    "CTRYY": {
        "short_name": "COUNTRY GARDEN HLDGS CO LTD",
        "long_name": "Country Garden Holdings Company Limited",
        "summary": "Country Garden Holdings Company Limited, an investment holding company, invests, develops, and constructs real estae properties primarily in Mainland China. The company operates through two segments, Property Development and Construction. It develops residential projects, such as townhouses and condos; and car-parks and retail shops. The company also develops, operates, and manages hotels. In addition, it is researches and develops robot intelligence; develops electronic hardware and biomass energy; sells food; and provides interior decoration, landscape design, agriculture and animal husbandry, investment consulting, cultural activity planning, and real estate consulting services. Country Garden Holdings Company Limited was founded in 1992 and is headquartered in Foshan, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Foshan"
    },
    "DNK": {
        "short_name": "Phoenix Tree Holdings Limited",
        "long_name": "Phoenix Tree Holdings Limited",
        "summary": "Phoenix Tree Holdings Limited, through its subsidiaries, leases apartments from property owners and rents them to residents and corporate clients in the People's Republic of China. It designs, renovates, and furnishes apartments; and provides WiFi, 24/7 resident support, and common area maintenance and utilities to the residents, as well as repair and maintenance for private rooms. As of December 31, 2019, it operated 438,309 apartment units; and nine apartment facilities under the Dream Apartment brand name with a total of 8,558 beds and four additional facilities in Beijing, Shanghai, and Shenzhen. The company was founded in 2015 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "DUO": {
        "short_name": "Fangdd Network Group Ltd.",
        "long_name": "Fangdd Network Group Ltd.",
        "summary": "Fangdd Network Group Ltd. operates as an online real estate marketplace in the People's Republic of China. The company operates fangdd.com, an agent-centric data-driven transaction platform that provides region-specific real estate news, information, property data, and access to shared-interest online communities, as well as offers transaction facilitation services and data analytic products. As of December 31, 2019, its marketplace had approximately 1,254,580 real estate agents. The company was founded in 2011 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "DZJ.F": {
        "short_name": "COUNTRY GARDEN HLDGS CO.",
        "long_name": "Country Garden Holdings Company Limited",
        "summary": "Country Garden Holdings Company Limited, an investment holding company, invests, develops, and constructs real estae properties primarily in Mainland China. The company operates through two segments, Property Development and Construction. It develops residential projects, such as townhouses and condos; and car-parks and retail shops. The company also develops, operates, and manages hotels. In addition, it is researches and develops robot intelligence; develops electronic hardware and biomass energy; sells food; and provides interior decoration, landscape design, agriculture and animal husbandry, investment consulting, cultural activity planning, and real estate consulting services. Country Garden Holdings Company Limited was founded in 1992 and is headquartered in Foshan, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Foshan"
    },
    "EGRNF": {
        "short_name": "CHINA EVERGRANDE GROUP",
        "long_name": "China Evergrande Group",
        "summary": "China Evergrande Group, an investment holding company, primarily engages in the property development business in the People's Republic of China. It operates through four segments: Property Development, Property Investment, Property Management, and Other Businesses. It is involved in the development of residential properties, as well as other businesses, including property investment, property management, property construction, new energy vehicle, hotel operation, finance, Internet, tourism, and health businesses. The company was formerly known as Evergrande Real Estate Group Limited and changed its name to China Evergrande Group in July 2016. China Evergrande Group was incorporated in 2006 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "EGRNY": {
        "short_name": "CHINA EVERGRANDE GROUP",
        "long_name": "China Evergrande Group",
        "summary": "China Evergrande Group, an investment holding company, primarily engages in the property development business in the People's Republic of China. It operates through four segments: Property Development, Property Investment, Property Management, and Other Businesses. It is involved in the development of residential properties, as well as other businesses, including property investment, property management, property construction, new energy vehicle, hotel operation, finance, Internet, tourism, and health businesses. The company was formerly known as Evergrande Real Estate Group Limited and changed its name to China Evergrande Group in July 2016. China Evergrande Group was incorporated in 2006 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "FT7.F": {
        "short_name": "FANTASIA H.G.C.REGS HD-10",
        "long_name": "Fantasia Holdings Group Co., Limited",
        "summary": "Fantasia Holdings Group Co., Limited, an investment holding company, invests in, develops, sells, and leases commercial and residential properties primarily in the People's Republic of China. It operates through six segments: Property Development, Property Investment, Property Agency Services, Property Operation Services, Hotel Operation, and Others. The company engages in the development of urban complexes, upscale boutique residences, and mid-to-high end residence projects; the provision of hotel accommodation, property management, value-added, engineering, and travel agency services; and manufacture and sale of fuel pumps. It also provides community services through online platform; and wealth management, finance lease, petty loans, P2P, funds and factoring, consumer finance, insurance, payment services, etc. for enterprises and individuals, as well as operates and manages various city complexes, shopping centers, etc. In addition, the company operates golfs, high-end city clubs, private clubs, theme parks, art museums, etc.; and develops various home-based care service stations, daytime care centers, and senior citizen apartments, which provide home care, health care, rehabilitation therapy, nutrition catering, and spiritual solace, as well as education services. The company was founded in 1996 and is headquartered in Shenzhen, the People's Republic of China. Fantasia Holdings Group Co., Limited is a subsidiary of Fantasy Pearl International Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "GZUHY": {
        "short_name": "GUANGZHOU R&F PROPERTIES",
        "long_name": "Guangzhou R&F Properties Co., Ltd.",
        "summary": "Guangzhou R&F Properties Co., Ltd., together with its subsidiaries, engages in the development and sale of residential and commercial properties in the People's Republic of China, Malaysia, Cambodia, Korea, the United Kingdom, and Australia. The company invests in and develops various properties, including hotels, office buildings, shopping malls, logistic parks, and other retail properties in Beijing, Guangzhou, and other cities. It is also involved in the operation and management of hotels; provides property management and leasing, and architectural and engineering design services, as well as marketing development services; and operates a construction company and football club. Guangzhou R&F Properties Co., Ltd. was founded in 1994 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "H2G.SG": {
        "short_name": "Hopefluent Group Holdings Ltd.R",
        "long_name": "Hopefluent Group Holdings Limited",
        "summary": "Hopefluent Group Holdings Limited, an investment holding company, provides real estate agency services in the People's Republic of China and Australia. It operates through Property Real Estate Agency and Financial Services segments. The company offers first hand real estate services to property developers; secondary property real estate services; and mortgage referral and loan financing services to individuals or companies. It also provides advertising and marketing, and microcredit services, as well as investment and consulting services. Hopefluent Group Holdings Limited was founded in 1995 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "HGSH": {
        "short_name": "China HGS Real Estate, Inc.",
        "long_name": "China HGS Real Estate Inc.",
        "summary": "China HGS Real Estate Inc., through its subsidiaries, develops real estate properties in mainland China. It engages in the construction and sale of residential apartments, parking lots, and commercial properties. The company also develops multi-layer, sub-high-rise, and high-rise apartment buildings, as well as office buildings. Its development activity includes land acquisition, project planning, design and construction management, sales and marketing, and property management. The company was founded in 1995 and is headquartered in Hanzhong, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "NCM",
        "market": "us_market",
        "country": "China",
        "city": "Hanzhong"
    },
    "HHBT": {
        "short_name": "HH BIOTECHNOLOGY HOLDINGS COMPA",
        "long_name": "HH Biotechnology Holdings Company",
        "summary": "HH Biotechnology Holdings Company engages in health and green industries. It focuses on planting and supplying macadamia nuts for use in foods, cooking oils, healthy products, toiletries, and cosmetics. The company was formerly known as Great China International Holdings, Inc. and changed its name to HH Biotechnology Holdings Company in August 2016. HH Biotechnology Holdings Company was incorporated in 1987 and is headquartered in Shenyang, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Shenyang"
    },
    "K1Q.F": {
        "short_name": "KASEN INTL HLDGS DL-00015",
        "long_name": "Kasen International Holdings Limited",
        "summary": "Kasen International Holdings Limited, an investment holding company, manufactures and sells upholstered furniture in the United States, the People's Republic of China, Europe, and internationally. It operates through Manufacturing, Properties Development, and Others segments. The company produces and sells sofas, dining chairs, and other furniture products; and glass fiber reinforced plastic products. It also develops properties; operates resorts; and provides property management and tourism resort-related services. In addition, the company engages in the operation of a restaurant and hotel, waterpark, and provision of travel-related services; wood processing activities; and trading of leather products, as well as paper making business. Kasen International Holdings Limited was founded in 1995 and is headquartered in Haining, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Haining"
    },
    "KOU.F": {
        "short_name": "KWG GROUP HOLDINGS HD-,10",
        "long_name": "KWG Group Holdings Limited",
        "summary": "KWG Group Holdings Limited, an investment holding company, engages in the investment, development, management, and sale of real estate properties. It operates through four segments: Property Development, Property Investment, Hotel Operation, and Property Management. The company's properties portfolio include mid- to high-end residential properties, serviced apartments, villas, office buildings, hotels, and shopping malls. It also engages in the operation of hotels; and provision of food and beverage sales and other ancillary services. The company was formerly known as KWG Property Holding Limited and changed its name to KWG Group Holdings Limited in August 2018. KWG Group Holdings Limited was founded in 1995 and is headquartered in Guangzhou, China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "KWLGF": {
        "short_name": "KWG LIVING GROUP HLDGS LTD",
        "long_name": "KWG Living Group Holdings Limited",
        "summary": "KWG Living Group Holdings Limited, an investment holding company, provides various residential property management, and commercial property management and operational services in the People's Republic of China. As of April 30, 2020, it managed 109 residential properties with an aggregate gross floor area (GFA) under management of 18.9 million square meters; and 30 commercial properties with an aggregate GFA under management of 3.3 million square meters. The company was founded in 2004 and is headquartered in Guangzhou, the People's Republic of China. KWG Living Group Holdings Limited(SEHK:3913) operates independently of KWG Group Holdings Limited as of October 30, 2020.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "LEJU": {
        "short_name": "Leju Holdings Limited",
        "long_name": "Leju Holdings Limited",
        "summary": "Leju Holdings Limited, through its subsidiaries, provides online to offline (O2O) real estate services in the People's Republic of China. The company offers real estate e-commerce, online advertising, and online listing services through its online platform, which comprises websites covering 386 cities and various mobile applications. It also operates various real estate and home furnishing Websites of SINA Corporation (SINA); and official accounts on Weixin, a social communication platform and Weibo, a microblog. In addition, the company provides selling discount coupons; and facilitating online property viewing, physical property visits, marketing events, and pre-sale customer support, as well as home furnishing business transactions on its platform for new residential properties. Further, it sells advertising primarily on the SINA new residential properties and home furnishing websites; and acts as an advertising agent for the SINA home page and non-real estate Websites with respect to advertising sold to real estate developers and home furnishing suppliers. Additionally, the company offers fee-based online property listing services to real estate agents; and services to individual property sellers. Leju Holdings Limited was incorporated in 2013 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "LGFRY": {
        "short_name": "LONGFOR GROUP HLDGS LTD",
        "long_name": "Longfor Group Holdings Limited",
        "summary": "Longfor Group Holdings Limited, an investment holding company, engages in property development, investment, and management businesses in China. Its Property Development segment develops and sells office and commercial premises, and residential properties. The company's Property Investment segment leases investment properties, including shopping malls and rental housing. Its Property Management and Related Services and Others segment provides property management and related services, as well as hotel operation and other services. The company was formerly known as Longfor Properties Co. Ltd. and changed its name to Longfor Group Holdings Limited in June 2018. Longfor Group Holdings Limited was founded in 1993 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "LNGPF": {
        "short_name": "LONGFOR GROUP HLDGS LTD",
        "long_name": "Longfor Group Holdings Limited",
        "summary": "Longfor Group Holdings Limited, an investment holding company, engages in property development, investment, and management businesses in China. Its Property Development segment develops and sells office and commercial premises, and residential properties. The company's Property Investment segment leases investment properties, including shopping malls and rental housing. Its Property Management and Related Services and Others segment provides property management and related services, as well as hotel operation and other services. The company was formerly known as Longfor Properties Co. Ltd. and changed its name to Longfor Group Holdings Limited in June 2018. Longfor Group Holdings Limited was founded in 1993 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "MDJH": {
        "short_name": "MDJM LTD",
        "long_name": "MDJM Ltd.",
        "summary": "MDJM Ltd., through its subsidiaries and variable interest entity, operates as an integrated real estate services company in the People's Republic of China. It offers real estate agency services to real estate developers; and real estate consulting services, such as real estate marketing and planning, real estate agency services, and advertising planning services. The company also provides independent training and tourism development services. It serves real estate developers, real estate design institutes and agencies, urban planning bureaus of various levels of governments, and urban rail transportation companies, as well as urban infrastructure development companies. The company was formerly known as MDJLEAD LTD. and changed its name to MDJM Ltd. in May 2018. MDJM Ltd. was founded in 2002 and is headquartered in Tianjin, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Tianjin"
    },
    "NTP": {
        "short_name": "Nam Tai Property Inc.",
        "long_name": "Nam Tai Property Inc.",
        "summary": "Nam Tai Property Inc., through its subsidiaries, owns, develops, and operates technology parks in the People's Republic of China. It focuses on developing three parcels of land in Gushu and Guangming, Shenzhenn into technology parks, as well as rents properties. The company was formerly known as Nam Tai Electronics, Inc. and changed its name to Nam Tai Property Inc. in April 2014. Nam Tai Property Inc. was founded in 1975 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "PACQF": {
        "short_name": "PRIME ACQUISITION CORP",
        "long_name": "Prime Acquisition Corp.",
        "summary": "Prime Acquisition Corp. owns and operates real estate properties in Italy. The company property portfolio comprises office, logistics, commercial, and industrial real estate assets located in the Milan metropolitan area. Prime Acquisition Corp. was founded in 2010 and is based in Shijiazhuang, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Shijiazhuang"
    },
    "QFRA.F": {
        "short_name": "GREENLAND HK HLDGS HD-,50",
        "long_name": "Greenland Hong Kong Holdings Limited",
        "summary": "Greenland Hong Kong Holdings Limited, an investment holding company, engages in the property development, property and hotel investment, and property management businesses in the People's Republic of China. It operates through four segments: Sales of Properties and Construction Management Service; Lease of Properties; Hotel and Related Services; and Property Management and Other Services. The Sales of Properties and Construction Management Service segment develops and sells residential properties, as well as provides construction management services. The Lease of Properties segment leases commercial and residential properties. The Hotel and Related Services segment operates hotels and service apartments. The Property Management and Other Services segment offers property management and other services to external customers and group companies. Greenland Hong Kong Holdings Limited also provides construction and decoration, investing and management consulting, financing, and commercial management services, as well as nutrition and health counseling services; and software development services. The company was formerly known as SPG Land (Holdings) Limited and changed its name to Greenland Hong Kong Holdings Limited in August 2013. The company was founded in 1992 and is based in Shanghai, China. Greenland Hong Kong Holdings Limited is a subsidiary of Gluon Xima International Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    },
    "QK": {
        "short_name": "Q&K International Group Limited",
        "long_name": "Q&K International Group Limited",
        "summary": "Q&K International Group Limited operates a long-term apartment rental platform in the People's Republic of China. The company sources apartments from landlords, converts them into standardized furnished rooms, and leases to tenants. It also provides Internet connection and utility services as part of the lease agreement. Q&K International Group Limited was founded in 2012 and is based in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NGM",
        "market": "us_market",
        "country": "China",
        "city": "Shanghai"
    },
    "RDH.F": {
        "short_name": "RADIANCE HLDGS GRP.HD-,01",
        "long_name": "Radiance Holdings (Group) Co. Limited",
        "summary": "Radiance Holdings (Group) Co. Limited operates as a real estate development company in China. The company develops and sells residential and commercial properties. It also engages in leasing commercial properties; and provision of management consulting services. As of July 31, 2020, the company had a gross floor area of 25,630,941 square meters of residential properties; and 3,450,816 square meters of non-residential properties. Radiance Holdings (Group) Co. Limited was founded in 1996 and is headquartered in Beijing, China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "RDH.MU": {
        "short_name": "RADIANCE HLDGS GRP.HD-,01",
        "long_name": "Radiance Holdings (Group) Co. Limited",
        "summary": "Radiance Holdings (Group) Co. Limited operates as a real estate development company in China. The company develops and sells residential and commercial properties. It also engages in leasing commercial properties; and provision of management consulting services. As of July 31, 2020, the company had a gross floor area of 25,630,941 square meters of residential properties; and 3,450,816 square meters of non-residential properties. Radiance Holdings (Group) Co. Limited was founded in 1996 and is headquartered in Beijing, China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "RE9.F": {
        "short_name": "SKYFAME REA.HLDGS-0,00333",
        "long_name": "Skyfame Realty (Holdings) Limited",
        "summary": "Skyfame Realty (Holdings) Limited, an investment holding company, engages in the property development, investment, and management activities in the People's Republic of China. The company develops a range of properties, such as residential and commercial properties, offices, serviced apartments, and hotels. It is also involved in provision of services in the youth community development projects; operation of a hospital; and technology operating services activities. The company is headquartered in Guangzhou, China. Skyfame Realty (Holdings) Limited is a subsidiary of Cosmos Tianyu Holdings Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "RLF.F": {
        "short_name": "LONGFOR GR.HLD.REGS HD-10",
        "long_name": "Longfor Group Holdings Limited",
        "summary": "Longfor Group Holdings Limited, an investment holding company, engages in property development, investment, and management businesses in China. Its Property Development segment develops and sells office and commercial premises, and residential properties. The company's Property Investment segment leases investment properties, including shopping malls and rental housing. Its Property Management and Related Services and Others segment provides property management and related services, as well as hotel operation and other services. The company was formerly known as Longfor Properties Co. Ltd. and changed its name to Longfor Group Holdings Limited in June 2018. Longfor Group Holdings Limited was founded in 1993 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "SCNR.F": {
        "short_name": "SUNAC CHINA REG.S HD -,01",
        "long_name": "Sunac China Holdings Limited",
        "summary": "Sunac China Holdings Limited, together with its subsidiaries, invests in, develops, and sells residential and commercial properties in the People's Republic of China. The company provides conferences and exhibitions, tourism and vacations, theme parks, hotel operations, medical and health care, IP development and operation, and film and television content production and distribution services. It is also involved in property services, commercial operations, property management, fitting and decoration, and cultural and tourism city construction and operation activities. The company was founded in 2003 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "SI0.F": {
        "short_name": "SINIC HLDGS (GROUP)CO.LTD",
        "long_name": "Sinic Holdings (Group) Company Limited",
        "summary": "Sinic Holdings (Group) Company Limited, an investment holding company, engages in the property development and leasing activities in the People's Republic of China. The company develops and sells residential and commercial properties. It also develops, operates, and manages commercial properties, including shopping centers, apartments, and office buildings, as well as manages hotels; and provides consulting services to independent third parties. The company was founded in 2010 and is headquartered in Shanghai, the People's Republic of China. Sinic Holdings (Group) Company Limited is a subsidiary of Sinic Holdings Group Company Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    },
    "SOHOF": {
        "short_name": "SOHO CHINA LIMITED",
        "long_name": "SOHO China Limited",
        "summary": "SOHO China Limited, together with its subsidiaries, engages in the real estate development, and property leasing and management activities in People's Republic of China. The company operates in two segments, Properties Development and Properties Investment. It also operates serviced apartments. SOHO China Limited was founded in 1995 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "SOLLY": {
        "short_name": "SHUI ON LAND LIMITED",
        "long_name": "Shui On Land Limited",
        "summary": "Shui On Land Limited, an investment holding company, develops and sells properties in the Chinese Mainland. It operates through three segments: Property Development, Property Investment, and Construction. The Property Development segment develops and sells properties, such as residential, office, retail, entertainment, and cultural properties. The Property Investment segment leases offices and commercial/mall properties; provides property management services; and operates hotels. The Construction segment engages in the construction, interior fitting-out, renovation, and maintenance of building premises, as well as the provision of related consultancy services. The company also engages in the development of science and technology; and retail business. In addition, it provides business and hotel management, food and beverage, management, secretarial, education and business information consultancy, cultural diffusion, debt financing, construction, electronic commerce, and decoration services. The company was founded in 2004 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Shanghai"
    },
    "SRRE": {
        "short_name": "SUNRISE REAL ESTATE GROUP INC",
        "long_name": "Sunrise Real Estate Group, Inc.",
        "summary": "Sunrise Real Estate Group, Inc., together with its subsidiaries, provides real estate development and property brokerage services in the People's Republic of China. It offers real estate marketing, property leasing, and property management services. The company also engages in marketing and sales agency operations, which include services, such as integrated marketing planning, advertising planning and execution, and sales planning and execution; and real estate investment activities. In addition, it is involved in entity investment and fund management activities; and financial and consultancy services. The company was formerly known as Sunrise Real Estate Development Group, Inc. and changed its name to Sunrise Real Estate Group, Inc. in May 2006. Sunrise Real Estate Group, Inc. was founded in 1996 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Shanghai"
    },
    "TNHDF": {
        "short_name": "TIMES NEIGHBORHOOD HOLDINGS LTD",
        "long_name": "Times Neighborhood Holdings Limited",
        "summary": "Times Neighborhood Holdings Limited provides property management and other relevant services primarily to property developers, property owners and residents, and governmental authorities in the People's Republic of China. The company offers property management services for residential properties non-residential properties. The company also provides community value-added services for owners and tenants, including public space leasing and parking space management, and life services for daily needs, including characteristic butler service, community shopping, community announcement, bill payment service, home appliances maintenance and repair, and community event organization service. In addition, it offers elevator services, including sale, installation, repair, and maintenance; intelligent engineering services, including intelligent community supporting services, as well as build intelligent communities with facilities. It manages a portfolio of residential properties; and non-residential properties, such as commercial properties and office buildings, government buildings, industry parks, public facilities, hospitals, airports, schools, and municipal sanitation. The company was founded in 1998 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "UK": {
        "short_name": "Ucommune International Ltd",
        "long_name": "Ucommune International Ltd",
        "summary": "Ucommune International Ltd provides long-term and short-term leasing of co-working spaces to freelancers, start-up entrepreneurs, small and medium enterprises, and corporations. The company also offers space design and build services, as well as management services to develop and manage co-working spaces for landlords. It offers U Plus services, including individual services, such as catering, fitness, healthcare, training, and entertainment services; general corporate services, such as corporate secretary, human resources, legal, finance, IT support, and tax services; incubation and corporate venturing services; advertising and branding services; and community services. It offers marketing services; interior design services; and technology and Internet services. Ucommune International Ltd is based in Beijing, China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "WETH": {
        "short_name": "WETOUCH TECHNOLOGY INC",
        "long_name": "Wetouch Technology Inc.",
        "summary": "Wetouch Technology Inc. engages in the research, development, manufacture, sale, and servicing of medium to large sized projected capacitive touchscreens. Its product portfolio comprises medium to large sized projected capacitive touchscreens, which range from 7.0 inch to 42 inch screens. The company offers Glass-Glass, which are primarily used in GPS/car entertainment panels in mid-size and luxury cars, industrial human-machine interface (HMI), financial and banking terminals, point of sale, and lottery machines; Glass-Film-Film, which are primarily used in high-end GPS and entertainment panels, industrial HMI, financial and banking terminals, lottery, and gaming industry; Plastic-Glass, which are used in GPS/entertainment panels motor vehicle GPS, smart home, robots, and charging stations; and Glass-Film that are used in industrial HMI. Its products are also used in automotive, medical, and other specialized industries; and ATM and other financial machines, and ticket machines and kiosks. Wetouch Technology Inc. sells its products primarily in China, South Korea, Taiwan, Spain, and Germany. The company was founded in 2020 and is based in Meishan, China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Meishan"
    },
    "XIN": {
        "short_name": "Xinyuan Real Estate Co Ltd",
        "long_name": "Xinyuan Real Estate Co., Ltd.",
        "summary": "Xinyuan Real Estate Co., Ltd., together with its subsidiaries, engages in residential real estate development in the People's Republic of China, the United States, and internationally. It develops residential projects, such as multi-layer apartment buildings, sub-high-rise apartment buildings, high-rise apartment buildings; and auxiliary services and amenities, such as retail outlets, leisure and health facilities, kindergartens, and schools, as well as office, mixed-use, and commercial properties. The company also acquires development sites through public auctions of government land and direct negotiations. In addition, it provides property management services for its developments and other real estate-related services. Further, the company offers landscaping engineering and management, real estate consulting and marketing, leasing management, management consulting, and technical services; operates retail stores; and installs intercom systems. Xinyuan Real Estate Co., Ltd. was founded in 1997 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "XSA.F": {
        "short_name": "XIWANG PPTY HLDGS  HD-,10",
        "long_name": "Xiwang Property Holdings Company Limited",
        "summary": "Xiwang Property Holdings Company Limited, together with its subsidiaries, develops properties in the People's Republic of China. The company develops residential and commercial projects. It also invests in properties. The company was formerly known as Xiwang Sugar Holdings Company Limited and changed its name to Xiwang Property Holdings Company Limited in August 2013. The company was founded in 2001 and is headquartered in Zouping County, the People's Republic of China. Xiwang Property Holdings Company Limited is a subsidiary of Xiwang Investment Company Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Zouping"
    },
    "YC2.F": {
        "short_name": "YIDA CHINA HLDGS  DL -,01",
        "long_name": "Yida China Holdings Limited",
        "summary": "Yida China Holdings Limited, an investment holding company, develops and operates business parks in the People's Republic of China. The company's Property Development segment develops and sells properties. Its Property Investment segment invests in and rents properties. The company's Business Park Operation and Management segment provides operation and management services to the business park projects owned by the local governments or other independent third parties. Its Construction, Decoration and Landscaping segment engages in property construction business; and the provision of interior decoration services to property buyers, as well as landscaping services to property projects. The company's Property Management segment provides management services to properties. Yida China Holdings Limited's property portfolio includes multifunctional integrated residential community projects, office properties, and residential properties. Yida China Holdings Limited was founded in 1988 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    },
    "YP9.F": {
        "short_name": "YUZHOU GR.HLDG.REGS HD-10",
        "long_name": "Yuzhou Group Holdings Company Limited",
        "summary": "Yuzhou Group Holdings Company Limited, an investment holding company, engages in the property development activities in the People's Republic of China. It is involved in the boutique housing development, investment property operations, hotel operation management, and property management businesses. The company develops residential, retail, and commercial properties. It has a land bank area of approximately 20.12 million square meters. The company was formerly known as Yuzhou Properties Company Limited and changed its name to Yuzhou Group Holdings Company Limited in June 2020. Yuzhou Group Holdings Company Limited was founded in 1994 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    }
}