{
    "000002.SZ": {
        "short_name": "CHINA VANKE CO",
        "long_name": "China Vanke Co., Ltd.",
        "summary": "China Vanke Co., Ltd., together with its subsidiaries, engages in the development and sale of properties in the Mainland China, Hong Kong, and internationally. The company operates through Property Development and Property Management segments. It develops residential buildings, commercial offices, and other ancillary facilities. The company also provides property management and related services to purchasers and tenants of its own developed residential properties, shopping arcades, and office buildings, as well as to properties developed by external property developers; and undertakes construction contracts. In addition, it is involved in logistics and warehousing, hotel and resort, education, and housing rental businesses. The company was incorporated in 1984 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518083",
        "website": "http://www.vanke.com",
        "market_cap": "Large Cap"
    },
    "000005.SZ": {
        "short_name": "SHN FOUNTAIN CORP",
        "long_name": "Shenzhen Fountain Corporation",
        "summary": "Shenzhen Fountain Corporation engages in real estate development, clean energy, transportation, and waste management activities in China. The company operates various fleets of electric vehicles (EVs) at residential and tourism developments under the HANSOME EValet brand, as well as light truck EVs for intra city logistics; and provides power-charging infrastructure at various transportation hubs and residential communities. It also develops low carbon neighborhood; and operates city chilling stations to provide cooling services to the communities, and infrastructure for cold chain food and beverage storage and logistics, as well as cold chain retail spaces and EV cold chain distributors. Shenzhen Fountain Corporation was founded in 1990 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518001",
        "website": "http://www.fountain.com.cn",
        "market_cap": "Small Cap"
    },
    "000006.SZ": {
        "short_name": "SHN ZHENYE GROUP",
        "long_name": "Shenzhen Zhenye (Group) Co.,Ltd.",
        "summary": "Shenzhen Zhenye (Group) Co.,Ltd. engages in the development, management, and rental of real estate properties in China. The company provides residence, commercial properties, villas, etc. It is also involved in the shantytowns transformation and distinctive town construction activities. The company was founded in 1989 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518008",
        "website": "http://www.zhenye.com",
        "market_cap": "Small Cap"
    },
    "000014.SZ": {
        "short_name": "SHAHE INDUSTRIAL C",
        "long_name": "Shahe Industrial Co., Ltd",
        "summary": "Shahe Industrial Co., Ltd. develops, operates, and manages real estate properties in China. The company was founded in 1987 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.shahe.cn",
        "market_cap": "Small Cap"
    },
    "000031.SZ": {
        "short_name": "GRANDJOY HOLDINGS",
        "long_name": "Grandjoy Holdings Group Co., Ltd.",
        "summary": "Grandjoy Holdings Group Co., Ltd. operates as a real estate development company in China. It develops residential and industrial properties. The company is also involved in the rental of properties. The company was formerly known as COFCO Property Group Co., Ltd. and changed its name to Grandjoy Holdings Group Co., Ltd. in March 2019. The company is headquartered in Shenzhen, China. Grandjoy Holdings Group Co., Ltd. operates as a subsidiary of COFCO Hong Kong Limited",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.grandjoy.com",
        "market_cap": "Mid Cap"
    },
    "000042.SZ": {
        "short_name": "SHN CENTRALCON INV",
        "long_name": "Shenzhen Centralcon Investment Holding Co., Ltd.",
        "summary": "Shenzhen Centralcon Investment Holding Co., Ltd. engages in the real estate development business. It is also involved in the hotel management, business management, industrial operation, property management, and capital operation activities. The company was formerly known as Shenzhen Changcheng Investment Holding Co., Ltd. and changed its name to Shenzhen Centralcon Investment Holding Co., Ltd. in March 2014. Shenzhen Centralcon Investment Holding Co., Ltd. was founded in 1984 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518054",
        "website": "http://www.zztzkg.com",
        "market_cap": "Small Cap"
    },
    "000502.SZ": {
        "short_name": "LVJING HOLDING CO",
        "long_name": "Lvjing Holding Co., Ltd.",
        "summary": "Lvjing Holding Co., Ltd. engages in real estate development business in China. Its project portfolio comprises villas, houses, merchants, and their supporting facilities. The company was founded in 1988 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.000502.cn",
        "market_cap": "Small Cap"
    },
    "000506.SZ": {
        "short_name": "ZHONGRUN RESOURCES",
        "long_name": "Zhongrun Resources Investment Corporation",
        "summary": "Zhongrun Resources Investment Corporation engages in the mineral exploitation and real estate investment businesses in China. It explores for precious metals, such as gold, silver, etc.; and nonferrous metals. The company has 19 mining rights and 12 exploration rights in Sichuan, Tibetan, Inner Mongolia, etc., as well as internationally. It also invests in and develops real estate properties. The company was formerly known as ShanDong ZhongRun Investment Holding Group Co., Ltd. Zhongrun Resources Investment Corporation is based in Jinan, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": "250014",
        "website": "http://www.zhongrunziyuan.com",
        "market_cap": "Small Cap"
    },
    "000514.SZ": {
        "short_name": "CHONGQING YUKAIFA",
        "long_name": "Chongqing Yukaifa Co., Ltd",
        "summary": "Chongqing Yukaifa Co., Ltd. operates as a real estate development company in China. It is also involved in municipal asset, exhibition, and property management businesses. The company was founded in 1978 and is based in Chongqing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "400015",
        "website": "http://www.cqukf.com",
        "market_cap": "Small Cap"
    },
    "000537.SZ": {
        "short_name": "TIANJIN GUANGYU DE",
        "long_name": "Tianjin Guangyu Development Co., Ltd.",
        "summary": "Tianjin Guangyu Development Co., Ltd. engages in the real estate development business in China. The company develops, constructs and sells high-rise flats, villas, townhouses, etc. The company was formerly known as Tianjin Nankai Gode Co., Ltd. and changed its name to Tianjin Guangyu Development Co., Ltd. in June 2005. Tianjin Guangyu Development Co., Ltd. was founded in 1986 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.gyfz000537.com",
        "market_cap": "Small Cap"
    },
    "000540.SZ": {
        "short_name": "ZHONGTIAN FINANCIA",
        "long_name": "Zhongtian Financial Group Company Limited",
        "summary": "Zhongtian Financial Group Company Limited provides various financial services. The company offers various insurance products; investment banking services, such as capital management, wealth management, and brokerage; private banking services; and investment funds, as well as professional financial asset trading platforms. The company was founded in 1978 and is based in Guiyang, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guiyang",
        "zipcode": "550081",
        "website": "http://ztfgroup.com",
        "market_cap": "Mid Cap"
    },
    "000558.SZ": {
        "short_name": "LANDER SPORTS DEVE",
        "long_name": "Lander Sports Development Co.,Ltd.",
        "summary": "Lander Sports Development Co. Ltd. develops, constructs, and manages sporting facilities in Mainland China and internationally. The company's sports facilities include public fitness centers, city sports and leisure squares, city sports and leisure stadiums, city single sports venues, city fitness clubs, and city community sports convenience stores. It also offers sports financing and financial services, such as leasing of sports assets; and sports-related property and personal insurance products, as well as online lottery products. In addition, the company organizes sports events and tournaments, including football, basketball, and winter sports; operates sports clubs, and training and coaching facilities; provides sports media services; and develops technology platforms for domestic venue reservations, social news and information on sporting events, and sports recruitment. The company was formerly known as Lander Real Estate Co., Ltd. and changed its name to Lander Sports Development Co. Ltd. in August 2015. Lander Sports Development Co. Ltd. was founded in 1995 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.lander.com.cn",
        "market_cap": "Small Cap"
    },
    "000567.SZ": {
        "short_name": "HAINAN HAIDE IND C",
        "long_name": "Hainan Haide Capital Management Co., Ltd.",
        "summary": "Hainan Haide Capital Management Co., Ltd. engages in the non-performing asset acquisition, restructuring, ABS, disposal, and transaction management business. The company was formerly known as Hainan Haide Industry Co.,Ltd and changed its name to Hainan Haide Capital Management Co., Ltd. The company is based in Beijing, China. Haide Capital Management Co., Ltd. operates as a subsidiary of Wintime Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100031",
        "website": "http://www.000567.com",
        "market_cap": "Small Cap"
    },
    "000616.SZ": {
        "short_name": "HNA INVESTMENT GP",
        "long_name": "HNA Investment Group Co., Ltd.",
        "summary": "HNA Investment Group Co., Ltd. engages in the real estate development and investment, fund, medical care, health, insurance, and pension businesses in China. The company was founded in 1993 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.hnainvestment.com",
        "market_cap": "Small Cap"
    },
    "000656.SZ": {
        "short_name": "JINKE PROPERTY GRO",
        "long_name": "Jinke Property Group Co., Ltd.",
        "summary": "Jinke Property Group Co., Ltd. primarily operates as a real estate development company in China. It develops residential, industrial, and commercial properties. The company also provides property management services for residential properties, commercial centers, office buildings, universities, government properties, hotel clubs, and others; generates wind power; and operates hotels. In addition, it offers asset management, industrial investment, and wealth management services, as well as real estate funds; landscape design and planning services; and architectural decoration services for hotels, shopping malls, banks, and office buildings. The company was formerly known as Chongqing Dongyuan Industrial Development Co., Ltd. and changed its name to Jinke Property Group Co., Ltd. in June 2011. Jinke Property Group Co., Ltd. was founded in 1994 and is based in Chongqing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "400020",
        "website": "http://www.jinke.com",
        "market_cap": "Mid Cap"
    },
    "000671.SZ": {
        "short_name": "SUNSHINE CITY GRP",
        "long_name": "Yango Group Co., Ltd",
        "summary": "Yango Group Co., Ltd develops and operates real estate properties in China. It develops residential and commercial building, hotel, and industrial projects. The company was founded in 1995 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200082",
        "website": "http://www.yango.com.cn",
        "market_cap": "Mid Cap"
    },
    "000718.SZ": {
        "short_name": "SUNING UNIVERSAL",
        "long_name": "Suning Universal Co.,Ltd",
        "summary": "Suning Universal Co.,Ltd operates as a real estate development company in China. The company projects include commercial estates, residential properties, and hotels. It also provides building materials. Suning Universal Co.,Ltd was founded in 1987 and is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": null,
        "website": "http://www.suning-universal.com",
        "market_cap": "Mid Cap"
    },
    "000732.SZ": {
        "short_name": "TAHOE GROUP CO LTD",
        "long_name": "Tahoe Group Co.,Ltd",
        "summary": "Tahoe Group Co., Ltd. primarily engages in real estate business in China. The company develops residential and commercial projects, office buildings, serviced apartments, and commercial pedestrian streets, urban complexes, as well as operates hotels. It also provides property management services. The company was founded in 1996 and is headquartered in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": "350001",
        "website": "http://www.tahoecn.com",
        "market_cap": "Small Cap"
    },
    "000797.SZ": {
        "short_name": "CHINA WUYI",
        "long_name": "China Wuyi Co., Ltd.",
        "summary": "China Wuyi Co., Ltd., together with its subsidiaries, engages in the real estate investment and development activities. It also provides real estate property management services; domestic and international project contracting and investment services; capital operation and financing, and build-operate-transfer services; high-tech development and co-operation; decorating and finishing; and technology and labor service cooperation, etc. In addition, the company is involved in the trading, import, and export of construction materials and equipment; provision of construction, engineering, and general contracting services for house-building and decoration projects; and construction of public infrastructure projects, such as roads and bridges, airports, hospitals, conference centers, and municipal buildings. It has operations in Southeast Asia, the Middle East, and African markets. The company is based in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": "350003",
        "website": "http://www.chinawuyi.com.cn",
        "market_cap": "Small Cap"
    },
    "000809.SZ": {
        "short_name": "TIELING NEWCITY",
        "long_name": "Tieling Newcity Investment Holding (Group) Limited",
        "summary": "Tieling Newcity Investment Holding (Group) Limited engages in urban infrastructure construction activities in China. It is also involved in land development, water supply, sewage treatment, taxi operation, and advertising media businesses. The company was founded in 2006 and is based in Tieling, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tieling",
        "zipcode": null,
        "website": "http://www.tielingnewcity.com.cn",
        "market_cap": "Small Cap"
    },
    "000897.SZ": {
        "short_name": "TIANJIN JINBIN DEV",
        "long_name": "Tianjin Jinbin Development Co., Ltd.",
        "summary": "Tianjin Jinbin Development Co., Ltd. engages in the real estate development business in China. It develops industrial parks, and commercial and mid-to-high-end residential real estate properties. The company was founded in 1998 and is based in Tianjin, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": null,
        "website": "http://www.jbdc.com.cn",
        "market_cap": "Small Cap"
    },
    "000918.SZ": {
        "short_name": "CHINA CALXON GROUP",
        "long_name": "China Calxon Group Co., Ltd.",
        "summary": "China Calxon Group Co., Ltd. engages in real estate development and commercial asset management business in China. It develops residential, commercial, office, and urban complexes, as well as provides property management and consulting services for urban complexes, hotel-style apartments, villas, residential quarters, office buildings, and commercial buildings. China Calxon Group Co., Ltd. is based in Shanghai, China. As of August 1, 2016, China Calxon Group Co., Ltd. operates as a subsidiary of Guangzhou Kailong Real Estate Company Limited.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.calxon-group.com",
        "market_cap": "Small Cap"
    },
    "000961.SZ": {
        "short_name": "JIANGSU ZHONGNAN",
        "long_name": "Jiangsu Zhongnan Construction Group Co., Ltd.",
        "summary": "Jiangsu Zhongnan Construction Group Co., Ltd. engages in the real estate development and building construction businesses in China and internationally. It develops boutique residences, commercial properties, characteristic towns, and tourism and industrial parks; undertakes urbanization, infrastructure, and public utility construction works, as well as civil engineering works. It is also involved in landscape engineering design and general contracting of municipal public works; and construction of industrial towns, parks, and complexes, as well as offers production lines for PC landscape pieces. In addition, it provides financial services for real estate and construction; technology in the industrial field; and education services, as well as energy, engineering, and electrical equipment. The company was founded in 1988 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200335",
        "website": "http://www.zhongnangroup.cn",
        "market_cap": "Mid Cap"
    },
    "000965.SZ": {
        "short_name": "T/TIANBAO INFRASTR",
        "long_name": "Tianjin Tianbao Infrastructure Co., Ltd.",
        "summary": "Tianjin Tianbao Infrastructure Co., Ltd. engages in the real estate development and infrastructure construction businesses in China. It is also involved in the development of industrial parks; equity investment business; and property management activities. The company is headquartered in Tianjin, China. Tianjin Tianbao Infrastructure Co., Ltd. is a subsidiary of Tianjin T&B Holding Co., Ltd.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300308",
        "website": "http://www.tbjijian.com",
        "market_cap": "Small Cap"
    },
    "001914.SZ": {
        "short_name": "CHINA MERCHANTS P",
        "long_name": "China Merchants Property Operation and Service Co., Ltd.",
        "summary": "China Merchants Property Operation and Service Co., Ltd. develops and manages real estate properties. It offers institutional property management and asset management services. The company was formerly known as AVIC SUNDA Holding Company Limited and changed its name to China Merchants Property Operation and Service Co., Ltd. in December 2019. China Merchants Property Operation and Service Co., Ltd. was founded in 1985 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.cmpo1914.com",
        "market_cap": "Mid Cap"
    },
    "001979.SZ": {
        "short_name": "CHINA MERCHANTS SH",
        "long_name": "China Merchants Shekou Industrial Zone Holdings Co., Ltd.",
        "summary": "China Merchants Shekou Industrial Zone Holdings Co., Ltd. engages in the development and operation of industrial parks, and residential and commercial real estate properties in China. It also operates in the cruise industry. The company was formerly known as China Merchants Shekou Industrial Zone Company Limited. The company was founded in 1979 and is headquartered in Shenzhen, China. China Merchants Shekou Industrial Zone Holdings Co., Ltd. is a subsidiary of China Merchants Group Limited.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518067",
        "website": "http://www.cmsk1979.com",
        "market_cap": "Large Cap"
    },
    "002016.SZ": {
        "short_name": "GUANGDONG SHIRONGZ",
        "long_name": "Guangdong Shirongzhaoye Co., Ltd.",
        "summary": "Guangdong Shirongzhaoye Co., Ltd. engages in the real estate development business in China. The company was founded in 2000 and is based in Zhuhai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": null,
        "website": "http://www.gdsrzy.com",
        "market_cap": "Small Cap"
    },
    "002077.SZ": {
        "short_name": "JIANGSU DAGANG CO",
        "long_name": "Jiangsu Dagang Co., Ltd.",
        "summary": "Jiangsu Dagang Co., Ltd. engages in the real estate development and construction business in China. The company develops central park, a residential area integrating elevator garden houses, courtyard villas, double-family villas, superimposed villas, and high-end clubs; and villa communities, as well as offers services, such as docking, loading and unloading, warehousing, water supply, and solid waste disposal for enterprises. It is also involved in the research and development, production, and sale of laser equipment. The company was founded in 2000 and is based in Zhenjiang, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhenjiang",
        "zipcode": "212000",
        "website": "http://www.dggf.cn",
        "market_cap": "Small Cap"
    },
    "002133.SZ": {
        "short_name": "COSMOS GROUP CO LT",
        "long_name": "Cosmos Group Co., Ltd.",
        "summary": "Cosmos Group Co., Ltd. engages in the real estate development business in China. It primarily develops apartments, plazas, buildings, golf villas, and other properties. The company was founded in 1984 and is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.cosmosgroup.com.cn",
        "market_cap": "Small Cap"
    },
    "002146.SZ": {
        "short_name": "RISESUN REAL EST D",
        "long_name": "RiseSun Real Estate Development Co.,Ltd",
        "summary": "RiseSun Real Estate Development Co.,Ltd develops and sells real estate properties in China. The company was founded in 1996 and is headquartered in Langfang, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Langfang",
        "zipcode": "065000",
        "website": "http://www.risesun.cn",
        "market_cap": "Mid Cap"
    },
    "002208.SZ": {
        "short_name": "HEFEI URBAN CONSTR",
        "long_name": "Hefei Urban Construction Development Co., Ltd",
        "summary": "Hefei Urban Construction Development Co., Ltd. engages in the real estate development business under the Amber brand name. The company develops and constructs residential, commercial, and office buildings. It operates primarily in Hefei, Chaohu, Feidong, Bengbu, Xuancheng, Guangde, Sanya, Hainan, China, and internationally. The company is based in Hefei, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": "230031",
        "website": "http://www.hucd.cn",
        "market_cap": "Small Cap"
    },
    "002244.SZ": {
        "short_name": "HANGZHOU BINJIANG",
        "long_name": "Hangzhou Binjiang Real Estate Group Co.,Ltd",
        "summary": "Hangzhou Binjiang Real Estate Group Co.,Ltd, a real estate company, engages in the real estate development business in China. It is also involved in the sale and rental of apartments. The company was founded in 1992 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310016",
        "website": "http://www.binjiang.com.cn",
        "market_cap": "Mid Cap"
    },
    "002305.SZ": {
        "short_name": "LANGOLD REAL ESTAT",
        "long_name": "Langold Real Estate Co., Ltd.",
        "summary": "Langold Real Estate Co., Ltd. operates as a real estate development company in China. It develops and operates shopping centers, hotels, residential and office buildings, apartments, industrial parks, and other properties. The company was founded in 1998 and is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430060",
        "website": "http://www.langold.com.cn",
        "market_cap": "Small Cap"
    },
    "0059.HK": {
        "short_name": "SKYFAME REALTY",
        "long_name": "Skyfame Realty (Holdings) Limited",
        "summary": "Skyfame Realty (Holdings) Limited, an investment holding company, engages in the property development, investment, and management activities in the People's Republic of China. The company develops a range of properties, such as residential and commercial properties, offices, serviced apartments, and hotels. It is also involved in provision of services in the youth community development projects; operation of a hospital; and technology operating services activities. The company was incorporated in 1993 and is headquartered in Guangzhou, China. Skyfame Realty (Holdings) Limited is a subsidiary of Cosmos Tianyu Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510060",
        "website": "http://www.skyfame.com.cn",
        "market_cap": "Small Cap"
    },
    "0272.HK": {
        "short_name": "SHUI ON LAND",
        "long_name": "Shui On Land Limited",
        "summary": "Shui On Land Limited, an investment holding company, develops and sells properties in the Chinese Mainland. It operates through three segments: Property Development, Property Investment, and Construction. The Property Development segment develops and sells properties, such as residential, office, retail, entertainment, and cultural properties. The Property Investment segment leases offices and commercial/mall properties; provides property management services; and operates hotels. The Construction segment engages in the construction, interior fitting-out, renovation, and maintenance of building premises, as well as the provision of related consultancy services. The company also engages in the development of science and technology; and retail business. In addition, it provides business and hotel management, food and beverage, management, secretarial, education and business information consultancy, cultural diffusion, debt financing, construction, electronic commerce, and decoration services. The company was founded in 2004 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200021",
        "website": "http://www.shuionland.com",
        "market_cap": "Small Cap"
    },
    "0337.HK": {
        "short_name": "GREENLAND HK",
        "long_name": "Greenland Hong Kong Holdings Limited",
        "summary": "Greenland Hong Kong Holdings Limited, an investment holding company, engages in the property development, property and hotel investment, and property management businesses in the People's Republic of China. It operates through four segments: Sales of Properties and Construction Management Service; Lease of Properties; Hotel and Related Services; and Property Management and Other Services. The Sales of Properties and Construction Management Service segment develops and sells residential properties, as well as provides construction management services. The Lease of Properties segment leases commercial and residential properties. The Hotel and Related Services segment operates hotels and service apartments. The Property Management and Other Services segment offers property management and other services to external customers and group companies. Greenland Hong Kong Holdings Limited also provides construction and decoration, investing and management consulting, financing, and commercial management services, as well as nutrition and health counseling services; and software development services. The company was formerly known as SPG Land (Holdings) Limited and changed its name to Greenland Hong Kong Holdings Limited in August 2013. The company was founded in 1992 and is based in Shanghai, China. Greenland Hong Kong Holdings Limited is a subsidiary of Gluon Xima International Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "0496.HK": {
        "short_name": "KASEN",
        "long_name": "Kasen International Holdings Limited",
        "summary": "Kasen International Holdings Limited, an investment holding company, manufactures and sells upholstered furniture in the United States, the People's Republic of China, Europe, and internationally. It operates through Manufacturing, Properties Development, and Others segments. The company produces and sells sofas, dining chairs, and other furniture products; and glass fiber reinforced plastic products. It also develops properties; operates resorts; and provides property management and tourism resort-related services. In addition, the company engages in the operation of a restaurant and hotel, waterpark, and provision of travel-related services; wood processing activities; and trading of leather products, as well as paper making business. Kasen International Holdings Limited was founded in 1995 and is headquartered in Haining, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Haining",
        "zipcode": "314400",
        "website": "http://www.kasen.com.cn",
        "market_cap": "Small Cap"
    },
    "0747.HK": {
        "short_name": "SHENYANG PUBLIC",
        "long_name": "Shenyang Public Utility Holdings Company Limited",
        "summary": "Shenyang Public Utility Holdings Company Limited, an investment holding company, engages in the construction of infrastructure and development of properties in the People's Republic of China. It is also involved in property investment activities. The company was founded in 1999 and is based in Shenyang, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenyang",
        "zipcode": null,
        "website": "http://shenyangpublic.todayir.com",
        "market_cap": "Small Cap"
    },
    "0846.HK": {
        "short_name": "MINGFA GROUP",
        "long_name": "Mingfa Group (International) Co., Ltd.",
        "summary": "Mingfa Group (International) Company Limited, an investment holding company, engages in the property development and leasing, and hotel management businesses in the People's Republic of China. The company operates through three segments: Property Development, Hotel, and Property Investment and Management. The Property Development segment develops commercial and residential real estate properties. The Hotel segment is involved in the operation of hotels. The Property Investment and Management segment invests in properties; and offers management and security services to residential, hotel, and commercial properties. It is also involved in the manufacture and sale of furniture; trade of construction materials; and provision of sports, as well as consultancy services. The company was founded in 1994 and is headquartered in Nanjing, the People's Republic of China. Mingfa Group (International) Company Limited is a subsidiary of Galaxy Earnest Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210000",
        "website": "http://www.ming-fa.com",
        "market_cap": "Small Cap"
    },
    "0884.HK": {
        "short_name": "CIFI HOLD GP",
        "long_name": "CIFI Holdings (Group) Co. Ltd.",
        "summary": "CIFI Holdings (Group) Co. Ltd., an investment holding company, invests in, develops, and manages properties in the People's Republic of China. The company operates through Sales of Properties; Property Investment; and Project Management and Other Property Related Services segments. It develops and sells office and commercial premises, and residential properties; leases investment properties; and offers project management and other property related services. The company also provides property construction and business management services. As of December 31, 2020, it had a land bank with total and attributable gross floor area of approximately 56.5 million square meters and 20.8 million square meters. CIFI Holdings (Group) Co. Ltd. was founded in 2000 and is headquartered in Shanghai, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201106",
        "website": "http://www.cifi.com.cn",
        "market_cap": "Mid Cap"
    },
    "0960.HK": {
        "short_name": "LONGFOR GROUP",
        "long_name": "Longfor Group Holdings Limited",
        "summary": "Longfor Group Holdings Limited, an investment holding company, engages in property development, investment, and management businesses in the People's Republic of China. It operates through Property Development; Property Investment; and Property Management and Related Services and Others segments. The Property Development segment develops and sells office and commercial premises, and residential properties. The Property Investment segment leases investment properties, including shopping malls and rental housing. The Property Management and Related Services and Others segment provides property management and related services, as well as hotel operation and other services. The company was formerly known as Longfor Properties Co. Ltd. and changed its name to Longfor Group Holdings Limited in June 2018. Longfor Group Holdings Limited was founded in 1993 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.longfor.com",
        "market_cap": "Large Cap"
    },
    "0IW.F": {
        "short_name": "DAFA PROPERTIES GR.",
        "long_name": "DaFa Properties Group Limited",
        "summary": "DaFa Properties Group Limited, an investment holding company, operates as a real estate developer in the Yangtze River Delta Region in the People's Republic of China. The company is involved in the development and sale of residential properties; development, operation, and management of commercial and mixed-use properties; and provision of management consulting services. As of December 31, 2019, it had a portfolio of 69 projects consisting of 63 residential properties, two residential and commercial complexes, two commercial complexes, one office floor, and one residential and service apartment. DaFa Properties Group Limited was founded in 1996 and is headquartered in Shanghai, China. DaFa Properties Group Limited is a subsidiary of Splendid Sun Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201106",
        "website": "http://www.dafaland.com",
        "market_cap": "Small Cap"
    },
    "0RJ.F": {
        "short_name": "REDSUN PROPERTIES GROUP",
        "long_name": "Redsun Properties Group Limited",
        "summary": "Redsun Properties Group Limited, together with its subsidiaries, engages in the property development business in the People's Republic of China. It operates in three segments: Property Development, Commercial Property Investment and Operation, and Hotel Operations. The company focuses on the development of residential properties; and development, operation, and management of commercial and other properties. It also leases properties; operates hotels; and sells construction materials. The company was incorporated in 2017 and is headquartered in Shanghai, the People's Republic of China. Redsun Properties Group Limited is a subsidiary of Redsun Properties Group (Holdings) Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.rsunproperty.hk",
        "market_cap": "Small Cap"
    },
    "1030.HK": {
        "short_name": "SEAZEN",
        "long_name": "Seazen Group Limited",
        "summary": "Seazen Group Limited, together with its subsidiaries, engages in the investment, development, and sale of properties in the People's Republic of China. The company operates through two segments, A Share Company and Non-A Share Companies. It primarily develops and sells residential properties and mixed-use complexes, as well as provides commercial property management and other services. As of December 31, 2020, the company had total land bank of approximately 142,876,372 square meters. It also provides asset operation and management, marketing research, consulting, department store management, apartment leasing, information technology, and children entertainment, as well as hotel, and conference, and cinema management services. In addition, the company offers securities and future brokerage, book running, placing management, and money lending services, as well as dealing and advising services of securities. Further, it provides architecture designing service; and is involved in the maintenance and leasing energy equipment, as well as designs, manufactures, and sells auto parts. The company was formerly known as Future Land Development Holdings Limited and changed its name to Seazen Group Limited in November 2019. The company was founded in 1996 and is headquartered in Shanghai, the People's Republic of China. Seazen Group Limited is a subsidiary of Wealth Zone Hong Kong Investments Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.seazengroup.com.cn",
        "market_cap": "Mid Cap"
    },
    "1238.HK": {
        "short_name": "POWERLONG",
        "long_name": "Powerlong Real Estate Holdings Limited",
        "summary": "Powerlong Real Estate Holdings Limited, an investment holding company, invests in, develops, operates, and manages commercial real estate projects in the People's Republic of China. The company operates through four segments: Property Development, Property Investment, Commercial Operation and Residential Property Management, and Other Property Development Related Businesses. It develops large-scale commercial and residential properties. The company also operates hotels; and provides residential property management services, as well as construction and decoration services. As of December 31, 2020, it developed, owned, and operated 193 property development projects; operated investment properties, primarily shopping malls with a total gross floor area (GFA) of approximately 5,076,029 square meters; had a land bank with a total GFA of 36.5 million square meters; and owned and managed eight international branded hotels and eleven self-owned branded chain hotels. The company was incorporated in 2007 and is based in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201101",
        "website": "http://www.powerlong.com",
        "market_cap": "Mid Cap"
    },
    "1396.HK": {
        "short_name": "GD-HKGBA HLDGS",
        "long_name": "Guangdong - Hong Kong Greater Bay Area Holdings Limited",
        "summary": "Guangdong - Hong Kong Greater Bay Area Holdings Limited, together with its subsidiaries, develops, operates, and sells commercial trade and logistics centers, and residential properties in the People's Republic of China. The company develops trade centers under the YOUNGO and HYDOO brand names. It also provides in property management, investment management, and leasing services. The company was formerly known as Hydoo International Holding Limited and changed its name to Guangdong - Hong Kong Greater Bay Area Holdings Limited in August 2020. The company was founded in 1995 and is headquartered in Shenzhen, the People's Republic of China. Guangdong - Hong Kong Greater Bay Area Holdings Limited is a subsidiary of China Guangdong Â\u0096 Hong Kong Greater Bay Area Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.hydoo.com.cn",
        "market_cap": "Small Cap"
    },
    "1570.HK": {
        "short_name": "WEIYE HOLDINGS",
        "long_name": "Weiye Holdings Limited",
        "summary": "Weiye Holdings Limited, an investment holding company, develops residential and commercial properties in the People's Republic of China, Singapore, and internationally. It operates in two segments, Property Development and Equipment Manufacturing. The company also constructs resettlement houses and leases investment properties. In addition, it manufactures, trades in, and wholesales heating, ventilation, air-conditioning, air purification, and clean room equipment, including fan filter units, air showers, clean booths, pass boxes, clean hand dryers, clean benches, deflection grilles, and air diffusers. Further, the company trades in building construction materials; provides property management services; and offers logistics management, ancillary, technology consultation and transfer, and after-sales services, as well as agency services. Weiye Holdings Limited was incorporated in 1984 and is headquartered in Shenzhen, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.weiyeholdings.com",
        "market_cap": "Small Cap"
    },
    "1622.HK": {
        "short_name": "REDCO GROUP",
        "long_name": "Redco Properties Group Limited",
        "summary": "Redco Properties Group Limited, an investment holding company, engages in the property development and investment activities in the People's Republic of China. The company operates through Greater Western Taiwan Straits Economic Zone; Central and Western Regions; Bohai Economic Rim; Greater Bay Area; and Others segments. It develops residential and commercial properties. The company is also involved in the provision of construction design and cost consulting, construction and sea reclamation, project management, and healthcare services; cultural product design consulting services; and culture, education, and sports activities. In addition, it provides property management and leasing, building decoration, telecommunication, trading, enterprise management, and software invention services. The company was founded in 1992 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.redco.cn",
        "market_cap": "Small Cap"
    },
    "1628.HK": {
        "short_name": "YUZHOU GROUP",
        "long_name": "Yuzhou Group Holdings Company Limited",
        "summary": "Yuzhou Group Holdings Company Limited, an investment holding company, engages in the property development activities in the People's Republic of China. It develops, sells, manages, and invests in properties. The company is also involved in the operation of hotels; marketing activities; and trading of construction materials. The company was formerly known as Yuzhou Properties Company Limited and changed its name to Yuzhou Group Holdings Company Limited in June 2020. Yuzhou Group Holdings Company Limited was founded in 1994 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.yuzhou-group.com",
        "market_cap": "Small Cap"
    },
    "1638.HK": {
        "short_name": "KAISA GROUP",
        "long_name": "Kaisa Group Holdings Ltd.",
        "summary": "Kaisa Group Holdings Ltd., an investment holding company, engages in the property investment, development, and management businesses in the People's Republic of China. It develops villas, townhouses, residential and commercial buildings, and office buildings. The company is also involved in the hotel and catering, cinema, and department stores and cultural center operations, as well as waterway passenger and cargo transportation, healthcare business, property leasing, and manufacturing and trading of pharmaceutical products. In addition, it offers commerce management and construction engineering services. Kaisa Group Holdings Ltd. was founded in 1999 and is headquartered in Shenzhen, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.kaisagroup.com",
        "market_cap": "Mid Cap"
    },
    "1813.HK": {
        "short_name": "KWG GROUP",
        "long_name": "KWG Group Holdings Limited",
        "summary": "KWG Group Holdings Limited, an investment holding company, engages in the investment, development, and sale of real estate properties. The company operates through three segments: Property Development, Property Investment, and Hotel Operation. Its property portfolio includes mid- to high-end residential properties, serviced apartments, villas, offices, hotels, and shopping malls. It also operates hotels. The company was formerly known as KWG Property Holding Limited and changed its name to KWG Group Holdings Limited in August 2018. KWG Group Holdings Limited was founded in 1995 and is headquartered in Guangzhou, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510623",
        "website": "http://www.kwggroupholdings.com",
        "market_cap": "Mid Cap"
    },
    "1862.HK": {
        "short_name": "JINGRUI HLDGS",
        "long_name": "Jingrui Holdings Limited",
        "summary": "Jingrui Holdings Limited, an investment holding company, engages in property development business in the People's Republic of China. It operates through Property Development Platform, Capital Platform, and All Other Platforms segments. The company develops residential and commercial properties. It also invests in office buildings and apartments; and provides management and security services to residential and commercial properties. In addition, the company is involved in building decoration engineering, urban infrastructure development, customized decoration, property land investment, hardware and building materials, and information technology businesses. Jingrui Holdings Limited was founded in 1993 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.jingruis.com",
        "market_cap": "Small Cap"
    },
    "18V.F": {
        "short_name": "CHINA VANKE CO.LTD H YC 1",
        "long_name": "China Vanke Co., Ltd.",
        "summary": "China Vanke Co., Ltd., together with its subsidiaries, engages in the development and sale of properties in the Mainland China, Hong Kong, and internationally. The company operates through Property Development and Property Management segments. It develops residential buildings, commercial offices, and other ancillary facilities. The company also provides property management and related services to purchasers and tenants of its own developed residential properties, shopping arcades, and office buildings, as well as to properties developed by external property developers; and undertakes construction contracts. In addition, it is involved in logistics and warehousing, hotel and resort, education, and housing rental businesses. The company was incorporated in 1984 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518083",
        "website": "http://www.vanke.com",
        "market_cap": "Large Cap"
    },
    "1918.HK": {
        "short_name": "SUNAC",
        "long_name": "Sunac China Holdings Limited",
        "summary": "Sunac China Holdings Limited, together with its subsidiaries, invests in, develops, and sells residential and commercial properties in the People's Republic of China. The company provides conferences and exhibitions, tourism and vacations, theme parks, hotel operations, medical and health care, IP development and operation, and film and television content production and distribution services. It is also involved in property services, commercial operations, property management, fitting and decoration, and cultural and tourism city construction and operation activities. The company was founded in 2003 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100007",
        "website": "http://www.sunac.com.cn",
        "market_cap": "Large Cap"
    },
    "1996.HK": {
        "short_name": "RSUN PPT",
        "long_name": "Redsun Properties Group Limited",
        "summary": "Redsun Properties Group Limited, together with its subsidiaries, engages in the property development business in the People's Republic of China. It operates in three segments: Property Development, Commercial Property Investment and Operation, and Hotel Operations. The company focuses on the development of residential properties; and development, operation, and management of commercial and other properties. It also leases properties; operates hotels; and sells construction materials. The company was incorporated in 2017 and is headquartered in Shanghai, the People's Republic of China. Redsun Properties Group Limited is a subsidiary of Redsun Properties Group (Holdings) Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.rsunproperty.hk",
        "market_cap": "Small Cap"
    },
    "1R7.F": {
        "short_name": "RONSHINE CH.HLD.HD-,00001",
        "long_name": "Ronshine China Holdings Limited",
        "summary": "Ronshine China Holdings Limited, an investment holding company, engages in the property development business. It is involved in the development of mid-to high-end residential properties and commercial properties in cities in the Western Taiwan Straits Economic Zone, Yangtze River Delta Economic Region, and selected first-and second-tier cities in the People's Republic of China. The company was formerly known as Ronshine China Holdings Limited. The company was founded in 2003 and is headquartered in Shanghai, China. Ronshine China Holdings Limited is a subsidiary of Dingxin Company Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200336",
        "website": "http://www.rongxingroup.com",
        "market_cap": "Small Cap"
    },
    "1ZZ.F": {
        "short_name": "ZHENRO PROP.GRP DL-,00001",
        "long_name": "Zhenro Properties Group Limited",
        "summary": "Zhenro Properties Group Limited, an investment holding company, engages in the property development, property leasing, and commercial property management business in the People's Republic of China. It develops residential properties; and develops, operates, and manages commercial and mixed-use properties. The company was founded in 1998 and is headquartered in Shanghai, China. Zhenro Properties Group Limited is a subsidiary of RoYue Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.zhenrodc.com",
        "market_cap": "Mid Cap"
    },
    "2007.HK": {
        "short_name": "COUNTRY GARDEN",
        "long_name": "Country Garden Holdings Company Limited",
        "summary": "Country Garden Holdings Company Limited, an investment holding company, invests, develops, and constructs real estate properties primarily in Mainland China. The company operates through two segments, Property Development and Construction. It develops residential projects, such as townhouses and condos; and car-parks and retail shops. The company also develops, operates, and manages hotels. In addition, it researches and develops robot intelligence; develops electronic hardware and biomass energy; sells food; and provides interior decoration, landscape design, agriculture and animal husbandry, investment consulting, cultural activity planning, and real estate consulting services. Country Garden Holdings Company Limited was founded in 1992 and is headquartered in Foshan, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Foshan",
        "zipcode": "528312",
        "website": "http://www.countrygarden.com.cn",
        "market_cap": "Large Cap"
    },
    "2019.HK": {
        "short_name": "DEXIN CHINA",
        "long_name": "Dexin China Holdings Company Limited",
        "summary": "Dexin China Holdings Company Limited, an investment holding company, engages in the property development business in the People's Republic of China. It operates through three segments: Property Development and Construction, Property Investment, and Other Businesses. The company develops residential and commercial properties; and develops, operates, and manages commercial and mixed-use properties. It is also involved in the property construction and project management activities; leasing of commercial properties; and hotel operation activities. The company was founded in 1993 and is headquartered in Hangzhou, in the People's Republic of China. Dexin China Holdings Company Limited is a subsidiary of Tak Shin International Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.dothinkgroup.com",
        "market_cap": "Small Cap"
    },
    "2088.HK": {
        "short_name": "XIWANG PROPERTY",
        "long_name": "Xiwang Property Holdings Company Limited",
        "summary": "Xiwang Property Holdings Company Limited, together with its subsidiaries, develops properties in the People's Republic of China. The company develops residential and commercial projects. It also invests in properties, and trades in construction materials. The company was formerly known as Xiwang Sugar Holdings Company Limited and changed its name to Xiwang Property Holdings Company Limited in August 2013. The company was founded in 2001 and is headquartered in Zouping, the People's Republic of China. Xiwang Property Holdings Company Limited is a subsidiary of Xiwang Investment Company Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Zouping",
        "zipcode": "256209",
        "website": "http://www.xiwangproperty.com",
        "market_cap": "Small Cap"
    },
    "2103.HK": {
        "short_name": "SINIC HOLDINGS",
        "long_name": "Sinic Holdings (Group) Company Limited",
        "summary": "Sinic Holdings (Group) Company Limited, an investment holding company, engages in the property development and leasing activities in the People's Republic of China. The company develops and sells residential and commercial properties. It also develops, operates, and manages commercial properties, including shopping centers, apartments, and office buildings, as well as manages hotels; and provides project consulting services to independent third parties. The company was founded in 2010 and is headquartered in Shanghai, the People's Republic of China. Sinic Holdings (Group) Company Limited is a subsidiary of Sinic Holdings Group Company Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.sinicdc.com",
        "market_cap": "Small Cap"
    },
    "2117.HK": {
        "short_name": "DATANG GROUP",
        "long_name": "Datang Group Holdings Limited",
        "summary": "Datang Group Holdings Limited, an investment holding company, together with its subsidiaries, engages in the development of residential and commercial properties in China. The company focuses on selected economic regions in China, including the Western Taiwan Strait Economic Region, Beibu Gulf Region and Neighboring Cities, Beijing-Tianjin-Hebei Region, Midstream Parts of the Yangtze River Region, Yangtze River Delta Region, and Chengdu-Chongqing Region. It engages in the construction and trading of construction materials. The company also operates hotels, sports facilities, and commercial properties. It serves individuals and companies of residential properties, and tenants of investment properties. The company was incorporated in 2018 and is headquartered in Xiamen, China. Datang Group Holdings Limited is a subsidiary of Dynasty International Co. Ltd.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361000",
        "website": "http://www.dyna888.com",
        "market_cap": "Small Cap"
    },
    "2202.HK": {
        "short_name": "CHINA VANKE",
        "long_name": "China Vanke Co., Ltd.",
        "summary": "China Vanke Co., Ltd., together with its subsidiaries, engages in the development and sale of properties in the Mainland China, Hong Kong, and internationally. The company operates through Property Development and Property Management segments. It develops residential buildings, commercial offices, and other ancillary facilities. The company also provides property management and related services to purchasers and tenants of its own developed residential properties, shopping arcades, and office buildings, as well as to properties developed by external property developers; and undertakes construction contracts. In addition, it is involved in logistics and warehousing, hotel and resort, education, and housing rental businesses. The company was incorporated in 1984 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518083",
        "website": "http://www.vanke.com",
        "market_cap": "Large Cap"
    },
    "2329.HK": {
        "short_name": "GUORUI PPT",
        "long_name": "Guorui Properties Limited",
        "summary": "Guorui Properties Limited, an investment holding company, primarily engages in the development of real estate properties in the People's Republic of China. The company operates through four segments: Property Development, Primary Land Construction and Development Services, Property Investment, and Property Management and Related Services. The Property Development segment develops and sells commercial and residential properties. The Primary Land Construction and Development Services segment provides primary land development services, including services for resettlement, and construction of land infrastructure and ancillary public facilities on land owned by the local governments. The Property Investment segment engages in the rental of investment properties. The Property Management and Related Services segment offers property management and related services. It primarily serves individual purchasers for residential properties, as well as various types of corporations and other business entities for commercial properties. The company was founded in 1994 and is headquartered in Beijing, China. Guorui Properties Limited operates as a subsidiary of Alltogether Land Company Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100062",
        "website": "http://www.glorypty.com",
        "market_cap": "Small Cap"
    },
    "2608.HK": {
        "short_name": "SUNSHINE 100",
        "long_name": "Sunshine 100 China Holdings Ltd",
        "summary": "Sunshine 100 China Holdings Ltd invests in, develops, and manages real estate properties in the People's Republic of China. It operates through five segments: Mixed-Use Business Complexes, Multi-Functional Residential Communities, Investment Properties, Property Management and Hotel Operation, and Light-Asset Operation. The Mixed-Use Business Complexes segment develops and sells business complex products. The Multi-Functional Residential Communities segment engages in the development and sale of residential properties; and development of land. The Investment Properties segment leases offices and commercial premises. The Property Management and Hotel Operation segment provides property management and hotel accommodation services. The Light-Asset Operation segment offers property selling agency and brand-use services. The company was incorporated in 2007 and is headquartered in Beijing, the People's Republic of China. Sunshine 100 China Holdings Ltd is a subsidiary of Joywise Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100026",
        "website": "http://www.ss100.com.cn",
        "market_cap": "Small Cap"
    },
    "2699.HK": {
        "short_name": "XINMING CHINA",
        "long_name": "Xinming China Holdings Limited",
        "summary": "Xinming China Holdings Limited, an investment holding company, operates as an integrated residential and commercial property developer in the People's Republic of China. The company operates through three segments: Property Development, Property Leasing, and Others. It develops residential units and ancillary facilities, including mid-rise apartments, high-rise apartments, and townhouses, as well as street-level retail outlets and other facilities, such as clubhouses and swimming pools. The company also invests in and leases commercial properties; and provides property management services to the owners of residential properties. As of December 31, 2019, it leased out an area of approximately 167,327.3 square meters. The company was founded in 2014 and is based in Hangzhou, China. Xinming China Holdings Limited is a subsidiary of Xinxing Company Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310007",
        "website": "http://www.xinm.com.cn",
        "market_cap": "Small Cap"
    },
    "26X.F": {
        "short_name": "DEXIN CHINA HLD. DL-,0005",
        "long_name": "Dexin China Holdings Company Limited",
        "summary": "Dexin China Holdings Company Limited, an investment holding company, engages in the property development business in the People's Republic of China. It operates through three segments: Property Development and Construction, Property Investment, and Other Businesses. The company develops residential and commercial properties; and develops, operates, and manages commercial and mixed-use properties. It is also involved in the property construction and project management activities; leasing of commercial properties; and hotel operation activities. The company was founded in 1993 and is headquartered in Hangzhou, in the People's Republic of China. Dexin China Holdings Company Limited is a subsidiary of Tak Shin International Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.dothinkgroup.com",
        "market_cap": "Small Cap"
    },
    "2777.HK": {
        "short_name": "R&F PROPERTIES",
        "long_name": "Guangzhou R&F Properties Co., Ltd.",
        "summary": "Guangzhou R&F Properties Co., Ltd., together with its subsidiaries, engages in the development and sale of residential and commercial properties in the People's Republic of China, Malaysia, Cambodia, Korea, the United Kingdom, and Australia. The company invests in and develops various properties, including hotels, office buildings, shopping malls, logistic parks, and other retail properties in Beijing, Guangzhou, and other cities. It is also involved in the operation and management of hotels; provides property management and leasing, and architectural and engineering design services, as well as marketing development services; and operates a construction company and football club. Guangzhou R&F Properties Co., Ltd. was founded in 1994 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510623",
        "website": "http://www.rfchina.com",
        "market_cap": "Mid Cap"
    },
    "3301.HK": {
        "short_name": "RONSHINECHINA",
        "long_name": "Ronshine China Holdings Limited",
        "summary": "Ronshine China Holdings Limited, an investment holding company, engages in the property development business. It is involved in the development of mid-to high-end residential properties and commercial properties in cities in the Western Taiwan Straits Economic Zone, Yangtze River Delta Economic Region, and selected first-and second-tier cities in the People's Republic of China. The company was formerly known as Ronshine China Holdings Limited. The company was founded in 2003 and is headquartered in Shanghai, China. Ronshine China Holdings Limited is a subsidiary of Dingxin Company Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200336",
        "website": "http://www.rongxingroup.com",
        "market_cap": "Small Cap"
    },
    "3333.HK": {
        "short_name": "EVERGRANDE",
        "long_name": "China Evergrande Group",
        "summary": "China Evergrande Group, an investment holding company, primarily engages in the property development business in the People's Republic of China. It operates through four segments: Property Development, Property Investment, Property Management Services, and Other Businesses. It is involved in the development of residential properties, as well as other businesses, including property investment, property management, property construction, new energy vehicle, hotel operation, finance, Internet, cultural tourism, and health businesses. The company was formerly known as Evergrande Real Estate Group Limited and changed its name to China Evergrande Group in July 2016. China Evergrande Group was incorporated in 2006 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518054",
        "website": "http://www.evergrande.com",
        "market_cap": "Large Cap"
    },
    "3380.HK": {
        "short_name": "LOGAN GROUP",
        "long_name": "Logan Group Company Limited",
        "summary": "Logan Group Company Limited, an investment holding company, operates as an integrated property developer in the People's Republic of China. It operates through four segments: Property Development, Property Leasing, Construction and Decoration Contracts and Others, and Urban Redevelopment Business. The Property Development segment develops and sells residential properties and retail shops; and sells land held for development. The Property Leasing segment leases office units, retail shops, and hotels. The Construction and Decoration Contracts and Others segment constructs office premises and residential buildings; and provides decoration services to external customers and interior decoration services to property buyers. The Urban Redevelopment Business segment sells land for urban redevelopment. The company was formerly known as Logan Property Holdings Company Limited and changed its name to Logan Group Company Limited in June 2020. The company was founded in 1996 and is headquartered in Shenzhen, the People's Republic of China. Logan Group Company Limited is a subsidiary of Junxi Investments Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.logangroup.com",
        "market_cap": "Mid Cap"
    },
    "3383.HK": {
        "short_name": "AGILE GROUP",
        "long_name": "Agile Group Holdings Limited",
        "summary": "Agile Group Holdings Limited, an investment holding company, engages in the property development, property management, hotel operation, property investment, environmental protection, and other businesses in the People's Republic of China. As of December 31, 2020, the company had a land bank with a total gross floor area of 53.01 million square meters in 84 cities located in Southern China region, Eastern China region, Western China region, Central China region, Hainan and Yunnan region, Northeast China region, Northern China region, Hong Kong, and internationally. It also provides property management services including a gross floor area of 374.8 million square meters, as well as residential properties, rental apartments, schools, and clubhouses services. In addition, the company is involved in the operation of hotels, shopping malls, office buildings, and community retail malls. Further, it provides hazardous waste treatment, water treatment, domestic waste-to-energy, and solid waste treatment services; ecological landscape, decoration, design consulting, environmental protection, construction, and real estate construction management services. The company was formerly known as Agile Property Holdings Limited and changed its name to Agile Group Holdings Limited in July 2016. The company was incorporated in 2005 and is headquartered in Guangzhou, the People's Republic of China. Agile Group Holdings Limited is a subsidiary of Top Coast Investment Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510623",
        "website": "http://www.agile.com.cn",
        "market_cap": "Mid Cap"
    },
    "3883.HK": {
        "short_name": "CHINA AOYUAN",
        "long_name": "China Aoyuan Group Limited",
        "summary": "China Aoyuan Group Limited engages in the development of commercial real estate properties in Mainland China, Hong Kong, Australia, and Canada. The company operates through Property Development, Property Investment, and Others segments. It also acquires and develops various real estate projects; and develops and operates cultural tourism, hotel management, sports development, and resort projects. In addition, the company imports and export goods, such as maternal and child care products, cosmetics and skin care products, clothing and bags, food and beverages, household goods, and parallel imported vehicles. Further, it provides medical service platform combining online and offline services; consultancy services; construction services; and financing services. The company was formerly known as China Aoyuan Property Group Limited and changed its name to China Aoyuan Group Limited in November 2018. China Aoyuan Group Limited was founded in 1996 and is based in Guangzhou, the People's Republic of China. China Aoyuan Group Limited is a subsidiary of Ace Rise Profits Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "511445",
        "website": "http://www.aoyuan.com.cn",
        "market_cap": "Mid Cap"
    },
    "3900.HK": {
        "short_name": "GREENTOWN CHINA",
        "long_name": "Greentown China Holdings Limited",
        "summary": "Greentown China Holdings Limited, an investment holding company, engages in the property development and related business in China. It operates through Property Development, Hotel Operations, Property Investment, and Project Management segments. The company develops and sells residential properties. It also offers investment and asset management; project management; technology research and development; and design and decoration services. In addition, the company operates hotels; and invests in and rents properties, as well as sells construction materials. As of December 31, 2020, its land bank comprised a total gross floor area of approximately 50.79 million square meters. The company was founded in 1995 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310007",
        "website": "http://www.chinagreentown.com",
        "market_cap": "Mid Cap"
    },
    "3XRA.F": {
        "short_name": "XINYUAN REAL ESTATE ADR 1",
        "long_name": "Xinyuan Real Estate Co., Ltd.",
        "summary": "Xinyuan Real Estate Co., Ltd., together with its subsidiaries, engages in residential real estate development in the People's Republic of China, the United States, and internationally. It develops residential projects, such as multi-layer apartment buildings, sub-high-rise apartment buildings, high-rise apartment buildings; and auxiliary services and amenities, such as retail outlets, leisure and health facilities, kindergartens, and schools, as well as office, mixed-use, and commercial properties. The company also acquires development sites through public auctions of government land and direct negotiations. In addition, it provides property management services for its developments and other real estate-related services. Further, the company offers landscaping engineering and management, real estate consulting and marketing, leasing management, management consulting, and technical services; operates retail stores; and installs intercom systems. Xinyuan Real Estate Co., Ltd. was founded in 1997 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100025",
        "website": "http://www.xyre.com",
        "market_cap": "Small Cap"
    },
    "3XU.F": {
        "short_name": "HUIJING HLDG.CO.LTD HD-01",
        "long_name": "Huijing Holdings Company Limited",
        "summary": "Huijing Holdings Company Limited, an investment holding company, engages in the property development and investment activities primarily in Mainland China. The company focuses on urban renewal projects covering residential, integrated, and industry-specific property projects. It develops residential properties, including townhouses, mansions, and villas, as well as commercial properties comprising retail outlets, shopping malls, offices, and hotels; and urban renewal projects. The company was founded in 2004 and is headquartered in Dongguan, the People's Republic of China. Huijing Holdings Company Limited is a subsidiary of Wui Ying Holdings Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": null,
        "website": "http://www.huijingholdings.com",
        "market_cap": "Small Cap"
    },
    "47C.F": {
        "short_name": "CHINA AOYUAN GROUP HD-,01",
        "long_name": "China Aoyuan Group Limited",
        "summary": "China Aoyuan Group Limited engages in the development of commercial real estate properties in Mainland China, Hong Kong, Australia, and Canada. The company operates through Property Development, Property Investment, and Others segments. It also acquires and develops various real estate projects; and develops and operates cultural tourism, hotel management, sports development, and resort projects. In addition, the company imports and export goods, such as maternal and child care products, cosmetics and skin care products, clothing and bags, food and beverages, household goods, and parallel imported vehicles. Further, it provides medical service platform combining online and offline services; consultancy services; construction services; and financing services. The company was formerly known as China Aoyuan Property Group Limited and changed its name to China Aoyuan Group Limited in November 2018. China Aoyuan Group Limited was founded in 1996 and is based in Guangzhou, the People's Republic of China. China Aoyuan Group Limited is a subsidiary of Ace Rise Profits Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "511445",
        "website": "http://www.aoyuan.com.cn",
        "market_cap": "Mid Cap"
    },
    "52J.F": {
        "short_name": "GANGLONG CHINA PR.GR.LTD",
        "long_name": "Ganglong China Property Group Limited",
        "summary": "Ganglong China Property Group Limited engages in the development and sale of residential properties in the People's Republic of China. Its property development projects include retail units, car parks, and ancillary areas. The company was founded in 2007 and is headquartered in Shanghai, China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.glchina.group",
        "market_cap": "Small Cap"
    },
    "5YQ.F": {
        "short_name": "SUNKWAN P.G.  DL-,000001",
        "long_name": "Sunkwan Properties Group Limited",
        "summary": "Sunkwan Properties Group Limited, an investment holding company, engages in the property development and leasing activities in the People's Republic of China. It also provides project management services. The company was founded in 2010 and is headquartered in Shanghai, China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.sunkwan.com.cn",
        "market_cap": "Small Cap"
    },
    "600052.SS": {
        "short_name": "ZHEJIANG GUANGSHA CO. LTD.",
        "long_name": "Zhejiang Guangsha Co., Ltd.",
        "summary": "Zhejiang Guangsha Co., Ltd. engages in the real estate development business in China. It also operates a five-star hotel. The company was founded in 1993 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.gsgf.com",
        "market_cap": "Small Cap"
    },
    "600094.SS": {
        "short_name": "GREATTOWN HOLDINGS LTD",
        "long_name": "Greattown Holdings Ltd.",
        "summary": "Greattown Holdings Ltd. engages in the real estate development business in China. It develops residential, commercial complex, industrial park, tourism and cultural park, office building, and hotel properties. The company was founded in 1986 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201103",
        "website": "http://www.greattown.cn",
        "market_cap": "Small Cap"
    },
    "600159.SS": {
        "short_name": "BEIJING DALONG WEIYE REAL EST D",
        "long_name": "Beijing Dalong Weiye Real Estate Development Co.,Ltd",
        "summary": "Beijing Dalong Weiye Real Estate Development Co.,Ltd engages in the real estate development activities in China. It is also involved in the building construction, ecological gardening, finance, technology, and cultural media businesses. The company was founded in 1987 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "101300",
        "website": "http://www.dldc.com.cn",
        "market_cap": "Small Cap"
    },
    "600162.SS": {
        "short_name": "SHENZHEN HEUNGKONG HOLDING CO. ",
        "long_name": "Shenzhen HeungKong Holding Co.,Ltd",
        "summary": "Shenzhen HeungKong Holding Co.,Ltd engages in the development of commercial real estate properties. It also invests in and operates shops. The company is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.hkhc.com.cn",
        "market_cap": "Small Cap"
    },
    "600173.SS": {
        "short_name": "WOLONG REAL ESTATE GROUP CO. LT",
        "long_name": "Wolong Real Estate Group Co.,Ltd.",
        "summary": "Wolong Real Estate Group Co., Ltd. engages in the real estate development business in China. The company was formerly known as Zhejiang Wolong Real Estate Co., Ltd and changed its name to Wolong Real Estate Group Co., Ltd. in January 2008. Wolong Real Estate Group Co., Ltd. was founded in 1994 and is based in Shaoxing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shaoxing",
        "zipcode": "312300",
        "website": "http://www.wolong-re.com",
        "market_cap": "Small Cap"
    },
    "600208.SS": {
        "short_name": "XINHU ZHONGBAO CO. LTD.",
        "long_name": "Xinhu Zhongbao Co.,Ltd.",
        "summary": "Xinhu Zhongbao Co.,Ltd. engages in the real estate, financial service, and financial technology businesses in China. The company develops real estate projects. Xinhu Zhongbao Co.,Ltd. is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310007",
        "website": "http://www.600208.net",
        "market_cap": "Mid Cap"
    },
    "600215.SS": {
        "short_name": "CHANGCHUN JINGKAI (GROUP) CO LT",
        "long_name": "Changchun jingkai Group Co., Ltd",
        "summary": "Changchun jingkai Group Co., Ltd engages in the real estate development and infrastructure construction businesses in China. It is involved in the commercial and residential land development activities. The company was founded in 1993 and is based in Changchun, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changchun",
        "zipcode": "130031",
        "website": "http://www.ccjk600215.com",
        "market_cap": "Small Cap"
    },
    "600223.SS": {
        "short_name": "LUSHANG HEALTH INDUSTRY DEVELOP",
        "long_name": "Lushang Health Industry Development Co.,Ltd.",
        "summary": "Lushang Health Industry Development Co.,Ltd. operates as a real estate development company in China. It develops boutique houses, urban complexes, shopping malls, grade A office buildings, high-star hotels, and other projects. The company was formerly known as Lushang Property Co., Ltd. and changed its name to Lushang Health Industry Development Co.,Ltd. in June 2019. The company is based in Jinan, China. Lushang Health Industry Development Co.,Ltd. is a subsidiary of Shandong Commercial Group Co, Ltd.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": null,
        "website": "http://www.lshzy.com.cn",
        "market_cap": "Mid Cap"
    },
    "600225.SS": {
        "short_name": "TIANJIN SONGJIANG CO.  LTD",
        "long_name": "Tianjin Songjiang Co., Ltd.",
        "summary": "Tianjin Songjiang Co., Ltd. develops and sells real estate properties in China. The company is based in Tianjin, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300221",
        "website": "http://www.tjsjgf.com.cn",
        "market_cap": "Small Cap"
    },
    "600246.SS": {
        "short_name": "VANTONE NEO DEVELOPMENT GROUP C",
        "long_name": "Beijing Vantone Real Estate Co., Ltd.",
        "summary": "Beijing Vantone Real Estate Co., Ltd., together with its subsidiaries, engages in the development and sale of residential and commercial properties. It operates under the New Homeland Series, International Series, Washway Collection, Public Collection, and Wantong Center brand names primarily in Beijing, Tianjin, Shanghai, and Hangzhou in China. The company was formerly known as Beijing Vantone Pioneer Real Estate Co., Ltd and changed its name to Beijing Vantone Real Estate Co., Ltd. in 2007. Beijing Vantone Real Estate Co., Ltd. was founded in 1998 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100020",
        "website": "http://www.vantone.com",
        "market_cap": "Mid Cap"
    },
    "600325.SS": {
        "short_name": "HUAFA INDUSTRIAL CO LTD",
        "long_name": "Huafa Industrial Co.,Ltd.Zhuhai",
        "summary": "Huafa Industrial Co.,Ltd. Zhuhai operates as a real estate company in China. The company develops residential, commercial, tourism, land, and housing properties. It operates under the Hongjing Garden, Huafa New City, Huafa Century City, Huafa Shuijun, and Huasheng State Manor brand names. The company was founded in 1980 and is based in Zhuhai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": "519030",
        "website": "http://www.cnhuafas.com",
        "market_cap": "Mid Cap"
    },
    "600383.SS": {
        "short_name": "GEMDALE CORPORATION",
        "long_name": "Gemdale Corporation",
        "summary": "Gemdale Corporation engages in real estate business in China and internationally. The company engages in development, sale, and operation of residential and commercial properties, such as apartments, boutique residences, office buildings, commercial complexes, industrial parks, hotels, etc. It also engages in real estate financing; sports industry cluster operations, with a focus on tennis; property services and community operations; and provision of decoration products and services for residences. In addition, it offers agent construction services; and operates as K12 private bilingual international school. The company was founded in 1988 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518026",
        "website": "http://www.gemdale.com",
        "market_cap": "Mid Cap"
    },
    "600503.SS": {
        "short_name": "DELUXE FAMILY CO. LTD.",
        "long_name": "Deluxe Family Co., Ltd.",
        "summary": "Deluxe Family Co., Ltd. engages in the development and distribution of real estate properties in Shanghai and other Eastern China markets. The company develops and operates residential communities. It is also involved in the construction of green facilities and decoration engineering; and commercial investment, as well as the provision of investment consulting services. In addition, the company engages in the financial, bio-pharmaceuticals, new energy, environmental protection, and other equity investment operations. Deluxe Family Co., Ltd. was founded in 1994 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200336",
        "website": "http://www.deluxe-family.com",
        "market_cap": "Small Cap"
    },
    "600533.SS": {
        "short_name": "NANJING CHIXIA DEVELOPMENT",
        "long_name": "Nanjing Chixia Development Co., Ltd.",
        "summary": "Nanjing Chixia Development Co., Ltd. engages in the development of real estate properties in China. It is also involved in the development and construction of residential and office buildings, public buildings, and commercial housing projects; sale of commercial houses; leasing activities; planning, design, and construction of garden landscapes; and construction management activities. The company also offers after-sales services. The company was founded in 1984 and is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": null,
        "website": "http://www.chixia.com",
        "market_cap": "Small Cap"
    },
    "600639.SS": {
        "short_name": "SHANGHAI JINQIAO EXP PROCESS ZN",
        "long_name": "Shanghai Jinqiao Export Processing Zone Development Co., Ltd.",
        "summary": "Shanghai Jinqiao Export Processing Zone Development Co., Ltd. develops, invests in, and operates real estate properties in China. Its property portfolio comprises office and factory buildings, villas, and service apartments. The company was founded in 1992 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201206",
        "website": "http://www.shpdjq.com",
        "market_cap": "Small Cap"
    },
    "600641.SS": {
        "short_name": "SHANGHAI WANYE ENTERPRISES CO L",
        "long_name": "Shanghai Wanye Enterprises Co.,Ltd",
        "summary": "Shanghai Wanye Enterprises Co.,Ltd engages in the residential real estate development business. The company was founded in 1991 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200120",
        "website": "http://www.600641.com.cn",
        "market_cap": "Mid Cap"
    },
    "600647.SS": {
        "short_name": "SHANGHAI TONGDA VENTURE CAPITAL",
        "long_name": "Shanghai Tongda Venture Capital Co., Ltd.",
        "summary": "Shanghai Tongda Venture Capital Co., Ltd. engages in the real estate development business in China. It is also involved in equity investment, capital market operation, asset trading, financial non-performing asset disposal, industrial investment, asset management, and agriculture business. In addition, the company offers various financial services, such as securities, futures, funds, insurance, and trust. The company was formerly known as Shanghai New Asia Fast Food Co., Ltd. The company was founded in 1991 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200120",
        "website": "http://www.shtdcy.com",
        "market_cap": "Small Cap"
    },
    "600663.SS": {
        "short_name": "SHANGHAI LUJIAZUI FIN & TRADE Z",
        "long_name": "Shanghai Lujiazui Finance & Trade Zone Development Co., Ltd.",
        "summary": "Shanghai Lujiazui Finance & Trade Zone Development Co., Ltd. operates as a real estate company. The company develops, operates, sells, and leases real estate properties. Its property portfolio include office, research and development, residential, business, exhibition center, hotels, regional development, and charitable projects. The company was founded in 1992 and is based in Shanghai, China. Shanghai Lujiazui Finance & Trade Zone Development Co., Ltd. is a subsidiary of Shanghai Lujiazui Development (Group) Company Limited.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200126",
        "website": "http://www.ljz.com.cn",
        "market_cap": "Mid Cap"
    },
    "600684.SS": {
        "short_name": "GUANGZHOU PEARL RIVER INDUSTRIA",
        "long_name": "Guangzhou Pearl River Industrial Development Co., Ltd.",
        "summary": "Guangzhou Pearl River Industrial Development Co., Ltd. operates as a real estate development company in China. It engages in property investment, property management, and other businesses. The company develops, sells, and leases commercial and residential properties; develops office building, hotel, tourism, health, and other commercial real estate properties; and provides related after-sale services for office and supporting facilities. It also engages in the hotel management, wholesale and retail trading, parking lot management, venue rental, swimming pool and fitness room operation, and tourism businesses. The company was formerly known as Guangzhou Pearl River Real Estate Co. Guangzhou Pearl River Industrial Development Co., Ltd. was founded in 1985 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510031",
        "website": "http://www.gzzjsy.com",
        "market_cap": "Small Cap"
    },
    "600736.SS": {
        "short_name": "SUZHOU NEW DISTRICT HI TECH IND",
        "long_name": "Suzhou New District Hi-Tech Industrial Co.,Ltd",
        "summary": "Suzhou New District Hi-Tech Industrial Co.,Ltd engages in the real estate, environmental protection, manufacturing, tourism, and non-banking finance businesses in China. The company develops industrial, residential and commercial, and tourism properties; and researches, develops, and manufactures copper powder, copper-gold bars, gold inks, and other products for use in printing, dyeing, paint, coating, coloring plastics, and other industries. It also operates 5 wastewater treatment plants; 32 sewage pumping stations; and a network of 80km trunk pipeline. In addition, the company is involved in the investment, construction, operation, and management of distributed energy projects, as well as provision of technology development and related information consultation, etc.; and provision of environmental and reliability test equipment used in national defense, military, aerospace, aviation, marine, rail transit, automotive, electronics, and other areas. Further, it engages in the financial leasing, water supply, and thermal power generation businesses; and garden design and construction, landscape engineering construction, antique building construction, green maintenance, and seedlings research and development activities. The company was founded in 1994 and is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215163",
        "website": "http://www.sndnt.com",
        "market_cap": "Small Cap"
    },
    "600743.SS": {
        "short_name": "HUAYUAN PROPERTY CO LTD",
        "long_name": "Huayuan Property Co.,Ltd.",
        "summary": "Hua Yuan Property Co.,Ltd. engages in the development, operation, and management of real estate properties. The company is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100044",
        "website": "http://www.hy-online.com",
        "market_cap": "Small Cap"
    },
    "600766.SS": {
        "short_name": "YANTAI YUANCHENG GOLD CO LTD",
        "long_name": "YanTai Yuancheng Gold Co., Ltd.",
        "summary": "YanTai Yuancheng Gold Co., Ltd. primarily engages in real estate development and property management activities in China. The company specializes on the reconstruction of old town; and development of residential communities in the urban district in Yantai in Shandong province. It also engages in the wholesale and retail of commodities. The company was formerly known as YanTai Yuancheng Enterprise Group Co., Ltd. YanTai Yuancheng Gold Co., Ltd. is based in Yantai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yantai",
        "zipcode": "264000",
        "website": null,
        "market_cap": "Small Cap"
    },
    "600773.SS": {
        "short_name": "TIBET URBAN DEVELOPMENT AND INV",
        "long_name": "Tibet Urban Development and Investment Co.,LTD",
        "summary": "Tibet Urban Development and Investment Co.,LTD, together with its subsidiaries, develops, operates, manages, and sells real estate properties in China. The company engages in the renovation of old areas, commercial housing, villas, and office buildings, as well as housing development and leasing activities. It also offers property management services; real estate agency services; and secured loans, mortgage loans, credit loans, financing consultancy services, etc. In addition, the company operates and manages a hotel, Holiday Inn Express Shanghai North, and shopping parks; develops, constructs, and operates beach reclamation projects. Further, it develops and produces lithium carbonate, carbon nanotubes, potassium chloride, boron, and non-ferrous metal minerals; and engages in mining activities. Tibet Urban Development and Investment Co.,LTD was founded in 1996 and is headquartered in Lhasa, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lhasa",
        "zipcode": "850000",
        "website": "http://www.600773sh.com",
        "market_cap": "Small Cap"
    },
    "600807.SS": {
        "short_name": "JINAN HIGH-TECH DEVELOPMENT CO ",
        "long_name": "Jinan High-tech Development Co., Ltd.",
        "summary": "Jinan High-tech Development Co., Ltd., together with its subsidiaries, engages in real estate, mining, finance, venture capital, and other businesses in China. The company is involved in the development of residential, commercial, tourism, and education real estate properties. It also engages in prospecting, mining, and processing of a gold source tenement with a span of approximately 120 kilometers. In addition, the company is involved in finance activities; and venture capital business, including investment in primary market, equity, secondary market, and debt and non-performing asset disposition activities. Jinan High-tech Development Co., Ltd. is based in Jinan, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": "250102",
        "website": "http://www.tyanhome.com.cn",
        "market_cap": "Small Cap"
    },
    "600823.SS": {
        "short_name": "SHANGHAI SHIMAO CO LTD",
        "long_name": "Shanghai Shimao Co., Ltd.",
        "summary": "Shanghai Shimao Co., Ltd. engages in the commercial real estate development activities in China. It develops, operates, and sells residential and commercial real estate projects, as well as engages in the operation management of commercial complexes. The company was founded in 1994 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200120",
        "website": "http://www.shimaoco.com",
        "market_cap": "Mid Cap"
    },
    "600895.SS": {
        "short_name": "SHANGHAI ZHANGJIANG HI-TECH PAR",
        "long_name": "Shanghai Zhangjiang Hi-Tech Park Development Co., Ltd.",
        "summary": "Shanghai Zhangjiang Hi-Tech Park Development Co., Ltd., together with its subsidiaries, engages in the investment, development, management, and operation of real estate properties in the People's Republic of China. The company also invests in municipal infrastructure facilities, commercial high-tech projects, communication and information, and biomedicine sectors. In addition, it involves in the equipment supply and installation, distribution of building materials, warehousing investment, and provision of consulting services. The company was founded in 1996 and is based in Shanghai, the People's Republic of China. Shanghai Zhangjiang Hi-Tech Park Development Co., Ltd. operates as an investment arm of Shanghai Zhangjiang (Group) Co., Ltd.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201203",
        "website": "http://www.600895.com",
        "market_cap": "Mid Cap"
    },
    "601155.SS": {
        "short_name": "SEAZEN HOLDINGS CO LTD",
        "long_name": "Seazen Holdings Co., Ltd",
        "summary": "Seazen Holdings Co., Ltd engages in real estate development business in China. The company is involved in the development of urban complex projects and residential properties. It also provides business and commercial management services. The company was formerly known as Future Land Holdings Co., Ltd. The company was founded in 1993 and is headquartered in Shanghai, the People's Republic of China. Seazen Holdings Co., Ltd. is a subsidiary of Fuyu Development Co., Ltd.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200333",
        "website": "http://www.seazen.com.cn",
        "market_cap": "Large Cap"
    },
    "6111.HK": {
        "short_name": "DAFA PPT",
        "long_name": "DaFa Properties Group Limited",
        "summary": "DaFa Properties Group Limited, an investment holding company, operates as a real estate developer in the Yangtze River Delta Region in the People's Republic of China. The company is involved in the development and sale of residential properties; development, operation, and management of commercial and mixed-use properties; and provision of management consulting services. As of December 31, 2019, it had a portfolio of 69 projects consisting of 63 residential properties, two residential and commercial complexes, two commercial complexes, one office floor, and one residential and service apartment. DaFa Properties Group Limited was founded in 1996 and is headquartered in Shanghai, China. DaFa Properties Group Limited is a subsidiary of Splendid Sun Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201106",
        "website": "http://www.dafaland.com",
        "market_cap": "Small Cap"
    },
    "6158.HK": {
        "short_name": "ZHENRO PPT",
        "long_name": "Zhenro Properties Group Limited",
        "summary": "Zhenro Properties Group Limited, an investment holding company, engages in the property development, property leasing, and commercial property management business in the People's Republic of China. It develops residential properties; and develops, operates, and manages commercial and mixed-use properties. The company was founded in 1998 and is headquartered in Shanghai, China. Zhenro Properties Group Limited is a subsidiary of RoYue Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.zhenrodc.com",
        "market_cap": "Mid Cap"
    },
    "6166.HK": {
        "short_name": "CHINA VAST",
        "long_name": "China VAST Industrial Urban Development Company Limited",
        "summary": "China VAST Industrial Urban Development Company Limited, an investment holding company, plans, develops, and operates large-scale industrial town projects in the People's Republic of China. It operates through Industrial Towns Development, Property Development, and Property Leasing segments. The company develops residential, commercial, and industrial projects, including residence, apartment, villa, retail stores, and office buildings. It is also involved in the property leasing, infrastructure and project investment, consulting, asset management, and land infrastructure maintenance activities, as well as offers Internet information technology services. The company was founded in 1995 and is headquartered in Beijing, the People's Republic of China. China VAST Industrial Urban Development Company Limited is a subsidiary of Profit East Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://www.vastiud.com",
        "market_cap": "Small Cap"
    },
    "6677.HK": {
        "short_name": "SINO-OCEAN SERV",
        "long_name": "Sino-Ocean Service Holding Limited",
        "summary": "Sino-Ocean Service Holding Limited, an investment holding company, primarily offers property management services in the People's Republic of China. The company's property management services comprising security, cleaning, greening, gardening, and repair and maintenance services to property owners and residents, as well as property developers. Its property management portfolio covers residential and nonresidential properties, such as commercial properties comprising office buildings, shopping malls, and hotels; and public and other properties consisting of hospitals, public service facilities, government buildings, and schools. The company's value-added services, such as pre-delivery services to property developers to assist with their sales and marketing activities at property sales venues and display units; consultancy services to assist with the overall planning and management of pre-sale activities; and property engineering services. Its community value-added services include carpark management, utility management, and community space operation services; community living services, such as home decoration, purchase assistance, turnkey furnishing and move-in, housekeeping, and other bespoken services; and property brokerage services to property owners and residents of its managed properties. Sino-Ocean Service Holding Limited also offers information technology services. The company was founded in 1997 and is headquartered in Beijing, China. Sino-Ocean Service Holding Limited is a subsidiary of Shine Wind Development Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.sinooceanservice.com.cn",
        "market_cap": "Small Cap"
    },
    "6900.HK": {
        "short_name": "SUNKWAN PPT",
        "long_name": "Sunkwan Properties Group Limited",
        "summary": "Sunkwan Properties Group Limited, an investment holding company, engages in the property development and leasing activities in the People's Republic of China. It also provides project management services. The company was founded in 2010 and is headquartered in Shanghai, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.sunkwan.com.cn",
        "market_cap": "Small Cap"
    },
    "6968.HK": {
        "short_name": "GANGLONG CHINA",
        "long_name": "Ganglong China Property Group Limited",
        "summary": "Ganglong China Property Group Limited engages in the development and sale of residential properties in the People's Republic of China. Its property development projects include retail units, car parks, and ancillary areas. The company was founded in 2007 and is headquartered in Shanghai, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.glchina.group",
        "market_cap": "Small Cap"
    },
    "6CI.F": {
        "short_name": "CIFI HLDGS GRP CO.HD -,10",
        "long_name": "CIFI Holdings (Group) Co. Ltd.",
        "summary": "CIFI Holdings (Group) Co. Ltd., an investment holding company, invests in, develops, and manages properties in the People's Republic of China. The company operates through Sales of Properties; Property Investment; and Project Management and Other Property Related Services segments. It develops and sells office and commercial premises, and residential properties; leases investment properties; and offers project management and other property related services. The company also provides property construction and business management services. As of December 31, 2020, it had a land bank with total and attributable gross floor area of approximately 56.5 million square meters and 20.8 million square meters. CIFI Holdings (Group) Co. Ltd. was founded in 2000 and is headquartered in Shanghai, China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201106",
        "website": "http://www.cifi.com.cn",
        "market_cap": "Mid Cap"
    },
    "6FLA.F": {
        "short_name": "SEAZEN GROUP LTD. HD-,001",
        "long_name": "Seazen Group Limited",
        "summary": "Seazen Group Limited, together with its subsidiaries, engages in the investment, development, and sale of properties in the People's Republic of China. The company operates through two segments, A Share Company and Non-A Share Companies. It primarily develops and sells residential properties and mixed-use complexes, as well as provides commercial property management and other services. As of December 31, 2020, the company had total land bank of approximately 142,876,372 square meters. It also provides asset operation and management, marketing research, consulting, department store management, apartment leasing, information technology, and children entertainment, as well as hotel, and conference, and cinema management services. In addition, the company offers securities and future brokerage, book running, placing management, and money lending services, as well as dealing and advising services of securities. Further, it provides architecture designing service; and is involved in the maintenance and leasing energy equipment, as well as designs, manufactures, and sells auto parts. The company was formerly known as Future Land Development Holdings Limited and changed its name to Seazen Group Limited in November 2019. The company was founded in 1996 and is headquartered in Shanghai, the People's Republic of China. Seazen Group Limited is a subsidiary of Wealth Zone Hong Kong Investments Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.seazengroup.com.cn",
        "market_cap": "Mid Cap"
    },
    "8030.HK": {
        "short_name": "FLYING FIN",
        "long_name": "Flying Financial Service Holdings Limited",
        "summary": "Flying Financial Service Holdings Limited, an investment holding company, engages in the provision of financial services to property developers and real estate development activities in the People's Republic of China. It operates through four segments: Investment in Property Development Projects; Operation of Financial Services Platform; Provision of Entrusted Loan, Pawn Loan, Other Loan Services, and Financial Consultation Services; and Finance Lease Services. The company offers short-term and long-term loans and financial consultation services to borrowers and financial institutions. It also provides long-term finance lease services; investment income services; and operates a financial services platform. The company was founded in 2001 and is headquartered in Shenzhen, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.flyingfinancial.hk",
        "market_cap": "Small Cap"
    },
    "84R.F": {
        "short_name": "GLORY LAND CO.LTD HD-,001",
        "long_name": "Guorui Properties Limited",
        "summary": "Guorui Properties Limited, an investment holding company, primarily engages in the development of real estate properties in the People's Republic of China. The company operates through four segments: Property Development, Primary Land Construction and Development Services, Property Investment, and Property Management and Related Services. The Property Development segment develops and sells commercial and residential properties. The Primary Land Construction and Development Services segment provides primary land development services, including services for resettlement, and construction of land infrastructure and ancillary public facilities on land owned by the local governments. The Property Investment segment engages in the rental of investment properties. The Property Management and Related Services segment offers property management and related services. It primarily serves individual purchasers for residential properties, as well as various types of corporations and other business entities for commercial properties. The company was founded in 1994 and is headquartered in Beijing, China. Guorui Properties Limited operates as a subsidiary of Alltogether Land Company Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100062",
        "website": "http://www.glorypty.com",
        "market_cap": "Small Cap"
    },
    "8KI.F": {
        "short_name": "REDCO PRP GROUP LTD -,05",
        "long_name": "Redco Properties Group Limited",
        "summary": "Redco Properties Group Limited, an investment holding company, engages in the property development and investment activities in the People's Republic of China. The company operates through Greater Western Taiwan Straits Economic Zone; Central and Western Regions; Bohai Economic Rim; Greater Bay Area; and Others segments. It develops residential and commercial properties. The company is also involved in the provision of construction design and cost consulting, construction and sea reclamation, project management, and healthcare services; cultural product design consulting services; and culture, education, and sports activities. In addition, it provides property management and leasing, building decoration, telecommunication, trading, enterprise management, and software invention services. The company was founded in 1992 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.redco.cn",
        "market_cap": "Small Cap"
    },
    "8MG.F": {
        "short_name": "MINGFA GRP INTL CO. REG S",
        "long_name": "Mingfa Group (International) Co., Ltd.",
        "summary": "Mingfa Group (International) Company Limited, an investment holding company, engages in the property development and leasing, and hotel management businesses in the People's Republic of China. The company operates through three segments: Property Development, Hotel, and Property Investment and Management. The Property Development segment develops commercial and residential real estate properties. The Hotel segment is involved in the operation of hotels. The Property Investment and Management segment invests in properties; and offers management and security services to residential, hotel, and commercial properties. It is also involved in the manufacture and sale of furniture; trade of construction materials; and provision of sports, as well as consultancy services. The company was founded in 1994 and is headquartered in Nanjing, the People's Republic of China. Mingfa Group (International) Company Limited is a subsidiary of Galaxy Earnest Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210000",
        "website": "http://www.ming-fa.com",
        "market_cap": "Small Cap"
    },
    "900911.SS": {
        "short_name": "SHANGHAI JINQIAO EXP PROCESS ZN",
        "long_name": "Shanghai Jinqiao Export Processing Zone Development Co., Ltd.",
        "summary": "Shanghai Jinqiao Export Processing Zone Development Co., Ltd. develops, invests in, and operates real estate properties in China. Its property portfolio comprises office and factory buildings, villas, and service apartments. The company was founded in 1992 and is based in Shanghai, China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201206",
        "website": "http://www.shpdjq.com",
        "market_cap": "Large Cap"
    },
    "900932.SS": {
        "short_name": "SHANGHAI LUJIAZUI FIN & TRADE Z",
        "long_name": "Shanghai Lujiazui Finance & Trade Zone Development Co., Ltd.",
        "summary": "Shanghai Lujiazui Finance & Trade Zone Development Co., Ltd. operates as a real estate company. The company develops, operates, sells, and leases real estate properties. Its property portfolio include office, research and development, residential, business, exhibition center, hotels, regional development, and charitable projects. The company was founded in 1992 and is based in Shanghai, China. Shanghai Lujiazui Finance & Trade Zone Development Co., Ltd. is a subsidiary of Shanghai Lujiazui Development (Group) Company Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200126",
        "website": "http://www.ljz.com.cn",
        "market_cap": "Large Cap"
    },
    "900940.SS": {
        "short_name": "GREATTOWN HOLDINGS LTD",
        "long_name": "Greattown Holdings Ltd.",
        "summary": "Greattown Holdings Ltd. engages in the real estate development business in China. It develops residential, commercial complex, industrial park, tourism and cultural park, office building, and hotel properties. The company was founded in 1986 and is headquartered in Shanghai, China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201103",
        "website": "http://www.greattown.cn",
        "market_cap": "Mid Cap"
    },
    "9968.HK": {
        "short_name": "HUIJING HLDGS",
        "long_name": "Huijing Holdings Company Limited",
        "summary": "Huijing Holdings Company Limited, an investment holding company, engages in the property development and investment activities primarily in Mainland China. The company focuses on urban renewal projects covering residential, integrated, and industry-specific property projects. It develops residential properties, including townhouses, mansions, and villas, as well as commercial properties comprising retail outlets, shopping malls, offices, and hotels; and urban renewal projects. The company was founded in 2004 and is headquartered in Dongguan, the People's Republic of China. Huijing Holdings Company Limited is a subsidiary of Wui Ying Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": null,
        "website": "http://www.huijingholdings.com",
        "market_cap": "Small Cap"
    },
    "9993.HK": {
        "short_name": "RADIANCE HLDGS",
        "long_name": "Radiance Holdings (Group) Company Limited",
        "summary": "Radiance Holdings (Group) Company Limited operates as a real estate development company in China. The company develops and sells residential and commercial properties. It also engages in leasing commercial properties; and provision of management consulting services. Radiance Holdings (Group) Company Limited was founded in 1996 and is headquartered in Beijing, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100029",
        "website": "http://www.radiance.com.cn",
        "market_cap": "Mid Cap"
    },
    "9JW.F": {
        "short_name": "JINGRUI HLDGS LTD  DL-,01",
        "long_name": "Jingrui Holdings Limited",
        "summary": "Jingrui Holdings Limited, an investment holding company, engages in property development business in the People's Republic of China. It operates through Property Development Platform, Capital Platform, and All Other Platforms segments. The company develops residential and commercial properties. It also invests in office buildings and apartments; and provides management and security services to residential and commercial properties. In addition, the company is involved in building decoration engineering, urban infrastructure development, customized decoration, property land investment, hardware and building materials, and information technology businesses. Jingrui Holdings Limited was founded in 1993 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.jingruis.com",
        "market_cap": "Small Cap"
    },
    "A8P.F": {
        "short_name": "AGILE GRP HLDG.LTD.HD-,10",
        "long_name": "Agile Group Holdings Limited",
        "summary": "Agile Group Holdings Limited, an investment holding company, engages in the property development, property management, hotel operation, property investment, environmental protection, and other businesses in the People's Republic of China. As of December 31, 2020, the company had a land bank with a total gross floor area of 53.01 million square meters in 84 cities located in Southern China region, Eastern China region, Western China region, Central China region, Hainan and Yunnan region, Northeast China region, Northern China region, Hong Kong, and internationally. It also provides property management services including a gross floor area of 374.8 million square meters, as well as residential properties, rental apartments, schools, and clubhouses services. In addition, the company is involved in the operation of hotels, shopping malls, office buildings, and community retail malls. Further, it provides hazardous waste treatment, water treatment, domestic waste-to-energy, and solid waste treatment services; ecological landscape, decoration, design consulting, environmental protection, construction, and real estate construction management services. The company was formerly known as Agile Property Holdings Limited and changed its name to Agile Group Holdings Limited in July 2016. The company was incorporated in 2005 and is headquartered in Guangzhou, the People's Republic of China. Agile Group Holdings Limited is a subsidiary of Top Coast Investment Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510623",
        "website": "http://www.agile.com.cn",
        "market_cap": "Mid Cap"
    },
    "AGPYF": {
        "short_name": "AGILE GROUP HOLDING LTD",
        "long_name": "Agile Group Holdings Limited",
        "summary": "Agile Group Holdings Limited, an investment holding company, engages in the property development, property management, hotel operation, property investment, environmental protection, and other businesses in the People's Republic of China. As of December 31, 2020, the company had a land bank with a total gross floor area of 53.01 million square meters in 84 cities located in Southern China region, Eastern China region, Western China region, Central China region, Hainan and Yunnan region, Northeast China region, Northern China region, Hong Kong, and internationally. It also provides property management services including a gross floor area of 374.8 million square meters, as well as residential properties, rental apartments, schools, and clubhouses services. In addition, the company is involved in the operation of hotels, shopping malls, office buildings, and community retail malls. Further, it provides hazardous waste treatment, water treatment, domestic waste-to-energy, and solid waste treatment services; ecological landscape, decoration, design consulting, environmental protection, construction, and real estate construction management services. The company was formerly known as Agile Property Holdings Limited and changed its name to Agile Group Holdings Limited in July 2016. The company was incorporated in 2005 and is headquartered in Guangzhou, the People's Republic of China. Agile Group Holdings Limited is a subsidiary of Top Coast Investment Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510623",
        "website": "http://www.agile.com.cn",
        "market_cap": "Mid Cap"
    },
    "AGPYY": {
        "short_name": "AGILE GROUP HOLDING LTD",
        "long_name": "Agile Group Holdings Limited",
        "summary": "Agile Group Holdings Limited, an investment holding company, engages in the property development, property management, hotel operation, property investment, environmental protection, and other businesses in the People's Republic of China. As of December 31, 2020, the company had a land bank with a total gross floor area of 53.01 million square meters in 84 cities located in Southern China region, Eastern China region, Western China region, Central China region, Hainan and Yunnan region, Northeast China region, Northern China region, Hong Kong, and internationally. It also provides property management services including a gross floor area of 374.8 million square meters, as well as residential properties, rental apartments, schools, and clubhouses services. In addition, the company is involved in the operation of hotels, shopping malls, office buildings, and community retail malls. Further, it provides hazardous waste treatment, water treatment, domestic waste-to-energy, and solid waste treatment services; ecological landscape, decoration, design consulting, environmental protection, construction, and real estate construction management services. The company was formerly known as Agile Property Holdings Limited and changed its name to Agile Group Holdings Limited in July 2016. The company was incorporated in 2005 and is headquartered in Guangzhou, the People's Republic of China. Agile Group Holdings Limited is a subsidiary of Top Coast Investment Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510623",
        "website": "http://www.agile.com.cn",
        "market_cap": "Mid Cap"
    },
    "AJ5.F": {
        "short_name": "CENTRAL CH. REAL ESTATE",
        "long_name": "Central China Real Estate Limited",
        "summary": "Central China Real Estate Limited, an investment holding company, engages in the property development activities in the People's Republic of China. The company develops residential and commercial properties; leases properties; and operates hotel. It also provides project management services. The company was founded in 1992 and is based in Zhengzhou, the People's Republic of China. Central China Real Estate Limited is a subsidiary of Joy Bright Investments Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Zhengzhou",
        "zipcode": null,
        "website": "http://www.jianye.com.cn",
        "market_cap": "Small Cap"
    },
    "BEIJF": {
        "short_name": "BEIJING NORTH STAR CO",
        "long_name": "Beijing North Star Company Limited",
        "summary": "Beijing North Star Company Limited engages in the development and investment of properties and hotels in the People's Republic of China. It is involved in the property leasing, land and property development, property investment and management, and provision of food and beverage and trading services, as well as develops and sells residential units, apartments, villas, and offices and commercial buildings. The company also operates hotels, apartments, office buildings, restaurants, conference centers, and convention and exhibition centers. In addition, it provides multimedia information network development, system integration, software development, and investment management services; and hotel and restaurant management consulting services. Beijing North Star Company Limited was founded in 1997 and is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100101",
        "website": "http://www.beijingns.com.cn",
        "market_cap": "Small Cap"
    },
    "BEJ.F": {
        "short_name": "BEIJING CAP. LAND H  YC1",
        "long_name": "Beijing Capital Land Ltd.",
        "summary": "Beijing Capital Land Ltd., together with its subsidiaries, engages in the real estate development and investment activities in the People's Republic of China. It develops residences and office buildings, as well as land; and operates commercial real estate properties. The company also provides property consulting, management, and leasing. As of December 31, 2020, it had 16.83 million square meters of land bank and 13.02 million square meters of total ground area. The company was founded in 2002 and is headquartered in Beijing, the People's Republic of China. Beijing Capital Land Ltd. is a subsidiary of Beijing Capital Group Co., Ltd.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100037",
        "website": "http://www.bjcapitalland.com.cn",
        "market_cap": "Small Cap"
    },
    "BHD.SI": {
        "short_name": "China Mining",
        "long_name": "China Mining International Limited",
        "summary": "China Mining International Limited, an investment holding company, develops and sells commercial and residential properties in the People's Republic of China. It operates through Mining, Commercial and Residential Property Development, and Investment segments. The company also engages in the property investment and management activities. In addition, it invests in mining business; and engages in treasury investment activities, such as investment in financial products. The company was formerly known as Sunshine Holdings Limited and changed its name to China Mining International Limited in March 2012. China Mining International Limited was founded in 1999 and is based in Zhengzhou, the People's Republic of China.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "state": null,
        "city": "Zhengzhou",
        "zipcode": "450000",
        "website": "http://www.chinamining-international.com",
        "market_cap": "Small Cap"
    },
    "BJ3.F": {
        "short_name": "BEIJING NORTH STAR -H-YC1",
        "long_name": "Beijing North Star Company Limited",
        "summary": "Beijing North Star Company Limited engages in the development and investment of properties and hotels in the People's Republic of China. It is involved in the property leasing, land and property development, property investment and management, and provision of food and beverage and trading services, as well as develops and sells residential units, apartments, villas, and offices and commercial buildings. The company also operates hotels, apartments, office buildings, restaurants, conference centers, and convention and exhibition centers. In addition, it provides multimedia information network development, system integration, software development, and investment management services; and hotel and restaurant management consulting services. Beijing North Star Company Limited was founded in 1997 and is based in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100101",
        "website": "http://www.beijingns.com.cn",
        "market_cap": "Small Cap"
    },
    "C7B.F": {
        "short_name": "CHINA NEW CITY COMM.",
        "long_name": "China New City Commercial Development Limited",
        "summary": "China New City Commercial Development Limited, an investment holding company, engages in the commercial property development, leasing, and hotel operations in Mainland China. The company operates through four segments: Commercial Property Development, Property Rental, Hotel Operations, and Others. It develops, owns, operates, and sells integrated commercial complexes in sub-city centers of second-tier cities in the Yangtze River Delta region. The company also leases investment properties, including offices and shopping malls; and provides property, project, health, hospital, and theatre management services, as well as education development services. In addition, it owns and operates four hotels, which include the Holiday Inn Hangzhou Xiaoshan, Hangzhou Qiandao Lake Bright Resort Hotel, Ningbo Bright Hotel, and Huaibei Bright Hotel. The company was founded in 1997 and is headquartered in Hangzhou, the People's Republic of China. China New City Commercial Development Limited is a subsidiary of Ideal World Investments Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.chinanewcity.com.cn",
        "market_cap": "Small Cap"
    },
    "CHVKF": {
        "short_name": "CHINA VANKE CO. LTD",
        "long_name": "China Vanke Co., Ltd.",
        "summary": "China Vanke Co., Ltd., together with its subsidiaries, engages in the development and sale of properties in the Mainland China, Hong Kong, and internationally. The company operates through Property Development and Property Management segments. It develops residential buildings, commercial offices, and other ancillary facilities. The company also provides property management and related services to purchasers and tenants of its own developed residential properties, shopping arcades, and office buildings, as well as to properties developed by external property developers; and undertakes construction contracts. In addition, it is involved in logistics and warehousing, hotel and resort, education, and housing rental businesses. The company was incorporated in 1984 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518083",
        "website": "http://www.vanke.com",
        "market_cap": "Large Cap"
    },
    "CTRYF": {
        "short_name": "COUNTRY GARDEN HLDGS CO LTD",
        "long_name": "Country Garden Holdings Company Limited",
        "summary": "Country Garden Holdings Company Limited, an investment holding company, invests, develops, and constructs real estate properties primarily in Mainland China. The company operates through two segments, Property Development and Construction. It develops residential projects, such as townhouses and condos; and car-parks and retail shops. The company also develops, operates, and manages hotels. In addition, it researches and develops robot intelligence; develops electronic hardware and biomass energy; sells food; and provides interior decoration, landscape design, agriculture and animal husbandry, investment consulting, cultural activity planning, and real estate consulting services. Country Garden Holdings Company Limited was founded in 1992 and is headquartered in Foshan, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Foshan",
        "zipcode": "528312",
        "website": "http://www.countrygarden.com.cn",
        "market_cap": "Large Cap"
    },
    "CTRYY": {
        "short_name": "COUNTRY GARDEN HLDGS CO LTD",
        "long_name": "Country Garden Holdings Company Limited",
        "summary": "Country Garden Holdings Company Limited, an investment holding company, invests, develops, and constructs real estate properties primarily in Mainland China. The company operates through two segments, Property Development and Construction. It develops residential projects, such as townhouses and condos; and car-parks and retail shops. The company also develops, operates, and manages hotels. In addition, it researches and develops robot intelligence; develops electronic hardware and biomass energy; sells food; and provides interior decoration, landscape design, agriculture and animal husbandry, investment consulting, cultural activity planning, and real estate consulting services. Country Garden Holdings Company Limited was founded in 1992 and is headquartered in Foshan, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Foshan",
        "zipcode": "528312",
        "website": "http://www.countrygarden.com.cn",
        "market_cap": "Large Cap"
    },
    "DZJ.F": {
        "short_name": "COUNTRY GARDEN HLDGS CO.",
        "long_name": "Country Garden Holdings Company Limited",
        "summary": "Country Garden Holdings Company Limited, an investment holding company, invests, develops, and constructs real estate properties primarily in Mainland China. The company operates through two segments, Property Development and Construction. It develops residential projects, such as townhouses and condos; and car-parks and retail shops. The company also develops, operates, and manages hotels. In addition, it researches and develops robot intelligence; develops electronic hardware and biomass energy; sells food; and provides interior decoration, landscape design, agriculture and animal husbandry, investment consulting, cultural activity planning, and real estate consulting services. Country Garden Holdings Company Limited was founded in 1992 and is headquartered in Foshan, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Foshan",
        "zipcode": "528312",
        "website": "http://www.countrygarden.com.cn",
        "market_cap": "Large Cap"
    },
    "EGRNF": {
        "short_name": "CHINA EVERGRANDE GROUP",
        "long_name": "China Evergrande Group",
        "summary": "China Evergrande Group, an investment holding company, primarily engages in the property development business in the People's Republic of China. It operates through four segments: Property Development, Property Investment, Property Management, and Other Businesses. It is involved in the development of residential properties, as well as other businesses, including property investment, property management, property construction, new energy vehicle, hotel operation, finance, Internet, tourism, and health businesses. The company was formerly known as Evergrande Real Estate Group Limited and changed its name to China Evergrande Group in July 2016. China Evergrande Group was incorporated in 2006 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518054",
        "website": "http://www.evergrande.com",
        "market_cap": "Large Cap"
    },
    "EGRNY": {
        "short_name": "CHINA EVERGRANDE GROUP",
        "long_name": "China Evergrande Group",
        "summary": "China Evergrande Group, an investment holding company, primarily engages in the property development business in the People's Republic of China. It operates through four segments: Property Development, Property Investment, Property Management Services, and Other Businesses. It is involved in the development of residential properties, as well as other businesses, including property investment, property management, property construction, new energy vehicle, hotel operation, finance, Internet, cultural tourism, and health businesses. The company was formerly known as Evergrande Real Estate Group Limited and changed its name to China Evergrande Group in July 2016. China Evergrande Group was incorporated in 2006 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518054",
        "website": "http://www.evergrande.com",
        "market_cap": "Large Cap"
    },
    "EV1.F": {
        "short_name": "CHINA EVERGRANDE GROUP",
        "long_name": "China Evergrande Group",
        "summary": "China Evergrande Group, an investment holding company, primarily engages in the property development business in the People's Republic of China. It operates through four segments: Property Development, Property Investment, Property Management Services, and Other Businesses. It is involved in the development of residential properties, as well as other businesses, including property investment, property management, property construction, new energy vehicle, hotel operation, finance, Internet, cultural tourism, and health businesses. The company was formerly known as Evergrande Real Estate Group Limited and changed its name to China Evergrande Group in July 2016. China Evergrande Group was incorporated in 2006 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518054",
        "website": "http://www.evergrande.com",
        "market_cap": "Large Cap"
    },
    "EV1A.F": {
        "short_name": "CHINA EVERGRD.UNSP.ADR/25",
        "long_name": "China Evergrande Group",
        "summary": "China Evergrande Group, an investment holding company, primarily engages in the property development business in the People's Republic of China. It operates through four segments: Property Development, Property Investment, Property Management Services, and Other Businesses. It is involved in the development of residential properties, as well as other businesses, including property investment, property management, property construction, new energy vehicle, hotel operation, finance, internet, cultural tourism, and health businesses. The company was formerly known as Evergrande Real Estate Group Limited and changed its name to China Evergrande Group in July 2016. China Evergrande Group was incorporated in 2006 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518054",
        "website": "http://www.evergrande.com",
        "market_cap": "Large Cap"
    },
    "G5HA.F": {
        "short_name": "GUANGZHOU R+F PR. H CONS.",
        "long_name": "Guangzhou R&F Properties Co., Ltd.",
        "summary": "Guangzhou R&F Properties Co., Ltd., together with its subsidiaries, engages in the development and sale of residential and commercial properties in the People's Republic of China, Malaysia, Cambodia, Korea, the United Kingdom, and Australia. The company invests in and develops various properties, including hotels, office buildings, shopping malls, logistic parks, and other retail properties in Beijing, Guangzhou, and other cities. It is also involved in the operation and management of hotels; provides property management and leasing, and architectural and engineering design services, as well as marketing development services; and operates a construction company and football club. Guangzhou R&F Properties Co., Ltd. was founded in 1994 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510623",
        "website": "http://www.rfchina.com",
        "market_cap": "Mid Cap"
    },
    "G7C.F": {
        "short_name": "GREENTOWN CHINA  HD -,10",
        "long_name": "Greentown China Holdings Limited",
        "summary": "Greentown China Holdings Limited, an investment holding company, engages in the property development and related business in China. It operates through Property Development, Hotel Operations, Property Investment, and Project Management segments. The company develops and sells residential properties. It also offers investment and asset management; project management; technology research and development; and design and decoration services. In addition, the company operates hotels; and invests in and rents properties, as well as sells construction materials. As of December 31, 2020, its land bank comprised a total gross floor area of approximately 50.79 million square meters. The company was founded in 1995 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310007",
        "website": "http://www.chinagreentown.com",
        "market_cap": "Mid Cap"
    },
    "GZUHY": {
        "short_name": "GUANGZHOU R&F PROPERTIES",
        "long_name": "Guangzhou R&F Properties Co., Ltd.",
        "summary": "Guangzhou R&F Properties Co., Ltd., together with its subsidiaries, engages in the development and sale of residential and commercial properties in the People's Republic of China, Malaysia, Cambodia, Korea, the United Kingdom, and Australia. The company invests in and develops various properties, including hotels, office buildings, shopping malls, logistic parks, and other retail properties in Beijing, Guangzhou, and other cities. It is also involved in the operation and management of hotels; provides property management and leasing, and architectural and engineering design services, as well as marketing development services; and operates a construction company and football club. Guangzhou R&F Properties Co., Ltd. was founded in 1994 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510623",
        "website": "http://www.rfchina.com",
        "market_cap": "Mid Cap"
    },
    "HGSH": {
        "short_name": "China HGS Real Estate, Inc.",
        "long_name": "China HGS Real Estate Inc.",
        "summary": "China HGS Real Estate Inc., through its subsidiaries, develops real estate properties in mainland China. It engages in the construction and sale of residential apartments, parking lots, and commercial properties. The company also develops multi-layer, sub-high-rise, and high-rise apartment buildings, as well as office buildings. Its development activity includes land acquisition, project planning, design and construction management, sales and marketing, and property management. The company was founded in 1995 and is headquartered in Hanzhong, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Hanzhong",
        "zipcode": "723000",
        "website": "http://www.chinahgs.com",
        "market_cap": "Small Cap"
    },
    "JT9.MU": {
        "short_name": "QMD INTERNATIONAL HLDGS",
        "long_name": "Euro Asia Premier Real Estate Company Limited",
        "summary": "Euro Asia Premier Real Estate Company Limited, through its subsidiaries, develops real estate projects in Shandong, the People's Republic of China. Its real estate projects include townhouses, training and exhibition centers, apartments, agricultural machinery markets, hotels, buildings, and estates. The company was formerly known as Pereamus Limited and changed its name to Euro Asia Premier Real Estate Company Limited in July 2009. Euro Asia Premier Real Estate Company Limited was incorporated in 2006 and is based in Weifang, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Weifang",
        "zipcode": null,
        "website": "http://www.eu-asia.net",
        "market_cap": "Small Cap"
    },
    "K1Q.F": {
        "short_name": "KASEN INTL HLDGS DL-00015",
        "long_name": "Kasen International Holdings Limited",
        "summary": "Kasen International Holdings Limited, an investment holding company, manufactures and sells upholstered furniture in the United States, the People's Republic of China, Europe, and internationally. It operates through Manufacturing, Properties Development, and Others segments. The company produces and sells sofas, dining chairs, and other furniture products; and glass fiber reinforced plastic products. It also develops properties; operates resorts; and provides property management and tourism resort-related services. In addition, the company engages in the operation of a restaurant and hotel, waterpark, and provision of travel-related services; wood processing activities; and trading of leather products, as well as paper making business. Kasen International Holdings Limited was founded in 1995 and is headquartered in Haining, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Haining",
        "zipcode": "314400",
        "website": "http://www.kasen.com.cn",
        "market_cap": "Small Cap"
    },
    "KOU.F": {
        "short_name": "KWG GROUP HOLDINGS HD-,10",
        "long_name": "KWG Group Holdings Limited",
        "summary": "KWG Group Holdings Limited, an investment holding company, engages in the investment, development, and sale of real estate properties. The company operates through three segments: Property Development, Property Investment, and Hotel Operation. Its property portfolio includes mid- to high-end residential properties, serviced apartments, villas, offices, hotels, and shopping malls. It also operates hotels. The company was formerly known as KWG Property Holding Limited and changed its name to KWG Group Holdings Limited in August 2018. KWG Group Holdings Limited was founded in 1995 and is headquartered in Guangzhou, China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510623",
        "website": "http://www.kwggroupholdings.com",
        "market_cap": "Mid Cap"
    },
    "LGFRY": {
        "short_name": "LONGFOR GROUP HLDGS LTD",
        "long_name": "Longfor Group Holdings Limited",
        "summary": "Longfor Group Holdings Limited, an investment holding company, engages in property development, investment, and management businesses in the People's Republic of China. It operates through Property Development; Property Investment; and Property Management and Related Services and Others segments. The Property Development segment develops and sells office and commercial premises, and residential properties. The Property Investment segment leases investment properties, including shopping malls and rental housing. The Property Management and Related Services and Others segment provides property management and related services, as well as hotel operation and other services. The company was formerly known as Longfor Properties Co. Ltd. and changed its name to Longfor Group Holdings Limited in June 2018. Longfor Group Holdings Limited was founded in 1993 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.longfor.com",
        "market_cap": "Large Cap"
    },
    "OL5.F": {
        "short_name": "SHUI ON LAND LTD  DL-0025",
        "long_name": "Shui On Land Limited",
        "summary": "Shui On Land Limited, an investment holding company, develops and sells properties in the Chinese Mainland. It operates through three segments: Property Development, Property Investment, and Construction. The Property Development segment develops and sells properties, such as residential, office, retail, entertainment, and cultural properties. The Property Investment segment leases offices and commercial/mall properties; provides property management services; and operates hotels. The Construction segment engages in the construction, interior fitting-out, renovation, and maintenance of building premises, as well as the provision of related consultancy services. The company also engages in the development of science and technology; and retail business. In addition, it provides business and hotel management, food and beverage, management, secretarial, education and business information consultancy, cultural diffusion, debt financing, construction, electronic commerce, and decoration services. The company was founded in 2004 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200021",
        "website": "http://www.shuionland.com",
        "market_cap": "Small Cap"
    },
    "PW5.F": {
        "short_name": "POWERLONG RL EST.H.HD-,01",
        "long_name": "Powerlong Real Estate Holdings Limited",
        "summary": "Powerlong Real Estate Holdings Limited, an investment holding company, invests in, develops, operates, and manages commercial real estate projects in the People's Republic of China. The company operates through four segments: Property Development, Property Investment, Commercial Operation and Residential Property Management, and Other Property Development Related Businesses. It develops large-scale commercial and residential properties. The company also operates hotels; and provides residential property management services, as well as construction and decoration services. As of December 31, 2020, it developed, owned, and operated 193 property development projects; operated investment properties, primarily shopping malls with a total gross floor area (GFA) of approximately 5,076,029 square meters; had a land bank with a total GFA of 36.5 million square meters; and owned and managed eight international branded hotels and eleven self-owned branded chain hotels. The company was incorporated in 2007 and is based in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201101",
        "website": "http://www.powerlong.com",
        "market_cap": "Mid Cap"
    },
    "QFRA.F": {
        "short_name": "GREENLAND HK HLDGS HD-,50",
        "long_name": "Greenland Hong Kong Holdings Limited",
        "summary": "Greenland Hong Kong Holdings Limited, an investment holding company, engages in the property development, property and hotel investment, and property management businesses in the People's Republic of China. It operates through four segments: Sales of Properties and Construction Management Service; Lease of Properties; Hotel and Related Services; and Property Management and Other Services. The Sales of Properties and Construction Management Service segment develops and sells residential properties, as well as provides construction management services. The Lease of Properties segment leases commercial and residential properties. The Hotel and Related Services segment operates hotels and service apartments. The Property Management and Other Services segment offers property management and other services to customers and group companies. Greenland Hong Kong Holdings Limited also provides construction and decoration, investing and management consulting, financing, and commercial management services, as well as nutrition and health counseling services; and software development services. The company was formerly known as SPG Land (Holdings) Limited and changed its name to Greenland Hong Kong Holdings Limited in August 2013. The company was founded in 1992 and is based in Shanghai, China. Greenland Hong Kong Holdings Limited is a subsidiary of Gluon Xima International Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.greenlandhk.com",
        "market_cap": "Small Cap"
    },
    "RDH.F": {
        "short_name": "RADIANCE HLDGS GRP.HD-,01",
        "long_name": "Radiance Holdings (Group) Company Limited",
        "summary": "Radiance Holdings (Group) Company Limited operates as a real estate development company in China. The company develops and sells residential and commercial properties. It also engages in leasing commercial properties; and provision of management consulting services. Radiance Holdings (Group) Company Limited was founded in 1996 and is headquartered in Beijing, China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100029",
        "website": "http://www.radiance.com.cn",
        "market_cap": "Mid Cap"
    },
    "RDH.MU": {
        "short_name": "RADIANCE HLDGS GRP.HD-,01",
        "long_name": "Radiance Holdings (Group) Company Limited",
        "summary": "Radiance Holdings (Group) Company Limited operates as a real estate development company in China. The company develops and sells residential and commercial properties. It also engages in leasing commercial properties; and provision of management consulting services. Radiance Holdings (Group) Company Limited was founded in 1996 and is headquartered in Beijing, China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100029",
        "website": "http://www.radiance.com.cn",
        "market_cap": "Mid Cap"
    },
    "RE9.F": {
        "short_name": "SKYFAME REA.HLDGS-0,00333",
        "long_name": "Skyfame Realty (Holdings) Limited",
        "summary": "Skyfame Realty (Holdings) Limited, an investment holding company, engages in the property development, investment, and management activities in the People's Republic of China. The company develops a range of properties, such as residential and commercial properties, offices, serviced apartments, and hotels. It is also involved in provision of services in the youth community development projects; operation of a hospital; and technology operating services activities. The company was incorporated in 1993 and is headquartered in Guangzhou, China. Skyfame Realty (Holdings) Limited is a subsidiary of Cosmos Tianyu Holdings Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510060",
        "website": "http://www.skyfame.com.cn",
        "market_cap": "Small Cap"
    },
    "RLF.F": {
        "short_name": "LONGFOR GR.HLD.REGS HD-10",
        "long_name": "Longfor Group Holdings Limited",
        "summary": "Longfor Group Holdings Limited, an investment holding company, engages in property development, investment, and management businesses in the People's Republic of China. It operates through Property Development; Property Investment; and Property Management and Related Services and Others segments. The Property Development segment develops and sells office and commercial premises, and residential properties. The Property Investment segment leases investment properties, including shopping malls and rental housing. The Property Management and Related Services and Others segment provides property management and related services, as well as hotel operation and other services. The company was formerly known as Longfor Properties Co. Ltd. and changed its name to Longfor Group Holdings Limited in June 2018. Longfor Group Holdings Limited was founded in 1993 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.longfor.com",
        "market_cap": "Large Cap"
    },
    "SCNR.F": {
        "short_name": "SUNAC CHINA REG.S HD -,01",
        "long_name": "Sunac China Holdings Limited",
        "summary": "Sunac China Holdings Limited, together with its subsidiaries, invests in, develops, and sells residential and commercial properties in the People's Republic of China. The company provides conferences and exhibitions, tourism and vacations, theme parks, hotel operations, medical and health care, IP development and operation, and film and television content production and distribution services. It is also involved in property services, commercial operations, property management, fitting and decoration, and cultural and tourism city construction and operation activities. The company was founded in 2003 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100007",
        "website": "http://www.sunac.com.cn",
        "market_cap": "Large Cap"
    },
    "SI0.F": {
        "short_name": "SINIC HLDGS (GROUP)CO.LTD",
        "long_name": "Sinic Holdings (Group) Company Limited",
        "summary": "Sinic Holdings (Group) Company Limited, an investment holding company, engages in the property development and leasing activities in the People's Republic of China. The company develops and sells residential and commercial properties. It also develops, operates, and manages commercial properties, including shopping centers, apartments, and office buildings, as well as manages hotels; and provides project consulting services to independent third parties. The company was founded in 2010 and is headquartered in Shanghai, the People's Republic of China. Sinic Holdings (Group) Company Limited is a subsidiary of Sinic Holdings Group Company Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.sinicdc.com",
        "market_cap": "Small Cap"
    },
    "SOLLY": {
        "short_name": "SHUI ON LAND LIMITED",
        "long_name": "Shui On Land Limited",
        "summary": "Shui On Land Limited, an investment holding company, develops and sells properties in the Chinese Mainland. It operates through three segments: Property Development, Property Investment, and Construction. The Property Development segment develops and sells properties, such as residential, office, retail, entertainment, and cultural properties. The Property Investment segment leases offices and commercial/mall properties; provides property management services; and operates hotels. The Construction segment engages in the construction, interior fitting-out, renovation, and maintenance of building premises, as well as the provision of related consultancy services. The company also engages in the development of science and technology; and retail business. In addition, it provides business and hotel management, food and beverage, management, secretarial, education and business information consultancy, cultural diffusion, debt financing, construction, electronic commerce, and decoration services. The company was founded in 2004 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200021",
        "website": "http://www.shuionland.com",
        "market_cap": "Small Cap"
    },
    "SRRE": {
        "short_name": "SUNRISE REAL ESTATE GROUP INC",
        "long_name": "Sunrise Real Estate Group, Inc.",
        "summary": "Sunrise Real Estate Group, Inc., together with its subsidiaries, provides real estate development and property brokerage services in the People's Republic of China. It offers real estate marketing, property leasing, and property management services. The company also engages in real estate agency sales and real estate investment activities. In addition, it offers entity investment, fund management, and financial services. The company was formerly known as Sunrise Real Estate Development Group, Inc. and changed its name to Sunrise Real Estate Group, Inc. in May 2006. Sunrise Real Estate Group, Inc. was founded in 1996 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201702",
        "website": "http://www.sunrise.sh",
        "market_cap": "Small Cap"
    },
    "XIN": {
        "short_name": "Xinyuan Real Estate Co Ltd",
        "long_name": "Xinyuan Real Estate Co., Ltd.",
        "summary": "Xinyuan Real Estate Co., Ltd., together with its subsidiaries, engages in residential real estate development in the People's Republic of China, the United States, and internationally. It develops residential projects, such as multi-layer apartment buildings, sub-high-rise apartment buildings, high-rise apartment buildings; and auxiliary services and amenities, such as retail outlets, leisure and health facilities, kindergartens, and schools, as well as office, mixed-use, and commercial properties. The company also acquires development sites through public auctions of government land and direct negotiations. In addition, it provides property management services for its developments and other real estate-related services. Further, the company offers landscaping engineering and management, real estate consulting and marketing, leasing management, management consulting, and technical services; operates retail stores; and installs intercom systems. Xinyuan Real Estate Co., Ltd. was founded in 1997 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100025",
        "website": "http://www.xyre.com",
        "market_cap": "Small Cap"
    },
    "XSA.F": {
        "short_name": "XIWANG PPTY HLDGS  HD-,10",
        "long_name": "Xiwang Property Holdings Company Limited",
        "summary": "Xiwang Property Holdings Company Limited, together with its subsidiaries, develops properties in the People's Republic of China. The company develops residential and commercial projects. It also invests in properties, and trades in construction materials. The company was formerly known as Xiwang Sugar Holdings Company Limited and changed its name to Xiwang Property Holdings Company Limited in August 2013. The company was founded in 2001 and is headquartered in Zouping, the People's Republic of China. Xiwang Property Holdings Company Limited is a subsidiary of Xiwang Investment Company Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Zouping",
        "zipcode": "256209",
        "website": "http://www.xiwangproperty.com",
        "market_cap": "Small Cap"
    },
    "YC2.F": {
        "short_name": "YIDA CHINA HLDGS  DL -,01",
        "long_name": "Yida China Holdings Limited",
        "summary": "Yida China Holdings Limited, an investment holding company, develops and operates business parks in the People's Republic of China. The company's Property Development segment develops and sells properties. Its Property Investment segment invests in and rents properties. The company's Business Park Operation and Management segment provides operation and management services to the business park projects owned by the local governments or other independent third parties. Its Construction, Decoration and Landscaping segment engages in property construction business; and the provision of interior decoration services to property buyers, as well as landscaping services to property projects. The company's Property Management segment provides management services to properties. Yida China Holdings Limited's property portfolio includes multifunctional integrated residential community projects, office properties, and residential properties. Yida China Holdings Limited was founded in 1988 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.yidachina.com.cn",
        "market_cap": "Small Cap"
    },
    "YP9.F": {
        "short_name": "YUZHOU GR.HLDG.REGS HD-10",
        "long_name": "Yuzhou Group Holdings Company Limited",
        "summary": "Yuzhou Group Holdings Company Limited, an investment holding company, engages in the property development activities in the People's Republic of China. It develops, sells, manages, and invests in properties. The company is also involved in the operation of hotels; marketing activities; and trading of construction materials. The company was formerly known as Yuzhou Properties Company Limited and changed its name to Yuzhou Group Holdings Company Limited in June 2020. Yuzhou Group Holdings Company Limited was founded in 1994 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.yuzhou-group.com",
        "market_cap": "Small Cap"
    }
}