{
    "000632.SZ": {
        "short_name": "FUJIAN SANMU GROUP",
        "long_name": "Fujian Sanmu Group Co., Ltd.",
        "summary": "Fujian Sanmu Group Co., Ltd. engages in the import and export trade business in China. It is also involved in the real estate development; and commercial tourism asset operation. The company is based in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": "350005",
        "website": "http://www.san-mu.com",
        "market_cap": "Micro Cap"
    },
    "000736.SZ": {
        "short_name": "CCCG REAL ESTATE C",
        "long_name": "CCCG Real Estate Corporation Limited",
        "summary": "CCCG Real Estate Corporation Limited engages in the development, operation, and sale of real estate properties in China. It operates through Real Estate Development and Sales, and Property and Leasing segments. It develops various residential and commercial real estate projects, as well as offers property leasing services. The company was formerly known as China Real Estate Corporation Limited and changed its name to CCCG Real Estate Corporation Limited in October 2017. The company was founded in 1993 and is based in Chongqing, China. CCCG Real Estate Corporation Limited is a subsidiary of CCCC Real Estate Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "401147",
        "website": null,
        "market_cap": "Small Cap"
    },
    "002314.SZ": {
        "short_name": "SHENZHEN NEW NANSH",
        "long_name": "Shenzhen New Nanshan Holding (Group) Co., Ltd.",
        "summary": "Shenzhen New Nanshan Holding (Group) Co., Ltd. manufactures, sells, and operates prefabricated buildings in China. The company's products include Tetris Space buildings, Flat-Pack modular products, Easy House, Yahgee Domus, containers, and PREKIT eco-friendly products, as well as accessories, such as portal frame structures, foldable sheds, mini sheds and removable fences, construction sites, events, scene spots, and others. It sells its products to approximately 100 countries and areas. The company was formerly known as Yahgee Modular House Co., Ltd. and changed its name to Shenzhen New Nanshan Holding (Group) Co., Ltd. in November 2015. The company was founded in 2001 and is headquartered in Shenzhen, China. Shenzhen New Nanshan Holding (Group) Co., Ltd. is a subsidiary of China Nanshan Development (Group) Incorporation.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.yahgee.com",
        "market_cap": "Small Cap"
    },
    "1153.HK": {
        "short_name": "JIAYUAN SER",
        "long_name": "Jiayuan Services Holdings Limited",
        "summary": "Jiayuan Services Holdings Limited operates as a property management service provider in Zhejiang province, the Peoples Republic of China. Its services primarily include property management services to property developers, property owners, and residents, primarily comprising cleaning, security, gardening and landscaping, and repair and maintenance services; value-added services to non-property owners, primarily comprising sales management services, preliminary planning and design consultancy services, pre-delivery cleaning and inspection services, car park sales assistance services, and other customized services; and community value-added services to property owners and residents, primarily comprising home-living services, common area value-added services, and car park leasing assistance services, as well as sells groceries to property owners. The company was founded in 2004 and is headquartered in Jiaxing, the Peoples Republic of China. Jiayuan Services Holdings Limited(SEHK:1153) operates independently of Jiayuan International Group Limited as of December 9, 2020.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Jiaxing",
        "zipcode": null,
        "website": "http://jy-fw.cn",
        "market_cap": "Small Cap"
    },
    "1427.HK": {
        "short_name": "CH TIANBAO GP",
        "long_name": "China Tianbao Group Development Company Limited",
        "summary": "China Tianbao Group Development Company Limited operates as a property developer and construction company in the People's Republic of China. The company operates through two segments, Property Development and Construction Contracting. The Construction Contracting segment provides construction contracting services primarily as a general contractor for building construction projects; and infrastructure construction projects, such as urban roads, bridges, facilities for water supply and treatment, urban pipelines, city squares, and street lighting. It also undertakes industrial and commercial construction projects comprising steel structure, landscaping for gardens, industrial construction, and preservation of antiquities and historical buildings. This segment serves property developers and local government entities. The Property Development segment develops and sells residential properties, as well as leases and operates investment property. The company was founded in 1998 and is headquartered in Zhuozhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Zhuozhou",
        "zipcode": null,
        "website": "http://www.chinatbjt.com",
        "market_cap": "Small Cap"
    },
    "1777.HK": {
        "short_name": "FANTASIA",
        "long_name": "Fantasia Holdings Group Co., Limited",
        "summary": "Fantasia Holdings Group Co., Limited, an investment holding company, invests in, develops, sells, and leases commercial and residential properties primarily in the People's Republic of China. It operates through six segments: Property Development, Property Investment, Property Agency Services, Property Operation Services, Hotel Operation, and Others. The company engages in the development of urban complexes, upscale boutique residences, and mid-to-high end residence projects; the provision of hotel accommodation, property management, value-added, engineering, and travel agency services; and manufacture and sale of fuel pumps. It also provides community services through online platform; and wealth management, finance lease, petty loans, P2P, funds and factoring, consumer finance, insurance, payment services, etc. for enterprises and individuals, as well as operates and manages various city complexes, shopping centers, etc. In addition, the company operates golfs, high-end city clubs, private clubs, theme parks, art museums, etc.; and develops various home-based care service stations, daytime care centers, and senior citizen apartments, which provide home care, health care, rehabilitation therapy, nutrition catering, and spiritual solace, as well as education services. The company was founded in 1996 and is headquartered in Shenzhen, the People's Republic of China. Fantasia Holdings Group Co., Limited is a subsidiary of Fantasy Pearl International Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518048",
        "website": "http://www.cnfantasia.com",
        "market_cap": "Small Cap"
    },
    "2379.HK": {
        "short_name": "ZHONGTIAN INT'L",
        "long_name": "Zhongtian International Limited",
        "summary": "Zhongtian International Limited, an investment holding company, invests in, develops, and leases commercial properties in the People's Republic of China. The company operates through Property, Financial Service, and Renovation Service segments. It also sells intelligent electronic products, and furniture and fixtures; and provides financing and procurement, and renovation services. The company was incorporated in 2003 and is headquartered in Qingdao, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Qingdao",
        "zipcode": null,
        "website": null,
        "market_cap": "Nano Cap"
    },
    "2599.HK": {
        "short_name": "SHINSUN HOLD GP",
        "long_name": "Shinsun Holdings (Group) Co., Ltd.",
        "summary": "Shinsun Holdings (Group) Co., Ltd., an investment holding company, engages in the development and selling of properties in the People's Republic of China. It operates through four segments: Property Development, Property Leasing, Hotel Operations, and Provision of Property Management Services. The company focusing on the development of residential properties. It is also involved in cultural tourism; hotel management; and wholesale and retail business. The company was incorporated in 2019 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201106",
        "website": "http://www.shinsunholdings.com",
        "market_cap": "Mid Cap"
    },
    "5Y8.F": {
        "short_name": "SHINSUN HLDGS GRP. DL-,01",
        "long_name": "Shinsun Holdings (Group) Co., Ltd.",
        "summary": "Shinsun Holdings (Group) Co., Ltd., an investment holding company, engages in the development and selling of properties in the People's Republic of China. It operates through four segments: Property Development, Property Leasing, Hotel Operations, and Provision of Property Management Services. The company focusing on the development of residential properties. It is also involved in cultural tourism; hotel management; and wholesale and retail business. The company was incorporated in 2019 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201106",
        "website": "http://www.shinsunholdings.com",
        "market_cap": "Mid Cap"
    },
    "600077.SS": {
        "short_name": "SUNDY LAND INVESTMENT CO LTD",
        "long_name": "Sundy Land Investment Co., Ltd.",
        "summary": "Sundy Land Investment Co., Ltd. operates as a real estate development company in China. The company's product line comprises various property types, including apartments, high-end villas, and rough and fine houses. Sundy Land Investment Co., Ltd. was founded in 1984 and is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310016",
        "website": "http://www.songdu.com",
        "market_cap": "Small Cap"
    },
    "600515.SS": {
        "short_name": "HAINAN HNA INFRASTRUCTURE INVES",
        "long_name": "HNA Infrastructure Investment Group Co., LTD",
        "summary": "HNA Infrastructure Investment Group Co., LTD engages in the development and management of infrastructure, real estate, and urban complex projects. The company develops, constructs, and manages urban complexes and tourism scenic areas. It is also involved in the investment, engineering, construction, operation, and management of airports; construction of offshore projects; operation and management of hotel; and duty-free business. In addition, the company provides EPC general contracting and management; and professional consulting services. HNA Infrastructure Investment Group Co., LTD is based in Haikou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Haikou",
        "zipcode": null,
        "website": "http://www.hnainfrastructure.com",
        "market_cap": "Mid Cap"
    },
    "600622.SS": {
        "short_name": "EVERBRIGHT JIABAO CO LTD",
        "long_name": "Everbright JiabaoCo.,Ltd.",
        "summary": "Everbright JiabaoCo.,Ltd. primarily develops real estate properties in China. The company also manages real estate properties, such as commercial, complex, office, residential, and industrial real estate properties. In addition, it provides electric light sources and nuclear power materials for rare metal forgings. Everbright JiabaoCo.,Ltd. is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201800",
        "website": "http://www.jbjt.com",
        "market_cap": "Small Cap"
    },
    "6666.HK": {
        "short_name": "EVERG SERVICES",
        "long_name": "Evergrande Property Services Group Limited",
        "summary": "Evergrande Property Services Group Limited, an investment holding company, provides property management services in the People's Republic of China. The company manages a portfolio of properties, including mid- to high-end residential properties, offices buildings, commercial properties, theme and industrial parks, healthcare complexes, themed towns, schools, etc. It offers property management services, including butler, security, cleaning and greening, and repair and maintenance services to residents, property developers, and tenants of non-residential properties. The company also provides value-added services, such as preliminary property management services comprising construction site and sales office management, and consulting services; pre-delivery services consisting of properties cleaning and inspecting; properties repair and maintenance services; and property transaction assistance services to non-property owners. In addition, it offers community value-added services that include community operation services, including group purchase activities, community space operations, etc.; community assets management services that include parking space leasing, real estate agency, sports and entertainment complex operation, etc.; and community living services, such as housekeeping, home renovation, etc., as well as recreation center operations services. The company was founded in 1997 and is headquartered in Guangzhou, the People's Republic of China. Evergrande Property Services Group Limited is a subsidiary of CEG Holdings (BVI) Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "518000",
        "website": "http://www.evergrandeservice.com",
        "market_cap": "Large Cap"
    },
    "BCD.SI": {
        "short_name": "China Yuanbang",
        "long_name": "China Yuanbang Property Holdings Limited",
        "summary": "China Yuanbang Property Holdings Limited, an investment holding company, develops, manages, markets, and sells residential and commercial properties in the People's Republic of China. It is also involved in the tourism and resorts development operations; hotel business; agricultural tourism operations; and property investment activities. The company targets the middle to upper-middle income market segments. China Yuanbang Property Holdings Limited was incorporated in 2006 and is based in Guangzhou, China.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510430",
        "website": "http://www.yuanbang.com",
        "market_cap": "Nano Cap"
    },
    "FT7.F": {
        "short_name": "FANTASIA H.G.C.REGS HD-10",
        "long_name": "Fantasia Holdings Group Co., Limited",
        "summary": "Fantasia Holdings Group Co., Limited, an investment holding company, invests in, develops, sells, and leases commercial and residential properties primarily in the People's Republic of China. It operates through six segments: Property Development, Property Investment, Property Agency Services, Property Operation Services, Hotel Operation, and Others. The company engages in the development of urban complexes, upscale boutique residences, and mid-to-high end residence projects; the provision of hotel accommodation, property management, value-added, engineering, and travel agency services; and manufacture and sale of fuel pumps. It also provides community services through online platform; and wealth management, finance lease, petty loans, P2P, funds and factoring, consumer finance, insurance, payment services, etc. for enterprises and individuals, as well as operates and manages various city complexes, shopping centers, etc. In addition, the company operates golfs, high-end city clubs, private clubs, theme parks, art museums, etc.; and develops various home-based care service stations, daytime care centers, and senior citizen apartments, which provide home care, health care, rehabilitation therapy, nutrition catering, and spiritual solace, as well as education services. The company was founded in 1996 and is headquartered in Shenzhen, the People's Republic of China. Fantasia Holdings Group Co., Limited is a subsidiary of Fantasy Pearl International Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518048",
        "website": "http://www.cnfantasia.com",
        "market_cap": "Small Cap"
    },
    "KOH1.F": {
        "short_name": "CHINA YUANBANG PR.  HD 2",
        "long_name": "China Yuanbang Property Holdings Limited",
        "summary": "China Yuanbang Property Holdings Limited, an investment holding company, develops, manages, markets, and sells residential and commercial properties in the People's Republic of China. It is also involved in the tourism and resorts development operations; hotel business; agricultural tourism operations; and property investment activities. The company targets the middle to upper-middle income market segments. China Yuanbang Property Holdings Limited was incorporated in 2006 and is based in Guangzhou, China.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510430",
        "website": "http://www.yuanbang.com",
        "market_cap": "Nano Cap"
    }
}