{
    "ACIU": {
        "short_name": "AC Immune SA",
        "long_name": "AC Immune SA",
        "summary": "AC Immune SA, a clinical stage biopharmaceutical company, discovers, designs, and develops medicines and diagnostic products for the prevention and treatment of neurodegenerative diseases associated with protein misfolding. Its SupraAntigen and Morphomer platforms are designed to generate vaccines, antibodies, and small molecules, which selectively interact with misfolded proteins that are common in a range of neurodegenerative diseases. The company is developing Crenezumab, a humanized, conformation-specific monoclonal antibody, which is in Phase II clinical prevention trial for the treatment of Alzheimer's disease (AD). It is also developing ACI-24, an anti-Abeta vaccine candidate that is in Phase II clinical study for AD, as well as completed Phase Ib clinical study for Down syndrome; ACI-35, an anti-Tau vaccine candidate that has completed Phase Ib clinical study; and Tau- positron emission tomography (PET) imaging tracer, which is in Phase II clinical study. In addition, the company is researching and developing small molecule Tau aggregation inhibitors for AD and NeuroOrphan indications. Further, it has discovery and preclinical stage molecules targeting range of neurodegenerative diseases, which include diagnostics targeting TDP-43, alpha-synuclein, and NLRP3. The company has license agreements and collaborations with Genentech, Inc.; Biogen International GmbH; Janssen Pharmaceuticals, Inc.; Life Molecular Imaging SA; Eli Lilly and Company; and WuXi Biologics. AC Immune SA was incorporated in 2003 and is headquartered in Lausanne, Switzerland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Lausanne",
        "zipcode": "1015",
        "website": "http://www.acimmune.com",
        "full_time_employees": 125
    },
    "ADCT": {
        "short_name": "ADC Therapeutics SA",
        "long_name": "ADC Therapeutics SA",
        "summary": "ADC Therapeutics SA, a clinical-stage oncology-focused biotechnology company, develops antibody drug conjugates (ADC) for patients suffering from hematological malignancies and solid tumors. Its lead product candidates are loncastuximab tesirine (ADCT-402), an ADC that is in a Phase II clinical trial for the treatment of relapsed or refractory diffuse large B-cell lymphoma (DLBCL) and follicular lymphoma, and Phase III clinical trial in combination with rituximab to treat relapsed or refractory DLBCL, as well as Phase I/II clinical trial in combination with ibrutinib for relapsed or refractory DLBCL and mantle cell lymphoma; and camidanlumab tesirine (ADCT-301), an ADC that is in a pivotal Phase II clinical trial for the treatment of relapsed or refractory Hodgkin lymphoma and non-Hodgkin lymphoma, and Phase Ib clinical trial for selected advanced solid tumors. The company also develops clinical-stage product candidates, such as ADCT-601 that is in a Phase Ia clinical trial for the treatment of selected advanced tumors; and ADCT-602, and a Phase I/II clinical trial for relapsed or refractory acute lymphoblastic leukemia, as well as preclinical product candidates, including ADCT-701 and ADCT-901 for the treatment of selected advanced solid tumors. It has a collaboration and license agreement with Genmab A/S, Bergenbio AS, and Synaffix B.V. ADC Therapeutics SA was incorporated in 2011 and is headquartered in Epalinges, Switzerland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Epalinges",
        "zipcode": "1066",
        "website": "http://www.adctherapeutics.com",
        "full_time_employees": 208
    },
    "ADXN": {
        "short_name": "Addex Therapeutics Ltd",
        "long_name": "Addex Therapeutics Ltd",
        "summary": "Addex Therapeutics Ltd, a development-stage biopharmaceutical company, discovers, develops, and commercializes small-molecule pharmaceutical products for central nervous system (CNS) disorders in Switzerland. The company focuses on the discovery of oral small molecule allosteric modulators of G-protein coupled receptors. Its lead programs include Dipraglurant for the treatment of Parkinson's disease levodopa-induced dyskinesia, and dystonia; ADX71149 for epilepsy and undisclosed CNS disorders; and GABAB PAM for addiction. It has license and collaboration agreement with Janssen Pharmaceuticals Inc. to develop mGluR2PAM compounds for the treatment of human health. The company was formerly known as Addex Pharmaceuticals Ltd and changed its name to Addex Therapeutics Ltd in March 2012. Addex Therapeutics Ltd was founded in 2002 and is headquartered in Geneva, Switzerland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Geneva",
        "zipcode": "1202",
        "website": "http://www.addextherapeutics.com",
        "full_time_employees": 27
    },
    "ADXN.SW": {
        "short_name": "ADDEX N",
        "long_name": "Addex Therapeutics Ltd",
        "summary": "Addex Therapeutics Ltd, a development-stage biopharmaceutical company, discovers, develops, and commercializes small-molecule pharmaceutical products for central nervous system (CNS) disorders in Switzerland. The company focuses on the discovery of oral small molecule allosteric modulators of G-protein coupled receptors. Its lead programs include Dipraglurant for the treatment of Parkinson's disease levodopa-induced dyskinesia, and dystonia; ADX71149 for epilepsy and undisclosed CNS disorders; and GABAB PAM for addiction. It has license and collaboration agreement with Janssen Pharmaceuticals Inc. to develop mGluR2PAM compounds for the treatment of human health. The company was formerly known as Addex Pharmaceuticals Ltd and changed its name to Addex Therapeutics Ltd in March 2012. Addex Therapeutics Ltd was founded in 2002 and is headquartered in Geneva, Switzerland.",
        "currency": "CHF",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Geneva",
        "zipcode": "1202",
        "website": "http://www.addextherapeutics.com",
        "full_time_employees": 27
    },
    "BPMUF": {
        "short_name": "BASILEA PHARMACEUTICA AG",
        "long_name": "Basilea Pharmaceutica AG",
        "summary": "Basilea Pharmaceutica AG, a commercial stage biopharmaceutical company, focuses on the development of products that address the medical needs in the therapeutic areas of oncology and anti-infectives. It offers Cresemba, an intravenous and oral azole antifungal drug for the treatment of invasive aspergillosis and mucormycosis in the United States, the European Union, and internationally, as well as in Phase III clinical trials for invasive fungal infections in Japan. The company also provides Zevtera, an antibiotic for the treatment of community and hospital-acquired pneumonia, as well as in Phase III clinical trials for the treatment of acute bacterial skin and skin structure infections, and Staphylococcus aureus bacteremia in European and various non-European countries. In addition, it engages in developing Derazantinib, a small molecule inhibitor, which is in phase 2 clinical trial for bile duct cancer, as well as in phase Â½ clinical trial for bladder and stomach cancer; and Lisavanbulin, a tumor checkpoint controller drug. The company was founded in 2000 and is headquartered in Basel, Switzerland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Basel",
        "zipcode": "4058",
        "website": "http://www.basilea.com",
        "full_time_employees": 157
    },
    "BSLN.SW": {
        "short_name": "BASILEA N",
        "long_name": "Basilea Pharmaceutica AG",
        "summary": "Basilea Pharmaceutica AG, a commercial stage biopharmaceutical company, focuses on the development of products that address the medical needs in the therapeutic areas of oncology and anti-infectives. It offers Cresemba, an intravenous and oral azole antifungal drug for the treatment of invasive aspergillosis and mucormycosis in the United States, the European Union, and internationally, as well as in Phase III clinical trials for invasive fungal infections in Japan. The company also provides Zevtera, an antibiotic for the treatment of community and hospital-acquired pneumonia, as well as in Phase III clinical trials for the treatment of acute bacterial skin and skin structure infections, and Staphylococcus aureus bacteremia in European and various non-European countries. In addition, it engages in developing Derazantinib, a small molecule inhibitor, which is in phase 2 clinical trial for bile duct cancer, as well as in phase Â½ clinical trial for bladder and stomach cancer; and Lisavanbulin, a tumor checkpoint controller drug. The company was founded in 2000 and is headquartered in Basel, Switzerland.",
        "currency": "CHF",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Basel",
        "zipcode": "4058",
        "website": "http://www.basilea.com",
        "full_time_employees": 157
    },
    "CRSP": {
        "short_name": "CRISPR Therapeutics AG",
        "long_name": "CRISPR Therapeutics AG",
        "summary": "CRISPR Therapeutics AG, a gene editing company, focuses on developing transformative gene-based medicines for serious human diseases. The company develops its products using Clustered Regularly Interspaced Short Palindromic Repeats (CRISPR)/CRISPR-associated protein 9 (Cas9), a gene editing technology that allows for precise directed changes to genomic DNA. It has a portfolio of therapeutic programs in a range of disease areas, including hemoglobinopathies, oncology, regenerative medicine, and rare diseases. The company's lead product candidate is CTX001, an ex vivo CRISPR gene-edited therapy for treating patients suffering from transfusion-dependent beta thalassemia or severe sickle cell disease in which a patient's hematopoietic stem cells are engineered to produce high levels of fetal hemoglobin in red blood cells. It is also developing CTX110, a donor-derived gene-edited allogeneic CAR-T therapy targeting cluster of differentiation 19 positive malignancies. In addition, the company is developing allogeneic CAR-T programs comprising CTX120 targeting B-cell maturation antigen for the treatment of relapsed or refractory multiple myeloma; and CTX130 for the treatment of solid tumors and hematologic malignancies. Further, it engages in the development of regenerative medicine programs in diabetes; and in vivo and other genetic disease programs to treat glycogen storage disease Ia, Duchenne muscular dystrophy, myotonic dystrophy type 1, and cystic fibrosis. The company has strategic partnerships with Bayer Healthcare LLC, Vertex Pharmaceuticals Incorporated, and ViaCyte, Inc. It also has a strategic partnership with Nkarta, Inc. to research, develop, and commercialize CRISPR/Cas9 gene-edited cell therapies for cancer. The company was formerly known as Inception Genomics AG and changed its name to CRISPR Therapeutics AG in April 2014. CRISPR Therapeutics AG was incorporated in 2013 and is headquartered in Zug, Switzerland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Zug",
        "zipcode": "6300",
        "website": "http://www.crisprtx.com",
        "full_time_employees": 410
    },
    "CSBTF": {
        "short_name": "KUROS BIOSCIENCES AG",
        "long_name": "Kuros Biosciences AG",
        "summary": "Kuros Biosciences AG, a biopharmaceutical company, engages in the discovery, development, and commercialization of biopharmaceutical products for the treatment and prevention of chronic diseases in the United States, the United Kingdom, and internationally. Its sealants pipeline products include Neuroseal EU and US for the treatment of dural sealant cranial. The company's orthobiologics pipeline products include MagnetOs Granules and MagnetOs Putty in EU and US for the treatment of orthopedics, spinal, and dental problems. Its fibrin/PTH orthobiologics pipeline products comprise KUR-111, which has completed Phase II clinical trial for the treatment of tibial plateau fractures; and KUR-113, which completed Phase II clinical trial for the treatment of tibial shaft fractures, as well as is in the Phase I trial for the treatment of spinal interbody fusion. The company has collaboration with Checkmate Pharmaceuticals LLC for the development of CYT003 for the treatment of oncology. Kuros Biosciences AG is headquartered in Schlieren, Switzerland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Schlieren",
        "zipcode": "8952",
        "website": "http://www.kuros.ch",
        "full_time_employees": 46
    },
    "ELVAF": {
        "short_name": "EVOLVA HOLDING SA",
        "long_name": "Evolva Holding SA",
        "summary": "Evolva Holding SA discovers, develops, and commercializes ingredients for use in food, nutrition, personal healthcare, agriculture, and other sectors in Switzerland, the United States, and internationally. It offers branded ingredients, such as Veri-te Resveratrol, a natural ingredient in grapes, as well as other plants, including peanuts, cranberries, and Japanese knotweed for use in age-related health conditions; Nootkashield for pest control applications; EverSweet Stevia, a sweetener use in food, beverages, and table-top sweeteners; Nootkatone, an ingredient for flavour and fragrance applications; Valencene, an aroma ingredient; and Vanillin, an extracted from the seed pods of the vanilla orchid and is made up of a complex mixture of taste components. It serves the nutrition, flavors and fragrances, animal health, personal care, and pharmaceutical markets. The company was founded in 2004 and is headquartered in Reinach, Switzerland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Reinach",
        "zipcode": "4153",
        "website": "http://www.evolva.com",
        "full_time_employees": 70
    },
    "EVE.SW": {
        "short_name": "EVOLVA N",
        "long_name": "Evolva Holding SA",
        "summary": "Evolva Holding SA discovers, develops, and commercializes ingredients for use in food, nutrition, personal healthcare, agriculture, and other sectors in Switzerland, the United States, and internationally. It offers branded ingredients, such as Veri-te Resveratrol, a natural ingredient in grapes, as well as other plants, including peanuts, cranberries, and Japanese knotweed for use in age-related health conditions; Nootkashield for pest control applications; EverSweet Stevia, a sweetener use in food, beverages, and table-top sweeteners; Nootkatone, an ingredient for flavour and fragrance applications; Valencene, an aroma ingredient; and Vanillin, an extracted from the seed pods of the vanilla orchid and is made up of a complex mixture of taste components. It serves the nutrition, flavors and fragrances, animal health, personal care, and pharmaceutical markets. The company was founded in 2004 and is headquartered in Reinach, Switzerland.",
        "currency": "CHF",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Reinach",
        "zipcode": "4153",
        "website": "http://www.evolva.com",
        "full_time_employees": 70
    },
    "GEM.F": {
        "short_name": "GENEURO SA  SF-,05",
        "long_name": "GeNeuro SA",
        "summary": "GeNeuro SA, a clinical-stage biopharmaceutical company, develops drugs for the treatment of neurodegenerative and autoimmune diseases. Its lead therapeutic candidate is temelimab, a monoclonal antibody, which has completed Phase IIb clinical trial for the treatment of multiple sclerosis; and is in Phase IIa to treat type 1 diabetes, as well as is in Phase I for the treatment of chronic inflammatory demyelinating polyneuropathy. The company has cooperative research and development agreements with The National Institute of Neurological Disorders and Stroke to develop novel therapeutic antibodies for the treatment of amyotrophic lateral sclerosis; and Academic labs to develop inflammatory psychosis. GeNeuro SA was founded in 2006 and is headquartered in Plan-les-Ouates, Switzerland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Switzerland",
        "state": null,
        "city": "Plan-les-Ouates",
        "zipcode": "1228",
        "website": "http://www.geneuro.ch",
        "full_time_employees": null
    },
    "GNRO.PA": {
        "short_name": "GENEURO",
        "long_name": "GeNeuro SA",
        "summary": "GeNeuro SA, a clinical-stage biopharmaceutical company, develops drugs for the treatment of neurodegenerative and autoimmune diseases. Its lead therapeutic candidate is temelimab, a monoclonal antibody, which has completed Phase IIb clinical trial for the treatment of multiple sclerosis; and is in Phase IIa to treat type 1 diabetes, as well as is in Phase I for the treatment of chronic inflammatory demyelinating polyneuropathy. The company has cooperative research and development agreements with The National Institute of Neurological Disorders and Stroke to develop novel therapeutic antibodies for the treatment of amyotrophic lateral sclerosis; and Academic labs to develop inflammatory psychosis. GeNeuro SA was founded in 2006 and is headquartered in Plan-les-Ouates, Switzerland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "Switzerland",
        "state": null,
        "city": "Plan-les-Ouates",
        "zipcode": "1228",
        "website": "http://www.geneuro.ch",
        "full_time_employees": null
    },
    "IDIA.SW": {
        "short_name": "IDORSIA N",
        "long_name": "Idorsia Ltd",
        "summary": "Idorsia Ltd, a biopharmaceutical company, discovers, develops, and commercializes drugs for unmet medical needs in Switzerland. The company has a clinical development pipeline that cover various therapeutic areas, including CNS, cardiovascular, and immunological disorders, as well as orphan diseases. Idorsia Ltd has a collaboration agreement with Janssen Biotech Inc. to jointly develop and commercialize aprocitentan and its derivative compounds or products; ReveraGen to research and co-develop vamorolone, a non-hormonal steroid modulator for the treatment of duchenne muscular dystrophy; and Hoffman-La Roche Inc. to develop and market compounds in the field of cancer immunotherapy. It also has a collaboration with Antares Pharma, Inc. for the development of a self- administered drug device product for Selatogrel; and Neurocrine Biosciences, Inc. to develop and commercialize ACT-709478, which is in Phase 1 clinical trial for the treatment of epilepsy. The company was incorporated in 2017 and is headquartered in Allschwil, Switzerland.",
        "currency": "CHF",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Allschwil",
        "zipcode": "4123",
        "website": "http://www.idorsia.com",
        "full_time_employees": null
    },
    "IDRSF": {
        "short_name": "IDORSIA LTD",
        "long_name": "Idorsia Ltd",
        "summary": "Idorsia Ltd, a biopharmaceutical company, discovers, develops, and commercializes drugs for unmet medical needs in Switzerland. The company has a clinical development pipeline that cover various therapeutic areas, including CNS, cardiovascular, and immunological disorders, as well as orphan diseases. Idorsia Ltd has a collaboration agreement with Janssen Biotech Inc. to jointly develop and commercialize aprocitentan and its derivative compounds or products; ReveraGen to research and co-develop vamorolone, a non-hormonal steroid modulator for the treatment of duchenne muscular dystrophy; and Hoffman-La Roche Inc. to develop and market compounds in the field of cancer immunotherapy. It also has a collaboration with Antares Pharma, Inc. for the development of a self- administered drug device product for Selatogrel; and Neurocrine Biosciences, Inc. to develop and commercialize ACT-709478, which is in Phase 1 clinical trial for the treatment of epilepsy. The company was incorporated in 2017 and is headquartered in Allschwil, Switzerland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Allschwil",
        "zipcode": "4123",
        "website": "http://www.idorsia.com",
        "full_time_employees": null
    },
    "IMR.F": {
        "short_name": "AC IMMUNE SA  SF-,02",
        "long_name": "AC Immune SA",
        "summary": "AC Immune SA, a clinical stage biopharmaceutical company, discovers, designs, and develops medicines and diagnostic products for the prevention and treatment of neurodegenerative diseases associated with protein misfolding. Its SupraAntigen and Morphomer platforms are designed to generate vaccines, antibodies, and small molecules, which selectively interact with misfolded proteins that are common in a range of neurodegenerative diseases. The company is developing Crenezumab, a humanized, conformation-specific monoclonal antibody, which is in Phase II clinical prevention trial for the treatment of Alzheimer's disease (AD). It is also developing ACI-24, an anti-Abeta vaccine candidate that is in Phase II clinical study for AD, as well as completed Phase Ib clinical study for Down syndrome; ACI-35, an anti-Tau vaccine candidate that has completed Phase Ib clinical study; and Tau- positron emission tomography (PET) imaging tracer, which is in Phase II clinical study. In addition, the company is researching and developing small molecule Tau aggregation inhibitors for AD and NeuroOrphan indications. Further, it has discovery and preclinical stage molecules targeting range of neurodegenerative diseases, which include diagnostics targeting TDP-43, alpha-synuclein, and NLRP3. The company has license agreements and collaborations with Genentech, Inc.; Biogen International GmbH; Janssen Pharmaceuticals, Inc.; Life Molecular Imaging SA; Eli Lilly and Company; and WuXi Biologics. AC Immune SA was incorporated in 2003 and is headquartered in Lausanne, Switzerland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Switzerland",
        "state": null,
        "city": "Lausanne",
        "zipcode": "1015",
        "website": "http://www.acimmune.com",
        "full_time_employees": 125
    },
    "KURN.SW": {
        "short_name": "Kuros N",
        "long_name": "Kuros Biosciences AG",
        "summary": "Kuros Biosciences AG, a biopharmaceutical company, engages in the discovery, development, and commercialization of biopharmaceutical products for the treatment and prevention of chronic diseases in the United States, the United Kingdom, and internationally. Its sealants pipeline products include Neuroseal EU and US for the treatment of dural sealant cranial. The company's orthobiologics pipeline products include MagnetOs Granules and MagnetOs Putty in EU and US for the treatment of orthopedics, spinal, and dental problems. Its fibrin/PTH orthobiologics pipeline products comprise KUR-111, which has completed Phase II clinical trial for the treatment of tibial plateau fractures; and KUR-113, which completed Phase II clinical trial for the treatment of tibial shaft fractures, as well as is in the Phase I trial for the treatment of spinal interbody fusion. The company has collaboration with Checkmate Pharmaceuticals LLC for the development of CYT003 for the treatment of oncology. Kuros Biosciences AG is headquartered in Schlieren, Switzerland.",
        "currency": "CHF",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Schlieren",
        "zipcode": "8952",
        "website": "http://www.kuros.ch",
        "full_time_employees": 46
    },
    "MLLCF": {
        "short_name": "MOLECULAR PARTNERS AG",
        "long_name": "Molecular Partners AG",
        "summary": "Molecular Partners AG operates as a clinical-stage biopharmaceutical company. It is developing Abicipar, a DARPin therapeutic candidate, which is in Phase III clinical trials for the treatment of wet age-related macular degeneration, as well as for diabetic macular edema; and MP0250 that binds and inhibit vascular endothelial growth factor and hepatocyte growth factor pathways, which restores clinical sensitivity to various standard-of-care therapies in multiple myeloma. The company is also developing MP0274 that is in Phase I clinical trials for HER2-positive solid tumors; MP0310, which is in Phase I clinical trials for immuno-oncology; MPO317, a tumor-localized immune agonist that activates immune cells in the tumor; and Peptide-MHC, a tumor-localized immune-cell agonist to attack tumors. It has strategic partnerships with Allergan, Inc. and Amgen SA; and collaboration with AGC Biologics to develop anti-COVID-19 DARPin program. Molecular Partners AG was founded in 2004 and is headquartered in Schlieren, Switzerland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Schlieren",
        "zipcode": "8952",
        "website": "http://www.molecularpartners.com",
        "full_time_employees": 145
    },
    "MOLN.SW": {
        "short_name": "MOLECULAR PARTNERS N",
        "long_name": "Molecular Partners AG",
        "summary": "Molecular Partners AG operates as a clinical-stage biopharmaceutical company. It is developing Abicipar, a DARPin therapeutic candidate, which is in Phase III clinical trials for the treatment of wet age-related macular degeneration, as well as for diabetic macular edema; and MP0250 that binds and inhibit vascular endothelial growth factor and hepatocyte growth factor pathways, which restores clinical sensitivity to various standard-of-care therapies in multiple myeloma. The company is also developing MP0274 that is in Phase I clinical trials for HER2-positive solid tumors; MP0310, which is in Phase I clinical trials for immuno-oncology; MPO317, a tumor-localized immune agonist that activates immune cells in the tumor; and Peptide-MHC, a tumor-localized immune-cell agonist to attack tumors. It has strategic partnerships with Allergan, Inc. and Amgen SA; and collaboration with AGC Biologics to develop anti-COVID-19 DARPin program. Molecular Partners AG was founded in 2004 and is headquartered in Schlieren, Switzerland.",
        "currency": "CHF",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Schlieren",
        "zipcode": "8952",
        "website": "http://www.molecularpartners.com",
        "full_time_employees": 145
    },
    "MYMX": {
        "short_name": "MYMETICS CORPORATION",
        "long_name": "Mymetics Corporation",
        "summary": "Mymetics Corporation, a vaccine company, focuses on researching and developing vaccines for infectious and life disabling diseases in Switzerland. The company's product pipeline includes various vaccine candidates, such as HIV-1/AIDS, malaria, Covid-19, intra nasal influenza, respiratory syncytial virus, and chikungunya. It has a collaboration agreement with Texas Biomedical Research Institute; PATH Malaria Vaccine Initiative and the Laboratory of Malaria Immunology and Vaccinology of the National Institute of Allergy and Infectious Diseases to develop and produce virosome based vaccine formulations for a malaria transmission-blocking vaccine candidate; and Sanofi Pasteur Biologics, LLC to investigate the immunogenicity of influenza vaccines. The company was formerly known as ICHOR Corporation and changed its name to Mymetics Corporation in July 2001. Mymetics Corporation was founded in 1990 and is based in Epalinges, Switzerland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Epalinges",
        "zipcode": "1066",
        "website": "http://www.mymetics.com",
        "full_time_employees": 7
    },
    "NLSP": {
        "short_name": "NLS Pharmaceutics Ltd.",
        "long_name": "NLS Pharmaceutics AG",
        "summary": "NLS Pharmaceutics AG, a biopharmaceutical company, engages in the discovery and development of drug therapies to treat rare and complex central nervous system disorders. The company is focusing on the development of treatments for narcolepsy, idiopathic hypersomnia, and other rare sleep disorders, as well as neurodevelopmental disorders, such as attention deficit hyperactivity disorder (ADHD). Its two lead product candidates, include Quilience, for the treatment of excessive daytime sleepiness and cataplexy; and Nolazol, for the treatment of ADHD. NLS Pharmaceutics AG was founded in 2015 and is based in Stans, Switzerland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Stans",
        "zipcode": "6370",
        "website": "http://www.nlspharma.com",
        "full_time_employees": 1
    },
    "OBSN.SW": {
        "short_name": "OBSEVA N",
        "long_name": "ObsEva SA",
        "summary": "ObsEva SA, a biopharmaceutical company, focuses on the development and commercialization of novel therapeutics for women suffering from reproductive health and pregnancy. The company is developing Linzagolix, an oral gonadotropin-releasing hormone receptor antagonist for the treatment of pain associated with endometriosis and heavy menstrual bleeding associated with uterine fibroids in pre-menopausal women. It also is developing Ebopiprant, an oral and selective prostaglandin F2a, or PGF2a receptor antagonist, as a once daily treatment for preterm labor in weeks 24 to 34 of gestational age; and Nolasiban, an oral oxytocin receptor antagonist to enhance clinical pregnancy and live birth rates in women undergoing in vitro fertilization. The company was founded in 2012 and is headquartered in Geneva, Switzerland.",
        "currency": "CHF",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Geneva",
        "zipcode": "1228",
        "website": "http://www.obseva.com",
        "full_time_employees": 42
    },
    "OBSV": {
        "short_name": "ObsEva SA",
        "long_name": "ObsEva SA",
        "summary": "ObsEva SA, a biopharmaceutical company, focuses on the development and commercialization of novel therapeutics for women suffering from reproductive health and pregnancy. The company is developing Linzagolix, an oral gonadotropin-releasing hormone receptor antagonist for the treatment of pain associated with endometriosis and heavy menstrual bleeding associated with uterine fibroids in pre-menopausal women. It also is developing Ebopiprant, an oral and selective prostaglandin F2a, or PGF2a receptor antagonist, as a once daily treatment for preterm labor in weeks 24 to 34 of gestational age; and Nolasiban, an oral oxytocin receptor antagonist to enhance clinical pregnancy and live birth rates in women undergoing in vitro fertilization. The company was founded in 2012 and is headquartered in Geneva, Switzerland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Geneva",
        "zipcode": "1228",
        "website": "http://www.obseva.com",
        "full_time_employees": 42
    },
    "OBSVN.MX": {
        "short_name": "OBSEVA SA",
        "long_name": "ObsEva SA",
        "summary": "ObsEva SA, a biopharmaceutical company, focuses on the development and commercialization of novel therapeutics for women suffering from reproductive health and pregnancy. The company is developing Linzagolix, an oral gonadotropin-releasing hormone receptor antagonist for the treatment of pain associated with endometriosis and heavy menstrual bleeding associated with uterine fibroids in pre-menopausal women. It also is developing Ebopiprant, an oral and selective prostaglandin F2a, or PGF2a receptor antagonist, as a once daily treatment for preterm labor in weeks 24 to 34 of gestational age; and Nolasiban, an oral oxytocin receptor antagonist to enhance clinical pregnancy and live birth rates in women undergoing in vitro fertilization. The company was founded in 2012 and is headquartered in Geneva, Switzerland.",
        "currency": "MXN",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Switzerland",
        "state": null,
        "city": "Geneva",
        "zipcode": "1228",
        "website": "http://www.obseva.com",
        "full_time_employees": 42
    },
    "POLN.SW": {
        "short_name": "Polyphor N",
        "long_name": "Polyphor AG",
        "summary": "Polyphor AG, a clinical stage biopharmaceutical company, focuses on developing macrocycle drugs for cancer. Its lead drug candidates include Balixafortide (POL6326), an antagonist of the chemokine receptor CXCR4, which is in Phase III for combination treatment in oncology; POL6014, an inhaled inhibitor of neutrophil elastase, which is in Phase Ib clinical trial for the treatment of cystic fibrosis and other neutrophilic lung diseases; and outer membrane protein targeting antibiotics (OMPTA) platform. The company is also developing POL7306, targeting the most resistant MDR strains of all Gram-negative ESKAPE, including enterococcus faecium, staphylococcus aureus, klebsiella pneumoniae, acinetobacter baumannii, pseudomonas aeruginosa, and enterobacter species pathogens; and inhaled murepavadin (POL7080), a precision outer membrane protein targeting antibiotic for the treatment of pseudomonas aeruginosa. Polyphor AG was founded in 1996 and is headquartered in Allschwil, Switzerland.",
        "currency": "CHF",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Allschwil",
        "zipcode": "4123",
        "website": "http://www.polyphor.com",
        "full_time_employees": 52
    },
    "RLF.SW": {
        "short_name": "RELIEF THERAPEUTICS N",
        "long_name": "Relief Therapeutics Holding AG",
        "summary": "Relief Therapeutics Holding AG, a biopharmaceutical company, provides patients with therapeutic relief from serious diseases with high unmet medical need. The company focuses on clinical-stage programs based on molecules of natural origin (peptides and proteins) with a history of clinical use and either initial human activity with efficacy data or a strong scientific rationale. Its lead compound is RLF-100 (aviptadil), a synthetic human vasoactive intestinal peptide (VIP) with a multifaceted mode of action in respiratory indications is being investigated in two U.S. Phase 2b/3 clinical trials in acute respiratory deficiency due to COVID-19, as well as in Phase 2 clinical trial for the treatment of pulmonary sarcoidosis. The company is also involved in clinical development of RLF-100 for other indications in acute and chronic lung diseases. Relief Therapeutics Holding AG is based in Geneva, Switzerland.",
        "currency": "CHF",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Geneva",
        "zipcode": "1202",
        "website": "http://www.relieftherapeutics.com",
        "full_time_employees": 10
    },
    "RLFTF": {
        "short_name": "RELIEF THERAPEUTICS HOLDING AG",
        "long_name": "Relief Therapeutics Holding AG",
        "summary": "Relief Therapeutics Holding AG, a biopharmaceutical company, provides patients with therapeutic relief from serious diseases with high unmet medical need. The company focuses on clinical-stage programs based on molecules of natural origin (peptides and proteins) with a history of clinical use and either initial human activity with efficacy data or a strong scientific rationale. Its lead compound is RLF-100 (aviptadil), a synthetic human vasoactive intestinal peptide (VIP) with a multifaceted mode of action in respiratory indications is being investigated in two U.S. Phase 2b/3 clinical trials in acute respiratory deficiency due to COVID-19, as well as in Phase 2 clinical trial for the treatment of pulmonary sarcoidosis. The company is also involved in clinical development of RLF-100 for other indications in acute and chronic lung diseases. Relief Therapeutics Holding AG is based in Geneva, Switzerland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Geneva",
        "zipcode": "1202",
        "website": "http://www.relieftherapeutics.com",
        "full_time_employees": 10
    },
    "SANN.SW": {
        "short_name": "SANTHERA N",
        "long_name": "Santhera Pharmaceuticals Holding AG",
        "summary": "Santhera Pharmaceuticals Holding AG, a specialty pharmaceutical company, together with its subsidiaries, develops and commercializes medicines for rare neuromuscular and pulmonary diseases with high unmet medical need in the European Union and internationally. It is developing Duchenne muscular dystrophy (DMD) product portfolio to treat patients irrespective of causative mutations, disease stage, or age. The company's late stage drug candidate include vamorolone, which is being developed as treatments for DMD. Its clinical stage pipeline also comprises lonodelestat (POL6014) to treat cystic fibrosis and other neutrophilic pulmonary diseases, as well as omigapil and an exploratory gene therapy approach targeting congenital muscular dystrophies. The company also out-licenses ex-North American rights to its approved product, Raxone (idebenone), for the treatment of Leber's hereditary optic neuropathy. It has collaboration agreement with Cold Spring Harbor Laboratory to investigate the potential of lonodelestat (POL6014), a potent inhibitor of human neutrophil elastase, as a therapeutic intervention for COVID-19-related acute respiratory distress syndrome. Santhera Pharmaceuticals Holding AG is headquartered in Pratteln, Switzerland.",
        "currency": "CHF",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Pratteln",
        "zipcode": "4133",
        "website": "http://www.santhera.com",
        "full_time_employees": 112
    },
    "SPHDF": {
        "short_name": "SANTHERA PHARMACEUTICALS HOLDIN",
        "long_name": "Santhera Pharmaceuticals Holding AG",
        "summary": "Santhera Pharmaceuticals Holding AG, a specialty pharmaceutical company, together with its subsidiaries, develops and commercializes medicines for rare neuromuscular and pulmonary diseases with high unmet medical need in the European Union and internationally. It is developing Duchenne muscular dystrophy (DMD) product portfolio to treat patients irrespective of causative mutations, disease stage, or age. The company's late stage drug candidate include vamorolone, which is being developed as treatments for DMD. Its clinical stage pipeline also comprises lonodelestat (POL6014) to treat cystic fibrosis and other neutrophilic pulmonary diseases, as well as omigapil and an exploratory gene therapy approach targeting congenital muscular dystrophies. The company also out-licenses ex-North American rights to its approved product, Raxone (idebenone), for the treatment of Leber's hereditary optic neuropathy. It has collaboration agreement with Cold Spring Harbor Laboratory to investigate the potential of lonodelestat (POL6014), a potent inhibitor of human neutrophil elastase, as a therapeutic intervention for COVID-19-related acute respiratory distress syndrome. Santhera Pharmaceuticals Holding AG is headquartered in Pratteln, Switzerland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Pratteln",
        "zipcode": "4133",
        "website": "http://www.santhera.com",
        "full_time_employees": 112
    },
    "VECT": {
        "short_name": "VectivBio Holding AG",
        "long_name": "VectivBio Holding AG",
        "summary": "VectivBio Holding AG, a clinical stage biopharmaceutical company, focuses on the discovery, development, and commercialization of treatments for rare conditions. It develops Apraglutide, a long-acting synthetic peptide analog of glucagon-like peptide-2 that is in Phase III clinical trial for the treatment of patients with short bowel syndrome-intestinal failure (SBS-IF), as well as for SBS-IF in patients with colon-in-continuity anatomy. The company was incorporated in 2019 and is headquartered in Basel, Switzerland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Basel",
        "zipcode": "4051",
        "website": "http://vectivbio.com",
        "full_time_employees": null
    },
    "VNTA": {
        "short_name": "VENTANA BIOTECH INC",
        "long_name": "Ventana Biotech, Inc.",
        "summary": "Ventana Biotech, Inc., a development stage biotech company, identifies, evaluates, acquires, develops, and partners commercialization of intellectual property in the area of drug candidates for personalized medicine. The company focuses in the areas of anti-obesity and related illnesses. The company holds rights for the formula for a medicament containing chewing gum with a composition of the extract of hoodia gordonii and 2-hydroxyoleic acid for the treatment of obesity, hypertension, and other metabolic disorders. The company develops appetite suppressant chewing gums, including the low dosage product for the over-the-counter market and the high dosage product for distribution by pharmacists. It intends to market low dosage product though drug and health food stores. The company was formerly known as Personalica, Inc. and changed its name to Ventana Biotech, Inc. in October 2008. Ventana Biotech, Inc. was founded in 1989 and is based in Butschwil, Switzerland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Butschwil",
        "zipcode": "9606",
        "website": null,
        "full_time_employees": null
    },
    "XLS.F": {
        "short_name": "XLIFE SCIENCES AG  SF 1",
        "long_name": "Xlife Sciences AG",
        "summary": "Xlife Sciences AG focuses on the development of life sciences technologies. The company's projects and pipeline include biotech/therapies and technology platforms for antibody therapy, including obesity, acute myeloid leukemia, and acute lymphocytic leukemia; nanovesikel therapy comprising arthritis, MS, and ALS; painkiller solution; screening technology of antibodies; and modification of antibodies and breakdown of polygeny (genetics). Its projects and pipeline also include medical technology and artificial intelligence comprising 3D bioprinting for life; medical technology comprising reprocessing of instruments of surgical robots; medical devices for the early detection of dementia and Parkinson's disease; development of bile duct implants; and analysis software (AI) for the diagnosis/evaluation of X-ray and MRI images for early detection of prostate cancer. The company is headquartered in Zurich, Switzerland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Switzerland",
        "state": null,
        "city": "ZÃ¼rich",
        "zipcode": "8008",
        "website": "http://www.xlifesciences.ch",
        "full_time_employees": null
    },
    "XLS.MU": {
        "short_name": "XLIFE SCIENCES AG  SF 1",
        "long_name": "Xlife Sciences AG",
        "summary": "Xlife Sciences AG focuses on the development of life sciences technologies. The company's projects and pipeline include biotech/therapies and technology platforms for antibody therapy, including obesity, acute myeloid leukemia, and acute lymphocytic leukemia; nanovesikel therapy comprising arthritis, MS, and ALS; painkiller solution; screening technology of antibodies; and modification of antibodies and breakdown of polygeny (genetics). Its projects and pipeline also include medical technology and artificial intelligence comprising 3D bioprinting for life; medical technology comprising reprocessing of instruments of surgical robots; medical devices for the early detection of dementia and Parkinson's disease; development of bile duct implants; and analysis software (AI) for the diagnosis/evaluation of X-ray and MRI images for early detection of prostate cancer. The company is headquartered in Zurich, Switzerland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Switzerland",
        "state": null,
        "city": "ZÃ¼rich",
        "zipcode": "8008",
        "website": "http://www.xlifesciences.ch",
        "full_time_employees": null
    }
}