{
    "BETW": {
        "short_name": "BETTWORK INDUSTRIES INC",
        "long_name": "Bettwork Industries Inc.",
        "summary": "Bettwork Industries Inc., a development stage company, focuses on a technology that allows helium to create a heat exchange with the sun and the air from the environment. The exchange generates the spinning of the gas in the closed circuit, propelling a turbine, which produces electricity in clean and renewable process. The company was formerly known as Kender Energy, Inc. and changed its name to Bettwork Industries Inc. in October 2008. Bettwork Industries Inc. was founded in 1993 and is based in Geneva, Switzerland.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Geneva",
        "zipcode": "1207",
        "website": "http://betw-ind.com",
        "market_cap": "Small Cap"
    },
    "HUBN.SW": {
        "short_name": "HUBER+SUHNER N",
        "long_name": "Huber+Suhner AG",
        "summary": "Huber+Suhner AG offers products and services for electrical and optical connectivity worldwide. It operates through three segments: Radio Frequency, Fiber Optics, and Low Frequency. The Radio Frequency segment develops and manufactures radio frequency and microwave products, including cables, connectors, adapters, cable assemblies, antennas, lightning protection, and resistive components, as well as active RF-over-Fiber systems. The Fiber Optics segment offers cables, connectors, cable assemblies, cable and distribution systems, optical transmitters, amplifiers, receivers, fiber management and hybrid installation systems, cable cutting and stripping tools, termination tools, polishing tools, cleaning tools, tuning equipment, performance measurement tools, accessories, cleaning brush, cassette cleaners, cleaners, and rapstraps, as well as wavelength multiplexers and all-optical switches. The Low Frequency segment provides single cores, cables, cable assemblies, hybrid cables, and cable systems. The company is also involved in the cube optics, injection molding, plating, and polatis businesses. It serves customers in the communication, transportation, and industrial markets. The company was founded in 1864 and is headquartered in Herisau, Switzerland.",
        "currency": "CHF",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Herisau",
        "zipcode": "9100",
        "website": "http://www.hubersuhner.com",
        "market_cap": "Small Cap"
    },
    "UBLXF": {
        "short_name": "U-BLOX HOLDING AG",
        "long_name": "u-blox Holding AG",
        "summary": "u-blox Holding AG provides positioning and wireless communication solutions for the automotive, industrial, and consumer markets worldwide. Its solutions securely connect vehicles, industries, cities, buildings, and people. The company operates in two segments, Positioning and Wireless Products, and Wireless Services. Its products comprise cellular chips and modules; short range radio chips and modules; and standard and high precision global navigation satellite system (GNSS), dead reckoning, and receiver modules, as well as antennas and smart antennas, satellite receiver chips and chipsets, and receiver boards. The company also offers various services comprising AssistNow, a GNSS service that accelerates calculation of position by delivering satellite data; and CellLocate, a mobile network-based location service, as well as provides evaluation kits. In addition, it offers u-center, a GNSS evaluation software; m-center, a cellular evaluation software; s-center, a Wi-Fi and Bluetooth module evaluation software; and security-as-a-service and communication-as-a-service for the Internet of Things (IoT) applications. u-blox Holding AG was founded in 1997 and is headquartered in Thalwil, Switzerland.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Thalwil",
        "zipcode": "8800",
        "website": "http://www.u-blox.com",
        "market_cap": "Small Cap"
    },
    "UBXN.SW": {
        "short_name": "U-BLOX N",
        "long_name": "u-blox Holding AG",
        "summary": "u-blox Holding AG provides positioning and wireless communication solutions for the automotive, industrial, and consumer markets worldwide. Its solutions securely connect vehicles, industries, cities, buildings, and people. The company operates in two segments, Positioning and Wireless Products, and Wireless Services. Its products comprise cellular chips and modules; short range radio chips and modules; and standard and high precision global navigation satellite system (GNSS), dead reckoning, and receiver modules, as well as antennas and smart antennas, satellite receiver chips and chipsets, and receiver boards. The company also offers various services comprising AssistNow, a GNSS service that accelerates calculation of position by delivering satellite data; and CellLocate, a mobile network-based location service, as well as provides evaluation kits. In addition, it offers u-center, a GNSS evaluation software; m-center, a cellular evaluation software; s-center, a Wi-Fi and Bluetooth module evaluation software; and security-as-a-service and communication-as-a-service for the Internet of Things (IoT) applications. u-blox Holding AG was founded in 1997 and is headquartered in Thalwil, Switzerland.",
        "currency": "CHF",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Thalwil",
        "zipcode": "8800",
        "website": "http://www.u-blox.com",
        "market_cap": "Small Cap"
    }
}