{
    "ABBN.MX": {
        "short_name": "ABB LTD",
        "long_name": "ABB Ltd",
        "summary": "ABB Ltd manufactures and sells electrification, industrial automation, and robotics and motion products for customers in utilities, industry and transport, and infrastructure worldwide. Its Electrification segment provides electric vehicle charging infrastructure, renewable power solutions, modular substation packages, distribution automation products, switchboard and panel boards, switchgears, UPS solutions, circuit breakers, measuring and sensing devices, control products, wiring accessories, enclosures and cabling systems, and intelligent home and building solutions for integrating and automating lighting, heating, ventilation, security, and data communication networks. The company's Robotics & Discrete Automation segments provides industrial robots, software, robotic solutions and systems, field services, spare parts, and digital services. This segment also offers solutions based on its programmable logic controllers, industrial PCs, servo motion, transport systems, and machine vision. Its Industrial Automation segment develops and sells industry-specific, integrated automation, and electrification systems and solutions, as well as digital solutions, lifecycle services, and artificial intelligence applications for the process and hybrid industries. This segment also offers process and discrete control technologies, advanced process control software and manufacturing execution systems, sensing, measurement, analytical instrumentation, electric ship propulsion systems, and large turbochargers, as well as remote monitoring, preventive maintenance, asset performance management, and cybersecurity services. The company's Motion segment manufactures and sells drives, motors, generators, traction converters, and mechanical power transmission products. ABB Ltd has a strategic collaboration with IBM. ABB Ltd was founded in 1883 and is headquartered in Zurich, Switzerland.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Switzerland",
        "city": "Zurich"
    },
    "VACNN.MX": {
        "short_name": "VAT GROUP AG",
        "long_name": "VAT Group AG",
        "summary": "VAT Group AG, together with its subsidiaries, develops, manufactures, and supplies vacuum valves in Switzerland, rest of Europe, the United States, Japan, Korea, Singapore, China, rest of Asia, and internationally. The company operates through three segments: Valves, Global Service, and Industry. The Valves segment offers vacuum valves for the semiconductor, displays, photovoltaics, and vacuum coating industries, as well as for the industrial and research sectors. The Global Service segment provides spare parts, repairs, and upgrades, as well as support services. The Industry segment produces edge-welded bellows for use in vacuum feedthrough, semiconductor, implantable pump, sealing, and motor vehicle fuel injection system applications; and offers machined parts, mechanical components, and assemblies. VAT Group AG was founded in 1965 is headquartered in Sennwald, Switzerland.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Switzerland",
        "city": "Sennwald"
    }
}