{
    "HIAG.SW": {
        "short_name": "HIAG IMMOBILIEN N",
        "long_name": "HIAG Immobilien Holding AG",
        "summary": "HIAG Immobilien Holding AG, together with its subsidiaries, engages in the management and redevelopment of properties in Switzerland. The company operates through Yielding Portfolio, Redevelopment Portfolio, Cloud Services, and Others segments. Its property portfolio includes industrial and commercial, residential, retail, building land, distribution and logistics, office, and other properties. The company also offers metal recycling services; and technology to independent partners based on multi-cloud platform. In addition, it is involved in the management, asset management, and technical administrative management of the pension funds, as well as provides human resources services to third parties. The company was founded in 1876 and is headquartered in Basel, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Basel"
    },
    "MOBN.SW": {
        "short_name": "MOBIMO N",
        "long_name": "Mobimo Holding AG",
        "summary": "Mobimo Holding AG operates as a real estate company in Switzerland. It operates through two segments, Real Estate and Development. The Real Estate segment is involved in the long-term holding, operation, and management of investment properties, including commercial, industrial, and residential properties; provision of tenant support services; and marketing of residential, commercial, and retail space. This segment also offers facility management and related services for third-party customers. As of December 31, 2019, it had 139 properties. The Development segment develops, constructs, and sells condominiums; and develops turn-key real estate investments for institutional and private investors, as well as provides development services, including area, site, and project developments. The company was founded in 1999 and is headquartered in Lucerne, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Lucerne"
    },
    "NREN.SW": {
        "short_name": "Novavest Real Estate N",
        "long_name": "Novavest Real Estate AG",
        "summary": "Novavest Real Estate AG engages in the real estate activities in Switzerland. It develops, rents, and manages residential, mixed used, and office and commercial properties; courthouses, community buildings, schools, shopping centers, and hotels or leisure facilities; industrial plants; and conversion and renovation properties. The company is based in Zurich, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Zurich"
    },
    "PSPN.SW": {
        "short_name": "PSP N",
        "long_name": "PSP Swiss Property AG",
        "summary": "PSP Swiss Property AG, together with its subsidiaries, owns and operates real estate properties in Switzerland. It operates through Real Estate Investments and Property Management segments. The company owns, operates, and leases office, retail and commercial, and storage properties; and parking spaces. It owns 162 office and commercial properties; and 12 development sites and individual projects primarily in Zurich, Geneva, Basel, Bern, and Lausanne. PSP Swiss Property AG was founded in 1999 and is based in Zug, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Zug"
    },
    "PSPSF": {
        "short_name": "PSP SWISS PROPERTY AG",
        "long_name": "PSP Swiss Property AG",
        "summary": "PSP Swiss Property AG, together with its subsidiaries, owns and operates real estate properties in Switzerland. It operates through Real Estate Investments and Property Management segments. The company owns, operates, and leases office, retail and commercial, and storage properties; and parking spaces. It owns 162 office and commercial properties; and 12 development sites and individual projects primarily in Zurich, Geneva, Basel, Bern, and Lausanne. PSP Swiss Property AG was founded in 1999 and is based in Zug, Switzerland.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Switzerland",
        "city": "Zug"
    }
}