{
    "STMN.MX": {
        "short_name": "STMICROELECTRONICS",
        "long_name": "STMicroelectronics N.V.",
        "summary": "STMicroelectronics N.V., together with its subsidiaries, develops, manufactures, and markets semiconductor products in EMEA, the Americas, and the Asia Pacific. It operates through Automotive and Discrete Group; Analog, MEMS and Sensors Group; and Microcontrollers and Digital ICs Group segments. The Automotive and Discrete Group segment offers digital and analog automotive integrated circuits (ICs); and discrete and power transistor products. The Analog, MEMS and Sensors Group segment provides custom and general purpose analog ICs; smart power products for industrial, computer, and personal electronics markets; touch screen controllers; wireline and wireless low power connectivity solutions for Internet of Things; power conversion products; metering solutions for smart grid; specialized imaging sensors and modules; and micro-electro-mechanical systems products for sensors or actuators. The Microcontrollers and Digital ICs Group segment offers general purpose and secure microcontrollers, electrically erasable programmable read-only memories, and digital application-specific integrated circuits; and aerospace and defense products, including components for microwave and millimeter wave. It also provides subsystems, assembly, and other services. The company sells its products through its distributors and retailers, as well as through sales representatives. It has a strategic partnership with Sanken Electric Co., Ltd to develop intelligent power modules for high-voltage industrial and automotive products; and collaboration with Advantest Corporation on advanced automated test cell for IC testing. STMicroelectronics N.V. was founded in 1987 and is headquartered in Geneva, Switzerland.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductor - Broad Line",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Switzerland",
        "city": "Geneva"
    }
}