{"4CIA.F": {"short_name": "FANHUA INC. ADR/20", "long_name": "Fanhua Inc.", "summary": "Fanhua Inc., together with its subsidiary, distributes insurance products in China. It operates through two segments, Insurance Agency and Claims Adjusting. The Insurance Agency segment provides property and casualty insurance products, including individual accident, travel, homeowner, short-term health, auto, and other property and casualty products; and life insurance products, such as individual health, individual whole life, individual term life, individual endowment life, and individual annuity, as well as participating insurance products. The Claims Adjusting segment offers pre-underwriting survey, claims adjusting, residual value disposal, loading and unloading supervision, and consulting services. The company also operates baoxian.com, an online insurance platform, which allows customers to search for, and purchase a range of insurance products; Lan Zhanggui, an Internet-based all-in-one application; and ehuzhu.com, an online non-profit mutual aid platform, as well as CNpad Auto, an Internet-based auto insurance platform. It serves customers through insurance sales and service group, and insurance agencies, as well as sales and service branches and outlets, registered independent sales agents, and in-house claims adjustors. The company was formerly known as CNinsure Inc. and changed its name to Fanhua Inc. in December 2016. Fanhua Inc. was founded in 1998 and is headquartered in Guangzhou, China.", "currency": "EUR", "sector": "Financial Services", "industry": "Insurance Brokers", "exchange": "FRA", "market": "dr_market", "country": "China", "city": "Guangzhou"}, "FANH": {"short_name": "Fanhua Inc.", "long_name": "Fanhua Inc.", "summary": "Fanhua Inc., together with its subsidiary, distributes insurance products in China. It operates through two segments, Insurance Agency and Claims Adjusting. The Insurance Agency segment provides property and casualty insurance products, including individual accident, travel, homeowner, short-term health, auto, and other property and casualty products; and life insurance products, such as individual health, individual whole life, individual term life, individual endowment life, and individual annuity, as well as participating insurance products. The Claims Adjusting segment offers pre-underwriting survey, claims adjusting, residual value disposal, loading and unloading supervision, and consulting services. The company also operates baoxian.com, an online insurance platform, which allows customers to search for, and purchase a range of insurance products; Lan Zhanggui, an Internet-based all-in-one application; and ehuzhu.com, an online non-profit mutual aid platform, as well as CNpad Auto, an Internet-based auto insurance platform. It serves customers through insurance sales and service group, and insurance agencies, as well as sales and service branches and outlets, registered independent sales agents, and in-house claims adjustors. The company was formerly known as CNinsure Inc. and changed its name to Fanhua Inc. in December 2016. Fanhua Inc. was founded in 1998 and is headquartered in Guangzhou, China.", "currency": "USD", "sector": "Financial Services", "industry": "Insurance Brokers", "exchange": "NMS", "market": "us_market", "country": "China", "city": "Guangzhou"}, "HUIZ": {"short_name": "Huize Holding Limited", "long_name": "Huize Holding Limited", "summary": "Huize Holding Limited is a leading independent online insurance product and service platform in China. Targeting the younger generation, Huize is dedicated to serving its insurance clients for their life-long insurance needs. Leveraging its online platform, Huize offers a wide variety of insurance products with a focus on long-term life and health insurance products, and empowers its insurer partners to reach a large fragmented client base in the insurance retail market efficiently and enhance their insurance sales. Huize provides insurance clients with digitalized insurance experience and services, including suitable product recommendations, consulting service, intelligent underwriting and assistance in claim application and settlement, which significantly improve transaction experience. For more information, please visit http://ir.huize.com.", "currency": "USD", "sector": "Financial Services", "industry": "Insurance Brokers", "exchange": "NGM", "market": "us_market", "country": "China", "city": "Shenzhen"}, "UIBGF": {"short_name": "UIB GROUP LIMITED", "long_name": "UIB Group Limited", "summary": "UIB Group Limited operates as an independent insurance brokerage company in China. It offers school liability insurance, student safety insurance, and teacher medical supplementary insurance, as well as standard automobile insurance policies and supplemental policies to schools, faculty, and staff, as well as assists its customers in various activities, such as policy term negotiation, damage assessment, and claim settlement. The company was founded in 2001 and is headquartered in Beijing, China.", "currency": "USD", "sector": "Financial Services", "industry": "Insurance Brokers", "exchange": "PNK", "market": "us_market", "country": "China", "city": "Beijing"}}