{
    "MGAWY": {
        "short_name": "MEGAWORLD CORP",
        "long_name": "Megaworld Corporation",
        "summary": "Megaworld Corporation, together with its subsidiaries, develops, markets, and leases real estate properties in the Philippines. It operates through Real Estate, Rental, Hotel Operations, and Corporate and Others segments. It develops mixed-use planned communities or townships, including residential, commercial, office, leisure, entertainment, and educational/training components. The company's real estate portfolio comprises residential condominium units, subdivision lots and townhouses, and condominium-hotel projects, as well as office projects and retail spaces. It is also involved in the lease of office and retail spaces; and property-related activities, such as project design, construction oversight, and property management, as well as provision of business process outsourcing, educational facilities, restaurants, cafes, cocktail bars, lounges, inns, apartments, private clubs, and other related businesses. In addition, Megaworld Corporation owns, leases, and manages hotels. The company was formerly known as Megaworld Properties & Holdings, Inc. and changed its name to Megaworld Corporation in August 1999. The company was founded in 1989 and is based in Taguig, the Philippines. Megaworld Corporation is a subsidiary of Alliance Global Group, Inc.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Philippines",
        "city": "Taguig"
    },
    "RBLAY": {
        "short_name": "ROBINSON'S LAND CORP",
        "long_name": "Robinsons Land Corporation",
        "summary": "Robinsons Land Corporation, together with its subsidiaries, acquires, develops, operates, leases, disposes, and sells real properties in the Philippines. It operates through Commercial Centers Division, Residential Division, Office Buildings Division, Hotels and Resorts Division, and Infrastructure and Integrated Developments Division. The company also develops and sells residential condominium spaces, as well as horizontal residential projects; and develops and leases office spaces, as well as owns and operates a chain of hotels. In addition, it develops, leases, and manages shopping malls/commercial centers; and warehouse and logistics facilities, as well as focuses on strategic land bank acquisition. The company was founded in 1980 and is headquartered in Quezon City, the Philippines. Robinsons Land Corporation is a subsidiary of JG Summit Holdings, Inc.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Philippines",
        "city": "Quezon City"
    }
}