{
    "SPDI.L": {
        "short_name": "SECURE PROPERTY DEVELOPMENT & I",
        "long_name": "Secure Property Development & Investment Plc",
        "summary": "SPDI is a London listed property company focused on Emerging Europe (Romania, Bulgaria, Greece, Serbia) with a growing portfolio of prime commercial properties let to blue chip clients on long leases, which generates high yields and offers significant potential for capital growth thanks to highly favourable macro and regional property market fundamentals.",
        "currency": "GBp",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Ukraine",
        "city": null
    },
    "TR61.F": {
        "short_name": "TMM REAL EST.DEV.GDR S 1",
        "long_name": "TMM Real Estate Development Plc",
        "summary": "TMM Real Estate Development Plc, together with its subsidiaries, engages in the construction and development of residential and business properties primarily in Kyiv and Kharkiv regions in Ukraine. It operates through Investment Property, Property Development and Construction, and Utility Services segments. The Investment Property segment leases owned residential and commercial properties. The Property Development and Construction segment builds and sells residential and commercial properties; and offers construction services. The Utility Services segment provides utility services to tenants. It also produces concrete; metal ware; windows and other glass constructions; and ventilating and air-conditioning systems, as well as offers engineering and maintenance services. In addition, the company provides a range of services, such as design, assembling, certification, commissioning, and servicing of communication, television, and buildings automatics systems, as well as fire control and security systems; and designs and installs low voltage circuits, computers, and telephone and television networks. The company was founded in 1992 and is based in Kyiv, Ukraine. TMM Real Estate Development Plc is a subsidiary of TMM Holdings Ltd.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ukraine",
        "city": "Kyiv"
    }
}