{
    "ARO.L": {
        "short_name": "ARRICANO REAL ESTATE PLC ORD EU",
        "long_name": "Arricano Real Estate PLC",
        "summary": "Arricano Real Estate PLC, together with its subsidiaries, invests in, develops, and leases real estate properties in Ukraine and the Republic of Crimea. It develops and operates shopping and entertainment centers. As of December 31, 2019, it operated five shopping centers with a total leasable area of approximately 147,900 square meters in Kyiv, Simferopol, Zaporizhzhya, and Kryvyi Rig. The company was formerly known as Arricano Trading Limited and changed its name to Arricano Real Estate PLC in September 2012. Arricano Real Estate PLC was incorporated in 2008 and is based in Kyiv, Ukraine.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Ukraine",
        "state": null,
        "city": "Kiev",
        "zipcode": "01032",
        "website": "http://www.arricano.com",
        "market_cap": "Nano Cap"
    },
    "SPDI.L": {
        "short_name": "SECURE PROPERTY DEVELOPMENT & I",
        "long_name": "Secure Property Development & Investment Plc",
        "summary": "SPDI is a London listed property company focused on Emerging Europe (Romania, Bulgaria, Greece, Serbia) with a growing portfolio of prime commercial properties let to blue chip clients on long leases, which generates high yields and offers significant potential for capital growth thanks to highly favourable macro and regional property market fundamentals.",
        "currency": "GBp",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Ukraine",
        "state": null,
        "city": null,
        "zipcode": null,
        "website": "http://www.secure-property.eu",
        "market_cap": null
    },
    "TR61.F": {
        "short_name": "TMM REAL EST.DEV.GDR S 1",
        "long_name": "TMM Real Estate Development Plc",
        "summary": "TMM Real Estate Development Plc, together with its subsidiaries, engages in the construction and development of residential and business properties primarily in Kyiv and Kharkiv regions in Ukraine. The company undertakes residential, office, and commercial real estate projects; leases residential and commercial properties; and provides general contractor services to third parties. It also produces concrete; metal ware; windows and other glass constructions; and ventilating and air-conditioning systems, as well as offers engineering and maintenance services. In addition, the company offers various services, such as design, assemble, certification, commissioning, and servicing of communication, television, and buildings automatics systems, as well as fire control and security systems; and designs and installs low voltage circuits, computers, and telephone and television networks. The company was founded in 1992 and is based in Kyiv, Ukraine. TMM Real Estate Development Plc is a subsidiary of TMM Holdings Ltd.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ukraine",
        "state": null,
        "city": "Kiev",
        "zipcode": "01001",
        "website": "http://www.tmm.ua",
        "market_cap": "Nano Cap"
    }
}