{
    "ADSN.MX": {
        "short_name": "ADIDAS AG",
        "long_name": "adidas AG",
        "summary": "adidas AG, together with its subsidiaries, designs, develops, produces, and markets athletic and sports lifestyle products worldwide. The company operates in 10 segments: Europe, North America Adidas, North America Reebok, Asia-Pacific, Russia/CIS, Latin America, Emerging Markets, Adidas Golf, Runtastic, and Other Centrally Managed Businesses. It offers footwear; apparel; and hardware, such as bags, balls, and fitness equipment under the adidas and Reebok brands. The company is also involved in the operation of Runtastic, a digital health and fitness space; and Y-3 label business activities. It sells its products through approximately 2,500 own-retail stores; 15,000 mono-branded franchise stores; and 150,000 wholesale doors, as well as its e-commerce channel. The company was formerly known as adidas-Salomon AG and changed its name to adidas AG in June 2006. adidas AG was founded in 1920 and is headquartered in Herzogenaurach, Germany.",
        "currency": "MXN",
        "sector": "Consumer Goods",
        "industry": "Textile - Apparel Footwear & Accessories",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Germany",
        "city": "Herzogenaurach"
    },
    "BOSSN.MX": {
        "short_name": "HUGO BOSS AG",
        "long_name": "Hugo Boss AG",
        "summary": "Hugo Boss AG, together with its subsidiaries, develops, markets, and distributes fashion and accessories for men and women worldwide. The company offers business, casual, athleisure, and evening wear; shoes and accessories; and licensed products, including fragrances, eyewear, and watches, as well as children's fashion products. It markets and sells its products under the BOSS and HUGO brand names through online stores, freestanding stores, shop-in-shops, and factory outlets with approximately 7,450 sales points. Hugo Boss AG was founded in 1924 and is headquartered in Metzingen, Germany.",
        "currency": "MXN",
        "sector": "Consumer Goods",
        "industry": "Textile - Apparel Clothing",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Germany",
        "city": "Metzingen"
    },
    "CEV.DE": {
        "short_name": "CENTROTEC SE  INH O.N.",
        "long_name": "Centrotec SE",
        "summary": "Centrotec SE, together with its subsidiaries, develops, produces, and sells system solutions in the areas of heating, ventilation, and climate control technology for buildings worldwide. It operates in three segments: Climate Systems, Gas Flue Systems, and Medical Technology & Engineering Plastics. The company provides heating systems condensing boiler technology for oil and gas; solar thermal systems; heat pumps; and gas flue and air piping systems. It also offers construction materials for airtight and watertight buildings and roof products; ventilation systems for heat recovery; climate control systems; and combined head and power units for natural gas, sewage gas, and biogas. In addition, it also offers medical technology components and equipment, as well as plastic semi-finished and prefabricated products. Centrotec SE is based in Brilon, Germany.",
        "currency": "EUR",
        "sector": "Consumer Goods",
        "industry": "Rubber & Plastics",
        "exchange": "GER",
        "market": "de_market",
        "country": "Germany",
        "city": "Brilon"
    },
    "KGXN.MX": {
        "short_name": "KION GROUP AG",
        "long_name": "KION GROUP AG",
        "summary": "KION GROUP AG provides industrial trucks, warehouse technology, supply chain solutions, and related services worldwide. The company operates through Industrial Trucks and Services, and Supply Chain Solutions segments. It develops, manufactures, and sells forklifts and warehouse trucks, such as counterbalance trucks with electric drive and internal combustion engine, ride-on and hand-operated industrial trucks, towing vehicles, and automated trucks and autonomous trucks under the Linde, Fenwick, STILL, Baoli, and OM Voltas brand names. The company also manufactures and sells spare parts; leases industrial trucks and related items; offers maintenance and repair, and fleet management services, as well as finance solutions. In addition, it provides integrated technology and software solutions, including conveyors, sorters, storage and retrieval systems, picking equipment, palletisers, and robotic solutions under the Dematic brand name. The company was formerly known as KION Holding 1 GmbH. KION GROUP AG was founded in 2006 and is based in Frankfurt am Main, Germany.",
        "currency": "MXN",
        "sector": "Consumer Goods",
        "industry": "Trucks & Other Vehicles",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Germany",
        "city": "Frankfurt am Main"
    },
    "PUMN.MX": {
        "short_name": "PUMA SE",
        "long_name": "PUMA SE",
        "summary": "PUMA SE, together with its subsidiaries, designs, develops, sells, and markets footwear, apparel, and accessories. The company offers performance and sport-inspired lifestyle products in categories, such as football, cricket, running, training and fitness, golf, and motorsports. It also issues licenses to independent partners to design, develop, manufacture, and sell fragrances, eyewear, and watches. The company sells its products through PUMA stores and factory outlets, as well as through online stores. PUMA SE offers its products primarily under the PUMA and Cobra Golf brand names. PUMA SE has a strategic partnership with Porsche. The company was founded in 1924 and is headquartered in Herzogenaurach, Germany.",
        "currency": "MXN",
        "sector": "Consumer Goods",
        "industry": "Textile - Apparel Footwear & Accessories",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Germany",
        "city": "Herzogenaurach"
    },
    "SCE.DE": {
        "short_name": "SCHWEIZER ELECTR. NA O.N.",
        "long_name": "Schweizer Electronic AG",
        "summary": "Schweizer Electronic AG, together with its subsidiaries, develops, produces, and distributes printed circuit boards (PCBs) worldwide. The company offers sportive PCBs; and power electronics, including heavy copper, inlay, power combi, and IMS boards. It also provides embedding products and solutions, such as integrated interposer board for the embedding of logic semiconductors; power PCB; cavity boards for various solutions; and ÂµÂ² Pack for smallest, thinnest, and multi-chip semiconductor packages, as well as modules with direct pad contacting. In addition, the company offers system cost reduction solutions, including FR4 Flex with restricted installation possibilities; resistor print for integration of resistors as a passive component through thick-film technology carried out by screen printing process; high frequency PCBs for safety engineering for vehicles; electroless nickel-electroless palladium-autocatalytic gold surface finishes for automotive and industrial applications; and all in one PCBs for power electronics, embedding, and system cost reduction applications. It provides its products for the automotive, solar, aviation, and general industries; and electronic control units, motor drives, DC/DC and AC/DC converters, and consumer and mobile applications, as well as semiconductor packaging. Schweizer Electronic AG was founded in 1849 and is headquartered in Schramberg, Germany.",
        "currency": "EUR",
        "sector": "Consumer Goods",
        "industry": "Electronic Equipment",
        "exchange": "GER",
        "market": "de_market",
        "country": "Germany",
        "city": "Schramberg"
    }
}