{
  "ADSN.MX": {
    "city": "Herzogenaurach",
    "country": "Germany",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Textile - Apparel Footwear & Accessories",
    "long_name": "adidas AG",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Goods",
    "short_name": "ADIDAS AG",
    "state": null,
    "summary": "adidas AG, together with its subsidiaries, designs, develops, distributes, and markets athletic and sports lifestyle products worldwide. The company operates through ten segments: Europe, North America Adidas, North America Reebok, Asia-Pacific, Russia/CIS, Latin America, Emerging Markets, Adidas Golf, Runtastic, and Other Centrally Managed Businesses. It offers footwear; apparel; accessories and gear, such as bags, balls, and fitness equipment; and golf products under the adidas and Reebok brands. The company is also involved in the operation of Runtastic, a digital health and fitness space; and Y-3 label business activities. It sells its products through approximately 2,500 own-retail stores; mono-branded franchise stores; and wholesale distribution, as well as its e-commerce channel. The company was formerly known as adidas-Salomon AG and changed its name to adidas AG in June 2006. adidas AG was founded in 1920 and is headquartered in Herzogenaurach, Germany.",
    "website": "http://www.adidas-group.com",
    "zipcode": "91074"
  },
  "KGXN.MX": {
    "city": "Frankfurt am Main",
    "country": "Germany",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Trucks & Other Vehicles",
    "long_name": "KION GROUP AG",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Goods",
    "short_name": "KION GROUP AG",
    "state": null,
    "summary": "KION GROUP AG provides industrial trucks, warehouse technology, supply chain solutions, and related services worldwide. The company operates through Industrial Trucks and Services, Supply Chain Solutions, and Corporate Services segments. It develops, manufactures, and sells forklifts and warehouse trucks, such as counterbalance trucks with electric drive and internal combustion engine, ride-on and hand-operated industrial trucks, and towing vehicles under the Linde, Fenwick, STILL, Baoli, and OM Voltas brand names. The company also manufactures and sells spare parts; leases industrial trucks and related items; offers maintenance and repair, and fleet management services, as well as provides finance solutions. In addition, it provides integrated technology and software solutions, including conveyors, sorters, storage and retrieval systems, picking equipment, palletizers, and robotic solutions under the Dematic brand. The company was formerly known as KION Holding 1 GmbH. KION GROUP AG was founded in 2006 and is based in Frankfurt am Main, Germany.",
    "website": "http://www.kiongroup.com",
    "zipcode": "60549"
  },
  "N7G.DE": {
    "city": "Quierschied",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Rubber & Plastics",
    "long_name": "Nanogate AG",
    "market": "de_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Goods",
    "short_name": "NANOGATE SE I.A.INH. O.N.",
    "state": null,
    "summary": "Nanogate AG provides integrated systems for high-performance surfaces and components in Germany and internationally. It offers systems equipping plastic, metal, and other surfaces with various functions and properties, such as scratchproof, chemical resistance, UV protection, easy cleaning, hygienic features, de-misting, anti-static, or various tribological properties. The company is also involved in the industrial implementation of various high-performance surfaces, primarily for metal surfaces; provision of do-it-yourself systems for the cleaning, care, and protection of textiles under the feldten and Empire brands; and technical and optical enhancement of plastic and metal surface geometries. In addition, it engages in coating transparent plastics for buildings/interiors, aviation, and automotive/mechanical engineering sectors; surfaces on two-dimensional components; processing plastics; and the production, enhancement, and molding of flat glazing components used in special-purpose forestry vehicles. Further, the company offers coatings for decorative multifunctional surfaces for automotive industry and building services, as well as appliance manufacturers; provides services for the manufacture and processing of smaller and medium-sized design-oriented plastic components, as well as plastic surfaces and components; and develops and produces plastic articles for medical technology. Additionally, it manufactures traditional applications, such as leisure, home appliance, interior, and medical sectors. Its products are also used in various applications, including electrical and automation technology, construction, communication, and security applications. The company produces and sells its systems and applications in metals under the N-Metals brand; and sells applications with plastics primarily under the N-Glaze brand. Nanogate AG has a strategic collaboration agreement with ERBIWA GmbH. Nanogate AG is headquartered in Quierschied, Germany.",
    "website": "http://www.nanogate.de",
    "zipcode": "66287"
  },
  "PUMN.MX": {
    "city": "Herzogenaurach",
    "country": "Germany",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Textile - Apparel Footwear & Accessories",
    "long_name": "PUMA SE",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Goods",
    "short_name": "PUMA SE",
    "state": null,
    "summary": "PUMA SE, together with its subsidiaries, designs, develops, sells, and markets footwear, apparel, and accessories in Europe, the Middle East, Africa, the Americas and, the Asia Pacific. The company offers performance and sport-inspired lifestyle products in categories, such as football, cricket, handball, rugby, volleyball, running, training and fitness, golf, and motorsports. It also issues licenses to independent partners to design, develop, manufacture, and sell watches, glasses, safety shoes, and gaming accessories such as the Playseat. The company sells its products through PUMA retail stores and factory outlets, as well as through online stores. It offers its products primarily under the PUMA and Cobra Golf brand names. The company was founded in 1924 and is headquartered in Herzogenaurach, Germany.",
    "website": "http://www.puma.com",
    "zipcode": "91074"
  },
  "SCE.DE": {
    "city": "Schramberg",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Electronic Equipment",
    "long_name": "Schweizer Electronic AG",
    "market": "de_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Goods",
    "short_name": "SCHWEIZER ELECTR. NA O.N.",
    "state": null,
    "summary": "Schweizer Electronic AG, together with its subsidiaries, develops, produces, and distributes printed circuit boards (PCBs) worldwide. The company offers sportive PCBs; and power electronics, including heavy copper, inlay, power combi, and IMS boards. It also provides embedding products and solutions, such as integrated interposer board for the embedding of logic semiconductors; power PCB; cavity boards for various solutions; and µ² Pack for smallest, thinnest, and multi-chip semiconductor packages, as well as modules with direct pad contacting. In addition, the company offers system cost reduction solutions, including FR4 Flex with restricted installation possibilities; resistor print for integration of resistors as a passive component through thick-film technology carried out by screen printing process; high frequency PCBs for safety engineering for vehicles; electroless nickel-electroless palladium-autocatalytic gold surface finishes for automotive and industrial applications; and all in one PCBs for power electronics, embedding, and system cost reduction applications. It provides its products for the automotive, solar, aviation, and general industries; and electronic control units, motor drives, DC/DC and AC/DC converters, and consumer and mobile applications, as well as semiconductor packaging. Schweizer Electronic AG was founded in 1849 and is headquartered in Schramberg, Germany.",
    "website": "http://www.schweizer.ag",
    "zipcode": "78713"
  }
}
