{
    "0001.HK": {
        "short_name": "CKH HOLDINGS",
        "long_name": "CK Hutchison Holdings Limited",
        "summary": "CK Hutchison Holdings Limited, an investment holding company, operates in ports and related services, retail, infrastructure, energy, and telecommunications businesses worldwide. The company invests in, develops, and operates ports, which operate 283 berths in 52 ports spanning 26 countries; and provides logistics and transportation-related services, such as cruise ship terminals, airport operations, distribution centers, rail services, and ship repair facilities. It also operates a network of 16,167 retail stores that offer personal care, health and beauty products, food and fine wines, consumer electronics, and electrical appliances in Asia and Europe, as well as operates supermarkets; and manufactures and distributes bottled water and beverages under the Watsons Water and Mr. Juicy brands in Hong Kong and Mainland China. In addition, the company invests in energy infrastructure, transportation infrastructure, water infrastructure, waste management, energy-from-waste, household infrastructure, and other infrastructure related businesses primarily in Hong Kong, Mainland China, the United Kingdom, Continental Europe, Australia, New Zealand, and Canada. Further, it provides mobile telecommunications and data services, as well as operates as an integrated energy company in the United States and the Asia Pacific. Additionally, it manufactures and sells pharmaceuticals and healthcare products; researches, develops, manufactures, commercializes, markets, and sells nutraceuticals, pharmaceuticals, and agriculture-related products; provides marine construction and ship repair yard, water and sewerage, gas distribution, and aircraft maintenance services; and leases rolling stocks. CK Hutchison Holdings Limited was incorporated in 2014 and is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.ckh.com.hk",
        "full_time_employees": null
    },
    "0019.HK": {
        "short_name": "SWIRE PACIFIC A",
        "long_name": "Swire Pacific Limited",
        "summary": "Swire Pacific Limited engages in property, aviation, beverages, marine services, and trading and industrial businesses in Hong Kong, Mainland China, rest of Asia, the United States, and internationally. Its Property division develops, owns, and operates mixed-use properties. This division's property investment portfolio comprises office and retail premises, serviced apartments, other luxury residential accommodations, and commercial mixed-use developments; and trading portfolio consists of residential properties. It also owns and manages two hotels in Hong Kong and four hotels in Mainland China, as well as owns interests in the Mandarin Oriental hotel in the United States. The company's Aviation division provides scheduled passenger and cargo services, and aviation maintenance and repair services. As of December 31, 2020, it had a fleet of 239 aircraft. Its Beverages division owns rights to manufacture, market, and distribute refreshing soft drinks to consumers. The company's Marine Services division owns and operates offshore support vessels servicing the energy industry in the offshore production and exploration region outside the United States; and has a windfarm installation business, as well as offshore drilling, production, exploration, platform construction, subsea inspection, maintenance, and repair business. It operates a fleet of 61 offshore support vessels. The company's Trading & Industrial division retails and distributes footwear, apparel, and accessories through its 172 retail outlets; sells passenger cars, commercial vehicles, motorcycles, and scooters; operates a chain of 546 bakery stores; packages and sells sugar products under the Taikoo Sugar brand; and offers waste management services. The company was founded in 1816 and is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.swirepacific.com",
        "full_time_employees": 86768
    },
    "0025.HK": {
        "short_name": "CHEVALIER INT'L",
        "long_name": "Chevalier International Holdings Limited",
        "summary": "Chevalier International Holdings Limited, an investment holding company, engages in the construction and engineering, property investment and development, healthcare investment, car dealership, and other businesses. The company's Construction and Engineering segment offers construction and engineering work for aluminum window and curtain walls, building construction, building supplies, lifts and escalators, and pipe technology, as well as electrical and mechanical, and environmental engineering. Its Property Investment segment engages in the rental of properties. The company's Property Development and Operations segment engages in the property development and management, cold storage, logistics, and hotel operations. The company's Healthcare Investment segment is involved in the senior housing and medical office building investment. Its Car Dealership segment retails, trades in, and services motor vehicles. The company's Others segment engages in the sale and service of information technology equipment and business machines; food trading business; investment in securities; and operation of restaurants and bars. It also engages in the sale and servicing of automobiles; supply and installation of building materials; grocery trading; building construction and maintenance; installation of electrical and mechanical equipment; insurance brokerage and underwriting; trading and servicing of computers; and installation of air-conditioning systems. In addition, the company trades in telecommunication equipment, lifts, escalators, electrical and mechanical equipment, and motor vehicles; and provides management, corporate management, project management, network systems and solution, security, property management consultation, maintenance, and general construction services. It operates in Hong Kong, Mainland China, Macau, Australia, Canada, Singapore, the United States, Thailand, and internationally. The company was founded in 1970 and is headquartered in Kowloon Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon Bay",
        "zipcode": null,
        "website": "http://www.chevalier.com",
        "full_time_employees": 4000
    },
    "0053.HK": {
        "short_name": "GUOCO GROUP",
        "long_name": "Guoco Group Limited",
        "summary": "Guoco Group Limited, together with its subsidiaries, engages in the investment, property investment and development, hospitality and leisure, and financial service businesses. The company's Principal Investment segment offers equity and direct investment activities and treasury operations with trading and strategic investments in global capital markets. Its Property Development and Investment segment develops residential and commercial properties and holds properties for rental income in Singapore, China, Malaysia, Vietnam, and Hong Kong. The company's Hospitality and Leisure Business segment owns, leases, and manages hotels; and operates gaming and leisure businesses in United Kingdom, Spain, and Belgium. This segment owns and operates hotels under Amba, Guoman, Thistle, and Thistle Express brands. It offers Mecca, a bingo operator in Great Britain with 77 clubs; Grosvenor Casinos, a casino operator with 52 casinos in Great Britain, and 1 casino in Belgium; and Enracha, an operator of 9 bingo clubs in Spain. Its Financial Services segment provides commercial and consumer, Islamic, and investment banking services; and life and general insurance, Takaful insurance, fund management and unit trust, stock broking, and corporate advisory services. The company also offers royalty entitlement of Bass Strait's oil and gas production, manufactures, marketing, and distribution of health products. In addition, it provides hotel and property management, marketing and maintenance services, support services for interactive gaming, funding, and trustee services; and apiculture services, which includes manufacture and distribution of New Zealand natural healthcare products. The company operates in the People's Republic of China, the United Kingdom and Continental Europe, Singapore, Australasia, and internationally. The company is based in Central, Hong Kong. Guoco Group Limited is a subsidiary of GuoLine Overseas Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.guoco.com",
        "full_time_employees": 9800
    },
    "0071.HK": {
        "short_name": "MIRAMAR HOTEL",
        "long_name": "Miramar Hotel and Investment Company, Limited",
        "summary": "Miramar Hotel and Investment Company, Limited, an investment holding company, engages in property rental, hotels and serviced apartments, food and beverage, and travel businesses in Hong Kong and Mainland China. The company operates in five segments: Property Rental, Hotels and Serviced Apartments, Food and Beverage Operation, Travel Operation, and Others. It leases office and retail premises; and operates hotels and serviced apartments, as well as provides hotel management services. The company also operates restaurants; offers travel agency, property management, and financial services; and sells properties. Miramar Hotel and Investment Company, Limited was founded in 1948 and is based in Tsim Sha Tsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.miramar-group.com",
        "full_time_employees": 1241
    },
    "0087.HK": {
        "short_name": "SWIRE PACIFIC B",
        "long_name": "Swire Pacific Limited",
        "summary": "Swire Pacific Limited engages in property, aviation, beverages, marine services, and trading and industrial businesses in Hong Kong, Mainland China, rest of Asia, the United States, and internationally. Its Property division develops, owns, and operates mixed-use properties. This division's property investment portfolio comprises office and retail premises, serviced apartments, other luxury residential accommodations, and commercial mixed-use developments; and trading portfolio consists of residential properties. It also owns and manages two hotels in Hong Kong and four hotels in Mainland China, as well as owns interests in the Mandarin Oriental hotel in the United States. The company's Aviation division provides scheduled passenger and cargo services, and aviation maintenance and repair services. As of December 31, 2020, it had a fleet of 239 aircraft. Its Beverages division owns rights to manufacture, market, and distribute refreshing soft drinks to consumers. The company's Marine Services division owns and operates offshore support vessels servicing the energy industry in the offshore production and exploration region outside the United States; and has a windfarm installation business, as well as offshore drilling, production, exploration, platform construction, subsea inspection, maintenance, and repair business. It operates a fleet of 61 offshore support vessels. The company's Trading & Industrial division retails and distributes footwear, apparel, and accessories through its 172 retail outlets; sells passenger cars, commercial vehicles, motorcycles, and scooters; operates a chain of 546 bakery stores; packages and sells sugar products under the Taikoo Sugar brand; and offers waste management services. The company was founded in 1816 and is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.swirepacific.com",
        "full_time_employees": 86768
    },
    "0148.HK": {
        "short_name": "KINGBOARD HLDG",
        "long_name": "Kingboard Holdings Limited",
        "summary": "Kingboard Holdings Limited, an investment holding company, manufactures and sells laminates and printed circuit boards. The company also offers chemical products, including coke, methanol, benzene, tar, acetic acid, propylene, methyl tert-butyl ether, liquefied petroleum gas, phenol, acetone, bisphenol A, caustic soda, polyvinyl chloride, hydrochloric acid, liquefied chlorine, chlorinated wax, sodium sulfate, formalin, hydrogen peroxide, and tetrabromobisphenol. In addition, it is involved in the manufacture and distribution of magnetic and glass fabric products; property investment and development activities; rental of commercial properties; sales of residential units; and refining and distribution of chemicals. The company sells its products in the People's Republic of China, Thailand, Japan, Korea, Singapore, Europe, and the United States. The company was formerly known as Kingboard Chemical Holdings Limited and changed its name to Kingboard Holdings Limited in July 2018. Kingboard Holdings Limited was incorporated in 1993 and is headquartered in Sha Tin, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sha Tin",
        "zipcode": null,
        "website": "http://www.kingboard.com",
        "full_time_employees": 36000
    },
    "0474.HK": {
        "short_name": "ACESO LIFE SCI",
        "long_name": "Aceso Life Science Group Limited",
        "summary": "Aceso Life Science Group Limited, an investment holding company, engages in the financial services, money lending, rental of construction machinery, property investment, and health care businesses in Hong Kong, Macau, the United Kingdom, and the Peoples Republic of China. It provides property mortgage and personal loans to individuals, corporates, and high net worth clients, as well as unsecured loans to individual high net worth customers; commodities, futures, and securities brokerage services; asset management and other financial services; and transportation services, as well as rents and trades in construction machinery and spare parts. The company also retails men and women apparels; sells construction materials; and offers management services. The company was formerly known as Hao Tian Development Group Limited and changed its name to Aceso Life Science Group Limited in October 2020. The company was incorporated in 2005 and is based in Wanchai, Hong Kong. Aceso Life Science Group Limited is a subsidiary of Asia Link Capital Investment Holdings Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.acesogrouphk.com",
        "full_time_employees": 192
    },
    "1063.HK": {
        "short_name": "SUNCORP TECH",
        "long_name": "Suncorp Technologies Limited",
        "summary": "Suncorp Technologies Limited, an investment holding company, designs, manufactures, markets, and sells residential telephone and related products for residential and office use under the Motorola brand. It also engages in processing and trading of used computer-related components, such as integrated circuit chips, hard disks, and motherboards; and B2B cross-border e-commerce business. In addition, the company provides money lending, securities brokerage, and placing and underwriting services. It operates in the People's Republic of China, Australia, India, Indonesia, Korea, Spain, the United States, and internationally. Suncorp Technologies Limited was incorporated in 1994 and is based in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.suncorptech.com.hk",
        "full_time_employees": null
    },
    "1094.HK": {
        "short_name": "C P PROCUREMENT",
        "long_name": "China Public Procurement Limited",
        "summary": "China Public Procurement Limited, an investment holding company, engages in the trading of various products in the People's Republic of China. It operates through four segments: Public Procurement, Trading Business, Provision of Corporate IT Solution, and Rental Income. The company's activities also include the development and operation of electronic public procurement platforms; and provision of procurement information and other added value services, including supplier authentication, financial services, supply chain management, etc., as well as provision of public procurement services to users of the procurement platforms. It also develops software and provides maintenance services to its customers in Wuhan, Hubei Province. The company was formerly known as Sunny Global Holdings Limited and changed its name to China Public Procurement Limited in May 2009. China Public Procurement Limited is headquartered in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.cpphk1094.com",
        "full_time_employees": 120
    },
    "1282.HK": {
        "short_name": "GLORY SUN FIN",
        "long_name": "Glory Sun Financial Group Limited",
        "summary": "Glory Sun Financial Group Limited engages in property investment and development business. It invests in property development and investment, new energy, technology, and healthcare industries; and involved in the automation, securities investment, and trading of commodities businesses. The company also offers financial services, including wealth management, asset management, global securities and futures, corporate finance, precious metals trading, financial planning and credit, private fund, finance leasing, etc. In addition, it produces SMT assembly and semiconductor packaging equipment and other services. Further, the company provides bullion trading, money lending, securities brokerage, insurance, and corporate management consultancy, finance leasing, and education and training services. Additionally, it trades in machines and spare parts, and seafood, as well as operates yacht club and golf practice court. The company was formerly known as China Goldjoy Group Limited and changed its name to Glory Sun Financial Group Limited in May 2019. Glory Sun Financial Group Limited was founded in 2009 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hk1282.com",
        "full_time_employees": 1036
    },
    "1303.HK": {
        "short_name": "HUILI RES",
        "long_name": "Huili Resources (Group) Limited",
        "summary": "Huili Resources (Group) Limited, an investment holding company, engages in mining, processing, and selling mineral ores in the People's Republic of China. The company operates through three segments: Mining, Trading Business, and Financial Services. The Mining segment mines, processed, and sells gold, nickel, copper, lead, and zinc; and holds three exploration permits in Xinjiang. The Trading segment engages in the trading of coal. The Financial Services segment provides finance services. It also provides management and investment consultation; and engineering services. The company was formerly known as Realty Resources (Group) Limited and changed its name to Huili Resources (Group) Limited in May 2010. Huili Resources (Group) Limited was incorporated in 2010 and is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.huili.hk",
        "full_time_employees": 33
    },
    "1468.HK": {
        "short_name": "KINGKEY FIN INT",
        "long_name": "Kingkey Financial International (Holdings) Limited",
        "summary": "Kingkey Financial International (Holdings) Limited, an investment holding company, engages in the insurance brokerage business in the People's Republic of China, Hong Kong, and Denmark. It operates through Securities, Insurance Brokerage, Fur, and Other segments. The Securities segment offers securities brokerage, margin financing, underwriting, placing, and consultancy services. The Insurance brokerage segment provides insurance brokerage and wealth management services. The Fur segment engages in breeding, farming and sale of livestocks and pelted skin, fur skin brokerage, and financing services; and trading of fur skin of foxes and minks. The Other segment provides money lending services. The company was formerly known as UKF (Holdings) Limited and changed its name to Kingkey Financial International (Holdings) Limited in November 2019. Kingkey Financial International (Holdings) Limited was founded in 2009 and is headquartered in Kowloon, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.ukf.com.hk",
        "full_time_employees": 74
    },
    "2322.HK": {
        "short_name": "HK CHAOSHANG GP",
        "long_name": "Hong Kong ChaoShang Group Limited",
        "summary": "Hong Kong ChaoShang Group Limited, an investment holding company, engages in vessel chartering, trading, money lending, factoring, and finance leasing businesses in the People's Republic of China and Southeast Asia. It owns a multi-purpose deck cargo ship for carriage of construction material and waste. The company also trades in molds, electronics products, seafood, frozen meats and food, and methanol; and provides factoring, entrusted loan financing, and finance leasing and sale-leaseback services. In addition, it provides consultancy; securities brokerage, underwriting, placing, margin financing; and asset management services. The company was formerly known as Noble Century Investment Holdings Limited and changed its name to Hong Kong ChaoShang Group Limited in August 2019. Hong Kong ChaoShang Group Limited was incorporated in 2002 is based in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.noblecentury.hk",
        "full_time_employees": 64
    },
    "2327.HK": {
        "short_name": "MEILLEUREHEALTH",
        "long_name": "Meilleure Health International Industry Group Limited",
        "summary": "Meilleure Health International Industry Group Limited, an investment holding company, engages in industrial hemp, healthcare-related, trading, agency service, property investment and leasing, and property development businesses in Hong Kong, the People's Republic of China, and internationally. The company is involved in the trading of construction materials; development and selling of residential properties; leasing of investment properties; and sale of healthcare-related products. It also provides real estate agency services; cannabidiol downstream product application services; health management services, including anti-aging, aesthetic medicine, and other medical consulting; and healthcare related product sale agency services. The company was formerly known as U-Home Group Holdings Limited and changed its name to Meilleure Health International Industry Group Limited in March 2017. Meilleure Health International Industry Group Limited is headquartered in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.meilleure.com.cn",
        "full_time_employees": 115
    },
    "8022.HK": {
        "short_name": "EVERSHINE GP",
        "long_name": "Evershine Group Holdings Limited",
        "summary": "Evershine Group Holdings Limited, an investment holding company, engages in trading, property development and investment, money lending, mobile application, and cemetery businesses in the People's Republic of China, Hong Kong, and Turkey. It is involved in the trading of chrome ores; building construction, property development, and leasing of properties; trading of construction materials; and retail trade of window frames, doors, and wardrobes, as well as the provision of consultancy and money lending services. The company also constructs and operates cemeteries; develops mobile games; and publishes games and applications, as well as provides related solutions. In addition, it engages in the fashion garment and rental business. The company was formerly known as TLT Lottotainment Group Limited and changed its name to Evershine Group Holdings Limited in November 2014. Evershine Group Holdings Limited was founded in 1997 and is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.evershinegroup.com.hk",
        "full_time_employees": 15
    },
    "8149.HK": {
        "short_name": "ALTUS HLDGS",
        "long_name": "Altus Holdings Limited",
        "summary": "Altus Holdings Limited provides corporate finance and property investment services in Hong Kong and Japan. The company operates through Corporate Finance Services and Property Investment. It offers corporate finance services, including sponsorship, financial advisory, and compliance advisory services. The company also leases investment properties for residential and commercial use; and provides administrative services. Altus Holdings Limited was founded in 2000 and is headquartered in Central, Hong Kong. Altus Holdings Limited is a subsidiary of Kinley-Hecico Holdings Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.altus.com.hk",
        "full_time_employees": 23
    },
    "BJEB.F": {
        "short_name": "BEIJING ENTERPRISES",
        "long_name": "Beijing Enterprises Holdings Limited",
        "summary": "Beijing Enterprises Holdings Limited, an investment holding company, engages in piped gas, brewery, water and environmental, solid waste treatment, and other businesses in Mainland China and Germany. Its Piped Gas Operation segment distributes and sells piped natural gas and gas-related equipment; provides natural gas transmission services, as well as repair and maintenance services; surveys and plots underground construction projects; and installs gas pipelines and related equipment. The company's Brewery Operation segment produces, distributes, and sells brewery products. Its Water and Environmental segment constructs sewage and water treatment plants and other infrastructural facilities; provides construction services for renovation projects; offers sewage treatment, and water treatment and distribution services, as well as consultancy services; and licenses technical know-how related to sewage treatment. The company's Solid Waste Treatment segment is involved in the construction and operation of waste incineration plants; waste treatment; sale of electricity; generation of heat and stream from waste incineration. Its Corporate and Others segment offers consultation and property investment services. The company also engages in the production and sale of beer; and issue of guaranteed bonds and notes. Beijing Enterprises Holdings Limited was founded in 1997 and is based in Wan Chai, Hong Kong. Beijing Enterprises Holdings Limited is a subsidiary of Beijing Enterprises Group (BVI) Company Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.behl.com.hk",
        "full_time_employees": 39000
    },
    "CKHUF": {
        "short_name": "CK HUTCHISON HOLDINGS LIMITED",
        "long_name": "CK Hutchison Holdings Limited",
        "summary": "CK Hutchison Holdings Limited, an investment holding company, operates in ports and related services, retail, infrastructure, energy, and telecommunications businesses worldwide. The company invests in, develops, and operates ports, which operate 283 berths in 52 ports spanning 26 countries; and provides logistics and transportation-related services, such as cruise ship terminals, airport operations, distribution centers, rail services, and ship repair facilities. It also operates a network of 16,167 retail stores that offer personal care, health and beauty products, food and fine wines, consumer electronics, and electrical appliances in Asia and Europe, as well as operates supermarkets; and manufactures and distributes bottled water and beverages under the Watsons Water and Mr. Juicy brands in Hong Kong and Mainland China. In addition, the company invests in energy infrastructure, transportation infrastructure, water infrastructure, waste management, energy-from-waste, household infrastructure, and other infrastructure related businesses primarily in Hong Kong, Mainland China, the United Kingdom, Continental Europe, Australia, New Zealand, and Canada. Further, it provides mobile telecommunications and data services, as well as operates as an integrated energy company in the United States and the Asia Pacific. Additionally, it manufactures and sells pharmaceuticals and healthcare products; researches, develops, manufactures, commercializes, markets, and sells nutraceuticals, pharmaceuticals, and agriculture-related products; provides marine construction and ship repair yard, water and sewerage, gas distribution, and aircraft maintenance services; and leases rolling stocks. CK Hutchison Holdings Limited was incorporated in 2014 and is based in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.ckh.com.hk",
        "full_time_employees": null
    },
    "CKHUY": {
        "short_name": "CK HUTCHISON HOLDINGS LIMITED",
        "long_name": "CK Hutchison Holdings Limited",
        "summary": "CK Hutchison Holdings Limited, an investment holding company, operates in ports and related services, retail, infrastructure, energy, and telecommunications businesses worldwide. The company invests in, develops, and operates ports, which operate 283 berths in 52 ports spanning 26 countries; and provides logistics and transportation-related services, such as cruise ship terminals, airport operations, distribution centers, rail services, and ship repair facilities. It also operates a network of 16,167 retail stores that offer personal care, health and beauty products, food and fine wines, consumer electronics, and electrical appliances in Asia and Europe, as well as operates supermarkets; and manufactures and distributes bottled water and beverages under the Watsons Water and Mr. Juicy brands in Hong Kong and Mainland China. In addition, the company invests in energy infrastructure, transportation infrastructure, water infrastructure, waste management, energy-from-waste, household infrastructure, and other infrastructure related businesses primarily in Hong Kong, Mainland China, the United Kingdom, Continental Europe, Australia, New Zealand, and Canada. Further, it provides mobile telecommunications and data services, as well as operates as an integrated energy company in the United States and the Asia Pacific. Additionally, it manufactures and sells pharmaceuticals and healthcare products; researches, develops, manufactures, commercializes, markets, and sells nutraceuticals, pharmaceuticals, and agriculture-related products; provides marine construction and ship repair yard, water and sewerage, gas distribution, and aircraft maintenance services; and leases rolling stocks. CK Hutchison Holdings Limited was incorporated in 2014 and is based in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.ckh.com.hk",
        "full_time_employees": null
    },
    "CPF.F": {
        "short_name": "CITIC LTD.",
        "long_name": "CITIC Limited",
        "summary": "CITIC Limited operates in the financial services, resources and energy, manufacturing, engineering contracting, and real estate businesses in China and internationally. The company offers banking products and services; investment banking, brokerage, securities trading and lending, and asset management services; financial, wealth management, and trust services; and life, health, and accident insurance, as well as reinsurance products. It also engages in the exploration, development, and production of oil; coal mining; import and export of commodities; aluminum smelting; bauxite mining; alumina refining; manganese mining and processing; development of iron ore mine; production of copper and ferroniobium; and operation of coal-fired power stations. In addition, the company manufactures special steel, bars, plates, steel tubes, forged steel, wires, and casting billets. Further, it provides engineering contracting services for infrastructure, housing, municipal, and industrial facilities, as well as agriculture, energy, and resources sectors; and engineering services in the areas of urban development and ecological preservation projects. Additionally, the company engages in the urban renewal and development projects, including residential properties; ownership and operation of a portfolio of commercial and industrial properties; provision of telecommunication services; investment and management of ports and port terminals; distribution of motor vehicles and related services, food and FMCG products, and healthcare and electrical products; and provision of logistics, commercial aviation, and publication services. The company was formerly known as CITIC Pacific Limited and changed its name to CITIC Limited in August 2014. The company was founded in 1987 and is headquartered in Beijing, China. CITIC Limited is a subsidiary of CITIC Group Corporation.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": "100020",
        "website": "http://www.citic.com",
        "full_time_employees": 135304
    },
    "CPF0.F": {
        "short_name": "CITIC LTD. ADR/5  HD-,40",
        "long_name": "CITIC Limited",
        "summary": "CITIC Limited operates in the financial services, resources and energy, manufacturing, engineering contracting, and real estate businesses in China and internationally. The company offers banking products and services; investment banking, brokerage, securities trading and lending, and asset management services; financial, wealth management, and trust services; and life, health, and accident insurance, as well as reinsurance products. It also engages in the exploration, development, and production of oil; coal mining; import and export of commodities; aluminum smelting; bauxite mining; alumina refining; manganese mining and processing; development of iron ore mine; production of copper and ferroniobium; and operation of coal-fired power stations. In addition, the company manufactures special steel, bars, plates, steel tubes, forged steel, wires, and casting billets. Further, it provides engineering contracting services for infrastructure, housing, municipal, and industrial facilities, as well as agriculture, energy, and resources sectors; and engineering services in the areas of urban development and ecological preservation projects. Additionally, the company engages in the urban renewal and development projects, including residential properties; ownership and operation of a portfolio of commercial and industrial properties; provision of telecommunication services; investment and management of ports and port terminals; distribution of motor vehicles and related services, food and FMCG products, and healthcare and electrical products; and provision of logistics, commercial aviation, and publication services. The company was formerly known as CITIC Pacific Limited and changed its name to CITIC Limited in August 2014. The company was founded in 1987 and is headquartered in Beijing, China. CITIC Limited is a subsidiary of CITIC Group Corporation.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": "100020",
        "website": "http://www.citic.com",
        "full_time_employees": 135304
    },
    "CTPCF": {
        "short_name": "CITIC LIMITED",
        "long_name": "CITIC Limited",
        "summary": "CITIC Limited operates in the financial services, resources and energy, manufacturing, engineering contracting, and real estate businesses in China and internationally. The company offers banking products and services; investment banking, brokerage, securities trading and lending, and asset management services; financial, wealth management, and trust services; and life, health, and accident insurance, as well as reinsurance products. It also engages in the exploration, development, and production of oil; coal mining; import and export of commodities; aluminum smelting; bauxite mining; alumina refining; manganese mining and processing; development of iron ore mine; production of copper and ferroniobium; and operation of coal-fired power stations. In addition, the company manufactures special steel, bars, plates, steel tubes, forged steel, wires, and casting billets. Further, it provides engineering contracting services for infrastructure, housing, municipal, and industrial facilities, as well as agriculture, energy, and resources sectors; and engineering services in the areas of urban development and ecological preservation projects. Additionally, the company engages in the urban renewal and development projects, including residential properties; ownership and operation of a portfolio of commercial and industrial properties; provision of telecommunication services; investment and management of ports and port terminals; distribution of motor vehicles and related services, food and FMCG products, and healthcare and electrical products; and provision of logistics, commercial aviation, and publication services. The company was formerly known as CITIC Pacific Limited and changed its name to CITIC Limited in August 2014. The company was founded in 1987 and is headquartered in Beijing, China. CITIC Limited is a subsidiary of CITIC Group Corporation.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": "100020",
        "website": "http://www.citic.com",
        "full_time_employees": 135304
    },
    "CTPCY": {
        "short_name": "CITIC LIMITED",
        "long_name": "CITIC Limited",
        "summary": "CITIC Limited operates in the financial services, resources and energy, manufacturing, engineering contracting, and real estate businesses in China and internationally. The company offers banking products and services; investment banking, brokerage, securities trading and lending, and asset management services; financial, wealth management, and trust services; and life, health, and accident insurance, as well as reinsurance products. It also engages in the exploration, development, and production of oil; coal mining; import and export of commodities; aluminum smelting; bauxite mining; alumina refining; manganese mining and processing; development of iron ore mine; production of copper and ferroniobium; and operation of coal-fired power stations. In addition, the company manufactures special steel, bars, plates, steel tubes, forged steel, wires, and casting billets. Further, it provides engineering contracting services for infrastructure, housing, municipal, and industrial facilities, as well as agriculture, energy, and resources sectors; and engineering services in the areas of urban development and ecological preservation projects. Additionally, the company engages in the urban renewal and development projects, including residential properties; ownership and operation of a portfolio of commercial and industrial properties; provision of telecommunication services; investment and management of ports and port terminals; distribution of motor vehicles and related services, food and FMCG products, and healthcare and electrical products; and provision of logistics, commercial aviation, and publication services. The company was formerly known as CITIC Pacific Limited and changed its name to CITIC Limited in August 2014. The company was founded in 1987 and is headquartered in Beijing, China. CITIC Limited is a subsidiary of CITIC Group Corporation.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": "100020",
        "website": "http://www.citic.com",
        "full_time_employees": 135304
    },
    "GULRF": {
        "short_name": "GUOCO GROUP",
        "long_name": "Guoco Group Limited",
        "summary": "Guoco Group Limited, together with its subsidiaries, engages in the investment, property investment and development, hospitality and leisure, and financial service businesses. The company's Principal Investment segment offers equity and direct investment activities and treasury operations with trading and strategic investments in global capital markets. Its Property Development and Investment segment develops residential and commercial properties and holds properties for rental income in Singapore, China, Malaysia, Vietnam, and Hong Kong. The company's Hospitality and Leisure Business segment owns, leases, and manages hotels; and operates gaming and leisure businesses in United Kingdom, Spain, and Belgium. This segment owns and operates hotels under Amba, Guoman, Thistle, and Thistle Express brands. It offers Mecca, a bingo operator in Great Britain with 77 clubs; Grosvenor Casinos, a casino operator with 52 casinos in Great Britain, and 1 casino in Belgium; and Enracha, an operator of 9 bingo clubs in Spain. Its Financial Services segment provides commercial and consumer, Islamic, and investment banking services; and life and general insurance, Takaful insurance, fund management and unit trust, stock broking, and corporate advisory services. The company also offers royalty entitlement of Bass Strait's oil and gas production, manufactures, marketing, and distribution of health products. In addition, it provides hotel and property management, marketing and maintenance services, support services for interactive gaming, funding, and trustee services; and apiculture services, which includes manufacture and distribution of New Zealand natural healthcare products. The company operates in the People's Republic of China, the United Kingdom and Continental Europe, Singapore, Australasia, and internationally. The company is based in Central, Hong Kong. Guoco Group Limited is a subsidiary of GuoLine Overseas Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.guoco.com",
        "full_time_employees": 9800
    },
    "GULRY": {
        "short_name": "GUOCO GROUP",
        "long_name": "Guoco Group Limited",
        "summary": "Guoco Group Limited, together with its subsidiaries, engages in the investment, property investment and development, hospitality and leisure, and financial service businesses. The company's Principal Investment segment offers equity and direct investment activities and treasury operations with trading and strategic investments in global capital markets. Its Property Development and Investment segment develops residential and commercial properties and holds properties for rental income in Singapore, China, Malaysia, Vietnam, and Hong Kong. The company's Hospitality and Leisure Business segment owns, leases, and manages hotels; and operates gaming and leisure businesses in United Kingdom, Spain, and Belgium. This segment owns and operates hotels under Amba, Guoman, Thistle, and Thistle Express brands. It offers Mecca, a bingo operator in Great Britain with 77 clubs; Grosvenor Casinos, a casino operator with 52 casinos in Great Britain, and 1 casino in Belgium; and Enracha, an operator of 9 bingo clubs in Spain. Its Financial Services segment provides commercial and consumer, Islamic, and investment banking services; and life and general insurance, Takaful insurance, fund management and unit trust, stock broking, and corporate advisory services. The company also offers royalty entitlement of Bass Strait's oil and gas production, manufactures, marketing, and distribution of health products. In addition, it provides hotel and property management, marketing and maintenance services, support services for interactive gaming, funding, and trustee services; and apiculture services, which includes manufacture and distribution of New Zealand natural healthcare products. The company operates in the People's Republic of China, the United Kingdom and Continental Europe, Singapore, Australasia, and internationally. The company is based in Central, Hong Kong. Guoco Group Limited is a subsidiary of GuoLine Overseas Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.guoco.com",
        "full_time_employees": 9800
    },
    "GUO.F": {
        "short_name": "GUOCO GRP LTD  DL-,50",
        "long_name": "Guoco Group Limited",
        "summary": "Guoco Group Limited, together with its subsidiaries, engages in the investment, property investment and development, hospitality and leisure, and financial service businesses. The company's Principal Investment segment offers equity and direct investment activities and treasury operations with trading and strategic investments in global capital markets. Its Property Development and Investment segment develops residential and commercial properties and holds properties for rental income in Singapore, China, Malaysia, Vietnam, and Hong Kong. The company's Hospitality and Leisure Business segment owns, leases, and manages hotels; and operates gaming and leisure businesses in United Kingdom, Spain, and Belgium. This segment owns and operates hotels under Amba, Guoman, Thistle, and Thistle Express brands. It offers Mecca, a bingo operator in Great Britain with 77 clubs; Grosvenor Casinos, a casino operator with 52 casinos in Great Britain, and 1 casino in Belgium; and Enracha, an operator of 9 bingo clubs in Spain. Its Financial Services segment provides commercial and consumer, Islamic, and investment banking services; and life and general insurance, Takaful insurance, fund management and unit trust, stock broking, and corporate advisory services. The company also offers royalty entitlement of Bass Strait's oil and gas production, manufactures, marketing, and distribution of health products. In addition, it provides hotel and property management, marketing and maintenance services, support services for interactive gaming, funding, and trustee services; and apiculture services, which includes manufacture and distribution of New Zealand natural healthcare products. The company operates in the People's Republic of China, the United Kingdom and Continental Europe, Singapore, Australasia, and internationally. The company is based in Central, Hong Kong. Guoco Group Limited is a subsidiary of GuoLine Overseas Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.guoco.com",
        "full_time_employees": 9800
    },
    "K29.SI": {
        "short_name": "Karin Tech",
        "long_name": "Karin Technology Holdings Limited",
        "summary": "Karin Technology Holdings Limited, an investment holding company, distributes electronic components, provides computer data storage management solutions and services, and distributes and retails consumer electronics products in Hong Kong, Mainland China, and internationally. The company offers electronic components, including Bluetooth, connectors, integrated circuits, LCD units, MEMs, quartz crystals, and semi-conductors; and industrial materials comprising batteries, power semi-conductors, connectors, power supplies and semiconductors, process automation products, and special application cables. It also provides integrated circuit application design and development solutions; and power supply solution services, as well as distributes industrial cables, and computer products and peripherals. In addition, the company is involved in the provision of computer data storage management solutions and services; provision of software products and solutions; professional consulting services and software products, solutions, and training; and property holding business. Further, it provides application delivery traffic management solution services; backup/recovery solution services; maintenance support services; migration/upgrade, and network and security solution services; Oracle database solution services; server consolidation and virtualization services; server equipment installation and configuration services; server relocation services; and storage implementation services. The company was founded in 1977 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.karingroup.com",
        "full_time_employees": null
    },
    "KGZ.F": {
        "short_name": "KINGBOARD HOLDINGS HD-,10",
        "long_name": "Kingboard Holdings Limited",
        "summary": "Kingboard Holdings Limited, an investment holding company, manufactures and sells laminates and printed circuit boards. The company also offers chemical products, including coke, methanol, benzene, tar, acetic acid, propylene, methyl tert-butyl ether, liquefied petroleum gas, phenol, acetone, bisphenol A, caustic soda, polyvinyl chloride, hydrochloric acid, liquefied chlorine, chlorinated wax, sodium sulfate, formalin, hydrogen peroxide, and tetrabromobisphenol. In addition, it is involved in the manufacture and distribution of magnetic and glass fabric products; property investment and development activities; rental of commercial properties; sales of residential units; and refining and distribution of chemicals. The company sells its products in the People's Republic of China, Thailand, Japan, Korea, Singapore, Europe, and the United States. The company was formerly known as Kingboard Chemical Holdings Limited and changed its name to Kingboard Holdings Limited in July 2018. Kingboard Holdings Limited was incorporated in 1993 and is headquartered in Sha Tin, Hong Kong.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sha Tin",
        "zipcode": null,
        "website": "http://www.kingboard.com",
        "full_time_employees": 36000
    },
    "NOBGY": {
        "short_name": "NOBLE GROUP",
        "long_name": "Noble Group Limited",
        "summary": "Noble Group Limited is in the process of liquidation. Previously, the company was operated as an independent energy products and industrial raw materials supply chain manager. Its Energy segment was engaged in trading energy coal and the provision of supply chain and risk management services in bituminous and sub-bituminous energy coal, as well as in seaborne LNG. The company's Metals, Minerals and Ores segment was involved in trading and providing supply chain management services in copper, zinc, lead, nickel, and other raw materials, as well as aluminum, alumina, and bauxite. The company was also engaged in trading and providing risk management and logistics services for the steel complex in iron ore, metallurgical coal, metallurgical coke, specialty ores and alloys, and industrial metals and minerals, as well as offered ocean transport in the dry bulk segment, long term freight solutions, and freight market guidance. The company was founded in 1987 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.thisisnoble.com",
        "full_time_employees": 500
    },
    "SGHIF": {
        "short_name": "SHANGHAI INDUSTRIAL HLDGS",
        "long_name": "Shanghai Industrial Holdings Limited",
        "summary": "Shanghai Industrial Holdings Limited, an investment holding company, engages in the infrastructure facilities, real estate, and consumer products businesses in Hong Kong, the People's Republic of China, rest of Asia, and internationally. Its Infrastructure Facilities segment invests in and operates toll road projects and water-related business. The company's Real Estate segment engages in property development activities, as well as invests in and operates a hotel. Its Consumer Products segment manufactures and sells cigarettes, packaging materials, and printed products. The company also manufactures, sells, and markets cigarettes; sources raw materials; and manufactures and sells packaging materials and printed products. The company was incorporated in 1996 and is based in Wanchai, Hong Kong and is considered as a Red Chip company due to its listing on the Hong Kong Stock Exchange. Shanghai Industrial Holdings Limited is a subsidiary of Shanghai Industrial Investment (Holdings) Company Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.sihl.com.hk",
        "full_time_employees": null
    },
    "SGHIY": {
        "short_name": "SHANGHAI INDUSTRIAL HLDGS",
        "long_name": "Shanghai Industrial Holdings Limited",
        "summary": "Shanghai Industrial Holdings Limited, an investment holding company, engages in the infrastructure facilities, real estate, and consumer products businesses in Hong Kong, the People's Republic of China, rest of Asia, and internationally. Its Infrastructure Facilities segment invests in and operates toll road projects and water-related business. The company's Real Estate segment engages in property development activities, as well as invests in and operates a hotel. Its Consumer Products segment manufactures and sells cigarettes, packaging materials, and printed products. The company also manufactures, sells, and markets cigarettes; sources raw materials; and manufactures and sells packaging materials and printed products. The company was incorporated in 1996 and is based in Wanchai, Hong Kong and is considered as a Red Chip company due to its listing on the Hong Kong Stock Exchange. Shanghai Industrial Holdings Limited is a subsidiary of Shanghai Industrial Investment (Holdings) Company Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.sihl.com.hk",
        "full_time_employees": null
    },
    "SGI.F": {
        "short_name": "SHANGHAI IND. HLDGS",
        "long_name": "Shanghai Industrial Holdings Limited",
        "summary": "Shanghai Industrial Holdings Limited, an investment holding company, engages in the infrastructure facilities, real estate, and consumer products businesses in Hong Kong, the People's Republic of China, rest of Asia, and internationally. Its Infrastructure Facilities segment invests in and operates toll road projects and water-related business. The company's Real Estate segment engages in property development activities, as well as invests in and operates a hotel. Its Consumer Products segment manufactures and sells cigarettes, packaging materials, and printed products. The company also manufactures, sells, and markets cigarettes; sources raw materials; and manufactures and sells packaging materials and printed products. The company was incorporated in 1996 and is based in Wanchai, Hong Kong and is considered as a Red Chip company due to its listing on the Hong Kong Stock Exchange. Shanghai Industrial Holdings Limited is a subsidiary of Shanghai Industrial Investment (Holdings) Company Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.sihl.com.hk",
        "full_time_employees": null
    },
    "SUNTF": {
        "short_name": "SUNCORP TECHNOLOGIES",
        "long_name": "Suncorp Technologies Limited",
        "summary": "Suncorp Technologies Limited, an investment holding company, designs, manufactures, markets, and sells residential telephone and related products for residential and office use under the Motorola brand. It also engages in processing and trading of used computer-related components, such as integrated circuit chips, hard disks, and motherboards; and B2B cross-border e-commerce business. In addition, the company provides money lending, securities brokerage, and placing and underwriting services. It operates in the People's Republic of China, Australia, India, Indonesia, Korea, Spain, the United States, and internationally. Suncorp Technologies Limited was incorporated in 1994 and is based in Wanchai, Hong Kong.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.suncorptech.com.hk",
        "full_time_employees": null
    },
    "SWI.F": {
        "short_name": "SWIRE PAC. CL.A",
        "long_name": "Swire Pacific Limited",
        "summary": "Swire Pacific Limited engages in property, aviation, beverages, marine services, and trading and industrial businesses in Hong Kong, Mainland China, rest of Asia, the United States, and internationally. Its Property division develops, owns, and operates mixed-use properties. This division's property investment portfolio comprises office and retail premises, serviced apartments, other luxury residential accommodations, and commercial mixed-use developments; and trading portfolio consists of residential properties. It also owns and manages two hotels in Hong Kong and four hotels in Mainland China, as well as owns interests in the Mandarin Oriental hotel in the United States. The company's Aviation division provides scheduled passenger and cargo services, and aviation maintenance and repair services. As of December 31, 2020, it had a fleet of 239 aircraft. Its Beverages division owns rights to manufacture, market, and distribute refreshing soft drinks to consumers. The company's Marine Services division owns and operates offshore support vessels servicing the energy industry in the offshore production and exploration region outside the United States; and has a windfarm installation business, as well as offshore drilling, production, exploration, platform construction, subsea inspection, maintenance, and repair business. It operates a fleet of 61 offshore support vessels. The company's Trading & Industrial division retails and distributes footwear, apparel, and accessories through its 172 retail outlets; sells passenger cars, commercial vehicles, motorcycles, and scooters; operates a chain of 546 bakery stores; packages and sells sugar products under the Taikoo Sugar brand; and offers waste management services. The company was founded in 1816 and is based in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.swirepacific.com",
        "full_time_employees": 86768
    },
    "SWI1.F": {
        "short_name": "SWIRE PAC. CL.B",
        "long_name": "Swire Pacific Limited",
        "summary": "Swire Pacific Limited engages in property, aviation, beverages, marine services, and trading and industrial businesses in Hong Kong, Mainland China, rest of Asia, the United States, and internationally. Its Property division develops, owns, and operates mixed-use properties. This division's property investment portfolio comprises office and retail premises, serviced apartments, other luxury residential accommodations, and commercial mixed-use developments; and trading portfolio consists of residential properties. It also owns and manages two hotels in Hong Kong and four hotels in Mainland China, as well as owns interests in the Mandarin Oriental hotel in the United States. The company's Aviation division provides scheduled passenger and cargo services, and aviation maintenance and repair services. As of December 31, 2020, it had a fleet of 239 aircraft. Its Beverages division owns rights to manufacture, market, and distribute refreshing soft drinks to consumers. The company's Marine Services division owns and operates offshore support vessels servicing the energy industry in the offshore production and exploration region outside the United States; and has a windfarm installation business, as well as offshore drilling, production, exploration, platform construction, subsea inspection, maintenance, and repair business. It operates a fleet of 61 offshore support vessels. The company's Trading & Industrial division retails and distributes footwear, apparel, and accessories through its 172 retail outlets; sells passenger cars, commercial vehicles, motorcycles, and scooters; operates a chain of 546 bakery stores; packages and sells sugar products under the Taikoo Sugar brand; and offers waste management services. The company was founded in 1816 and is based in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.swirepacific.com",
        "full_time_employees": 86768
    },
    "SWRAF": {
        "short_name": "SWIRE PACIFIC",
        "long_name": "Swire Pacific Limited",
        "summary": "Swire Pacific Limited engages in property, aviation, beverages, marine services, and trading and industrial businesses in Hong Kong, Mainland China, rest of Asia, the United States, and internationally. Its Property division develops, owns, and operates mixed-use properties. This division's property investment portfolio comprises office and retail premises, serviced apartments, other luxury residential accommodations, and commercial mixed-use developments; and trading portfolio consists of residential properties. It also owns and manages two hotels in Hong Kong and four hotels in Mainland China, as well as owns interests in the Mandarin Oriental hotel in the United States. The company's Aviation division provides scheduled passenger and cargo services, and aviation maintenance and repair services. As of December 31, 2020, it had a fleet of 239 aircraft. Its Beverages division owns rights to manufacture, market, and distribute refreshing soft drinks to consumers. The company's Marine Services division owns and operates offshore support vessels servicing the energy industry in the offshore production and exploration region outside the United States; and has a windfarm installation business, as well as offshore drilling, production, exploration, platform construction, subsea inspection, maintenance, and repair business. It operates a fleet of 61 offshore support vessels. The company's Trading & Industrial division retails and distributes footwear, apparel, and accessories through its 172 retail outlets; sells passenger cars, commercial vehicles, motorcycles, and scooters; operates a chain of 546 bakery stores; packages and sells sugar products under the Taikoo Sugar brand; and offers waste management services. The company was founded in 1816 and is based in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.swirepacific.com",
        "full_time_employees": 86768
    },
    "SWRAY": {
        "short_name": "SWIRE PACIFIC",
        "long_name": "Swire Pacific Limited",
        "summary": "Swire Pacific Limited engages in property, aviation, beverages, marine services, and trading and industrial businesses in Hong Kong, Asia, the United States, and internationally. Its Property division develops, owns, and operates mixed-use properties. This division's property investment portfolio comprises office and retail premises, serviced apartments, other luxury residential accommodations, and commercial mixed-use developments; and trading portfolio consists of residential properties. It also owns and manages two hotels in Hong Kong and four hotels in Mainland China, as well as owns interests in the Mandarin Oriental hotel in the United States. The company's Aviation division provides scheduled passenger and cargo services, and aviation maintenance and repair services. As of December 31, 2019, it operated 236 aircraft. Its Beverages division owns rights to manufacture, market, and distribute refreshing soft drinks to consumers. The company's Marine Services division owns and operates offshore support vessels servicing the energy industry in the offshore production and exploration region outside the United States; and has a windfarm installation business, as well as a subsea inspection, maintenance, and repair business. It operates a fleet of 73 offshore support vessels. Its Trading & Industrial division retails and distributes footwear, apparel, and accessories through its 191 retail outlets; sells passenger cars, commercial vehicles, motorcycles, and scooters; operates a chain of bakeries; packages and sells sugar products under the Taikoo Sugar brand; and offers waste management services. The company was founded in 1816 and is based in Central, Hong Kong. Swire Pacific Limited is a subsidiary of John Swire & Sons (H.K.) Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.swirepacific.com",
        "full_time_employees": 86768
    },
    "SWRBF": {
        "short_name": "SWIRE PACIFIC",
        "long_name": "Swire Pacific Limited",
        "summary": "Swire Pacific Limited engages in property, aviation, beverages, marine services, and trading and industrial businesses in Hong Kong, Mainland China, rest of Asia, the United States, and internationally. Its Property division develops, owns, and operates mixed-use properties. This division's property investment portfolio comprises office and retail premises, serviced apartments, other luxury residential accommodations, and commercial mixed-use developments; and trading portfolio consists of residential properties. It also owns and manages two hotels in Hong Kong and four hotels in Mainland China, as well as owns interests in the Mandarin Oriental hotel in the United States. The company's Aviation division provides scheduled passenger and cargo services, and aviation maintenance and repair services. As of December 31, 2020, it had a fleet of 239 aircraft. Its Beverages division owns rights to manufacture, market, and distribute refreshing soft drinks to consumers. The company's Marine Services division owns and operates offshore support vessels servicing the energy industry in the offshore production and exploration region outside the United States; and has a windfarm installation business, as well as offshore drilling, production, exploration, platform construction, subsea inspection, maintenance, and repair business. It operates a fleet of 61 offshore support vessels. The company's Trading & Industrial division retails and distributes footwear, apparel, and accessories through its 172 retail outlets; sells passenger cars, commercial vehicles, motorcycles, and scooters; operates a chain of 546 bakery stores; packages and sells sugar products under the Taikoo Sugar brand; and offers waste management services. The company was founded in 1816 and is based in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.swirepacific.com",
        "full_time_employees": 86768
    },
    "SWRBY": {
        "short_name": "SWIRE PACIFIC",
        "long_name": "Swire Pacific Limited",
        "summary": "Swire Pacific Limited engages in property, aviation, beverages, marine services, and trading and industrial businesses in Hong Kong, Mainland China, rest of Asia, the United States, and internationally. Its Property division develops, owns, and operates mixed-use properties. This division's property investment portfolio comprises office and retail premises, serviced apartments, other luxury residential accommodations, and commercial mixed-use developments; and trading portfolio consists of residential properties. It also owns and manages two hotels in Hong Kong and four hotels in Mainland China, as well as owns interests in the Mandarin Oriental hotel in the United States. The company's Aviation division provides scheduled passenger and cargo services, and aviation maintenance and repair services. As of December 31, 2020, it had a fleet of 239 aircraft. Its Beverages division owns rights to manufacture, market, and distribute refreshing soft drinks to consumers. The company's Marine Services division owns and operates offshore support vessels servicing the energy industry in the offshore production and exploration region outside the United States; and has a windfarm installation business, as well as offshore drilling, production, exploration, platform construction, subsea inspection, maintenance, and repair business. It operates a fleet of 61 offshore support vessels. The company's Trading & Industrial division retails and distributes footwear, apparel, and accessories through its 172 retail outlets; sells passenger cars, commercial vehicles, motorcycles, and scooters; operates a chain of 546 bakery stores; packages and sells sugar products under the Taikoo Sugar brand; and offers waste management services. The company was founded in 1816 and is based in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.swirepacific.com",
        "full_time_employees": 86768
    },
    "TJN.F": {
        "short_name": "TIANJIN DEV. HLDGS",
        "long_name": "Tianjin Development Holdings Limited",
        "summary": "Tianjin Development Holdings Limited, through its subsidiaries, supplies electricity, water, heat, and thermal power to industrial, commercial, and residential customers in the Tianjin Economic and Technological Development Area, the People's Republic of China. It operates through six segments: Utilities, Pharmaceutical, Hotel, Electrical and Mechanical, Port Services, and Elevators and Escalators. The company has an installed transmission capacity of approximately 946,000 kVA; daily water supply capacity of 425,000 tons; and steam transmission pipelines of 475 kilometers, 120 processing stations, and daily distribution capacity of 30,000 tons. It also provides services in relation to construction of electricity supply network, application of technology related to new energy and renewable energy, and electricity construction and related technical services; and offers services in installation and maintenance of water pipes, and technical consultancy, as well as engages in the retail and wholesale of water pipes and related parts. In addition, the company is involved in the manufacture and sale of presses, and mechanical and hydroelectric equipment, as well as large scale pump units. Further, it operates Courtyard by Marriott Hong Kong, a 4-star hotel with 245 guest rooms; researches and develops medicine technology and products; manufactures and sells chemical drugs; designs, manufactures, and prints pharmaceutical packaging products, as well as sells other paper-based packaging materials; manufactures and sells elevators and escalators; and provides port services. The company is based in Central, Hong Kong. Tianjin Development Holdings Limited is a subsidiary of Tsinlien Group Co., Ltd.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.tianjindev.com",
        "full_time_employees": 3435
    },
    "W2T.F": {
        "short_name": "GLORY SUN FINL GRP HD-,10",
        "long_name": "Glory Sun Financial Group Limited",
        "summary": "Glory Sun Financial Group Limited engages in property investment and development business. It invests in property development and investment, new energy, technology, and healthcare industries; and involved in the automation, securities investment, and trading of commodities businesses. The company also offers financial services, including wealth management, asset management, global securities and futures, corporate finance, precious metals trading, financial planning and credit, private fund, finance leasing, etc. In addition, it produces SMT assembly and semiconductor packaging equipment and other services. Further, the company provides bullion trading, money lending, securities brokerage, insurance, and corporate management consultancy, finance leasing, and education and training services. Additionally, it trades in machines and spare parts, and seafood, as well as operates yacht club and golf practice court. The company was formerly known as China Goldjoy Group Limited and changed its name to Glory Sun Financial Group Limited in May 2019. Glory Sun Financial Group Limited was founded in 2009 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hk1282.com",
        "full_time_employees": 1036
    },
    "XSH4.F": {
        "short_name": "SUNCORP TECHS  HD-,006",
        "long_name": "Suncorp Technologies Limited",
        "summary": "Suncorp Technologies Limited, an investment holding company, designs, manufactures, markets, and sells residential telephone and related products for residential and office use under the Motorola brand. It also engages in processing and trading of used computer-related components, such as integrated circuit chips, hard disks, and motherboards; and B2B cross-border e-commerce business. In addition, the company provides money lending, securities brokerage, and placing and underwriting services. It operates in the People's Republic of China, Australia, India, Indonesia, Korea, Spain, the United States, and internationally. Suncorp Technologies Limited was incorporated in 1994 and is based in Wanchai, Hong Kong.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.suncorptech.com.hk",
        "full_time_employees": null
    },
    "XT2A.F": {
        "short_name": "CCT FORTIS HLDG.LTD.HD-10",
        "long_name": "CCT Fortis Holdings Limited",
        "summary": "CCT Fortis Holdings Limited, an investment holding company, invests in, develops, and trades in real estate properties. The company operates through Property Development and Trading, Property Investment and Holding, Securities Business, Ferrari Dealership Business, Classic Cars Trading and Logistics, Investment in Classic Cars, Film Operations, Stage Audio, Lighting, and Engineering Operations, Industrial Group, and Other Operations segments. Its property portfolio comprises residential properties, retail properties and shops, office properties, industrial properties, and car parks. The company also holds and trades in securities, financial assets, and treasury products; sells and distributes Ferrari cars, and provides after-sale services; acquires, trades in, and sells classic cars, as well as offers car logistic services; and produces, invests in, and distributes films. In addition, it sells and leases audio and lighting equipment; provides technical and engineering services and metal construction work for stage performance events; and manufactures plastic components; and trades in child products. Further, the company engages in multimedia and magazine publication businesses; invests in collectible precision devices; operates a classic car service center; manufactures casings and parts; offers classic car restoration and maintenance, and artist management services; and trades in components and products. It operates in Mainland China, Hong Kong, Macau, Europe, North America, and internationally. The company was formerly known as CCT Telecom Holdings Limited. CCT Fortis Holdings Limited is headquartered in Shatin, Hong Kong.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sha Tin",
        "zipcode": null,
        "website": "http://www.cct-fortis.com",
        "full_time_employees": 318
    }
}