{
  "1568.HK": {
    "city": "Kowloon",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Consulting Services",
    "long_name": "Sundart Holdings Limited",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "SUNDART HLDGS",
    "state": null,
    "summary": "Sundart Holdings Limited, an investment holding company, provides fitting-out services in the People's Republic of China, Hong Kong, and Macau. The company undertakes fitting-out works for hotels, serviced apartments, residential properties, factories, commercial buildings, and other properties; and alteration, addition, and construction and civil engineering works. It also manufactures, sources, and distributes interior decorative materials; and leases intellectual properties. In addition, Sundart Holdings Limited provides project management and consultancy services. Further, it manufactures interior decorative timber products, such as fire-rated timber doors and wooden furniture. The company was founded in 1986 and is headquartered in Kowloon, Hong Kong. Sundart Holdings Limited is a subsidiary of Reach Glory International Limited.",
    "website": "http://www.sundart.com",
    "zipcode": null
  },
  "1867.HK": {
    "city": "Kwun Tong",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Consulting Services",
    "long_name": "LKS Holding Group Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "LKS HOLDING",
    "state": null,
    "summary": "LKS Holding Group Limited, an investment holding company, engages in the interior fitting-out, renovation, alteration, and addition works for residential, industrial, and commercial properties in Hong Kong. It is also involved in structural alterations, structural steel works, signage works, building maintenance, refurbishment works, and ground improvement activities, as well as interior design works. The company serves contractors, landlords, and property developers. LKS Holding Group Limited was founded in 2005 and is headquartered in Kwun Tong, Hong Kong.",
    "website": "http://www.lksholding.com",
    "zipcode": null
  },
  "3893.HK": {
    "city": "North Point",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Consulting Services",
    "long_name": "Crosstec Group Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "CROSSTEC",
    "state": null,
    "summary": "Crosstec Group Holdings Limited, an investment holding company, provides various interior design solutions for jewelry and fashion brand retail stores in the People's Republic of China, the United States, Europe, the Middle East, and other Asian countries. Its interior design solutions include fit-out construction services, millworks provision, facade development and fabrication services, maintenance and interior solutions, and design and project consultancy services. The company also offers labour and management services; marketing and liaising services to the inter-group companies; and trades in millworks and furniture, and facade fabrication products. Crosstec Group Holdings Limited was founded in 1999 and is headquartered in North Point, Hong Kong. Crosstec Group Holdings Limited is a subsidiary of CGH (BVI) Limited.",
    "website": "http://www.crosstec.com.hk",
    "zipcode": null
  },
  "8040.HK": {
    "city": "Kwun Tong",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Consulting Services",
    "long_name": "DCB Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "DCB HOLDINGS",
    "state": null,
    "summary": "DCB Holdings Limited, an investment holding company, provides fitting-out and renovation services in Hong Kong. It operates through Fitting-Out Work and Renovation Work segments. The company offers interior fitting-out services for new buildings; and renovation services, such as upgrade, makeover, and demolition of premises in the private sector, including residential apartments and residential dwellings, show flats, clubhouses, sale offices, public areas in residential and commercial buildings, offices, shopping malls, and shops. It serves property developers, main contractors or direct contractors, and owners or tenants of properties. The company was founded in 2008 and is headquartered in Kwun Tong, Hong Kong. DCB Holdings Limited is a subsidiary of Advance Goal Group Limited.",
    "website": "http://www.dcb.com.hk",
    "zipcode": null
  },
  "8341.HK": {
    "city": "Sheung Wan",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Consulting Services",
    "long_name": "Aeso Holding Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "AESO HOLDING",
    "state": null,
    "summary": "Aeso Holding Limited, an investment holding company, provides fitting-out and renovation contracting services in Hong Kong. It undertakes fitting-out works for the construction of newly built commercial premises and residential developments; and renovation works, including alteration and addition works for existing commercial premises. The company also offers interior design services. It serves property developers, contractors, landlords, government authority, and international retail brands and local retailers. The company was founded in 2008 and is headquartered in Sheung Wan, Hong Kong.",
    "website": "http://www.aeso.hk",
    "zipcode": null
  },
  "8501.HK": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Consulting Services",
    "long_name": "Sanbase Corporation Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SANBASE CORP",
    "state": null,
    "summary": "Sanbase Corporation Limited, an investment holding company, provides interior fit-out solutions in Hong Kong and the People's Republic of China. It undertakes bare shell fit-out, restacking, reinstatement, design, churn works, and maintenance and other services. The company was founded in 2009 and is headquartered in Central, Hong Kong. Sanbase Corporation Limited is a subsidiary of Madison Square International Investment Limited.",
    "website": "http://www.sclhk.com",
    "zipcode": null
  },
  "ARMC": {
    "city": "Wanchai",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Consulting Services",
    "long_name": "Asiarim Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ASIARIM CORPORATION",
    "state": null,
    "summary": "Asiarim Corporation designs, markets, and distributes multimedia and computer products primarily in Hong Kong and the People's Republic of China. Its product portfolio includes ultra mobile portable computers, netbooks, notebooks, computer accessories, pen touch computers and monitors, LED TV monitors, and media center systems. The company markets and distributes its products under the Commodore brand name through mass merchandisers, discount retailers, electronics retailers, distributors, and specialty catalogers. Asiarim Corporation was founded in 2007 and is based in Wanchai, Hong Kong.",
    "website": null,
    "zipcode": "89108"
  },
  "PCHK": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Consulting Services",
    "long_name": "Pacific Conquest Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "PACIFIC CONQUEST HOLDINGS INC",
    "state": null,
    "summary": "Pacific Conquest Holdings, Inc. focuses on the acquisition and exploration of mineral properties. The company is based in Central, Hong Kong.",
    "website": "http://pacific-conquest.com",
    "zipcode": "77070"
  }
}
