{
    "0137.HK": {
        "short_name": "JINHUI HOLDINGS",
        "long_name": "Jinhui Holdings Company Limited",
        "summary": "Jinhui Holdings Company Limited, an investment holding company, engages in the ship chartering and owning activities in Asia, Australia, North America, China, and Africa. It offers fleet services for cargoes, such as minerals, coal, steel products, and cement. The company is also involved in property investment, and shipping agent and investment activities. In addition, it provides ship management and money lending services. As of December 31, 2019, it had eighteen owned vessels. The company was incorporated in 1991 and is based in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.jinhuiship.com/jh",
        "market_cap": 668164096
    },
    "0908.HK": {
        "short_name": "ZHUHAI H INV",
        "long_name": "Zhuhai Holdings Investment Group Limited",
        "summary": "Zhuhai Holdings Investment Group Limited, an investment holding company, provides port facilities and ferry services in the People's Republic of China. It operates through eight segments: Jiuzhou Blue Sea Jet and Blue Marine Tourism, Hotel, Tourist Attraction, Property Development, Golf Club Operations, Public Utilities, Financial Investments, and Corporate and Others. The company also manages a holiday resort hotel, and a theme park and an amusement park; develops and sells properties; and operates golf club facilities. In addition, it is involved in the trading and distribution of fuel oil; constructs river-regulating facilities and provides related maintenance service; and provision of financial information services and Internet financial information intermediary services. The company was formerly known as Jiuzhou Development Company Limited and changed its name to Zhuhai Holdings Investment Group Limited in January 2013. Zhuhai Holdings Investment Group Limited was incorporated in 1998 and is headquartered in Sheung Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sheung Wan",
        "zipcode": null,
        "website": "http://www.0908.hk",
        "market_cap": 4354789888
    },
    "1145.HK": {
        "short_name": "COURAGE INV",
        "long_name": "Courage Investment Group Limited",
        "summary": "Courage Investment Group Limited, an investment holding company, provides marine transportation services in Hong Kong and other Asian countries. The company also trades in merchandise, including consumable goods relating to infant, personal care products, and electronic components; holds and invests in properties; and invests in securities and corporate bonds. In addition, it offers management services. The company was formerly known as Courage Marine Group Limited and changed its name to Courage Investment Group Limited in September 2017. Courage Investment Group Limited has a strategic cooperation agreement with Shandong Sooc Education Technology Stock Corp. Ltd. for online marine crew training market. The company was founded in 2001 and is headquartered in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.courageinv.com",
        "market_cap": 308595232
    },
    "1199.HK": {
        "short_name": "COSCO SHIP PORT",
        "long_name": "COSCO SHIPPING Ports Limited",
        "summary": "COSCO SHIPPING Ports Limited, an investment holding company, manages and operates terminals and related businesses in Mainland China, Southeast Asia, the Middle East, Europe, South America, the Mediterranean, and internationally. The company operates container, container freight stations, terminals, container terminals, and rail terminals, as well as offers financing, treasury, management, logistics, and consultancy services. As of December 31, 2020, it operated and managed 357 berths at 36 ports with a total annual handling capacity of approximately 118 million TEU. The company was formerly known as COSCO Pacific Limited and changed its name to COSCO SHIPPING Ports Limited in July 2016. COSCO SHIPPING Ports Limited was incorporated in 1994 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://ports.coscoshipping.com",
        "market_cap": 21483145216
    },
    "2343.HK": {
        "short_name": "PACIFIC BASIN",
        "long_name": "Pacific Basin Shipping Limited",
        "summary": "Pacific Basin Shipping Limited, an investment holding company, provides dry bulk shipping services worldwide. As of February 29, 2020, the company had a fleet of 235 ships, including 133 Handysize vessels, 117 Supramax vessels, and 2 Post-Panamax vessels. It also offers shipping consulting, ocean shipping, crewing, secretarial, and agency and ship management services; and engages in the vessel owning and chartering, and convertible bonds issuing activities. Pacific Basin Shipping Limited was founded in 1987 and is headquartered in Wong Chuk Hang, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wong Chuk Hang",
        "zipcode": null,
        "website": "http://www.pacificbasin.com",
        "market_cap": 13427404800
    },
    "3683.HK": {
        "short_name": "GREAT HARVEST",
        "long_name": "Great Harvest Maeta Group Holdings Limited",
        "summary": "Great Harvest Maeta Group Holdings Limited, an investment holding company, charters out own dry bulk vessels worldwide. It operates through Chartering of Vessels; and Property Investment and Development segments. The company owns four vessels with total carrying capacity of 319,923 deadweight tonnage. It also provides agency services. The company was incorporated in 2010 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.greatharvestmg.com",
        "market_cap": 952614016
    },
    "8020.HK": {
        "short_name": "UNITAS HOLD",
        "long_name": "Unitas Holdings Limited",
        "summary": "Unitas Holdings Limited, an investment holding company, provides corporate finance advisory services primarily to listed and non-listed companies in Hong Kong, the People's Republic of China, and internationally. It operates through Corporate Finance Advisory Service; Dry Bulk Shipping and Logistic Services; and IP Automation and Entertainment Business segments. The company advises on the listing rules, growth enterprise market (GEM) listing rules, and takeovers codes; mergers and acquisitions activities; other corporate activities, such as fund raising exercises; and corporate resumptions, as well as acts as an independent financial adviser to transactions of listed issuers that are under the listing rules, GEM listing rules, and takeovers codes. It also provides automation gift machines, thematic game machines, and carnival game booths, as well as retails outlet. The company was formerly known as Chanceton Financial Group Limited and changed its name to Unitas Holdings Limited in October 2016. Unitas Holdings Limited was incorporated in 2011 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.chanceton.com",
        "market_cap": 148377600
    },
    "CHDGF": {
        "short_name": "COSCO SHIPPING INT (HK) CO LTD",
        "long_name": "COSCO SHIPPING International (Hong Kong) Co., Ltd.",
        "summary": "COSCO SHIPPING International (Hong Kong) Co., Ltd., an investment holding company, provides shipping services in the People's Republic of China. The company's Coatings segment produces and sells coatings products, including container, industrial heavy-duty anti-corrosion, and marine coatings. Its Marine Equipment and Spare Parts segment sells and installs equipment and spare parts for existing and new build vessels, as well as equipment of radio communications systems, satellite communications, and navigation systems for ships, offshore facilities, coastal stations and land users; supplies marine material; and provides voyage repair services. The company's Ship Trading Agency segment offers agency services relating to shipbuilding, ship trading, and bareboat chartering for second-hand and obsolete vessels; consultancy services for ship technology and trading; business negotiations for purchasing of new build; purchase and sale contract of second hand vessels; follow-ups of the construction; and delivery process of new build ships. Its Insurance Brokerage segment provides insurance and reinsurance intermediary services of marine and non-marine insurance. The company's Marine Fuel and Other Products segment engages in the supply, trading, and brokerage services of marine fuel and related products. Its General Trading segment is involved in the trading, storage, processing, and supply of asphalt; trading of various vessel spare parts and accessories; and other comprehensive trading. The company also provides nominee services. The company was formerly known as COSCO International Holdings Limited and changed its name to COSCO SHIPPING International (Hong Kong) Co., Ltd. in November 2016. The company is headquartered in Central, Hong Kong. COSCO SHIPPING International (Hong Kong) Co., Ltd. is a subsidiary of COSCO SHIPPING (Hong Kong) Co., Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.coscointl.com",
        "market_cap": 547751040
    },
    "CIN.SI": {
        "short_name": "Courage Inv",
        "long_name": "Courage Investment Group Limited",
        "summary": "Courage Investment Group Limited, an investment holding company, provides marine transportation services in Hong Kong and other Asian countries. The company also trades in merchandise, including consumable goods relating to infant, personal care products, and electronic components; holds and invests in properties; and invests in securities and corporate bonds. In addition, it offers management services. The company was formerly known as Courage Marine Group Limited and changed its name to Courage Investment Group Limited in September 2017. Courage Investment Group Limited has a strategic cooperation agreement with Shandong Sooc Education Technology Stock Corp. Ltd. for online marine crew training market. The company was founded in 2001 and is headquartered in Wanchai, Hong Kong.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.courageinv.com",
        "market_cap": 48298800
    },
    "CKW.F": {
        "short_name": "CHU KONG SHIP.ENT.(GR.)CO",
        "long_name": "Chu Kong Shipping Enterprises (Group) Company Limited",
        "summary": "Chu Kong Shipping Enterprises (Group) Company Limited, an investment holding company, engages in the terminal logistics, high-speed waterway passenger transportation, and fuel supply businesses in Hong Kong, Mainland China, and Macau. The company operates through Cargo Transportation, Cargo Handling and Storage, Passenger Transportation, Fuel supply, and Corporate and Other Businesses segments. It provides cargo canvassing, feeder transportation, vessel agency, wharf cargo handling, and warehousing and storage; shipping agency and freight forwarding agency; container and cargo transportation and towing; and transshipment, cargo handling, and trucking services. The company is also involved in the operation and management of a river trade cargo terminals; management of ships; operation and management of facilities maintenance services; godown and wharf operations; and tour operation and property holding activities. In addition, it offers diesel and lubricants for passenger ferries and cargo vessels; oil trading and marine bunkering services; and information technology and passenger services. Further, the company provides agency services; container handling; passenger transportation agency and carrier, logistics, and maintenance services; ferry and charter hire of vessels services; ferry terminal management services; cargo consolidation; and operation of travel agency. The company was incorporated in 1996 and is headquartered in Central, Hong Kong. Chu Kong Shipping Enterprises (Group) Company Limited is a subsidiary of Chu Kong Shipping Enterprises (Holdings) Company Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.cksd.com",
        "market_cap": 122133776
    },
    "CMHHY": {
        "short_name": "CHINA MERCHANTS PORT HLDGS LTD",
        "long_name": "China Merchants Port Holdings Company Limited",
        "summary": "China Merchants Port Holdings Company Limited, an investment holding company, operates as a port operator in Mainland China, Hong Kong, Taiwan, and internationally. It operates through Ports operation, Bonded Logistics Operation, and Other Operations. The company engages in the container, and bulk and general cargo terminals; and logistic park operation, ports transportation, and airport cargo handling activities. It also invests in and develops properties; constructs modular housings; trades in securities; and provides container terminal services, as well as computer network services. In addition, the company engages in port construction and development; operation of berths; operation of tugboats; and holding of various pieces of land. The company was formerly known as China Merchants Holdings (International) Company Limited and changed its name to China Merchants Port Holdings Company Limited in June 2016. The company was founded in 1872 and is headquartered in Central, Hong Kong. China Merchants Port Holdings Company Limited is considered as a Red Chip company due to its listing on the Hong Kong Stock Exchange. China Merchants Port Holdings Company Limited is a subsidiary of China Merchants Group Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.cmport.com.hk",
        "market_cap": 5349047808
    },
    "CPM.F": {
        "short_name": "CHINA MERCHANTS PORT HLDG",
        "long_name": "China Merchants Port Holdings Company Limited",
        "summary": "China Merchants Port Holdings Company Limited, an investment holding company, operates as a port operator in Mainland China, Hong Kong, Taiwan, and internationally. It operates through Ports operation, Bonded Logistics Operation, and Other Operations. The company engages in the container, and bulk and general cargo terminals; and logistic park operation, ports transportation, and airport cargo handling activities. It also invests in and develops properties; constructs modular housings; trades in securities; and provides container terminal services, as well as computer network services. In addition, the company engages in port construction and development; operation of berths; operation of tugboats; and holding of various pieces of land. The company was formerly known as China Merchants Holdings (International) Company Limited and changed its name to China Merchants Port Holdings Company Limited in June 2016. The company was founded in 1872 and is headquartered in Central, Hong Kong. China Merchants Port Holdings Company Limited is considered as a Red Chip company due to its listing on the Hong Kong Stock Exchange. China Merchants Port Holdings Company Limited is a subsidiary of China Merchants Group Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.cmport.com.hk",
        "market_cap": 4558212608
    },
    "CSB.F": {
        "short_name": "COSCO SHIPP.INTL(HK)HD-10",
        "long_name": "COSCO SHIPPING International (Hong Kong) Co., Ltd.",
        "summary": "COSCO SHIPPING International (Hong Kong) Co., Ltd., an investment holding company, provides shipping services in the People's Republic of China. The company's Coatings segment produces and sells coatings products, including container, industrial heavy-duty anti-corrosion, and marine coatings. Its Marine Equipment and Spare Parts segment sells and installs equipment and spare parts for existing and new build vessels, as well as equipment of radio communications systems, satellite communications, and navigation systems for ships, offshore facilities, coastal stations and land users; supplies marine material; and provides voyage repair services. The company's Ship Trading Agency segment offers agency services relating to shipbuilding, ship trading, and bareboat chartering for second-hand and obsolete vessels; consultancy services for ship technology and trading; business negotiations for purchasing of new build; purchase and sale contract of second hand vessels; follow-ups of the construction; and delivery process of new build ships. Its Insurance Brokerage segment provides insurance and reinsurance intermediary services of marine and non-marine insurance. The company's Marine Fuel and Other Products segment engages in the supply, trading, and brokerage services of marine fuel and related products. Its General Trading segment is involved in the trading, storage, processing, and supply of asphalt; trading of various vessel spare parts and accessories; and other comprehensive trading. The company also provides nominee services. The company was formerly known as COSCO International Holdings Limited and changed its name to COSCO SHIPPING International (Hong Kong) Co., Ltd. in November 2016. The company is headquartered in Central, Hong Kong. COSCO SHIPPING International (Hong Kong) Co., Ltd. is a subsidiary of COSCO SHIPPING (Hong Kong) Co., Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.coscointl.com",
        "market_cap": 419626976
    },
    "CSPKF": {
        "short_name": "COSCO SHIPPING PORTS LTD",
        "long_name": "COSCO SHIPPING Ports Limited",
        "summary": "COSCO SHIPPING Ports Limited, an investment holding company, manages and operates terminals and related businesses in Mainland China, Southeast Asia, the Middle East, Europe, South America, the Mediterranean, and internationally. The company operates container, container freight stations, terminals, container terminals, and rail terminals, as well as offers financing, treasury, management, logistics, and consultancy services. As of December 31, 2020, it operated and managed 357 berths at 36 ports with a total annual handling capacity of approximately 118 million TEU. The company was formerly known as COSCO Pacific Limited and changed its name to COSCO SHIPPING Ports Limited in July 2016. COSCO SHIPPING Ports Limited was incorporated in 1994 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://ports.coscoshipping.com",
        "market_cap": 2591712256
    },
    "CTH.F": {
        "short_name": "COSCO SHIP.PORT.LTD.HD-10",
        "long_name": "COSCO SHIPPING Ports Limited",
        "summary": "COSCO SHIPPING Ports Limited, an investment holding company, manages and operates terminals and related businesses in Mainland China, Southeast Asia, the Middle East, Europe, South America, the Mediterranean, and internationally. The company operates container, container freight stations, terminals, container terminals, and rail terminals, as well as offers financing, treasury, management, logistics, and consultancy services. As of December 31, 2020, it operated and managed 357 berths at 36 ports with a total annual handling capacity of approximately 118 million TEU. The company was formerly known as COSCO Pacific Limited and changed its name to COSCO SHIPPING Ports Limited in July 2016. COSCO SHIPPING Ports Limited was incorporated in 1994 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://ports.coscoshipping.com",
        "market_cap": 2379691520
    },
    "J4O.F": {
        "short_name": "JINHUI SHIP.+TRAN.DL-,05",
        "long_name": "Jinhui Shipping and Transportation Limited",
        "summary": "Jinhui Shipping and Transportation Limited, an investment holding company, engages in ship chartering and owning activities worldwide. The company provides ship management and shipping agent services. It is also involved in property investment and money lending activities. As of December 31, 2019, it owned a fleet of eighteen vessels. The company was founded in 1987 and is based in Hong Kong, Hong Kong. Jinhui Shipping and Transportation Limited is a subsidiary of Jinhui Holdings Company Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.jinhuiship.com/jst",
        "market_cap": 93398720
    },
    "JHU1.F": {
        "short_name": "JINHUI HLDGS SUBD.",
        "long_name": "Jinhui Holdings Company Limited",
        "summary": "Jinhui Holdings Company Limited, an investment holding company, engages in the ship chartering and owning activities in Asia, Australia, North America, China, and Africa. It offers fleet services for cargoes, such as minerals, coal, steel products, and cement. The company is also involved in property investment, and shipping agent and investment activities. In addition, it provides ship management and money lending services. As of December 31, 2019, it had eighteen owned vessels. The company was incorporated in 1991 and is based in Hong Kong, Hong Kong.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.jinhuiship.com/jh",
        "market_cap": 68498120
    },
    "JIN.OL": {
        "short_name": "JINHUI SHIPPING",
        "long_name": "Jinhui Shipping and Transportation Limited",
        "summary": "Jinhui Shipping and Transportation Limited, an investment holding company, engages in ship chartering and owning activities worldwide. The company provides ship management and shipping agent services. It is also involved in property investment and money lending activities. As of December 31, 2019, it owned a fleet of eighteen vessels. The company was founded in 1987 and is based in Hong Kong, Hong Kong. Jinhui Shipping and Transportation Limited is a subsidiary of Jinhui Holdings Company Limited.",
        "currency": "NOK",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.jinhuiship.com/jst",
        "market_cap": 950553280
    },
    "ORI1.F": {
        "short_name": "ORIENT OVERS. NEW  DL-,10",
        "long_name": "Orient Overseas (International) Limited",
        "summary": "Orient Overseas (International) Limited, an investment holding company, provides container transport and logistics services in Asia, Europe, Australia, North America, and internationally. The company offers supply-chain management and distribution services; and containerized shipping services in various trade lanes comprising Trans-Pacific, Trans-Atlantic, Asia/Europe, Asia/Australia, and Intra-Asia trades. It is also involved in equipment owning and leasing, container depot and warehousing, portfolio investment, terminal operating, ship owning, cargo consolidation and forwarding, liner and freight agency, property owning, and ship management businesses; providing corporate and trucking services; and operating vessels. The company was incorporated in 1987 and is based in Wan Chai, Hong Kong. Orient Overseas (International) Limited is a subsidiary of Faulkner Global Holdings Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.ooilgroup.com",
        "market_cap": 9335042048
    },
    "OROVF": {
        "short_name": "ORIENT OVERSEAS INT",
        "long_name": "Orient Overseas (International) Limited",
        "summary": "Orient Overseas (International) Limited, an investment holding company, provides container transport and logistics services in Asia, Europe, Australia, North America, and internationally. The company offers supply-chain management and distribution services; and containerized shipping services in various trade lanes comprising Trans-Pacific, Trans-Atlantic, Asia/Europe, Asia/Australia, and Intra-Asia trades. It is also involved in equipment owning and leasing, container depot and warehousing, portfolio investment, terminal operating, ship owning, cargo consolidation and forwarding, liner and freight agency, property owning, and ship management businesses; providing corporate and trucking services; and operating vessels. The company was incorporated in 1987 and is based in Wan Chai, Hong Kong. Orient Overseas (International) Limited is a subsidiary of Faulkner Global Holdings Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.ooilgroup.com",
        "market_cap": 12219672576
    },
    "OROVY": {
        "short_name": "ORIENT OVERSEAS INT",
        "long_name": "Orient Overseas (International) Limited",
        "summary": "Orient Overseas (International) Limited, an investment holding company, provides container transport and logistics services in Asia, Europe, Australia, North America, and internationally. The company offers supply-chain management and distribution services; and containerized shipping services in various trade lanes comprising Trans-Pacific, Trans-Atlantic, Asia/Europe, Asia/Australia, and Intra-Asia trades. It is also involved in equipment owning and leasing, container depot and warehousing, portfolio investment, terminal operating, ship owning, cargo consolidation and forwarding, liner and freight agency, property owning, and ship management businesses; providing corporate and trucking services; and operating vessels. The company was incorporated in 1987 and is based in Wan Chai, Hong Kong. Orient Overseas (International) Limited is a subsidiary of Faulkner Global Holdings Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.ooilgroup.com",
        "market_cap": 10901360640
    },
    "OYD.F": {
        "short_name": "PACIFIC BASIN SHIP.DL-,01",
        "long_name": "Pacific Basin Shipping Limited",
        "summary": "Pacific Basin Shipping Limited, an investment holding company, provides dry bulk shipping services worldwide. As of February 29, 2020, the company had a fleet of 235 ships, including 133 Handysize vessels, 117 Supramax vessels, and 2 Post-Panamax vessels. It also offers shipping consulting, ocean shipping, crewing, secretarial, and agency and ship management services; and engages in the vessel owning and chartering, and convertible bonds issuing activities. Pacific Basin Shipping Limited was founded in 1987 and is headquartered in Wong Chuk Hang, Hong Kong.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wong Chuk Hang",
        "zipcode": null,
        "website": "http://www.pacificbasin.com",
        "market_cap": 1556916096
    },
    "PCFBF": {
        "short_name": "PACIFIC BASIN SHIPPING LTD",
        "long_name": "Pacific Basin Shipping Limited",
        "summary": "Pacific Basin Shipping Limited, an investment holding company, provides dry bulk shipping services worldwide. As of February 29, 2020, the company had a fleet of 235 ships, including 133 Handysize vessels, 117 Supramax vessels, and 2 Post-Panamax vessels. It also offers shipping consulting, ocean shipping, crewing, secretarial, and agency and ship management services; and engages in the vessel owning and chartering, and convertible bonds issuing activities. Pacific Basin Shipping Limited was founded in 1987 and is headquartered in Wong Chuk Hang, Hong Kong.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wong Chuk Hang",
        "zipcode": null,
        "website": "http://www.pacificbasin.com",
        "market_cap": 1831924608
    },
    "PCFBY": {
        "short_name": "PACIFIC BASIN SHIPPING LTD",
        "long_name": "Pacific Basin Shipping Limited",
        "summary": "Pacific Basin Shipping Limited, an investment holding company, provides dry bulk shipping services worldwide. As of February 29, 2020, the company had a fleet of 235 ships, including 133 Handysize vessels, 117 Supramax vessels, and 2 Post-Panamax vessels. It also offers shipping consulting, ocean shipping, crewing, secretarial, and agency and ship management services; and engages in the vessel owning and chartering, and convertible bonds issuing activities. Pacific Basin Shipping Limited was founded in 1987 and is headquartered in Wong Chuk Hang, Hong Kong.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wong Chuk Hang",
        "zipcode": null,
        "website": "http://www.pacificbasin.com",
        "market_cap": 1868650240
    },
    "T9P.F": {
        "short_name": "TIANJIN PORT DEV.H. HD-10",
        "long_name": "Tianjin Port Development Holdings Limited",
        "summary": "Tianjin Port Development Holdings Limited, an investment holding company, operates the port of Tianjin in the People's Republic of China. It operates in three segments: Cargo Handling, Sales, and Other Port Ancillary Services. The Cargo Handling segment provides container handling and non-containerized cargo handling services. The Sales segment is involved in the supply of fuel to the inbound vessels; and sale of supplies and other materials. The Other Port Ancillary Services segment offers tugboat, agency, tallying, and other services. Tianjin Port Development Holdings Limited also provides warehousing, logistics, treasury, and other ancillary services. The company was founded in 1968 and is headquartered in Causeway Bay, Hong Kong. Tianjin Port Development Holdings Limited is a subsidiary of Tianjin Port Overseas Holding Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.tianjinportdev.com",
        "market_cap": 564716352
    },
    "TJIPF": {
        "short_name": "TIANJIN PORT DEVELOPMENT HDGS. ",
        "long_name": "Tianjin Port Development Holdings Limited",
        "summary": "Tianjin Port Development Holdings Limited, an investment holding company, operates the port of Tianjin in the People's Republic of China. It operates in three segments: Cargo Handling, Sales, and Other Port Ancillary Services. The Cargo Handling segment provides container handling and non-containerized cargo handling services. The Sales segment is involved in the supply of fuel to the inbound vessels; and sale of supplies and other materials. The Other Port Ancillary Services segment offers tugboat, agency, tallying, and other services. Tianjin Port Development Holdings Limited also provides warehousing, logistics, treasury, and other ancillary services. The company was founded in 1968 and is headquartered in Causeway Bay, Hong Kong. Tianjin Port Development Holdings Limited is a subsidiary of Tianjin Port Overseas Holding Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.tianjinportdev.com",
        "market_cap": 511663424
    },
    "ZU2.F": {
        "short_name": "ZHUHAI HD. INV. GP HK-,10",
        "long_name": "Zhuhai Holdings Investment Group Limited",
        "summary": "Zhuhai Holdings Investment Group Limited, an investment holding company, provides port facilities and ferry services in the People's Republic of China. It operates through eight segments: Jiuzhou Blue Sea Jet and Blue Marine Tourism, Hotel, Tourist Attraction, Property Development, Golf Club Operations, Public Utilities, Financial Investments, and Corporate and Others. The company also manages a holiday resort hotel, and a theme park and an amusement park; develops and sells properties; and operates golf club facilities. In addition, it is involved in the trading and distribution of fuel oil; constructs river-regulating facilities and provides related maintenance service; and provision of financial information services and Internet financial information intermediary services. The company was formerly known as Jiuzhou Development Company Limited and changed its name to Zhuhai Holdings Investment Group Limited in January 2013. Zhuhai Holdings Investment Group Limited was incorporated in 1998 and is headquartered in Sheung Wan, Hong Kong.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sheung Wan",
        "zipcode": null,
        "website": "http://www.0908.hk",
        "market_cap": 460312320
    }
}