{
    "1850.HK": {
        "short_name": "WINDMILL GP",
        "long_name": "WINDMILL Group Limited",
        "summary": "WINDMILL Group Limited operates as a fire service installation contractor in Hong Kong. The company engages in the design, supply, and installation of fire safety systems for buildings under construction or re-development. It is also involved in the maintenance and repair of fire safety systems for built premises and projects, such as railway stations, utility facilities, hospitals, airport premises, and data centers. In addition, the company trades in fire service accessories, including branded fire services equipment. Windmill Group Limited was founded in 1985 and is headquartered in Kowloon Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kowloon Bay"
    },
    "2086.HK": {
        "short_name": "HNA TECH INV",
        "long_name": "HNA Technology Investments Holdings Limited",
        "summary": "HNA Technology Investments Holdings Limited, an investment holding company, develops, sells, and distributes smart card products, software, and hardware in the People's Republic of China, the United States, Fiji, Japan, Turkey, the Philippines, and internationally. The company operates through two segments, The Financial Technology and Smart Living Business; and The Financial Services and Investment Business. It also provides smart card related services; and advisory services, including financial due diligence and business operation consultancy services. The company was formerly known as Advanced Card Systems Holdings Limited and changed its name to HNA Technology Investments Holdings Limited in August 2017. The company was founded in 1995 and is headquartered in Kowloon Bay, Hong Kong. HNA Technology Investments Holdings Limited is a subsidiary of HNA EcoTech Pioneer Acquisition.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kowloon Bay"
    },
    "2885.HK": {
        "short_name": "PEIPORT HOLD",
        "long_name": "Peiport Holdings Ltd.",
        "summary": "Peiport Holdings Ltd., an investment holding company, provides thermal and self-stabilized imaging products and services in the People's Republic of China and internationally. The company offers thermal imaging products under the PTi and other brand names primarily for use in the general consumption, commercial, and industrial fields, as well as thermal imaging inspection services. It also provides self-stabilized imaging products and services mounted on aircrafts, helicopters, vessels, and ships under the SkyEye, SeaVision, and PGs brand names, as well as rents self-stabilized imaging products for aircrafts. In addition, the company distributes general aviation products, including light and ultra-light aircraft engines and related components; and provides maintenance training courses, as well as maintenance and support services to light and ultra-light aircraft manufacturers, flight schools, flying entertainment clubs, light aircraft research institutions, and private flight owners. Peiport Holdings Ltd. was founded in 1998 and is headquartered in Tai Po, Hong Kong. Peiport Holdings Ltd. is a subsidiary of Peiport Alpha Ltd.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tai Po"
    },
    "8051.HK": {
        "short_name": "CIRCUTECH",
        "long_name": "CircuTech International Holdings Limited",
        "summary": "CircuTech International Holdings Limited, an investment holding company, engages in the research and development, manufacture, marketing, and sale of video surveillance systems in North America, Europe, Asia, Africa, and internationally. It is also involved in the distribution of third party IT products; and provision of repair, maintenance, and other support services for electronic products. The company was formerly known as TeleEye Holdings Limited and changed its name to CircuTech International Holdings Limited in August 2016. CircuTech International Holdings Limited was founded in 1994 and is headquartered in Causeway Bay, Hong Kong. CircuTech International Holdings Limited is a subsidiary of Foxconn (Far East) Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Causeway Bay"
    },
    "UVEL.L": {
        "short_name": "UNIVISION ENGINEERING LIMITED O",
        "long_name": "UniVision Engineering Limited",
        "summary": "UniVision Engineering Limited, an investment holding company, designs, supplies, consults, installs, and maintains closed circuit televisions in the People's Republic of China. It provides video matrix switchers/controllers, on-site receivers/driver color cameras, quad units and multiplexers, video distribution amplifiers, sequential video switcher, indoor camera enclosures, fiber optic transmitter/receivers, digital video recording systems, digital network surveillance systems, and digital security monitoring and control system software. The company also offers IP network intercom and security intercom products; and sells security related products. UniVision Engineering Limited was founded in 1979 and is based in Kwun Tong, Hong Kong.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    }
}