{
    "0057.HK": {
        "short_name": "CHEN HSONG HOLD",
        "long_name": "Chen Hsong Holdings Limited",
        "summary": "Chen Hsong Holdings Limited, an investment holding company, manufactures, sells, and imports plastic injection molding machines, spare parts, and related products in Mainland China, Hong Kong, Taiwan, and internationally. The company also engages in the manufacture and sale of tie bars, hydraulic motors, and casting parts, as well as in property holding activities. Its products are used in automotive, bumpers and guards, decorative parts, door and instrument panels, lamps, seating and structural parts, construction, piping, switches and sockets, consumer electronics, audio/visual equipment, computer and laptops, electronics, mobile phones, office equipment, household goods, disposable utensils, furniture, household, injection molding appliances, air conditioners, kitchen utilities, power tools, refrigerators, washing machines, logistics, containers, medical equipment, toys, packaging, cosmetics, disposable boxes and cups, and PET preforms. The company was founded in 1958 and is headquartered in Tai Po, Hong Kong. Chen Hsong Holdings Limited is a subsidiary of Chen Hsong Investments Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tai Po"
    },
    "0387.HK": {
        "short_name": "LEEPORT(HOLD)",
        "long_name": "Leeport (Holdings) Limited",
        "summary": "Leeport (Holdings) Limited, an investment holding company, imports and distributes equipment and precision tools for the manufacturing industry primarily in the People's Republic of China, Hong Kong, and internationally. Its products include metal cutting machines; metal forming machinery; measuring instruments; professional and cutting tools and accessories; electronic equipment; and additive equipment. The company is also involved in the trading of metalworking machinery, measuring instruments, cutting tools, and electronic equipment, as well as screws, machine tools and related products, and rapid prototype equipment; and provision of automation solutions and processes, and handling solutions in engineering and manufacturing activities. In addition, it offers product design, prototype fabrication, and part manufacturing services. The company was founded in 1967 and is headquartered in Kwai Chung, Hong Kong. Leeport (Holdings) Limited is a subsidiary of Peak Power Technology Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kwai Chung"
    },
    "0445.HK": {
        "short_name": "CIMC-TIANDA",
        "long_name": "CIMC-TianDa Holdings Company Limited",
        "summary": "CIMC-TianDa Holdings Company Limited, an investment holding company, manufactures and sells airport equipment in the People's Republic of China, rest of Asia, North America, Europe, the Middle East, Africa, South America, and Oceania. It operates through four segments: Passengers Boarding Bridge and Automated Parking System, Ground Support Equipment, Logistics System Business, Fire Engines and Fire Prevention and Fighting Equipment. It manufactures and sells passenger boarding bridges for connecting airport terminals to commercial aircraft, as well as automated vehicle parking systems, such as vertical lifting parking systems, aisle stacking parking systems, vertical and horizontal carriage parking systems, and lift-only parking systems; and manufactures and repairs airport group support equipment comprising airport apron buses, aircraft catering vehicles, cargo loaders, and other specialised vehicles. The company also offers engineering and computer software solutions for baggage, cargos, and materials handling and warehousing systems; and produces and sells fire engines, and fire prevention and fighting equipment. In addition, it offers maintenance and other specialised business services for airport and harbour equipment, as well as infrastructural engineering and maintenance services; sells and distributes passenger boarding bridge and ground support equipment, modern logistics automation system, and high speed sorting systems; supplies and maintains airport logistics systems and equipment; provides sale and technical services of automatic parking system and equipment, mechanical products, metal structural parts, self-produced products, and agent products; and develops and sale of air conditioning equipment. The company is headquartered in Wan Chai, Hong Kong. CIMC-TianDa Holdings Company Limited is a subsidiary of China International Marine Containers (Hong Kong) Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "0607.HK": {
        "short_name": "FULLSHARE",
        "long_name": "Fullshare Holdings Limited",
        "summary": "Fullshare Holdings Limited, an investment holding company, engages in the property development, sale of gear products, and property investment activities in the People's Republic of China, the United States, Europe, Australia, and internationally. It operates through five segments: Properties; Tourism; Investment and Financial Services; Healthcare, Education, and Others; and New Energy. The company develops and sells properties, including residential, commercial, hotels, offices, apartments, and shopping malls; and provides construction related services. It also holds and trades in various investments and financial products, such as listed and unlisted securities, bonds, funds, derivatives, structured, and other treasury products; offers investment and financial related consulting services; and operates hotels, as well as sells tourist goods and provides related services. In addition, the company also engages in the research, design, development, manufacture, and distribution of mechanical transmission equipment comprising wind, industrial, and rail gear transmission equipment that are used in wind power and a wide range of industrial applications; and manufacture and sale of gear products. In addition, the company provides healthcare and education products and related services; and green building services comprising technical design and consulting, green management, and construction services. The company was formerly known as Warderly International Holdings Limited and changed its name to Fullshare Holdings Limited in October 2014. The company was founded in 2002 and is headquartered in Admiralty, Hong Kong. Fullshare Holdings Limited is a subsidiary of Magnolia Wealth International Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Admiralty"
    },
    "0641.HK": {
        "short_name": "CHTC FONG'S INT",
        "long_name": "CHTC Fong's International Company Limited",
        "summary": "CHTC Fong's International Company Limited, an investment holding company, manufactures and sells dyeing and finishing machines. It also manufactures, sells, and trades in stainless steel casting products, textile machinery, and technical parts; trades in stainless steel supplies; and offers services on kitchen wastes recycling, animal carcasses, and innocuous treatment. In addition, the company invests in properties, as well as provides consultancy services. It operates in the People's Republic of China, Hong Kong, the rest of Asia Pacific, Europe, North and South America, and internationally. The company was formerly known as CHTC Fong's Industries Company Limited and changed its name to CHTC Fong's International Company Limited in January 2018. CHTC Fong's International Company Limited was founded in 1963 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kwai Chung"
    },
    "0679.HK": {
        "short_name": "ASIA TELE-NET",
        "long_name": "Asia Tele-Net and Technology Corporation Limited",
        "summary": "Asia Tele-Net and Technology Corporation Limited, an investment holding company, designs, manufactures, and sells electroplating machinery and other industrial machinery. It also provides installation and after sale services for electroplating machines; and sells spare parts. In addition, the company is involved in securities trading, management services, property investment, software development, and money lending businesses. It primarily operates in Hong Kong, the People's Republic of China, Taiwan, Europe, the United States, and other Asia countries. The company was formerly known as Process Automation (Holdings) Ltd and changed its name to Asia Tele-Net and Technology Corporation Limited in 1999. Asia Tele-Net and Technology Corporation Limited was founded in 1966 and is headquartered in Tai Po, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tai Po"
    },
    "1536.HK": {
        "short_name": "YUK WING GP",
        "long_name": "Yuk Wing Group Holdings Limited",
        "summary": "Yuk Wing Group Holdings Limited, an investment holding company, designs, manufactures, and trades in down-the-hole (DTH) rock drilling tools in Hong Kong and Macau. The company operates through Manufacturing and Trading of DTH Rockdrilling Tools; Trading of Piling and Drilling Machineries; and Trading of Rockdrilling Equipment segments. It offers DTH hammers, casing systems, button bits and bit openers, drill pipes, cluster drills, and casing tubes; and technical rock drilling solutions. Its products are used in mining and quarrying, and building foundation and piling on construction sites, mining and quarrying, water well drilling, utility linings, and micro-tunneling. The company was founded in 1997 and is based in Sheung Wan, Hong Kong. Yuk Wing Group Holdings Limited is a subsidiary of Colour Shine Investments Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Sheung Wan"
    },
    "1882.HK": {
        "short_name": "HAITIAN INT'L",
        "long_name": "Haitian International Holdings Limited",
        "summary": "Haitian International Holdings Limited, an investment holding company, researches, develops, processes, manufactures, distributes, and sells plastic injection molding machines. The company offers injection molding machines. It is also involved in the trading of machinery and related accessories; sale of software of plastic injection molding machines; and provision of logistic services. It operates in Mainland China, Hong Kong, and internationally. The company was founded in 1966 and is headquartered in Kwai Fong, Hong Kong. Haitian International Holdings Limited is a subsidiary of Sky Treasure Capital Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kwai Fong"
    },
    "3628.HK": {
        "short_name": "RENHENG ENT",
        "long_name": "RENHENG Enterprise Holdings Limited",
        "summary": "RENHENG Enterprise Holdings Limited, an investment holding company, manufactures and sells tobacco machinery products in the People's Republic of China. It offers special-purpose tobacco machinery products, such as casing and flavoring systems, pneumatic feeding systems, and pre-pressing packing machines. The company also provides non-catalogued ancillary tobacco machinery, including dedusting systems and swelling agent delivery systems; and maintenance, overhaul, and modification services. RENHENG Enterprise Holdings Limited was incorporated in 2011 and is headquartered in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Admiralty"
    },
    "8115.HK": {
        "short_name": "SHANGHAI QINGPU",
        "long_name": "Shanghai Qingpu Fire-Fighting Equipment Co., Ltd.",
        "summary": "Shanghai Qingpu Fire-Fighting Equipment Co., Ltd., together with its subsidiaries, manufactures and sells firefighting equipment and pressure vessel products in the People's Republic of China, the United States, the European Union, and internationally. The company operates through seven segments: Fire-Fighting Equipment, Inspection Services, Grooved Couplings, Trading, Aquarium Products, Marine Fire-Fighting, and Property Investment. It also provides fire technology inspection services; installs and inspects marine fire-fighting equipment; manufactures and trades in iron casted grooved couplings; trades in sanitary-ware and other products; and invests in and rents office buildings and industrial properties, as well as sells aquarium products. The company was formerly known as Shanghai Qingpu Fire-Fighting Equipment Factory and changed its name to Shanghai Qingpu Fire-Fighting Equipment Co., Ltd. in December 2000. The company is based in North Point, Hong Kong. Shanghai Qingpu Fire-Fighting Equipment Co., Ltd. is a subsidiary of Liancheng Fire-Fighting Group Company Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "North Point"
    },
    "8617.HK": {
        "short_name": "BEST LINKING",
        "long_name": "Best Linking Group Holdings Limited",
        "summary": "Best Linking Group Holdings Limited manufactures and sells slewing rings in the People's Republic of China, Singapore, Malaysia, Hong Kong, Canada, Taiwan, Northern Ireland, the United States, Japan, Thailand, and internationally. The company provides slewing rings for use as transmission part in construction machineries and equipment, wind turbines, military equipment, robotics, cranes, excavators, solar powers, generators, attachments, etc. It offers its products under the original brand manufacturing, original design manufacturing, and original equipment manufacturing basis. The company was founded in 2007 and is headquartered in Tsim Sha Tsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "CHJ.F": {
        "short_name": "CHEN HSONG HLDGS  HD-,10",
        "long_name": "Chen Hsong Holdings Limited",
        "summary": "Chen Hsong Holdings Limited, an investment holding company, manufactures, sells, and imports plastic injection molding machines, spare parts, and related products in Mainland China, Hong Kong, Taiwan, and internationally. The company also engages in the manufacture and sale of tie bars, hydraulic motors, and casting parts, as well as in property holding activities. Its products are used in automotive, bumpers and guards, decorative parts, door and instrument panels, lamps, seating and structural parts, construction, piping, switches and sockets, consumer electronics, audio/visual equipment, computer and laptops, electronics, mobile phones, office equipment, household goods, disposable utensils, furniture, household, injection molding appliances, air conditioners, kitchen utilities, power tools, refrigerators, washing machines, logistics, containers, medical equipment, toys, packaging, cosmetics, disposable boxes and cups, and PET preforms. The company was founded in 1958 and is headquartered in Tai Po, Hong Kong. Chen Hsong Holdings Limited is a subsidiary of Chen Hsong Investments Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Tai Po"
    },
    "DKC.F": {
        "short_name": "ASIA TELE-NET CONS. HD-01",
        "long_name": "Asia Tele-Net and Technology Corporation Limited",
        "summary": "Asia Tele-Net and Technology Corporation Limited, an investment holding company, designs, manufactures, and sells electroplating machinery and other industrial machinery. It also provides installation and after sale services for electroplating machines; and sells spare parts. In addition, the company is involved in securities trading, management services, property investment, software development, and money lending businesses. It primarily operates in Hong Kong, the People's Republic of China, Taiwan, Europe, the United States, and other Asia countries. The company was formerly known as Process Automation (Holdings) Ltd and changed its name to Asia Tele-Net and Technology Corporation Limited in 1999. Asia Tele-Net and Technology Corporation Limited was founded in 1966 and is headquartered in Tai Po, Hong Kong.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Tai Po"
    },
    "HI6.F": {
        "short_name": "HAITIAN INTL HLDGS HD-,10",
        "long_name": "Haitian International Holdings Limited",
        "summary": "Haitian International Holdings Limited, an investment holding company, researches, develops, processes, manufactures, distributes, and sells plastic injection molding machines. The company offers injection molding machines. It is also involved in the trading of machinery and related accessories; sale of software of plastic injection molding machines; and provision of logistic services. It operates in Mainland China, Hong Kong, and internationally. The company was founded in 1966 and is headquartered in Kwai Fong, Hong Kong. Haitian International Holdings Limited is a subsidiary of Sky Treasure Capital Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Kwai Fong"
    },
    "WAV.SG": {
        "short_name": "Fullshare Holdings Ltd. Registe",
        "long_name": "Fullshare Holdings Limited",
        "summary": "Fullshare Holdings Limited, an investment holding company, engages in the property development, sale of gear products, and property investment activities in the People's Republic of China, the United States, Europe, Australia, and internationally. It operates through five segments: Properties; Tourism; Investment and Financial Services; Healthcare, Education, and Others; and New Energy. The company develops and sells properties, including residential, commercial, hotels, offices, apartments, and shopping malls; and provides construction related services. It also holds and trades in various investments and financial products, such as listed and unlisted securities, bonds, funds, derivatives, structured, and other treasury products; offers investment and financial related consulting services; and operates hotels, as well as sells tourist goods and provides related services. In addition, the company also engages in the research, design, development, manufacture, and distribution of mechanical transmission equipment comprising wind, industrial, and rail gear transmission equipment that are used in wind power and a wide range of industrial applications; and manufacture and sale of gear products. In addition, the company provides healthcare and education products and related services; and green building services comprising technical design and consulting, green management, and construction services. The company was formerly known as Warderly International Holdings Limited and changed its name to Fullshare Holdings Limited in October 2014. The company was founded in 2002 and is headquartered in Admiralty, Hong Kong. Fullshare Holdings Limited is a subsidiary of Magnolia Wealth International Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Admiralty"
    }
}