{
    "2225.HK": {
        "short_name": "JINHAI INTL",
        "long_name": "Jinhai International Group Holdings Limited",
        "summary": "Jinhai International Group Holdings Limited, an investment holding company, primarily provides manpower outsourcing and ancillary services to building and construction contractors in Singapore. The company offers labor dispatching and supporting services. It also provides dormitory services; information technology services, such as support and maintenance; and construction ancillary services comprising warehousing, cleaning, and building maintenance works. The company was formerly known as Kakiko Group Limited and changed its name to Jinhai International Group Holdings Limited in October 2019. Jinhai International Group Holdings Limited was incorporated in 2017 and is based in Sheung Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Sheung Wan"
    },
    "8260.HK": {
        "short_name": "YIN HE HLDGS",
        "long_name": "Yin He Holdings Limited",
        "summary": "Yin He Holdings Limited, an investment holding company, provides human resources services in the People's Republic of China. The company operates through six segments: Human Resources Services, Credit Consultancy Services, Loan Facilitation Services, Asset Management Services, Loan Financing Services, and Insurance Training Services. It offers staff outsourcing services, executive/staff search, and other human resources support services; credit assessment and consultancy services; financial advisory services for corporate, asset management firms, private equity funds, and minority investments in private companies; and loan financing services. The company also operates peer-to-peer financing platform and other loan facilitation business, as well as provision of other relevant consultation services. In addition, it engages in insurance training business. The company was formerly known as Zebra Strategic Holdings Limited and changed its name to Yin He Holdings Limited in January 2016. Yin He Holdings Limited was incorporated in 2012 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "8462.HK": {
        "short_name": "OMNIBRIDGE HLDG",
        "long_name": "Omnibridge Holdings Limited",
        "summary": "Omnibridge Holdings Limited, an investment holding company, provides human resources outsourcing and recruitment services in Singapore and Hong Kong. It sources and employs suitable candidates that match the job requirement to perform job duties under client's direct instructions; and human resources recruitment services to employers seeking appropriate candidates generally for positions at all levels, including administrative, executive, managerial, and professional, to fulfill their needs. The company also offers other human resources support services, such as referral and parking services. It serves public and private sector clients, including Singapore government agencies and non-profit organizations. The company was founded in 2005 and is headquartered in Admiralty, Hong Kong. Omnibridge Holdings Limited is a subsidiary of Omnipartners Holdings Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Admiralty"
    }
}