{
    "AMB.MI": {
        "short_name": "AMBROMOBILIARE",
        "long_name": "Ambromobiliare S.p.A.",
        "summary": "Ambromobiliare S.p.A. provides financial advisory services for medium-sized companies in Italy and internationally. The company offers equity capital market services; and financial advisory services, such as mergers and acquisitions, JVs and partnerships, divestitures, demergers, and capital restructuring services, as well as ancillary services. It also provides structured finance services, such as debt management, financial and budget analysis, strategic sector positioning, determination of cash flows, and the preparation of information memorandum for complex loans, as well as mezzanine finance. Ambromobiliare S.p.A. is based in Milan, Italy.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "city": "Milan"
    },
    "CFV.MI": {
        "short_name": "CONFINVEST",
        "long_name": "Confinvest F.L. S.p.A.",
        "summary": "Confinvest F.L. S.p.A. engages in the gold coins and ingots brokerage business in Italy. It sells gold coins and ingots; invests in physical gold; and offers physical gold accumulation plans, as well as physical gold custody services. The company was founded in 1983 and is headquartered in Milan, Italy.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "city": "Milan"
    },
    "EQUI.MI": {
        "short_name": "EQUITA GROUP",
        "long_name": "Equita Group S.p.A.",
        "summary": "Equita Group S.p.A. provides sales and trading, investment banking, asset management, and corporate financial services for industrial companies, institutional investors, professionals, retail investors, large corporates, small and medium enterprises, and financial institutions in Italy and internationally. It trades in equities, bonds, derivatives, and exchange traded funds; and provides merger and acquisition transactions, and equity and bond issues and placements advisory services. In addition, the company offers private debt, private equity, and directional and proprietary trading services; retail hub services; brokerage services on debt securities; equity capital market services; debt capital markets, debt advisory, and e-debt restructuring services; and corporate broking services, as well as acts as a special purpose vehicles. The company is headquartered in Milan, Italy.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "city": "Milan"
    },
    "FIC.MI": {
        "short_name": "FIRST CAPITAL",
        "long_name": "First Capital S.p.A.",
        "summary": "First Capital S.p.A. is a private equity firm specializing in public equity and private equity investments, mature, buyout, growth capital, and PIPEs investments in small/medium sized companies. The firm invests in different types of financial instruments: ordinary shares, special shares, convertible bonds and bonds cum warrants. The firm seeks to acquire equity positions in enterprises that are either already listed or in the pre-IPO phase. The firm has no industry limitations. It invests in all companies based in Italy. It considers investments in manufacturing and service sectors. The firm prefers to invest between Â\u00800.5 million ($0.62 million) and Â\u008010 million ($12.49 million) in companies having maximum enterprise value of 150 million ($167.90 million). The firm invests in companies whose revenues are between Â\u008050 million ($55.45 million) and Â\u0080150 million ($166.35 million), Debt/Equity ratio is between 0 and 1, return on capital employed greater than 10 percent, EBITDA greater than Â\u00805 million ($5.54 million) publicly quoted market float is greater than 15% of the enterprise value and no single investment is allowed to exceed an ownership greater than 10% of outstanding equity, or 25% of the First Capital fund Net Asset Value. The firm seeks to invest through its balance sheet. First Capital S.p.A. was founded in 2008 and is based in Milan, Italy.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "city": "Milan"
    },
    "SCM.MI": {
        "short_name": "SOLUTIONS CAPITAL MANAGEMENT SI",
        "long_name": "Solutions Capital Management SIM S.p.A.",
        "summary": "Solutions Capital Management SIM S.p.A. provides portfolio management and investment advisory services. It offers wealth management, MIFID consulting, general advisory, personal financial and risk planning, and placement services. The company was founded in 2009 and is based in Milan, Italy. Solutions Capital Management SIM S.p.A. is a subsidiary of Hps Holding Partecipazioni Societarie S.R.L.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "city": "Milan"
    },
    "T1I.F": {
        "short_name": "TAMBURI INVT PARTN.EO-,52",
        "long_name": "Tamburi Investment Partners S.p.A.",
        "summary": "Tamburi Investment Partners S.p.A. is private equity firm specializing in direct and secondary direct investments. The firm also co-invests with other entrepreneurs and investors. Within direct investments, it invests in middle market, later stage, buyouts, mature, industry consolidations, recapitalizations, growth capital, and turnaround investments. The firm seeks to invest in medium sized small-mid cap companies in all industries including consumer discretionary, consumer staples, energy, luxury, healthcare, industrials, information technology, materials, telecommunication services, and utilities. It prefers to invest in pre-IPO and PIPES investments in listed and unlisted companies. The firm invests in companies based in Asia and Europe with a focus on Italy. It typically invests between $5 million and $50 million in companies with a minimum sales value of $100 million. The prefers to take minority stakes in its portfolio companies. It makes balance sheet investments. Tamburi Investment Partners S.p.A. was founded in 1993 and is based in Milan, Italy.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "city": "Milan"
    },
    "TIP.MI": {
        "short_name": "TAMBURI",
        "long_name": "Tamburi Investment Partners S.p.A.",
        "summary": "Tamburi Investment Partners S.p.A. is private equity firm specializing in direct and secondary direct investments. The firm also co-invests with other entrepreneurs and investors. Within direct investments, it invests in middle market, later stage, buyouts, mature, industry consolidations, recapitalizations, growth capital, and turnaround investments. The firm seeks to invest in medium sized small-mid cap companies in all industries including consumer discretionary, consumer staples, energy, luxury, healthcare, industrials, information technology, materials, telecommunication services, and utilities. It prefers to invest in pre-IPO and PIPES investments in listed and unlisted companies. The firm invests in companies based in Asia and Europe with a focus on Italy. It typically invests between $5 million and $50 million in companies with a minimum sales value of $100 million. The prefers to take minority stakes in its portfolio companies. It makes balance sheet investments. Tamburi Investment Partners S.p.A. was founded in 1993 and is based in Milan, Italy.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "city": "Milan"
    },
    "U24.MI": {
        "short_name": "UCAPITAL24",
        "long_name": "UCapital24 S.p.A.",
        "summary": "UCapital24 S.p.A. develops a platform for economic and financial social network worldwide. It provides institutional type tools to retail users; and creates a digital place for financial operators to extend their business and acquire new customers. The company offers an aggregator of financial and economic services and tools within a social media platform, which guarantees access to professional business intelligence analysis and sharing of opinions, comments, and personal data. It serves customers through the platform, which is accessible via Website and a mobile app. The company was founded in 2017 and is headquartered in Milan, Italy.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "city": "Milan"
    }
}