{
  "030000.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Advertising Agencies",
    "long_name": "Cheil Worldwide Inc.",
    "market": "kr_market",
    "market_cap": "Mid Cap",
    "sector": "Communication Services",
    "short_name": "CheilWorldwide",
    "state": null,
    "summary": "Cheil Worldwide Inc. provides various marketing solutions worldwide. It offers strategic, creative, and media solutions; integrated digital marketing solution and social media platform; and experiential marketing solutions, such as events, exhibitions, sports, and retail marketing solutions. The company was founded in 1973 and is headquartered in Seoul, South Korea.",
    "website": "http://www.cheil.com/hq",
    "zipcode": null
  },
  "035000.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Advertising Agencies",
    "long_name": "GIIR Inc.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "GR",
    "state": null,
    "summary": "GIIR Inc., together with its subsidiaries, operates as an advertising and marketing communications company in South Korea and internationally. The company was founded in 1962 and is headquartered in Seoul, South Korea.",
    "website": "http://www.g2rgroup.com",
    "zipcode": null
  },
  "214320.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Advertising Agencies",
    "long_name": "Innocean Worldwide Inc.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "INNOCEAN",
    "state": null,
    "summary": "Innocean Worldwide Inc. provides marketing and communications services worldwide. The company offers advertising services; digital services, including providing campaigns for online, mobile, social, and other means in the media environment and advanced digital platform operations; and experiential services, such as planning and producing content to induce significant consumer behaviors. It also provides marketing services, such as brand diagnosis, problem extraction, discovery of market opportunities, brand positioning, and communication strategy development; and media services. The company was founded in 2005 and is headquartered in Seoul, South Korea.",
    "website": "http://www.innocean.com",
    "zipcode": "135-937"
  }
}
