{
    "010820.KS": {
        "short_name": "FIRSTEC",
        "long_name": "FIRSTEC Co., Ltd",
        "summary": "FIRSTEC Co., Ltd designs, manufactures, and sells firing control, guidance control, actuation, environmental control, wire harness, and various precision systems worldwide. The company offers environmental control systems for POD, air data systems, throttle quadrant systems, NVIS and cockpit panels, MFD, attitude control systems, landing/search lights, FADEC, wire harness/electrical kits, simulators, control display units, combined systems, fire extinguishing systems, and air data systems for the aerospace industry. It also provides guided weapon products, including actuation systems, guidance control systems, fire control systems, fuel propulsion systems, cables, valves, and electrical parts used in surface-to-air missiles, anti-submarine missiles, ship-to-ship missiles, LOGIR applications, etc. In addition, the company offers driver panel units, driving systems, speed sensor kits, slip rings, cables and electrical kits, chutes, control panels, A/Z indicators, firing interrupters, instrument panels, gear boxes, automatic fire extinguishers, winches, radar components, etc., as well as develops projects for military intelligent robots and ranger robots. Further, it provides rocking arms assemblies, safety firing gear assemblies, mine laying controllers and systems, signal ejectors, and deceiving systems against torpedo for use in warship guns, minelayers ships, submarines, etc. Additionally, the company offers unmanned ground vehicles for demonstration of explosives, and ordnance disposal and reconnaissance; UAV, such as fuel systems, full-scale structure test products, and ground support equipment; and ground control systems, de-icing devices, navigation devices, and docking stations for intelligence, surveillance, and reconnaissance applications, as well as face recognition solutions. FIRSTEC Co., Ltd was founded in 1975 and is headquartered in Changwon, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Changwon",
        "zipcode": "642-050",
        "website": "http://www.firsteccom.co.kr",
        "full_time_employees": null
    },
    "012450.KS": {
        "short_name": "HANWHA AEROSPACE CO LTD",
        "long_name": "Hanwha Aerospace Co., Ltd.",
        "summary": "Hanwha Aerospace Co., Ltd. engages in the development, production, and maintenance of aircraft engines for civil aircraft, combat planes, helicopters, and vessels worldwide. The company also offers fan parts, such as inlet cases, outer guided vanes, and fan blades; compressor parts, including blisks/blades, cases and structures, integrally bladed rotors; combustor modules, cases, and structures; and low pressure turbine modules/blades to original engine manufacturers, as well as repairs, exchanges, and commissions parts. In addition, it provides aero mechanical systems that include flight control systems, hydraulic systems, fuel systems, etc. for fixed and rotary wing aircraft; and thrust vector control systems, reaction control systems, and liquid propellant supply systems for space launch vehicles, as well as offers military aircraft maintenance services. The company was founded in 1977 and is headquartered in Changwon-si, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Changwon-Si",
        "zipcode": null,
        "website": "http://www.hanwhaaerospace.com",
        "full_time_employees": null
    },
    "079550.KS": {
        "short_name": "LIG Nex1",
        "long_name": "LIG Nex1 Co., Ltd.",
        "summary": "LIG Nex1 Co., Ltd. develops and produces various weapon systems worldwide. The company offers precision guided munitions, which include ground-based guided missiles; ship-launched/air-launched guided missiles; and underwater guided missiles. It also provides intelligence, surveillance, and reconnaissance products that include radar systems, electronic optics/imaging radars, and SONAR surveillance systems. In addition, the company offers command and control systems, such as ground-based command and control systems for unmanned aerial systems, tactical data links, vehicle command and control systems, and surface combat management systems; and tactical communication/navigation systems comprising satellite navigation systems, data links for unmanned drones, and strategic communication systems. Further, it provides avionics consisting of mission, display, flight control, and communication/navigation/identification systems; airborne, ground-based, and maritime electronic warfare systems; unmanned drone/robotics systems, which include unmanned systems/robotics projects and unmanned drone/robotics for ships; and cyber warfare/M&S/high-energy weapon systems. LIG Nex1 Co., Ltd. was founded in 1976 and is headquartered in Yongin, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Yongin-Si",
        "zipcode": "446-798",
        "website": "http://www.lignex1.com",
        "full_time_employees": null
    },
    "097230.KS": {
        "short_name": "HANJIN HVY IND",
        "long_name": "Hanjin Heavy Industries & Construction Co., Ltd.",
        "summary": "Hanjin Heavy Industries & Construction Co., Ltd. provides shipbuilding and construction services in South Korea and internationally. The company builds war ships, such as transport/landing ships, landing ships, support ships, patrol-boat killer medium rocket, patrol killer guided missile, and coast guard/rescue ships; special purpose ships, LNG bunkering and icebreaking research vessels, cable ship, diving support vessels, training ships/oceanographic research vessels, hydrographic and fishery research vessels, SEMI submersible drilling rigs, and oil spill recovery vessels; and commercial ships, such as LNG, LPG, container, car, and bulk carriers, as well as tankers. It also provides construction and engineering services, which include the construction of various infrastructure projects, such as roads and bridges, dredging and ports, subways and railways, and airports and others, as well as overseas construction; and architectural works in the areas of airports, hospitals, cultural and performance facilities, hospitals, hotels, and educational facilities. In addition, the company engages in the construction of housing projects; and plants and facilities, including power generation and energy facilities, industrial plants, and environmental plants. Hanjin Heavy Industries & Construction Co., Ltd. was founded in 1937 and is based in Busan, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Busan",
        "zipcode": null,
        "website": "http://www.hanjinsc.com",
        "full_time_employees": null
    },
    "172580.KS": {
        "short_name": "Hi Gold No.12",
        "long_name": "Hi Gold Ocean Kmarin No.12 Ship Investment Company",
        "summary": "Hi Gold Ocean Kmarin No.12 Ship Investment Company, through its subsidiaries, invests in vessels. The company was founded in 2013 and is headquartered in Cheju, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Cheju",
        "zipcode": null,
        "website": null,
        "full_time_employees": null
    }
}