{
    "001550.KS": {
        "short_name": "Chobi",
        "long_name": "Chobi Company Limited",
        "summary": "Chobi Company Limited produces and distributes composite fertilizers in South Korea. It offers bulk bending, slow release compound, fertigation and hydrophonix compound, and liquid fertilizers, as well as compound fertilizers for baseal and top dressing. The company was formerly known as Chosun Fertilizer Industry Co., Ltd. and changed its name to Chobi Company Limited in October 1990. Chobi Company Limited was founded in 1955 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "135-860",
        "website": "http://www.chobi.co.kr",
        "market_cap": "Small Cap"
    },
    "002100.KS": {
        "short_name": "Kyungnong",
        "long_name": "Kyung Nong Corporation",
        "summary": "Kyung Nong Corporation manufactures and sells agricultural chemicals in Korea. The company provides various solutions for the farming industry, such as seeds, fertilizers, irrigation, natural insects, eco-friendly products, and freshness maintenance. Kyung Nong Corporation was founded in 1957 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "06627",
        "website": "http://www.knco.co.kr",
        "market_cap": "Small Cap"
    },
    "025860.KS": {
        "short_name": "NamhaeChem",
        "long_name": "Namhae Chemical Corporation",
        "summary": "Namhae Chemical Corporation produces and sells agricultural materials in South Korea and internationally. It offers fertilizers, which contain nitrogen, phosphoric acid, and potassium; and basic chemical products, such as ammonia, sulfuric and fuming sulfuric acid, phosphoric acid, gypsum, hexafluorosilicic acid, sulphate of potash, and hydrochloric acid for use as basic materials in consumer goods, as well as operates gas stations. The company also exports its products. Namhae Chemical Corporation was founded in 1974 and is based in Yeosu, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Yeosu",
        "zipcode": null,
        "website": "http://www.nhchem.co.kr",
        "market_cap": "Small Cap"
    }
}