{
    "001780.KS": {
        "short_name": "ALUKO",
        "long_name": "Aluko Co., Ltd.",
        "summary": "Aluko Co., Ltd. manufactures and sells aluminum products in South Korea and internationally. It offers building materials, including regular/balcony windows, system windows, and curtain walls; and focus, inner, project, and fix and slide windows, as well as sliding and turning doors. The company also engages in designing, manufacturing, and on-site assembling of various form materials for the field structures; and provides curtain walls, such as unit, stick, and panel systems. In addition, it offers CVVT rotor vanes, ABS housing raw, bumper back beams, seat frames, side sills, aluminum bus frames, electric motorcycle frames, and MTB frames for automotive applications; LNG tank structures; railway frames; and industrial materials, such as aluminum palettes and industrial extruded materials. Further, the company provides top chassis and edge bars for display fields; components of electric and electronic/communication products, and airplanes; and industrial materials, such as solar frames. Aluko Co., Ltd. was founded in 1956 and is headquartered in Daejeon, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Daejeon",
        "zipcode": null,
        "website": "http://www.alusash.co.kr",
        "market_cap": "Large Cap"
    },
    "008350.KS": {
        "short_name": "NamsunAlum",
        "long_name": "Namsun Aluminum Co., Ltd.",
        "summary": "Namsun Aluminum Co., Ltd. produces and sells aluminum extruded products in South Korea and internationally. It offers aluminum windows and doors, curtain walls, industrial structure materials, and bomb blast mitigated windows, as well as chassis for windows and doors. The company was formerly known as Namsun Light Metals Co., Ltd. and changed its name to Namsun Aluminum Co., Ltd. in 1990. Namsun Aluminum Co., Ltd. was founded in 1947 and is headquartered in Daegu, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Daegu",
        "zipcode": "42983",
        "website": "http://www.namsun.co.kr",
        "market_cap": "Large Cap"
    },
    "008355.KS": {
        "short_name": "NamsunAlum(1P)",
        "long_name": "Namsun Aluminum Co., Ltd.",
        "summary": "Namsun Aluminum Co., Ltd. produces and sells aluminum extruded products in South Korea and internationally. It offers aluminum windows and doors, curtain walls, industrial structure materials, and bomb blast mitigated windows, as well as chassis for windows and doors. The company was formerly known as Namsun Light Metals Co., Ltd. and changed its name to Namsun Aluminum Co., Ltd. in 1990. Namsun Aluminum Co., Ltd. was founded in 1947 and is headquartered in Daegu, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Daegu",
        "zipcode": "42983",
        "website": "http://www.namsun.co.kr",
        "market_cap": "Large Cap"
    },
    "018470.KS": {
        "short_name": "CHOILALUMINUM",
        "long_name": "Choil Aluminum Co., Ltd.",
        "summary": "Choil Aluminum Co., Ltd. operates as an aluminum rolling company in South Korea. The company provides coiled sheets that are used in foil stock, condenser cases, electric wire covers, insulator covering materials, fin stock, and mold transformers; and sheets and plates for use in litho sheets, cosmetic caps, P.P. caps/closure sheets, name plates, and sound proofing walls. It also offers embossed sheets, which are used in exterior and interior decoration for construction; circled sheets for use in household goods and reflector for light applications; and bands for cosmetic caps and electrical and electronic parts. Choil Aluminum Co., Ltd. was founded in 1975 and is headquartered in Gyeongsan, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Gyeongsan",
        "zipcode": null,
        "website": "http://www.choilal.co.kr",
        "market_cap": "Large Cap"
    },
    "069460.KS": {
        "short_name": "DAEHOAL",
        "long_name": "Daeho Al Co.,Ltd.",
        "summary": "Daeho Al Co.,Ltd. produces and sells various aluminum products in South Korea. It offers aluminum coils and sheets that are used as material for various industries, such as LCD, PDP, PDA, mobile phone, vehicle, etc.; circle sheets for use in kitchen utensil industries, etc.; and special steel materials for use in the construction, as well as products for nano and bio industries. The company is based in Daegu, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Daegu",
        "zipcode": null,
        "website": "http://www.daeho-al.com",
        "market_cap": "Large Cap"
    }
}