{
    "001460.KS": {
        "short_name": "BYC",
        "long_name": "BYC Co., Ltd.",
        "summary": "BYC Co., Ltd. produces and sells underwear in South Korea and internationally. It offers men's and women's underwear, pajamas, and innerwear for babies under the BYC, SCORPIO, BODY HEAT, BODY DRY, LESON, CELPINK, SC SPORTS, and RAMMI brand names. The company sells its products through online and stores. The company operates 1,700 franchises and 14 chain stores. BYC Co., Ltd. was founded in 1946 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "001465.KS": {
        "short_name": "BYC(1P)",
        "long_name": "BYC Co., Ltd.",
        "summary": "BYC Co., Ltd. produces and sells underwear in South Korea and internationally. It offers men's and women's underwear, pajamas, and innerwear for babies under the BYC, SCORPIO, BODY HEAT, BODY DRY, LESON, CELPINK, SC SPORTS, and RAMMI brand names. The company sells its products through online and stores. The company operates 1,700 franchises and 14 chain stores. BYC Co., Ltd. was founded in 1946 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "002070.KS": {
        "short_name": "VIVIEN",
        "long_name": "Vivien Corporation",
        "summary": "Vivien Corporation operates in the lingerie market in South Korea. It sells its products under the VIVIEN, BBM, Maternity, GENTOFF, SUVIVIEN, DELOR, Rosebud, and PANDORA brands through a network of department stores and Vivian stores. The company was formerly known as Namyeung Vivien Corporation and changed its name to Vivien Corporation in August 2020. The company is based in Seoul, South Korea. As of January 21, 2020, Vivien Corporation operates as a subsidiary of KANGLIM Co., Ltd.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "005320.KS": {
        "short_name": "Kukdong",
        "long_name": "Kukdong Corporation",
        "summary": "Kukdong Corporation manufactures and sells knit garments for men, women, and children in South Korea. It also offers workwear; activewear, such as training wear, golf wear, and fitness wear; lounge wear, including home wear, room wear, sleep wear, and night gown; and fashion wear. The company also exports its products in the United States, the European Union, and Chile. Kukdong Corporation was founded in 1967 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "005390.KS": {
        "short_name": "ShinsungTongsang",
        "long_name": "Shinsung Tongsang Co., Ltd.",
        "summary": "Shinsung Tongsang Co., Ltd. manufactures, distributes, and sells fashion products in Korea. The company also exports fibers and clothes of various brands, including UNIONBAY, OLZEN, ZIOZIA, TOPTEN10, AND Z, and Edition through its sales network, such as branch retail stores, department stores, and discount stores. In addition, it operates RICHMART, a local community-based discount store. The company was founded in 1968 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "005800.KS": {
        "short_name": "ShinyoungWacoal",
        "long_name": "Shinyoungwacoal,Inc.",
        "summary": "Shinyoungwacoal,Inc. produces and sells foundation products and lingerie for women in South Korea. It offers its products under the VENUS, VENUS MEN, PINK VENUS, ORLFA, SOLB, WACOAL, SALUTE, MC, RIECHE, MOTHERPIA, REMAMMA, ART-BEAU, VENUS CHOU, JASMIN, and ANETA brands. The company was founded in 1954 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "007980.KS": {
        "short_name": "PAN-PACIFIC",
        "long_name": "Pan-Pacific Co., Ltd.",
        "summary": "Pan-Pacific Co., Ltd. engages in the research and development, production, and sale of apparel and materials in South Korea, Indonesia, Vietnam, Myanmar, China, the United States, and internationally. It offers woven products, such as jackets, pants, sportswear, and outdoor clothing; light woven products, including women's top blouses and dresses; knit products comprising yoga and active wear products; and shirts. The company also provides warm and feather products under the Prauden brand; and polyester-based thermal insulation fiber filler under the Absolon and Syncloud brands. In addition, it offers bedding products under the Sofraum, Beontre, and Sheridan brand names; and food products, such as dry rice powder, puffed rice powder, and premix under the HAET BANG A brand, as well as acquires, operates, and manages real estate assets. Pan-Pacific Co., Ltd. was founded in 1972 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "008600.KS": {
        "short_name": "WillBes",
        "long_name": "The Willbes & CO., Ltd.",
        "summary": "The Willbes & Co., Ltd. manufactures and sells apparel in South Korea. It also provides postgraduate training for individuals looking for professional jobs, such as lawyer, diplomat, government official, appraiser, labor attorney, and others, as well as engages in the investment activities. The company was formerly known as Kunja Industries, Co., Ltd. and changed its name to The Willbes & Co., Ltd. in 1997. The Willbes & Co., Ltd. was founded in 1973 and is headquartered in Cheonan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Cheonan-si"
    },
    "009270.KS": {
        "short_name": "Shinwon",
        "long_name": "ShinWon Corporation",
        "summary": "ShinWon Corporation manufactures and sells men's wear, women's wear, casual, sports, and accessories in South Korea. Its owned women's wear brands include Besti Belli, SI, VIKI, and ISABEY; and men's wear brands comprise SIEG, SIEG Fahrenheit, Vanhart Di Albazar, and MARKM. The company also exports its products to the United States and Europe. It operates approximately 430 stores, as well as an online portal. ShinWon Corporation was founded in 1973 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "009275.KS": {
        "short_name": "Shinwon(1P)",
        "long_name": "ShinWon Corporation",
        "summary": "ShinWon Corporation manufactures and sells men's wear, women's wear, casual, sports, and accessories in South Korea. Its owned women's wear brands include Besti Belli, SI, VIKI, and ISABEY; and men's wear brands comprise SIEG, SIEG Fahrenheit, Vanhart Di Albazar, and MARKM. The company also exports its products to the United States and Europe. It operates approximately 430 stores, as well as an online portal. ShinWon Corporation was founded in 1973 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "016090.KS": {
        "short_name": "Daehyun",
        "long_name": "Daehyun Co.,Ltd.",
        "summary": "Daehyun Co., Ltd. manufactures and sells women's clothing in South Korea. The company markets its products under various brand names, including Blu Pepe, CC Collect, Zooc, Dewl, and Mojo S Phine. It also operates Envy department stores. The company was founded in 1982 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "020000.KS": {
        "short_name": "Handsome",
        "long_name": "HANDSOME Corp.",
        "summary": "HANDSOME Corp. operates as a fashion retail company in South Korea and internationally. The company offers T-shirts, blouses, shirts, knits, pants, skirts, and dresses for women; T-shirts, shirts, knits, pants, and suits for men; and top and bottom clothing products for kids. It also provides jackets, jumpers, trench coats, cardigans/vests, coats, and down jumpers; and bags, shoes, hats, jewelry, scarfs/mufflers, socks, ties, and others. In addition, the company offers lifestyle products, including fabrics, fragrances, and other accessories; skincare products and other accessories; dishes, boards/trays, cutleries, coffee/tea products, fabrics/napkins, and other accessories; stationary products, books, and other accessories; and fashion products and other accessories for pets. The company manufactures and retails fashion brands, such as TIME, MINE, SYSTEM, SJSJ, DECKE, the CASHMERE, LATT BY T, OBZEE, O'2nd, 2nd floor, SJYP, Rouge & Lounge, TIME homme, and SYSTEM homme; and distributes imported luxury fashion brands, including LANVIN, BALLY, CALVIN KLEIN, DKNY, CANALI, CLUB MONACO, TOMMY HILFIGER, TOMMY JEANS, AMERICAN EAGLE OUTFITTERS, etc. Further, it operates multi-brand concept stores under the MUE, TOM GREYHOUND, and FOURM names. The company was founded in 1987 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "084870.KS": {
        "short_name": "TBH GLOBAL",
        "long_name": "TBH Global Co., Ltd",
        "summary": "TBH Global Co., Ltd operates as a fashion company in China, Singapore, Malaysia, Armenia, Mongolia, and Saudi Arabia. The company offers its products under the Basic House, Mind Bridge, The Class, Jucy Judy, Marcbrick, and Spello brand names. It operates 1,800 stores. The company was formerly known as The Basic House Co., Ltd. and changed its name to TBH Global Co., Ltd in April 2016. TBH Global Co., Ltd was founded in 2001 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "088790.KS": {
        "short_name": "JINDO",
        "long_name": "Jindo.Co., Ltd.",
        "summary": "Jindo.Co., Ltd. manufactures, distributes, and sells fashion products in South Korea. It offers fur products under the Jindo Fur, Elfee, Uba, and Cleve brands. The company was formerly known as Jindo F & Co., Ltd. and changed its name to Jindo.Co., Ltd. in 2010. Jindo.Co., Ltd. was founded in 1973 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "093240.KS": {
        "short_name": "HYUNGJI ELITE",
        "long_name": "hyungji Elite Co., Ltd.",
        "summary": "hyungji Elite Co., Ltd. produces and sells school uniforms in Korea. It offers school uniforms under Elite brand name. The company also produces and supplies uniforms for the Samsung Group. In addition, it provides fashion products under the Young Age, Portfolio, Miss & Mister, and Sonobi brands; apparel for women under the RAGELLO brand; shoes under the Esquire brand; and jackets, trousers, jogging sets, and coats. The company was formerly known as Elite Basic Inc. and changed its name to hyungji Elite Co., Ltd. in October 2015. hyungji Elite Co., Ltd. was founded in 1969 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "102280.KS": {
        "short_name": "SBW",
        "long_name": "SBW, Inc.",
        "summary": "SBW, Inc. manufactures, distributes, and sells underwear in South Korea. The company offers innerwear under the TRY, CHAVILLE, HEAT UP, COOLUTION, S.MILE, CRIKET, JAMES CASTLER, M:MUR, UBER MAN, and CHIVANT brands. It also ofeers its products online. The company was formerly known as SSANGBANGWOOL&TRYGROUP.Inc and changed its name to SBW, Inc. in 2011. SBW, Inc. was founded in 1954 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "105630.KS": {
        "short_name": "Hansae",
        "long_name": "Hansae Co., Ltd.",
        "summary": "Hansae Co., Ltd. manufactures and sells finished clothing products in Vietnam, Indonesia, Nicaragua, Guatemala, Myanmar, and Haiti. It also exports its products to the United States and other countries. The company was founded in 1982 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    }
}