{
  "012630.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Asset Management",
    "long_name": "HDC HOLDINGS CO.,Ltd",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "HDC HOLDINGS",
    "state": null,
    "summary": "HDC HOLDINGS CO.,Ltd engages in real estate development and construction activities in South Korea. Its portfolio includes high-rise buildings, roads, bridges, highways, ports, plants, small and medium-sized houses, commercial districts and parking lot sites, hotels, resorts, and shopping malls, as well as operates a duty-free shop. The company also offers facility management services, such as building management, cleaning, parking/security, and general affairs/clerical support; real estate asset management service, including operation, leasing, building management, and management consulting services; real estate big data services; and interior, remodeling, and landscaping services, as well as operates special care facility for the elderly people. Further, it is involved in the petrochemical business; production of precast concrete; manufacture of pianos; and operation of the professional football club. HDC HOLDINGS CO.,Ltd was founded in 1976 and is headquartered in Seoul, South Korea.",
    "website": "http://www.hdc-holdings.com",
    "zipcode": "06170"
  },
  "030610.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Asset Management",
    "long_name": "Kyobo Securities Co.,Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "KYOBOSECURITIES",
    "state": null,
    "summary": "Kyobo Securities Co., Ltd., a securities company, provides various financial services in South Korea. It provides project-related financial services, such as project financing, structured finance, merger and acquisition, investment, and consultancy services; corporate financial services, including issuance of mezzanine bonds that comprise CB and RCPS, and acquisition of public and private placement corporate bonds, as well as the design and consultancy of project structures related to project financing; and initial public offering services. The company also offers financial solutions for funding of real estate development, local governments' development projects, SOC, green energy development, and other businesses; and online and offline brokerage services for futures products, including indices, currencies, energy, interest rates, metals, and agriculture and livestock products, as well as fixed income brokerage services for individuals, institutions, foundations, and corporates. In addition, it engages in issuing, brokering, and managing of derivatives linked bonds and securities, and structured securities; acts as an intermediary for various equity-linked products, such as stocks and derivatives, and futures and options; provides brokerage services to institutional and retail clients; and offers wealth, customer asset, and risk management services. The company was formerly known as Daehan Securities Co., Ltd. and changed its name to Kyobo Securities Co., Ltd. in April 1994. The company was founded in 1949 and is headquartered in Seoul, South Korea. Kyobo Securities Co., Ltd. is a subsidiary of Kyobo Life Insurance Co., Ltd.",
    "website": "http://www.iprovest.com",
    "zipcode": "150-737"
  },
  "138040.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Asset Management",
    "long_name": "Meritz Financial Group Inc.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "Meritz Financial",
    "state": null,
    "summary": "Meritz Financial Group Inc., through its subsidiaries, provides various financial services in South Korea. The company offers fire, marine, long-term, automobile, and general insurance products, as well as credit financing, asset management, etc.; and securities and OTC derivatives investment/brokerage and trading, trust, and investment consulting and discretion services. It is also involved in the provision of car financing, personal loan, and corporate financing services; real estate investment trusts management services; and commissioned management of investment trusts. The company was founded in 2007 and is based in Seoul, South Korea.",
    "website": "http://www.meritzgroup.com",
    "zipcode": null
  }
}
