{
    "001630.KS": {
        "short_name": "CHONGKUNDANG HOLDINGS",
        "long_name": "Chong Kun Dang Holdings Corp.",
        "summary": "Chong Kun Dang Holdings Corp. manufactures and distributes pharmaceutical products in South Korea and internationally. The company was founded in 1941 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "011000.KS": {
        "short_name": "GENEONE",
        "long_name": "GeneOne Life Science, Inc.",
        "summary": "GeneOne Life Science, Inc., a biopharmaceutical company, engages in the development and contract manufacturing of gene-based-biomedicines. Its products comprise GLS-1027, which is in Phase I clinical trial for treatment of nephropathy and inflammatory diseases; GLS-1200 that is in Phase II clinical trial to treat Rhinosinusitis; GLS-1027 and GLS-1200, which is Phase II clinical trial for treatment of COVID-19. The company also develops GLS-3000 and GLS-5310 for the treatment of SARS-CoV-2; GLS-5100 to treat VZV-Shingles; and GLS-5140 for the treatment of SFTS. In addition, it is developing GLS-5300, which is in Phase II clinical trial for MERS; GLS-5700 that is in Phase I clinical trial for Zika; and GLS-6150, which is in Phase I clinical trial for treatment of hepatitis C, as well as GLS-6100 that is in pre-clinical stage for hepatitis C. Further, the company, through its subsidiary, VGXI, Inc., engages in the cGMP production of nucleic acid-based products, including DNA plasmids and mRNA. The company was formerly known as VGX International Inc. and changed its name to GeneOne Life Science, Inc. in April 2014. GeneOne Life Science, Inc. was founded in 1976 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "068270.KS": {
        "short_name": "Celltrion",
        "long_name": "Celltrion, Inc.",
        "summary": "Celltrion, Inc. operates in the pharmaceutical industry in South Korea. It develops and provides biosimilars for auto-immune diseases and various cancers; generic pharmaceuticals; and covid-19 test kits. The company was founded in 2002 and is based in Incheon, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Incheon"
    },
    "207940.KS": {
        "short_name": "SAMSUNG BIOLOGICS",
        "long_name": "Samsung Biologics Co.,Ltd.",
        "summary": "Samsung Biologics Co., Ltd. engages in the contract manufacturing organization business for biopharmaceuticals products. The company is involved in the provision of contract development organization services, including cell line development, upstream and downstream processes, and analytical methods and formulations. It also offers aseptic filling, lyophilization, finishing, storage and shipping, and support services; and quality assurance and control, as well as biosafety and analytical testing services. In addition, the company engages in the development and commercialization of biosimilar drugs; and manufactures mammalian cell-based antibody drugs. It has a manufacturing agreement with Vir Biotechnology, Inc. for the manufacture of SARS-COV-2 antibodies for potential COVID-19 treatment. The company also has a partnership agreement with DiNonA Inc. to provide development services ranging from cell line development and process development to non-clinical and clinical material manufacturing. Samsung Biologics Co., Ltd. was founded in 2011 and is headquartered in Incheon, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Incheon"
    }
}