{
    "003090.KS": {
        "short_name": "Daewoong",
        "long_name": "Daewoong Co., Ltd.",
        "summary": "Daewoong Co., Ltd., together with its subsidiaries, manufactures and sells pharmaceuticals. It also engages in the leasing of real estates. The company was formerly known as Daewoong Pharmaceutical Co., Ltd. and changed its name to Daewoong Co., Ltd. in 2002. Daewoong Co., Ltd. was founded in 1961 and is headquartered in Seongnam-si, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Hwaseong-si",
        "zipcode": null,
        "website": "http://www.daewoongholdings.com",
        "full_time_employees": 277
    },
    "004720.KS": {
        "short_name": "PharmGen Science",
        "long_name": "PharmGen Science Inc.",
        "summary": "PharmGen Science, Inc. engages in the research and development, production, and sale of pharmaceutical products in South Korea. It offers prescription drugs, OTC drugs, health food, and cosmetics. It offers its products in the form of tablet, hard capsule, granule and ointment, syrups, and suspension forms. The company was formerly known as Wooridul Pharmaceutical Limited and changed its name to PharmGen Science, Inc. PharmGen Science, Inc. was founded in 1961 and is headquartered in Hwaseong, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Hwaseong-si",
        "zipcode": null,
        "website": "http://www.wooridulpharm.com",
        "full_time_employees": null
    },
    "008930.KS": {
        "short_name": "Hanmi Science",
        "long_name": "Hanmi Science Co., Ltd.",
        "summary": "Hanmi Science Co., Ltd., through its subsidiaries, manufactures and sells pharmaceutical products in Korea and internationally. It develops drugs in the areas of diabetes and anti-cancer. The company also offers drug substances, general medicines, health functional foods, and nutrition and health products and services. In addition, it operates an online pharmacy; and offers pharmaceutical management automation systems. The company was formerly known as Hanmi Holdings Co., Ltd. and changed its name to Hanmi Science Co., Ltd. in March 2012. Hanmi Science Co., Ltd. was founded in 1973 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.hanmiscience.co.kr",
        "full_time_employees": null
    },
    "118000.KS": {
        "short_name": "WOORIDUL HUEBRAIN",
        "long_name": "Wooridul Huebrain Limited",
        "summary": "Wooridul Huebrain Limited engages in the medical, life and health, pharmaceutical, and storage businesses. It sells medical equipment and appliances, health equipment, medicines, and computer servers. Wooridul Huebrain Limited was formerly known as Wooridul Life Sciences Limited and changed its name to Wooridul Huebrain Limited in April 2014. Wooridul Huebrain Limited was founded in 2009 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Hwaseong-si",
        "zipcode": null,
        "website": "http://www.wooridulls.co.kr",
        "full_time_employees": null
    }
}