{
    "001820.KS": {
        "short_name": "SamwhaCapacitor",
        "long_name": "SAMWHA CAPACITOR Co.,LTD",
        "summary": "SAMWHA CAPACITOR Co.,LTD manufactures and sells capacitors in South Korea. It offers multi-layer ceramic capacitors, disc ceramic capacitors, EMI filters, beads and inductors, disc varistors, shunt power capacitors, and energy storage capacitors. The company was founded in 1956 and is headquartered in Yongin, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Yongin-Si",
        "zipcode": null,
        "website": "http://www.samwha.com/capacitor",
        "market_cap": "Small Cap"
    },
    "002450.KS": {
        "short_name": "SamickMusInstr",
        "long_name": "SAMICK MUSICAL INSTRUMENT Co., Ltd",
        "summary": "SAMICK MUSICAL INSTRUMENT Co., Ltd, together with subsidiaries, manufactures, and sells musical instruments in South Korea. It offers pianos, digital pianos and audios, DJ, guitar and bass products, ukulele, orchestra, and other educational instruments. The company also sells its products online. The company was founded in 1958 and is headquartered in Eumseong-eup, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Eumseong-eup",
        "zipcode": null,
        "website": "http://www.samick.co.kr",
        "market_cap": "Micro Cap"
    },
    "004710.KS": {
        "short_name": "HansolTechnics",
        "long_name": "Hansol Technics Co., LTD.",
        "summary": "Hansol Technics Co., LTD. manufactures and sells electronic components and materials in South Korea and internationally. The company offers digital systems, such as televisions and DID/applied products; and power systems, such as inverters, converters, switch mode power supply products, automotive, solar inverters, and home appliances. It also provides light emitting diode (LED) sapphire materials, including ingot and wafer products; solar modules and silicon ingot/wafer technology products; and LED lighting products. The company was formerly known as Hansol LCD Inc. and changed its name to Hansol Technics Co., LTD. in December 2010. Hansol Technics Co., LTD. was founded in 1995 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.hansoltechnics.com",
        "market_cap": "Micro Cap"
    },
    "005680.KS": {
        "short_name": "SamyoungElec",
        "long_name": "Samyoung Electronics Co., Ltd",
        "summary": "Samyoung Electronics Co., Ltd. develops and sells electrolytic capacitors primarily in South Korea. The company offers surface mount, miniature aluminum, large sized aluminum, and aluminum solid electrolytic capacitors, as well as aluminum electrolytic capacitors. It also provides etched formed foils for low, intermediate, and high voltage use. The company was founded in 1968 and is based in Seongnam, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seongnam-si",
        "zipcode": "13209",
        "website": "http://www.samyoung.co.kr",
        "market_cap": "Micro Cap"
    },
    "006400.KS": {
        "short_name": "SAMSUNG SDI CO.,LTD.",
        "long_name": "Samsung SDI Co., Ltd.",
        "summary": "Samsung SDI Co., Ltd. manufactures and sells batteries worldwide. The company operates through three segments: Chemicals, Electronic Materials, and Energy and Other. It offers small-sized lithium ion batteries used in laptops, tablets, mobile phones, wearable devices, power banks, power tools, garden tools, vacuum cleaners, e-bikes, e-scooters, and ignition products; energy storage systems that are used in base transceiver stations, as well as in residential, utility, commercial, and UPS applications; and automotive batteries. The company also offers electronic materials, including semiconductor products, such as spin-on hardmasks, spin-on dielectrics, and epoxy molding compounds; LCD products, such as polarizing films and color photo resist products; OLED products comprising evaporation materials and thin film encapsulation products; and photovoltaic paste products. In addition, it is involved in the manufacture and sale of rechargeable battery raw materials; and invests in new technology venture business. The company was founded in 1970 and is headquartered in Yongin, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Yongin",
        "zipcode": null,
        "website": "http://www.samsungsdi.com",
        "market_cap": "Large Cap"
    },
    "007610.KS": {
        "short_name": "SeondoElec",
        "long_name": "Seondo Electric Co., Ltd.",
        "summary": "Seondo Electric Co., Ltd. manufactures and sells heavy electric equipment. Its products include gas insulated switchgears/vacuum circuit beakers/vacuum circuit systems, switchgears, motor control centers, and transmission line protection relay panels/pole mounted gas switches/gas load breaker switches; monitoring and control systems, including substation total automation systems, remote terminal units, distributed control systems, and supervisory control and data acquisition systems; and circuit breakers and contactors, such as earth leakage circuit breakers, magnetic contactors, home panel boards, reject filters, and ignition transformers. The company also offers environment products comprising diesel soot smoke reducers, electric dust collectors, high voltage units, ion generators, and plasma agricultural chemicals spray equipment. In addition, it provides metal-clad switchgears, instrumentation boards, bus and T/L protection panels, gas-insulated load make and break products, vacuum combination starters, air circuit breakers, solar heat hot water providers and heaters, molded case and earth leakage circuit breakers, magnetic switches, thermal overload relays, ass'y electric dust collectors, and negative ion generators, as well as undertakes electrical works. The company supplies its products for transmission and supply of electricity, atomic energy power plants, water and fire power plants, and various other plants. It serves customers in South Korea, the Middle East, the Americas, and Southeast Asia. The company was formerly known as Seondo Co., Ltd. and changed its name to Seondo Electric Co., Ltd. in May 1987. Seondo Electric Co., Ltd. was founded in 1972 and is headquartered in Ansan, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Ansan",
        "zipcode": null,
        "website": "http://www.seondo.co.kr",
        "market_cap": "Micro Cap"
    },
    "007660.KS": {
        "short_name": "ISUPETASYS",
        "long_name": "ISU Petasys Co., Ltd.",
        "summary": "ISU Petasys Co., Ltd. manufactures and sells printed circuit boards (PCBs) worldwide. The company offers ultra-multilayer PCBs for server/storage equipment and super computers, as well as network equipment, such as switches and routers. It also offers aerospace PCBs; IC tester PCBs, such as probe cards, load boards, and burn-in boards; advanced driver assistance system (ADAS) radio frequency (RF) PCBs; and RF PCBs. The company was formerly known as Petasys Co., Ltd. and changed its name to ISU Petasys Co., Ltd. in March 2002. ISU Petasys Co., Ltd. was founded in 1972 and is headquartered in Daegu, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Daegu",
        "zipcode": "42981",
        "website": "http://www.petasys.com",
        "market_cap": "Micro Cap"
    },
    "008060.KS": {
        "short_name": "DAEDUCK",
        "long_name": "Daeduck Co.,Ltd.",
        "summary": "Daeduck Co.,Ltd. provides various printed circuit boards (PCB) in South Korea and internationally. It offers thin PCBs for semiconductor packaging; and PCBs for smartphones, as well as solutions to support 5G communication and autonomous vehicles market segments. The company was founded in 1972 and is based in Ansan-si, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Ansan-Si",
        "zipcode": null,
        "website": "http://www.daeduck.com",
        "market_cap": "Micro Cap"
    },
    "00806K.KS": {
        "short_name": "DAEDUCK(1P)",
        "long_name": "Daeduck Co.,Ltd.",
        "summary": "Daeduck Co.,Ltd. provides various printed circuit boards (PCB) in South Korea and internationally. It offers thin PCBs for semiconductor packaging; and PCBs for smartphones, as well as solutions to support 5G communication and autonomous vehicles market segments. The company was founded in 1972 and is based in Ansan-si, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Ansan-Si",
        "zipcode": null,
        "website": "http://www.daeduck.com",
        "market_cap": "Small Cap"
    },
    "009140.KS": {
        "short_name": "KyunginElec",
        "long_name": "Kyungin Electronics Co., Ltd",
        "summary": "Kyungin Electronics Co., Ltd manufactures and sells electronic components in South Korea. It offers micro, tact, radial tapping, and SMD switches, as well as remote controllers, thermostats, potentiometers, and other products. The company also exports its products. Kyungin Electronics Co., Ltd was founded in 1973 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "08 501",
        "website": "http://www.kie.co.kr",
        "market_cap": "Nano Cap"
    },
    "009470.KS": {
        "short_name": "SamwhaElec",
        "long_name": "Samwha Electric Co.,Ltd.",
        "summary": "Samwha Electric Co.,Ltd. operates in the electrolytic capacitor industry in South Korea and internationally. It offers single cell and module green-cap electric double layer capacitors. The company also provides hybrid, miniature, large, surface mount, conducting polymer, radial lead type, and screw type aluminum electrolytic capacitors. Its products are used in communication equipment, household appliances, medical devices, and military and aerospace devices, as well as automotive, transportation, LED, smartphone and camera, desktop and notebook, industrial inverter, uninterruptible power supply, and new and renewable energy applications. The company was formerly known as Samwha Nichicon and changed its name to Samwha Electric Co.,Ltd. in November 1974. Samwha Electric Co.,Ltd. was founded in 1973 and is headquartered in Cheongju, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Cheongju",
        "zipcode": "28589",
        "website": "http://www.samwha.com/electric",
        "market_cap": "Micro Cap"
    },
    "011070.KS": {
        "short_name": "LG Innotek",
        "long_name": "LG Innotek Co., Ltd.",
        "summary": "LG Innotek Co., Ltd. manufactures and sells electronic materials and components for mobile, automotive, display, semiconductor, LED, and Internet of Things (IoT) businesses in South Korea and internationally. The company offers 2 metal COF; automotive radars; BLE system in package (SiP); COB; COF; CSP; electric oil pumps; electric vehicle communication controllers; flip chip CSP; motor for braking; motor for dual clutch transmission; motor for eletro hydraulic brakes and electric power steering; photo masks; SiP; and smart cameras for IoT. It also provides 3D sensing modules; battery management systems; Bluetooth/Bluetooth + Wi-Fi combo modules; camera modules for automotive and mobile; cellular modules; DC-DC converters for automotive; digital key modules; digital tuners; door and glass break sensors; LED driver modules for automotive; LED modules for automotive; motion sensors; PoE to WiFi bridge; switch mode power supply; steering sensor; v2x communication module; water leakage sensor; and Wi-Fi modules. The company was formerly known as LG Electro-Components Co., Ltd. and changed its name to LG Innotek Co., Ltd. in May 2000. LG Innotek Co., Ltd. was founded in 1970 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "07796",
        "website": "http://www.lginnotek.com",
        "market_cap": "Mid Cap"
    },
    "011230.KS": {
        "short_name": "SamwhaElec",
        "long_name": "Samwha Electronics Co.,Ltd.",
        "summary": "Samwha Electronics Co.,Ltd. manufactures and sells soft ferrite core products worldwide. It offers E cores; PQ/RM cores; POT cores; low profile cores; EP cores; planer cores; SQ, SQE, and UU cores; toroid cores; rod, bar, and screw cores; drum/SMD cores; LF antenna cores; ferrite sheets for wireless charging; ferrite absorbers; and EMC cores. The company also provides magnetic powder cores, chip components, and ferrite plate products. In addition, it offers chip ferrite beads and arrays; chip ferrite and chip power inductors; and chip LC/chip common mode filters. The company was founded in 1976 and is headquartered in Yongin, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Yongin",
        "zipcode": "17118",
        "website": "http://www.samwha.com/electronics",
        "market_cap": "Nano Cap"
    },
    "014910.KS": {
        "short_name": "SungmoonElec",
        "long_name": "Sungmoon Electronics Co., Ltd.",
        "summary": "Sungmoon Electronics Co., Ltd. provides metallized film for film capacitors worldwide. It offers aluminum and zinc metallized polyester and polypropylene films. The company also manufactures and sells electric components. Sungmoon Electronics Co., Ltd. was founded in 1980 and is headquartered in Pyeongtaek, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Pyeongtaek",
        "zipcode": "450-818",
        "website": "http://www.smec-korea.co.kr",
        "market_cap": "Nano Cap"
    },
    "014915.KS": {
        "short_name": "SungmoonElec(1P)",
        "long_name": "Sungmoon Electronics Co., Ltd.",
        "summary": "Sungmoon Electronics Co., Ltd. provides metallized film for film capacitors worldwide. It offers aluminum and zinc metallized polyester and polypropylene films. The company also manufactures and sells electric components. Sungmoon Electronics Co., Ltd. was founded in 1980 and is headquartered in Pyeongtaek, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Pyeongtaek",
        "zipcode": "450-818",
        "website": "http://www.smec-korea.co.kr",
        "market_cap": "Nano Cap"
    },
    "020760.KS": {
        "short_name": "ILJINDISPLAY",
        "long_name": "Iljin Display Co., Ltd.",
        "summary": "Iljin Display Co., Ltd. manufactures and sells IT components and materials in South Korea and internationally. The company offers touch screen, force touch, bio-metrics, and flexible touch panels, as well as sapphire wafers. Its touch screen panels are used in mobiles, tablet PCs, automotive electronics, home appliances, laptop PCs, and industrial applications; and sapphire wafers are used in mobile devices, LED TVs, and lighting devices, as well as in cover glasses, wearable glasses, and micro LEDs in mobile products. The company was founded in 1994 and is based in Pyeongtaek, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Pyeongtaek",
        "zipcode": "17792",
        "website": "http://www.iljindisplay.com",
        "market_cap": "Micro Cap"
    },
    "033240.KS": {
        "short_name": "JahwaElec",
        "long_name": "Jahwa Electronics. Co., Ltd",
        "summary": "Jahwa Electronics. Co., Ltd manufactures and sells precision electronic components in South Korea and internationally. The company offers BLDC and geared motors, PTC heaters, and rare earth motors for automobiles; and camera modules, integrated OIS and shutter actuators, auto focus actuators, and vibration motors for mobiles. It also provides charge and supply rollers, magroller assemblies, and developer rollers for laser printers and copiers; PTC thermistors and plastic magnets for home appliances; and thermal spread sheets for displays, as well as Nd-Fe-B magnet. The company was founded in 1981 and is headquartered in Cheongju, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Cheongju",
        "zipcode": "363-922",
        "website": "http://www.jahwa.co.kr",
        "market_cap": "Micro Cap"
    },
    "039570.KS": {
        "short_name": "HDC I-CONTROLS",
        "long_name": "HDC I-Controls Co., Ltd.",
        "summary": "HDC I-Controls Co., Ltd. provides construction IT solutions in South Korea, Southeast Asia, and the Middle East. The company provides green IoT solutions, such as connected lighting and integrated management center solutions, as well as iBEMS, a building energy management solution; and smart home solutions, including home control, smart LED lighting, smart DC power distribution, smart parking, and unit ventilation systems. It also offers smart building solutions comprising FRONNIX and Smartstruxure building management systems; security and room management systems; and iCos, a central monitoring device for air conditioning systems, power, lighting, access control, IS, and CCTV integration. In addition, the company offers firefighting electrical solutions, including BESTIN Fire Guard, an intelligent firefighting system; R-type system comprising receivers, repeaters, and power supply devices; photoelectric, fixed temperature, and rate of rise detectors; and guide lights. Further, it offers smart infrastructure solutions that include Smart Road for vehicle to vehicle and vehicle to road communication; signal, communications, and electrical and mechanical systems for railway operations; and Smart Port, a solution for automated port operations. The company was formerly known as I Controls Inc. and changed its name to HDC I-Controls Co., Ltd. in April 2018. HDC I-Controls Co., Ltd. was founded in 1999 and is based in Seongnam, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seongnam-si",
        "zipcode": "13556",
        "website": "http://www.icontrols.co.kr",
        "market_cap": "Micro Cap"
    },
    "192650.KS": {
        "short_name": "DREAMTECH",
        "long_name": "DREAMTECH Co., Ltd.",
        "summary": "DREAMTECH Co., Ltd. designs, develops, produces, and sells modules for smartphone, automotive LED, home appliance, fingerprint, sensor, IT convergence, and medical/ healthcare applications in South Korea and internationally. The company was founded in 1998 and is based in Seongnam, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seongnam",
        "zipcode": null,
        "website": "http://www.idreamtech.co.kr",
        "market_cap": "Small Cap"
    },
    "248070.KS": {
        "short_name": "SOLUM",
        "long_name": "Solum Co., Ltd.",
        "summary": "Solum Co., Ltd. manufactures and markets power modules, digital tuners, and electronic shelf labels to customers in South Korea and internationally. It also offers TV and monitor displays, adapters, servers, LED power modules, travel chargers for mobile devices, and data system and LED power supply units. The company was founded in 2015 and is based in Yongin-si, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Yongin-si",
        "zipcode": null,
        "website": "http://www.solu-m.com",
        "market_cap": "Small Cap"
    },
    "336370.KS": {
        "short_name": "Solus Advanced Materials",
        "long_name": "Solus Advanced Materials Co. Ltd.",
        "summary": "Solus Advanced Materials Co. Ltd. provides materials and solutions in South Korea and Europe. It offers battery copper foil for use in electric car battery; copper foil for use in various electronic equipment; electro materials for use in organic light emitting diode display devices, such as mobile, TV, and vehicle/tablet/PCs; and natural bio materials for use in pharmaceutical, cosmeceutical, and nutraceutical ingredients, as well as provides customized development manufacturing services. The company was formerly known as Doosan Solus Co., Ltd. The company was founded in 2019 and is based in Seoul, South Korea. Solus Advanced Materials Co. Ltd. is a subsidiary of Skylake Equity Partners Limited.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "03129",
        "website": "http://www.solusadvancedmaterials.com",
        "market_cap": "Small Cap"
    },
    "353200.KS": {
        "short_name": "DaeduckElectronics",
        "long_name": "DAEDUCK ELECTRONICS Co.,Ltd.",
        "summary": "Daeduck Electronics Co., Ltd. provides various printed circuit boards (PCB) in South Korea and internationally. It offers thin PCBs for semiconductor packaging; and PCBs for smartphones market, as well as solutions to support 5G communication and autonomous vehicles market segments. The company is headquartered in Ansan-si, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Ansan-Si",
        "zipcode": null,
        "website": "http://www.daeduck.com",
        "market_cap": "Small Cap"
    },
    "35320K.KS": {
        "short_name": "DaeduckElectro(1P)",
        "long_name": "DAEDUCK ELECTRONICS Co.,Ltd.",
        "summary": "Daeduck Electronics Co., Ltd. provides various printed circuit boards (PCB) in South Korea and internationally. It offers thin PCBs for semiconductor packaging; and PCBs for smartphones market, as well as solutions to support 5G communication and autonomous vehicles market segments. The company is headquartered in Ansan-si, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Ansan-Si",
        "zipcode": null,
        "website": "http://www.daeduck.com",
        "market_cap": "Small Cap"
    },
    "XSDG.F": {
        "short_name": "SAMSUNG SDI GDR(144A)/4",
        "long_name": "Samsung SDI Co., Ltd.",
        "summary": "Samsung SDI Co., Ltd. manufactures and sells batteries worldwide. The company operates through three segments: Chemicals, Electronic Materials, and Energy and Other. It offers small-sized lithium ion batteries used in laptops, tablets, mobile phones, wearable devices, power banks, power tools, garden tools, vacuum cleaners, e-bikes, e-scooters, and ignition products; energy storage systems that are used in base transceiver stations, as well as in residential, utility, commercial, and UPS applications; and automotive batteries. The company also offers electronic materials, including semiconductor products, such as spin-on hardmasks, spin-on dielectrics, and epoxy molding compounds; LCD products, such as polarizing films and color photo resist products; OLED products comprising evaporation materials and thin film encapsulation products; and photovoltaic paste products. In addition, it is involved in the manufacture and sale of rechargeable battery raw materials; and invests in new technology venture business. The company was founded in 1970 and is headquartered in Yongin, South Korea.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Korea",
        "state": null,
        "city": "Yongin",
        "zipcode": null,
        "website": "http://www.samsungsdi.com",
        "market_cap": "Large Cap"
    }
}