{
    "000490.KS": {
        "short_name": "DAEDONG CORP.",
        "long_name": "Daedong Corporation",
        "summary": "Daedong Corporation manufactures and sells agricultural machinery in South Korea and internationally. The company's products include tractors, combine-harvesters, rice transplanters, power tillers, engines, and UTV vehicles. It also exports its products. The company was formerly known as Daedong Industrial Co., Ltd. and changed its name to Daedong Corporation in March 2021. Daedong Corporation was founded in 1947 and is based in Daegu, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Daegu",
        "zipcode": "42984",
        "website": "http://ko.daedong.co.kr",
        "market_cap": "Micro Cap"
    },
    "017550.KS": {
        "short_name": "SoosanHvyInd",
        "long_name": "Soosan Heavy Industries Co., Ltd.",
        "summary": "Soosan Heavy Industries Co., Ltd. manufactures and sells hydraulic breakers in South Korea. It also provides truck-mounted, truck, and stationary cranes; drill rigs; special purpose machinery, such as pedestal boom systems and ANFO charger trucks; and rods. Soosan Heavy Industries Co., Ltd. was founded in 1984 and is headquartered in Hwaseong, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Hwaseong-si",
        "zipcode": null,
        "website": "http://www.soosanheavy.com",
        "market_cap": "Micro Cap"
    },
    "042670.KS": {
        "short_name": "DSINFRA",
        "long_name": "Doosan Infracore Co., Ltd.",
        "summary": "Doosan Infracore Co., Ltd. engages in the infrastructure support business in South Korea and internationally. It manufactures and sells construction equipment, engines, attachments, and utility equipment. The company offers excavators, wheel loaders, portable air compressors, articulated dump trucks, lighting systems, and portable power equipment. It also provides cabin raisers, module units, tilting and elevating cabins, buckets, grapples, crushers, demolition equipment, and material handling equipment. In addition, the company offers off-highway and on-highway, and marine diesel engines, and gas engines for buses and trucks, power generators, and ships; and parts and services. It sells its products under the Doosan, Bobcat, and Geith brands. Doosan Infracore Co., Ltd. was founded in 1937 and is headquartered in Incheon, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Incheon",
        "zipcode": null,
        "website": "http://www.doosaninfracore.com",
        "market_cap": "Mid Cap"
    },
    "074610.KS": {
        "short_name": "ENPLUS",
        "long_name": "Enplus Co., Ltd.",
        "summary": "Â\u0095 Enplus Co., Ltd manufactures and sells fire trucks in South Korea. It offers firefighting chemical vehicles and pump cars; fire water tank cars, fireman ladder cars, and structural work vehicles; ambulances; and environmental and special vehicles, such as compressed cars, amrol trucks, road cleaning vehicles, sewer dredging cars, autoclaves, and rolling dumps. The company also provides smart air purification vehicles, smart air cleaner bus shelters, graphene powder, graphene solutions, and secondary battery and ESS for electric vehicles. The company was formerly known as NANOMEDICS Co., Ltd. and changed its name to Enplus Co., Ltd in April 2020. Enplus Co., Ltd was founded in 1966 and is headquartered in Hwaseong, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Hwaseong-si",
        "zipcode": "18284",
        "website": "http://www.en3.co.kr",
        "market_cap": "Micro Cap"
    },
    "241560.KS": {
        "short_name": "Doosan Bobcat",
        "long_name": "Doosan Bobcat Inc.",
        "summary": "Doosan Bobcat Inc. designs, manufactures, markets, and distributes construction and portable power equipment in South Korea and internationally. It offers compact loaders and excavators, utility products, telehandlers, and attachments for construction, rental, landscaping, agriculture, grounds maintenance, government, utility, industry, and mining industries. The company also provides air compressors, drill modules, generators, light towers, and light compaction products; and buckets, quick couplers, angle tilt buckets, rippers, crushers, grapples, pallet forks, and hydraulic thumbs. It sells its products under the Bobcat, Doosan, and Geith brand names. The company was formerly known as Doosan Infracore Bobcat Holdings Co., Ltd. and changed its name to Doosan Bobcat Inc. in January 2015. Doosan Bobcat Inc. was founded in 1958 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.doosanbobcat.com/en",
        "market_cap": "Mid Cap"
    }
}