{
    "017810.KS": {
        "short_name": "PMO",
        "long_name": "Pulmuone Co., Ltd.",
        "summary": "Pulmuone Co., Ltd. produces, sells, and distributes fresh foods and beverages in South Korea and internationally. The company provides tofu, Asian food products, meat alternative, sprouts, frozen rice, bean products, eggs, air fried and chilled noodles, rice cake, kimchi, dough, juice/desert, sauce/spread/dips, pasta, etc., as well as ready to serve meals and water under the Pulmuone, Foodmerce, Asahico, and Danone brands; and baby meals and fermented milk products. It also offers LOHAS dietary life care products, home appliances, health supplements, skincare, personal care, home care under the Pulmuone Duskin brand, and foods for companion animals; and franchises LOHAS fresh markets. The company provides LOHAS foods to catering, concessions, rest-stop stores, and restaurants; and distributes food materials in school meals, restaurants, and material markets. Pulmuone Co., Ltd. was founded in 1981 and is headquartered in Eumseong-eup, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Eumseong"
    },
    "136490.KS": {
        "short_name": "SUNJIN",
        "long_name": "Sunjin Co.,Ltd.",
        "summary": "Sunjin Co.,Ltd. engages in pig farming, feed, and meat processing and distribution businesses in South Korea. The company offers feed for pig and dairy farming, and fattening purposes; and steak/patty, cutlet, balls/mini meat patty, fried food, ham, sausage, bacon/smoked, topping, ready-to-cook food, and other products. It also manufactures and services automation machinery and ICT equipment that is used in the livestock environment; and provides services for farm management, as well as operates pig and chicken farms in South-Asian countries. The company also exports its pork meat and feed to Japan and internationally. Sunjin Co.,Ltd. was founded in 1979 and is based in Seoul, South Korea. Sunjin Co.,Ltd. operates as a subsidiary of Harim Holdings Co., Ltd.",
        "currency": "KRW",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    }
}