{
    "002790.KS": {
        "short_name": "AmoreG",
        "long_name": "AMOREPACIFIC Group",
        "summary": "AMOREPACIFIC Group, through its subsidiaries, researches, develops, manufactures, markets, and sells beauty and health products in Korea, Asia, North America, and internationally. The company offers cosmetics, personal care, and healthcare products under the Sulwhasoo, LANEIGE, Mamonde, innisfree, and ETUDE House brands, as well as other local brands. It is also involved in marketing of haircare products; manufacturing and marketing of medicines, glass, green tea, detergents, and organic compounds; manufacturing, printing, and marketing of paper containers; and packaging of products. The company was formerly known as PACIFIC Corporation and changed its name to AMOREPACIFIC Group in March 2011. AMOREPACIFIC Group was founded in 1945 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "002795.KS": {
        "short_name": "AmoreG(1P)",
        "long_name": "AMOREPACIFIC Group",
        "summary": "AMOREPACIFIC Group, through its subsidiaries, researches, develops, manufactures, markets, and sells beauty and health products in Korea, Asia, North America, and internationally. The company offers cosmetics, personal care, and healthcare products under the Sulwhasoo, LANEIGE, Mamonde, innisfree, and ETUDE House brands, as well as other local brands. It is also involved in marketing of haircare products; manufacturing and marketing of medicines, glass, green tea, detergents, and organic compounds; manufacturing, printing, and marketing of paper containers; and packaging of products. The company was formerly known as PACIFIC Corporation and changed its name to AMOREPACIFIC Group in March 2011. AMOREPACIFIC Group was founded in 1945 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "003350.KS": {
        "short_name": "HKCManufacture",
        "long_name": "Hankook Cosmetics Manufacturing Co., Ltd",
        "summary": "Hankook Cosmetics Manufacturing Co., Ltd manufactures and markets cosmetics worldwide. It offers skin and body care products, such as cosmetic water, creams, packs, cleansing powders, cleansing formula and masks, cleansers, oils, lotions, and powders; color and functional cosmetics, including blushers, facial powders, foundations, makeup base and fixatives, lipsticks, lip gloss, and anti-wrinkle, whitening, and UV protection products. The company also provides cosmetics for men, such as aftershave lotions, free shave lotions, shaving creams, beard conditioners, and other shaving products; baby care products comprising shampoo, body cleansers, lotions, creams, and sun cream oils; perfumes, powdered perfumes, fragrance bags, and cologne; and hair products, including shampoos, rinses, conditioners, tonics, grooming aids, essence, cream oils, pomades, gels, glazes, waxes, sprays, mousses, and straighteners, as well as hair treatment products. Further, the company offers consulting services. Hankook Cosmetics Manufacturing Co., Ltd was founded in 1962 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "006570.KS": {
        "short_name": "DaelimTrdg",
        "long_name": "Daelim Trading Co., Ltd.",
        "summary": "Daelim Trading Co., Ltd. manufactures and supplies flatware products in South Korea and internationally. It offers washbasin, tub, sink, and general faucets; urine/feces flush valves; products for handicapped; parts; and other products, such as footbath towels, diaper changings, towel dryers, pedal valves/drains dehydrators, and water purifier faucets. The company also provides accessories, such as towel bars, toilet paper holders, soap holders, tumbler holders, clothes hangers, towel rings, utility shelves, toilet brushes, shaving mirrors, and magazine holders, as well as bidets, shower booths, bath tubs, unicles, and flatware products. Daelim Trading Co., Ltd. was founded in 1970 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "012690.KS": {
        "short_name": "Monalisa",
        "long_name": "Monalisa Co., Ltd",
        "summary": "Monalisa Co., Ltd produces and sells sanitary tissue products in South Korea. The company offers bathroom tissue, facial tissue, and kitchen towel products, as well as wet wipes, adult diapers, baby diapers, masks, table napkins, jumbo rolls, and paper towels under the Bellagio, The Rich House, and Nox Premium brand names. Monalisa Co., Ltd was founded in 1977 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "018250.KS": {
        "short_name": "AEKYUNG INDUSTRIAL",
        "long_name": "Aekyung Industrial Co., Ltd.",
        "summary": "Aekyung Industrial Co., Ltd. engages in the research, development, manufacture, and sale of household and beauty products in South Korea. It provides beauty care products, including hair and body care products, and cosmetics; health care products, such as dental care and health products; and home care products comprising laundry detergents, dishwashing detergents, and others. The company was founded in 1985 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "024720.KS": {
        "short_name": "KOLMAR KOREA HOLDINGS",
        "long_name": "Kolmar Korea Holdings Co., Ltd.",
        "summary": "Kolmar Korea Holdings Co., Ltd. manufactures and sells cosmetics, pharmaceuticals, and health functional foods in South Korea and internationally. It offers skin care, makeup, hair care, body care, and baby products, as well as functional cosmetics and perfumes. The company also provides quasi-drugs and health supplements. Kolmar Korea Holdings Co., Ltd. was founded in 1990 and is headquartered in Sejong City, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Sejong City"
    },
    "044820.KS": {
        "short_name": "COSMAX bti",
        "long_name": "Cosmax BTI, Inc.",
        "summary": "Cosmax BTI, Inc. engages in the development, production, and supply of beauty products, health functional foods, pharmaceuticals, and special containers and equipment for customers in South Korea. The company offers sun and foundation creams; makeup creams and bases; hair and cleansing products; mascara and nail products; various color formulations and skin tones; lip sticks and shadows; lip essence and liquid products; body and mask sheets; powder pact products and makeup pencils; and fragrance products. It exports its products to approximately 30 countries. The company was founded in 1992 and is headquartered in Seongnam, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seongnam-si"
    },
    "090430.KS": {
        "short_name": "AMOREPACIFIC",
        "long_name": "Amorepacific Corporation",
        "summary": "Amorepacific Corporation manufactures and sells beauty, household, and healthcare products worldwide. The company offers skincare products, cleansers, toners and fluids, moisturizers, eye care products, serums, masks, and special care and travel products. It provides anti-ageing, dryness, tone and texture, sun protection, and makeup products. The company was founded in 1945 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "090435.KS": {
        "short_name": "AMOREPACIFIC(1P)",
        "long_name": "Amorepacific Corporation",
        "summary": "Amorepacific Corporation manufactures and sells beauty, household, and healthcare products worldwide. The company offers skincare products, cleansers, toners and fluids, moisturizers, eye care products, serums, masks, and special care and travel products. It provides anti-ageing, dryness, tone and texture, sun protection, and makeup products. The company was founded in 1945 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "123690.KS": {
        "short_name": "HANKOOKCOSMETICS",
        "long_name": "Hankook Cosmetics Co., Ltd.",
        "summary": "Hankook Cosmetics Co., Ltd. produces and sells cosmetics in South Korea and internationally. It offers its products under the Sansim, Hyoum, Ossion, Jutanhak, Secret Nature, Calli, GENERTE, A3F[on], Temptation, CONTINUE, Chess The Classic, CLASSYGIRL, Beautri, BEAUTENIQUE, Dr Medix, and Parapam brands. The company was founded in 1961 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "161890.KS": {
        "short_name": "KOLMAR KOREA",
        "long_name": "Kolmar Korea Co., Ltd.",
        "summary": "Kolmar Korea Co., Ltd. researches, develops, produces, and sells beauty and health products in South Korea and internationally. It offers various cosmetic products, including skin care, makeup, baby, hair care, and body care products, as well as perfume, functional cosmetics, and qusi drugs. The company also provides prescription, over-the-counter, and bioequivalent drugs; drugs for dermatology and circulatory system; ointment and external, and oral solutions; and oral solids. In addition, it offers health functional food comprising health supplements; ingredients; special purpose food; and individually recognized health supplements. The company was founded in 2012 and is headquartered in Sejong, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Sejong City"
    },
    "192820.KS": {
        "short_name": "COSMAX",
        "long_name": "Cosmax, Inc.",
        "summary": "Cosmax, Inc. researches, develops, produces, and sells cosmetic, health function food, and pharmaceutical products in Korea and internationally. The company offers skincare, color cosmetics, and hair care products, as well as mask sheets and eye patches. It also develops and manufactures medical supplies and devices; raw materials for cosmetic products; and functional containers and filling packaging products for cosmetics. The company was formerly known as Miroto Korea and changed its name to Cosmax, Inc. in 1994. Cosmax, Inc. was founded in 1992 and is headquartered in Hwaseong, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seongnam-si"
    },
    "214420.KS": {
        "short_name": "TONYMOLY",
        "long_name": "Tonymoly Co., Ltd",
        "summary": "Tonymoly Co., Ltd provides beauty care products under the TONYMOLY brand in South Korea and internationally. It offers skin care, cleansing, and care products; make up for face, lip, child, and nail; body, perfume, and hair products; and skincare, as well as beauty accessories. Tonymoly Co., Ltd sells its products through its stores and online. Tonymoly Co., Ltd was founded in 2006 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "226320.KS": {
        "short_name": "ITSHANBUL",
        "long_name": "It'S Hanbul Co., Ltd.",
        "summary": "It'S Hanbul Co., Ltd. develops, manufactures, and sells cosmetics in South Korea and internationally. It offers skin care products, including toners, lotions, serums, gels/creams, emulsions, and effectors, as well as eye care, sun care, cleansings care, packs/masks, etc.; base makeups, such as BB/CC creams, concealers, high lighters, foundations, and powders; point makeups comprising eye care, lip care, eye shadow/brow, nail care, cheek/blushers, and high lighters; and body care products, which includes wash/scrubs, lotions/creams, perfumes, and mists/oils. The company also provides hair care and styling products; men and baby care products; hand/foot products; and brushes, puffs, and other beauty accessories products. The company was formerly known as It'S SKIN Co., Ltd. and changed its name to It'S Hanbul Co., Ltd. in 2017. It'S Hanbul Co., Ltd. was founded in 1989 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    }
}