{
  "001140.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Integrated Freight & Logistics",
    "long_name": "KUKBO Logistics Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "KUKBO",
    "state": null,
    "summary": "KUKBO Logistics Co., Ltd. provides transportation services in South Korea. It offers international logistics, warehouse and storage, terminal and unloading, third party logistics, container cargo transportation, and mobility services. The company was formerly known as Kuk Bo Transportation Co., Ltd. and changed its name to KUKBO Logistics Co., Ltd. in October 1978. KUKBO Logistics Co., Ltd. was founded in 1953 and is headquartered in Seoul, South Korea.",
    "website": "http://www.kukbo.com",
    "zipcode": null
  },
  "002320.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Integrated Freight & Logistics",
    "long_name": "Hanjin Transportation Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "HanjinTrnspt",
    "state": null,
    "summary": "Hanjin Transportation Co., Ltd. provides transportation and logistics services in South Korea and internationally. The company provides inland transportation services; and stevedoring services for cargoes, including containers, steel products, grains, and automobiles. It is also involved in the shipping of heavy cargoes, such as containers, steel products, coal, etc.; provision of warehousing, freight forwarding, express courier, and small package delivery services; and commercial vehicle, rail carriage, and industrial heavy equipment maintenance services. In addition, the company offers packaging and moving services, such as industrial packing, and office and factory relocation; transportation for sports events, exhibitions and performances/packing, customs clearance, and air/ocean transport/delivery; and migration of emigrants and residents, and trunk room. The company was founded in 1945 and is headquartered in Seoul, South Korea.",
    "website": "http://www.hanjin.co.kr",
    "zipcode": null
  },
  "004360.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Integrated Freight & Logistics",
    "long_name": "Sebang Co., Ltd",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "SEBANG",
    "state": null,
    "summary": "Sebang Co., Ltd provides integrated logistics services in Korea. It offers container land transport services through a fleet of 213x tractors and 1,068x trailers; and cargo transport services through a fleet of 16 container yards and 5 railroad container depots. The company also offers heavy cargo loading, installation, and marine transport services; and third-party logistics services. In addition, it operates London metal exchange warehouses. Sebang Co., Ltd was founded in 1965 and is headquartered in Seoul, South Korea.",
    "website": "http://www.sebang.com",
    "zipcode": "06212"
  },
  "004365.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Integrated Freight & Logistics",
    "long_name": "Sebang Co., Ltd",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "SEBANG(1P)",
    "state": null,
    "summary": "Sebang Co., Ltd provides integrated logistics services in Korea. It offers container land transport services through a fleet of 213x tractors and 1,068x trailers; and cargo transport services through a fleet of 16 container yards and 5 railroad container depots. The company also offers heavy cargo loading, installation, and marine transport services; and third-party logistics services. In addition, it operates London metal exchange warehouses. Sebang Co., Ltd was founded in 1965 and is headquartered in Seoul, South Korea.",
    "website": "http://www.sebang.com",
    "zipcode": "06212"
  },
  "009070.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Integrated Freight & Logistics",
    "long_name": "KCTC Co. Ltd",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "KCTC",
    "state": null,
    "summary": "KCTC Co. Ltd operates as an integrated logistics company in South Korea and internationally. It offers container transportation, including overland road and railroad transportation services; roll on and roll off loading and unloading services; and CY/CFS services, as well as logistics services for bulk cargoes and oversized heavy cargoes. The company also provides logistics consulting services; logistics services for imports and exports; nationwide b2b transport and delivery services; specialized service for alcoholic beverages and dangerous goods; distribution center operation management services; international express services; and bulk stevedoring and bulk cargo transportation services. In addition, it offers freight information and location monitoring service. The company was formerly known as Korea Container Terminal Co. Ltd. and changed its name to KCTC Co. Ltd in March 2002. KCTC Co. Ltd was founded in 1973 and is headquartered in Seoul, South Korea.",
    "website": "http://www.kctc.co.kr",
    "zipcode": null
  },
  "009180.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Integrated Freight & Logistics",
    "long_name": "Hansol Logistics Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "Hansol Logistics",
    "state": null,
    "summary": "Hansol Logistics Co., Ltd. provides logistics services in South Korea and internationally. The company offers third party logistics, e-logistics, and logistics consulting services. The company was formerly known as Hansol CSN Co., Ltd. and changed its name to Hansol Logistics Co., Ltd. in May 2014. Hansol Logistics Co., Ltd. was founded in 1994 and is headquartered in Seoul, South Korea.",
    "website": "http://www.hansollogistics.com",
    "zipcode": "100-192"
  },
  "014130.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Integrated Freight & Logistics",
    "long_name": "Hanexpress.Co., Ltd",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "HanExpress",
    "state": null,
    "summary": "Hanexpress.Co., Ltd provides logistics services in South Korea. It offers general cargo, over weight/oversized cargo, bulk cargo, special cargo, explosives and defense industrial materials, stevedoring, consumer packaged goods, warehousing, and corporate moving services, as well as parcel delivery services for handling pharmaceuticals and hazardous materials; and operates gas stations in Yeosu and Ulsan. The company also provides room temperature services, such as warehousing, value added, information technology (IT) system and bonded operational, returns management, and CS operational services; and cold chain logistics solutions, including 3PL, CVS and franchise logistics, and other services. In addition, it offers international logistics services comprising air/ocean transportation services in the fields of general and bulk products, petrochemicals, hazardous materials, and semiconductors; packaging, custom clearance, shipment, marine insurance, and other services; import agent services; and onshore and offshore services for overseas EPC projects. Further, the company provides IT solutions, such as data mining, logistics information, high availability structures and solutions, Web based visibility systems, and data through real-time backup systems. Hanexpress.Co., Ltd was founded in 1979 and is headquartered in Seoul, South Korea.",
    "website": "http://www.hanex.co.kr",
    "zipcode": null
  },
  "086280.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Integrated Freight & Logistics",
    "long_name": "Hyundai Glovis Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "HYUNDAIGLOVIS",
    "state": null,
    "summary": "Hyundai Glovis Co., Ltd. provides logistics and transportation services primarily for the automobile industry in South Korea and internationally. It offers in/outbound logistics services comprising packaging, storage, customs clearance, shipping, and freight services; vehicle transportation services, such as car transportation, pre-delivery quality inspection, pre-export duties, and harbor unloading services; parts logistics services; general and special cargo services; and logistics consulting services. The company also provides bulk logistics services, including inland transportation, coastal shipping, procurement, production, sales logistics, and international freight forwarding services for steel, industrial machineries, factory equipment, other big heavy-weight cargos, heavy equipment, facility equipment, and tools and materials used in plant construction. In addition, it offers overseas shipment services for finished vehicles through a fleet of approximately 80 vessels; and bulk export and import services. Further, the company provides comprehensive distribution services, such as auto parts procurement, quality control, customs clearance, packing, transportation, etc. services for overseas car factories. Additionally, it is involved in the distribution of used-cars; trading of raw materials that include aluminum, copper, scrap, hot rolled/cold rolled steel products, and other products. The company was formerly known as Glovis Co., Ltd. and changed its name to Hyundai Glovis Co., Ltd. in November 2011. Hyundai Glovis Co., Ltd. was founded in 2001 and is headquartered in Seoul, South Korea.",
    "website": "http://www.glovis.net",
    "zipcode": null
  },
  "129260.KS": {
    "city": "Busan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Integrated Freight & Logistics",
    "long_name": "Intergis Co.Ltd",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "INTERGIS",
    "state": null,
    "summary": "Intergis Co.Ltd provides logistics services in South Korea, China, Brazil, Vietnam, and internationally. The company operates bulk and container piers; and transports steel products, coal, grain, and other bulk cargoes, as well as provides ship management and inland transportation services. It is also involved in the provision of logistics services for import and export cargo, such as ocean shipment/air transport, customs clearance, storage, etc.; loading and unloading facilities; logistics consulting services; and value-added services, which include storage, assembly, packing, etc. The company was formerly known as Dongkuk Transportaion Co., Ltd. Intergis Co.Ltd was founded in 1956 and is headquartered in Busan, South Korea.",
    "website": "http://www.intergis.co.kr",
    "zipcode": null
  },
  "180640.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Integrated Freight & Logistics",
    "long_name": "Hanjin Kal",
    "market": "kr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "HANJINKAL",
    "state": null,
    "summary": "Hanjin Kal, together with its subsidiaries, provides airline services. It owns and operates 166 aircrafts and scheduled flights to 124 cities in 44 countries worldwide. The company also owns and operates three hotels; operates a resort hotel; provides computerized reservation services; and offers travel and tourism related services. In addition, it provides building management services, including building maintenance services, parking lot operation and maintenance, and facility rental services. Further, the company is also involved in golf, leisure, food, and accommodation businesses. Hanjin Kal was founded in 2013 and is based in Seoul, South Korea.",
    "website": "http://www.hanjinkal.co.kr",
    "zipcode": "04532"
  },
  "18064K.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Integrated Freight & Logistics",
    "long_name": "Hanjin Kal",
    "market": "kr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "HANJINKAL(1P)",
    "state": null,
    "summary": "Hanjin Kal, together with its subsidiaries, provides airline services. It owns and operates 166 aircrafts and scheduled flights to 124 cities in 44 countries worldwide. The company also owns and operates three hotels; operates a resort hotel; provides computerized reservation services; and offers travel and tourism related services. In addition, it provides building management services, including building maintenance services, parking lot operation and maintenance, and facility rental services. Further, the company is also involved in golf, leisure, food, and accommodation businesses. Hanjin Kal was founded in 2013 and is based in Seoul, South Korea.",
    "website": "http://www.hanjinkal.co.kr",
    "zipcode": "04532"
  }
}
