{
    "000180.KS": {
        "short_name": "SCEHoldings",
        "long_name": "Sungchang Enterprise Holdings Limited",
        "summary": "Sungchang Enterprise Holdings Limited engages in the development of various plant species and forest restoration activities in South Korea. The company is also involved in the planting of trees, such as pine tree, as well as owns a botanical garden. In addition, it manufactures and sells a range of plywood products, including interior plywood for interior purposes; standard plywood for building frames, inner walls, and interiors; plywood for concrete casts, building exteriors, and exposed concrete construction; eco-friendly plywood for exterior applications; and custom plywood for automobile, ship, and flooring applications, as well as flooring products under the Lieu brand. Further, the company produces and sells particle boards, particle board materials, wood chips, and Bio-SRF; and engages in importing and selling wood pellet, and PKS, as well as sawdust and recycling activities. It owns and manages 8,140HA of fields. Sungchang Enterprise Holdings Limited was founded in 1916 and is headquartered in Busan, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Busan"
    },
    "008250.KS": {
        "short_name": "EagonInd",
        "long_name": "Eagon Industrial Co., Ltd.",
        "summary": "Eagon Industrial Co., Ltd. supplies building materials in South Korea and internationally. It offers aluminum, PVC, and wood windows and doors; curtain walls; explosion and bullet proof windows; glasses; building integrated photovoltaic and photovoltaic solutions; floors; removable dividers and doors; plywood; housing materials, such as sheathing materials, OSB, and engineered and deck wood; landscape products; guard rail products; and logistics products, such as green and plastic pellets, clip-lok, and C-box. The company was founded in 1972 and is based in Incheon, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Incheon"
    }
}