{
    "000700.KS": {
        "short_name": "EUSU HOLDINGS",
        "long_name": "Eusu Holdings Co., Ltd.",
        "summary": "Eusu Holdings Co., Ltd., through its subsidiaries, provides shipping and logistics services worldwide. The company's services include air and marine shipping, overland and railroad transport, customs, project goods transport, warehouse storage, logistics consulting, etc., as well as customized services, including FMS, WMS, and TMS services. It also provides IT services for the maritime logistics industry; and produces coffee beans. The company was founded in 1949 is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.eusu-holdings.com",
        "full_time_employees": 22
    },
    "010620.KS": {
        "short_name": "HyundaiMipoDock",
        "long_name": "Hyundai Mipo Dockyard Co., Ltd.",
        "summary": "Hyundai Mipo Dockyard Co., Ltd. engages in the shipbuilding business in South Korea. The company primarily builds medium-sized conventional ships and specialized vessels. It offers chemical tankers, container ships, LPG carriers, pure car and truck carriers, open hatch general cargo carriers, bulk carriers, LNG bunkering vessels, drill ships, pipe and cable laying vessels, ferries, and multi-purpose cargo ships. Hyundai Mipo Dockyard Co., Ltd. was founded in 1975 and is headquartered in Ulsan, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Ulsan",
        "zipcode": "682-712",
        "website": "http://www.hmd.co.kr",
        "full_time_employees": null
    },
    "011200.KS": {
        "short_name": "HMM",
        "long_name": "HMM Co.,Ltd",
        "summary": "HMM Co.,Ltd, an integrated logistics company, provides shipping and logistic services worldwide. The company transports commodities, such as crude oil, coal, iron ore, and various special cargoes, as well as import/export goods. It operates container ships; bulk carriers; tankers, such as crude and product tankers; and trampers that include Cape, Panamax, and Supramax/Handy, as well as heavy lifts and special product carriers. The company was formerly known as Hyundai Merchant Marine Co.,Ltd. and changed its name to HMM Co.,Ltd in March 2020. HMM Co.,Ltd was founded in 1976 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "03127",
        "website": "http://www.hmm21.com",
        "full_time_employees": null
    },
    "044450.KS": {
        "short_name": "KSS LINE",
        "long_name": "KSS Line Ltd.",
        "summary": "KSS Line Ltd. provides marine transportation services for liquefied petroleum gas and petrochemical products in South Korea. The company's gas cargoes include anhydrous ammonia, butadiene, butane, butane 1, C4 raffinate, ethylene, propane, propylene, vinyl chloride monomer, and others. Its chemical cargoes consist of acetic acid, acetone, acrylonitrile monomer, aniline, benzene, toluene, xylene, base oil cumene, cyclohexane, dioctyl phthalate, ethanol, kerosene, methanol, methyl, ethyl, ketone, mono ethylene glycol, nitric acid, octanol, phenol, pyrolysis gasoline, styrene monomer, vinyl acetate monomer, and others. The company operates a fleet of 6 chemical vessels, 2 tanker vessels, and 4 LNG vessels. The company was formerly known as Korea Special Shipping Co., Ltd. and changed its name to KSS Line Ltd. in July 1999. KSS Line Ltd. was founded in 1969 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "03163",
        "website": "http://www.kssline.com",
        "full_time_employees": null
    },
    "075580.KS": {
        "short_name": "SEJIN HEAVY",
        "long_name": "Sejin Heavy Industries Co., Ltd.",
        "summary": "Sejin Heavy Industries Co., Ltd. manufactures and sells shipbuilding equipment in South Korea. It offers deck houses, upper deck units, LPG/LNG cargo tanks, and topside and plant modules, as well as living quarters for the crew of offshore structures. Sejin Heavy Industries Co., Ltd. was founded in 1999 and is headquartered in Ulsan, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Ulsan",
        "zipcode": "45011",
        "website": "http://www.sejinheavy.com",
        "full_time_employees": null
    },
    "153360.KS": {
        "short_name": "Hi Gold No.3",
        "long_name": "Hi Gold Ocean No.3 Ship Investment Company",
        "summary": "Hi Gold Ocean No.3 Ship Investment Company was founded in 2011 and is headquartered in Jeju-si, Jeju-do, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Jeju-si",
        "zipcode": "690732",
        "website": "http://www.kmarin.co.kr",
        "full_time_employees": null
    },
    "155900.KS": {
        "short_name": "Badaro19",
        "long_name": "Badaro No. 19 Ship Investment Company",
        "summary": "Badaro No. 19 Ship Investment Company, through its subsidiary, acquires and operates vessels. The company was founded in 2011 and is headquartered in Jeju, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Jeju-Si",
        "zipcode": null,
        "website": null,
        "full_time_employees": null
    },
    "AZY.SI": {
        "short_name": "Pan Ocean",
        "long_name": "Pan Ocean Co., Ltd.",
        "summary": "Pan Ocean Co., Ltd., together with its subsidiaries, provides marine transportation and other related services worldwide. It operates through four segments: Bulk Carrier Service, Container Service, Tanker Service, and Other Shipping Services. The company offers break bulk liner services for steel, coal, wood, equipment, and machinery cargoes; tramper services for dry bulk cargo shipping, such as iron ore, coal, grain, sugar, logs, minerals, and scrap iron; large bulker services for dry bulk cargo comprising grain, coal, minerals, and iron ore; and container services. It also provides tanker services for palm oil, crude oil, naptha, gasoline, diesel, kerosene, jet fuel, and heavy oil for power generation; oils and fats; and petrochemicals, which comprise benzene, toluene, xylene, base oil, and caustic soda, as well as liquefied natural gas carrier services. In addition, the company offers heavy lifter services for large equipment, machinery, devices, etc.; and tug boats, drill ships, barges, ocean platforms, etc. Further, it is involved in the trading and logistics of agriculture products, such as corn, soybean, wheat, and soybean meal. The company was formerly known as STX Pan Ocean Co., Ltd. and changed its name to Pan Ocean Co., Ltd. in January 2014. Pan Ocean Co., Ltd. was founded in 1966 and is headquartered in Seoul, South Korea. Pan Ocean Co., Ltd. is a subsidiary of Harim Holdings Co., Ltd.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SES",
        "market": "sg_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "03157",
        "website": "http://www.panocean.com",
        "full_time_employees": null
    }
}