{
  "012800.KS": {
    "city": "Siheung-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Metal Fabrication",
    "long_name": "Daechang Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "DAECHANG",
    "state": null,
    "summary": "Daechang Co., Ltd., together with its subsidiaries, produces and sells brass-related products in South Korea. It offers its products under the BRASSONE brands. The company was formerly known as Daechang Industrial Co., Ltd. and changed its name to Daechang Co., Ltd. in 2010. Daechang Co., Ltd. was founded in 1974 and is headquartered in Siheung, South Korea.",
    "website": "http://www.brasone.co.kr",
    "zipcode": null
  },
  "021050.KS": {
    "city": "Ansan-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Metal Fabrication",
    "long_name": "Seowon Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "Seowon",
    "state": null,
    "summary": "Seowon Co., Ltd. manufactures and sells non-ferrous metals in South Korea. The company offers brass billets, slabs, and ingots, as well as bronze ingots; and recycles brass ash, granular brass and aluminum, clove, sludge, mill berry, oxidized copper, and grinding powder, as well as copper rods for electric wires and copper billets. Its products are used in various applications, such as cars and industrial machinery parts, electrical and electronic equipment parts, ship building components and firefighting facilities, faucets, heat exchange appliances parts, and high-tech equipment and heavy industry products. The company was founded in 1988 and is headquartered in Ansan, South Korea.",
    "website": "http://www.swbrass.co.kr",
    "zipcode": "15999"
  },
  "025820.KS": {
    "city": "Ansan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Metal Fabrication",
    "long_name": "Leeku Industrial Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "LeekuInd",
    "state": null,
    "summary": "Leeku Industrial Co., Ltd. operates in the non-ferrous material industry in South Korea. It offers oxygen-free, tough pitch, and phosphorus deoxidized copper; red brass; brass; phosphor bronze; and other alloys, including detonator brass, naval brass, tin brass, tin copper, LEEKU ferrous copper, and CuFe2P. The company was founded in 1968 and is headquartered in Ansan, South Korea.",
    "website": "http://www.leeku.net",
    "zipcode": null
  },
  "058430.KS": {
    "city": "Pohang",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Metal Fabrication",
    "long_name": "POSCO COATED & COLOR STEEL Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "POSCO C&C",
    "state": null,
    "summary": "POSCO COATED & COLOR STEEL Co., Ltd. engages in the manufacture, processing, and sale of coated, molten galvanized, and aluminized steel sheets in South Korea and internationally. It offers coated steel sheets for use in vehicles, home appliances, and building materials; and color coated steel sheets for use in exterior and interior building materials, as well as in boilers, electronic furniture, agriculture machines, etc. The company was founded in 1988 and is based in Pohang, South Korea. POSCO COATED & COLOR STEEL Co., Ltd. is a subsidiary of POSCO.",
    "website": "http://www.poscocnc.com",
    "zipcode": null
  },
  "092440.KS": {
    "city": "Incheon",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Metal Fabrication",
    "long_name": "Kishin Corporation",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "KISHIN",
    "state": null,
    "summary": "Kishin Corporation provides mold bases, die sets, and precision plates in South Korea. The company's die set products include stripper, die set, and MG guides, as well as shanks and press guide parts. Its mold products are used in the manufacture of mobile handsets, vehicles, and other products. The company was founded in 1975 and is based in Incheon, South Korea.",
    "website": "http://www.kishin.com",
    "zipcode": "405-300"
  },
  "103140.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Metal Fabrication",
    "long_name": "Poongsan Corporation",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "POONGSAN",
    "state": null,
    "summary": "Poongsan Corporation develops, manufactures, markets, exports, and sells fabricated nonferrous metal, defense, and precision forging products in South Korea and internationally. It offers copper and copper alloy sheets, strips, and rods, as well as thin plates, bimetals, and coin blanks; leadframe materials; titanium tubes; stainless steel strips; and copper-based roofing materials. The company's copper and copper alloy sheets and strips are used for interior and exterior applications in commercial and residential real estate, construction, machinery, automobiles, electrical and electronics, semiconductors, telecommunication, and electronic parts industries. It also provides military ammunitions, including small arms, anti-aircraft guns, mortars, howitzers, tank guns, recoilless guns, naval guns, and mid-to large-size weaponries; commercial ammunitions, such as precision made cartridges for recreational hunting and competitive shooting; and semi-finished products and components used in the production of ammunitions, such as primers, fuses, bullet jacket cups, case cups, discs, cones, rotating bands, links, tungsten penetrators, and shell bodies, as well as fuses for use in naval ammunitions, mortar shells, and multiple launch rocket systems. In addition, the company produces chemicals, such as nitrocellulose and nitroglycerine for use in propellants; and precision products, including connector parts for electric and electronic industries, multi-guage copper strips, precision dies, gauges and tools, and metal machinery and facilities. Further, it builds metal processing machineries and other customized equipment for the steel, automobile, and defense industries; and specializes in rolling related products, such as annealing, pickling, degreasing, buffing, tin plating, and slitting machineries, as well as scalping lines and rolling oil coolant systems. Poongsan Corporation was founded in 1968 and is headquartered in Seoul, South Korea.",
    "website": "http://www.poongsan.co.kr",
    "zipcode": "120-837"
  }
}
