{
    "KBN.MX": {
        "short_name": "KB FINANCIAL GROUP INC",
        "long_name": "KB Financial Group Inc.",
        "summary": "KB Financial Group Inc. provides a range of banking and related financial services to consumers and corporations in South Korea and internationally. It operates through Corporate Banking, Retail Banking, Other Banking Services, Securities Business, Non-life Insurance Business, Credit Card Business, and Life Insurance Business segments. The company offers loans, deposit, and other related financial products and services to large, small, and medium-sized enterprises, as well as small and home office, and individuals and households; and engages in trading in securities and derivatives, funding, and other supporting activities. It also provides investment banking services, including financing and financial advisory services for mergers and acquisitions, real estate development projects, and social overhead capital projects, as well as securities underwriting and structured finance; brokerage and other supporting services; injuries, illnesses, long-term care, disabilities, accidents, property losses or other events, automobile, general property and casualty, and life insurance products; and credit sale, cash service, card loan, and other related services. In addition, the company offers foreign exchange transaction; financial investment; credit card and installment financing; financial leasing; real estate trust management; capital investment; collection of receivables or credit investigation; software advisory, development, and supply; investment advisory and securities dealing; claim; management; asset-backed securitization; investment trust; real estate trust management; general advisory; and trust account management services. KB Financial Group Inc. was incorporated in 2008 and is headquartered in Seoul, South Korea.",
        "currency": "MXN",
        "sector": "Financial",
        "industry": "Money Center Banks",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "07331",
        "website": "http://www.kbfg.com",
        "full_time_employees": null
    },
    "SHGN.MX": {
        "short_name": "SHINHAN FINANCIAL GROUP CO LTD",
        "long_name": "Shinhan Financial Group Co., Ltd.",
        "summary": "Shinhan Financial Group Co., Ltd. provides financial products and services in South Korea and internationally. The company operates through five segments: Commercial Banking Services, Credit Card Services, Securities Brokerage Services, Life Insurance Services, and Others. It offers retail banking services, including demand, savings, and fixed deposit-taking; checking accounts; mortgage and home equity, and retail lending; electronic banking and automatic teller machines (ATM); and bill paying, payroll and check-cashing, currency exchange, and wire fund transfer services. The company also provides corporate banking services, such as investment banking, real estate financing, overseas real estate and development project financing, infrastructure and structured financing, equity/venture investments, mergers and acquisitions consulting; securitization and derivatives services comprising securities and derivative products, and foreign exchange trading; and working capital loans and facilities loans. In addition, it is involved in treasury and investment activities in international capital markets consisting of foreign currency-denominated securities trading, foreign exchange trading and services, trade-related financial services, international factoring services, and foreign banking operations. Further, the company offers trust account management, securities brokerage, and asset management services, as well as leasing and equipment financing, savings banking, loan collection and credit reporting, collective investment administration, private equity investment, and financial system development services. As of December 31, 2020, it operated a network of 859 service centers; 5,472 ATMs; 12 cash dispensers; and 37 digital kiosks. Shinhan Financial Group Co., Ltd. was founded in 1982 and is headquartered in Seoul, South Korea.",
        "currency": "MXN",
        "sector": "Financial",
        "industry": "Money Center Banks",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "04513",
        "website": "http://www.shinhangroup.com",
        "full_time_employees": null
    }
}