{
    "000670.KS": {
        "short_name": "Youngpoong",
        "long_name": "Young Poong Corporation",
        "summary": "Young Poong Corporation operates as a non-ferrous metal company in Korea. The company offers high purity electric zinc bars that are used in hot dip galvanizing, die casting alloys, electroplating and sacrificial anodes, photo engraving plates, zinc oxide, and zinc plates, as well as zinc jumbo bars for hot dip galvanizing; combination zinc bars for continuous and hot dip galvanizing; and zinc alloys for use in automobiles, electric devices, toys and leisure goods, home appliances, accessories, office equipment, and communication equipment, as well as zippers, industrial machinery and tools, builders' and domestic hardware, plastic and press molds, and gears. It also provides sulfuric acid for use in inorganic chemicals and metal refining, as well as steel, spinning and weaving, chemical and fertilizer, fiber, and paper manufacturing industries; copper sulfate for agrichemicals, reagents, electroplating, and metallurgy; electrolytic copper cathode for brass and bronze, plates, and rods and pipes; and indium for ITO target, soldering, and bonding. In addition, the company offers silver by-product, such as lead ingots, which are used in storage battery pastes, red lead and litharge, solders, radiation shields, pigment colors, bearings, and type metals; and silver granules that are used in photographic materials, sterling and electroplated wares, catalysts, and jewelry. Further, it provides gold for use in jewelry, dental and medical supplies, electroplated wares, medals and badges, gold wires, fountain-pens, and watches; and silver for solar cells, photographic materials, sterling wares, electrical contacts and conductors, electroplated wares, dental and medical supplies, catalysts, and commemorative objects, as well as jewelry, mirrors, and coins. The company was founded in 1949 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "06110",
        "website": "http://www.ypzinc.co.kr",
        "full_time_employees": 686
    }
}