{
    "002870.KS": {
        "short_name": "ShinpoongPaprMfg",
        "long_name": "Shinpoong Paper Mfg. Co., Ltd",
        "summary": "Shinpoong Paper Mfg. Co., Ltd produces and sells paper products. It offers duplex board products that are used for packaging foods, electronic products, tissues, cleansers, and toys. The company was founded in 1960 and is headquartered in Pyeongtaek si, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Pyeongtaek-Si"
    },
    "003720.KS": {
        "short_name": "SamyoungChem",
        "long_name": "SamYoung Chemical Co.,Ltd",
        "summary": "SamYoung Chemical Co.,Ltd manufactures and sells electronic and packaging films in South Korea. It offers PP films, such as BOPP films that are used in food and non-food packing materials, tapes, capacitors, etc.; CPP films; and vacuumed films for application in food packages, agrichemicals, medical products, sundries, stationaries, gift packings, etc., as well as nylon films for meat and meat processing vacuum packing, and agricultural/fishery/industrial vacuum packing. The company also provides capacitor films; and wraps, such as PE stretch films for packing electronic products, complicated machines and parts, various living household products, medical products, bricks, and other separable products, as well as PE bio wraps, PVC sun wraps, and antifungal sun wraps. In addition, it offers lamination products consisting of poly match and toothpaste films; and paper packing containers. The company exports its products to 40 countries. The company was founded in 1959 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "004250.KS": {
        "short_name": "NPC",
        "long_name": "NPC Co., Ltd.",
        "summary": "NPC Co., Ltd. manufactures and sells plastic products in South Korea. The company's products include containers, pallets, chairs and desks, recycling bins, sheets, reversetap, and cups. The company was formerly known as National Plastic Co., Ltd. and changed its name to NPC Co., Ltd. in March 2010. NPC Co., Ltd. was founded in 1965 and is headquartered in Ansan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Ansan-Si"
    },
    "004450.KS": {
        "short_name": "SamhwaCrown&Closure",
        "long_name": "Samhwa Crown & Closure Co., Ltd",
        "summary": "Samhwa Crown & Closure Co., Ltd manufactures and sells bottle caps used in the packaging of beverages, alcohols, and foods in South Korea and internationally. It offers crown, roll on pilfer proof, plastic, white, press on twist off, and injection caps. The company also provides metal printing services for caps. It also exports its products. The company was founded in 1965 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "008730.KS": {
        "short_name": "YoulchonChem",
        "long_name": "Youlchon Chemical Co.,Ltd.",
        "summary": "Youlchon Chemical Co.,Ltd. produces and sells functional packaging materials. The company offers adhesive and composite materials for surface protection of various electronic materials; release materials for general industrial-purpose and optical materials; and hard coating materials for display materials. It also provides flexible packaging materials for food, daily commodities, and functional packaging; laminated tubes, which are used to pack toothpaste, food, and medical supplies; biaxial oriented polypropylene films, casted polypropylene films, and polypropylene shrink films; and corrugated boards. The company was formerly known as Youl Chon Printing Company and changed its name to Youlchon Chemical Co.,Ltd. in April 1988. Youlchon Chemical Co.,Ltd. was founded in 1973 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "008870.KS": {
        "short_name": "Kumbi",
        "long_name": "Kumbi Corporation",
        "summary": "Kumbi Corporation manufactures and sells glass bottles, bottle caps, cosmetics, and plastic products in South Korea. The company was formerly known as Jin Ro Glass Co., Ltd. and changed its name to Kumbi Corporation in April 1992. Kumbi Corporation was founded in 1973 and is headquartered in Icheon, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Icheon-Si"
    },
    "011280.KS": {
        "short_name": "Tailim Pkg",
        "long_name": "Tailim Packaging Co., Ltd.",
        "summary": "Tailim Packaging Co., Ltd. manufactures and sells paper and packaging products in South Korea. The company was formerly known as Tailim Packaging Industrial Co., Ltd. and changed its name to Tailim Packaging Co., Ltd. in May 2016. Tailim Packaging Co., Ltd. was founded in 1976 and is based in Siheung, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Siheung-Si"
    },
    "014160.KS": {
        "short_name": "DaeyoungPkg",
        "long_name": "DAE YOUNG Packaging.Co., Ltd.",
        "summary": "DAE YOUNG Packaging.Co., Ltd. manufactures and sells corrugated cardboards and boxes in South Korea. The company provides middle, reverse side, and surface base papers for corrugated fiber boards. It offers single and double faced; and double and triple wall corrugated fiber boards. DAE YOUNG Packaging.Co., Ltd. was founded in 1979 and is based in Ansan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Ansan"
    },
    "272550.KS": {
        "short_name": "SAMYANG PACKAGING",
        "long_name": "Samyang Packaging Corporation",
        "summary": "Samyang Packaging Corporation manufactures and sells PET bottles that are used for various types of food and beverages in South Korea. The company offers heat resistant, heat and pressure resistant, pressure resistant, normal pressure, and miscellaneous bottles for use as PET bottles of beverages, such as fruit drinks, sports drinks, and coffee. It is also involved in the production and supply of various preforms; PET recycling activities; and aseptic filling business under the Asepsys name. The company is headquartered in Seoul, South Korea. Samyang Packaging Corporation is a subsidiary of Samyang Corporation.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    }
}