{
    "095720.KS": {
        "short_name": "WOONGJIN THINKBIG",
        "long_name": "Woongjin Thinkbig Co., Ltd.",
        "summary": "Woongjin Thinkbig Co., Ltd. operates as a book publisher for various age groups in South Korea. It develops and offers educational and cultural content for toddlers to adults, including member-only workbooks, complete works series for children, study rooms, learning centers, online and offline book publishing services, etc. The company publishes books in various genres, including literature, humanities, social science, history, economy and business administration, self-development, children education, lifestyle, etc. It also provides children reading, customized reading design, and visiting learning services. Woongjin Thinkbig Co., Ltd. was founded in 1980 and is based in Paju, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Paju-Si"
    },
    "100220.KS": {
        "short_name": "VISANG",
        "long_name": "Visang Education Inc",
        "summary": "Visang Education Inc publishes elementary, middle, and high school textbooks in South Korea. The company offers Wings, an interactive English program; Challenge, an English learning program with AR/MR technology; englisheye, an English academy; JUMPSKY, an edutainment facility for healthy mind; WISECAMP, an integrated subject program; soobakc.com for Internet lectures of various subjects; TESOM, a test and evaluation solutions for Math; VISANG Ivytz educational institutes for English and Mathematics; and VISANG Practice Test, an entrance examination consulting service, as well as EBS Nurisam. It also provides Viva Sam, a service that supports teachers at the elementary, and middle and high schools; VISANG TSCHOOl, a remote education training institute for teachers; Mom & Talk, a community of parents; Soohak Plus Learning, an education institute solutions for customized classes; MasterTOPIK, an Internet lectures for TOPIK; and MasterKOREAN, a customized-type Internet lectures for learning Korean language, as well as digital textbooks, and supplementary books. The company was formerly known as Visang, Inc. and changed its name to Visang Education Inc in 2009. Visang Education Inc was founded in 1997 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    }
}