{
  "000650.KS": {
    "city": "Busan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Railroads",
    "long_name": "Chunil Express Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "ChunilExp",
    "state": null,
    "summary": "Chunil Express Co., Ltd. operates and provides vehicles for passenger transportation in South Korea. It is also involved in the real estate marketing and leasing service activities. The company was founded in 1949 and is based in Busan, South Korea.",
    "website": "http://www.chunilexpress.com",
    "zipcode": null
  },
  "064350.KS": {
    "city": "Uiwang-si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Railroads",
    "long_name": "Hyundai Rotem Company",
    "market": "kr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "HYUNDAI ROTEM",
    "state": null,
    "summary": "Hyundai Rotem Company manufactures and sells railway vehicles, defense systems, and plants and machinery in South Korea and internationally. The company produces railway vehicles, such as electric multiple units, high-speed trains, light rail vehicles, magnetically levitated vehicles, trams, diesel multiple units, locomotives, passenger coaches, freight wagons, and electrical equipment; and railway systems comprising signaling, communications, electricity/power, machinery/PSD, and system engineering, project records, as well as depot facilities, maintenance, railway vehicles modernization, parts, and repair services. It also offers defense systems, including MBTs and family vehicles, wheel type combat vehicles, mock training equipment, future weapon systems, and other products. In addition, the company provides engineering, manufacturing, procurement, installation, and commissioning services in the field of steelmaking facilities, automotive manufacturing facilities, power plants, and environmental facilities for various infrastructures. Hyundai Rotem Company was founded in 1977 and is headquartered in Uiwang, South Korea.",
    "website": "http://www.hyundai-rotem.co.kr",
    "zipcode": null
  }
}
