{
    "034830.KS": {
        "short_name": "KOREIT",
        "long_name": "KOREIT",
        "summary": "KOREIT, a real estate investment trust, engages in the investment, development, and management of real estate properties in South Korea. It also involves in land development trust, management trust, profit certificate trust, proxy business and agency business, real estate consulting, real estate investment trusts, and asset-backed securities businesses. The company was founded in 1996 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "06132",
        "website": "http://www.koreit.co.kr",
        "market_cap": "Large Cap"
    },
    "088260.KS": {
        "short_name": "E KOCREF",
        "long_name": "E Kocref Cr-Reit",
        "summary": "E Kocref Cr-Reit engages in the acquisition, development, management, and leasing of real estate properties. The company has elected to be taxed as a real estate investment trust. As a result, it would not be subject to corporate income tax on that portion of its net income that is distributed to shareholders. The company was founded in 2005 and is based in Seoul, South Korea. E Kocref Cr-Reit is a subsidiary of ELAND RETAIL.Ltd.",
        "currency": "KRW",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "06158",
        "website": "http://www.ereits.co.kr",
        "market_cap": "Large Cap"
    },
    "357120.KS": {
        "short_name": "KORAMCO EP REIT",
        "long_name": "Koramco Energy Plus Reit",
        "summary": "Koramco Energy Plus Reit operates as a real estate investment trust with 187 directly-managed gas stations in Korea. The company has elected to be taxed as a REIT under the Internal Revenue Code of 1986 and would not be subject to federal corporate income taxes, if it distributes at least 90% of its taxable income to its stockholders. Koramco Energy Plus Reit is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "06158",
        "website": "http://www.koramco.co.kr",
        "market_cap": null
    },
    "357250.KS": {
        "short_name": "MAPS REIT 1",
        "long_name": "Miraeasset Maps REIT 1 Co., Ltd.",
        "summary": "Miraeasset Maps Reit1 Co., Ltd. operates as a retail REIT in South Korea. It primarily invests in commercial facilities in Gwanggyo Central Prugio City located in Gwanggyo New City, Gyeonggi-do. The company is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "03159",
        "website": "http://maps1reit-miraeasset.irpage.co.kr",
        "market_cap": "Large Cap"
    }
}