{
  "000850.KS": {
    "city": "Gwangju",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Hwacheon Machine Tool Co. Ltd",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "HMT",
    "state": null,
    "summary": "Hwacheon Machine Tool Co. Ltd develops, manufactures, and sells various machine tools primarily in South Korea. It offers NC lathes, machining centers, and the machineries for automation, as well as casting products, various robotic materials, components, and alloy cast iron. The company was founded in 1952 and is based in Gwangju, South Korea.",
    "website": "http://www.hwacheon.com/en/company/hwintro_partner_01.do",
    "zipcode": null
  },
  "007460.KS": {
    "city": "Seongnam-si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Aprogen KIC Inc.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Aprogen KIC",
    "state": null,
    "summary": "Aprogen KIC Inc. designs, manufactures, and maintains plant facilities for steelwork, petrochemistry, shipbuilding, power plant, and LNG base industries in South Korea. The company also offers thermal and cold spray services; and clad rolls, clad plates, wear plates, clad pipes and fittings, and plasma transferred arcs. In addition, it provides Nukon system, a special heat-preservation system that keeps the pipe facility of the internal equipment of the containment building working safely in the pressurized water reactor power plant; foamglas, a cellular glass insulation product; and fireproof insulation works in the POSCO furnaces and boilers. The company was formerly known as Nara KIC Inc. Aprogen KIC Inc. was founded in 1971 and is based in Seongnam-si, South Korea.",
    "website": "http://www.aprogen-kic.com",
    "zipcode": null
  },
  "008110.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Daidong Electronics Co. Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "DAIDONG",
    "state": null,
    "summary": "Daidong Electronics Co. Ltd. engages in mold design and manufacturing, and technical development activities in Korea and internationally. The company design, manufactures, fits, and assembles molds. It also manufactures various injection molding products, such as small ultra-precision engineering plastic injection, big and small parts of various electronic, automobile, double-colored injection, micropore formation, gas injection molding, and in-mold injection products. In addition, the company provides NC machine, wire cut, EDM, injection, die spoiting, and laser machine equipment. Daidong Electronics Co. Ltd. was incorporated in 1972 and is headquartered in Seoul, South Korea.",
    "website": "http://www.daidong.com",
    "zipcode": null
  },
  "009160.KS": {
    "city": "Incheon",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Industrial Machinery",
    "long_name": "SIMPAC Inc.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "SIMPAC",
    "state": null,
    "summary": "SIMPAC Inc. manufactures and markets mechanical, servo, and hydraulic press machines worldwide. The company also offers automation, press line, ferro alloy, roll, polyurethane screen, and tandem line products. The company was founded in 1973 and is headquartered in Incheon, South Korea.",
    "website": "http://www.simpac.co.kr",
    "zipcode": "403-858"
  },
  "009450.KS": {
    "city": "Pyeongtaek-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Kyung Dong Navien Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "KYUNGDONGNAVIEN",
    "state": null,
    "summary": "Kyung Dong Navien Co., Ltd. manufactures and sells home boilers and water heaters in South Korea. The company offers gas, oil, and electric boilers; gas and electric water heaters; hot water mats; wire and wireless zone control systems; controllers; home network products, such as IoT products, video phones, lobby phones, sub-phones, door cameras, inter phones, and security office systems; heat pump products, including hybrid and double heat geothermal boilers; micro CHP products; agricultural dryers, wood fiber boilers, and heat hubs; and cascade systems, ventilators, and mid and large-size boilers. Kyung Dong Navien Co., Ltd. also exports its products. The company was formerly known as Kyungdong Boiler Co., Ltd. and changed its name to Kyung Dong Navien Co., Ltd. in September 2006. Kyung Dong Navien Co., Ltd. was founded in 1978 and is headquartered in Pyeongtaek, South Korea.",
    "website": "http://en.kdnavien.com",
    "zipcode": null
  },
  "009540.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Korea Shipbuilding & Offshore Engineering Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "KSOE",
    "state": null,
    "summary": "Korea Shipbuilding & Offshore Engineering Co.,Ltd. engages in shipbuilding and offshore engineering businesses in South Korea. The company builds oil tankers, containerships, bulk carriers, lng and lpg carriers, pc tankers, semi-submersible drilling rigs, special-purpose ships, floating/fixed-type oil and gas production facilities, subsea pipelines and offshore installations, power plants, chemical processing plants, processing equipment, and special equipment. It also provides two-stroke and four-stroke marine engines, and components; propellers; engine power plants; and photovoltaic modules and systems. The company was formerly known as Hyundai Heavy Industries Co., Ltd. The company was founded in 1972 and is based in Seoul, South Korea.",
    "website": "http://www.ksoe.co.kr",
    "zipcode": "03058"
  },
  "010040.KS": {
    "city": "Dangjin",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Korea Refractories Co., Ltd",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "Krc",
    "state": null,
    "summary": "Korea Refractories Co., Ltd. develops and manufactures refractories and furnaces in South Korea. The company's refractories include shaped refractories, such as firing and non-firing refractories; and monolithic refractories, such as castable refractories, plastic refractories, and mortars. Its industrial furnaces comprise ferrous metal furnaces, such as metal heating furnaces and metal heat treatment furnaces; non-ferrous metal furnaces, including aluminum melting and holding furnaces, aluminum heat treatment furnaces, and copper heat treatment furnaces; and other furnaces, such as powder metallurgy sintering furnaces, metalizing furnaces, firing furnaces, and special order furnaces. The company also offers engineering, installation, and supervision services. Its products are used in various applications, such as iron and metal, incinerator, steel, cement, petrochemical, non-ferrous, and other industry applications. The company was formerly known as Korea Special Refractories Co. Ltd and changed its name to Korea Refracrories Co., Ltd. in January 1995. Korea Refracrories Co., Ltd. was founded in 1973 and is headquartered in Dangjin, South Korea.",
    "website": "http://www.fskrc.co.kr",
    "zipcode": null
  },
  "010400.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Woojin I&S Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "WOOJINI&S",
    "state": null,
    "summary": "Woojin I&S Co., Ltd. engages in the construction and machinery equipment production activities in South Korea, rest of Asia, the United States, Europe, and internationally. The company offers semi-con, system, spiral, and transverse duct flange ducts, as well as ROTOFLON lining and hook-up pipes and fittings. It also provides fluororesin, ethylene tetra fluoro ethylene, CPT, and ROTOFLON lining coatings. In addition, the company constructs mechanical, fire safety, pre-fabrication-piping system, and unit pipe facilities; and hotels, stores, hospitals, cultural facilities, apartments, offices, and special construction facilities. Woojin I&S Co., Ltd. was founded in 1975 and is headquartered in Seoul, South Korea.",
    "website": "http://www.woojini.com",
    "zipcode": null
  },
  "010660.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Hwacheon Machinery Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "HWACHEON",
    "state": null,
    "summary": "Hwacheon Machinery Co., Ltd. manufactures and sells machine tools, and automobile parts and components in Korea. It offers lathes, milling machines, NC machine tools, and special-purpose machines, as well as automotive parts, including engine blocks, cylinder heads, crankshafts, and other components. The company markets and sells its products in the United States, Asia, and Europe. Hwacheon Machinery Co., Ltd. was founded in 1952 and is headquartered in Seoul, South Korea.",
    "website": "http://www.hwacheon.com/en/company/hwintro_partner_02.do",
    "zipcode": null
  },
  "011700.KS": {
    "city": "Ansan-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Hanshin Machinery Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "HanshinMach",
    "state": null,
    "summary": "Hanshin Machinery Co., Ltd. manufactures and sells air compressors in Korea and internationally. The company offers GRH and RCH series oil flooded compressors; AL, CDH, and FE type oil free screw compressors; and air cooled reciprocating air compressors. It also provides accessories, including refrigerated type air dryers, air filters, after coolers, and air receiver tanks, as well as air dryers for high temperature use; and green compressed air systems. The company was formerly known as Hanshin Machinery Mfg. Co., Ltd. and changed its name to Hanshin Machinery Co., Ltd. in November 1976. Hanshin Machinery Co., Ltd. was founded in 1969 and is based in Ansan, South Korea.",
    "website": "http://www.hanshin.co.kr",
    "zipcode": "15425"
  },
  "015590.KS": {
    "city": "Ulsan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Curo Co.,Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "CURO",
    "state": null,
    "summary": "Curo Co.,Ltd. manufactures and sells power and chemical plant machinery and equipment in South Korea and internationally. The company offers chemical equipment products, including shell and tube heat exchangers, waste heat boilers, towers and columns, pressure vessels, and reactors. It also provides energy plant products, such as heat recovery steam generators, industrial boilers, co-generation power boilers, and auxiliary boilers. The company was formerly known as Daekyung Machinery & Engineering Co., Ltd. The company was founded in 1981 and is headquartered in Ulsan, South Korea.",
    "website": "http://www.dkme.com",
    "zipcode": "680-110"
  },
  "017800.KS": {
    "city": "Icheon-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Hyundai Elevator Co., Ltd",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "HyundaiElev",
    "state": null,
    "summary": "Hyundai Elevator Co., Ltd. designs, manufactures, installs, maintains, and modernizes elevators, escalators, and moving walks in South Korea and internationally. The company offers ultra-high speed elevators under the THE EL and THE EL DUO names; high-speed elevators under the i-XEL name; and low and mid-speed elevators under the LUXEN, NEW YZER, NEO, and VIVALDI names, as well as observation, hospital, freight and automobile, and marine elevators. It also provides auto parking systems and services; and advanced remote maintenance systems. In addition, the company engages in the real estate leasing, tourist accommodation, travel, construction, and finance businesses. Hyundai Elevator Co., Ltd. was founded in 1984 and is headquartered in Icheon, South Korea.",
    "website": "http://www.hyundaielevator.co.kr",
    "zipcode": "17336"
  },
  "034020.KS": {
    "city": "Changwon-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Doosan Heavy Industries & Construction Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "DHICO",
    "state": null,
    "summary": "Doosan Heavy Industries & Construction Co., Ltd. operates as an engineering, procurement, and construction contractor worldwide. The company offers coal-fired and heavy oil thermal, cycle, and biomass power plants; gas and steam turbines, generators, boiler, air pollution control, heat exchangers, and transportation equipment; plant upgrades, outage services, plant assessment and engineering, operation and maintenance, and asset management services; generates power through wind and solar power, energy storage systems, and micro-grids; and supplies equipment for nuclear power plants, including nuclear reactor and internal structure, steam generator, nuclear reactor coolant pump, control element drive mechanism pressurizer, head assembly, fuel handling equipment, fuel storage rack, post-tensioning system of the containment building, heat exchanger, pressure vessels, and tanks. It also offers seawater desalination plants; drinking water, sewage treatment and reuse, and sludge treatment and resource recycling systems, as well as industrial water and wastewater solutions; and water treatment equipment comprising ultrasonic solubilization devices and dissolved air flotation equipment. In addition, the company provides integrated heads with nozzles, nuclear energy shells, rotor shafts, turbine casings, and runners; crankshafts, marine shafts, and stern forge products; work rolls, backup rolls, plate backup rolls, and mill housing structures; plastic mold steel and tool steel; press roller and kiln tires, roller, and kiln tires, as well as steel casting, forging products, and welding structures. Further, it constructs highways/railroads, and port/landfill/water and sewage projects; business facilities, research/medical/factory facilities, and residential-commercial complexes/apartments; and nuclear and LNG power plants, and transmission lines. The company was founded in 1962 and is headquartered in Changwon, South Korea.",
    "website": "http://www.doosanheavy.com",
    "zipcode": "51711"
  },
  "049800.KS": {
    "city": "Boeun-Gun",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Woojin Plaimm Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "WOOJIN PLAIMM",
    "state": null,
    "summary": "Woojin Plaimm Co., Ltd. manufactures and sells plastic injection molding machines in South Korea and internationally. It offers hydraulic, electric, two platen, and vertical type of injection molding machines. The company was founded in 1985 and is headquartered in Boeun-Gu, South Korea.",
    "website": "http://www.woojinplaimm.com",
    "zipcode": "376-840"
  },
  "051600.KS": {
    "city": "Naju-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Industrial Machinery",
    "long_name": "KEPCO Plant Service & Engineering Co.,Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "KEPCO KPS",
    "state": null,
    "summary": "KEPCO Plant Service & Engineering Co.,Ltd. provides maintenance services for electric power and industrial facilities in South Korea. It offers planned outage, commissioning, instrument and control system, and modification and rehabilitation services, as well as routine maintenance, including preventive, predictive, and corrective maintenance services; and power electronics, vibration diagnosis, performance evaluation, life assessment, and insulation diagnosis for electric facilities. It also provides maintenance services for transmission sites and substations, such as transmission lines, live wires, and high-voltage direct currency transformers, as well as restoration of overhead transmission lines; and construction, construction supervision, engineering, and safety diagnosis of transmission lines. In addition, the company operates and maintains nuclear and other power plants; provides NPP maintenance services. Further, it engages in the development of various technologies, such as maintenance techniques and automation, diagnosis and evaluation of machineries, machinery welding maintenance and related engineering services, ICT convergence, new and renewable energy, robotics, nuclear decommissioning, non-destructive examination, and 3D-printing commercialization. Additionally, the company provides various services, such as diagnosis of turbo machineries, hydraulic technology, vibration analysis, electric facilities, thermal performance diagnosis and evaluation, life assessment/ boiler diagnosis, I&C engineering, insulation diagnosis, computational analysis, and assessment; and maintenance and engineering services for nuclear power plants. It also repairs gas and steam turbine components; constructs solar energy power plants; and offers rotor maintenance and balancing services and high temperature gas turbine components. The company was founded in 1984 and is based in Naju, South Korea. KEPCO Plant Service & Engineering Co.,Ltd. is a subsidiary of Korea Electric Power Corporation.",
    "website": "http://www.kps.co.kr",
    "zipcode": "58326"
  },
  "091090.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Industrial Machinery",
    "long_name": "SEWONCELLONTECH Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "SEWON E&C",
    "state": null,
    "summary": "SEWONCELLONTECH Co., Ltd. engages in the process equipment, mechatronics system, and regenerative medical system businesses worldwide. The company manufactures and sells petrochemical, oil refining, gas, and power plant equipment, as well as exports plant equipment to countries, such as the Middle East region. It also manufactures and sells hydraulic and pneumatic pressure equipment for use in the fields of automobile, steel and iron manufacture, nonferrous metal facilities and machine tools, catapult, press, construction equipment, industrial vehicles, and marine shipbuilding; and products for glass lining equipment and centrifugal separators. In addition, the company provides cell therapy, bio-collagen, and regenerative medical systems. The company was founded in 1971 and is headquartered in Seoul, South Korea.",
    "website": "http://www.sewoncellontech.com",
    "zipcode": "07330"
  },
  "145210.KS": {
    "city": "Gwangju",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Saehwa IMC Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "SAEHWA IMC",
    "state": null,
    "summary": "Saehwa IMC Co., Ltd. primarily engages in the manufacture and sale of tire molds and tire production equipment in Korea. The company offers casting and engraving molds, and containers; and tire manufacturing equipment, such as tire building machines, drums, and curing presses. It also serves customers in North America, Europe, China, and rest of Asia. The company was founded in 1981 and is headquartered in Gwangju, South Korea.",
    "website": "http://www.saehwaimc.com",
    "zipcode": null
  },
  "267250.KS": {
    "city": "Daegu",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Hyundai Heavy Industries Holdings Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "HYUNDAI HEAVY INDUSTRIES HOLDIN",
    "state": null,
    "summary": "Hyundai Heavy Industries Holdings Co., Ltd. provides solutions in the heavy industry and energy sectors, ranging from shipbuilding and offshore engineering to refinery, petrochemical, and smart energy management businesses. It provides shipbuilding solutions, marine engine machinery, and offshore plants, as well as ship lifecycle maintenance services; industrial robots and robotic automation systems; electrical machinery and systems for power generation, transmission, and distribution, as well as energy management solutions and smart ship solutions; construction equipment and industrial vehicles, including excavators, wheel loaders, forklifts, and skid steer loaders; heat recovery steam generators, circulating fluidized bed combustion boilers, and other industrial boilers and auxiliary components; and machinery parts, such as MCVs, swing and travel motors, hydraulic cylinders, transmission products, drive axles, and spare parts. The company also offers petroleum, petrochemicals, lubricant products, benzene, toluene, para-xylene, mixed xylene, condensates, lube base oils, carbon black, and BTX; oil storage and shipping services; and solar products, such as PV modules, ESS, and inverters. In addition, it provides design inspection, parts services bunkering, and maintenance and aftermarket services. The company was formerly known as Hyundai Robotics Co., Ltd. and changed its name to Hyundai Heavy Industries Holdings Co., Ltd. in March 2018. Hyundai Heavy Industries Holdings Co., Ltd. was founded in 2017 and is headquartered in Daegu, South Korea.",
    "website": "http://www.hyundai-holdings.com",
    "zipcode": null
  },
  "298040.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Hyosung Heavy Industries Corporation",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "HYOSUNG HEAVY",
    "state": null,
    "summary": "Hyosung Heavy Industries Corporation manufactures and sells heavy electrical equipment in South Korea and internationally. It offers transmission and distribution products, such as power, oil-immersed distribution, cast-resin, and special transformers; shunt reactors, high voltage switchgears, medium/ low voltage switchgears, and high voltage direct current transmission systems; STATCOM, a power electronic based device to enhance the power system stability and quality; and turnkey solutions for various applications, including nuclear power, conventional power, renewable energy, water treatment, mining and steel, and industrial plants, as well as substations and oil and gas facilities. The company also provides system and engineering solutions, including condition monitoring systems; asset health management, power system maintenance, power automation, and process automation solutions; and renewable energy products comprising energy storage systems, solar inverters, and wind turbines, as well as engineering, procurement, and construction services for solar energy projects. In addition, it offers high and low voltage motors, DC motors, general industrial and special-purpose motors, commercial generators, and emergency power generators; chemical equipment, filling stations, and industrial gas supplying systems; gear boxes, motors, and special gear units; and ARC, resistance, and special spot welding machines. Further, the company undertakes various construction projects, including housing, redevelopment and reconstruction, business and commercial facilities, civil engineering and environment, and SOC. Additionally, it provides power conditioning systems for the commercial, industrial, and utility-scale markets; and power management systems, which are used to communicate and optimally control the hardware and batteries. It exports its products to North America, the Middle East, and Europe. The company was founded in 1962 and is headquartered in Seoul, South Korea.",
    "website": "http://www.hyosungheavyindustries.com",
    "zipcode": "04144"
  },
  "298050.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Hyosung Advanced Materials Corporation",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "HYOSUNG ADVANCED",
    "state": null,
    "summary": "Hyosung Advanced Materials Corporation manufactures and sells industrial, polyester, nylon, and carpet yarns in South Korea and internationally. The company also offers aramid fiber and carbon fiber materials; polyester tire cords, steel cords, and bead wires for tire reinforcement; and airbag fabrics and cushions, as well as hose wires and conveyor belt wires. The company serves various industries, such as automobile, civil engineering, architecture, construction, and transportation industries. The company was founded in 2018 and is based in Seoul, South Korea.",
    "website": "http://www.hyosungadvancedmaterials.com",
    "zipcode": "04144"
  }
}
