{
    "000320.KS": {
        "short_name": "NorooHoldings",
        "long_name": "NOROO Holdings Co., Ltd.",
        "summary": "NOROO Holdings Co., Ltd., together with its subsidiaries, operates as a general fine chemical company in South Korea. It produces industrial materials, including resins and coatings, such as paints and inks; and color chemicals used in automobiles and building interiors, as well as offers plastic products. The company was formerly known as DPI Holdings Co., Ltd. and changed its name to NOROO Holdings Co., Ltd. in March 2010. NOROO Holdings Co., Ltd. was founded in 1945 and is headquartered in Anyang, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Anyang",
        "zipcode": "139-77",
        "website": "http://www.norooholdings.com",
        "full_time_employees": 51
    },
    "000325.KS": {
        "short_name": "NorooHoldings(1P)",
        "long_name": "NOROO Holdings Co., Ltd.",
        "summary": "NOROO Holdings Co., Ltd., together with its subsidiaries, operates as a general fine chemical company in South Korea. It produces industrial materials, including resins and coatings, such as paints and inks; and color chemicals used in automobiles and building interiors, as well as offers plastic products. The company was formerly known as DPI Holdings Co., Ltd. and changed its name to NOROO Holdings Co., Ltd. in March 2010. NOROO Holdings Co., Ltd. was founded in 1945 and is headquartered in Anyang, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Anyang",
        "zipcode": "139-77",
        "website": "http://www.norooholdings.com",
        "full_time_employees": null
    },
    "000390.KS": {
        "short_name": "SamhwaPaint",
        "long_name": "Samhwa Paints Industrial Co., Ltd.",
        "summary": "Samhwa Paints Industrial Co., Ltd. manufactures and sells various paints and synthetic resins in South Korea and internationally. The company offers architectural coatings, including emulsion, alkyd, acryl, fire retardant, antimildew, texture and multicolor, DIY, electric-wave absorbing, and other coatings, as well as putty, caulking, and sealant products. It also provides floor coatings, such as urethane, epoxy, water proofing, traffic, and polyurea coatings; wood coatings comprising nitrocellulose lacquer, polyurethane, U/V curing, and stain coatings; and industrial coatings that include heat resistance, polyurethane, acryl, fluorine, epoxy, baking, oil alkyd, U/V curing, and silicone acryl coatings. In addition, the company offers heavy-duty coatings that comprise shop primer, anti-corrosive primer, top, tank, ship, and other coatings; and unsaturated polyester resins, including laminate, corrosion, flame retardant, corrugated panel, pultrusion, SMC/BMC, marble, decorative casting, button, and gel coat resins. Further, it provides coil coatings, such as primer, backer, polyester, high polymer polyester, and plastisol coatings; automotive refinish coatings comprising clear, surfacer, putty, primer, and solid urethane coatings; can coatings; and super resins that include alkyd, modified alkyd, acrylic, polyester, amino, urethane, radiation curable, emulsion, water soluble, rosin modified maleic, epoxy ester, and polyamide resins. The company was formerly known as Dongwha Co., Ltd. and changed its name to Samhwa Paints Industrial Co., Ltd. in July 1964. Samhwa Paints Industrial Co., Ltd. was founded in 1946 and is headquartered in Ansan-si, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Ansan-Si",
        "zipcode": "425-110",
        "website": "http://www.samhwa.com",
        "full_time_employees": null
    },
    "000860.KS": {
        "short_name": "KANGNAM JEVISCO",
        "long_name": "Kangnam Jevisco Co., Ltd",
        "summary": "Kangnam Jevisco Co., Ltd. manufactures and sells various paints and coatings worldwide. The company provides architectural paints, including interior and exterior paints, functional paints, floor coatings, and wood coatings; and industrial coatings, such as general industrial, powder, packaging, and coil coatings. It also offers marine coatings for sea vessels, and protective coatings for infrastructures, and power plants and transmission towers; and automotive refinish coatings, including clear coats, topcoats, base coats, primers/surfacers, putties, and thinners and additives. Kangnam Jevisco Co., Ltd. was founded in 1945 and is headquartered in Busan, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Busan",
        "zipcode": null,
        "website": "http://www.jevisco.com",
        "full_time_employees": null
    },
    "001340.KS": {
        "short_name": "PaikkwangInd",
        "long_name": "Paik Kwang Industrial Co., Ltd.",
        "summary": "Paik Kwang Industrial Co., Ltd. produces and sells chemical products in South Korea and internationally. It offers caustic soda, hydrochloric acid, liquid chlorine, sodium hypochlorite, nitrous oxide, nitrogen trifluoride, ultra-high purity chlorine and hydrogen, sorbitol, and maltitol and polyglycitol syrup. The company also operates high pressure gas container re-inspection and inner surface treatment facilities, as well as golf course, ice rink, fitness, and sauna and yoga facilities. Its products are used in chemical, purified wastewater treatment, papermaking, food processing, textile, petrochemical, and advanced materials industries. The company was formerly known as PAIK KWANG Chemical Co., Ltd. and changed its name to Paik Kwang Industrial Co., Ltd. in 1990. The company was founded in 1954 and is headquartered in Gunsan, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Gunsan-si",
        "zipcode": null,
        "website": "http://www.pkic.co.kr",
        "full_time_employees": null
    },
    "002760.KS": {
        "short_name": "Bolak",
        "long_name": "Bolak Company Limited",
        "summary": "Bolak Company Limited manufactures and sells food additives, food ingredients, pharmaceutical raw materials, functional materials, and cosmetic ingredients in South Korea and internationally. The company offers confectionery, beverage, and dairy flavoring products, as well as herbal flavoring and seasoning flavoring agents; active pharmaceutical ingredients, such as dry extract powders, viscous extracts, fluid extracts, tinctures, natural paclitaxel, docetaxel trihydrates, and Ca-CMC; functional materials, including green tea extracts, soy isoflavones, and ginseng extracts; and food coloring products. It also provides gum base products; cosmetic ingredients derived from natural materials comprising amentoflavones, aloes extracts, gilgyeong extracts, yellowish natural concentrated extracts, and magnolia extracts; fragrances for use in perfumes, cosmetics, hair products, daily supplies, toilet soaps, candles, and industrial products; and other products, such as sweeteners, surfactants, whitening agents, preservatives, antioxidants, abrasives, thickening agents, thickeners, caffeine, and baking powder. Bolak Company Limited was founded in 1959 and is headquartered in Hwaseong, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Hwaseong",
        "zipcode": "720-37",
        "website": "http://www.bolak.co.kr",
        "full_time_employees": null
    },
    "004430.KS": {
        "short_name": "SongwonInd",
        "long_name": "Songwon Industrial Co., Ltd.",
        "summary": "Songwon Industrial Co., Ltd., together with its subsidiaries, develops, manufactures, and supplies specialty chemicals in South Korea and internationally. The company's products include polymer stabilizers, such as phenolic and phosphite antioxidants, thioester and aminic antioxidants, binary blends, tailor-made solutions, hindered amine light stabilizers, UV absorbers and hydroxybenzoates, high melter and low melter blends, nucleator and clarifier blends, and highly loaded UV blends, as well as blends comprising liquid components. It also provides a range of phenolic, aminic, phosphite, and thioester antioxidants for fuels and lubricants, primarily in liquid form, as well as fuel additives as stabilizers; tin intermediates; PVC stabilizers and plasticizers that include one pack systems for PVC stabilization, mixed metal stabilizers, metal soap stabilizers, organo-tin stabilizers, auxiliary stabilizers and lubricants, and plasticizers; and specialty polymers, which comprise polyester diols, thermosetting and/or thermoplastic polyurethanes, thermoplastic polyurethanes, and super absorbent polymers. In addition, the company offers specialty chemicals for fast-moving industries, including electronics, as well as coating additives and functional monomers for various applications. Songwon Industrial Co., Ltd. sells its products under the SONGCAT, SONGSTAR, SONGXTEND, SONGNOX, SONGSTAB, SONGSTOMER, SONGCIZER, HI-THANE, SONGCURE, SONGSORB, and HI-SWELL brands. The company offers its solutions for use in the adhesive, agriculture, automotive, building and construction, coating, durable and consumer good, electrical and electronic, fuel and lubricant, packaging, textile and fiber, and wire and cable industries. Songwon Industrial Co., Ltd. was founded in 1965 and is headquartered in Ulsan, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Ulsan",
        "zipcode": "44781",
        "website": "http://www.songwon.com",
        "full_time_employees": 1076
    },
    "004910.KS": {
        "short_name": "ChokwangPaint",
        "long_name": "Chokwang Paint Co., Ltd.",
        "summary": "Chokwang Paint Co., Ltd. manufactures and sells paints and chemicals in South Korea and internationally. It offers architectural, floor and waterproofing, heavy duty, industrial, wood, plastic, and UV curing paints; powder coatings, adhesives, electronic materials, and car maintenance products; and energy saving products. The company was founded in 1947 and is headquartered in Busan, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Busan",
        "zipcode": "46909",
        "website": "http://www.chokwangpaint.co.kr",
        "full_time_employees": 468
    },
    "006060.KS": {
        "short_name": "HSInd",
        "long_name": "HWASEUNG Industries Co.,Ltd.",
        "summary": "Hwaseung Industries Co.,Ltd. engages in the shoes and precision chemicals businesses in South Korea and internationally. The company offers BOPP, PET, and, air quality films; sheets and plates; and synthetic resins and adhesives, including shoe adhesives, industrial adhesives, automotive coatings, and polyurethane resins. It also trades in clothing, bedding, and other products. The company was founded in 1969 and is headquartered in Busan, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Busan",
        "zipcode": null,
        "website": "http://www.hsi.co.kr",
        "full_time_employees": null
    },
    "010640.KS": {
        "short_name": "ChinYangPoly",
        "long_name": "Chinyang Poly Urethane Co.,Ltd",
        "summary": "Chinyang Poly Urethane Co.,Ltd produces and supplies polyurethane foam products in South Korea. It serves furniture, automobile, shoes, construction, packaging, and electronics industries. The company was founded in 1975 and is headquartered in Pyeongtaek-si, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Pyeongtaek-si",
        "zipcode": "100-2018",
        "website": "http://www.chinyangpoly.kr",
        "full_time_employees": null
    },
    "011780.KS": {
        "short_name": "KumhoPetrochem",
        "long_name": "Kumho Petrochemical Co., Ltd.",
        "summary": "Kumho Petrochemical Co., Ltd. manufactures and sells synthetic rubber and resins, specialty chemicals, nanocarbon, energy, and building materials in South Korea and internationally. The company's synthetic rubber products include high-cis and low-cis polybutadiene rubber, high styrene resin masterbatch, styrene butadiene latex and carboxyl styrene butadiene latex, LEADCAP, acrylonitrile butadiene rubber, ultra high-cis polybutadiene rubber, styrene butadiene rubber, styrene butadiene styrene, solution polymerized styrene butadiene rubber, and STE for use in industrial items, such as golf balls, medical products, footwear, asphalt modifiers, etc. Its synthetic resin products comprise acrylonitrile butadiene styrene, ENERPOR, engineering plastics, expandable polystyrene, GPPS, HIPS, polypropylene glycol, and styrene acrylonitrile for use in general-purpose products, such as automotive parts, electronic components, food containers, building materials, etc. The company also provides specialty chemicals consisting of antioxidants, vulcanization accelerators, and paint additives/diluents used in tires, rubber belts, and shoes; carbon nanotubes; and building materials comprise ABS window systems, PVC window systems, AL window systems, and gold foam insulators. In addition, it operates a cogeneration plant that provides residential, commercial, and industrial users with electricity, steam, and purified water to businesses. Kumho Petrochemical Co., Ltd. was founded in 1970 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.kkpc.co.kr",
        "full_time_employees": null
    },
    "011785.KS": {
        "short_name": "KumhoPetrochem(1P)",
        "long_name": "Kumho Petrochemical Co., Ltd.",
        "summary": "Kumho Petrochemical Co., Ltd. manufactures and sells synthetic rubber and resins, specialty chemicals, nanocarbon, energy, and building materials in South Korea and internationally. The company's synthetic rubber products include high-cis and low-cis polybutadiene rubber, high styrene resin masterbatch, styrene butadiene latex and carboxyl styrene butadiene latex, LEADCAP, acrylonitrile butadiene rubber, ultra high-cis polybutadiene rubber, styrene butadiene rubber, styrene butadiene styrene, solution polymerized styrene butadiene rubber, and STE for use in industrial items, such as golf balls, medical products, footwear, asphalt modifiers, etc. Its synthetic resin products comprise acrylonitrile butadiene styrene, ENERPOR, engineering plastics, expandable polystyrene, GPPS, HIPS, polypropylene glycol, and styrene acrylonitrile for use in general-purpose products, such as automotive parts, electronic components, food containers, building materials, etc. The company also provides specialty chemicals consisting of antioxidants, vulcanization accelerators, and paint additives/diluents used in tires, rubber belts, and shoes; carbon nanotubes; and building materials comprise ABS window systems, PVC window systems, AL window systems, and gold foam insulators. In addition, it operates a cogeneration plant that provides residential, commercial, and industrial users with electricity, steam, and purified water to businesses. Kumho Petrochemical Co., Ltd. was founded in 1970 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.kkpc.co.kr",
        "full_time_employees": null
    },
    "011790.KS": {
        "short_name": "SKC",
        "long_name": "SKC Co., Ltd.",
        "summary": "SKC Co., Ltd. manufactures and markets chemicals and film products in South Korea and internationally. The company offers copper foil for lithium ion battery used in electric vehicles (EVs); NEOCOVER, a material used for EVs, batteries, and 5G parts; and interlayer film of laminated safety film glasses for vehicles and buildings, as well as intermediate film for PV modules. It also designs chemical mechanical polishing (CMP) pads for polishing the surface of semiconductor wafers physically and chemically; supplies CMP slurry products; and provides phase shift mask used in the semiconductor lithography process. In addition, the company offers biodegradable PLA films used in food wrapping, paper rolls, glitters, cards, and ordinary wrapping applications; ecolabel, a recyclable PET bottle labelling material; and films for windows. Further, it provides PET base films used as raw material for various core optical sheets of FPD, such as LCD and PDP; heat-shrinkable film used as shrinkable labels for containers of various materials, including PET, PS, PE, glass, can, etc.; color-tinted films used in window films of vehicles and construction; and clear films used for films that require hard coatings, shatterproof film, and window films, such as screen protection films. SKC Co., Ltd. was founded in 1976 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "137-070",
        "website": "http://www.skc.co.kr",
        "full_time_employees": null
    },
    "013000.KS": {
        "short_name": "Sewooglobal",
        "long_name": "Sewoo Global Co., Ltd",
        "summary": "Sewoo Global Co., Ltd manufactures and sells polymer petrochemical products. The company offers engineering plastics and ABS resins. It also manufactures and sells printed circuit boards. The company was formerly known as Sewoo Polymer. Sewoo Global Co. Ltd. was founded in 1978 and is based in Incheon, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Incheon",
        "zipcode": "402-060",
        "website": "http://www.sewoo21.co.kr",
        "full_time_employees": null
    },
    "014530.KS": {
        "short_name": "KukdongOil&Chem.",
        "long_name": "Kukdong Oil & Chemicals Co.,Ltd",
        "summary": "Kukdong Oil & Chemicals Co.,Ltd develops, manufactures, and supplies various lubricant products primarily in South Korea. It offers industrial lubricants, such as machine oil, gear oil, hydraulic oil, air compressor oil, heat transfer oil, refrigeration oil, grease, transformer oil, and others; metalworking fluids, including insoluble and soluble cutting, metal forming, rust preventive, and cleaning oils; paraffinic, naphthenic, and aromatic type process oils; liquid paraffin for food additive, cosmetic, and general industrial uses; and color and pavement asphalt. The company also operates LPG charging stations and gas stations; distributes lubricants under the BP, Castrol, Optimol, and Tribol brands; and supplies petroleum to affiliated gas stations and business partners. It exports its products to approximately 20 countries worldwide. The company was formerly known as Sechang industry Co., Ltd. and changed its name to Kukdong Oil & Chemicals Co.,Ltd in January 1985. Kukdong Oil & Chemicals Co.,Ltd was founded in 1979 and is headquartered in Yangsan-si, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Yangsan-si",
        "zipcode": null,
        "website": "http://www.kdoc.co.kr",
        "full_time_employees": null
    },
    "024890.KS": {
        "short_name": "DaewonChem",
        "long_name": "DAEWON Chemical Co., Ltd.",
        "summary": "DAEWON Chemical Co., Ltd. manufactures and supplies polyurethane synthetic leather and wallpaper to sporting goods companies in South Korea. The company offers synthetic leather; make-up blender for skin make-up under the h.natural brand name; masks and filters; wallpapers; and back and polishing pads. It is also involved in di-methyl formamide waste refining business. The company was founded in 1974 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.daewon21.co.kr",
        "full_time_employees": null
    },
    "055490.KS": {
        "short_name": "TAPEX",
        "long_name": "Tapex Co., Ltd.",
        "summary": "Tapex Co., Ltd. manufactures and sells adhesive tapes in South Korea. The company provides various tapes that are used in the areas of electronic products, including flat panel displays, semiconductors, secondary batteries, optic lens moldings, electronic insulations, electrical fittings, (F) PCBs, and touch panels, as well as for EMI shielding, lead frame plating, and other applications; packing applications; and in home/office products, such as kitchen utensils, tapes, and household items. It also exports its products to approximately 10 countries. The company was formerly known as Seotong Chemical Co., Ltd. The company was founded in 1977 and is headquartered in Hwaseong-si, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Hwaseong-si",
        "zipcode": null,
        "website": "http://www.tapex.co.kr",
        "full_time_employees": null
    },
    "090350.KS": {
        "short_name": "NOROOPAINT",
        "long_name": "NOROO PAINT & COATINGS Co., Ltd.",
        "summary": "NOROO PAINT & COATINGS Co., Ltd. develops, manufactures, and sells paints in South Korea and internationally. It provides floor, waterproof, heavy duty, PCM, household electrical appliance, and industrial coating products, as well as architecture and automotive refinish paint products; and resin products. The company offers its products under the SOON&SOO, Pantone Paint, YEGREENA, NOROOWAY, HiQ, Q-Fit, Natural, Color stain, Pororo Paint, and Energy Saver brands. It also engages in the market research and networking activities. The company was founded in 1945 and is based in Anyang-si, South Korea. NOROO PAINT & COATINGS Co., Ltd is a subsidiary of NOROO Holdings Co., Ltd.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Anyang-Si",
        "zipcode": null,
        "website": "http://www.noroopaint.com",
        "full_time_employees": null
    },
    "090355.KS": {
        "short_name": "NOROOPAINT(1P)",
        "long_name": "NOROO PAINT & COATINGS Co., Ltd.",
        "summary": "NOROO PAINT & COATINGS Co., Ltd. develops, manufactures, and sells paints in South Korea and internationally. It provides floor, waterproof, heavy duty, PCM, household electrical appliance, and industrial coating products, as well as architecture and automotive refinish paint products; and resin products. The company offers its products under the SOON&SOO, Pantone Paint, YEGREENA, NOROOWAY, HiQ, Q-Fit, Natural, Color stain, Pororo Paint, and Energy Saver brands. It also engages in the market research and networking activities. The company was founded in 1945 and is based in Anyang-si, South Korea. NOROO PAINT & COATINGS Co., Ltd is a subsidiary of NOROO Holdings Co., Ltd.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Anyang-Si",
        "zipcode": null,
        "website": "http://www.noroopaint.com",
        "full_time_employees": null
    },
    "100250.KS": {
        "short_name": "Chinyang Holdings",
        "long_name": "Chinyang Holdings Corp.",
        "summary": "Chinyang Holdings Corp., through its subsidiaries, engages in the manufacture and sale of polyurethane plastic foam products. The company also offers PVC flooring and synthetic leather products, as well as automobile interior parts. In addition, it provides real-estate marketing, leasing, and trade transaction services. Chinyang Holdings Corp. was founded in 2008 and is based in Busan, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Busan",
        "zipcode": null,
        "website": "http://www.cyholdings.kr",
        "full_time_employees": null
    },
    "107590.KS": {
        "short_name": "MWH",
        "long_name": "Miwon Holdings Co., Ltd.",
        "summary": "Miwon Holdings Co., Ltd. produces and sells chemical products for UV/EB curing systems in Korea and internationally. The company offers acrylate and methacrylate monomers, oligomers, photo initiators, and other related fine chemicals. Its products are used in wood, metal, plastic, nail art, printing inks, adhesive, electronic, optical film, and CD/DVD/bluray applications. The company was founded in 1983 and is headquartered in Yongin, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Yongin-Si",
        "zipcode": "16864",
        "website": "http://www.miramer.com",
        "full_time_employees": null
    },
    "138490.KS": {
        "short_name": "KOLON PLASTICS",
        "long_name": "Kolon Plastics, Inc.",
        "summary": "Kolon Plastics, Inc. produces and sells engineering plastic products in South Korea and internationally. The company's products include KOCETAL-POM, a polyacetal resin of a copolymer type; KOPA-PA6, a plastic material based on polyamide-6; KOPA-PA66, a thermoplastic resin; SPESIN-PBT, a thermal plastic resin; KOPEL-TPC-ET, a thermoplastic polyester elastomer; KOPET- PET materials; KOPPS polyphenylene sulfide resins; KompoGTe long fiber reinforced thermoplastics; NOPLA, a PEN-PET copolyester; KOPHOS-PC, a polycarbonate; and INKRAYON Flex thermoplastic elastomers. Its products are used in automobile, electricity and electronics, and life materials. Kolon Plastics, Inc. operates in approximately 90 countries, including South Korea, Japan, the United States, and Europe. The company was formerly known as KTP Inc. and changed its name to Kolon Plastics, Inc. in June 2008. Kolon Plastics, Inc. was founded in 1996 and is based in Gimcheon, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Gimcheon-si",
        "zipcode": null,
        "website": "http://www.kolonplastics.com",
        "full_time_employees": null
    },
    "161000.KS": {
        "short_name": "AK Petrochemical",
        "long_name": "Aekyung Petrochemical Co., Ltd.",
        "summary": "Aekyung Petrochemical Co., Ltd. researches and develops, manufactures, and sells phthalic anhydride (PA) and plasticizers in South Korea and internationally. The company offers PA for use as an ingredient to manufacture plasticizer, unsaturated polyester resin (UPR), paint, and other products.; maleic anhydride, which is used as the ingredient of UPR and paper-sizing agent; itaconic acid, an additive to enhance the properties of commodity resin and medium for diverse chemicals; and refined glycerin for use in various business areas ranging from additives for food, cosmetics, and industrial materials. It also provides plasticizer, which is used as an additive to make plastics flexible, as well as in PVC resin; ester polyol, an ingredient of polyurethane, which is used in various fields, such as sandwich panel, PIR panel, cold insulation material, and adhesive; polyurethane system rigid polyurethane foam for use in construction material industries; and anode materials for secondary battery. In addition, it offers bio diesel, an alternative fuel made of vegetable oil; and bio heavy fuel oil for power generation. Aekyung Petrochemical Co., Ltd. was founded in 1970 and is headquartered in Seoul, South Korea. Aekyung Petrochemical Co., Ltd. is a subsidiary of AK Holdings, Inc.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "08298",
        "website": "http://www.akp.co.kr",
        "full_time_employees": null
    }
}