{
    "015540.KS": {
        "short_name": "THELMA Therapeutics",
        "long_name": "THELMA Therapeutics Co., Ltd.",
        "summary": "THELMA Therapeutics Co., Ltd. operates as a biopharmaceutical company in South Korea and internationally. The company develops TLM-01, a non-alcoholic steatohepatitis drug; TLM-02, an antiviral agent for COVID-19; TLM-03/TLM-04, an anticancer drug for solid and blood cancer; and TLM-05, a liver cancer drug. It also offers radioembolization and brachytherapy devices for the cancer treatments. The company was formerly known as Medipartner Biotechnology. Co., Ltd. THELMA Therapeutics Co., Ltd. was founded in 1981 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://thelma.co.kr",
        "full_time_employees": null
    },
    "058850.KS": {
        "short_name": "KTcs",
        "long_name": "ktcs corporation",
        "summary": "ktcs corporation operates as a contact business company in South Korea. The company offers online and offline services, such as home and mobile product customer, Olleh plaza, and roaming center services; and contact center services to local government, public sector, hospital, and corporate customers, as well as financial institutions. It also provides directory services; communication products and cosmetics through distribution channels; site-oriented consulting services; and battery-sharing cables. In addition, the company is involved in the promotion of work force management system solution; installation of call processing wallboards at customer centers; and implementation of counseling management system for contact centers. ktcs corporation was founded in 2001 and is headquartered in Daejeon, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Daejeon",
        "zipcode": "302-716",
        "website": "http://www.ktcs.co.kr",
        "full_time_employees": null
    },
    "122900.KS": {
        "short_name": "iMarketKorea",
        "long_name": "iMarketKorea Inc.",
        "summary": "iMarketKorea Inc. operates as an industrial material distribution service company in South Korea and internationally. It offers purchasing agency/purchasing consulting/B2B auction services; export/local sourcing/global sourcing network services; industrial materials/construction materials/IT distribution services; and medicine distribution/medical material distribution/online distribution services, as well as operates an online shopping mall. The company was founded in 2000 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.imarketkorea.com",
        "full_time_employees": null
    }
}