{
    "006490.KS": {
        "short_name": "INSCOB",
        "long_name": "Inscobee., Inc.",
        "summary": "Inscobee., Inc. engages in the smart grid, mobile virtual network operator (MVNO), bio, and distribution businesses in South Korea and internationally. It offers intelligent power network products, such as K2 chips and data concentration units, as well as PLC bridges, modems, and attenuators; and operates freeT, a mobile network operator for MVNOs of various mobile network operators. The company also provides bio medicines for pain; vaccines for cervical cancer and papillomavirus; and cosmeceuticals and nutraceuticals, as well as distributes watches. In addition, it sells smart lighting solutions, LED products, and lighting fixtures, as well as other electrical products. The company was founded in 1970 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://eng.inscobee.com",
        "market_cap": 314953793536
    },
    "032640.KS": {
        "short_name": "LG Uplus",
        "long_name": "LG Uplus Corp.",
        "summary": "LG Uplus Corp. provides various telecommunication services primarily in South Korea. The company provides mobile services, including 5G, telecommunication, and roaming services; and home media services comprising AI and IoT, as well as Internet, IPTV, homeboy, bundle, and Internet phone services. It also provides services to corporate customers comprising drone control systems, telecommunications services for business, business phone services, Internet services, security, business IT services, marketing/customer management services, and industrial IoT services, as well as facilities/services/security solutions and affiliated products. In addition, the company is involved in the handset sale activities; provision of telemarketing and other business support services; investment fund activities; and cable television and broadcasting businesses. LG Uplus Corp. was founded in 1996 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.uplus.co.kr",
        "market_cap": 6832962142208
    },
    "058860.KS": {
        "short_name": "KTis",
        "long_name": "KTIS Corporation",
        "summary": "KTIS Corporation engages in the customer service business in South Korea. The company offers general and professional consultation services related to fixed products and solutions; and customer contact services, including call center operation, consulting, facility leasing, construction and AP development support, talent dispatching and education, and contact/outsourcing services, as well as numbering services. It is also involved in the mobile distribution business; and provision of tourist reward services. KTIS Corporation was founded in 2001 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.ktis.co.kr",
        "market_cap": 106766753792
    },
    "072130.KS": {
        "short_name": "UANGEL",
        "long_name": "UANGEL Corporation",
        "summary": "UANGEL Corporation provides mobile network, IoT, service platform, and edutech solutions in South Korea and internationally. It develops various commercial core solutions for local mobile communication services, including 4G LTE and IoT services. The company's mobile network solutions include unified IP multimedia subsystem, next generation intelligent network, integrated signaling controller, policy and charging control, convergence billing, and messaging solutions, as well as multimedia broadcast/multicast services for LTE and public safety-LTE. It also provides IoT solutions, such as F.QMS, a quality management solution for smart factories; C.FMS, a facility management solution for smart cities; C.STS, a safety and tracking solution for smart cities; E.EVCS, an electronic vehicle charging and service solution for smart energy; and IoT Service Gateway, which offers mobile communication network function to external service providers as an open API or manages small capacity data communication with the IoT terminal. In addition, the company offers Customized Ring-Back Tone, BizConnect, BizMessaging, Call Manager Office, smart banking, and non-face-to-face real name authentication system services platforms. Further, it provides ToMoKids, a children's play and learn solution; ToMoNOTE, an online-offline integrated teaching activity support program for early childhood education by teachers in the preschool institutes, as well as offers learning curriculum in physical exercise and health, communication, social relations, art experience, and nature exploration areas; and ToMoRING, a smart sharing service for use as a home schooling material that provides school memo function between the institute and parents, album sharing function, and educational contents. The company offers mobile communication solutions to 20 operators in 16 countries. UANGEL Corporation was founded in 1999 and is headquartered in Seongnam, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seongnam-si",
        "zipcode": null,
        "website": "http://www.uangel.com",
        "market_cap": 48056356864
    },
    "078000.KS": {
        "short_name": "TELCOWARE",
        "long_name": "Telcoware Co.,Ltd.",
        "summary": "Telcoware Co.,Ltd. provides wired and wireless communication solutions in South Korea. The company offers 5G core solutions, such as network repository function component, network slicing selection function, unified data repository, unified data management, security edge protection proxy, 5G-EIR (Equipment Identity Register), short message service function, authentication server function, policy control function, and multi-access edge computing systems. It also provides IMS infra solutions, including call session control function that performs SIP-based call control and session handling in the 3G network, and provides various multimedia services; home subscriber servers; interconnection border control functions; media gateway control functions; and session border asptroller, a network boundary node. In addition, the company offers IMS applications, such as telephony application servers, RCS IM systems, and media resource functions; and mobile (3G/4G) solutions, such as home location registers, authentication centers, WCDMA EIRs, IoT-HSS solution, and number portability database products. Further, it provides roaming and other solutions comprising gateway location registers, gateway home location registers, roaming signal monitoring systems, and roaming signal monitoring systems, as well as WiFi network authentication, account, and authorization servers; NFV management and orchestration solution that provides NFV-based network service operation functions; and C4-SSW (Softswitch) systems. Additionally, the company offers video surveillance and intelligent video analysis solutions; and Telcobase main memory database management system, as well as laser detection-based light detection and ranging solution. Telcoware Co.,Ltd. was founded in 2000 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.telcoware.com",
        "market_cap": 70051545088
    },
    "KMB.F": {
        "short_name": "SK TELECOM CO.LTD.ADR 1/9",
        "long_name": "SK Telecom Co.,Ltd",
        "summary": "SK Telecom Co., Ltd. provides wireless telecommunication services in South Korea and internationally. The Cellular Services segment offers wireless voice and data transmission, cellular global roaming, interconnection, Internet of Things, and platform services, as well as sells smartphones, basic phones, tablets and other Internet access devices, and wearable devices. The Fixed-Line Telecommunication Services segment provides local, domestic and international long distance, and voice over Internet protocol services; broadband Internet access; Internet protocol TV and mobile over-the-top; and leased line solutions, Internet data center, and network solution services. The Commerce Services segment operates 11st, an online open marketplace; and T-commerce network that offer assortment of goods and services through pre-recorded television programming. The Other Businesses segment provides marketing platform services, such as Syrup Wallet, a mobile wallet service; OK Cashbag, a loyalty points program; and One Store, a mobile application marketplace. The Security Services segment offers physical security services, which includes centralized monitoring system; information security solutions, such as information security consulting, managed security, and cyber threat intelligence solutions; and operates parking management and security solutions business. In addition, it offers call center management, base station maintenance, information gathering and consulting, system software development and supply, quantum information and communications, data base and internet website, and digital contents sourcing services; manufactures and sells e-book; sells and trades in anti-theft and surveillance devices; and operates information and communications facilities. As of December 31, 2020, the company had 3.8 million fixed-line telephone and 31.4 million wireless subscribers. The company was incorporated in 1984 and is headquartered in Seoul, South Korea.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "04539",
        "website": "http://www.sktelecom.com",
        "market_cap": 17372325888
    },
    "KMB.MU": {
        "short_name": "SK TELECOM CO.LTD.ADR 1/9",
        "long_name": "SK Telecom Co.,Ltd",
        "summary": "SK Telecom Co., Ltd. provides wireless telecommunication services in South Korea and internationally. The Cellular Services segment offers wireless voice and data transmission, cellular global roaming, interconnection, Internet of Things, and platform services, as well as sells smartphones, basic phones, tablets and other Internet access devices, and wearable devices. The Fixed-Line Telecommunication Services segment provides local, domestic and international long distance, and voice over Internet protocol services; broadband Internet access; Internet protocol TV and mobile over-the-top; and leased line solutions, Internet data center, and network solution services. The Commerce Services segment operates 11st, an online open marketplace; and T-commerce network that offer assortment of goods and services through pre-recorded television programming. The Other Businesses segment provides marketing platform services, such as Syrup Wallet, a mobile wallet service; OK Cashbag, a loyalty points program; and One Store, a mobile application marketplace. The Security Services segment offers physical security services, which includes centralized monitoring system; information security solutions, such as information security consulting, managed security, and cyber threat intelligence solutions; and operates parking management and security solutions business. In addition, it offers call center management, base station maintenance, information gathering and consulting, system software development and supply, quantum information and communications, data base and internet website, and digital contents sourcing services; manufactures and sells e-book; sells and trades in anti-theft and surveillance devices; and operates information and communications facilities. As of December 31, 2020, the company had 3.8 million fixed-line telephone and 31.4 million wireless subscribers. The company was incorporated in 1984 and is headquartered in Seoul, South Korea.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "04539",
        "website": "http://www.sktelecom.com",
        "market_cap": 17482229760
    },
    "KT": {
        "short_name": "KT Corporation",
        "long_name": "KT Corporation",
        "summary": "KT Corporation provides integrated telecommunications and platform services in Korea and internationally. The company offers fixed-line telephone services, including local, domestic long-distance, international long-distance, and voice over Internet protocol telephone services, as well as interconnection services; broadband Internet access service and other Internet-related services; and data communication services, such as fixed-line and leased line services, as well as broadband Internet connection services. It also provides media and content services, including IPTV, satellite TV, digital music, e-commerce, online advertising consulting, and digital comics and novels services; and credit card processing and other financial services. In addition, the company offers information technology and network services, and satellite services; sells handsets and miscellaneous telecommunications equipment; develops and sells residential units and commercial real estate; and rents real estate properties. Further, it maintains public telephones; offers security, B2C and B2B, investment fund, software development and data processing, value added network, system integration and maintenance, mobile marketing, PCS distribution, satellite broadcasting, cloud system implementation, network installation and management, and data center development and related services. Additionally, the company is involved in the Internet banking ASP and security solutions, residential building development and supply, sports group management, technology business finance, software development and supply, submarine cable construction and maintenance, and trunk radio systems businesses. As of December 31, 2020, the company served approximately 22.3 million mobile subscribers and 8.8 million IPTV subscribers. The company was formerly known as Korea Telecom Corp. and changed its name to KT Corporation in March 2002. KT Corporation was founded in 1981 and is headquartered in Seongnam, South Korea.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "South Korea",
        "state": null,
        "city": "Seongnam",
        "zipcode": "13606",
        "website": "http://www.kt.com",
        "market_cap": 7071135744
    },
    "KTC.F": {
        "short_name": "KT CORP. ADR 1/2/SW 5000",
        "long_name": "KT Corporation",
        "summary": "KT Corporation provides integrated telecommunications and platform services in Korea and internationally. The company offers fixed-line telephone services, including local, domestic long-distance, international long-distance, and voice over Internet protocol telephone services, as well as interconnection services; broadband Internet access service and other Internet-related services; and data communication services, such as fixed-line and leased line services, as well as broadband Internet connection services. It also provides media and content services, including IPTV, satellite TV, digital music, e-commerce, online advertising consulting, and digital comics and novels services; and credit card processing and other financial services. In addition, the company offers information technology and network services, and satellite services; sells handsets and miscellaneous telecommunications equipment; develops and sells residential units and commercial real estate; and rents real estate properties. Further, it maintains public telephones; offers security, B2C and B2B, investment fund, software development and data processing, value added network, system integration and maintenance, mobile marketing, PCS distribution, satellite broadcasting, cloud system implementation, network installation and management, and data center development and related services. Additionally, the company is involved in the Internet banking ASP and security solutions, residential building development and supply, sports group management, technology business finance, software development and supply, submarine cable construction and maintenance, and trunk radio systems businesses. As of December 31, 2020, the company served approximately 22.3 million mobile subscribers and 8.8 million IPTV subscribers. The company was formerly known as Korea Telecom Corp. and changed its name to KT Corporation in March 2002. KT Corporation was founded in 1981 and is headquartered in Seongnam, South Korea.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seongnam",
        "zipcode": "13606",
        "website": "http://www.kt.com",
        "market_cap": 6008622080
    },
    "SKM": {
        "short_name": "SK Telecom Co., Ltd.",
        "long_name": "SK Telecom Co.,Ltd",
        "summary": "SK Telecom Co., Ltd. provides wireless telecommunication services in South Korea and internationally. The Cellular Services segment offers wireless voice and data transmission, cellular global roaming, interconnection, Internet of Things, and platform services, as well as sells smartphones, basic phones, tablets and other Internet access devices, and wearable devices. The Fixed-Line Telecommunication Services segment provides local, domestic and international long distance, and voice over Internet protocol services; broadband Internet access; Internet protocol TV and mobile over-the-top; and leased line solutions, Internet data center, and network solution services. The Commerce Services segment operates 11st, an online open marketplace; and T-commerce network that offer assortment of goods and services through pre-recorded television programming. The Other Businesses segment provides marketing platform services, such as Syrup Wallet, a mobile wallet service; OK Cashbag, a loyalty points program; and One Store, a mobile application marketplace. The Security Services segment offers physical security services, which includes centralized monitoring system; information security solutions, such as information security consulting, managed security, and cyber threat intelligence solutions; and operates parking management and security solutions business. In addition, it offers call center management, base station maintenance, information gathering and consulting, system software development and supply, quantum information and communications, data base and internet website, and digital contents sourcing services; manufactures and sells e-book; sells and trades in anti-theft and surveillance devices; and operates information and communications facilities. As of December 31, 2020, the company had 3.8 million fixed-line telephone and 31.4 million wireless subscribers. The company was incorporated in 1984 and is headquartered in Seoul, South Korea.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "04539",
        "website": "http://www.sktelecom.com",
        "market_cap": 19748001792
    }
}