{
    "001560.KS": {
        "short_name": "CHEILGRINDING",
        "long_name": "Cheil Grinding Wheel Ind. Co., Ltd.",
        "summary": "Cheil Grinding Wheel Ind. Co., Ltd. manufactures and sells grinding wheel products for industrial grinding, cutting, and finishing applications. The company's products include resin bonded abrasive wheels, such as reinforced cut-off, mini cut-off, circular saw, chopsaw, stationary machine saw, high speed gas/electric saw, non-reinforced cut-off, depressed center, flexible grinding, resin bonded snagging, heavy duty snagging, and roll grinding wheels; and vitrified bonded abrasive wheels comprise general purpose, surface grinding, cylindrical grinding, tool room, mounted point, centerless grinding, crankshaft grinding, and camshaft grinding wheels. Its products also consist of CBN/diamond grinding wheels; rubber regulating abrasive wheels; magnesia and epoxy wheels/discs; mold stones; honing stones; super finishing stones; internal grinding wheels; and barrel stones. The company offers its products through distributors in Asia, the Middle East, Oceania, Canada, the United States, Central and South America, Europe, and Africa. Cheil Grinding Wheel Ind. Co., Ltd. was founded in 1955 and is headquartered in Pohang, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Pohang",
        "zipcode": null,
        "website": "http://www.grinding.co.kr",
        "full_time_employees": null
    },
    "012200.KS": {
        "short_name": "KeyangElecMach",
        "long_name": "Keyang Electric Machinery Co., Ltd.",
        "summary": "Keyang Electric Machinery Co., Ltd. manufactures and sells electric power tools in Korea and internationally. Its electric power tools include cordless tools, grinders, hammers, drills, and cutting tools, as well as other tools, such as planers, routers, trimmers, sanders, polishers, reciprocating saws, impact wrenches, blowers, drywall screwdrivers, and heat guns. The company also provides industrial tools, such as compressors, air trackers, welding machines, thawing machines, washers, vacuum cleaners, and measuring instruments; and engine products, including 4 cycle engines, grass cutters, engine saws and trimmers, spreaders and sprayers, blowers, and generators and water pumps, as well as accessories. In addition, it offers automotive products, such as power seat; steering column motors; electric parking brakes; powertrain; and other products. Further, the company provides short-range transportation vehicles, including electric scooters and bicycles. Keyang Electric Machinery Co., Ltd. was founded in 1977 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.keyang.com",
        "full_time_employees": null
    },
    "012205.KS": {
        "short_name": "KeyangElecMach(1P)",
        "long_name": "Keyang Electric Machinery Co., Ltd.",
        "summary": "Keyang Electric Machinery Co., Ltd. manufactures and sells electric power tools in Korea and internationally. Its electric power tools include cordless tools, grinders, hammers, drills, and cutting tools, as well as other tools, such as planers, routers, trimmers, sanders, polishers, reciprocating saws, impact wrenches, blowers, drywall screwdrivers, and heat guns. The company also provides industrial tools, such as compressors, air trackers, welding machines, thawing machines, washers, vacuum cleaners, and measuring instruments; and engine products, including 4 cycle engines, grass cutters, engine saws and trimmers, spreaders and sprayers, blowers, and generators and water pumps, as well as accessories. In addition, it offers automotive products, such as power seat; steering column motors; electric parking brakes; powertrain; and other products. Further, the company provides short-range transportation vehicles, including electric scooters and bicycles. Keyang Electric Machinery Co., Ltd. was founded in 1977 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.keyang.com",
        "full_time_employees": null
    },
    "081000.KS": {
        "short_name": "ILJIN DIAMOND",
        "long_name": "Iljin Diamond Co. Ltd.",
        "summary": "Iljin Diamond Co., Ltd. manufactures and sells tool materials in South Korea, the United States, Europe, Japan, China, and internationally. It offers ILJIN polycrystalline diamond, a material used for cutting tools; ILJIN polycrystalline cubic boron nitride, a material used for cutting tools; ILJIN synthetic diamond for use in saw blades, cutters, core drill bits, etc.; and ILJIN premium synthetic diamond for use in mining bits and multi-wires to cut granite applications. The company also provides ILJIN metal bond diamond for the processing of nonferrous materials; ILJIN resin and vitrified bond diamond, a synthetic diamond that is used to process nonferrous materials; ILJIN micron powder, a micron-sized synthetic diamond and CBN powder that are used in manufacturing processes, such as grinding, polishing, and finishing in various industries, such as electronics, semiconductors, and automobiles; and shape reformed diamond. In addition, it offers ILJIN CBN powder, a material for processing various metallic materials comprising super-alloy, bearing steel, and heat-treated steel; tungsten carbide rod used in various processes of work piece materials in the fields of automobile, aircraft, energy, IT, and medicine; tungsten carbide roll and diamond wire that are used to cut solar cell silicon, LED sapphire, and the glass for mobile phone screens; and polycrystalline diamond compact products. The company was founded in 1985 and is based in Seoul, South Korea. Iljin Diamond Co., Ltd. is a subsidiary of ILJIN Holdings Co., Ltd.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.iljindiamond.com",
        "full_time_employees": null
    },
    "120030.KS": {
        "short_name": "CHOSUN WELDING",
        "long_name": "CHOSUN WELDING POHANG Co., Ltd",
        "summary": "CHOSUN WELDING POHANG Co., Ltd produces and sells welding materials in Korea. It offers covered arc welding electrodes, stick electrodes, submerged arc materials, and solid wires, as well as Mag wires for use in carbon dioxide gas arc welding applications. The company was founded in 1949 and is headquartered in Pohang, South Korea. CHOSUN WELDING POHANG Co., Ltd is a subsidiary of CS Holdings Co., Ltd.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Pohang",
        "zipcode": null,
        "website": "http://www.chosunwelding.com/en/company/affiliate/Introduce.asp",
        "full_time_employees": null
    }
}