{"AALLON.HE": {"short_name": "Aallon Group Oyj", "long_name": "Aallon Group Oyj", "summary": "Aallon Group Oyj provides accounting services to companies operating in Finland. It offers day-to-day financial management services from accounting to payroll, in digital and monthly invoicing services; tax advice, legal, employment counseling, and business advisory services; financial management services; and specialized industry solutions to the IT industry, venture capital companies, foundations, construction, and real estate companies. Aallon Group Oyj is based in Helsinki, Finland.", "currency": "EUR", "sector": "Industrials", "industry": "Specialty Business Services", "exchange": "HEL", "market": "fi_market", "country": "Finland", "city": "Helsinki"}, "C7O.F": {"short_name": "CAVERION OYJ. O.N.", "long_name": "Caverion Oyj", "summary": "Caverion Oyj, together with its subsidiaries, designs, builds, operates, and maintains technical solutions for buildings, industries, and infrastructures in Northern, Central, and Eastern Europe. The company offers its services in the areas of advisory, design and engineering, project management and execution, technical and industrial maintenance, and managed services. It serves the public sector, various industries, real estate investors and developers, real estate users, and general contractors. Caverion Oyj was founded in 1912 and is headquartered in Vantaa, Finland.", "currency": "EUR", "sector": "Industrials", "industry": "Specialty Business Services", "exchange": "FRA", "market": "dr_market", "country": "Finland", "city": "Vantaa"}, "CAV1V.HE": {"short_name": "Caverion Oyj", "long_name": "Caverion Oyj", "summary": "Caverion Oyj, together with its subsidiaries, designs, builds, operates, and maintains technical solutions for buildings, industries, and infrastructures in Northern, Central, and Eastern Europe. The company offers its services in the areas of advisory, design and engineering, project management and execution, technical and industrial maintenance, and managed services. It serves the public sector, various industries, real estate investors and developers, real estate users, and general contractors. Caverion Oyj was founded in 1912 and is headquartered in Vantaa, Finland.", "currency": "EUR", "sector": "Industrials", "industry": "Specialty Business Services", "exchange": "HEL", "market": "fi_market", "country": "Finland", "city": "Vantaa"}, "TNOM.HE": {"short_name": "Talenom Oyj", "long_name": "Talenom Oyj", "summary": "Talenom Oyj provides accounting and software services for small and medium-sized enterprises in Finland. It offers accounting services, such as bookkeeping, financial performance monitoring, sales invoicing, invoice payment, and payroll accounting services; and taxation, legal, financial, and ownership restructuring services. The company also provides Talenom Online, an electronic financial management Web service; Talenom App, a mobile phone application for delivering accounting documents and travel invoices; Talenom Link, a service that allows transfer of sales invoice information and employee's working hour information to payroll; and partnership solutions. In addition, it prepares business plans for new entrepreneurs and various establishment documents required by relevant authorities; and advices on available financing sources. Talenom Oyj was founded in 1972 and is based in Oulu, Finland.", "currency": "EUR", "sector": "Industrials", "industry": "Specialty Business Services", "exchange": "HEL", "market": "fi_market", "country": "Finland", "city": "Oulu"}}