{
  "AALLON.HE": {
    "city": "Helsinki",
    "country": "Finland",
    "currency": "EUR",
    "exchange": "HEL",
    "industry": "Specialty Business Services",
    "long_name": "Aallon Group Oyj",
    "market": "fi_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "Aallon Group Oyj",
    "state": null,
    "summary": "Aallon Group Oyj provides accounting services to companies operating in Finland. It offers day-to-day financial management services from accounting to payroll, in digital and monthly invoicing services; tax advice, legal, employment counseling, and business advisory services; financial management services; and specialized industry solutions to the IT industry, venture capital companies, foundations, construction, and real estate companies. Aallon Group Oyj is based in Helsinki, Finland.",
    "website": "http://aallongroup.fi",
    "zipcode": "00240"
  },
  "C7O.F": {
    "city": "Vantaa",
    "country": "Finland",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Specialty Business Services",
    "long_name": "Caverion Oyj",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "CAVERION OYJ. O.N.",
    "state": null,
    "summary": "Caverion Oyj, together with its subsidiaries, together with its subsidiaries, operates as a service company in building systems, construction services, and services for industry in Northern, Central, and Eastern Europe. It designs, builds, operates, and maintains technical solutions for buildings and industries. The company provides range of services, including technical maintenance, facility management, smart technologies, advisory, and industrial maintenance services; and delivers building technology projects, such as smart technologies, design and build competence, and integrated life cycle deliveries comprising of maintenance and updates, as well as project management, prefabrication, project planning, and execution. Its services are used in offices and retail properties, housing, public premises, industrial plants and infrastructure, and other places. The company serves the public sector, various industries, real estate investors and developers, real estate users, and general contractors. Caverion Oyj was founded in 1912 and is headquartered in Vantaa, Finland.",
    "website": "http://www.caverion.com",
    "zipcode": "01650"
  },
  "CAV1V.HE": {
    "city": "Vantaa",
    "country": "Finland",
    "currency": "EUR",
    "exchange": "HEL",
    "industry": "Specialty Business Services",
    "long_name": "Caverion Oyj",
    "market": "fi_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Caverion Oyj",
    "state": null,
    "summary": "Caverion Oyj, together with its subsidiaries, together with its subsidiaries, operates as a service company in building systems, construction services, and services for industry in Northern, Central, and Eastern Europe. It designs, builds, operates, and maintains technical solutions for buildings and industries. The company provides range of services, including technical maintenance, facility management, smart technologies, advisory, and industrial maintenance services; and delivers building technology projects, such as smart technologies, design and build competence, and integrated life cycle deliveries comprising of maintenance and updates, as well as project management, prefabrication, project planning, and execution. Its services are used in offices and retail properties, housing, public premises, industrial plants and infrastructure, and other places. The company serves the public sector, various industries, real estate investors and developers, real estate users, and general contractors. Caverion Oyj was founded in 1912 and is headquartered in Vantaa, Finland.",
    "website": "http://www.caverion.com",
    "zipcode": "01650"
  },
  "PNA1V.HE": {
    "city": "Tampere",
    "country": "Finland",
    "currency": "EUR",
    "exchange": "HEL",
    "industry": "Specialty Business Services",
    "long_name": "Panostaja Oyj",
    "market": "fi_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "Panostaja Oyj",
    "state": null,
    "summary": "Panostaja Oyj is a private equity firm specializing in investments in expansions through corporate acquisitions, industry consolidations, and mature and middle market investments in small and medium-sized companies through acquisitions in sectors undergoing growth and restructuring. It focuses on those companies, which seek to execute a generational or majority owner. The firm invests in diverse sectors with a focus on communications, computer related and environmental technology, forest industry, energy, transportation, agriculture and tourism. The firm prefers to invest in Finland. It invests in companies with enterprise values between 5 million ($5.53 million) and 25 million ($27.65 million) and net sales between EUR 10 million ($11.06 million) and 30 million ($33.18 million). The firm takes majority stakes or buys the companies in entirety and exits the investments within five to ten years. The firm typically invests through balance sheet. Panostaja Oyj was founed in 1984 and is located in Tampere, Finland with an additional office in Central Finland, Finland.",
    "website": "http://www.panostaja.fi",
    "zipcode": "33100"
  },
  "RUSH.HE": {
    "city": "Rauma",
    "country": "Finland",
    "currency": "EUR",
    "exchange": "HEL",
    "industry": "Specialty Business Services",
    "long_name": "Rush Factory Oyj",
    "market": "fi_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "Rush Factory Plc",
    "state": null,
    "summary": "Rush Factory Oyj develops and conducts consumer-oriented sports and adventure events in Europe. The company is based in Rauma, Finland.",
    "website": "http://rushfactory.fi",
    "zipcode": "26100"
  },
  "TNOM.HE": {
    "city": "Oulu",
    "country": "Finland",
    "currency": "EUR",
    "exchange": "HEL",
    "industry": "Specialty Business Services",
    "long_name": "Talenom Oyj",
    "market": "fi_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Talenom Oyj",
    "state": null,
    "summary": "Talenom Oyj provides accounting and software services for small and medium-sized enterprises in Finland. It offers accounting services, such as bookkeeping, financial performance monitoring, sales invoicing, invoice payment, and payroll accounting services; and taxation, legal, financial, and ownership restructuring services. The company also provides Talenom Online, an electronic financial management Web service; Talenom App, a mobile phone application for delivering accounting documents and travel invoices; Talenom Link, a service that allows transfer of sales invoice information and employee's working hour information to payroll; and partnership solutions. In addition, it prepares business plans for new entrepreneurs and various establishment documents required by relevant authorities. Further, the company offers invoice and instalment financing services; corporate loans; mergers and acquisitions, law, finance, tax, and personal advisory services for entrepreneurs; and digital services for financial management. Talenom Oyj was founded in 1972 and is based in Oulu, Finland.",
    "website": "http://www.talenom.fi",
    "zipcode": "90230"
  }
}
