{
  "AYAAF": {
    "city": "Makati City",
    "country": "Philippines",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Ayala Land, Inc.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Real Estate",
    "short_name": "AYALA LAND INC",
    "state": null,
    "summary": "Ayala Land, Inc. operates as a property developer in the Philippines. It operates through Property Developments, International, Shopping Centers, Offices, Hotels and Resorts, Construction, and Property Management and Others segments. The company sells high-end and upper middle-income residential lots and units, affordable housing units and lots, and economic housing and leisure community developments; leases residential developments under joint venture; acquires, develops, and sells large-scale, mixed-use, and planned communities; and sells override units. It also develops shopping centers, and leases retail space and land to third parties; operates movie theaters, food courts, entertainment facilities, gas stations, and car parking in shopping centers; manages and operates malls; develops, leases, and sells office buildings; and sells industrial lots and leases factory building. In addition, it engages in the development and management of hotels and resorts/serviced apartments; leasing of land to hotel tenants; and land development and construction, and facilities management activities. The company was incorporated in 1988 and is based in Makati City, the Philippines.",
    "website": "http://www.ayalaland.com.ph",
    "zipcode": "1226"
  },
  "MGAWY": {
    "city": "Taguig City",
    "country": "Philippines",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Megaworld Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Real Estate",
    "short_name": "MEGAWORLD CORP",
    "state": null,
    "summary": "Megaworld Corporation, together with its subsidiaries, develops, markets, and leases real estate properties in the Philippines. The company operates through Real Estate, Rental, Hotel Operations, and Corporate and Others segments. It develops mixed-use planned communities or townships, including residential, commercial, office, leisure, entertainment, and educational/training components. The company's real estate portfolio comprises residential condominium units, subdivision lots and townhouses, and condominium-hotel projects, as well as office projects and retail spaces. It is also involved in the lease of office and retail spaces; and property-related activities, such as project design, construction oversight, and property management, as well as provision of business process outsourcing, educational facilities, restaurants, cafes, cocktail bars, lounges, inns, apartments, private clubs, and other related businesses. In addition, it owns, leases, and manages hotels. The company was formerly known as Megaworld Properties & Holdings, Inc. and changed its name to Megaworld Corporation in August 1999. The company was incorporated in 1989 and is based in Taguig, the Philippines. Megaworld Corporation is a subsidiary of Alliance Global Group, Inc.",
    "website": "http://www.megaworldcorp.com",
    "zipcode": "1634"
  },
  "RBLAY": {
    "city": "Quezon City",
    "country": "Philippines",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Robinsons Land Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "ROBINSON'S LAND CORP",
    "state": null,
    "summary": "Robinsons Land Corporation, together with its subsidiaries, acquires, develops, operates, leases, disposes, and sells real properties in the Philippines. It operates through Commercial Centers Division, Residential Division, Office Buildings Division, Hotels and Resorts Division, and Industrial and Integrated Developments Division. The company is also involved in the development and sale of residential condominium units, as well as horizontal residential projects; and development and leasing of office spaces; ownership and operation of a chain of hotels. In addition, it develops, leases, and manages shopping malls/commercial centers; explores real estate-related infrastructure projects; and develops and leases warehouse and logistics facilities, as well as focuses on strategic land bank acquisition and management. The company was incorporated in 1980 and is headquartered in Quezon City, the Philippines. Robinsons Land Corporation is a subsidiary of JG Summit Holdings, Inc.",
    "website": "http://www.robinsonsland.com",
    "zipcode": "1100"
  }
}
