{"0V6.F": {"short_name": "VISTRA CORP.  DL-,01", "long_name": "Vistra Corp.", "summary": "Vistra Corp., through its subsidiaries, engages in the electricity business in the United States. It operates through Retail, ERCOT, PJM, NY/NE, MISO, and Asset Closure segments. The company retails electricity and natural gas to residential, commercial and industrial customers across 20 states in the United States. It is also involved in the electricity generation, wholesale energy sales and purchases, commodity risk management, fuel production, and fuel logistics management activities. The company serves approximately 4.6 million residential, commercial, and industrial customers. It has a production capacity of approximately 38,500 megawatts with a portfolio of natural gas, nuclear, coal, solar, and battery energy storage facilities. The company was formerly known as Vistra Energy Corp. and changed its name to Vistra Corp. in July 2020. Vistra Corp. was founded in 1882 and is based in Irving, Texas.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Independent Power Producers", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Irving"}, "12A.F": {"short_name": "AVANGRID INC. DL-,01", "long_name": "Avangrid, Inc.", "summary": "Avangrid, Inc. operates as an energy services holding company in the United States. It operates through two segments, Networks and Renewables. The company engages in the generation, transmission, and distribution of electricity, as well as distribution, transportation, and sale of natural gas. It also develops, constructs, and operates renewable energy generation facilities primarily using onshore wind power, as well as solar, biomass, and thermal power. The company delivers natural gas and electricity to residential, commercial, and institutional customers through its regulated utilities in New York, Maine, Connecticut, and Massachusetts; and sells its output to investor-owned utilities, public utilities, and other credit-worthy entities. In addition, it generates and provides power and other services to federal and state agencies, as well as institutional retail and joint action agencies; and delivers thermal output to wholesale customers in the Western United States. Avangrid, Inc. owns eight electric and natural gas utilities, serving 3.3 million customers in New York and New England, as well as owns and operates 8.0 gigawatts of electricity capacity, primarily through wind power in 22 states. The company was founded in 1852 and is headquartered in Orange, Connecticut. Avangrid, Inc. is a subsidiary of Iberdrola, S.A.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Orange"}, "2ZC.F": {"short_name": "CADIZ INC.", "long_name": "Cadiz Inc.", "summary": "Cadiz Inc. operates as a natural resources development company in the United States. It engages in the water resource and agricultural development activities in San Bernardino County properties. The company owns approximately 35,000 acres of land in the Cadiz and Fenner valleys of eastern San Bernardino County; and approximately 11,000 acres of land in the eastern Mojave Desert portion of San Bernardino County. It is also involved in the cultivation of lemons and grapes/raisins, and spring and fall plantings of vegetables on the Cadiz Valley properties. Cadiz Inc. was founded in 1983 and is headquartered in Los Angeles, California.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Los Angeles"}, "3U6.F": {"short_name": "UGI CORP.", "long_name": "UGI Corporation", "summary": "UGI Corporation distributes, stores, transports, and markets energy products and related services in the United States and internationally. The company operates through four segments: AmeriGas Propane, UGI International, Midstream & Marketing, and UGI Utilities. It distributes propane to approximately 1.5 million residential, commercial/industrial, motor fuel, agricultural, and wholesale customers through 1,800 propane distribution locations; and sells, installs, and services propane appliances, including heating systems and propane-powered generators. The company also distributes liquefied petroleum gases (LPG) to residential, commercial, industrial, agricultural, wholesale and automobile fuel customers; and provides logistics, storage, and other services to third-party LPG distributors. In addition, it engages in the retail sale of natural gas, liquid fuels, and electricity to approximately 14,000 residential, commercial, and industrial customers at 45,000 locations. Further, the company distributes natural gas to approximately 670,000 customers in the portions of 46 eastern and central Pennsylvania counties through its distribution system of 12,300 miles of gas mains; and supplies electricity to approximately 62,500 customers in northeastern Pennsylvania through 2,500 miles of lines and 14 substations. Additionally, it operates electric generation facilities, which include coal-fired, landfill gas-fueled, solar-powered, and natural gas-fueled facilities; a natural gas liquefaction, storage, and vaporization facility; propane storage and propane-air mixing stations; and rail transshipment terminals. It also manages natural gas pipeline and storage contracts; develops, owns, and operates pipelines, gathering infrastructure, and gas storage facilities. UGI Corporation was founded in 1882 and is headquartered in King of Prussia, Pennsylvania.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "King of Prussia"}, "49P.F": {"short_name": "PORTLAND GEN.ELEC.CO. NEW", "long_name": "Portland General Electric Company", "summary": "Portland General Electric Company, an integrated electric utility company, engages in the generation, wholesale purchase, transmission, distribution, and retail sale of electricity in the state of Oregon. The company operates seven thermal plants; seven hydroelectric plants; and two wind farms. As of December 31, 2019, it owned an electric transmission system consisting of 1,264 circuit miles, including 287 circuit miles of 500 kilovolt line, 423 circuit miles of 230 kilovolt line, and 554 miles of 115 kilovolt line. The company has 27,755 circuit miles of distribution lines. It also purchases and sells wholesale natural gas in the United States and Canada. The company serves approximately 895,000 residential, commercial, and industrial customers in 51 cities. Portland General Electric Company was founded in 1889 and is headquartered in Portland, Oregon.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Portland"}, "6GE.F": {"short_name": "GENIE ENERGY LTD B DL-,01", "long_name": "Genie Energy Ltd.", "summary": "Genie Energy Ltd., through its subsidiaries, operates as a retail energy provider, and an oil and gas exploration company. The company operates through four segments: Genie Retail Energy (GRE); GRE International; Genie Energy Services; and Genie Oil and Gas, Inc. It resells electricity and natural gas to residential and small business customers primarily in the Eastern and Midwestern United States, as well as in the United Kingdom, Japan, and Finland. The company also engages in the provision of energy advisory and brokerage services; and solar panel manufacturing, and solar installation design and project management activities. In addition, it holds an 86.1% interest in the southern portion of the Golan Heights in Northern Israel, as well as owns an interest in a contracted drilling services operation. Genie Energy Ltd. is headquartered in Newark, New Jersey.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Newark"}, "76W.SG": {"short_name": "SJW Group Registered Shares DL ", "long_name": "SJW Group", "summary": "SJW Group, through its subsidiaries, provides water utility services in the United States. It engages in the production, purchase, storage, purification, distribution, wholesale, and retail sale of water and wastewater services. The company also provides non-tariffed services, including water system operations, maintenance agreements, and antenna site leases; contracted services and sewer operations to water utilities in Connecticut; and a Linebacker, subscription service line protection plan for public drinking water customers, as well as offers repair or replace a leaking or broken water service line, curb box, curb box cover, meter pit, meter pit cover, and meter pit valve. Its water supply consists of groundwater from wells, surface water from watershed run-off and diversion, reclaimed water, and imported water purchased from the Santa Clara Valley Water District. The company offers water service to approximately 231,000 connections that serve approximately one million people residing in portions of the cities of San Jose and Cupertino, as well as in the cities of Campbell, Monte Sereno, Saratoga, and the Town of Los Gatos; and adjacent unincorporated territories in the County of Santa Clara in the State of California. In addition, it provides water service to approximately 18,000 connections, which serve 54,000 people in a service area comprising 246 square miles in the region between San Antonio and Austin, Texas; and 137,000 connections that serve approximately 480,000 people in 80 municipalities in Connecticut and Maine, and approximately 3,000 wastewater connections in Southbury, Connecticut. Further, the company owns undeveloped land in California and Tennessee; and owns and operates commercial buildings and warehouse properties in Tennessee. The company was formerly known as SJW Corp. and changed its name to SJW Group in November 2016. SJW Group was founded in 1866 and is headquartered in San Jose, California.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "STU", "market": "dr_market", "country": "United States", "city": "San Jose"}, "98P.DE": {"short_name": "PNM RESOURCES INC.", "long_name": "PNM Resources, Inc.", "summary": "PNM Resources, Inc., through its subsidiaries, engages in the energy and energy-related businesses in the United States. It operates through Public Service Company of New Mexico (PNM) and Texas-New Mexico Power Company (TNMP) segments. The PNM segment is primarily involved in the generation, transmission, and distribution of electricity. It generates electricity using coal, natural gas and oil, nuclear fuel, solar, wind, and geothermal energy sources. As of December 31, 2018, this segment had owned or leased facilities with a total net generation capacity of 2,102 megawatts; and owned 3,206 miles of electric transmission lines, 6,067 miles of distribution overhead lines, 5,885 miles of underground distribution lines, and 255 substations. It also owns and leases office and other equipment, office space, vehicles, and real estate. The TNMP segment provides regulated transmission and distribution services. As of December 31, 2018, this segment owned 997 miles of overhead electric transmission lines, 7,151 miles of overhead distribution lines, 1,260 miles of underground distribution lines, and 122 substations. It also owns and leases vehicles, service facilities, and office locations throughout its service territory. The company serves approximately 782,000 residential, commercial, and industrial customers, as well as end-users of electricity in New Mexico and Texas. PNM Resources, Inc. was founded in 1917 and is headquartered in Albuquerque, New Mexico.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "GER", "market": "de_market", "country": "United States", "city": "Albuquerque"}, "98P.F": {"short_name": "PNM RESOURCES INC.", "long_name": "PNM Resources, Inc.", "summary": "PNM Resources, Inc., through its subsidiaries, engages in the energy and energy-related businesses in the United States. It operates through Public Service Company of New Mexico (PNM) and Texas-New Mexico Power Company (TNMP) segments. The PNM segment is primarily involved in the generation, transmission, and distribution of electricity. It generates electricity using coal, natural gas and oil, nuclear fuel, solar, wind, and geothermal energy sources. As of December 31, 2018, this segment had owned or leased facilities with a total net generation capacity of 2,102 megawatts; and owned 3,206 miles of electric transmission lines, 6,067 miles of distribution overhead lines, 5,885 miles of underground distribution lines, and 255 substations. It also owns and leases office and other equipment, office space, vehicles, and real estate. The TNMP segment provides regulated transmission and distribution services. As of December 31, 2018, this segment owned 997 miles of overhead electric transmission lines, 7,151 miles of overhead distribution lines, 1,260 miles of underground distribution lines, and 122 substations. It also owns and leases vehicles, service facilities, and office locations throughout its service territory. The company serves approximately 782,000 residential, commercial, and industrial customers, as well as end-users of electricity in New Mexico and Texas. PNM Resources, Inc. was founded in 1917 and is headquartered in Albuquerque, New Mexico.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Albuquerque"}, "A1TM34.SA": {"short_name": "ATMOS ENERGYDRN", "long_name": "Atmos Energy Corporation", "summary": "Atmos Energy Corporation, together with its subsidiaries, engages in the regulated natural gas distribution, and pipeline and storage businesses in the United States. It operates in two segments, Distribution, and Pipeline and Storage. The Distribution segment is involved in the regulated natural gas distribution and related sales operations in eight states. This segment distributes natural gas to approximately three million residential, commercial, public authority, and industrial customers. As of September 30, 2020, it owned 71,558 miles of underground distribution and transmission mains. The Pipeline and Storage segment engages in the pipeline and storage operations. This segment transports natural gas for third parties and manages five underground storage reservoirs in Texas; and provides ancillary services to the pipeline industry, including parking arrangements, lending, and inventory sales. As of September 30, 2020, it owned 5,684 miles of gas transmission lines. Atmos Energy Corporation was founded in 1906 and is headquartered in Dallas, Texas.", "currency": "BRL", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "SAO", "market": "br_market", "country": "United States", "city": "Dallas"}, "AEBA.F": {"short_name": "ALLETE INC. NEW", "long_name": "ALLETE, Inc.", "summary": "ALLETE, Inc. operates as an energy company. The company operates through Regulated Operations, ALLETE Clean Energy, and Corporate and Other segments. It generates electricity from coal-fired, hydroelectric, natural gas-fired, biomass co-fired, and solar. The company provides regulated utility electric service in northeastern Minnesota to approximately 145,000 retail customers, as well as 15 non-affiliated municipal customers; and regulated utility electric, natural gas, and water services in northwestern Wisconsin to approximately 15,000 electric customers, 13,000 natural gas customers, and 10,000 water customers. It also owns and maintains electric transmission assets in Wisconsin, Michigan, Minnesota, and Illinois. In addition, the company focuses on developing, acquiring, and operating clean and renewable energy projects; and owns and operates approximately 660 megawatt of wind energy generation. Further, it is involved in the coal mining operations in North Dakota; and real estate investment activities in Florida. The company owns and operates 158 substations with a total capacity of 8,875 megavoltamperes. The company was formerly known as Minnesota Power, Inc. and changed its name to ALLETE, Inc. in May 2001. ALLETE, Inc. was incorporated in 1906 and is headquartered in Duluth, Minnesota.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Duluth"}, "AEE": {"short_name": "Ameren Corporation", "long_name": "Ameren Corporation", "summary": "Ameren Corporation, together with its subsidiaries, operates as a public utility holding company in the United States. It operates through four segments: Ameren Missouri, Ameren Illinois Electric Distribution, Ameren Illinois Natural Gas, and Ameren Transmission. The company engages in the rate-regulated electric generation, transmission, and distribution activities; and rate-regulated natural gas distribution and transmission businesses. It primarily generates electricity through coal, nuclear, and natural gas, as well as renewable sources, such as hydroelectric, methane gas, and solar. The company serves residential, commercial, and industrial customers. As of September 28, 2020, it served approximately 2.4 million electric customers and approximately 900,000 natural gas customers. The company was founded in 1881 and is headquartered in St. Louis, Missouri.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "St. Louis"}, "AEO.F": {"short_name": "ATMOS EN. CORP.", "long_name": "Atmos Energy Corporation", "summary": "Atmos Energy Corporation, together with its subsidiaries, engages in the regulated natural gas distribution, and pipeline and storage businesses in the United States. It operates in two segments, Distribution, and Pipeline and Storage. The Distribution segment is involved in the regulated natural gas distribution and related sales operations in eight states. This segment distributes natural gas to approximately three million residential, commercial, public authority, and industrial customers. As of September 30, 2020, it owned 71,558 miles of underground distribution and transmission mains. The Pipeline and Storage segment engages in the pipeline and storage operations. This segment transports natural gas for third parties and manages five underground storage reservoirs in Texas; and provides ancillary services to the pipeline industry, including parking arrangements, lending, and inventory sales. As of September 30, 2020, it owned 5,684 miles of gas transmission lines. Atmos Energy Corporation was founded in 1906 and is headquartered in Dallas, Texas.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Dallas"}, "AEP": {"short_name": "American Electric Power Company", "long_name": "American Electric Power Company, Inc.", "summary": "American Electric Power Company, Inc., an electric public utility holding company, engages in the generation, transmission, and distribution of electricity for sale to retail and wholesale customers in the United States. It operates through Vertically Integrated Utilities, Transmission and Distribution Utilities, AEP Transmission Holdco, and Generation & Marketing segments. The company generates electricity using coal and lignite, natural gas, nuclear, and hydroelectric, as well as solar, wind, and other energy sources. It also supplies and markets electric power at wholesale to other electric utility companies, rural electric cooperatives, municipalities, and other market participants. The company owns, leases, or controls approximately 4,004 railcars, 468 barges, 8 towboats, and a coal handling terminal with approximately 18 million tons of annual capacity. American Electric Power Company, Inc. was founded in 1906 and is headquartered in Columbus, Ohio.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Columbus"}, "AEPC.VI": {"short_name": "AMERICAN ELECTRIC POWER CORP", "long_name": "American Electric Power Company, Inc.", "summary": "American Electric Power Company, Inc., an electric public utility holding company, engages in the generation, transmission, and distribution of electricity for sale to retail and wholesale customers in the United States. It operates through Vertically Integrated Utilities, Transmission and Distribution Utilities, AEP Transmission Holdco, and Generation & Marketing segments. The company generates electricity using coal and lignite, natural gas, nuclear, and hydroelectric, as well as solar, wind, and other energy sources. It also supplies and markets electric power at wholesale to other electric utility companies, rural electric cooperatives, municipalities, and other market participants. The company owns, leases, or controls approximately 4,004 railcars, 468 barges, 8 towboats, and a coal handling terminal with approximately 18 million tons of annual capacity. American Electric Power Company, Inc. was founded in 1906 and is headquartered in Columbus, Ohio.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "VIE", "market": "at_market", "country": "United States", "city": "Columbus"}, "AEPPZ": {"short_name": "American Electric Power Company", "long_name": "American Electric Power Company, Inc.", "summary": "American Electric Power Company, Inc., an electric public utility holding company, engages in the generation, transmission, and distribution of electricity for sale to retail and wholesale customers in the United States. It operates through Vertically Integrated Utilities, Transmission and Distribution Utilities, AEP Transmission Holdco, and Generation & Marketing segments. The company generates electricity using coal and lignite, natural gas, nuclear, and hydroelectric, as well as solar, wind, and other energy sources. It also supplies and markets electric power at wholesale to other electric utility companies, rural electric cooperatives, municipalities, and other market participants. The company owns, leases, or controls approximately 4,004 railcars, 468 barges, 8 towboats, and a coal handling terminal with approximately 18 million tons of annual capacity. American Electric Power Company, Inc. was founded in 1906 and is headquartered in Columbus, Ohio.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Columbus"}, "AEPT": {"short_name": "AMERICAN ENERGY PARTNERS INC", "long_name": "American Energy Partners, Inc.", "summary": "American Energy Partners, Inc., through its subsidiaries, sources, treats, and distributes reclaimed water in the United States. The company engages in the design, construction, and operation of regional water treatment facilities that serve industrial, energy, and government sectors. It also focuses on drilling, operating, and partnership opportunities in the upstream oil and gas space. It also provides geotechnical services. The company is based in Allentown, Pennsylvania.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Allentown"}, "AES": {"short_name": "The AES Corporation", "long_name": "The AES Corporation", "summary": "The AES Corporation operates as a diversified power generation and utility company. It owns and/or operates power plants to generate and sell power to customers, such as utilities, industrial users, and other intermediaries. The company also owns and/or operates utilities to generate or purchase, distribute, transmit, and sell electricity to end-user customers in the residential, commercial, industrial, and governmental sectors; and generates and sells electricity on the wholesale market. It uses a range of fuels and technologies to generate electricity, including natural gas, coal, pet coke, diesel, and oil, as well as renewables, such as hydro, solar, wind, energy storage, biomass, and landfill gas. The company owns and/or operates a generation portfolio of approximately 30,471 megawatts. It has operations in the United States, Puerto Rico, El Salvador, Chile, Colombia, Argentina, Brazil, Mexico, Central America, the Caribbean, Europe, and Asia. The company was formerly known as Applied Energy Services, Inc. and changed its name to The AES Corporation in April 2000. The AES Corporation was founded in 1981 and is headquartered in Arlington, Virginia.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Arlington"}, "AGR": {"short_name": "Avangrid, Inc.", "long_name": "Avangrid, Inc.", "summary": "Avangrid, Inc. operates as an energy services holding company in the United States. It operates through two segments, Networks and Renewables. The company engages in the generation, transmission, and distribution of electricity, as well as distribution, transportation, and sale of natural gas. It also develops, constructs, and operates renewable energy generation facilities primarily using onshore wind power, as well as solar, biomass, and thermal power. The company delivers natural gas and electricity to residential, commercial, and institutional customers through its regulated utilities in New York, Maine, Connecticut, and Massachusetts; and sells its output to investor-owned utilities, public utilities, and other credit-worthy entities. In addition, it generates and provides power and other services to federal and state agencies, as well as institutional retail and joint action agencies; and delivers thermal output to wholesale customers in the Western United States. Avangrid, Inc. owns eight electric and natural gas utilities, serving 3.3 million customers in New York and New England, as well as owns and operates 8.0 gigawatts of electricity capacity, primarily through wind power in 22 states. The company was founded in 1852 and is headquartered in Orange, Connecticut. Avangrid, Inc. is a subsidiary of Iberdrola, S.A.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Orange"}, "AILIH": {"short_name": "AMEREN ILLINOIS CO", "long_name": "Ameren Illinois Company", "summary": "Ameren Illinois Company operates as a regulated electric and gas delivery company in Collinsville, Illinois. The company was formerly known as Central Illinois Public Service Company and changed its name to Ameren Illinois Company in October 2010. Ameren Illinois Company was founded in 1902 and is headquartered in Collinsville, Illinois. Ameren Illinois Company operates as a subsidiary of Ameren Corporation.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Collinsville"}, "AILIM": {"short_name": "AMEREN ILLINOIS CO", "long_name": "Ameren Illinois Company", "summary": "Ameren Illinois Company operates as a regulated electric and gas delivery company in Collinsville, Illinois. The company was formerly known as Central Illinois Public Service Company and changed its name to Ameren Illinois Company in October 2010. Ameren Illinois Company was founded in 1902 and is headquartered in Collinsville, Illinois. Ameren Illinois Company operates as a subsidiary of Ameren Corporation.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Collinsville"}, "AILLI": {"short_name": "AMEREN ILLINOIS CO", "long_name": "Ameren Illinois Company", "summary": "Ameren Illinois Company operates as a regulated electric and gas delivery company in Collinsville, Illinois. The company was formerly known as Central Illinois Public Service Company and changed its name to Ameren Illinois Company in October 2010. Ameren Illinois Company was founded in 1902 and is headquartered in Collinsville, Illinois. Ameren Illinois Company operates as a subsidiary of Ameren Corporation.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Collinsville"}, "AILLL": {"short_name": "AMEREN ILLINOIS CO", "long_name": "Ameren Illinois Company", "summary": "Ameren Illinois Company operates as a regulated electric and gas delivery company in Collinsville, Illinois. The company was formerly known as Central Illinois Public Service Company and changed its name to Ameren Illinois Company in October 2010. Ameren Illinois Company was founded in 1902 and is headquartered in Collinsville, Illinois. Ameren Illinois Company operates as a subsidiary of Ameren Corporation.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Collinsville"}, "AILLN": {"short_name": "AMEREN ILLINOIS CO", "long_name": "Ameren Illinois Company", "summary": "Ameren Illinois Company operates as a regulated electric and gas delivery company in Collinsville, Illinois. The company was formerly known as Central Illinois Public Service Company and changed its name to Ameren Illinois Company in October 2010. Ameren Illinois Company was founded in 1902 and is headquartered in Collinsville, Illinois. Ameren Illinois Company operates as a subsidiary of Ameren Corporation.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Collinsville"}, "AILLO": {"short_name": "AMEREN ILLINOIS CO", "long_name": "Ameren Illinois Company", "summary": "Ameren Illinois Company operates as a regulated electric and gas delivery company in Collinsville, Illinois. The company was formerly known as Central Illinois Public Service Company and changed its name to Ameren Illinois Company in October 2010. Ameren Illinois Company was founded in 1902 and is headquartered in Collinsville, Illinois. Ameren Illinois Company operates as a subsidiary of Ameren Corporation.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Collinsville"}, "ALE": {"short_name": "Allete, Inc.", "long_name": "ALLETE, Inc.", "summary": "ALLETE, Inc. operates as an energy company. The company operates through Regulated Operations, ALLETE Clean Energy, and Corporate and Other segments. It generates electricity from coal-fired, hydroelectric, natural gas-fired, biomass co-fired, and solar. The company provides regulated utility electric service in northeastern Minnesota to approximately 145,000 retail customers, as well as 15 non-affiliated municipal customers; and regulated utility electric, natural gas, and water services in northwestern Wisconsin to approximately 15,000 electric customers, 13,000 natural gas customers, and 10,000 water customers. It also owns and maintains electric transmission assets in Wisconsin, Michigan, Minnesota, and Illinois. In addition, the company focuses on developing, acquiring, and operating clean and renewable energy projects; and owns and operates approximately 660 megawatt of wind energy generation. Further, it is involved in the coal mining operations in North Dakota; and real estate investment activities in Florida. The company owns and operates 158 substations with a total capacity of 8,875 megavoltamperes. The company was formerly known as Minnesota Power, Inc. and changed its name to ALLETE, Inc. in May 2001. ALLETE, Inc. was incorporated in 1906 and is headquartered in Duluth, Minnesota.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Duluth"}, "ALP-PQ": {"short_name": "Alabama Power Company 5.00%", "long_name": "Alabama Power Company", "summary": "Alabama Power Company, an integrated utility, generates, purchases, transmits, distributes, and sells electricity to residential, commercial, industrial, and other customers. The company generates electricity through coal, nuclear, gas, and hydro plants. It sells electricity at retail in approximately 400 cities and towns, including Anniston, Birmingham, Gadsden, Mobile, Montgomery, and Tuscaloosa, as well as in rural areas; and at wholesale to 11 municipally-owned electric distribution systems. The company also sells electric appliances and products; and markets and sells outdoor lighting services. It serves retail customers in the State of Alabama, as well as wholesale customers in the Southeast. The company was founded in 1906 and is based in Birmingham, Alabama. Alabama Power Company is a subsidiary of The Southern Company.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Birmingham"}, "APRCP": {"short_name": "ALABAMA POWER CO", "long_name": "Alabama Power Company", "summary": "Alabama Power Company, an integrated utility, generates, purchases, transmits, distributes, and sells electricity to residential, commercial, industrial, and other customers. The company generates electricity through coal, nuclear, gas, and hydro plants. It sells electricity at retail in approximately 400 cities and towns, including Anniston, Birmingham, Gadsden, Mobile, Montgomery, and Tuscaloosa, as well as in rural areas; and at wholesale to 11 municipally-owned electric distribution systems. The company also sells electric appliances and products; and markets and sells outdoor lighting services. It serves retail customers in the State of Alabama, as well as wholesale customers in the Southeast. The company was founded in 1906 and is based in Birmingham, Alabama. Alabama Power Company is a subsidiary of The Southern Company.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Birmingham"}, "APRDM": {"short_name": "ALABAMA POWER CO", "long_name": "Alabama Power Company", "summary": "Alabama Power Company, an integrated utility, generates, purchases, transmits, distributes, and sells electricity to residential, commercial, industrial, and other customers. The company generates electricity through coal, nuclear, gas, and hydro plants. It sells electricity at retail in approximately 400 cities and towns, including Anniston, Birmingham, Gadsden, Mobile, Montgomery, and Tuscaloosa, as well as in rural areas; and at wholesale to 11 municipally-owned electric distribution systems. The company also sells electric appliances and products; and markets and sells outdoor lighting services. It serves retail customers in the State of Alabama, as well as wholesale customers in the Southeast. The company was founded in 1906 and is based in Birmingham, Alabama. Alabama Power Company is a subsidiary of The Southern Company.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Birmingham"}, "APRDN": {"short_name": "ALABAMA POWER CO", "long_name": "Alabama Power Company", "summary": "Alabama Power Company, an integrated utility, generates, purchases, transmits, distributes, and sells electricity to residential, commercial, industrial, and other customers. The company generates electricity through coal, nuclear, gas, and hydro plants. It sells electricity at retail in approximately 400 cities and towns, including Anniston, Birmingham, Gadsden, Mobile, Montgomery, and Tuscaloosa, as well as in rural areas; and at wholesale to 11 municipally-owned electric distribution systems. The company also sells electric appliances and products; and markets and sells outdoor lighting services. It serves retail customers in the State of Alabama, as well as wholesale customers in the Southeast. The company was founded in 1906 and is based in Birmingham, Alabama. Alabama Power Company is a subsidiary of The Southern Company.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Birmingham"}, "APRDO": {"short_name": "ALABAMA POWER CO", "long_name": "Alabama Power Company", "summary": "Alabama Power Company, an integrated utility, generates, purchases, transmits, distributes, and sells electricity to residential, commercial, industrial, and other customers. The company generates electricity through coal, nuclear, gas, and hydro plants. It sells electricity at retail in approximately 400 cities and towns, including Anniston, Birmingham, Gadsden, Mobile, Montgomery, and Tuscaloosa, as well as in rural areas; and at wholesale to 11 municipally-owned electric distribution systems. The company also sells electric appliances and products; and markets and sells outdoor lighting services. It serves retail customers in the State of Alabama, as well as wholesale customers in the Southeast. The company was founded in 1906 and is based in Birmingham, Alabama. Alabama Power Company is a subsidiary of The Southern Company.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Birmingham"}, "APRDP": {"short_name": "ALABAMA POWER CO", "long_name": "Alabama Power Company", "summary": "Alabama Power Company, an integrated utility, generates, purchases, transmits, distributes, and sells electricity to residential, commercial, industrial, and other customers. The company generates electricity through coal, nuclear, gas, and hydro plants. It sells electricity at retail in approximately 400 cities and towns, including Anniston, Birmingham, Gadsden, Mobile, Montgomery, and Tuscaloosa, as well as in rural areas; and at wholesale to 11 municipally-owned electric distribution systems. The company also sells electric appliances and products; and markets and sells outdoor lighting services. It serves retail customers in the State of Alabama, as well as wholesale customers in the Southeast. The company was founded in 1906 and is based in Birmingham, Alabama. Alabama Power Company is a subsidiary of The Southern Company.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Birmingham"}, "ARAO": {"short_name": "AURASOURCE INC", "long_name": "AuraSource, Inc.", "summary": "AuraSource, Inc. focuses on developing and implementing clean energy and mineral processing technologies. It operates through two divisions, AuraMetal and AuraMoto. The company's core technology includes physical separation, hydrometallurgical, and pyrometallurgy processes. Its AuraMetal is a process based on grinding and separation technologies that separate minerals from other ores; and AuraMoto focuses on sourcing various vendors and customers in the automotive industry. The company was founded in 1990 and is based in Tempe, Arizona.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Tempe"}, "ARSC": {"short_name": "AMERICAN SECURITY RESOURCE CORP", "long_name": "Bitcoin Crypto Currency Exchange Corporation", "summary": "Bitcoin Crypto Currency Exchange Corporation, an adopter of blockchain technology, provides mobile payment application. The company intends to offer BitCoinMWallet app, a mobile payment application, which would allow trade and redemption of Bitcoins or other crypto currencies using iOS or Android devices. It also offers KaChing, a smartphone-based payment and money transfer system that allows consumers to purchase tokens for their digital wallet. The company was formerly known as American Security Resources Corporation and changed its name to Bitcoin Crypto Currency Exchange Corporation in August 2017. Bitcoin Crypto Currency Exchange Corporation was founded in 1981 and is based in Houston, Texas.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "ARTNA": {"short_name": "Artesian Resources Corporation", "long_name": "Artesian Resources Corporation", "summary": "Artesian Resources Corporation, through its subsidiaries, provides water, wastewater, and other services on the Delmarva Peninsula. The company distributes and sells water to residential, commercial, industrial, governmental, municipal, and utility customers, as well as for public and private fire protection in the states of Delaware, Maryland, and Pennsylvania; and offers wastewater collection, treatment infrastructure, and wastewater services to customers in Delaware. It also provides contract water and wastewater services; water, sewer, and internal service line protection plans; and wastewater management services, as well as design, construction, and engineering services. In addition, the company offers services to other water utilities, including operations and billing functions; owns real estate properties, including land for office buildings, a water treatment plant, and wastewater facility; and provides designing, installing, maintaining, and repairing services for storm water management systems. As of December 31, 2019, it served approximately 87,800 metered water customers in Delaware, 2,500 metered water customers in Maryland, and 40 customers in Pennsylvania through 1,331 miles of transmission and distribution mains. Artesian Resources Corporation was founded in 1905 and is headquartered in Newark, Delaware.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Newark"}, "ARTNB": {"short_name": "ARTESIAN RESOURCES CORP", "long_name": "Artesian Resources Corporation", "summary": "Artesian Resources Corporation, through its subsidiaries, provides water, wastewater, and other services on the Delmarva Peninsula. The company distributes and sells water to residential, commercial, industrial, governmental, municipal, and utility customers, as well as for public and private fire protection in the states of Delaware, Maryland, and Pennsylvania; and offers wastewater collection, treatment infrastructure, and wastewater services to customers in Delaware. It also provides contract water and wastewater services; water, sewer, and internal service line protection plans; and wastewater management services, as well as design, construction, and engineering services. In addition, the company offers services to other water utilities, including operations and billing functions; owns real estate properties, including land for office buildings, a water treatment plant, and wastewater facility; and provides designing, installing, maintaining, and repairing services for storm water management systems. As of December 31, 2019, it served approximately 87,800 metered water customers in Delaware, 2,500 metered water customers in Maryland, and 40 customers in Pennsylvania through 1,331 miles of transmission and distribution mains. Artesian Resources Corporation was founded in 1905 and is headquartered in Newark, Delaware.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Newark"}, "AT": {"short_name": "Atlantic Power Corporation", "long_name": "Atlantic Power Corporation", "summary": "Atlantic Power Corporation owns and operates a fleet of power generation assets in the United States and Canada. As of December 31, 2019, its portfolio consisted of twenty-one operating projects with an aggregate electric generating capacity of approximately 1,723 megawatts on a gross ownership basis and approximately 1,327 MW on a net ownership basis across eleven states in the United States and two provinces in Canada. The company sells its electricity to utilities and other customers. Atlantic Power Corporation was founded in 2004 and is headquartered in Dedham, Massachusetts.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Independent Power Producers", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Dedham"}, "ATO": {"short_name": "Atmos Energy Corporation", "long_name": "Atmos Energy Corporation", "summary": "Atmos Energy Corporation, together with its subsidiaries, engages in the regulated natural gas distribution, and pipeline and storage businesses in the United States. It operates in two segments, Distribution, and Pipeline and Storage. The Distribution segment is involved in the regulated natural gas distribution and related sales operations in eight states. This segment distributes natural gas to approximately three million residential, commercial, public authority, and industrial customers. As of September 30, 2020, it owned 71,558 miles of underground distribution and transmission mains. The Pipeline and Storage segment engages in the pipeline and storage operations. This segment transports natural gas for third parties and manages five underground storage reservoirs in Texas; and provides ancillary services to the pipeline industry, including parking arrangements, lending, and inventory sales. As of September 30, 2020, it owned 5,684 miles of gas transmission lines. Atmos Energy Corporation was founded in 1906 and is headquartered in Dallas, Texas.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Dallas"}, "ATP.TO": {"short_name": "ATLANTIC POWER CORP.", "long_name": "Atlantic Power Corporation", "summary": "Atlantic Power Corporation owns and operates a fleet of power generation assets in the United States and Canada. As of December 31, 2019, its portfolio consisted of twenty-one operating projects with an aggregate electric generating capacity of approximately 1,723 megawatts on a gross ownership basis and approximately 1,327 MW on a net ownership basis across eleven states in the United States and two provinces in Canada. The company sells its electricity to utilities and other customers. Atlantic Power Corporation was founded in 2004 and is headquartered in Dedham, Massachusetts.", "currency": "CAD", "sector": "Utilities", "industry": "Utilities—Independent Power Producers", "exchange": "TOR", "market": "ca_market", "country": "United States", "city": "Dedham"}, "AV6.F": {"short_name": "AVISTA CORP.", "long_name": "Avista Corporation", "summary": "Avista Corporation operates as an electric and natural gas utility company. It operates through two segments, Avista Utilities and AEL&P. The Avista Utilities segment provides electric distribution and transmission, and natural gas distribution services in parts of eastern Washington and northern Idaho; and natural gas distribution services in parts of northeastern and southwestern Oregon, as well as generates electricity in Washington, Idaho, Oregon, and Montana. This segment also engages in the wholesale purchase and sale of electricity and natural gas. The AEL&P segment offers electric services to approximately 17,000 customers in the city and borough of Juneau, Alaska. The company generates electricity through hydro, thermal, and wind facilities. As of February 8, 2019, it provided electric service to approximately 393,000 customers and natural gas to approximately 361,000 customers. In addition, the company engages in venture fund investments, real estate investments, and other investments. Avista Corporation was founded in 1889 and is headquartered in Spokane, Washington.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Spokane"}, "AV6.SG": {"short_name": "AVISTA CORP. Registered Shares ", "long_name": "Avista Corporation", "summary": "Avista Corporation operates as an electric and natural gas utility company. It operates through two segments, Avista Utilities and AEL&P. The Avista Utilities segment provides electric distribution and transmission, and natural gas distribution services in parts of eastern Washington and northern Idaho; and natural gas distribution services in parts of northeastern and southwestern Oregon, as well as generates electricity in Washington, Idaho, Oregon, and Montana. This segment also engages in the wholesale purchase and sale of electricity and natural gas. The AEL&P segment offers electric services to approximately 17,000 customers in the city and borough of Juneau, Alaska. The company generates electricity through hydro, thermal, and wind facilities. As of February 8, 2019, it provided electric service to approximately 393,000 customers and natural gas to approximately 361,000 customers. In addition, the company engages in venture fund investments, real estate investments, and other investments. Avista Corporation was founded in 1889 and is headquartered in Spokane, Washington.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "STU", "market": "dr_market", "country": "United States", "city": "Spokane"}, "AVA": {"short_name": "Avista Corporation", "long_name": "Avista Corporation", "summary": "Avista Corporation operates as an electric and natural gas utility company. It operates through two segments, Avista Utilities and AEL&P. The Avista Utilities segment provides electric distribution and transmission, and natural gas distribution services in parts of eastern Washington and northern Idaho; and natural gas distribution services in parts of northeastern and southwestern Oregon, as well as generates electricity in Washington, Idaho, Oregon, and Montana. This segment also engages in the wholesale purchase and sale of electricity and natural gas. The AEL&P segment offers electric services to approximately 17,000 customers in the city and borough of Juneau, Alaska. The company generates electricity through hydro, thermal, and wind facilities. As of February 8, 2019, it provided electric service to approximately 393,000 customers and natural gas to approximately 361,000 customers. In addition, the company engages in venture fund investments, real estate investments, and other investments. Avista Corporation was founded in 1889 and is headquartered in Spokane, Washington.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Spokane"}, "AWC.DE": {"short_name": "AMERICAN WATER WKS DL-,01", "long_name": "American Water Works Company, Inc.", "summary": "American Water Works Company, Inc., through its subsidiaries, provides water and wastewater services in the United States. It offers water and wastewater services to approximately 1,700 communities in 16 states serving approximately 3.4 million active customers. The company serves residential customers; commercial customers, such as food and beverage providers, commercial property developers and proprietors, and energy suppliers; fire service and private fire customers; industrial customers, such as large-scale manufacturers, mining, and production operations; public authorities comprising government buildings and other public sector facilities, such as schools and universities; and other utilities and community water and wastewater systems. It also provides various warranty protection programs to residential customers; and water and wastewater services on various military installations. In addition, the company undertakes contracts with municipal customers, primarily to operate and manage water and wastewater facilities, as well as offers other related services. It operates approximately 80 surface water treatment plants; 520 groundwater treatment plants; 140 wastewater treatment plants; 52,500 miles of transmission, distribution, and collection mains and pipes; 1,000 groundwater wells; 1,500 water and wastewater pumping stations; 1,300 treated water storage facilities; and 76 dams. The company serves approximately 15 million people with drinking water, wastewater, and other water-related services in 46 states. The company was founded in 1886 and is headquartered in Camden, New Jersey.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "GER", "market": "de_market", "country": "United States", "city": "Camden"}, "AWC.F": {"short_name": "AMERICAN WATER WKS DL-,01", "long_name": "American Water Works Company, Inc.", "summary": "American Water Works Company, Inc., through its subsidiaries, provides water and wastewater services in the United States. It offers water and wastewater services to approximately 1,700 communities in 16 states serving approximately 3.4 million active customers. The company serves residential customers; commercial customers, such as food and beverage providers, commercial property developers and proprietors, and energy suppliers; fire service and private fire customers; industrial customers, such as large-scale manufacturers, mining, and production operations; public authorities comprising government buildings and other public sector facilities, such as schools and universities; and other utilities and community water and wastewater systems. It also provides various warranty protection programs to residential customers; and water and wastewater services on various military installations. In addition, the company undertakes contracts with municipal customers, primarily to operate and manage water and wastewater facilities, as well as offers other related services. It operates approximately 80 surface water treatment plants; 520 groundwater treatment plants; 140 wastewater treatment plants; 52,500 miles of transmission, distribution, and collection mains and pipes; 1,000 groundwater wells; 1,500 water and wastewater pumping stations; 1,300 treated water storage facilities; and 76 dams. The company serves approximately 15 million people with drinking water, wastewater, and other water-related services in 46 states. The company was founded in 1886 and is headquartered in Camden, New Jersey.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Camden"}, "AWK": {"short_name": "American Water Works Company, I", "long_name": "American Water Works Company, Inc.", "summary": "American Water Works Company, Inc., through its subsidiaries, provides water and wastewater services in the United States. It offers water and wastewater services to approximately 1,700 communities in 16 states serving approximately 3.4 million active customers. The company serves residential customers; commercial customers, such as food and beverage providers, commercial property developers and proprietors, and energy suppliers; fire service and private fire customers; industrial customers, such as large-scale manufacturers, mining, and production operations; public authorities comprising government buildings and other public sector facilities, such as schools and universities; and other utilities and community water and wastewater systems. It also provides various warranty protection programs to residential customers; and water and wastewater services on various military installations. In addition, the company undertakes contracts with municipal customers, primarily to operate and manage water and wastewater facilities, as well as offers other related services. It operates approximately 80 surface water treatment plants; 520 groundwater treatment plants; 140 wastewater treatment plants; 52,500 miles of transmission, distribution, and collection mains and pipes; 1,000 groundwater wells; 1,500 water and wastewater pumping stations; 1,300 treated water storage facilities; and 76 dams. The company serves approximately 15 million people with drinking water, wastewater, and other water-related services in 46 states. The company was founded in 1886 and is headquartered in Camden, New Jersey.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Camden"}, "AWK.MX": {"short_name": "AMERICAN WATER WORKS COMPANY IN", "long_name": "American Water Works Company, Inc.", "summary": "American Water Works Company, Inc., through its subsidiaries, provides water and wastewater services in the United States. It offers water and wastewater services to approximately 1,700 communities in 16 states serving approximately 3.4 million active customers. The company serves residential customers; commercial customers, such as food and beverage providers, commercial property developers and proprietors, and energy suppliers; fire service and private fire customers; industrial customers, such as large-scale manufacturers, mining, and production operations; public authorities comprising government buildings and other public sector facilities, such as schools and universities; and other utilities and community water and wastewater systems. It also provides various warranty protection programs to residential customers; and water and wastewater services on various military installations. In addition, the company undertakes contracts with municipal customers, primarily to operate and manage water and wastewater facilities, as well as offers other related services. It operates approximately 80 surface water treatment plants; 520 groundwater treatment plants; 140 wastewater treatment plants; 52,500 miles of transmission, distribution, and collection mains and pipes; 1,000 groundwater wells; 1,500 water and wastewater pumping stations; 1,300 treated water storage facilities; and 76 dams. The company serves approximately 15 million people with drinking water, wastewater, and other water-related services in 46 states. The company was founded in 1886 and is headquartered in Camden, New Jersey.", "currency": "MXN", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Camden"}, "AWK.VI": {"short_name": "AMERICAN WATER WORKS COMPANY", "long_name": "American Water Works Company, Inc.", "summary": "American Water Works Company, Inc., through its subsidiaries, provides water and wastewater services in the United States. It offers water and wastewater services to approximately 1,700 communities in 16 states serving approximately 3.4 million active customers. The company serves residential customers; commercial customers, such as food and beverage providers, commercial property developers and proprietors, and energy suppliers; fire service and private fire customers; industrial customers, such as large-scale manufacturers, mining, and production operations; public authorities comprising government buildings and other public sector facilities, such as schools and universities; and other utilities and community water and wastewater systems. It also provides various warranty protection programs to residential customers; and water and wastewater services on various military installations. In addition, the company undertakes contracts with municipal customers, primarily to operate and manage water and wastewater facilities, as well as offers other related services. It operates approximately 80 surface water treatment plants; 520 groundwater treatment plants; 140 wastewater treatment plants; 52,500 miles of transmission, distribution, and collection mains and pipes; 1,000 groundwater wells; 1,500 water and wastewater pumping stations; 1,300 treated water storage facilities; and 76 dams. The company serves approximately 15 million people with drinking water, wastewater, and other water-related services in 46 states. The company was founded in 1886 and is headquartered in Camden, New Jersey.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "VIE", "market": "at_market", "country": "United States", "city": "Camden"}, "AWR": {"short_name": "American States Water Company", "long_name": "American States Water Company", "summary": "American States Water Company, through its subsidiaries, provides water and electric services to residential, industrial, and other customers in the United States. It operates through three segments: Water, Electric, and Contracted Services. The company purchases, produces, distributes, and sells water, as well as distributes electricity. As of February 24, 2020, it provided water service to approximately 261,000 customers located throughout 10 counties in Northern, Coastal, and Southern California; and distributed electricity to approximately 24,000 customers in the City of Big Bear and surrounding areas in San Bernardino County, California. The company also provides water and/or wastewater services, including the operation, maintenance, and construction of facilities at the water and/or wastewater systems at various military installations. American States Water Company was founded in 1929 and is headquartered in San Dimas, California.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "San Dimas"}, "AWSL": {"short_name": "ATLANTIC WIND & SOLAR INC", "long_name": "Atlantic Wind & Solar, Inc.", "summary": "Atlantic Wind & Solar, Inc. offers porous paving solution in Florida. The company offers solution, such as drainage, erosion, landscaping, trails and paths, and tree surrounds. Atlantic Wind & Solar, Inc. formerly known as K.B. Industries, Inc. and changed its name to Atlantic Wind & Solar, Inc. on Jun, 2019. The company was founded in 2001 and is based in Largo, Florida.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Largo"}, "BEPC": {"short_name": "Brookfield Renewable Corporatio", "long_name": "Brookfield Renewable Corporation", "summary": "Brookfield Renewable Corporation operates renewable power assets in the United States, Brazil, and Colombia. It operates hydroelectric, wind, and solar power plants with an installed capacity of approximately 19,000 megawatts, as well as 18,000 megawatt of development pipeline. The company was founded in 2019 and is headquartered in New York, New York.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "New York"}, "BEPC.TO": {"short_name": "BROOKFIELD RENEWABLE CORPORATIO", "long_name": "Brookfield Renewable Corporation", "summary": "Brookfield Renewable Corporation operates renewable power assets in the United States, Brazil, and Colombia. It operates hydroelectric, wind, and solar power plants with an installed capacity of approximately 19,000 megawatts, as well as 18,000 megawatt of development pipeline. The company was founded in 2019 and is headquartered in New York, New York.", "currency": "CAD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "TOR", "market": "ca_market", "country": "United States", "city": "New York"}, "BHI.F": {"short_name": "BLACK HILLS CORP.  DL 1", "long_name": "Black Hills Corporation", "summary": "Black Hills Corporation, through its subsidiaries, operates as an electric and natural gas utility company in the United States. It operates through Electric Utilities, Gas Utilities, Power Generation, and Mining segments. The Electric Utilities segment generates, transmits, and distributes electricity to approximately 214,000 electric customers in Colorado, Montana, South Dakota, and Wyoming, as well as provides electrical system construction services to large industrial customers. This segment owns 939 megawatts of generation capacity and 8,900 miles of electric transmission and distribution lines. The Gas Utilities segment distributes natural gas to approximately 1,066,000 natural gas utility customers in Arkansas, Colorado, Iowa, Kansas, Nebraska, and Wyoming. It also provides appliance repair services to residential customers through company technicians and third-party service providers; and constructs and maintains gas infrastructure facilities for gas transportation customers. This segment owns and operates approximately 4,775 miles of intrastate gas transmission pipelines; 41,210 miles of gas distribution mains and service lines; 7 natural gas storage sites; and approximately 49,000 horsepower of compression and 500 miles of gathering lines. The Power Generation segment produces electric power through wind, natural gas, and coal generating plants; and sells the electric capacity and energy primarily to utilities under long-term contracts. The Mining segment produces coal at its coal mine located near Gillette, Wyoming; and sells the coal to electric generation facilities. Black Hills Corporation was founded in 1941 and is headquartered in Rapid City, South Dakota.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Rapid City"}, "BIPC": {"short_name": "Brookfield Infrastructure Partn", "long_name": "Brookfield Infrastructure Corporation", "summary": "Brookfield Infrastructure Corporation engages in the ownership and operation of regulated gas transmission systems in Brazil. It also engages in the regulated distribution operations in the United Kingdom. The company was founded in 2019 and is headquartered in New York, New York. Brookfield Infrastructure Corporation is a subsidiary of Brookfield Infrastructure Partners L.P.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "New York"}, "BIPC.TO": {"short_name": "BROOKFIELD INFRASTRUCTURE CORPO", "long_name": "Brookfield Infrastructure Corporation", "summary": "Brookfield Infrastructure Corporation engages in the ownership and operation of regulated gas transmission systems in Brazil. It also engages in the regulated distribution operations in the United Kingdom. The company was founded in 2019 and is headquartered in New York, New York. Brookfield Infrastructure Corporation is a subsidiary of Brookfield Infrastructure Partners L.P.", "currency": "CAD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "TOR", "market": "ca_market", "country": "United States", "city": "New York"}, "BKH": {"short_name": "Black Hills Corporation", "long_name": "Black Hills Corporation", "summary": "Black Hills Corporation, through its subsidiaries, operates as an electric and natural gas utility company in the United States. It operates through Electric Utilities, Gas Utilities, Power Generation, and Mining segments. The Electric Utilities segment generates, transmits, and distributes electricity to approximately 214,000 electric customers in Colorado, Montana, South Dakota, and Wyoming, as well as provides electrical system construction services to large industrial customers. This segment owns 939 megawatts of generation capacity and 8,900 miles of electric transmission and distribution lines. The Gas Utilities segment distributes natural gas to approximately 1,066,000 natural gas utility customers in Arkansas, Colorado, Iowa, Kansas, Nebraska, and Wyoming. It also provides appliance repair services to residential customers through company technicians and third-party service providers; and constructs and maintains gas infrastructure facilities for gas transportation customers. This segment owns and operates approximately 4,775 miles of intrastate gas transmission pipelines; 41,210 miles of gas distribution mains and service lines; 7 natural gas storage sites; and approximately 49,000 horsepower of compression and 500 miles of gathering lines. The Power Generation segment produces electric power through wind, natural gas, and coal generating plants; and sells the electric capacity and energy primarily to utilities under long-term contracts. The Mining segment produces coal at its coal mine located near Gillette, Wyoming; and sells the coal to electric generation facilities. Black Hills Corporation was founded in 1941 and is headquartered in Rapid City, South Dakota.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Rapid City"}, "BLSP": {"short_name": "BLUE SPHERE CORP", "long_name": "Blue Sphere Corporation", "summary": "Blue Sphere Corporation operates as a developer and independent power producer in the clean energy production and waste to energy markets. The company focuses on projects related to the acquisition, construction, and development of biogas facilities in the United States, Italy, the Netherlands, the United Kingdom, and Israel. It also focuses on soil amendments, compost, and other by-products. The company was formerly known as Jin Jie Corp. and changed its name to Blue Sphere Corporation in February 2010. Blue Sphere Corporation was founded in 2007 and is based in Charlotte, North Carolina.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Charlotte"}, "CDZI": {"short_name": "Cadiz, Inc.", "long_name": "Cadiz Inc.", "summary": "Cadiz Inc. operates as a natural resources development company in the United States. It engages in the water resource and agricultural development activities in San Bernardino County properties. The company owns approximately 35,000 acres of land in the Cadiz and Fenner valleys of eastern San Bernardino County; and approximately 11,000 acres of land in the eastern Mojave Desert portion of San Bernardino County. It is also involved in the cultivation of lemons and grapes/raisins, and spring and fall plantings of vegetables on the Cadiz Valley properties. Cadiz Inc. was founded in 1983 and is headquartered in Los Angeles, California.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Los Angeles"}, "CGEI": {"short_name": "CGE ENERGY INC", "long_name": "CGE Energy Inc.", "summary": "CGE Energy Inc. develops and operates long-term energy projects for commercial, municipal, nonprofit, and international customers. The company distributes and installs LED lighting products and solar PVs; develops, designs, and constructs solar PV projects; and designs WINDÂ\u0095e20 vertical-axis wind turbines. It also undertakes R.A.M.P (Review, Analyze, Modify and Protect) service contracts for energy sectors. The company has strategic partnership with Cree LED and SolarWorld. The company was founded in 1989 and is based in Brighton, Michigan.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Brighton"}, "CMNR": {"short_name": "COMMERCE ENERGY GROUP INC", "long_name": "Commerce Energy Group, Inc.", "summary": "Commerce Energy Group Inc. through its subsidiaries provides electric power and natural gas to residential, commercial, industrial and institutional customers in California, Pennsylvania, Michigan, Maryland, New Jersey, Texas, Florida, Georgia, Nevada, and Ohio. The company was founded in 1997 and is based in Costa Mesa, California.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Costa Mesa"}, "CMS": {"short_name": "CMS Energy Corporation", "long_name": "CMS Energy Corporation", "summary": "CMS Energy Corporation operates as an energy company primarily in Michigan. The company operates in four segments: Electric Utility, Gas Utility, Enterprises, and EnerBank. The Electric Utility segment is involved in the generation, purchase, transmission, distribution, and sale of electricity. This segment generates electricity through coal, wind, gas, renewable energy, oil, and nuclear sources. Its transmission and distribution system comprises 213 miles of transmission overhead lines; 205 miles of high-voltage distribution overhead lines; 4 miles of high-voltage distribution underground lines; 4,430 miles of high-voltage distribution overhead lines; 19 miles of high-voltage distribution underground lines; 66,917 miles of electric distribution overhead lines; 9,314 miles of underground distribution lines; substations; and a battery facility. The Gas Utility segment engages in the purchase, transmission, storage, distribution, and sale of natural gas, which includes 2,426 miles of transmission lines; 15 gas storage fields; 27,729 miles of distribution mains; and 8 compressor stations. The Enterprises segment is involved in the independent power production and marketing, including the development and operation of renewable generation. It owns interests in independent power plants totaling 1,335 megawatts. The EnterBank segment operates an industrial bank providing unsecured consumer installment loans for financing home improvements. It serves 1.8 million electric and 1.8 million gas customers, including residential, commercial, and diversified industrial customers. CMS Energy Corporation was founded in 1987 and is headquartered in Jackson, Michigan.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Jackson"}, "CMS-PB": {"short_name": "CMS Energy Corporation Preferre", "long_name": "Consumers Energy Company", "summary": "Consumers Energy Company operates as a public utility that provides natural gas and electricity to residents and businesses in Michigan. It provides natural gas and/or electricity to 6.7 million of the state's 10 million residents in 68 Lower Peninsula Counties. Consumers Energy Company was formerly known as Consumers Power Company and changed its name to Consumers Energy Company in March 1997. The company was founded in 1886 and is based in Jackson, Michigan. Consumers Energy Company is a subsidiary of CMS Energy Corporation.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Jackson"}, "CNIG": {"short_name": "CORNING NATURAL GAS HOLDING COR", "long_name": "Corning Natural Gas Holding Corporation", "summary": "Corning Natural Gas Holding Corporation, through its subsidiaries, distributes natural gas and electricity. The company offers natural gas to approximately 15,000 customers through approximately 425 miles of distribution main and 86 regulating stations; and electricity to approximately 4,800 customers through approximately 160 miles of electric distribution wire and poles, and 19 miles of gas distribution pipe. It also owns 4 gate stations and approximately 16 miles of pipe in Susquehanna and Bradford Counties, Pennsylvania. The company serves residential, commercial, industrial, and municipal customers in the Corning, Hammondsport, and Virgil areas, as well as in Pike county; and distributes to 2 other gas utilities that serve the Elmira and Bath areas of New York. The company was founded in 1904 and is headquartered in Corning, New York.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Corning"}, "CNIGO": {"short_name": "CORNING NATURAL GAS HOLDING COR", "long_name": "Corning Natural Gas Holding Corporation", "summary": "Corning Natural Gas Holding Corporation, through its subsidiaries, distributes natural gas and electricity. The company offers natural gas to approximately 15,000 customers through approximately 425 miles of distribution main and 86 regulating stations; and electricity to approximately 4,800 customers through approximately 160 miles of electric distribution wire and poles, and 19 miles of gas distribution pipe. It also owns 4 gate stations and approximately 16 miles of pipe in Susquehanna and Bradford Counties, Pennsylvania. The company serves residential, commercial, industrial, and municipal customers in the Corning, Hammondsport, and Virgil areas, as well as in Pike county; and distributes to 2 other gas utilities that serve the Elmira and Bath areas of New York. The company was founded in 1904 and is headquartered in Corning, New York.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Corning"}, "CNIGP": {"short_name": "CORNING NATURAL GAS HOLDING COR", "long_name": "Corning Natural Gas Holding Corporation", "summary": "Corning Natural Gas Holding Corporation, through its subsidiaries, distributes natural gas and electricity. The company offers natural gas to approximately 15,000 customers through approximately 425 miles of distribution main and 86 regulating stations; and electricity to approximately 4,800 customers through approximately 160 miles of electric distribution wire and poles, and 19 miles of gas distribution pipe. It also owns 4 gate stations and approximately 16 miles of pipe in Susquehanna and Bradford Counties, Pennsylvania. The company serves residential, commercial, industrial, and municipal customers in the Corning, Hammondsport, and Virgil areas, as well as in Pike county; and distributes to 2 other gas utilities that serve the Elmira and Bath areas of New York. The company was founded in 1904 and is headquartered in Corning, New York.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Corning"}, "CNLHN": {"short_name": "CONNECTICUT LIGHT & POWER CO", "long_name": "The Connecticut Light and Power Company", "summary": "The Connecticut Light and Power Company, a regulated electric utility, engages in the purchase, delivery, and sale of electricity to residential, commercial, and industrial customers. As of December 31, 2019, it offered furnished retail franchise electric services to approximately 1.26 million customers in 149 cities and towns in Connecticut covering an area of 4,400 square miles. The company was incorporated in 1927 and is based in Berlin, Connecticut. The Connecticut Light and Power Company operates as a subsidiary of Eversource Energy.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Berlin"}, "CNLHO": {"short_name": "CONNECTICUT LIGHT & POWER CO", "long_name": "The Connecticut Light and Power Company", "summary": "The Connecticut Light and Power Company, a regulated electric utility, engages in the purchase, delivery, and sale of electricity to residential, commercial, and industrial customers. As of December 31, 2019, it offered furnished retail franchise electric services to approximately 1.26 million customers in 149 cities and towns in Connecticut covering an area of 4,400 square miles. The company was incorporated in 1927 and is based in Berlin, Connecticut. The Connecticut Light and Power Company operates as a subsidiary of Eversource Energy.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Berlin"}, "CNLHP": {"short_name": "CONNECTICUT LIGHT & POWER CO", "long_name": "The Connecticut Light and Power Company", "summary": "The Connecticut Light and Power Company, a regulated electric utility, engages in the purchase, delivery, and sale of electricity to residential, commercial, and industrial customers. As of December 31, 2019, it offered furnished retail franchise electric services to approximately 1.26 million customers in 149 cities and towns in Connecticut covering an area of 4,400 square miles. The company was incorporated in 1927 and is based in Berlin, Connecticut. The Connecticut Light and Power Company operates as a subsidiary of Eversource Energy.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Berlin"}, "CNLPL": {"short_name": "CONNECTICUT LIGHT & POWER CO", "long_name": "The Connecticut Light and Power Company", "summary": "The Connecticut Light and Power Company, a regulated electric utility, engages in the purchase, delivery, and sale of electricity to residential, commercial, and industrial customers. As of December 31, 2019, it offered furnished retail franchise electric services to approximately 1.26 million customers in 149 cities and towns in Connecticut covering an area of 4,400 square miles. The company was incorporated in 1927 and is based in Berlin, Connecticut. The Connecticut Light and Power Company operates as a subsidiary of Eversource Energy.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Berlin"}, "CNLPM": {"short_name": "CONNECTICUT LIGHT & POWER CO", "long_name": "The Connecticut Light and Power Company", "summary": "The Connecticut Light and Power Company, a regulated electric utility, engages in the purchase, delivery, and sale of electricity to residential, commercial, and industrial customers. As of December 31, 2019, it offered furnished retail franchise electric services to approximately 1.26 million customers in 149 cities and towns in Connecticut covering an area of 4,400 square miles. The company was incorporated in 1927 and is based in Berlin, Connecticut. The Connecticut Light and Power Company operates as a subsidiary of Eversource Energy.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Berlin"}, "CNLTL": {"short_name": "CONNECTICUT LIGHT & POWER CO", "long_name": "The Connecticut Light and Power Company", "summary": "The Connecticut Light and Power Company, a regulated electric utility, engages in the purchase, delivery, and sale of electricity to residential, commercial, and industrial customers. As of December 31, 2019, it offered furnished retail franchise electric services to approximately 1.26 million customers in 149 cities and towns in Connecticut covering an area of 4,400 square miles. The company was incorporated in 1927 and is based in Berlin, Connecticut. The Connecticut Light and Power Company operates as a subsidiary of Eversource Energy.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Berlin"}, "CNLTN": {"short_name": "CONNECTICUT LIGHT & POWER CO", "long_name": "The Connecticut Light and Power Company", "summary": "The Connecticut Light and Power Company, a regulated electric utility, engages in the purchase, delivery, and sale of electricity to residential, commercial, and industrial customers. As of December 31, 2019, it offered furnished retail franchise electric services to approximately 1.26 million customers in 149 cities and towns in Connecticut covering an area of 4,400 square miles. The company was incorporated in 1927 and is based in Berlin, Connecticut. The Connecticut Light and Power Company operates as a subsidiary of Eversource Energy.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Berlin"}, "CNLTP": {"short_name": "CONNECTICUT LIGHT & POWER CO", "long_name": "The Connecticut Light and Power Company", "summary": "The Connecticut Light and Power Company, a regulated electric utility, engages in the purchase, delivery, and sale of electricity to residential, commercial, and industrial customers. As of December 31, 2019, it offered furnished retail franchise electric services to approximately 1.26 million customers in 149 cities and towns in Connecticut covering an area of 4,400 square miles. The company was incorporated in 1927 and is based in Berlin, Connecticut. The Connecticut Light and Power Company operates as a subsidiary of Eversource Energy.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Berlin"}, "CNP": {"short_name": "CenterPoint Energy, Inc (Holdin", "long_name": "CenterPoint Energy, Inc.", "summary": "CenterPoint Energy, Inc. operates as a public utility holding company in the United States. The company's Houston Electric T&D segment electric transmission and distribution services to electric utility. It owns 236 substation sites with a total installed rated transformer capacity of 68,053 megavolt amperes. Its Indiana Electric Integrated segment provides energy delivery services to electric customers and electric generation assets to electric customers and wholesale markets. The company's Natural Gas Distribution segment sells regulated intrastate natural gas; provides natural gas transportation and storage services for residential, commercial, industrial, and transportation customers; and offers unregulated services comprising home appliance maintenance and repair services. This segment owns approximately 98,000 linear miles of natural gas distribution mains. Its Energy Services segment provides physical natural gas supplies primarily to commercial and industrial customers, and electric and natural gas utilities; natural gas management services; and physical delivery services, as well as procures and optimizes transportation and storage assets. It owns and operates 210 miles of intrastate pipeline in Louisiana and Texas; and leases transportation capacity on various interstate and intrastate pipelines, and storage. The company's Infrastructure Services segment offers underground pipeline construction and repair services. Its Midstream Investment segment offers natural gas and crude oil gathering, and natural gas processing services to its producer customers; and interstate and intrastate natural gas pipeline transportation and storage services to its producer, power plant, local distribution company, and industrial end-user customers. As of March 2, 2020, it served approximately 7 million electric and natural gas metered customers. CenterPoint Energy, Inc. was founded in 1866 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "CNP-PB": {"short_name": "CenterPoint Energy, Inc. Deposi", "long_name": "CenterPoint Energy, Inc.", "summary": "CenterPoint Energy, Inc. operates as a public utility holding company in the United States. The company's Houston Electric T&D segment electric transmission and distribution services to electric utility. It owns 236 substation sites with a total installed rated transformer capacity of 68,053 megavolt amperes. Its Indiana Electric Integrated segment provides energy delivery services to electric customers and electric generation assets to electric customers and wholesale markets. The company's Natural Gas Distribution segment sells regulated intrastate natural gas; provides natural gas transportation and storage services for residential, commercial, industrial, and transportation customers; and offers unregulated services comprising home appliance maintenance and repair services. This segment owns approximately 98,000 linear miles of natural gas distribution mains. Its Energy Services segment provides physical natural gas supplies primarily to commercial and industrial customers, and electric and natural gas utilities; natural gas management services; and physical delivery services, as well as procures and optimizes transportation and storage assets. It owns and operates 210 miles of intrastate pipeline in Louisiana and Texas; and leases transportation capacity on various interstate and intrastate pipelines, and storage. The company's Infrastructure Services segment offers underground pipeline construction and repair services. Its Midstream Investment segment offers natural gas and crude oil gathering, and natural gas processing services to its producer customers; and interstate and intrastate natural gas pipeline transportation and storage services to its producer, power plant, local distribution company, and industrial end-user customers. As of March 2, 2020, it served approximately 7 million electric and natural gas metered customers. CenterPoint Energy, Inc. was founded in 1866 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "CNPWM": {"short_name": "CONNECTICUT LIGHT & POWER CO", "long_name": "The Connecticut Light and Power Company", "summary": "The Connecticut Light and Power Company, a regulated electric utility, engages in the purchase, delivery, and sale of electricity to residential, commercial, and industrial customers. As of December 31, 2019, it offered furnished retail franchise electric services to approximately 1.26 million customers in 149 cities and towns in Connecticut covering an area of 4,400 square miles. The company was incorporated in 1927 and is based in Berlin, Connecticut. The Connecticut Light and Power Company operates as a subsidiary of Eversource Energy.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Berlin"}, "CNPWP": {"short_name": "CONNECTICUT LIGHT & POWER CO", "long_name": "The Connecticut Light and Power Company", "summary": "The Connecticut Light and Power Company, a regulated electric utility, engages in the purchase, delivery, and sale of electricity to residential, commercial, and industrial customers. As of December 31, 2019, it offered furnished retail franchise electric services to approximately 1.26 million customers in 149 cities and towns in Connecticut covering an area of 4,400 square miles. The company was incorporated in 1927 and is based in Berlin, Connecticut. The Connecticut Light and Power Company operates as a subsidiary of Eversource Energy.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Berlin"}, "CNTHN": {"short_name": "CONNECTICUT LIGHT & POWER CO", "long_name": "The Connecticut Light and Power Company", "summary": "The Connecticut Light and Power Company, a regulated electric utility, engages in the purchase, delivery, and sale of electricity to residential, commercial, and industrial customers. As of December 31, 2019, it offered furnished retail franchise electric services to approximately 1.26 million customers in 149 cities and towns in Connecticut covering an area of 4,400 square miles. The company was incorporated in 1927 and is based in Berlin, Connecticut. The Connecticut Light and Power Company operates as a subsidiary of Eversource Energy.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Berlin"}, "CNTHO": {"short_name": "CONNECTICUT LIGHT & POWER CO", "long_name": "The Connecticut Light and Power Company", "summary": "The Connecticut Light and Power Company, a regulated electric utility, engages in the purchase, delivery, and sale of electricity to residential, commercial, and industrial customers. As of December 31, 2019, it offered furnished retail franchise electric services to approximately 1.26 million customers in 149 cities and towns in Connecticut covering an area of 4,400 square miles. The company was incorporated in 1927 and is based in Berlin, Connecticut. The Connecticut Light and Power Company operates as a subsidiary of Eversource Energy.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Berlin"}, "CNTHP": {"short_name": "CONNECTICUT LIGHT & POWER CO", "long_name": "The Connecticut Light and Power Company", "summary": "The Connecticut Light and Power Company, a regulated electric utility, engages in the purchase, delivery, and sale of electricity to residential, commercial, and industrial customers. As of December 31, 2019, it offered furnished retail franchise electric services to approximately 1.26 million customers in 149 cities and towns in Connecticut covering an area of 4,400 square miles. The company was incorporated in 1927 and is based in Berlin, Connecticut. The Connecticut Light and Power Company operates as a subsidiary of Eversource Energy.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Berlin"}, "CPK": {"short_name": "Chesapeake Utilities Corporatio", "long_name": "Chesapeake Utilities Corporation", "summary": "Chesapeake Utilities Corporation, a diversified energy company, engages in regulated and unregulated energy businesses. The Regulated Energy segment engages in the distribution of natural gas in central and southern Delaware, Maryland's eastern shore, and Florida; distribution of electricity in Florida; and transmission of natural gas on the Delmarva Peninsula and in Florida. The Unregulated Energy segment engages in the propane operations in the Mid-Atlantic region and Florida; unregulated natural gas transmission/supply operation in central and eastern Ohio; generation of electricity and steam; and provision of CNG and pipeline solutions primarily to utilities and pipelines in the eastern United States. This segment also provides other unregulated energy services, such as energy-related merchandise sales; heating, ventilation, and air conditioning services; and plumbing and electrical services. The company was founded in 1859 and is headquartered in Dover, Delaware.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Dover"}, "CPWR": {"short_name": "OCEAN THERMAL ENERGY CORPORATIO", "long_name": "Ocean Thermal Energy Corporation", "summary": "Ocean Thermal Energy Corporation develop projects for renewable power generation, desalinated water production, and air conditioning. The company produces electricity; fresh water for agriculture and human consumption; and desalinated water for potable, agricultural, and fish farming/aquaculture uses. Ocean Thermal Energy Corporation was founded in 1998 and is headquartered in Lancaster, Pennsylvania.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Lancaster"}, "CWEN": {"short_name": "Clearway Energy, Inc.", "long_name": "Clearway Energy, Inc.", "summary": "Clearway Energy, Inc., through its subsidiaries, acquires, owns, and operates contracted renewable energy and conventional generation, and thermal infrastructure assets in the United States. As of October 12, 2020, it had contracted generation portfolio of 7,000 megawatts (MWs) of wind, solar, and natural gas-fired power generation facilities, as well as district energy systems. The company also owns thermal infrastructure assets with an aggregate steam and chilled water capacity of 1,530 net MW thermal equivalent; and electric generation capacity of 139 net MWs. Its thermal infrastructure assets provide steam, hot water and/or chilled water, and electricity to commercial businesses, universities, hospitals, and governmental units. Clearway Energy, Inc. was founded in 2012 and is based in Princeton, New Jersey.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Princeton"}, "CWEN-A": {"short_name": "Clearway Energy, Inc.", "long_name": "Clearway Energy, Inc.", "summary": "Clearway Energy, Inc., through its subsidiaries, acquires, owns, and operates contracted renewable energy and conventional generation, and thermal infrastructure assets in the United States. As of October 12, 2020, it had contracted generation portfolio of 7,000 megawatts (MWs) of wind, solar, and natural gas-fired power generation facilities, as well as district energy systems. The company also owns thermal infrastructure assets with an aggregate steam and chilled water capacity of 1,530 net MW thermal equivalent; and electric generation capacity of 139 net MWs. Its thermal infrastructure assets provide steam, hot water and/or chilled water, and electricity to commercial businesses, universities, hospitals, and governmental units. Clearway Energy, Inc. was founded in 2012 and is based in Princeton, New Jersey.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Princeton"}, "CWT": {"short_name": "California Water Service Group", "long_name": "California Water Service Group", "summary": "California Water Service Group, through its subsidiaries, provides water utility and other related services in California, Washington, New Mexico, and Hawaii. It is involved in the production, purchase, storage, treatment, testing, distribution, and sale of water for domestic, industrial, public, and irrigation uses, as well as for fire protection. The company offers its services to approximately 486,900 customer connections in 100 California communities; approximately 5,000 water and wastewater customer connections on the islands of Maui and Hawaii; approximately 17,700 customer connections in the Tacoma and Olympia areas in Washington; and approximately 8,300 water and wastewater customer connections in the Belen, Los Lunas, Indian Hills, and Elephant Butte areas in New Mexico. It also engages in the provision of non-regulated water-related services, including operating municipally owned water systems, privately owned water, and recycled water distribution systems; providing water system operation, meter reading, and billing services to private companies and municipalities; leasing communication antenna sites on its properties to telecommunication companies; billing optional third-party insurance programs to its residential customers; and providing lab services. California Water Service Group was founded in 1926 and is headquartered in San Jose, California.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "San Jose"}, "D": {"short_name": "Dominion Energy, Inc.", "long_name": "Dominion Energy, Inc.", "summary": "Dominion Energy, Inc. produces and transports energy. The company's Dominion Energy Virginia segment engages in the regulated electric generation, transmission, and distribution operations that serve residential, commercial, industrial, and governmental customers in Virginia and North Carolina. Its Gas Transmission & Storage segment operates interstate natural gas transmission pipelines and underground storage systems, as well as engages in nonregulated retail natural gas marketing, and development of renewable natural gas and LNG infrastructure. The company's Gas Distribution segment engages in the regulated natural gas gathering, transportation, distribution, and sales activities. This segment serves residential, commercial, and industrial customers. Its Dominion Energy South Carolina segment generates, transmits, and distributes electricity and natural gas to residential, commercial, and industrial customers in South Carolina. The company's Contracted Generation segment is involved in the energy marketing and price risk activities. As of December 31, 2019, the company's portfolio of assets included approximately 30,700 megawatts of electric generating capacity; 10,400 miles of electric transmission lines; 85,000 miles of electric distribution lines; 14,600 miles of natural gas transmission, gathering, and storage pipelines; and 103,400 miles of gas distribution pipelines. It serves approximately 7 million utility and retail energy customers; and operates underground natural gas storage systems with approximately 1 trillion cubic feet of storage capacity. The company sells electricity at wholesale prices to rural electric cooperatives and municipalities, as well as into wholesale electricity markets. The company was formerly known as Dominion Resources, Inc. and changed its name to Dominion Energy, Inc. in May 2017. Dominion Energy, Inc. was incorporated in 1983 and is headquartered in Richmond, Virginia.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Richmond"}, "D2MN.F": {"short_name": "DUKE EN.CORP.  DL -,001", "long_name": "Duke Energy Corporation", "summary": "Duke Energy Corporation, together with its subsidiaries, operates as an energy company in the United States. It operates through three segments: Electric Utilities and Infrastructure, Gas Utilities and Infrastructure, and Commercial Renewables. The Electric Utilities and Infrastructure segment generates, transmits, distributes, and sells electricity in the Carolinas, Florida, and the Midwest; and uses coal, hydroelectric, natural gas, oil, renewable sources, and nuclear fuel to generate electricity. It also engages in the wholesale of electricity to municipalities, electric cooperative utilities, and load-serving entities. This segment serves approximately 7.8 million retail electric customers in 6 states in the Southeast and Midwest regions of the United States covering a service territory of approximately 91,000 square miles; and owns approximately 51,144 megawatts (MW) of generation capacity. The Gas Utilities and Infrastructure segment distributes natural gas to residential, commercial, industrial, and power generation natural gas customers; and owns, operates, and invests in pipeline transmission and natural gas storage facilities. It has approximately 1.6 million customers, including 1.1 million customers in North Carolina, South Carolina, and Tennessee, as well as 535,000 customers in southwestern Ohio and northern Kentucky. The Commercial Renewables segment acquires, owns, develops, builds, and operates wind and solar renewable generation projects, including nonregulated renewable energy and energy storage services to utilities, electric cooperatives, municipalities, and commercial and industrial customers. It has 22 wind, 126 solar, and 1 battery storage facilities, as well as 11 fuel cell locations with a capacity of 2,282 MW across 19 states. The company was formerly known as Duke Energy Holding Corp. and changed its name to Duke Energy Corporation in April 2005. The company was incorporated in 2005 and is headquartered in Charlotte, North Carolina.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Charlotte"}, "DCUE": {"short_name": "Dominion Energy, Inc. 2019 Seri", "long_name": "Dominion Energy, Inc.", "summary": "Dominion Energy, Inc. produces and transports energy. The company's Dominion Energy Virginia segment engages in the regulated electric generation, transmission, and distribution operations that serve residential, commercial, industrial, and governmental customers in Virginia and North Carolina. Its Gas Transmission & Storage segment operates interstate natural gas transmission pipelines and underground storage systems, as well as engages in nonregulated retail natural gas marketing, and development of renewable natural gas and LNG infrastructure. The company's Gas Distribution segment engages in the regulated natural gas gathering, transportation, distribution, and sales activities. This segment serves residential, commercial, and industrial customers. Its Dominion Energy South Carolina segment generates, transmits, and distributes electricity and natural gas to residential, commercial, and industrial customers in South Carolina. The company's Contracted Generation segment is involved in the energy marketing and price risk activities. As of December 31, 2019, the company's portfolio of assets included approximately 30,700 megawatts of electric generating capacity; 10,400 miles of electric transmission lines; 85,000 miles of electric distribution lines; 14,600 miles of natural gas transmission, gathering, and storage pipelines; and 103,400 miles of gas distribution pipelines. It serves approximately 7 million utility and retail energy customers; and operates underground natural gas storage systems with approximately 1 trillion cubic feet of storage capacity. The company sells electricity at wholesale prices to rural electric cooperatives and municipalities, as well as into wholesale electricity markets. The company was formerly known as Dominion Resources, Inc. and changed its name to Dominion Energy, Inc. in May 2017. Dominion Energy, Inc. was incorporated in 1983 and is headquartered in Richmond, Virginia.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Richmond"}, "DGY.F": {"short_name": "DTE EN. CO.", "long_name": "DTE Energy Company", "summary": "DTE Energy Company engages in the utility operations. The company's Electric segment generates, purchases, distributes, and sells electricity to approximately 2.2 million residential, commercial, and industrial customers in southeastern Michigan. It generates electricity through fossil-fuel, hydroelectric pumped storage, and nuclear plants, as well as wind and other renewable assets. This segment owns and operates approximately 700 distribution substations and 445,200 line transformers. The company's Gas segment purchases, stores, transports, distributes, and sells natural gas to approximately 1.3 million residential, commercial, and industrial customers throughout Michigan; and sells storage and transportation capacity. This segment has approximately 20,000 miles of distribution mains; 1,305,000 service pipelines; and 1,285,000 active meters, as well as owns approximately 2,000 miles of transmission pipelines. Its Gas Storage and Pipelines segment owns natural gas storage fields, lateral and gathering pipeline systems, and compression and surface facilities, as well as has ownership interests in interstate pipelines serving the Gulf Coast, Midwest, Ontario, and northeast markets. The company's Power and Industrial Projects segment offers metallurgical coke; pulverized coal and petroleum coke to the steel, pulp and paper, and other industries; and power, steam and chilled water production, and wastewater treatment services, as well as supplies compressed air to industrial customers. It also owns and operates 5 renewable generating plants with a capacity of 217 MWs; 23 gas recovery sites; and 10 reduced emissions fuel facilities. Its Energy Trading segment engages in power, natural gas, and environmental marketing and trading; structured transactions; and the optimization of contracted natural gas pipeline transportation and storage positions. The company was founded in 1903 and is headquartered in Detroit, Michigan.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Detroit"}, "DOEN.VI": {"short_name": "DOMINION ENERGY INC", "long_name": "Dominion Energy, Inc.", "summary": "Dominion Energy, Inc. produces and transports energy. The company's Dominion Energy Virginia segment engages in the regulated electric generation, transmission, and distribution operations that serve residential, commercial, industrial, and governmental customers in Virginia and North Carolina. Its Gas Transmission & Storage segment operates interstate natural gas transmission pipelines and underground storage systems, as well as engages in nonregulated retail natural gas marketing, and development of renewable natural gas and LNG infrastructure. The company's Gas Distribution segment engages in the regulated natural gas gathering, transportation, distribution, and sales activities. This segment serves residential, commercial, and industrial customers. Its Dominion Energy South Carolina segment generates, transmits, and distributes electricity and natural gas to residential, commercial, and industrial customers in South Carolina. The company's Contracted Generation segment is involved in the energy marketing and price risk activities. As of December 31, 2019, the company's portfolio of assets included approximately 30,700 megawatts of electric generating capacity; 10,400 miles of electric transmission lines; 85,000 miles of electric distribution lines; 14,600 miles of natural gas transmission, gathering, and storage pipelines; and 103,400 miles of gas distribution pipelines. It serves approximately 7 million utility and retail energy customers; and operates underground natural gas storage systems with approximately 1 trillion cubic feet of storage capacity. The company sells electricity at wholesale prices to rural electric cooperatives and municipalities, as well as into wholesale electricity markets. The company was formerly known as Dominion Resources, Inc. and changed its name to Dominion Energy, Inc. in May 2017. Dominion Energy, Inc. was incorporated in 1983 and is headquartered in Richmond, Virginia.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "VIE", "market": "at_market", "country": "United States", "city": "Richmond"}, "DTE": {"short_name": "DTE Energy Company", "long_name": "DTE Energy Company", "summary": "DTE Energy Company engages in the utility operations. The company's Electric segment generates, purchases, distributes, and sells electricity to approximately 2.2 million residential, commercial, and industrial customers in southeastern Michigan. It generates electricity through fossil-fuel, hydroelectric pumped storage, and nuclear plants, as well as wind and other renewable assets. This segment owns and operates approximately 700 distribution substations and 445,200 line transformers. The company's Gas segment purchases, stores, transports, distributes, and sells natural gas to approximately 1.3 million residential, commercial, and industrial customers throughout Michigan; and sells storage and transportation capacity. This segment has approximately 20,000 miles of distribution mains; 1,305,000 service pipelines; and 1,285,000 active meters, as well as owns approximately 2,000 miles of transmission pipelines. Its Gas Storage and Pipelines segment owns natural gas storage fields, lateral and gathering pipeline systems, and compression and surface facilities, as well as has ownership interests in interstate pipelines serving the Gulf Coast, Midwest, Ontario, and northeast markets. The company's Power and Industrial Projects segment offers metallurgical coke; pulverized coal and petroleum coke to the steel, pulp and paper, and other industries; and power, steam and chilled water production, and wastewater treatment services, as well as supplies compressed air to industrial customers. It also owns and operates 5 renewable generating plants with a capacity of 217 MWs; 23 gas recovery sites; and 10 reduced emissions fuel facilities. Its Energy Trading segment engages in power, natural gas, and environmental marketing and trading; structured transactions; and the optimization of contracted natural gas pipeline transportation and storage positions. The company was founded in 1903 and is headquartered in Detroit, Michigan.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Detroit"}, "DUK": {"short_name": "Duke Energy Corporation (Holdin", "long_name": "Duke Energy Corporation", "summary": "Duke Energy Corporation, together with its subsidiaries, operates as an energy company in the United States. It operates through three segments: Electric Utilities and Infrastructure, Gas Utilities and Infrastructure, and Commercial Renewables. The Electric Utilities and Infrastructure segment generates, transmits, distributes, and sells electricity in the Carolinas, Florida, and the Midwest; and uses coal, hydroelectric, natural gas, oil, renewable sources, and nuclear fuel to generate electricity. It also engages in the wholesale of electricity to municipalities, electric cooperative utilities, and load-serving entities. This segment serves approximately 7.8 million retail electric customers in 6 states in the Southeast and Midwest regions of the United States covering a service territory of approximately 91,000 square miles; and owns approximately 51,144 megawatts (MW) of generation capacity. The Gas Utilities and Infrastructure segment distributes natural gas to residential, commercial, industrial, and power generation natural gas customers; and owns, operates, and invests in pipeline transmission and natural gas storage facilities. It has approximately 1.6 million customers, including 1.1 million customers in North Carolina, South Carolina, and Tennessee, as well as 535,000 customers in southwestern Ohio and northern Kentucky. The Commercial Renewables segment acquires, owns, develops, builds, and operates wind and solar renewable generation projects, including nonregulated renewable energy and energy storage services to utilities, electric cooperatives, municipalities, and commercial and industrial customers. It has 22 wind, 126 solar, and 1 battery storage facilities, as well as 11 fuel cell locations with a capacity of 2,282 MW across 19 states. The company was formerly known as Duke Energy Holding Corp. and changed its name to Duke Energy Corporation in April 2005. The company was incorporated in 2005 and is headquartered in Charlotte, North Carolina.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Charlotte"}, "DUK-PA": {"short_name": "Duke Energy Corporation Deposit", "long_name": "Duke Energy Corporation", "summary": "Duke Energy Corporation, together with its subsidiaries, operates as an energy company in the United States. It operates through three segments: Electric Utilities and Infrastructure, Gas Utilities and Infrastructure, and Commercial Renewables. The Electric Utilities and Infrastructure segment generates, transmits, distributes, and sells electricity in the Carolinas, Florida, and the Midwest; and uses coal, hydroelectric, natural gas, oil, renewable sources, and nuclear fuel to generate electricity. It also engages in the wholesale of electricity to municipalities, electric cooperative utilities, and load-serving entities. This segment serves approximately 7.8 million retail electric customers in 6 states in the Southeast and Midwest regions of the United States covering a service territory of approximately 91,000 square miles; and owns approximately 51,144 megawatts (MW) of generation capacity. The Gas Utilities and Infrastructure segment distributes natural gas to residential, commercial, industrial, and power generation natural gas customers; and owns, operates, and invests in pipeline transmission and natural gas storage facilities. It has approximately 1.6 million customers, including 1.1 million customers in North Carolina, South Carolina, and Tennessee, as well as 535,000 customers in southwestern Ohio and northern Kentucky. The Commercial Renewables segment acquires, owns, develops, builds, and operates wind and solar renewable generation projects, including nonregulated renewable energy and energy storage services to utilities, electric cooperatives, municipalities, and commercial and industrial customers. It has 22 wind, 126 solar, and 1 battery storage facilities, as well as 11 fuel cell locations with a capacity of 2,282 MW across 19 states. The company was formerly known as Duke Energy Holding Corp. and changed its name to Duke Energy Corporation in April 2005. The company was incorporated in 2005 and is headquartered in Charlotte, North Carolina.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Charlotte"}, "DUKB34.SA": {"short_name": "DUKE ENERGY DRN", "long_name": "Duke Energy Corporation", "summary": "Duke Energy Corporation, together with its subsidiaries, operates as an energy company in the United States. It operates through three segments: Electric Utilities and Infrastructure, Gas Utilities and Infrastructure, and Commercial Renewables. The Electric Utilities and Infrastructure segment generates, transmits, distributes, and sells electricity in the Carolinas, Florida, and the Midwest; and uses coal, hydroelectric, natural gas, oil, renewable sources, and nuclear fuel to generate electricity. It also engages in the wholesale of electricity to municipalities, electric cooperative utilities, and load-serving entities. This segment serves approximately 7.8 million retail electric customers in 6 states in the Southeast and Midwest regions of the United States covering a service territory of approximately 91,000 square miles; and owns approximately 51,144 megawatts (MW) of generation capacity. The Gas Utilities and Infrastructure segment distributes natural gas to residential, commercial, industrial, and power generation natural gas customers; and owns, operates, and invests in pipeline transmission and natural gas storage facilities. It has approximately 1.6 million customers, including 1.1 million customers in North Carolina, South Carolina, and Tennessee, as well as 535,000 customers in southwestern Ohio and northern Kentucky. The Commercial Renewables segment acquires, owns, develops, builds, and operates wind and solar renewable generation projects, including nonregulated renewable energy and energy storage services to utilities, electric cooperatives, municipalities, and commercial and industrial customers. It has 22 wind, 126 solar, and 1 battery storage facilities, as well as 11 fuel cell locations with a capacity of 2,282 MW across 19 states. The company was formerly known as Duke Energy Holding Corp. and changed its name to Duke Energy Corporation in April 2005. The company was incorporated in 2005 and is headquartered in Charlotte, North Carolina.", "currency": "BRL", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "SAO", "market": "br_market", "country": "United States", "city": "Charlotte"}, "E1SE34.SA": {"short_name": "EVERSOURCE EDRN", "long_name": "Eversource Energy", "summary": "Eversource Energy, a public utility holding company, engages in the energy delivery business. The company operates in four segments: Electric Distribution, Electric Transmission, Natural Gas Distribution, and Water Distribution. It is involved in the transmission and distribution of electricity; and distribution of natural gas. The company operates regulated water utilities. It also provides water services to approximately 229,000 customers. It serves residential, commercial, industrial, and municipal and fire protection customers in Connecticut, Massachusetts, and New Hampshire, the United States. The company was formerly known as Northeast Utilities and changed its name to Eversource Energy in April 2015. Eversource Energy was founded in 1927 and is based in Springfield, Massachusetts.", "currency": "BRL", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "SAO", "market": "br_market", "country": "United States", "city": "Springfield"}, "ED": {"short_name": "Consolidated Edison, Inc.", "long_name": "Consolidated Edison, Inc.", "summary": "Consolidated Edison, Inc., through its subsidiaries, engages in regulated electric, gas, and steam delivery businesses in the United States. The company offers electric services to approximately 3.5 million customers in New York City and Westchester County; gas to approximately 1.1 million customers in Manhattan, the Bronx, parts of Queens, and Westchester County; and steam to approximately 1,589 customers in parts of Manhattan. It also supplies electricity to approximately 0.3 million customers in southeastern New York and northern New Jersey; and gas to approximately 0.1 million customers in southeastern New York. The company operates 543 circuit miles of transmission lines; 15 transmission substations; 64 distribution substations; 89,395 in-service line transformers; 3,745 pole miles of overhead distribution lines; and 2,200 miles of underground distribution lines, as well as 4,318 miles of mains and 376,306 service lines for natural gas distribution. In addition, it owns, operates, and develops renewable and energy infrastructure projects; and provides energy-related products and services to wholesale and retail customers, as well as invests in electric and gas transmission projects. The company primarily sells electricity to industrial, commercial, residential, and government customers. Consolidated Edison, Inc. was founded in 1884 and is based in New York, New York.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "New York"}, "EIX": {"short_name": "Edison International", "long_name": "Edison International", "summary": "Edison International, through its subsidiaries, engages in the generation, transmission, and distribution of electricity in the United States. The company generates electricity through hydroelectric, diesel/liquid petroleum gas, natural gas, nuclear, and photovoltaic sources. It supplies electricity primarily to residential, commercial, industrial, agricultural, and other customers, as well as public authorities through transmission and distribution networks. The company's transmission facilities consist of lines ranging from 33 kV to 500 kV and substations; and distribution system comprises approximately 53,000 line miles of overhead lines, 38,000 line miles of underground lines, and 800 substations located in California. It serves approximately 5 million customers. The company was founded in 1886 and is based in Rosemead, California.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Rosemead"}, "EIX.F": {"short_name": "EDISON INTL", "long_name": "Edison International", "summary": "Edison International, through its subsidiaries, engages in the generation, transmission, and distribution of electricity in the United States. The company generates electricity through hydroelectric, diesel/liquid petroleum gas, natural gas, nuclear, and photovoltaic sources. It supplies electricity primarily to residential, commercial, industrial, agricultural, and other customers, as well as public authorities through transmission and distribution networks. The company's transmission facilities consist of lines ranging from 33 kV to 500 kV and substations; and distribution system comprises approximately 53,000 line miles of overhead lines, 38,000 line miles of underground lines, and 800 substations located in California. It serves approximately 5 million customers. The company was founded in 1886 and is based in Rosemead, California.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Rosemead"}, "EIX1.MX": {"short_name": "EDISON INTERNATIONAL", "long_name": "Edison International", "summary": "Edison International, through its subsidiaries, engages in the generation, transmission, and distribution of electricity in the United States. The company generates electricity through hydroelectric, diesel/liquid petroleum gas, natural gas, nuclear, and photovoltaic sources. It supplies electricity primarily to residential, commercial, industrial, agricultural, and other customers, as well as public authorities through transmission and distribution networks. The company's transmission facilities consist of lines ranging from 33 kV to 500 kV and substations; and distribution system comprises approximately 53,000 line miles of overhead lines, 38,000 line miles of underground lines, and 800 substations located in California. It serves approximately 5 million customers. The company was founded in 1886 and is based in Rosemead, California.", "currency": "MXN", "sector": "Utilities", "industry": "Electric Utilities", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Rosemead"}, "ES": {"short_name": "Eversource Energy (D/B/A)", "long_name": "Eversource Energy", "summary": "Eversource Energy, a public utility holding company, engages in the energy delivery business. The company operates in four segments: Electric Distribution, Electric Transmission, Natural Gas Distribution, and Water Distribution. It is involved in the transmission and distribution of electricity; and distribution of natural gas. The company operates regulated water utilities. It also provides water services to approximately 229,000 customers. It serves residential, commercial, industrial, and municipal and fire protection customers in Connecticut, Massachusetts, and New Hampshire, the United States. The company was formerly known as Northeast Utilities and changed its name to Eversource Energy in April 2015. Eversource Energy was founded in 1927 and is based in Springfield, Massachusetts.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Springfield"}, "ESLP": {"short_name": "EURO SOLAR PARKS INC", "long_name": "Euro Solar Parks, Inc.", "summary": "Euro Solar Parks, Inc. develops, builds, and operates commercial solar power plants for the European solar energy market. The company, through its subsidiaries, offers engineering services for infrastructure projects in the fields of energy supply and telecommunications; and provides management services to the solar energy industry, as well as owns contractual rights to develop solar power plants in Serbia. Euro Solar Parks, Inc. was incorporated in 2008 and is headquartered in Upper Saddle River, New Jersey. Euro Solar Parks, Inc. is a subsidiary of Greenfield Investments Ltd.", "currency": "USD", "sector": "Utilities", "industry": "Diversified Utilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Upper Saddle River"}, "ETI-P": {"short_name": "Entergy Texas Inc 5.375% Series", "long_name": "Entergy Texas, Inc.", "summary": "Entergy Texas, Inc. generates, transmits, and distributes electric power through coal in Texas. It provided electricity to approximately 461,000 retail customers in Texas. The company is headquartered in the Woodlands, Texas. Entergy Texas, Inc. is a subsidiary of Entergy Corporation.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "The Woodlands"}, "ETR": {"short_name": "Entergy Corporation", "long_name": "Entergy Corporation", "summary": "Entergy Corporation, together with its subsidiaries, engages in the production and distribution of electricity in the United States. The company generates electricity through gas/oil, nuclear, coal, hydro, and solar power sources. It operates in two segments, Utility and Entergy Wholesale Commodities. The company's Utility segment generates, transmits, distributes, and sells electric power in portions of Arkansas, Mississippi, Texas, and Louisiana, including the City of New Orleans; and distributes natural gas. Its Entergy Wholesale Commodities segment engages in the ownership, operation, and decommissioning of nuclear power plants located in the northern United States; sale of electric power to wholesale customers; provision of services to other nuclear power plant owners; and owning interests in non-nuclear power plants that sell electric power to wholesale customers. This segment sells energy to retail power providers, utilities, electric power co-operatives, power trading organizations, and other power generation companies. The company's power plants have approximately 30,000 megawatts (MW) of electric generating capacity, including approximately 9,000 MW of nuclear power. The company delivers electricity to 2.9 million utility customers in Arkansas, Louisiana, Mississippi, and Texas. Entergy Corporation was founded in 1949 and is based in New Orleans, Louisiana.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "New Orleans"}, "ETY.DE": {"short_name": "ENTERGY CORP.  DL-,01", "long_name": "Entergy Corporation", "summary": "Entergy Corporation, together with its subsidiaries, engages in the production and distribution of electricity in the United States. The company generates electricity through gas/oil, nuclear, coal, hydro, and solar power sources. It operates in two segments, Utility and Entergy Wholesale Commodities. The company's Utility segment generates, transmits, distributes, and sells electric power in portions of Arkansas, Mississippi, Texas, and Louisiana, including the City of New Orleans; and distributes natural gas. Its Entergy Wholesale Commodities segment engages in the ownership, operation, and decommissioning of nuclear power plants located in the northern United States; sale of electric power to wholesale customers; provision of services to other nuclear power plant owners; and owning interests in non-nuclear power plants that sell electric power to wholesale customers. This segment sells energy to retail power providers, utilities, electric power co-operatives, power trading organizations, and other power generation companies. The company's power plants have approximately 30,000 megawatts (MW) of electric generating capacity, including approximately 9,000 MW of nuclear power. The company delivers electricity to 2.9 million utility customers in Arkansas, Louisiana, Mississippi, and Texas. Entergy Corporation was founded in 1949 and is based in New Orleans, Louisiana.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "GER", "market": "de_market", "country": "United States", "city": "New Orleans"}, "ETY.F": {"short_name": "ENTERGY CORP.  DL-,01", "long_name": "Entergy Corporation", "summary": "Entergy Corporation, together with its subsidiaries, engages in the production and distribution of electricity in the United States. The company generates electricity through gas/oil, nuclear, coal, hydro, and solar power sources. It operates in two segments, Utility and Entergy Wholesale Commodities. The company's Utility segment generates, transmits, distributes, and sells electric power in portions of Arkansas, Mississippi, Texas, and Louisiana, including the City of New Orleans; and distributes natural gas. Its Entergy Wholesale Commodities segment engages in the ownership, operation, and decommissioning of nuclear power plants located in the northern United States; sale of electric power to wholesale customers; provision of services to other nuclear power plant owners; and owning interests in non-nuclear power plants that sell electric power to wholesale customers. This segment sells energy to retail power providers, utilities, electric power co-operatives, power trading organizations, and other power generation companies. The company's power plants have approximately 30,000 megawatts (MW) of electric generating capacity, including approximately 9,000 MW of nuclear power. The company delivers electricity to 2.9 million utility customers in Arkansas, Louisiana, Mississippi, and Texas. Entergy Corporation was founded in 1949 and is based in New Orleans, Louisiana.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "New Orleans"}, "EUSP": {"short_name": "EUROSITE POWER INC", "long_name": "EuroSite Power Inc.", "summary": "EuroSite Power Inc., owns, operates, and distributes on-site energy systems in the United Kingdom and Europe. Its energy systems produces and supplies electricity, heat, hot water, and cooling solutions to commercial and industrial customers, such as healthcare facilities, hotels, multi-family hotels, multi-family residential buildings, leisure centers, industrial buildings, and schools and colleges. The company was founded in 2010 and is headquartered in Waltham, Massachusetts.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Waltham"}, "EVRG": {"short_name": "Evergy, Inc.", "long_name": "Evergy, Inc.", "summary": "Evergy, Inc., through its subsidiaries, engages in the generation, transmission, distribution, and sale of electricity in Kansas and Missouri. It generates electricity through coal, nuclear, natural gas and oil, uranium, wind, hydroelectric, landfill gas, and solar energy sources, as well as other renewable sources. The company has approximately 10,100 circuit miles of transmission lines; 39,700 circuit miles of overhead distribution lines; and 12,700 circuit miles of underground distribution lines. It serves approximately 1,604,300 customers, including residences, commercial firms, industrials, municipalities, and other electric utilities. The company was incorporated in 2017 and is headquartered in Kansas City, Missouri.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Kansas City"}, "EXC": {"short_name": "Exelon Corporation", "long_name": "Exelon Corporation", "summary": "Exelon Corporation, a utility services holding company, engages in the generation and marketing of energy in the United States and Canada. It owns nuclear, fossil, wind, hydroelectric, biomass, and solar generating facilities. The company also sells electricity to wholesale and retail customers; and sells natural gas, renewable energy, and other energy-related products and services. In addition, it is involved in the purchase and regulated retail sale of electricity and natural gas; and transmission and distribution of electricity, and distribution of natural gas to retail customers. Further, the company offers support services, including legal, human resources, information technology, finance, supply management, engineering, customer operations, distribution and transmission planning, asset management, system operations, and power procurement services. It serves distribution utilities, municipalities, cooperatives, and financial institutions, as well as commercial, industrial, governmental, and residential customers. The company was incorporated in 1999 and is headquartered in Chicago, Illinois.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Chicago"}, "EXEC.VI": {"short_name": "EXELON CORP", "long_name": "Exelon Corporation", "summary": "Exelon Corporation, a utility services holding company, engages in the generation and marketing of energy in the United States and Canada. It owns nuclear, fossil, wind, hydroelectric, biomass, and solar generating facilities. The company also sells electricity to wholesale and retail customers; and sells natural gas, renewable energy, and other energy-related products and services. In addition, it is involved in the purchase and regulated retail sale of electricity and natural gas; and transmission and distribution of electricity, and distribution of natural gas to retail customers. Further, the company offers support services, including legal, human resources, information technology, finance, supply management, engineering, customer operations, distribution and transmission planning, asset management, system operations, and power procurement services. It serves distribution utilities, municipalities, cooperatives, and financial institutions, as well as commercial, industrial, governmental, and residential customers. The company was incorporated in 1999 and is headquartered in Chicago, Illinois.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "VIE", "market": "at_market", "country": "United States", "city": "Chicago"}, "FE": {"short_name": "FirstEnergy Corp.", "long_name": "FirstEnergy Corp.", "summary": "FirstEnergy Corp., through its subsidiaries, generates, transmits, and distributes electricity in the United States. The company operates through Regulated Distribution and Regulated Transmission segments. It owns and operates coal-fired, nuclear, hydroelectric, natural gas, wind, and solar power generating facilities. The company also provides energy-related products and services to retail and wholesale customers. It operates 24,486 circuit miles of overhead and underground transmission lines; and electric distribution systems, including 269,691 miles of overhead pole line and underground conduit carrying primary, secondary, and street lighting circuits, as well as owns substations with a total installed transformer capacity of approximately 156,115,196 kilovolt-amperes. The company serves approximately six million customers in Ohio, Pennsylvania, West Virginia, Maryland, New Jersey, and New York. FirstEnergy Corp. was founded in 1996 and is headquartered in Akron, Ohio.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Akron"}, "FNRG": {"short_name": "FORCEFIELD ENERGY", "long_name": "ForceField Energy Inc.", "summary": "ForceField Energy Inc., together with its subsidiaries, provides lighting products and solutions for enhancing energy efficiency in China and the United States. It distributes light emitting diode, and other commercial lighting products and fixtures. The company was formerly known as SunSi Energies Inc. and changed its name to ForceField Energy Inc. in February 2013. ForceField Energy Inc. was incorporated in 2007 and is headquartered in Coconut Creek, Florida.", "currency": "USD", "sector": "Utilities", "industry": "Diversified Utilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Coconut Creek"}, "GNE": {"short_name": "Genie Energy Ltd.", "long_name": "Genie Energy Ltd.", "summary": "Genie Energy Ltd., through its subsidiaries, operates as a retail energy provider, and an oil and gas exploration company. The company operates through four segments: Genie Retail Energy (GRE); GRE International; Genie Energy Services; and Genie Oil and Gas, Inc. It resells electricity and natural gas to residential and small business customers primarily in the Eastern and Midwestern United States, as well as in the United Kingdom, Japan, and Finland. The company also engages in the provision of energy advisory and brokerage services; and solar panel manufacturing, and solar installation design and project management activities. In addition, it holds an 86.1% interest in the southern portion of the Golan Heights in Northern Israel, as well as owns an interest in a contracted drilling services operation. Genie Energy Ltd. is headquartered in Newark, New Jersey.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Newark"}, "GNE-PA": {"short_name": "Genie Energy Ltd. Series 2012 -", "long_name": "Genie Energy Ltd.", "summary": "Genie Energy Ltd., through its subsidiaries, operates as a retail energy provider, and an oil and gas exploration company. The company operates through four segments: Genie Retail Energy (GRE); GRE International; Genie Energy Services; and Genie Oil and Gas, Inc. It resells electricity and natural gas to residential and small business customers primarily in the Eastern and Midwestern United States, as well as in the United Kingdom, Japan, and Finland. The company also engages in the provision of energy advisory and brokerage services; and solar panel manufacturing, and solar installation design and project management activities. In addition, it holds an 86.1% interest in the southern portion of the Golan Heights in Northern Israel, as well as owns an interest in a contracted drilling services operation. Genie Energy Ltd. is headquartered in Newark, New Jersey.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Newark"}, "GRGR": {"short_name": "GREEN ENERGY RESOURCES INC", "long_name": "Green Energy Resources, Inc.", "summary": "Green Energy Resources, Inc., a green bio-energy supply company, supplies wood biomass to utilities and the power generation industries in the United States and internationally. The company offers wood fiber/biomass/woodchips. It also provides urban tree certification software. The company was formerly known as New York International Log & Lumber Co, Inc. and changed its name to Green Energy Resources, Inc. in February 2005. Green Energy Resources, Inc. was founded in 1997 and is headquartered in New York, New York.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "New York"}, "GSFI": {"short_name": "GREEN STREAM HOLDINGS INC", "long_name": "Green Stream Holdings Inc.", "summary": "Green Stream Holdings Inc., through its subsidiary, Green Stream Finance, Inc., provides solar energy solutions in the United States. It constructs a solar greenhouse using customized red greenhouse glass and seamless solar panels. The company is based in Pacific Palisades, California.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Pacific Palisades"}, "GWR.TO": {"short_name": "GLOBAL WATER RESOURCES INC", "long_name": "Global Water Resources, Inc.", "summary": "Global Water Resources, Inc., a water resource management company, owns, operates, and manages regulated water, wastewater, and recycled water utilities primarily in metropolitan Phoenix, Arizona. As of December 31, 2019, it served approximately 61,000 people in 23,000 homes. The company was founded in 2003 and is based in Phoenix, Arizona.", "currency": "CAD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "TOR", "market": "ca_market", "country": "United States", "city": "Phoenix"}, "GWRS": {"short_name": "Global Water Resources, Inc.", "long_name": "Global Water Resources, Inc.", "summary": "Global Water Resources, Inc., a water resource management company, owns, operates, and manages regulated water, wastewater, and recycled water utilities primarily in metropolitan Phoenix, Arizona. As of December 31, 2019, it served approximately 61,000 people in 23,000 homes. The company was founded in 2003 and is based in Phoenix, Arizona.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Phoenix"}, "HE": {"short_name": "Hawaiian Electric Industries, I", "long_name": "Hawaiian Electric Industries, Inc.", "summary": "Hawaiian Electric Industries, Inc., through its subsidiaries, engages in the electric utility and banking businesses primarily in the state of Hawaii. The company's Electric Utility segment is involved in generating, purchasing, transmitting, distributing, and selling electric energy. Its renewable energy sources and potential sources include wind, solar, photovoltaic, geothermal, wave, hydroelectric, municipal waste, and other bio fuels. This segment distributes and sells electricity on the islands of Oahu, Hawaii, Maui, Lanai, and Molokai; and serves suburban communities, resorts, the United States armed forces installations, and agricultural operations. Its Bank segment operates a savings bank that offers banking and other financial services, including deposit products, such as savings accounts and checking accounts; and loans comprising residential and commercial real estate, residential mortgage, construction and development, multifamily residential and commercial real estate, consumer, and commercial loans to consumers and business. This segment operates 49 branches, including 34 branches in Oahu, 6 branches in Maui, 5 branches in Hawaii, 3 branches in Kauai, and 1 branch in Molokai. The company's Other segment focuses on investing in non-regulated renewable energy and infrastructure in the State of Hawaii. Hawaiian Electric Industries Inc. was founded in 1891 and is headquartered in Honolulu, Hawaii.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Honolulu"}, "HNM.F": {"short_name": "ORMAT TECHNOLOG.  DL-,001", "long_name": "Ormat Technologies, Inc.", "summary": "Ormat Technologies, Inc. engages in the geothermal and recovered energy power business in the United States, Indonesia, Kenya, Turkey, Chile, Guatemala, New Zealand, Honduras, and internationally. The company operates through three segments: Electricity, Product, and Energy Storage and Management Services. The Electricity segment develops, builds, owns, and operates geothermal, solar photovoltaic (PV), and recovered energy-based power plants; and sells electricity. The Product segment designs, manufactures, and sells equipment for geothermal, recovered energy-based electricity generation, and remote power units, such as fossil fuel powered turbo-generators and heavy duty direct-current generators. This segment also provides services relating to the engineering, procurement, construction, operation, and maintenance of geothermal, solar PV, and recovered energy-based power plants. The Product segment serves contractors; developers, owners, and operators of geothermal power plants; and owners and operators of interstate natural gas pipelines, gas processing plants, and cement plants, as well as companies in other energy-intensive industrial processes. The Energy Storage and Management Services segment offers energy storage, demand response, and energy management related services, as well as services relating to the engineering, procurement, construction, operation, and maintenance of energy storage units. Ormat Technologies, Inc. was founded in 1965 and is based in Reno, Nevada.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Reno"}, "HNRC": {"short_name": "HOUSTON NAT RES CORP", "long_name": "Houston Natural Resources Corp.", "summary": "Houston Natural Resources Corp., together with its subsidiaries, engages in the recycling and remediation of oil produced contaminates. It provides oil field waste water treatment and disposal services through a reclamation plant located in south Texas. The company was formerly known as Worldwide Diversified Holdings, Inc. and changed its name to Houston Natural Resources Corp. in June 2020. Houston Natural Resources Corp. is based in Houston, Texas.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "HWI.F": {"short_name": "HAWAIIAN EL. IND.", "long_name": "Hawaiian Electric Industries, Inc.", "summary": "Hawaiian Electric Industries, Inc., through its subsidiaries, engages in the electric utility and banking businesses primarily in the state of Hawaii. The company's Electric Utility segment is involved in generating, purchasing, transmitting, distributing, and selling electric energy. Its renewable energy sources and potential sources include wind, solar, photovoltaic, geothermal, wave, hydroelectric, municipal waste, and other bio fuels. This segment distributes and sells electricity on the islands of Oahu, Hawaii, Maui, Lanai, and Molokai; and serves suburban communities, resorts, the United States armed forces installations, and agricultural operations. Its Bank segment operates a savings bank that offers banking and other financial services, including deposit products, such as savings accounts and checking accounts; and loans comprising residential and commercial real estate, residential mortgage, construction and development, multifamily residential and commercial real estate, consumer, and commercial loans to consumers and business. This segment operates 49 branches, including 34 branches in Oahu, 6 branches in Maui, 5 branches in Hawaii, 3 branches in Kauai, and 1 branch in Molokai. The company's Other segment focuses on investing in non-regulated renewable energy and infrastructure in the State of Hawaii. Hawaiian Electric Industries Inc. was founded in 1891 and is headquartered in Honolulu, Hawaii.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Honolulu"}, "IDA": {"short_name": "IDACORP, Inc.", "long_name": "IDACORP, Inc.", "summary": "IDACORP, Inc. engages in the generation, transmission, distribution, purchase, and sale of electric energy in the United States. The company operates 17 hydropower generating plants located in southern Idaho and eastern Oregon; three natural gas-fired plants in southern Idaho; and interests in three coal-fired steam electric generating plants located in Wyoming, Nevada, and Oregon. As of December 31, 2019, it had approximately 4,830 pole-miles of high-voltage transmission lines; 24 step-up transmission substations located at power plants; 21 transmission substations; 9 switching stations; 31 mixed-use transmission and distribution substations; 185 energized distribution substations; and 27,968 pole-miles of distribution lines, as well as provides electric utility services to approximately 572,000 retail customers in southern Idaho and eastern Oregon. The company serves commercial and industrial customers, which involved in food processing, electronics and general manufacturing, agriculture, health care, and winter recreation activities. It also invests in housing and other real estate investments. The company was founded in 1915 and is headquartered in Boise, Idaho.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Boise"}, "IDJ.F": {"short_name": "IDACORP INC.", "long_name": "IDACORP, Inc.", "summary": "IDACORP, Inc. engages in the generation, transmission, distribution, purchase, and sale of electric energy in the United States. The company operates 17 hydropower generating plants located in southern Idaho and eastern Oregon; three natural gas-fired plants in southern Idaho; and interests in three coal-fired steam electric generating plants located in Wyoming, Nevada, and Oregon. As of December 31, 2019, it had approximately 4,830 pole-miles of high-voltage transmission lines; 24 step-up transmission substations located at power plants; 21 transmission substations; 9 switching stations; 31 mixed-use transmission and distribution substations; 185 energized distribution substations; and 27,968 pole-miles of distribution lines, as well as provides electric utility services to approximately 572,000 retail customers in southern Idaho and eastern Oregon. The company serves commercial and industrial customers, which involved in food processing, electronics and general manufacturing, agriculture, health care, and winter recreation activities. It also invests in housing and other real estate investments. The company was founded in 1915 and is headquartered in Boise, Idaho.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Boise"}, "IPLDP": {"short_name": "Interstate Power and Light Comp", "long_name": "Interstate Power and Light Company", "summary": "Interstate Power and Light Company, a public utility company, generates and distributes electricity, and distributes and transports natural gas to retail customers in Iowa. The company operates through three segments: Electric Operations, Gas Operations, and Other. It generates electricity from coal, natural gas, and wind energy; and purchases electricity from wholesale energy markets. The company also sells electricity to wholesale customers, including municipalities and rural electric cooperatives in Minnesota, Illinois, and Iowa. In addition, it generates and distributes steam for customers in Cedar Rapids, Iowa; and owns overhead electric distribution lines, underground electric distribution cables, and substation distribution transformers, as well as gas mains in Iowa. The company provides utility services to incorporated communities. It offers electric utility services to retail customers in various industries, such as farming, agriculture, industrial manufacturing, chemical, and packaging industries, as well as gas utility services for various industries comprising research, education, hospitality, manufacturing, and chemicals. As of December 31, 2019, Interstate Power and Light Company supplied electric service to approximately 490,000 retail customers and natural gas service to approximately 225,000 retail customers. The company was formerly known as Iowa Railway and Light Corporation. Interstate Power and Light Company was incorporated in 1925 and is based in Cedar Rapids, Iowa. Interstate Power and Light Company is a subsidiary of Alliant Energy Corporation.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Cedar Rapids"}, "IPWLK": {"short_name": "INDIANAPOLIS POWER & LIGHT CO", "long_name": "Indianapolis Power & Light Company", "summary": "Indianapolis Power & Light Company provides retail electric services. It generates and supplies electricity to residential, commercial, and industrial customers in Indianapolis, as well as in portions of other Central Indiana communities surrounding Marion County. The company was incorporated in 1926 and is based in Indianapolis, Indiana. Indianapolis Power & Light Company operates as a subsidiary of IPALCO Enterprises, Inc.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Indianapolis"}, "IRCC": {"short_name": "INDIGENOUS ROOTS CORP", "long_name": "Indigenous Roots Corp.", "summary": "Indigenous Roots Corp., through its subsidiary, owns and operates a 140 kW/h solar power generating facility in Georgetown, Delaware. The company was formerly known as American Paramount Gold Corp. and changed its name to Indigenous Roots Corp. in February 2018. Indigenous Roots Corp. was founded in 2006 and is based in Steilacoom, Washington.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Steilacoom"}, "JUHL": {"short_name": "JUHL ENERGY INC", "long_name": "Juhl Energy, Inc.", "summary": "Juhl Energy, Inc. operates in the clean and renewable-energy industry in the United States and Canada. The company is involved in the development, management, and ownership of community wind power projects. It focuses to build 5 megawatts (MW) to 80 MW wind farms that are jointly owned by local communities, farm owners, environmentally-concerned investors, and the company. The company services various aspects of wind project development, including development and ownership of wind farms, general consultation on wind projects, construction management of wind farm projects, and system operations and maintenance for completed wind farms. It operates through three segments: Renewable Energy Development, Renewable Power Plant Ownership, and Energy and Field Services. The Renewable Energy Development segment provides development and construction, as well as related products and services for the wind, solar, and cogeneration energy sectors. The Renewable Power Plant Ownership segment owns and operates consolidated wind farms or other clean energy investments. The Energy and Field Services segment offers business-to-business engineering consulting, asset management, and turbine maintenance services. Juhl Energy, Inc. has 24 community wind farms totaling approximately 260 MW of wind power in the Midwest region of the United States; and projects in various stages of development totaling approximately 445 MW of wind power generating capacity. The company was formerly known as Juhl Wind, Inc. and changed its name to Juhl Energy, Inc. in January 2013. Juhl Energy, Inc. is based in Pipestone, Minnesota.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Pipestone"}, "LNT": {"short_name": "Alliant Energy Corporation", "long_name": "Alliant Energy Corporation", "summary": "Alliant Energy Corporation operates as a utility holding company that provides regulated electricity and natural gas services in the Midwest region of the United States. It operates through three segments: Utility Electric Operations, Utility Gas Operations, and Utility Other. The company, through its subsidiary, Interstate Power and Light Company (IPL), primarily generates and distributes electricity, and distributes and transports natural gas to retail customers in Iowa; sells electricity to wholesale customers in Minnesota, Illinois, and Iowa; and generates and distributes steam in Cedar Rapids, Iowa. Alliant Energy Corporation, through its other subsidiary, Wisconsin Power and Light Company (WPL), generates and distributes electricity, and distributes and transports natural gas to retail customers in Wisconsin; and sells electricity to wholesale customers in Wisconsin. As of December 31, 2019, IPL supplied electricity to 490,000 retail customers and natural gas to 225,000 retail customers; and WPL supplied electricity to 480,000 retail customers and natural gas to 195,000 retail customers. It offers electric utility services to retail customers in the farming, agriculture, industrial manufacturing, chemical, and packaging industries. In addition, the company holds investments in various businesses, which provide freight services through a short-line railway between Cedar Rapids and Iowa City, Iowa; a barge terminal and hauling services on the Mississippi River; customized supply chain solutions; freight and logistics brokering services; and other transfer and storage services. Further, it owns a 347 megawatt (MW) natural gas-fired electric generating unit near Sheboygan Falls, Wisconsin; and a 225 MW wind farm located in Oklahoma. Alliant Energy Corporation was founded in 1917 and is headquartered in Madison, Wisconsin.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Madison"}, "MGEE": {"short_name": "MGE Energy Inc.", "long_name": "MGE Energy, Inc.", "summary": "MGE Energy, Inc., through its subsidiaries, operates as a public utility holding company primarily in Wisconsin. It operates through five segments: Regulated Electric Utility Operations; Regulated Gas Utility Operations; Nonregulated Energy Operations; Transmission Investments; and All Other. The company generates, purchases, and distributes electricity; owns or leases electric generation facilities located in Wisconsin and Iowa; and plans, constructs, operates, maintains, and expands transmission facilities to provide transmission services. It also generates electricity from coal, natural gas, and renewable energy sources, as well as purchases power under short and long-term commitments. As of February 26, 2020, the company distributed electricity to 155,000 customers in Dane County, Wisconsin; and purchased and distributed natural gas to 163,000 customers in seven south-central and western Wisconsin counties. MGE Energy, Inc. was founded in 1855 and is headquartered in Madison, Wisconsin.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Madison"}, "MMMW": {"short_name": "MASS MEGAWATTS WIND POWER INC", "long_name": "Mass Megawatts Wind Power, Inc.", "summary": "Mass Megawatts Wind Power, Inc. develops and sells clean energy systems for commercial and residential users in the United States. It offers solar tracking systems to automatically adjust the position of solar panels to receive the optimal level of direct sunlight throughout the day. The company was formerly known as Mass Megawatts Power, Inc. and changed its name to Mass Megawatts Wind Power, Inc. in February 2002. Mass Megawatts Wind Power, Inc. was founded in 1997 and is based in Worcester, Massachusetts.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Worcester"}, "MNTK": {"short_name": "Montauk Renewables, Inc.", "long_name": "Montauk Renewables, Inc.", "summary": "Montauk Renewables, Inc. focuses on operating as a holding company for Montauk Energy Holdings LLC that operates as a renewable energy company. It engages in the recovery and processing of environmentally detrimental methane (biogas) from landfills and other non-fossil fuel sources. The company develops, owns, and operates renewable natural gas (RNG) projects using technologies that supply RNG into the transportation industry and use RNG to produce electrical power for the electrical grid. Its customers for RNG and renewable identification numbers include long-term owner-operators of landfills and livestock farms, local utilities, and refiners in the natural gas and refining sectors; and electricity primarily comprise investor-owned and municipal electricity utilities that purchase electricity pursuant to fixed-price agreements. The company was incorporated in 2020 and is based in Pittsburgh, Pennsylvania.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "NCM", "market": "us_market", "country": "United States", "city": "Pittsburgh"}, "MPIR": {"short_name": "EMPIRE DIVERSIFIED ENERGY INC", "long_name": "Empire Diversified Energy, Inc.", "summary": "Empire Diversified Energy, Inc., a development stage company, undertakes Green Energy projects in the United States. The company's project include Fly Ash Remediation project at major southeastern utilities in the United States; and develops a new hybrid fuel pellets. Empire Diversified Energy, Inc. was founded in 1986 and is headquartered in Fort Lauderdale, Florida.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Fort Lauderdale"}, "MSEX": {"short_name": "Middlesex Water Company", "long_name": "Middlesex Water Company", "summary": "Middlesex Water Company owns and operates regulated water utility and wastewater systems. It operates in two segments, Regulated and Non-Regulated. The Regulated segment collects, treats, and distributes water on a retail and wholesale basis to residential, commercial, industrial, and fire protection customers in parts of New Jersey, Delaware, and Pennsylvania. This segment also includes regulated wastewater systems in New Jersey and Delaware. The Non-Regulated segment provides non-regulated contract services for the operation and maintenance of municipal and private water and wastewater systems in New Jersey and Delaware. Middlesex Water Company was founded in 1897 and is headquartered in Iselin, New Jersey.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Iselin"}, "MSX.SG": {"short_name": "MIDDLESEX WATER CO. Registered ", "long_name": "Middlesex Water Company", "summary": "Middlesex Water Company owns and operates regulated water utility and wastewater systems. It operates in two segments, Regulated and Non-Regulated. The Regulated segment collects, treats, and distributes water on a retail and wholesale basis to residential, commercial, industrial, and fire protection customers in parts of New Jersey, Delaware, and Pennsylvania. This segment also includes regulated wastewater systems in New Jersey and Delaware. The Non-Regulated segment provides non-regulated contract services for the operation and maintenance of municipal and private water and wastewater systems in New Jersey and Delaware. Middlesex Water Company was founded in 1897 and is headquartered in Iselin, New Jersey.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "STU", "market": "dr_market", "country": "United States", "city": "Iselin"}, "N1IS34.SA": {"short_name": "NISOURCE INCDRN", "long_name": "NiSource Inc.", "summary": "NiSource Inc., an energy holding company, operates as a regulated natural gas and electric utility company in the United States. The company operates through two segments, Gas Distribution Operations and Electric Operations. It provides natural gas service and transportation for residential, commercial, and industrial customers; generates, transmits, and distributes electricity; and wholesale and transmission transaction services. The company owns and operates two coal-fired electric generating stations with a capacity of 2,080 megawatts (MW); combined cycle gas turbine with a capacity of 571 MW; three gas-fired generating units with a capacity of 186 MW; and two hydroelectric generating plants with a capacity of 10 MW. It serves approximately 3.5 million natural gas customers in Ohio, Pennsylvania, Virginia, Kentucky, Maryland, and Massachusetts; and 476,000 electricity customers in the northern part of Indiana. The company was formerly known as NIPSCO Industries, Inc. and changed its name to NiSource Inc. in April 1999. NiSource Inc. was founded in 1847 and is headquartered in Merrillville, Indiana.", "currency": "BRL", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "SAO", "market": "br_market", "country": "United States", "city": "Merrillville"}, "NCEN": {"short_name": "NACEL ENERGY CORP", "long_name": "Nacel Energy Corporation", "summary": "Nacel Energy Corporation, a development stage wind power generation company, engages in the development of renewable and utility scale wind power generation facilities. It has 6 wind energy projects, including Blue Creek, Channing Flats, Leila Lake, Hedley Point, Swisher, and Snowflake totaling approximately 185 MW of potential capacity located on approximately 8,437 acres of land situated in the Panhandle area of Texas and northern Arizona. The company was formerly known as Zephyr Energy Corporation and changed its name to Nacel Energy Corporation in April 2007. Nacel Energy Corporation was founded in 2006 and is based in Denver, Colorado.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Denver"}, "NEE": {"short_name": "NextEra Energy, Inc.", "long_name": "NextEra Energy, Inc.", "summary": "NextEra Energy, Inc., through its subsidiaries, generates, transmits, and distributes electric power in North America. The company generates electricity through wind, solar, nuclear, coal, oil, and natural gas facilities. It also develops, constructs, and operates long-term contracted assets with a focus on renewable generation facilities, natural gas pipelines, and battery storage projects; and owns, develops, constructs, manages, and operates electric generation facilities in wholesale energy markets. In addition, the company engages in the energy-related commodity marketing and trading activities. The company was formerly known as FPL Group, Inc. and changed its name to NextEra Energy, Inc. in May 2010. NextEra Energy, Inc. was founded in 1925 and is headquartered in Juno Beach, Florida.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Juno Beach"}, "NEP": {"short_name": "NextEra Energy Partners, LP", "long_name": "NextEra Energy Partners, LP", "summary": "NextEra Energy Partners, LP acquires, owns, and manages contracted clean energy projects in the United States. It owns a portfolio of contracted renewable generation assets consisting of wind and solar projects, as well as contracted natural gas pipeline assets. The company was founded in 2014 and is headquartered in Juno Beach, Florida.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Juno Beach"}, "NESW": {"short_name": "NEW ENGLAND SERVICE CO", "long_name": "New England Service Company, Inc.", "summary": "New England Service Company, Inc. engages in the operation, management, and financing of water utilities and other related services in New Hampshire, Massachusetts, Rhode Island, and Connecticut. The company's Residential Services division provides plumbing; water softener and treatment; backflow testing and repairs; water service line installation; carpentry; and handy man services. Its water system operations division offers sampling and testing; primary operator; project engineering and consulting; accounting and billing; valve and main locating; and on-call services. It also offers water and sewer service line maintenance services. The company's Regulatory Services division provides water sampling services, as well as meter testing, repair, and installation services. New England Service Company, Inc. was founded in 1997 and is headquartered in Plainville, Connecticut.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Plainville"}, "NFE": {"short_name": "New Fortress Energy Inc.", "long_name": "New Fortress Energy Inc.", "summary": "New Fortress Energy Inc. operates as an integrated energy infrastructure company worldwide. It funds, builds, and operates natural gas infrastructure and logistics to deliver integrated turnkey energy solutions that enhance environmental stewardship and transform local industries and communities. The company was founded in 2014 and is based in New York, New York.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "New York"}, "NI": {"short_name": "NiSource Inc", "long_name": "NiSource Inc.", "summary": "NiSource Inc., an energy holding company, operates as a regulated natural gas and electric utility company in the United States. The company operates through two segments, Gas Distribution Operations and Electric Operations. It provides natural gas service and transportation for residential, commercial, and industrial customers; generates, transmits, and distributes electricity; and wholesale and transmission transaction services. The company owns and operates two coal-fired electric generating stations with a capacity of 2,080 megawatts (MW); combined cycle gas turbine with a capacity of 571 MW; three gas-fired generating units with a capacity of 186 MW; and two hydroelectric generating plants with a capacity of 10 MW. It serves approximately 3.5 million natural gas customers in Ohio, Pennsylvania, Virginia, Kentucky, Maryland, and Massachusetts; and 476,000 electricity customers in the northern part of Indiana. The company was formerly known as NIPSCO Industries, Inc. and changed its name to NiSource Inc. in April 1999. NiSource Inc. was founded in 1847 and is headquartered in Merrillville, Indiana.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Merrillville"}, "NI-PB": {"short_name": "NiSource, Inc Depositary Shares", "long_name": "NiSource Inc.", "summary": "NiSource Inc., an energy holding company, operates as a regulated natural gas and electric utility company in the United States. The company operates through two segments, Gas Distribution Operations and Electric Operations. It provides natural gas service and transportation for residential, commercial, and industrial customers; generates, transmits, and distributes electricity; and wholesale and transmission transaction services. The company owns and operates two coal-fired electric generating stations with a capacity of 2,080 megawatts (MW); combined cycle gas turbine with a capacity of 571 MW; three gas-fired generating units with a capacity of 186 MW; and two hydroelectric generating plants with a capacity of 10 MW. It serves approximately 3.5 million natural gas customers in Ohio, Pennsylvania, Virginia, Kentucky, Maryland, and Massachusetts; and 476,000 electricity customers in the northern part of Indiana. The company was formerly known as NIPSCO Industries, Inc. and changed its name to NiSource Inc. in April 1999. NiSource Inc. was founded in 1847 and is headquartered in Merrillville, Indiana.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Merrillville"}, "NJR": {"short_name": "NewJersey Resources Corporation", "long_name": "New Jersey Resources Corporation", "summary": "New Jersey Resources Corporation, an energy services holding company, provides regulated gas distribution, and retail and wholesale energy services. The company operates through four segments: Natural Gas Distribution, Clean Energy Ventures, Energy Services, and Storage and Transportation. The Natural Gas Distribution segment offers regulated retail natural gas services to approximately 558,000 residential and commercial customers in central and northern New Jersey; provides storage management services; and participates in the off-system sales and capacity release markets. The Clean Energy Ventures segment invests in, owns, and operates commercial and residential solar projects located in New Jersey, Connecticut, and Rhode Island. The Energy Services segment provides unregulated wholesale energy management services to other energy companies and natural gas producers, as well as maintains and transacts a portfolio of physical assets consisting of natural gas storage and transportation contracts in the United States and Canada. The Storage and Transportation segment invests in natural gas transportation and storage facilities. The company offers heating, ventilation, and cooling services; holds commercial real estate properties; and provides solar equipment installation, and plumbing repair and installation services, as well as engages in the water appliance sale, installation, and servicing activities. New Jersey Resources Corporation was incorporated in 1981 and is based in Monmouth, New Jersey.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Monmouth County"}, "NOU.F": {"short_name": "NISOURCE INC.", "long_name": "NiSource Inc.", "summary": "NiSource Inc., an energy holding company, operates as a regulated natural gas and electric utility company in the United States. The company operates through two segments, Gas Distribution Operations and Electric Operations. It provides natural gas service and transportation for residential, commercial, and industrial customers; generates, transmits, and distributes electricity; and wholesale and transmission transaction services. The company owns and operates two coal-fired electric generating stations with a capacity of 2,080 megawatts (MW); combined cycle gas turbine with a capacity of 571 MW; three gas-fired generating units with a capacity of 186 MW; and two hydroelectric generating plants with a capacity of 10 MW. It serves approximately 3.5 million natural gas customers in Ohio, Pennsylvania, Virginia, Kentucky, Maryland, and Massachusetts; and 476,000 electricity customers in the northern part of Indiana. The company was formerly known as NIPSCO Industries, Inc. and changed its name to NiSource Inc. in April 1999. NiSource Inc. was founded in 1847 and is headquartered in Merrillville, Indiana.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Merrillville"}, "NRG": {"short_name": "NRG Energy, Inc.", "long_name": "NRG Energy, Inc.", "summary": "NRG Energy, Inc., together with its subsidiaries, operates as an energy company in the United States. It operates through Generation and Retail segments. The company is involved in the producing, selling, and delivering electricity and related products and services to 3.7 million residential, industrial, and commercial consumers. It generates electricity using natural gas, coal, oil, solar, nuclear, and battery storage. The company also provides system power, distributed generation, renewable products, backup generation, storage and distributed solar, demand response, energy efficiency, advisory, and on-site energy solutions; and carbon management and specialty services. In addition, it trades in electric power, natural gas, and related commodity and financial products, including forwards, futures, options, and swaps. Further, the company procures fuels; provides transportation services; and directly sells energy, services, and products and services to retail customers under the NRG, Reliant, Green Mountain Energy, Stream, XOOM Energy, and other names. As of December 31, 2019, it owns fossil fuel, nuclear, and renewable plants with generation capacity of 23,000 megawatts. NRG Energy, Inc. was founded in 1989 and is headquartered in Princeton, New Jersey.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Independent Power Producers", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Princeton"}, "NRN.F": {"short_name": "XCEL ENERGY  DL 2,50", "long_name": "Xcel Energy Inc.", "summary": "Xcel Energy Inc., through its subsidiaries, generates, purchases, transmits, distributes, and sells electricity. It operates through Regulated Electric Utility, Regulated Natural Gas Utility, and All Other segments. The company generates electricity through coal, nuclear, natural gas, hydroelectric, solar, biomass, oil, wood/refuse, and wind energy sources. It also purchases, transports, distributes, and sells natural gas to retail customers, as well as transports customer-owned natural gas. In addition, the company develops and leases natural gas pipelines, and storage and compression facilities; and invests in rental housing projects, as well as procures equipment for construction of renewable generation facilities. It serves residential, commercial, and industrial customers in the portions of Colorado, Michigan, Minnesota, New Mexico, North Dakota, South Dakota, Texas, and Wisconsin. The company sells electricity to approximately 3.7 million customers; and natural gas to approximately 2.1 million customers. Xcel Energy Inc. was founded in 1909 and is headquartered in Minneapolis, Minnesota.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Minneapolis"}, "NSARO": {"short_name": "NSTAR ELECTRIC COMPANY", "long_name": "NSTAR Electric Company", "summary": "NSTAR Electric Company, a regulated electric utility company, engages in the purchase, transmission, delivery, and sale of electricity to residential, commercial, and industrial customers in Massachusetts. The company owns, operates, and maintains 70 megawatt of solar power facilities in Massachusetts. As of December 31, 2019, it served approximately 1.44 million customers in Boston, as well as 139 cities and towns in Eastern and Western Massachusetts, including Cape Cod, Martha's Vineyard, and the greater Springfield metropolitan area covering an area of approximately 3,200 square miles. The company is based in Boston, Massachusetts. NSTAR Electric Company operates as a subsidiary of Eversource Energy.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Boston"}, "NWE": {"short_name": "NorthWestern Corporation", "long_name": "NorthWestern Corporation", "summary": "NorthWestern Corporation, doing business as NorthWestern Energy, provides electricity and natural gas to residential, commercial, and industrial customers. The company operates through Electric Operations and Natural Gas Operations segments. It generates, transmits, and distributes electricity; and produces, purchases, stores, transmits, and distributes natural gas, as well as owns municipal franchises to provide natural gas service in the communities. The company's natural gas transmission system covers approximately 4,810 miles of pipeline. It serves approximately 734,800 customers in Montana, South Dakota, and Nebraska, the United States. NorthWestern Corporation was founded in 1923 and is based in Sioux Falls, South Dakota.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Sioux Falls"}, "NWN": {"short_name": "Northwest Natural Holding Compa", "long_name": "Northwest Natural Holding Company", "summary": "Northwest Natural Holding Company, through its subsidiary, Northwest Natural Gas Company, provides regulated natural gas distribution services to residential, commercial, industrial, and transportation customers in Oregon and Southwest Washington. It is also involved in gas storage activities, water businesses, and other investments activities. It serves approximately 2.5 million customers in approximately 140 communities through 760,000 meters. The company was founded in 1859 and is headquartered in Portland, Oregon.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Portland"}, "NWZA.F": {"short_name": "NORTHWESTERN NEW  DL-,01", "long_name": "NorthWestern Corporation", "summary": "NorthWestern Corporation, doing business as NorthWestern Energy, provides electricity and natural gas to residential, commercial, and industrial customers. The company operates through Electric Operations and Natural Gas Operations segments. It generates, transmits, and distributes electricity; and produces, purchases, stores, transmits, and distributes natural gas, as well as owns municipal franchises to provide natural gas service in the communities. The company's natural gas transmission system covers approximately 4,810 miles of pipeline. It serves approximately 734,800 customers in Montana, South Dakota, and Nebraska, the United States. NorthWestern Corporation was founded in 1923 and is based in Sioux Falls, South Dakota.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Sioux Falls"}, "OEG": {"short_name": "Orbital Energy Group, Inc.", "long_name": "Orbital Energy Group, Inc.", "summary": "Orbital Energy Group, Inc. engages in the design, installation, and commissioning of industrial gas sampling, measurement, and delivery systems for energy, power, and processing markets in the United States and the United Kingdom. It also provides engineering, construction, maintenance, and emergency response solutions to the power, utilities, and midstream markets; and engineering, procurement, and construction services in the renewable energy industry The company, formerly known as CUI Global, Inc., was founded in 1998 and is based in Houston, Texas.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Houston"}, "OGE": {"short_name": "OGE Energy Corp", "long_name": "OGE Energy Corp.", "summary": "OGE Energy Corp., together with its subsidiaries, operates as an energy and energy services provider that offers physical delivery and related services for electricity and natural gas primarily in the south central United States. It operates in two segments, Electric Utility and Natural Gas Midstream Operations. The Electric Utility segment generates, transmits, distributes, and sells electric energy. This segment furnishes retail electric service in 267 communities and their contiguous rural and suburban areas; and owns and operates coal-fired, natural gas-fired, wind-powered, and solar-powered generating assets. Its service area covers 30,000 square miles in Oklahoma and western Arkansas, including Oklahoma City in Oklahoma; and Fort Smith, Arkansas. The Natural Gas Midstream Operations segment engages in gathering, processing, transporting, and storing natural gas; and the provision of crude oil gathering services, and interstate and intrastate natural gas pipeline transportation and storage services primarily to its producer, power plant, local distribution company, and industrial end-user customers. As of December 31, 2019, the company owned and operated interconnected electric generation, transmission, and distribution systems, including 13 generating stations with an aggregate capability of 7,081 megawatts; and transmission systems comprising 53 substations and 5,122 structure miles of lines in Oklahoma, and seven substations and 277 structure miles of lines in Arkansas. Its distribution systems included 350 substations; 29,406 structure miles of overhead lines; 3,050 miles of underground conduit; and 10,967 miles of underground conductors in Oklahoma, as well as 30 substations, 2,786 structure miles of overhead lines, 315 miles of underground conduit, and 679 miles of underground conductors in Arkansas. The company was founded in 1902 and is headquartered in Oklahoma City, Oklahoma.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Oklahoma City"}, "OGS": {"short_name": "ONE Gas, Inc.", "long_name": "ONE Gas, Inc.", "summary": "ONE Gas, Inc. operates as a regulated natural gas distribution utility company in the United States. The company operates in three divisions: Oklahoma Natural Gas, Kansas Gas Service, and Texas Gas Service. It provides natural gas distribution services to 2.2 million customers in three states. The company serves residential, commercial and industrial, transportation and wholesale, and public authority customers. As of December 31, 2018, it operated approximately 40,300 miles of distribution mains; and 2,600 miles of transmission pipelines, as well as had 48.4 billion cubic feet of natural gas storage capacity. The company was founded in 1906 and is headquartered in Tulsa, Oklahoma.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Tulsa"}, "ORA": {"short_name": "Ormat Technologies, Inc.", "long_name": "Ormat Technologies, Inc.", "summary": "Ormat Technologies, Inc. engages in the geothermal and recovered energy power business in the United States, Indonesia, Kenya, Turkey, Chile, Guatemala, New Zealand, Honduras, and internationally. The company operates through three segments: Electricity, Product, and Energy Storage and Management Services. The Electricity segment develops, builds, owns, and operates geothermal, solar photovoltaic (PV), and recovered energy-based power plants; and sells electricity. The Product segment designs, manufactures, and sells equipment for geothermal, recovered energy-based electricity generation, and remote power units, such as fossil fuel powered turbo-generators and heavy duty direct-current generators. This segment also provides services relating to the engineering, procurement, construction, operation, and maintenance of geothermal, solar PV, and recovered energy-based power plants. The Product segment serves contractors; developers, owners, and operators of geothermal power plants; and owners and operators of interstate natural gas pipelines, gas processing plants, and cement plants, as well as companies in other energy-intensive industrial processes. The Energy Storage and Management Services segment offers energy storage, demand response, and energy management related services, as well as services relating to the engineering, procurement, construction, operation, and maintenance of energy storage units. Ormat Technologies, Inc. was founded in 1965 and is based in Reno, Nevada.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Reno"}, "ORA.TA": {"short_name": "ORMAT TECHNOLOGIES", "long_name": "Ormat Technologies, Inc.", "summary": "Ormat Technologies, Inc. engages in the geothermal and recovered energy power business in the United States, Indonesia, Kenya, Turkey, Chile, Guatemala, New Zealand, Honduras, and internationally. The company operates through three segments: Electricity, Product, and Energy Storage and Management Services. The Electricity segment develops, builds, owns, and operates geothermal, solar photovoltaic (PV), and recovered energy-based power plants; and sells electricity. The Product segment designs, manufactures, and sells equipment for geothermal, recovered energy-based electricity generation, and remote power units, such as fossil fuel powered turbo-generators and heavy duty direct-current generators. This segment also provides services relating to the engineering, procurement, construction, operation, and maintenance of geothermal, solar PV, and recovered energy-based power plants. The Product segment serves contractors; developers, owners, and operators of geothermal power plants; and owners and operators of interstate natural gas pipelines, gas processing plants, and cement plants, as well as companies in other energy-intensive industrial processes. The Energy Storage and Management Services segment offers energy storage, demand response, and energy management related services, as well as services relating to the engineering, procurement, construction, operation, and maintenance of energy storage units. Ormat Technologies, Inc. was founded in 1965 and is based in Reno, Nevada.", "currency": "ILA", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "TLV", "market": "il_market", "country": "United States", "city": "Reno"}, "OTTR": {"short_name": "Otter Tail Corporation", "long_name": "Otter Tail Corporation", "summary": "Otter Tail Corporation, together with its subsidiaries, engages in electric, manufacturing, and plastics businesses in the United States. The company's Electric segment produces, transmits, distributes, and sells electric energy in Minnesota, North Dakota, and South Dakota; and operates as a participant in the Midcontinent Independent System Operator, Inc. markets. This segment generates electricity through coal, wind and hydro, and natural gas and oil sources. As of December 31, 2019, it served approximately 132,578 residential, commercial, industrial, and other customers. Its Manufacturing segment stamps, fabricates, welds, paints, and laser cuts metal components for use in the recreational vehicle, agricultural, oil and gas, lawn and garden, industrial equipment, health and fitness, and enclosure industries; manufactures and fabricates parts for off-road equipment, mining machinery, oil fields and offshore oil rigs, wind industry components, broadcast antennae, and farm equipment; and provides laser cutting services and stamping to weldments and assemblies for metal fabrication buyers and original equipment manufacturers. It also manufactures and sells thermoformed products for the horticulture industry; and clamshell packing, blister packs, returnable pallets, and handling trays for shipping and storing odd-shaped or difficult-to-handle parts for customers in the medical and life sciences, industrial, recreation, and electronics industries. The company's Plastics segment manufactures polyvinyl chloride pipes for municipal water, rural water, wastewater, storm drainage system, and other uses. This segment markets its products to wholesalers and distributors through independent sales representatives, company salespersons, and customer service representatives. The company was formerly known as Otter Tail Power Company and changed its name to Otter Tail Corporation in 2001. Otter Tail Corporation was founded in 1907 and is headquartered in Fergus Falls, Minnesota.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Fergus Falls"}, "PBEV": {"short_name": "PREMIUM BEVERAGE G", "long_name": "Premium Beverage Group, Inc.", "summary": "Premium Beverage Group, Inc., through its subsidiaries, engages in the production of wine, brandy, and spirits. The company was founded in 2004 and is headquartered in Cutchogue, New York.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Cutchogue"}, "PCG": {"short_name": "Pacific Gas & Electric Co.", "long_name": "PG&E Corporation", "summary": "PG&E Corporation, through its subsidiary, Pacific Gas and Electric Company, engages in the sale and delivery of electricity and natural gas to customers in northern and central California, the United States. It generates electricity using nuclear, hydroelectric, fossil fuel-fired, fuel cell, and photovoltaic sources. As of December 31, 2019, the company owns and operates approximately 18,000 circuit miles of interconnected transmission lines, 33 electric transmission substations, approximately 107,000 circuit miles of distribution lines, 68 transmission switching substations, and 760 distribution substations; and natural gas transmission, storage, and distribution system consisting of approximately 43,300 miles of distribution pipelines, approximately 6,300 miles of backbone and local transmission pipelines, and various storage facilities. It serves residential, commercial, industrial, and agricultural customers, as well as natural gas-fired electric generation facilities. The company was incorporated in 1995 and is headquartered in San Francisco, California.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "San Francisco"}, "PCGU": {"short_name": "Pacific Gas & Electric Co. Equi", "long_name": "PG&E Corporation", "summary": "PG&E Corporation, through its subsidiary, Pacific Gas and Electric Company, engages in the sale and delivery of electricity and natural gas to customers in northern and central California, the United States. It generates electricity using nuclear, hydroelectric, fossil fuel-fired, fuel cell, and photovoltaic sources. As of December 31, 2019, the company owns and operates approximately 18,000 circuit miles of interconnected transmission lines, 33 electric transmission substations, approximately 107,000 circuit miles of distribution lines, 68 transmission switching substations, and 760 distribution substations; and natural gas transmission, storage, and distribution system consisting of approximately 43,300 miles of distribution pipelines, approximately 6,300 miles of backbone and local transmission pipelines, and various storage facilities. It serves residential, commercial, industrial, and agricultural customers, as well as natural gas-fired electric generation facilities. The company was incorporated in 1995 and is headquartered in San Francisco, California.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "San Francisco"}, "PCYO": {"short_name": "Pure Cycle Corporation", "long_name": "Pure Cycle Corporation", "summary": "Pure Cycle Corporation designs, constructs, operates, and maintains water and wastewater systems in the Denver metropolitan area and Colorado Front Range in the United States. It operates in two segments, Wholesale Water and Wastewater Services, and Land Development. The company engages in the wholesale water production, storage, treatment, and distribution systems; wastewater collection and treatment systems; development of master planned community; and oil and gas leasing business. It serves domestic, commercial, and industrial customers in the Denver metropolitan region. Pure Cycle Corporation was founded in 1976 and is based in Watkins, Colorado.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Watkins"}, "PEG": {"short_name": "Public Service Enterprise Group", "long_name": "Public Service Enterprise Group Incorporated", "summary": "Public Service Enterprise Group Incorporated, through its subsidiaries, operates as an energy company primarily in the Northeastern and Mid-Atlantic United States. It operates through two segments, PSE&G and PSEG Power. The PSE&G segment transmits electricity; distributes electricity and gas to residential, commercial, and industrial customers, as well as invests in solar generation projects, and energy efficiency and related programs; and offers appliance services and repairs. As of December 31, 2019, it had electric transmission and distribution system of 25,000 circuit miles and 858,000 poles; and 18,000 miles of gas mains, 12 gas distribution headquarters, 2 sub-headquarters, and 1 meter shop. This segment also owns and operates 52 switching stations with an aggregate installed capacity of 37,353 megavolt-amperes (MVA), as well as 244 substations with an aggregate installed capacity of 8,428 MVA; and 4 electric distribution headquarters and 5 sub-headquarters, as well as 58 natural gas metering and regulating stations. The Power segment operates nuclear, coal, gas, oil-fired, solar, and renewable generation facilities. Public Service Enterprise Group Incorporated was incorporated in 1985 and is based in Newark, New Jersey.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Newark"}, "PEO.DE": {"short_name": "EXELON CORP.", "long_name": "Exelon Corporation", "summary": "Exelon Corporation, a utility services holding company, engages in the generation and marketing of energy in the United States and Canada. It owns nuclear, fossil, wind, hydroelectric, biomass, and solar generating facilities. The company also sells electricity to wholesale and retail customers; and sells natural gas, renewable energy, and other energy-related products and services. In addition, it is involved in the purchase and regulated retail sale of electricity and natural gas; and transmission and distribution of electricity, and distribution of natural gas to retail customers. Further, the company offers support services, including legal, human resources, information technology, finance, supply management, engineering, customer operations, distribution and transmission planning, asset management, system operations, and power procurement services. It serves distribution utilities, municipalities, cooperatives, and financial institutions, as well as commercial, industrial, governmental, and residential customers. The company was incorporated in 1999 and is headquartered in Chicago, Illinois.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "GER", "market": "de_market", "country": "United States", "city": "Chicago"}, "PEO.F": {"short_name": "EXELON CORP.", "long_name": "Exelon Corporation", "summary": "Exelon Corporation, a utility services holding company, engages in the generation and marketing of energy in the United States and Canada. It owns nuclear, fossil, wind, hydroelectric, biomass, and solar generating facilities. The company also sells electricity to wholesale and retail customers; and sells natural gas, renewable energy, and other energy-related products and services. In addition, it is involved in the purchase and regulated retail sale of electricity and natural gas; and transmission and distribution of electricity, and distribution of natural gas to retail customers. Further, the company offers support services, including legal, human resources, information technology, finance, supply management, engineering, customer operations, distribution and transmission planning, asset management, system operations, and power procurement services. It serves distribution utilities, municipalities, cooperatives, and financial institutions, as well as commercial, industrial, governmental, and residential customers. The company was incorporated in 1999 and is headquartered in Chicago, Illinois.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Chicago"}, "PICO": {"short_name": "PICO Holdings Inc.", "long_name": "PICO Holdings, Inc.", "summary": "PICO Holdings, Inc., together with its subsidiaries, engages in the water resource and water storage activities in the southwestern United States. It engages in selling its water rights and storage credits in Arizona, Colorado, Nevada, and New Mexico. The Company sells its water rights to real estate developers, power generating facilities, or other commercial and industrial users, as well as to water utilities, municipalities, and other government agencies; and sells its stored water to state agencies, commercial developers, or municipalities for their commercial projects or communities. It also leases and sells water assets and land. PICO Holdings, Inc. was founded in 1981 and is based in Carson City, Nevada.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Carson City"}, "PNM": {"short_name": "PNM Resources, Inc. (Holding Co", "long_name": "PNM Resources, Inc.", "summary": "PNM Resources, Inc., through its subsidiaries, engages in the energy and energy-related businesses in the United States. It operates through Public Service Company of New Mexico (PNM) and Texas-New Mexico Power Company (TNMP) segments. The PNM segment is primarily involved in the generation, transmission, and distribution of electricity. It generates electricity using coal, natural gas and oil, nuclear fuel, solar, wind, and geothermal energy sources. As of December 31, 2018, this segment had owned or leased facilities with a total net generation capacity of 2,102 megawatts; and owned 3,206 miles of electric transmission lines, 6,067 miles of distribution overhead lines, 5,885 miles of underground distribution lines, and 255 substations. It also owns and leases office and other equipment, office space, vehicles, and real estate. The TNMP segment provides regulated transmission and distribution services. As of December 31, 2018, this segment owned 997 miles of overhead electric transmission lines, 7,151 miles of overhead distribution lines, 1,260 miles of underground distribution lines, and 122 substations. It also owns and leases vehicles, service facilities, and office locations throughout its service territory. The company serves approximately 782,000 residential, commercial, and industrial customers, as well as end-users of electricity in New Mexico and Texas. PNM Resources, Inc. was founded in 1917 and is headquartered in Albuquerque, New Mexico.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Albuquerque"}, "PNW": {"short_name": "Pinnacle West Capital Corporati", "long_name": "Pinnacle West Capital Corporation", "summary": "Pinnacle West Capital Corporation, through its subsidiary, Arizona Public Service Company, provides retail and wholesale electric services primarily in the state of Arizona. The company generates, transmits, and distributes electricity using coal, nuclear, gas, oil, and solar generating facilities. Its transmission facilities consist of approximately 6,192 pole miles of overhead lines and approximately 49 miles of underground lines; and distribution facilities comprise approximately 11,191 miles of overhead lines and approximately 22,092 miles of underground primary cable. The company serves approximately 1.3 million customers. It owns or leases approximately 6,316 megawatts of regulated generation capacity. The company was incorporated in 1985 and is headquartered in Phoenix, Arizona.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Phoenix"}, "POR": {"short_name": "Portland General Electric Co", "long_name": "Portland General Electric Company", "summary": "Portland General Electric Company, an integrated electric utility company, engages in the generation, wholesale purchase, transmission, distribution, and retail sale of electricity in the state of Oregon. The company operates seven thermal plants; seven hydroelectric plants; and two wind farms. As of December 31, 2019, it owned an electric transmission system consisting of 1,264 circuit miles, including 287 circuit miles of 500 kilovolt line, 423 circuit miles of 230 kilovolt line, and 554 miles of 115 kilovolt line. The company has 27,755 circuit miles of distribution lines. It also purchases and sells wholesale natural gas in the United States and Canada. The company serves approximately 895,000 residential, commercial, and industrial customers in 51 cities. Portland General Electric Company was founded in 1889 and is headquartered in Portland, Oregon.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Portland"}, "PPL": {"short_name": "PPL Corporation", "long_name": "PPL Corporation", "summary": "PPL Corporation, a utility holding company, delivers electricity and natural gas in the United States and the United Kingdom. The company operates through three segments: U.K. Regulated, Kentucky Regulated, and Pennsylvania Regulated. It serves approximately 418,000 electric and 329,000 natural gas customers in Louisville and adjacent areas in Kentucky; 530,000 electric customers in central, southeastern, and western Kentucky; and 28,000 electric customers in 5 counties in southwestern Virginia. The company also provides electric delivery services to approximately 1.4 million customers in Pennsylvania; operates electricity distribution networks in the United Kingdom; generates electricity from coal, gas, hydro, and solar sources in Kentucky; and sells wholesale electricity to 2 municipalities in Kentucky. PPL Corporation was founded in 1920 and is headquartered in Allentown, Pennsylvania.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Allentown"}, "PPWLM": {"short_name": "PACIFICORP", "long_name": "PacifiCorp", "summary": "PacifiCorp operates as an energy company that generates power from hydro, wind, natural gas, coal, solar, and geothermal resources. PacifiCorp was formerly known as PC/UP&L Merging Corp. and changed its name to PacifiCorp in January 1989. The company was incorporated in 1987 and is headquartered in Portland, Oregon. PacifiCorp operates as a subsidiary of PPW Holdings LLC.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Portland"}, "PPWLO": {"short_name": "PACIFICORP", "long_name": "PacifiCorp", "summary": "PacifiCorp operates as an energy company that generates power from hydro, wind, natural gas, coal, solar, and geothermal resources. PacifiCorp was formerly known as PC/UP&L Merging Corp. and changed its name to PacifiCorp in January 1989. The company was incorporated in 1987 and is headquartered in Portland, Oregon. PacifiCorp operates as a subsidiary of PPW Holdings LLC.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Portland"}, "PRHL": {"short_name": "PREMIER HLDG CORP", "long_name": "Premier Holding Corporation", "summary": "Premier Holding Corporation, through its subsidiaries, provides energy services in the United States. It offers various electricity plans and upgrades to a facility's energy infrastructure to commercial middle market companies and residential customers. The company also provides deregulated power brokerage services for small businesses, warehouses, and distribution centers. The company was formerly known as OVM International Holding Corporation and changed its name to Premier Holding Corporation in November 2008. Premier Holding Corporation was founded in 1971 and is based in Tustin, California.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Tustin"}, "PVDG": {"short_name": "POVERTY DIGNIFIED INC", "long_name": "Poverty Dignified, Inc.", "summary": "Poverty Dignified, Inc. operates as a renewable energy company. It is involved in incubating solar technologies that establish electrification, education, connectivity, and community development infrastructures in rural communities to empower the individual, community, and local economy. The company was founded in 2013 and is headquartered in Belmont, North Carolina.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Belmont"}, "PWCO": {"short_name": "PWRCOR INC", "long_name": "PwrCor, Inc.", "summary": "PwrCor, Inc. provides energy infrastructure and alternative energy solutions in the United States. The company manages infrastructure projects, such as hospitals and universities for commercial and institutional customers. Its projects include a combination of energy infrastructure components, including electrical power generation, steam production, or chilled water production projects, as well as the infrastructure to distribute these services. The company also commercializes engine technology that converts low-grade heat to mechanical energy for power generation. It serves domestic non-profit institutions and organizations; the waste-heat-to-energy and geothermal marketplace; and the independent power producer market. The company was formerly known as Receivable Acquisition & Management Corporation and changed its name to PwrCor, Inc. in March 2017. PwrCor, Inc. is headquartered in New York, New York.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "New York"}, "RENU": {"short_name": "RENUEN CORP", "long_name": "RenuEn Corporation", "summary": "RenuEn Corporation operates as a renewable energy development, engineering, procurement, and construction (EPC) company. It sells and installs various products and services that provide alternative energy saving solutions, including heat resistant barriers, insulation, window film, solar air conditioning, heating and air conditioning systems, solar hot water systems, photovoltaic solar systems, and other energy saving products for residential and commercial consumers. The company was formerly known as Shaka Shoes, Inc. and changed its name to RenuEn Corporation in December 2011. RenuEn Corporation is based in Jupiter, Florida.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Jupiter"}, "RGCO": {"short_name": "RGC Resources Inc.", "long_name": "RGC Resources, Inc.", "summary": "RGC Resources, Inc., through its subsidiaries, operates as an energy services company. The company sells and distributes natural gas to residential, commercial, and industrial customers in Roanoke, Virginia, and the surrounding localities. It also provides various unregulated services. The company operates approximately 1,144 miles of transmission and distribution pipeline; and a liquefied natural gas storage facility, as well as owns and operates 9 metering stations. RGC Resources, Inc. was founded in 1883 and is based in Roanoke, Virginia.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "NGM", "market": "us_market", "country": "United States", "city": "Roanoke"}, "RIGH": {"short_name": "RIGHTSMILE INC", "long_name": "Bud Genius, Inc.", "summary": "Bud Genius, Inc. provides cannabis testing and profiling services. It also offers cloud-based health care solutions that utilize smartphones to upload health data in real-time to caregivers and naturopathy physicians; celebrity-endorsed product licensing services; and retail merchandising services. In addition, the company provides data-driven rating systems for marijuana strains; and cannabis. The company is based in Carlsbad, California.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Carlsbad"}, "RNWR": {"short_name": "808 RENEWABLE ENERGY CORP", "long_name": "808 Renewable Energy Corporation", "summary": "808 Renewable Energy Corporation acquires, owns, develops, operates, and distributes on-site energy systems that produce electricity, hot water, heat, and cooling in the United States. The company also purchases and sells power generation equipment; and operates, repairs, and maintains power generation equipment for other energy facility owners. As of December 31, 2015, it had 4 operating energy systems. The company was founded in 2009 and is based in Garden Grove, California.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Garden Grove"}, "S1RE34.SA": {"short_name": "SEMPRA ENERGDRN", "long_name": "Sempra Energy", "summary": "Sempra Energy operates as an energy-services holding company in the United States and internationally. The company's San Diego Gas & Electric Company segment generates, transmits, and distributes electricity; and supplies natural gas. It provides electric services to a population of approximately 3.7 million and natural gas services to approximately 3.4 million of that population covering an area of 4,100 square miles. Its Southern California Gas Company segment owns and operates a natural gas distribution, transmission, and storage system that supplies natural gas to a population of approximately 22 million covering an area of 24,000 square miles. The company's Sempra Texas Utilities segment is involved in the regulated transmission and distribution of electricity serving approximately 3.6 million homes and businesses, and operating approximately 139,000 miles of transmission and distribution lines. Its transmission system included 17,799 circuit miles of transmission lines, 349 transmission stations, and 775 distribution substations; distribution system consisted of 121,747 miles of overhead and underground lines; and approximately 65 miles of electric transmission lines. Its Sempra Mexico segment develops, owns and operates, or holds interests in natural gas, electric, liquefied natural gas (LNG), liquid petroleum gas (LPG), ethane, and liquid fuels infrastructure; and engages in the purchase of LNG, and purchase and sale of natural gas. This segment operates a natural-gas-fired combined-cycle plant, and wind and solar power generation facilities. Its assets/facilities consisted of 1,850 miles of natural gas transmission pipelines, 13 compressor stations, 139 miles of ethane pipelines, 118 miles of LPG pipelines, and one LPG storage terminal. The company's Sempra LNG segment develops and holds interest in export of LNG; and owns, operates, buys, sells, and transports natural gas. The company was founded in 1998 and is headquartered in San Diego, California.", "currency": "BRL", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "SAO", "market": "br_market", "country": "United States", "city": "San Diego"}, "SE4.DE": {"short_name": "SEMPRA ENERGY", "long_name": "Sempra Energy", "summary": "Sempra Energy operates as an energy-services holding company in the United States and internationally. The company's San Diego Gas & Electric Company segment generates, transmits, and distributes electricity; and supplies natural gas. It provides electric services to a population of approximately 3.7 million and natural gas services to approximately 3.4 million of that population covering an area of 4,100 square miles. Its Southern California Gas Company segment owns and operates a natural gas distribution, transmission, and storage system that supplies natural gas to a population of approximately 22 million covering an area of 24,000 square miles. The company's Sempra Texas Utilities segment is involved in the regulated transmission and distribution of electricity serving approximately 3.6 million homes and businesses, and operating approximately 139,000 miles of transmission and distribution lines. Its transmission system included 17,799 circuit miles of transmission lines, 349 transmission stations, and 775 distribution substations; distribution system consisted of 121,747 miles of overhead and underground lines; and approximately 65 miles of electric transmission lines. Its Sempra Mexico segment develops, owns and operates, or holds interests in natural gas, electric, liquefied natural gas (LNG), liquid petroleum gas (LPG), ethane, and liquid fuels infrastructure; and engages in the purchase of LNG, and purchase and sale of natural gas. This segment operates a natural-gas-fired combined-cycle plant, and wind and solar power generation facilities. Its assets/facilities consisted of 1,850 miles of natural gas transmission pipelines, 13 compressor stations, 139 miles of ethane pipelines, 118 miles of LPG pipelines, and one LPG storage terminal. The company's Sempra LNG segment develops and holds interest in export of LNG; and owns, operates, buys, sells, and transports natural gas. The company was founded in 1998 and is headquartered in San Diego, California.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "GER", "market": "de_market", "country": "United States", "city": "San Diego"}, "SE4.F": {"short_name": "SEMPRA ENERGY", "long_name": "Sempra Energy", "summary": "Sempra Energy operates as an energy-services holding company in the United States and internationally. The company's San Diego Gas & Electric Company segment generates, transmits, and distributes electricity; and supplies natural gas. It provides electric services to a population of approximately 3.7 million and natural gas services to approximately 3.4 million of that population covering an area of 4,100 square miles. Its Southern California Gas Company segment owns and operates a natural gas distribution, transmission, and storage system that supplies natural gas to a population of approximately 22 million covering an area of 24,000 square miles. The company's Sempra Texas Utilities segment is involved in the regulated transmission and distribution of electricity serving approximately 3.6 million homes and businesses, and operating approximately 139,000 miles of transmission and distribution lines. Its transmission system included 17,799 circuit miles of transmission lines, 349 transmission stations, and 775 distribution substations; distribution system consisted of 121,747 miles of overhead and underground lines; and approximately 65 miles of electric transmission lines. Its Sempra Mexico segment develops, owns and operates, or holds interests in natural gas, electric, liquefied natural gas (LNG), liquid petroleum gas (LPG), ethane, and liquid fuels infrastructure; and engages in the purchase of LNG, and purchase and sale of natural gas. This segment operates a natural-gas-fired combined-cycle plant, and wind and solar power generation facilities. Its assets/facilities consisted of 1,850 miles of natural gas transmission pipelines, 13 compressor stations, 139 miles of ethane pipelines, 118 miles of LPG pipelines, and one LPG storage terminal. The company's Sempra LNG segment develops and holds interest in export of LNG; and owns, operates, buys, sells, and transports natural gas. The company was founded in 1998 and is headquartered in San Diego, California.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "San Diego"}, "SJI": {"short_name": "South Jersey Industries, Inc.", "long_name": "South Jersey Industries, Inc.", "summary": "South Jersey Industries, Inc., through its subsidiaries, provides energy-related products and services. The company engages in the purchase, transmission, and sale of natural gas. It also sells natural gas and pipeline transportation capacity on a wholesale basis to residential, commercial, and industrial customers on the interstate pipeline system, as well as transports natural gas purchased directly from producers or suppliers to customers. As of December 31, 2019, the company had approximately 146 miles of mains in the transmission system and 6,701 miles of mains in the distribution system; and served 397,090 residential, commercial, and industrial customers in southern New Jersey. In addition, it markets natural gas storage, commodity, and transportation assets on a wholesale basis for energy marketers, electric and gas utilities, power plants, and natural gas producers in the mid-Atlantic, Appalachian, and southern regions of the United States. Further, the company develops, owns, and operates energy related projects, including natural gas fueled combined heating, cooling and power, and landfill gas-to-energy production facilities, as well as solar-generation sites. Additionally, it owns oil, gas, and mineral rights in the Marcellus Shale region of Pennsylvania; acquires and markets natural gas and electricity to retail end users, as well as provides total energy management, fuel management, and procurement and cost reduction services. South Jersey Industries, Inc. was founded in 1910 and is headquartered in Folsom, New Jersey.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Folsom"}, "SJW": {"short_name": "SJW Group", "long_name": "SJW Group", "summary": "SJW Group, through its subsidiaries, provides water utility services in the United States. It engages in the production, purchase, storage, purification, distribution, wholesale, and retail sale of water and wastewater services. The company also provides non-tariffed services, including water system operations, maintenance agreements, and antenna site leases; contracted services and sewer operations to water utilities in Connecticut; and a Linebacker, subscription service line protection plan for public drinking water customers, as well as offers repair or replace a leaking or broken water service line, curb box, curb box cover, meter pit, meter pit cover, and meter pit valve. Its water supply consists of groundwater from wells, surface water from watershed run-off and diversion, reclaimed water, and imported water purchased from the Santa Clara Valley Water District. The company offers water service to approximately 231,000 connections that serve approximately one million people residing in portions of the cities of San Jose and Cupertino, as well as in the cities of Campbell, Monte Sereno, Saratoga, and the Town of Los Gatos; and adjacent unincorporated territories in the County of Santa Clara in the State of California. In addition, it provides water service to approximately 18,000 connections, which serve 54,000 people in a service area comprising 246 square miles in the region between San Antonio and Austin, Texas; and 137,000 connections that serve approximately 480,000 people in 80 municipalities in Connecticut and Maine, and approximately 3,000 wastewater connections in Southbury, Connecticut. Further, the company owns undeveloped land in California and Tennessee; and owns and operates commercial buildings and warehouse properties in Tennessee. The company was formerly known as SJW Corp. and changed its name to SJW Group in November 2016. SJW Group was founded in 1866 and is headquartered in San Jose, California.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "San Jose"}, "SO": {"short_name": "Southern Company (The)", "long_name": "The Southern Company", "summary": "The Southern Company, through its subsidiaries, engages in the generation, transmission, and distribution of electricity. It operates in four segments: Gas Distribution Operations, Gas Pipeline Investments, Wholesale Gas Services, and Gas Marketing Services. The company also constructs, acquires, owns, and manages power generation assets, including renewable energy facilities and sells electricity in the wholesale market; and distributes natural gas in Illinois, Georgia, Virginia, and Tennessee, as well as provides gas marketing services, wholesale gas services, and gas pipeline investments operations. It owns and/or operates 30 hydroelectric generating stations, 24 fossil fuel generating stations, 3 nuclear generating stations, 13 combined cycle/cogeneration stations, 42 solar facilities, 10 wind facilities, and 1 biomass facility; and constructs, operates, and maintains 75,585 miles of natural gas pipelines and 14 storage facilities with total capacity of 157 Bcf to provide natural gas to residential, commercial, and industrial customers. The company serves approximately 8 million electric and gas utility customers. It also provides products and services in the areas of energy efficiency, and utility infrastructure. In addition, the company offers digital wireless communications services with various communication options, including push to talk, cellular service, text messaging, wireless Internet access, and wireless data. The Southern Company was incorporated in 1945 and is headquartered in Atlanta, Georgia.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Atlanta"}, "SOLN.MX": {"short_name": "RENESOLA LTD", "long_name": "ReneSola Ltd", "summary": "ReneSola Ltd., through its subsidiaries, develops, builds, operates, and sells solar power projects. It operates through three segments: Solar Power Project Development, EPC Services, and Electricity Generation Revenue. The company also develops community solar gardens; and sells projects rights. In addition, its engineering, and procurement and construction business includes engineering design, procurement of solar modules, balance-of-system components and other components, and construction contracting and management services. Further, the company generates and sells electricity. As of February 28, 2019, it operated approximately 100 solar power projects with an aggregate capacity of 232 MW. ReneSola Ltd. has operations in the United States and Europe. The company was founded in 2005 and is headquartered in Stamford, Connecticut.", "currency": "MXN", "sector": "Utilities", "industry": "Diversified Utilities", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Stamford"}, "SPH": {"short_name": "Suburban Propane Partners, L.P.", "long_name": "Suburban Propane Partners, L.P.", "summary": "Suburban Propane Partners, L.P., through its subsidiaries, engages in the retail marketing and distribution of propane, fuel oil, and refined fuels. The company operates in four segments: Propane, Fuel Oil and Refined Fuels, Natural Gas and Electricity, and All Other. The Propane segment is involved in the retail distribution of propane to residential, commercial, industrial, and agricultural customers, as well as in the wholesale distribution to industrial end users. It offers propane primarily for space heating, water heating, cooking, and clothes drying in the residential and commercial markets; for use as a motor fuel in internal combustion engines to power over-the-road vehicles, forklifts, and stationary engines, as well as to fire furnaces, as a cutting gas to the industrial customers, and in other process applications; and for tobacco curing, crop drying, poultry brooding, and weed control in the agricultural markets. The Fuel Oil and Refined Fuels segment engages in the retail distribution of fuel oil, diesel, kerosene, and gasoline to residential and commercial customers for use primarily as a source of heat in homes and buildings. The Natural Gas and Electricity segment markets natural gas and electricity to residential and commercial customers in the deregulated energy markets in New York and Pennsylvania. The All Other segment sells, installs, and services a range of home comfort equipment, including whole-house heating products, air cleaners, humidifiers, and space heaters. As of September 26, 2020, the company served approximately 1.0 million residential, commercial, industrial, and agricultural customers through 700 locations in 41 states primarily in the east and west coast regions of the United States, as well as portions of the midwest region of the United States and Alaska. Suburban Energy Services Group LLC serves as a general partner of Suburban Propane Partners, L.P. The company was founded in 1945 and is headquartered in Whippany, New Jersey.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Whippany"}, "SPKE": {"short_name": "Spark Energy, Inc.", "long_name": "Spark Energy, Inc.", "summary": "Spark Energy, Inc., through its subsidiaries, operates as an independent retail energy services company in the United States. It operates through two segments, Retail Electricity and Retail Natural Gas. The company engages in the retail sales and distribution of electricity and natural gas to residential and commercial customers. As of December 31, 2019, it operated in 94 utility service territories across 19 states and the District of Columbia, and had approximately 672,000 residential customer equivalents. The company was founded in 1999 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Houston"}, "SPKEP": {"short_name": "Spark Energy, Inc. - 8.75% Seri", "long_name": "Spark Energy, Inc.", "summary": "Spark Energy, Inc., through its subsidiaries, operates as an independent retail energy services company in the United States. It operates through two segments, Retail Electricity and Retail Natural Gas. The company engages in the retail sales and distribution of electricity and natural gas to residential and commercial customers. As of December 31, 2019, it operated in 94 utility service territories across 19 states and the District of Columbia, and had approximately 672,000 residential customer equivalents. The company was founded in 1999 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Houston"}, "SR": {"short_name": "Spire Inc.", "long_name": "Spire Inc.", "summary": "Spire Inc., through its subsidiaries, engages in the purchase, retail distribution, and sale of natural gas to residential, commercial, industrial, and other end-users of natural gas in the United States. The company operates in two segments, Gas Utility and Gas Marketing. It is also involved in the marketing of natural gas; and provision of energy services on non-regulated basis to on-system utility transportation customers, as well as to retail and wholesale customers. In addition, the company engages in the transportation of propane through its propane pipeline; compression of natural gas; risk management; and other activities. Further, it provides physical natural gas storage services. The company was formerly known as The Laclede Group, Inc. and changed its name to Spire Inc. in April 2016. Spire Inc. was founded in 1857 and is based in St. Louis, Missouri.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "St. Louis"}, "SR-PA": {"short_name": "Spire Inc. Depositary Shares, e", "long_name": "Spire Inc.", "summary": "Spire Inc., through its subsidiaries, engages in the purchase, retail distribution, and sale of natural gas to residential, commercial, industrial, and other end-users of natural gas in the United States. The company operates in two segments, Gas Utility and Gas Marketing. It is also involved in the marketing of natural gas; and provision of energy services on non-regulated basis to on-system utility transportation customers, as well as to retail and wholesale customers. In addition, the company engages in the transportation of propane through its propane pipeline; compression of natural gas; risk management; and other activities. Further, it provides physical natural gas storage services. The company was formerly known as The Laclede Group, Inc. and changed its name to Spire Inc. in April 2016. Spire Inc. was founded in 1857 and is based in St. Louis, Missouri.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "St. Louis"}, "SRE": {"short_name": "Sempra Energy", "long_name": "Sempra Energy", "summary": "Sempra Energy operates as an energy-services holding company in the United States and internationally. The company's San Diego Gas & Electric Company segment generates, transmits, and distributes electricity; and supplies natural gas. It provides electric services to a population of approximately 3.7 million and natural gas services to approximately 3.4 million of that population covering an area of 4,100 square miles. Its Southern California Gas Company segment owns and operates a natural gas distribution, transmission, and storage system that supplies natural gas to a population of approximately 22 million covering an area of 24,000 square miles. The company's Sempra Texas Utilities segment is involved in the regulated transmission and distribution of electricity serving approximately 3.6 million homes and businesses, and operating approximately 139,000 miles of transmission and distribution lines. Its transmission system included 17,799 circuit miles of transmission lines, 349 transmission stations, and 775 distribution substations; distribution system consisted of 121,747 miles of overhead and underground lines; and approximately 65 miles of electric transmission lines. Its Sempra Mexico segment develops, owns and operates, or holds interests in natural gas, electric, liquefied natural gas (LNG), liquid petroleum gas (LPG), ethane, and liquid fuels infrastructure; and engages in the purchase of LNG, and purchase and sale of natural gas. This segment operates a natural-gas-fired combined-cycle plant, and wind and solar power generation facilities. Its assets/facilities consisted of 1,850 miles of natural gas transmission pipelines, 13 compressor stations, 139 miles of ethane pipelines, 118 miles of LPG pipelines, and one LPG storage terminal. The company's Sempra LNG segment develops and holds interest in export of LNG; and owns, operates, buys, sells, and transports natural gas. The company was founded in 1998 and is headquartered in San Diego, California.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "San Diego"}, "SRE-PB": {"short_name": "Sempra Energy 6.75% Mandatory C", "long_name": "Sempra Energy", "summary": "Sempra Energy operates as an energy-services holding company in the United States and internationally. The company's San Diego Gas & Electric Company segment generates, transmits, and distributes electricity; and supplies natural gas. It provides electric services to a population of approximately 3.7 million and natural gas services to approximately 3.4 million of that population covering an area of 4,100 square miles. Its Southern California Gas Company segment owns and operates a natural gas distribution, transmission, and storage system that supplies natural gas to a population of approximately 22 million covering an area of 24,000 square miles. The company's Sempra Texas Utilities segment is involved in the regulated transmission and distribution of electricity serving approximately 3.6 million homes and businesses, and operating approximately 139,000 miles of transmission and distribution lines. Its transmission system included 17,799 circuit miles of transmission lines, 349 transmission stations, and 775 distribution substations; distribution system consisted of 121,747 miles of overhead and underground lines; and approximately 65 miles of electric transmission lines. Its Sempra Mexico segment develops, owns and operates, or holds interests in natural gas, electric, liquefied natural gas (LNG), liquid petroleum gas (LPG), ethane, and liquid fuels infrastructure; and engages in the purchase of LNG, and purchase and sale of natural gas. This segment operates a natural-gas-fired combined-cycle plant, and wind and solar power generation facilities. Its assets/facilities consisted of 1,850 miles of natural gas transmission pipelines, 13 compressor stations, 139 miles of ethane pipelines, 118 miles of LPG pipelines, and one LPG storage terminal. The company's Sempra LNG segment develops and holds interest in export of LNG; and owns, operates, buys, sells, and transports natural gas. The company was founded in 1998 and is headquartered in San Diego, California.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "San Diego"}, "SRE.MX": {"short_name": "SEMPRA ENERGY", "long_name": "Sempra Energy", "summary": "Sempra Energy operates as an energy-services holding company in the United States and internationally. The company's San Diego Gas & Electric Company segment generates, transmits, and distributes electricity; and supplies natural gas. It provides electric services to a population of approximately 3.7 million and natural gas services to approximately 3.4 million of that population covering an area of 4,100 square miles. Its Southern California Gas Company segment owns and operates a natural gas distribution, transmission, and storage system that supplies natural gas to a population of approximately 22 million covering an area of 24,000 square miles. The company's Sempra Texas Utilities segment is involved in the regulated transmission and distribution of electricity serving approximately 3.6 million homes and businesses, and operating approximately 139,000 miles of transmission and distribution lines. Its transmission system included 17,799 circuit miles of transmission lines, 349 transmission stations, and 775 distribution substations; distribution system consisted of 121,747 miles of overhead and underground lines; and approximately 65 miles of electric transmission lines. Its Sempra Mexico segment develops, owns and operates, or holds interests in natural gas, electric, liquefied natural gas (LNG), liquid petroleum gas (LPG), ethane, and liquid fuels infrastructure; and engages in the purchase of LNG, and purchase and sale of natural gas. This segment operates a natural-gas-fired combined-cycle plant, and wind and solar power generation facilities. Its assets/facilities consisted of 1,850 miles of natural gas transmission pipelines, 13 compressor stations, 139 miles of ethane pipelines, 118 miles of LPG pipelines, and one LPG storage terminal. The company's Sempra LNG segment develops and holds interest in export of LNG; and owns, operates, buys, sells, and transports natural gas. The company was founded in 1998 and is headquartered in San Diego, California.", "currency": "MXN", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "San Diego"}, "SUME": {"short_name": "SUMMER ENERGY HOLDINGS INC", "long_name": "Summer Energy Holdings, Inc.", "summary": "Summer Energy Holdings, Inc., through its subsidiaries, operates as a retail electric provider in Texas, Massachusetts, New Hampshire, Ohio, and Illinois. It procures wholesale energy and resells to commercial and residential customers. The company was founded in 2011 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "SWX": {"short_name": "Southwest Gas Holdings, Inc.", "long_name": "Southwest Gas Holdings, Inc.", "summary": "Southwest Gas Holdings, Inc., through its subsidiaries, purchases, distributes, and transports natural gas in Arizona, Nevada, and California. The company operates in two segments, Natural Gas Operations and Utility Infrastructure Services. As of December 31, 2019, it had 2,081,000 residential, commercial, industrial, and other natural gas customers. The company also provides trenching and installation, replacement, and maintenance services for energy distribution systems; and industrial construction solutions. Southwest Gas Holdings, Inc. was founded in 1931 and is headquartered in Las Vegas, Nevada.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Las Vegas"}, "SZR.F": {"short_name": "SOUTHWEST GAS HLDGS  DL 1", "long_name": "Southwest Gas Holdings, Inc.", "summary": "Southwest Gas Holdings, Inc., through its subsidiaries, purchases, distributes, and transports natural gas in Arizona, Nevada, and California. The company operates in two segments, Natural Gas Operations and Utility Infrastructure Services. As of December 31, 2019, it had 2,081,000 residential, commercial, industrial, and other natural gas customers. The company also provides trenching and installation, replacement, and maintenance services for energy distribution systems; and industrial construction solutions. Southwest Gas Holdings, Inc. was founded in 1931 and is headquartered in Las Vegas, Nevada.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Las Vegas"}, "TORW": {"short_name": "TORRINGTON WATER CO", "long_name": "The Torrington Water Company", "summary": "The Torrington Water Company operates as a regulated public water utility. It offers water sources to approximately 10,000 customers in the city of Torrington, as well as in the towns of Burlington, Harwinton, Litchfield, and New Hartford, Connecticut. The company was founded in 1873 and is based in Torrington, Connecticut.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Torrington"}, "TPII": {"short_name": "TRIAD PRO INNOVATORS INC", "long_name": "Triad Pro Innovators, Inc.", "summary": "Triad Pro Innovators, Inc. operates as a renewable energy producer and storage provider. It owns and operates combined heat and power renewable energy facilities in California and the Western United States. The company is also involved in the purchase and sale of power generation equipment, as well as in the operation, repair, and maintenance of power generation equipment for other energy facility owners. In addition, it offers energy storage solutions for residential, small business, industrial, and utility applications. The company was formerly known as Shing-Mei International, Inc. and changed its name to Triad Pro Innovators, Inc. in January 2012. Triad Pro Innovators, Inc. was founded in 1994 and is based in La Quinta, California.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "La Quinta"}, "TRNF": {"short_name": "TARONIS FUELS INC", "long_name": "Taronis Fuels, Inc.", "summary": "Taronis Fuels, Inc. operates as a renewable fuel and power generation company in the United States. It manufactures, sells, and distributes MagneGas, which is a metal cutting fuel. The company sells and distributes a line of industrial gases and welding equipment and services to a range of end market users, including metalworking, manufacturing, utility power plants, medical, agriculture, transportation, repair, demolition, salvage, and other industries. Taronis Fuels, Inc. operates 28 industrial gas retail locations. The company was founded in 2017 and is headquartered in Peoria, Arizona.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Peoria"}, "UELMO": {"short_name": "UNION ELECTRIC COMPANY", "long_name": "Union Electric Company", "summary": "Union Electric Company, doing business as Ameren Missouri, operates as an electric utility that provides electric services in central and eastern Missouri. The company was founded in 1902 and is based in Saint Louis, Missouri. Union Electric Company operates as a subsidiary of Ameren Corporation.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Saint Louis"}, "UEPCN": {"short_name": "UNION ELECTRIC COMPANY", "long_name": "Union Electric Company", "summary": "Union Electric Company, doing business as Ameren Missouri, operates as an electric utility that provides electric services in central and eastern Missouri. The company was founded in 1902 and is based in Saint Louis, Missouri. Union Electric Company operates as a subsidiary of Ameren Corporation.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Saint Louis"}, "UEPCP": {"short_name": "UNION ELECTRIC COMPANY", "long_name": "Union Electric Company", "summary": "Union Electric Company, doing business as Ameren Missouri, operates as an electric utility that provides electric services in central and eastern Missouri. The company was founded in 1902 and is based in Saint Louis, Missouri. Union Electric Company operates as a subsidiary of Ameren Corporation.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Saint Louis"}, "UEPEM": {"short_name": "UNION ELECTRIC COMPANY", "long_name": "Union Electric Company", "summary": "Union Electric Company, doing business as Ameren Missouri, operates as an electric utility that provides electric services in central and eastern Missouri. The company was founded in 1902 and is based in Saint Louis, Missouri. Union Electric Company operates as a subsidiary of Ameren Corporation.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Saint Louis"}, "UEPEN": {"short_name": "UNION ELECTRIC COMPANY", "long_name": "Union Electric Company", "summary": "Union Electric Company, doing business as Ameren Missouri, operates as an electric utility that provides electric services in central and eastern Missouri. The company was founded in 1902 and is based in Saint Louis, Missouri. Union Electric Company operates as a subsidiary of Ameren Corporation.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Saint Louis"}, "UEPEO": {"short_name": "UNION ELECTRIC COMPANY", "long_name": "Union Electric Company", "summary": "Union Electric Company, doing business as Ameren Missouri, operates as an electric utility that provides electric services in central and eastern Missouri. The company was founded in 1902 and is based in Saint Louis, Missouri. Union Electric Company operates as a subsidiary of Ameren Corporation.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Saint Louis"}, "UEPEP": {"short_name": "UNION ELECTRIC COMPANY", "long_name": "Union Electric Company", "summary": "Union Electric Company, doing business as Ameren Missouri, operates as an electric utility that provides electric services in central and eastern Missouri. The company was founded in 1902 and is based in Saint Louis, Missouri. Union Electric Company operates as a subsidiary of Ameren Corporation.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Saint Louis"}, "UGI": {"short_name": "UGI Corporation", "long_name": "UGI Corporation", "summary": "UGI Corporation distributes, stores, transports, and markets energy products and related services in the United States and internationally. The company operates through four segments: AmeriGas Propane, UGI International, Midstream & Marketing, and UGI Utilities. It distributes propane to approximately 1.5 million residential, commercial/industrial, motor fuel, agricultural, and wholesale customers through 1,800 propane distribution locations; and sells, installs, and services propane appliances, including heating systems and propane-powered generators. The company also distributes liquefied petroleum gases (LPG) to residential, commercial, industrial, agricultural, wholesale and automobile fuel customers; and provides logistics, storage, and other services to third-party LPG distributors. In addition, it engages in the retail sale of natural gas, liquid fuels, and electricity to approximately 14,000 residential, commercial, and industrial customers at 45,000 locations. Further, the company distributes natural gas to approximately 670,000 customers in the portions of 46 eastern and central Pennsylvania counties through its distribution system of 12,300 miles of gas mains; and supplies electricity to approximately 62,500 customers in northeastern Pennsylvania through 2,500 miles of lines and 14 substations. Additionally, it operates electric generation facilities, which include coal-fired, landfill gas-fueled, solar-powered, and natural gas-fueled facilities; a natural gas liquefaction, storage, and vaporization facility; propane storage and propane-air mixing stations; and rail transshipment terminals. It also manages natural gas pipeline and storage contracts; develops, owns, and operates pipelines, gathering infrastructure, and gas storage facilities. UGI Corporation was founded in 1882 and is headquartered in King of Prussia, Pennsylvania.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "King of Prussia"}, "USWF": {"short_name": "U S WIND FARMING INC", "long_name": "U.S. Wind Farming, Inc.", "summary": "U.S. Wind Farming, Inc. operates as a renewable energy developer and operator in the United States. It operates wind turbine on farmers properties. The company is based in Chicago, Illinois.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Chicago"}, "UTL": {"short_name": "UNITIL Corporation", "long_name": "Unitil Corporation", "summary": "Unitil Corporation, a public utility holding company, engages in the distribution of electricity and natural gas. It operates through three segments: Utility Gas Operations, Utility Electric Operations, and Non-Regulated. The company distributes electricity in the southeastern seacoast and state capital regions of New Hampshire, and the greater Fitchburg area of north central Massachusetts; and distributes natural gas in southeastern New Hampshire and portions of southern and central Maine, including the city of Portland and the Lewiston-Auburn area, as well as the greater Fitchburg area of north central Massachusetts. It also operates 86 miles of interstate underground natural gas transmission pipeline that provides interstate natural gas pipeline access and transportation services primarily in Maine and New Hampshire. In addition, the company provides energy brokering and advisory services to commercial and industrial customers; and real estate management services. It serves approximately 106,100 electric customers and 83,900 natural gas customers. Unitil Corporation was founded in 1984 and is headquartered in Hampton, New Hampshire.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Hampton"}, "VCII": {"short_name": "VIVICELLS INTERNATIONAL INC", "long_name": "ViviCells International, Inc.", "summary": "ViviCells International, Inc. operates as a stem cell preservation company. ViviCells International, Inc. was formerly known as Tropical Beverage Inc. and changed its name to ViviCells International, Inc. in May 2008. The company was incorporated in 1995 and is based in Evanston, Illinois.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Evanston"}, "VGREF": {"short_name": "VIASPACE GREEN ENERGY INC", "long_name": "VIASPACE Green Energy Inc.", "summary": "VIASPACE Green Energy Inc., a renewable energy company, manufacture and sells framed artwork in the United States. It operates through two segments, Framed-Artwork and Grass. The Framed-Artwork segment manufactures copyrighted framed artwork in the People's Republic of China for retail stores. The Grass Segment produces Giant King Grass, a natural hybrid, non-genetically modified, and perennial grass, which is used to generate low carbon and renewable electricity by burning in a biomass power plant; used to produce bio methane through anaerobic digestion; used as a feedstock for non-food liquid biofuels, such as bio ethanol and bio butanol; and used as a feedstock for biochemicals and bio plastics, as well as used as animal feed. The company was founded in 2008 and is headquartered in Marietta, Georgia.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Marietta"}, "VIHD": {"short_name": "VISION HYDROGEN CORP", "long_name": "Vision Hydrogen Corporation", "summary": "Vision Hydrogen Corporation designs, sells, and installs solar, battery, fuel, and hydrogen energy systems for residential, commercial, and government sectors. It offers range of design, installation, and maintenance services for a range of technology services in the clean energy markets, including energy consumption audit, review of energy and tax credits available, feasibility studies, solar/battery energy system design, zoning and permitting analysis, site design/preparation and restoration, system startup, testing and commissioning, maintenance, and interconnection applications. The company also provides design, installation, and maintenance services for a range of technology products in the security systems, including commercial alarm systems, access control, and video surveillance systems. In addition, it offers design, installation, maintenance, and emergency service of environmental systems. The company was formerly known as H/Cell Energy Corporation and changed its name to Vision Hydrogen Corporation in October 2020. The company was founded in 2015 and is based in Jersey City, New Jersey.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Jersey City"}, "VSPC": {"short_name": "VIASPACE INC", "long_name": "VIASPACE Inc.", "summary": "VIASPACE Inc. engages in the renewable energy business in the United States and internationally. It develops Giant King Grass (GKG), a biomass and energy crop. The company's GKG could be burned in biomass power plants to generate electricity; made into pellets that could be burned together with coal to reduce carbon emissions from existing power plants; generated bio methane through anaerobic digestion; and used as a feedstock for low carbon liquid biofuels for transportation, biochemical, and bio plastics, as well as animal feed. VIASPACE Inc. was founded in 1998 and is based in Santa Cruz, California.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Santa Cruz"}, "VST": {"short_name": "Vistra Corp.", "long_name": "Vistra Corp.", "summary": "Vistra Corp., through its subsidiaries, engages in the electricity business in the United States. It operates through Retail, ERCOT, PJM, NY/NE, MISO, and Asset Closure segments. The company retails electricity and natural gas to residential, commercial and industrial customers across 20 states in the United States. It is also involved in the electricity generation, wholesale energy sales and purchases, commodity risk management, fuel production, and fuel logistics management activities. The company serves approximately 4.6 million residential, commercial, and industrial customers. It has a production capacity of approximately 38,500 megawatts with a portfolio of natural gas, nuclear, coal, solar, and battery energy storage facilities. The company was formerly known as Vistra Energy Corp. and changed its name to Vistra Corp. in July 2020. Vistra Corp. was founded in 1882 and is based in Irving, Texas.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Independent Power Producers", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Irving"}, "WEC": {"short_name": "WEC Energy Group, Inc.", "long_name": "WEC Energy Group, Inc.", "summary": "WEC Energy Group, Inc., through its subsidiaries, provides regulated natural gas and electricity, and nonregulated renewable energy services in the United States. The company operates through six segments: Wisconsin, Illinois, Other States, Electric Transmission, Non-Utility Energy Infrastructure, and Corporate and Other. It generates and distributes electricity from coal, natural gas, oil, hydroelectric, wind, and biomass sources; provides electricity transmission services; offers retail natural gas distribution services; transports natural gas; and generates, distributes, and sells steam. The company offers electricity to approximately 1.6 million residential, small and large commercial and industrial, and other customers; and natural gas to 2.9 million residential, and commercial and industrial customers. As of December 31, 2019, it operated approximately 36,500 miles of overhead distribution lines and 34,100 miles of underground distribution cable, as well as approximately 500 distribution substations and 503,200 line transformers; and approximately 49,500 miles of natural gas distribution mains, as well as 1,200 miles of natural gas transmission mains. The company was formerly known as Wisconsin Energy Corporation and changed its name to WEC Energy Group, Inc. in June 2015. WEC Energy Group, Inc. was incorporated in 1981 and is headquartered in Milwaukee, Wisconsin.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Milwaukee"}, "WGEI": {"short_name": "WINDGEN ENERGY INC", "long_name": "WindGen Energy, Inc.", "summary": "WindGen Energy, Inc. has an exclusive license agreement with Wind Sail Receptor, Inc. (WSR) for assembling and marketing WSR's wind sail receptor energy generation devices primarily in the United States, Canada, the United Kingdom, and Ireland. The company was formerly known as InMedica Development Corporation and changed its name to WindGen Energy, Inc in March 2010. WindGen Energy, Inc. was incorporated in 1983 and is based in Scottsdale, Arizona.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Scottsdale"}, "WNDW": {"short_name": "SOLARWINDOW TECHNOLOGIES INC", "long_name": "SolarWindow Technologies, Inc.", "summary": "SolarWindow Technologies, Inc. engages in developing electricity-generating coatings for use in building window and glass applications. The company's LiquidElectricity coatings generate electricity by harvesting light energy from natural sun, artificial light, and low, shaded, or reflected light conditions. It applies ultra-thin layers of LiquidElectricity coatings to rigid glass, and flexible glass and plastic surfaces where they transform otherwise ordinary surfaces into organic photovoltaic devices. The company's potential applications of LiquidElectricity coatings span various industries, including architectural, automotive, agrivoltaic, aerospace, commercial transportation, and marine. Its LiquidElectricity coatings and SolarWindow products are under development with support from commercial contract firms and at the U.S. Department of Energy's National Renewable Energy Laboratory, through cooperative research and development agreements. The company was formerly known as New Energy Technologies, Inc. and changed its name to SolarWindow Technologies, Inc. in March 2015. SolarWindow Technologies, Inc. was founded in 1998 and is based in New York, New York. SolarWindow Technologies, Inc. is a subsidiary of Kalen Capital Corporation.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "New York"}, "WTRG": {"short_name": "Essential Utilities, Inc.", "long_name": "Essential Utilities, Inc.", "summary": "Essential Utilities, Inc., through its subsidiaries, operates regulated utilities that provide water or wastewater services in the United States. It offers water services through operating and maintenance contracts with municipal authorities and other parties. The company also provides non-utility raw water supply services for firms in the natural gas drilling industry; and water and sewer line protection solutions, and repair services to households through a third-party. It serves approximately 3 million residential water, commercial water, fire protection, industrial water, wastewater, and other water and utility customers in Pennsylvania, Ohio, Texas, Illinois, North Carolina, New Jersey, Indiana, and Virginia. The company was formerly known as Aqua America, Inc. and changed its name to Essential Utilities, Inc. in February 2020. Essential Utilities, Inc. was founded in 1886 and is headquartered in Bryn Mawr, Pennsylvania.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Bryn Mawr"}, "XEL": {"short_name": "Xcel Energy Inc.", "long_name": "Xcel Energy Inc.", "summary": "Xcel Energy Inc., through its subsidiaries, generates, purchases, transmits, distributes, and sells electricity. It operates through Regulated Electric Utility, Regulated Natural Gas Utility, and All Other segments. The company generates electricity through coal, nuclear, natural gas, hydroelectric, solar, biomass, oil, wood/refuse, and wind energy sources. It also purchases, transports, distributes, and sells natural gas to retail customers, as well as transports customer-owned natural gas. In addition, the company develops and leases natural gas pipelines, and storage and compression facilities; and invests in rental housing projects, as well as procures equipment for construction of renewable generation facilities. It serves residential, commercial, and industrial customers in the portions of Colorado, Michigan, Minnesota, New Mexico, North Dakota, South Dakota, Texas, and Wisconsin. The company sells electricity to approximately 3.7 million customers; and natural gas to approximately 2.1 million customers. Xcel Energy Inc. was founded in 1909 and is headquartered in Minneapolis, Minnesota.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Minneapolis"}, "XEL.MX": {"short_name": "XCEL ENERGY INC", "long_name": "Xcel Energy Inc.", "summary": "Xcel Energy Inc., through its subsidiaries, generates, purchases, transmits, distributes, and sells electricity. It operates through Regulated Electric Utility, Regulated Natural Gas Utility, and All Other segments. The company generates electricity through coal, nuclear, natural gas, hydroelectric, solar, biomass, oil, wood/refuse, and wind energy sources. It also purchases, transports, distributes, and sells natural gas to retail customers, as well as transports customer-owned natural gas. In addition, the company develops and leases natural gas pipelines, and storage and compression facilities; and invests in rental housing projects, as well as procures equipment for construction of renewable generation facilities. It serves residential, commercial, and industrial customers in the portions of Colorado, Michigan, Minnesota, New Mexico, North Dakota, South Dakota, Texas, and Wisconsin. The company sells electricity to approximately 3.7 million customers; and natural gas to approximately 2.1 million customers. Xcel Energy Inc. was founded in 1909 and is headquartered in Minneapolis, Minnesota.", "currency": "MXN", "sector": "Utilities", "industry": "Electric Utilities", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Minneapolis"}, "XLTD": {"short_name": "EXCOIN LTD", "long_name": "Excoin Ltd", "summary": "Excoin Ltd, a development stage company, focuses on installing, owning, and operating renewable distributed environmental power systems. The company K clean energy generation and supply of biomass feedstock to address the requirement for renewable and sustainable supply of electricity. It uses biomass, which is produced from proprietary cultivated feedstocks to generate renewable electricity. The company serves captive end users, islands, mining companies, government or privately-owned power grid systems, and other end users, including private homes. It primarily operates in India, Ghana, Guyana, and the Philippines. The company is based in Oceanside, New York.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Oceanside"}, "YORW": {"short_name": "The York Water Company", "long_name": "The York Water Company", "summary": "The York Water Company impounds, purifies, and distributes drinking water. The company owns and operates two wastewater collection systems and two wastewater treatment systems; and two reservoirs, including Lake Williams and Lake Redman, which hold approximately 2.2 billion gallons of water. It also operates a 15-mile pipeline from the Susquehanna River to Lake Redman; and owns seven wells that supply water to its customers in Carroll Valley Borough and Cumberland Township, Adams County. The company serves customers in the fixtures and furniture, electrical machinery, food product, paper, ordnance unit, textile product, air conditioning system, laundry detergent, barbell, and motorcycle industries in 39 municipalities within York County and 9 municipalities within Adams County, Pennsylvania. The York Water Company was founded in 1816 and is based in York, Pennsylvania.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "York"}, "YWA.SG": {"short_name": "YORK WATER CO. Registered Share", "long_name": "The York Water Company", "summary": "The York Water Company impounds, purifies, and distributes drinking water. The company owns and operates two wastewater collection systems and two wastewater treatment systems; and two reservoirs, including Lake Williams and Lake Redman, which hold approximately 2.2 billion gallons of water. It also operates a 15-mile pipeline from the Susquehanna River to Lake Redman; and owns seven wells that supply water to its customers in Carroll Valley Borough and Cumberland Township, Adams County. The company serves customers in the fixtures and furniture, electrical machinery, food product, paper, ordnance unit, textile product, air conditioning system, laundry detergent, barbell, and motorcycle industries in 39 municipalities within York County and 9 municipalities within Adams County, Pennsylvania. The York Water Company was founded in 1816 and is based in York, Pennsylvania.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "STU", "market": "dr_market", "country": "United States", "city": "York"}}