{
    "ADN": {
        "short_name": "Advent Technologies Holdings, I",
        "long_name": "Advent Technologies Holdings, Inc.",
        "summary": "Advent Technologies Holdings, Inc., an advanced materials and technology development company, operates in the fuel cell and hydrogen technology markets. It develops, manufactures, and assembles the critical components that determine the performance of hydrogen fuel cells and other energy systems. The company offers HT-PEM (high-temperature proton exchange membrane) fuel cells, HT-PEM based membrane electrode assemblies, flow battery membranes, organic photovoltaics, and ultracells. It serves stationary power, portable power, automotive, aviation, energy storage, and sensor markets. The company was founded in 2006 and is headquartered in Boston, Massachusetts.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "MA",
        "city": "Boston",
        "zipcode": "02116",
        "website": "http://www.advent.energy",
        "market_cap": 530249920
    },
    "ARSC": {
        "short_name": "AMERICAN SECURITY RESOURCE CORP",
        "long_name": "Bitcoin Crypto Currency Exchange Corporation",
        "summary": "Bitcoin Crypto Currency Exchange Corporation, an adopter of blockchain technology, provides mobile payment application. The company intends to offer BitCoinMWallet app, a mobile payment application, which would allow trade and redemption of Bitcoins or other crypto currencies using iOS or Android devices. It also offers KaChing, a smartphone-based payment and money transfer system that allows consumers to purchase tokens for their digital wallet. The company was formerly known as American Security Resources Corporation and changed its name to Bitcoin Crypto Currency Exchange Corporation in August 2017. Bitcoin Crypto Currency Exchange Corporation was founded in 1981 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77005",
        "website": "http://www.bitcoinmwallet.com",
        "market_cap": 1121500
    },
    "AWSL": {
        "short_name": "ATLANTIC PWR & INFRASTRUCTURE C",
        "long_name": "Atlantic Power & Infrastructure Corp.",
        "summary": "Atlantic Wind & Solar, Inc. offers porous paving solution in Florida. The company offers solution, such as drainage, erosion, landscaping, trails and paths, and tree surrounds. Atlantic Wind & Solar, Inc. formerly known as K.B. Industries, Inc. and changed its name to Atlantic Wind & Solar, Inc. on Jun, 2019. The company was founded in 2001 and is based in Largo, Florida.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Largo",
        "zipcode": "33777",
        "website": "http://www.kbius.com",
        "market_cap": 5454327
    },
    "BEPC": {
        "short_name": "Brookfield Renewable Corporatio",
        "long_name": "Brookfield Renewable Corporation",
        "summary": "Brookfield Renewable Corporation owns and operates a portfolio of renewable energy power generating facilities primarily in North America, Europe, Colombia, and Brazil. It operates hydroelectric, wind, and solar power plants with an installed capacity of approximately 12,812 megawatts. The company was incorporated in 2019 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10281-1023",
        "website": "http://bep.brookfield.com/bepc",
        "market_cap": 6679798272
    },
    "BEPC.TO": {
        "short_name": "BROOKFIELD RENEWABLE CORPORATIO",
        "long_name": "Brookfield Renewable Corporation",
        "summary": "Brookfield Renewable Corporation owns and operates a portfolio of renewable energy power generating facilities primarily in North America, Europe, Colombia, and Brazil. It operates hydroelectric, wind, and solar power plants with an installed capacity of approximately 12,812 megawatts. The company was incorporated in 2019 and is headquartered in New York, New York.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10281-1023",
        "website": "http://bep.brookfield.com/bepc",
        "market_cap": 8894233600
    },
    "CGEI": {
        "short_name": "CGE ENERGY INC",
        "long_name": "CGE Energy Inc.",
        "summary": "CGE Energy Inc. develops and operates long-term energy projects for commercial, municipal, nonprofit, and international customers. The company installs LED lighting products and solar PVs; develops, designs, and constructs solar PV projects; and designs WINDÂ\u0095e20 vertical-axis wind turbines. The company was founded in 1989 and is based in Brighton, Michigan.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MI",
        "city": "Brighton",
        "zipcode": "48116",
        "website": "http://www.cgeenergy.com",
        "market_cap": 12526400
    },
    "CLNV": {
        "short_name": "CLEAN VISION CORP",
        "long_name": "Clean Vision Corporation",
        "summary": "Byzen Digital, Inc. focuses on clean energy and sustainable solutions that serve worldwide market needs. The company, through its subsidiaries, Clean-Seas, Inc., focuses on recycling waste plastics into clean burning fuels; and 100BIO, LLC that provides biodegradable packaging solution for the food service industry, as well as all packaging solutions. Byzen Digital, Inc. is based in Carson City, Nevada.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Carson City",
        "zipcode": "89706",
        "website": "http://byzendigital.com",
        "market_cap": 24029
    },
    "CPWR": {
        "short_name": "OCEAN THERMAL ENERGY CORPORATIO",
        "long_name": "Ocean Thermal Energy Corporation",
        "summary": "Ocean Thermal Energy Corporation, together with its subsidiaries, develops projects for renewable power generation, desalinated water production, and air conditioning in the United States and internationally. It designs and develops ocean thermal energy conversion, and seawater and lake water air conditioning plants for commercial properties, utilities, and municipalities. The company's plant produces electricity; fresh water for agriculture and human consumption; and desalinated water for potable, agricultural, and fish farming/aquaculture uses. Ocean Thermal Energy Corporation has strategic relationships with DCO Energy, LLC, Naval Energies, and the Sky Institute for plant construction, design, and architectural services, as well as funding of projects. The company was founded in 1998 and is headquartered in Lancaster, Pennsylvania.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Lancaster",
        "zipcode": "17603",
        "website": "http://www.otecorporation.com",
        "market_cap": 4064956
    },
    "CWEN-A": {
        "short_name": "Clearway Energy, Inc.",
        "long_name": "Clearway Energy, Inc.",
        "summary": "Clearway Energy, Inc., through its subsidiaries, engages in the renewable energy businesses in the United States. As of March 2, 2021, it had approximately 4,200 net megawatts (MW) of installed wind and solar generation projects; and 2,500 net MW of natural gas generation facilities, as well as a portfolio of district energy systems. Its thermal infrastructure assets provide steam, hot water and/or chilled water, and electricity to commercial businesses, universities, hospitals, and governmental units. As of December 31, 2020, the company had 1,394 MW thermal equivalent capacity of steam and chilled water. Clearway Energy, Inc. was incorporated in 2012 and is based in Princeton, New Jersey. Clearway Energy, Inc. operates as a subsidiary of Clearway Energy Group LLC.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Princeton",
        "zipcode": "08540",
        "website": "http://www.clearwayenergy.com",
        "market_cap": 5376322048
    },
    "CWEN": {
        "short_name": "Clearway Energy, Inc.",
        "long_name": "Clearway Energy, Inc.",
        "summary": "Clearway Energy, Inc., through its subsidiaries, engages in the renewable energy businesses in the United States. As of March 2, 2021, it had approximately 4,200 net megawatts (MW) of installed wind and solar generation projects; and 2,500 net MW of natural gas generation facilities, as well as a portfolio of district energy systems. Its thermal infrastructure assets provide steam, hot water and/or chilled water, and electricity to commercial businesses, universities, hospitals, and governmental units. As of December 31, 2020, the company had 1,394 MW thermal equivalent capacity of steam and chilled water. Clearway Energy, Inc. was incorporated in 2012 and is based in Princeton, New Jersey. Clearway Energy, Inc. operates as a subsidiary of Clearway Energy Group LLC.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Princeton",
        "zipcode": "08540",
        "website": "http://www.clearwayenergy.com",
        "market_cap": 5141895680
    },
    "GRGR": {
        "short_name": "GREEN ENERGY RESOURCES INC",
        "long_name": "Green Energy Resources, Inc.",
        "summary": "Green Energy Resources, Inc., a green bio-energy supply company, supplies wood biomass to utilities and the power generation industries in the United States and internationally. The company offers wood fiber/biomass/woodchips. It also provides urban tree certification software. The company was formerly known as New York International Log & Lumber Co, Inc. and changed its name to Green Energy Resources, Inc. in February 2005. Green Energy Resources, Inc. was founded in 1997 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10016",
        "website": null,
        "market_cap": 30538
    },
    "GSFI": {
        "short_name": "GREEN STREAM HOLDINGS INC",
        "long_name": "Green Stream Holdings Inc.",
        "summary": "Green Stream Holdings Inc., through its subsidiary, Green Stream Finance, Inc., provides solar energy solutions in the United States. It constructs a solar greenhouse using customized red greenhouse glass and seamless solar panels. The company is based in Pacific Palisades, California.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Pacific Palisades",
        "zipcode": "90272",
        "website": "http://greenrainsolar.com",
        "market_cap": 7818865
    },
    "HNM.F": {
        "short_name": "ORMAT TECHNOLOG.  DL-,001",
        "long_name": "Ormat Technologies, Inc.",
        "summary": "Ormat Technologies, Inc. engages in the geothermal and recovered energy power business in the United States, Indonesia, Kenya, Turkey, Chile, Guadeloupe, Guatemala, Ethiopia, New Zealand, Honduras, and internationally. The company operates through three segments: Electricity, Product, and Energy Storage. The Electricity segment develops, builds, owns, and operates geothermal, solar photovoltaic, and recovered energy-based power plants; and sells electricity. The Product segment designs, manufactures, and sells equipment for geothermal, recovered energy-based electricity generation, and remote power units, such as fossil fuel powered turbo-generators and heavy duty direct-current generators. This segment also provides services relating to the engineering, procurement, construction, operation, and maintenance of geothermal and recovered energy-based power plants. The Product segment serves contractors; developers, owners, and operators of geothermal power plants; and owners and operators of interstate natural gas pipelines, gas processing plants, and cement plants, as well as companies in other energy-intensive industrial processes. The Energy Storage segment offers energy storage and related services, as well as services relating to the engineering, procurement, construction, operation, and maintenance of energy storage units. Ormat Technologies, Inc. was founded in 1965 and is based in Reno, Nevada.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NV",
        "city": "Reno",
        "zipcode": "89519-6075",
        "website": "http://www.ormat.com",
        "market_cap": 3091902720
    },
    "IRCC": {
        "short_name": "INDIGENOUS ROOTS CORP",
        "long_name": "Indigenous Roots Corp.",
        "summary": "Indigenous Roots Corp., through its subsidiary, owns and operates a 140 kW/h solar power generating facility in Georgetown, Delaware. The company was formerly known as American Paramount Gold Corp. and changed its name to Indigenous Roots Corp. in February 2018. Indigenous Roots Corp. was founded in 2006 and is based in Steilacoom, Washington.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WA",
        "city": "Steilacoom",
        "zipcode": "98388",
        "website": null,
        "market_cap": 1508690
    },
    "MMMW": {
        "short_name": "MASS MEGAWATTS WIND POWER INC",
        "long_name": "Mass Megawatts Wind Power, Inc.",
        "summary": "Mass Megawatts Wind Power, Inc. develops and sells clean energy systems for commercial and residential users in the United States. It offers solar tracking systems to automatically adjust the position of solar panels to receive the optimal level of direct sunlight throughout the day. The company was formerly known as Mass Megawatts Power, Inc. and changed its name to Mass Megawatts Wind Power, Inc. in February 2002. Mass Megawatts Wind Power, Inc. was founded in 1997 and is based in Worcester, Massachusetts.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MA",
        "city": "Worcester",
        "zipcode": "01605",
        "website": "http://www.massmegawatts.com",
        "market_cap": 117288
    },
    "NCEN": {
        "short_name": "NACEL ENERGY CORP",
        "long_name": "Nacel Energy Corporation",
        "summary": "Nacel Energy Corporation, a development stage wind power generation company, engages in the development of renewable and utility scale wind power generation facilities. It has 6 wind energy projects, including Blue Creek, Channing Flats, Leila Lake, Hedley Point, Swisher, and Snowflake totaling approximately 185 MW of potential capacity located on approximately 8,437 acres of land situated in the Panhandle area of Texas and northern Arizona. The company was formerly known as Zephyr Energy Corporation and changed its name to Nacel Energy Corporation in April 2007. Nacel Energy Corporation was founded in 2006 and is based in Denver, Colorado.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Denver",
        "zipcode": "80202",
        "website": null,
        "market_cap": 920346
    },
    "NEP": {
        "short_name": "NextEra Energy Partners, LP",
        "long_name": "NextEra Energy Partners, LP",
        "summary": "NextEra Energy Partners, LP acquires, owns, and manages contracted clean energy projects in the United States. The company owns a portfolio of contracted renewable generation assets consisting of wind and solar projects, as well as contracted natural gas pipeline assets. NextEra Energy Partners, LP was incorporated in 2014 and is headquartered in Juno Beach, Florida.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Juno Beach",
        "zipcode": "33408",
        "website": "http://www.investor.nexteraenergypartners.com",
        "market_cap": 5096195072
    },
    "NRTHF": {
        "short_name": "NORTHERN POWER SYSTEMS CORP",
        "long_name": "Northern Power Systems Corp.",
        "summary": "Northern Power Systems Corp. designs, manufactures, and services wind turbine platforms for the distributed wind market worldwide. The company provides 100 kW and 60 kW turbines under the NPS 100 and NPS 60 names. It also offers power converters for battery energy storage applications under the FlexPhase brand; and technical support for its SmartView supervisory control and data acquisition system. Northern Power Systems Corp. was founded in 1974 and is headquartered in Barre, Vermont.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "VT",
        "city": "Barre",
        "zipcode": "05641",
        "website": "http://www.northernpower.com",
        "market_cap": 4645
    },
    "NY41.F": {
        "short_name": "CLEARWAY ENERGY C  DL-,01",
        "long_name": "Clearway Energy, Inc.",
        "summary": "Clearway Energy, Inc., through its subsidiaries, engages in the renewable energy businesses in the United States. As of March 2, 2021, it had approximately 4,200 net megawatts (MW) of installed wind and solar generation projects; and 2,500 net MW of natural gas generation facilities, as well as a portfolio of district energy systems. Its thermal infrastructure assets provide steam, hot water and/or chilled water, and electricity to commercial businesses, universities, hospitals, and governmental units. As of December 31, 2020, the company had 1,394 MW thermal equivalent capacity of steam and chilled water. Clearway Energy, Inc. was incorporated in 2012 and is based in Princeton, New Jersey. Clearway Energy, Inc. operates as a subsidiary of Clearway Energy Group LLC.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NJ",
        "city": "Princeton",
        "zipcode": "08540",
        "website": "http://www.clearwayenergy.com",
        "market_cap": 4466875904
    },
    "NY4B.F": {
        "short_name": "CLEARWAY ENERGY A NDL-,01",
        "long_name": "Clearway Energy, Inc.",
        "summary": "Clearway Energy, Inc., through its subsidiaries, engages in the renewable energy businesses in the United States. As of March 2, 2021, it had approximately 4,200 net megawatts (MW) of installed wind and solar generation projects; and 2,500 net MW of natural gas generation facilities, as well as a portfolio of district energy systems. Its thermal infrastructure assets provide steam, hot water and/or chilled water, and electricity to commercial businesses, universities, hospitals, and governmental units. As of December 31, 2020, the company had 1,394 MW thermal equivalent capacity of steam and chilled water. Clearway Energy, Inc. was incorporated in 2012 and is based in Princeton, New Jersey. Clearway Energy, Inc. operates as a subsidiary of Clearway Energy Group LLC.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NJ",
        "city": "Princeton",
        "zipcode": "08540",
        "website": "http://www.clearwayenergy.com",
        "market_cap": 4541357056
    },
    "ORA": {
        "short_name": "Ormat Technologies, Inc.",
        "long_name": "Ormat Technologies, Inc.",
        "summary": "Ormat Technologies, Inc. engages in the geothermal and recovered energy power business in the United States, Indonesia, Kenya, Turkey, Chile, Guadeloupe, Guatemala, Ethiopia, New Zealand, Honduras, and internationally. The company operates through three segments: Electricity, Product, and Energy Storage. The Electricity segment develops, builds, owns, and operates geothermal, solar photovoltaic, and recovered energy-based power plants; and sells electricity. The Product segment designs, manufactures, and sells equipment for geothermal, recovered energy-based electricity generation, and remote power units, such as fossil fuel powered turbo-generators and heavy duty direct-current generators. This segment also provides services relating to the engineering, procurement, construction, operation, and maintenance of geothermal and recovered energy-based power plants. The Product segment serves contractors; developers, owners, and operators of geothermal power plants; and owners and operators of interstate natural gas pipelines, gas processing plants, and cement plants, as well as companies in other energy-intensive industrial processes. The Energy Storage segment offers energy storage and related services, as well as services relating to the engineering, procurement, construction, operation, and maintenance of energy storage units. Ormat Technologies, Inc. was founded in 1965 and is based in Reno, Nevada.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Reno",
        "zipcode": "89519-6075",
        "website": "http://www.ormat.com",
        "market_cap": 3892595200
    },
    "ORA.TA": {
        "short_name": "ORMAT TECHNOLOGIES",
        "long_name": "Ormat Technologies, Inc.",
        "summary": "Ormat Technologies, Inc. engages in the geothermal and recovered energy power business in the United States, Indonesia, Kenya, Turkey, Chile, Guadeloupe, Guatemala, Ethiopia, New Zealand, Honduras, and internationally. The company operates through three segments: Electricity, Product, and Energy Storage. The Electricity segment develops, builds, owns, and operates geothermal, solar photovoltaic, and recovered energy-based power plants; and sells electricity. The Product segment designs, manufactures, and sells equipment for geothermal, recovered energy-based electricity generation, and remote power units, such as fossil fuel powered turbo-generators and heavy duty direct-current generators. This segment also provides services relating to the engineering, procurement, construction, operation, and maintenance of geothermal and recovered energy-based power plants. The Product segment serves contractors; developers, owners, and operators of geothermal power plants; and owners and operators of interstate natural gas pipelines, gas processing plants, and cement plants, as well as companies in other energy-intensive industrial processes. The Energy Storage segment offers energy storage and related services, as well as services relating to the engineering, procurement, construction, operation, and maintenance of energy storage units. Ormat Technologies, Inc. was founded in 1965 and is based in Reno, Nevada.",
        "currency": "ILA",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "TLV",
        "market": "il_market",
        "country": "United States",
        "state": "NV",
        "city": "Reno",
        "zipcode": "89519-6075",
        "website": "http://www.ormat.com",
        "market_cap": 12628123648
    },
    "PRHL": {
        "short_name": "PREMIER HLDG CORP",
        "long_name": "Premier Holding Corporation",
        "summary": "Premier Holding Corporation, through its subsidiaries, provides energy services in the United States. It offers various electricity plans and upgrades to a facility's energy infrastructure to commercial middle market companies and residential customers. The company also provides deregulated power brokerage services for small businesses, warehouses, and distribution centers. The company was formerly known as OVM International Holding Corporation and changed its name to Premier Holding Corporation in November 2008. Premier Holding Corporation was founded in 1971 and is based in Tustin, California.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Tustin",
        "zipcode": "92780",
        "website": "http://www.prhlcorp.com",
        "market_cap": 1663704
    },
    "PVDG": {
        "short_name": "POVERTY DIGNIFIED INC",
        "long_name": "VirExit Technologies, Inc.",
        "summary": "VirExit Technologies, Inc. operates as a renewable energy company. It is involved in incubating solar technologies that establish electrification, education, connectivity, and community development infrastructures in rural communities to empower the individual, community, and local economy. The company was formerly known as Poverty Dignified, Inc. VirExit Technologies, Inc. was founded in 2013 and is headquartered in Belmont, North Carolina.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NC",
        "city": "Belmont",
        "zipcode": "28012",
        "website": "http://www.povertydignified.com",
        "market_cap": 6344702
    },
    "PWCO": {
        "short_name": "PWRCOR INC",
        "long_name": "PwrCor, Inc.",
        "summary": "PwrCor, Inc. provides energy infrastructure and alternative energy solutions in the United States. The company manages infrastructure projects, such as hospitals and universities for commercial and institutional customers. Its projects include a combination of energy infrastructure components, including electrical power generation, steam production, or chilled water production projects, as well as the infrastructure to distribute these services. The company also commercializes engine technology that converts low-grade heat to mechanical energy for power generation. It serves domestic non-profit institutions and organizations; the waste-heat-to-energy and geothermal marketplace; and the independent power producer market. The company was formerly known as Receivable Acquisition & Management Corporation and changed its name to PwrCor, Inc. in March 2017. PwrCor, Inc. is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10165",
        "website": "http://www.pwrcor.com",
        "market_cap": 18720528
    },
    "RNWR": {
        "short_name": "808 RENEWABLE ENERGY CORP",
        "long_name": "808 Renewable Energy Corporation",
        "summary": "808 Renewable Energy Corporation acquires, owns, develops, operates, and distributes on-site energy systems that produce electricity, hot water, heat, and cooling in the United States. The company also purchases and sells power generation equipment; and operates, repairs, and maintains power generation equipment for other energy facility owners. As of December 31, 2015, it had 4 operating energy systems. The company was founded in 2009 and is based in Garden Grove, California.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Garden Grove",
        "zipcode": "92843",
        "website": "http://808llc.com",
        "market_cap": 272188
    },
    "TPII": {
        "short_name": "TRIAD PRO INNOVATORS INC",
        "long_name": "Triad Pro Innovators, Inc.",
        "summary": "Triad Pro Innovators, Inc. operates as a renewable energy producer and storage provider. It owns and operates combined heat and power renewable energy facilities in California and the Western United States. The company is also involved in the purchase and sale of power generation equipment, as well as in the operation, repair, and maintenance of power generation equipment for other energy facility owners. In addition, it offers energy storage solutions for residential, small business, industrial, and utility applications. The company was formerly known as Shing-Mei International, Inc. and changed its name to Triad Pro Innovators, Inc. in January 2012. Triad Pro Innovators, Inc. was founded in 1994 and is based in La Quinta, California.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "La Quinta",
        "zipcode": "92253",
        "website": "http://www.triadproinc.com",
        "market_cap": 4266888
    },
    "TRNF": {
        "short_name": "TARONIS FUELS INC",
        "long_name": "Taronis Fuels, Inc.",
        "summary": "Taronis Fuels, Inc. operates as a renewable fuel and power generation company in the United States. It manufactures, sells, and distributes MagneGas, which is a metal cutting fuel. The company sells and distributes a line of industrial gases and welding equipment and services to a range of end market users, including metalworking, manufacturing, utility power plants, medical, agriculture, transportation, repair, demolition, salvage, and other industries. Taronis Fuels, Inc. operates 28 industrial gas retail locations. The company was founded in 2017 and is headquartered in Peoria, Arizona.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Peoria",
        "zipcode": "85383",
        "website": "http://www.taronisfuels.com",
        "market_cap": 40757656
    },
    "VCII": {
        "short_name": "VIVICELLS INTERNATIONAL INC",
        "long_name": "ViviCells International, Inc.",
        "summary": "ViviCells International, Inc. operates as a stem cell preservation company. ViviCells International, Inc. was formerly known as Tropical Beverage Inc. and changed its name to ViviCells International, Inc. in May 2008. The company was incorporated in 1995 and is based in Evanston, Illinois.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Evanston",
        "zipcode": "60201",
        "website": "http://www.vivicells.com",
        "market_cap": 14
    },
    "VGREF": {
        "short_name": "VIASPACE GREEN ENERGY INC",
        "long_name": "VIASPACE Green Energy Inc.",
        "summary": "VIASPACE Green Energy Inc., a renewable energy company, manufacture and sells framed artwork in the United States. It operates through two segments, Framed-Artwork and Grass. The Framed-Artwork segment manufactures copyrighted framed artwork in the People's Republic of China for retail stores. The Grass Segment produces Giant King Grass, a natural hybrid, non-genetically modified, and perennial grass, which is used to generate low carbon and renewable electricity by burning in a biomass power plant; used to produce bio methane through anaerobic digestion; used as a feedstock for non-food liquid biofuels, such as bio ethanol and bio butanol; and used as a feedstock for biochemicals and bio plastics, as well as used as animal feed. The company was founded in 2008 and is headquartered in Marietta, Georgia.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Marietta",
        "zipcode": "30066",
        "website": "http://www.viaspacegreenenergy.com",
        "market_cap": 2681
    },
    "VIHD": {
        "short_name": "VISION HYDROGEN CORP",
        "long_name": "Vision Hydrogen Corporation",
        "summary": "Vision Hydrogen Corporation designs, sells, and installs solar, battery, fuel, and hydrogen energy systems for residential, commercial, and government sectors. It offers range of design, installation, and maintenance services for a range of technology services in the clean energy markets, including energy consumption audit, review of energy and tax credits available, feasibility studies, solar/battery energy system design, zoning and permitting analysis, site design/preparation and restoration, system startup, testing and commissioning, maintenance, and interconnection applications. The company also provides design, installation, and maintenance services for a range of technology products in the security systems, including commercial alarm systems, access control, and video surveillance systems. In addition, it offers design, installation, maintenance, and emergency service of environmental systems. The company was formerly known as H/Cell Energy Corporation and changed its name to Vision Hydrogen Corporation in October 2020. The company was founded in 2015 and is based in Jersey City, New Jersey.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Jersey City",
        "zipcode": "07302",
        "website": "http://www.visionh2.com",
        "market_cap": 166566688
    },
    "VSPC": {
        "short_name": "VIASPACE INC",
        "long_name": "VIASPACE Inc.",
        "summary": "VIASPACE Inc. engages in the renewable energy business in the United States and internationally. It develops Giant King Grass (GKG), a biomass and energy crop. The company's GKG could be burned in biomass power plants to generate electricity; made into pellets that could be burned together with coal to reduce carbon emissions from existing power plants; generated bio methane through anaerobic digestion; and used as a feedstock for low carbon liquid biofuels for transportation, biochemical, and bio plastics, as well as animal feed. VIASPACE Inc. was founded in 1998 and is based in Santa Cruz, California.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Cruz",
        "zipcode": "95062",
        "website": "http://www.viaspace.com",
        "market_cap": 7757788
    },
    "WGEI": {
        "short_name": "WINDGEN ENERGY INC",
        "long_name": "WindGen Energy, Inc.",
        "summary": "WindGen Energy, Inc. has an exclusive license agreement with Wind Sail Receptor, Inc. (WSR) for assembling and marketing WSR's wind sail receptor energy generation devices primarily in the United States, Canada, the United Kingdom, and Ireland. The company was formerly known as InMedica Development Corporation and changed its name to WindGen Energy, Inc in March 2010. WindGen Energy, Inc. was incorporated in 1983 and is based in Scottsdale, Arizona.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Scottsdale",
        "zipcode": "85260",
        "website": null,
        "market_cap": 132487
    },
    "WNDW": {
        "short_name": "SOLARWINDOW TECHNOLOGIES INC",
        "long_name": "SolarWindow Technologies, Inc.",
        "summary": "SolarWindow Technologies, Inc. engages in developing electricity-generating coatings for use in building window and glass applications. The company's LiquidElectricity coatings generate electricity by harvesting light energy from natural sun, artificial light, and low, shaded, or reflected light conditions. It applies ultra-thin layers of LiquidElectricity coatings to rigid glass, and flexible glass and plastic surfaces where they transform otherwise ordinary surfaces into organic photovoltaic devices. The company's potential applications of LiquidElectricity coatings span various industries, including architectural, automotive, agrivoltaic, aerospace, commercial transportation, and marine. Its LiquidElectricity coatings and SolarWindow products are under development with support from commercial contract firms and at the U.S. Department of Energy's National Renewable Energy Laboratory, through cooperative research and development agreements. The company was formerly known as New Energy Technologies, Inc. and changed its name to SolarWindow Technologies, Inc. in March 2015. SolarWindow Technologies, Inc. was founded in 1998 and is based in New York, New York. SolarWindow Technologies, Inc. is a subsidiary of Kalen Capital Corporation.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10022",
        "website": "http://www.solarwindow.com",
        "market_cap": 611763200
    }
}