{"KEPEN.AT": {"short_name": "FLOUR MILLS KEPENOS S.A. (CR)", "long_name": "Flour Mills Kepenos S.A.", "summary": "Flour Mills Kepenos S.A. produces and sells wheat and other cereals flours in Greece. The company provides durum, soft, extra special, special, and whole meal wheat flours. It serves various industries, bakeries, patisseries, bakeshops, and small or large-scale businesses. Flour Mills Kepenos S.A. was founded in 1952 and is headquartered in Patras, Greece.", "currency": "EUR", "sector": "Consumer Goods", "industry": "Food - Major Diversified", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Patras"}, "KRI.AT": {"short_name": "KRI-KRI MILK INDUSTRY S.A (CR)", "long_name": "Kri-Kri Milk Industry S.A.", "summary": "Kri-Kri Milk Industry S.A. produces and sells dairy products in Greece. The company offers ice creams, yogurt, and milk. It also exports its products to approximately 24 countries in Europe, the Balkans, and the Middle East. The company was founded in 1954 and is headquartered in Serres, Greece.", "currency": "EUR", "sector": "Consumer Goods", "industry": "Food - Major Diversified", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Serres"}, "KYLO.AT": {"short_name": "Flour Mills Loulis S.A.(CR)", "long_name": "Loulis Mills S.A.", "summary": "Loulis Mills S.A. produces and trades in flour products in Greece, Cyprus, and Bulgaria. It operates through four segments: Consumer Products, Professional Products, Mixtures & Raw Material for Bakery & Pastry, and Training Services. The company offers flour for domestic use, as well as for food, bakery, biscuit, pasta making, and food and pastry crafts industries; and secondary processors, as well as mixtures and raw material for bakery and pastry. It also provides educational services, including seminars on bakery, confectionery bakery, food technology, and marketing and financial management of bakery. The company was formerly known as Kylindromylos Loulis S.A. and changed its name to Loulis Mills S.A. in 2001. Loulis Mills S.A. was founded in 1782 and is headquartered in Almyros, Greece.", "currency": "EUR", "sector": "Consumer Goods", "industry": "Food - Major Diversified", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Almyros"}, "KYSA.AT": {"short_name": "C. Sarantopoulos Flour Mills", "long_name": "Flour Mills C. Sarantopoulos S.A.", "summary": "Flour Mills C. Sarantopoulos S.A. produces and sells flour and semolina in Greece. It offers bakery flour, luxury flour, durum wheat flour, and flour for industrial companies. The company also offers by-products, such as brans, buns, special bits, and alps to livestock cooperatives and feed industries. It serves customers in biscuit, bakery, and pasta industries. Flour Mills C. Sarantopoulos S.A. was founded in 1912 and is headquartered in Keratsini, Greece.", "currency": "EUR", "sector": "Consumer Goods", "industry": "Food - Major Diversified", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Keratsini"}, "NIKAS.AT": {"short_name": "P. G. NIKAS S.A.(CR)", "long_name": "P.G. Nikas S.A.", "summary": "P.G. Nikas S.A. produces and distributes shelf, bench, and freezing cured meat in Greece. The company offers turkey, chicken, ham and pork shoulder, pariza and parizaki, dry salami, sausages, mortadella, bacon, and lion products. The company provides its products under the Nikas brand name. P.G. Nikas S.A. was founded in 1966 and is based in Agios Stefanos, Greece.", "currency": "EUR", "sector": "Consumer Goods", "industry": "Food - Major Diversified", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Agios Stefanos"}}