{
    "1T5.F": {
        "short_name": "TAURON POLSKA ENERGIA ZY5",
        "long_name": "TAURON Polska Energia S.A.",
        "summary": "TAURON Polska Energia S.A., through its subsidiaries, engages in the generation, transmission, distribution, and sale of electricity and heat in Poland. The company operates through five segments: Mining, Generation, Distribution, Supply, and Other. The Mining segment offers hard coal mining, and enrichment and sales services. The generation segment is involved in electricity generation through conventional sources, including co-generation; and renewable energy, which includes biomass burning and co-firing, hydroelectric power plants, and wind farms; and overhaul of generation equipment and construction of power generation unit. The distribution segment provides electricity distribution service using the distribution grids; and technical support services related to electricity metering systems and metering data acquisition. The supply segment engages in the wholesale trade of electricity, natural gas, and derivative products, as well as trading and management of CO2 emission allowances, property rights arising from certificates of origin that confirm electricity generation from renewable sources, and cogeneration and property rights arising from energy efficiency certificates and fuels; electricity and natural gas supply; and lighting service sales. The other segment is involved in the extraction of stone, including limestone for the needs of power generation, steel, construction, and road building industries, as well as the production of sorbents agents for wet desulphurization installations and fluidized bed boilers; and real estate administration and property security activities. The company was formerly known as Energetyka Poludnie S.A. and changed its name to TAURON Polska Energia S.A. in November 2007. TAURON Polska Energia S.A. was founded in 2006 and is based in Katowice, Poland.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Renewable",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Poland",
        "city": "Katowice"
    },
    "6PG.F": {
        "short_name": "PGE PL.GR.ENERG. ZY10,25",
        "long_name": "PGE Polska Grupa Energetyczna S.A.",
        "summary": "PGE Polska Grupa Energetyczna S.A. engages in the production, transmission, and distribution of electricity in Poland. The company operates through five segments: Conventional Generation, Renewables, Supply, Distribution, and Other Operations. It generates electricity from fossil fuels comprising lignite, hard coal, biomass, and natural gas, as well as renewable energy sources, such as hydro, wind, and photovoltaic. The company operates 5 conventional power plants; 16 CHP plants; 2 lignite mines; 14 wind farms; 1 photovoltaic power plant; 29 run-of-river hydro power plants; and 4 pumped-storage power plants, including 2 with natural flow. It produces, transmits, and distributes heat; sells and purchases electricity and gas on wholesale market; trades in CO2 allowances and energy certificates; and purchases and sells fuels, as well as sells electricity and provides services to end users. The company supplies power to approximately 5 million households, businesses, and institutions. It also manages investment funds and invests in start-ups. The company was founded in 2007 and is based in Warsaw, Poland.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Electric",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Poland",
        "city": "Warsaw"
    }
}