{"ASKH": {"short_name": "ASTIKA HOLDINGS INC", "long_name": "Astika Holdings, Inc.", "summary": "Astika Holdings, Inc. does not have significant operations. The company focuses on various strategic acquisitions in the textile, service, agriculture, and industrial sectors in Asia and New Zealand. Previously, it operated in the music industry. The company was founded in 2011 and is based in Auckland, New Zealand. Astika Holdings, Inc. is a subsidiary of IQ Acquisition (NY) Ltd.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "PNK", "market": "us_market", "country": "New Zealand", "city": "Auckland"}, "FSF.AX": {"short_name": "FONTERRA UNIT NZX", "long_name": "Fonterra Shareholders Fund", "summary": "Fonterra Shareholders Fund is a unit trust. The fund is based in Auckland, New Zealand.", "currency": "AUD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "ASX", "market": "au_market", "country": "New Zealand", "city": "Auckland"}, "FSF.NZ": {"short_name": "Fonterra Shareholders' Fund Uni", "long_name": "Fonterra Shareholders Fund", "summary": "Fonterra Shareholders Fund is a unit trust. The fund is based in Auckland, New Zealand.", "currency": "NZD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "NZE", "market": "nz_market", "country": "New Zealand", "city": "Auckland"}, "GFL.NZ": {"short_name": "Geneva Finance Limited Ordinary", "long_name": "Geneva Finance Limited", "summary": "Geneva Finance Limited provides finance and financial services to the consumer credit and small to medium business markets primarily in New Zealand and Tonga. It operates through Corporate, New Business, Insurance, Old Business, Invoice Factoring, and Overseas segments. The company offers hire purchase finance; and personal loans secured by registered security interests over personal assets, including motor vehicles and mortgages of residential property, as well as car and homeowners loans. It also provides insurance products, such as lifestyle protection, motor vehicle, guaranteed asset protection, and mechanical breakdown insurance, as well as death, disablement, and redundancy risk coverages; and debt collection services. In addition, the company is involved in the provision of debtor finance to companies, as well as collection and management of trade receivables factored; lending, collection, and management of money; and wholesale funding arrangements. Geneva Finance Limited serves individuals, companies, and other entities. The company was formerly known as GFNZ Group Limited and changed its name to Geneva Finance Limited in June 2016. Geneva Finance Limited was founded in 2002 and is headquartered in Auckland, New Zealand.", "currency": "NZD", "sector": "Financial Services", "industry": "Credit Services", "exchange": "NZE", "market": "nz_market", "country": "New Zealand", "city": "Auckland"}, "HMY.AX": {"short_name": "HARMONEY FPO", "long_name": "Harmoney Corp Limited", "summary": "Harmoney Corp Limited provides online direct personal loans in Australia and New Zealand. Its personal loans are used for various purposes, including consolidating debt, financing home renovations, financing vehicle purchases, financing a holiday, and funding other life events. The company distributes its loan products by engaging customers directly. Harmoney Corp Limited was founded in 2013 and is headquartered in Newmarket, New Zealand.", "currency": "AUD", "sector": "Financial Services", "industry": "Credit Services", "exchange": "ASX", "market": "au_market", "country": "New Zealand", "city": "Newmarket"}, "HMY.NZ": {"short_name": "Harmoney Corp Limited Ordinary ", "long_name": "Harmoney Corp Limited", "summary": "Harmoney Corp Limited provides online direct personal loans in Australia and New Zealand. Its personal loans are used for various purposes, including consolidating debt, financing home renovations, financing vehicle purchases, financing a holiday, and funding other life events. The company distributes its loan products by engaging customers directly. Harmoney Corp Limited was founded in 2013 and is headquartered in Newmarket, New Zealand.", "currency": "NZD", "sector": "Financial Services", "industry": "Credit Services", "exchange": "NZE", "market": "nz_market", "country": "New Zealand", "city": "Newmarket"}, "NZSTF": {"short_name": "NZX LIMITED", "long_name": "NZX Limited", "summary": "NZX Limited operates as a stock exchange in New Zealand. The company operates through five segments: Issuer Relationships, Secondary Markets, Data & Insights, Funds Management, and Wealth Technologies. The Issuer Relationships segment provides issuer services for current and prospective customers and market operator for Fonterra Co-Operative Group and the Electricity Authority. The Secondary Markets provides trading and post-trade services for securities and derivatives markets, as well as provides central securities depository. The Data & Insights segment involved in provision of data services for securities and derivatives markets; and data and analysis for New Zealand's dairy sector. The Funds Management segment offers SuperLife superannuation and KiwiSaver, and Smartshares exchange traded funds. The Wealth Technologies segment provides funds administration service. It also offers virtualTrading, a virtual platform for people to learn about key investing concepts by actively trading virtual securities. NZX Limited was incorporated in 2002 and is based in Wellington, New Zealand.", "currency": "USD", "sector": "Financial Services", "industry": "Financial Data & Stock Exchanges", "exchange": "PNK", "market": "us_market", "country": "New Zealand", "city": "Wellington"}, "NZX.NZ": {"short_name": "NZX Limited Ordinary Shares", "long_name": "NZX Limited", "summary": "NZX Limited operates as a stock exchange in New Zealand. The company operates through five segments: Issuer Relationships, Secondary Markets, Data & Insights, Funds Management, and Wealth Technologies. The Issuer Relationships segment provides issuer services for current and prospective customers and market operator for Fonterra Co-Operative Group and the Electricity Authority. The Secondary Markets provides trading and post-trade services for securities and derivatives markets, as well as provides central securities depository. The Data & Insights segment involved in provision of data services for securities and derivatives markets; and data and analysis for New Zealand's dairy sector. The Funds Management segment offers SuperLife superannuation and KiwiSaver, and Smartshares exchange traded funds. The Wealth Technologies segment provides funds administration service. It also offers virtualTrading, a virtual platform for people to learn about key investing concepts by actively trading virtual securities. NZX Limited was incorporated in 2002 and is based in Wellington, New Zealand.", "currency": "NZD", "sector": "Financial Services", "industry": "Financial Data & Stock Exchanges", "exchange": "NZE", "market": "nz_market", "country": "New Zealand", "city": "Wellington"}, "PVL.AX": {"short_name": "POWERHOUSE FPO NZ", "long_name": "Powerhouse Ventures Limited", "summary": "Powerhouse Ventures Limited is a venture capital firm specializing in incubation, start-up, early stage, and growth capital investments. The firm primarily makes investments in companies from Canterbury, New Zealand. It seeks to invest in engineering and clean technology; biotechnology and agri-science; health and medical devices; food; and information technology, software, and electronics. The firm also makes investments in intellectual property and research. It typically invests in companies that do not seek to raise more than NZD 5 million (USD 4.28 million) and with the aggregate of capital and reserves of, and loans made by shareholders not exceeding NZD 10 million (USD 8.57 million). Powerhouse Ventures Limited was founded in 2006 and is based in Christchurch, New Zealand with offices in Wellington, New Zealand, Dunedin, New Zealand and Auckland, New Zealand.", "currency": "AUD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "ASX", "market": "au_market", "country": "New Zealand", "city": "Christchurch"}, "TWR.NZ": {"short_name": "Tower Limited Ordinary Shares", "long_name": "Tower Limited", "summary": "Tower Limited provides general insurance products in New Zealand and the Pacific Islands. Its insurance products include car, contents, renters', house, landlord, business, travel, boat, motorbike, lifestyle block and farm, motorhome, and caravan or trailer insurance. The company was founded in 1869 and is based in Auckland, New Zealand.", "currency": "NZD", "sector": "Financial Services", "industry": "Insurance—Diversified", "exchange": "NZE", "market": "nz_market", "country": "New Zealand", "city": "Auckland"}}