{
  "GFL.NZ": {
    "city": "Auckland",
    "country": "New Zealand",
    "currency": "NZD",
    "exchange": "NZE",
    "industry": "Credit Services",
    "long_name": "Geneva Finance Limited",
    "market": "nz_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "Geneva Finance Limited Ordinary",
    "state": null,
    "summary": "Geneva Finance Limited provides finance and financial services to the consumer credit and small to medium business markets primarily in New Zealand and Tonga. It operates through Corporate, New Business, Insurance, Old Business, Invoice Factoring, and Overseas segments. The company offers hire purchase finance; and personal loans secured by registered security interests over personal assets, including motor vehicles and mortgages of residential property, as well as car and homeowners loans. It also provides insurance products, such as lifestyle protection, motor vehicle, guaranteed asset protection, and mechanical breakdown insurance, as well as death, disablement, and redundancy risk coverages; and debt collection services. In addition, the company is involved in the provision of debtor finance to companies, as well as collection and management of trade receivables factored; lending, collection, and management of money; and wholesale funding arrangements. Geneva Finance Limited serves individuals, companies, and other entities. The company was formerly known as GFNZ Group Limited and changed its name to Geneva Finance Limited in June 2016. Geneva Finance Limited was founded in 2002 and is headquartered in Auckland, New Zealand.",
    "website": "http://genevafinance.co.nz",
    "zipcode": "1741"
  },
  "HMY.AX": {
    "city": "Newmarket",
    "country": "New Zealand",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Credit Services",
    "long_name": "Harmoney Corp Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "HARMONEY FPO",
    "state": null,
    "summary": "Harmoney Corp Limited provides online direct personal loans in Australia and New Zealand. Its personal loans are used for various purposes, including consolidating debt, financing home renovations, financing vehicle purchases, financing a holiday, and funding other life events. The company distributes its loan products by engaging customers directly. Harmoney Corp Limited was founded in 2013 and is headquartered in Newmarket, New Zealand.",
    "website": "http://www.harmoney.co.nz",
    "zipcode": "1023"
  },
  "HMY.NZ": {
    "city": "Newmarket",
    "country": "New Zealand",
    "currency": "NZD",
    "exchange": "NZE",
    "industry": "Credit Services",
    "long_name": "Harmoney Corp Limited",
    "market": "nz_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "Harmoney Corp Limited Ordinary ",
    "state": null,
    "summary": "Harmoney Corp Limited provides online direct personal loans in Australia and New Zealand. Its personal loans are used for various purposes, including consolidating debt, financing home renovations, financing vehicle purchases, financing a holiday, and funding other life events. The company distributes its loan products by engaging customers directly. Harmoney Corp Limited was founded in 2013 and is headquartered in Newmarket, New Zealand.",
    "website": "http://www.harmoney.co.nz",
    "zipcode": "1023"
  }
}
