{
  "BOLT.BA": {
    "city": "Buenos Aires",
    "country": "Argentina",
    "currency": "ARS",
    "exchange": "BUE",
    "industry": "Information Technology Services",
    "long_name": "Boldt S.A.",
    "market": "ar_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "BOLDT SA",
    "state": null,
    "summary": "Boldt S.A. engages in the tele informatics services, security graphics, and entertainment and tourism centers businesses in Argentina and other Latin American countries. It offers telecommunications services to capture, communicate, and process a range of information. The company also engages in developing system for lotteries, casinos, and bingo halls. In addition, it offers centralized administration system for traffic infractions and monitoring of various instances of traffic infractions, as well as for reducing traffic accidents. Further, the company specializes in the creation of products that ensure the security for documentation and identification of people and goods; and develops and manages tourism and entertainment centers. Boldt S.A. is based in Buenos Aires, Argentina.",
    "website": "http://www.boldt.com.ar",
    "zipcode": "C1295ADA"
  },
  "GAMI.BA": {
    "city": "Buenos Aires",
    "country": "Argentina",
    "currency": "ARS",
    "exchange": "BUE",
    "industry": "Information Technology Services",
    "long_name": "B-Gaming S.A.",
    "market": "ar_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "B-GAMING S.A.",
    "state": null,
    "summary": "B-Gaming S.A. develops and provides technical solutions for the placement, communication, validation, and processing of large volumes of information. It also installs security computer centers, communications equipment, VSAT antennas, online and mobile lottery terminals, printers, and other supplies. In addition, the company develops communication and transaction management software. It primarily serves lottery institutions. The company was formerly known as Boldt Gaming S.A. and changed its name to B-Gaming S.A. in February 2018. B-Gaming S.A. was founded in 2007 and is based in Buenos Aires, Argentina.",
    "website": "http://www.bgaming.com.ar",
    "zipcode": "C1295ADA"
  }
}
