{
    "1333.T": {
        "short_name": "MARUHA NICHIRO CORPORATION",
        "long_name": "Maruha Nichiro Corporation",
        "summary": "Maruha Nichiro Corporation engages in the fishing, fish farming, food processing, trading, meat products, and distribution businesses in Japan and internationally. The company offers seafood products; and operates Bluefin tuna and other farms. It also provides frozen and processed food products, including canned, fish sausage, nursing care, supplement, cosmetic, institutional, pet, and space food products, as well as desserts and retort pouch foods. In addition, the company engages in the trade and supply of shrimps and octopus; production of beef, pork, chicken, and processed products; distribution of fish; and development of freezing technology for a network of cold storage businesses. Maruha Nichiro Corporation was founded in 1880 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1377.T": {
        "short_name": "SAKATA SEED CORP",
        "long_name": "Sakata Seed Corporation",
        "summary": "Sakata Seed Corporation produces and sells vegetable seeds, flower seeds, grass seeds, vegetable seedlings, flower seedlings, bulbs, and agricultural/gardening materials in Japan and internationally. The company also engages in the publication of gardening literature; research and development, and contract production of seeds; and design, management, and contract of various construction projects, such as landscaping, greenhouse, and agricultural facilities. It offers its products under the Sakata brand. The company was formerly known as T. Sakata & Company and changed its name to Sakata Seed Corporation in January 1986. Sakata Seed Corporation was founded in 1913 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "1379.T": {
        "short_name": "HOKUTO CORP",
        "long_name": "Hokuto Corporation",
        "summary": "Hokuto Corporation researches, develops, produces, and sells mushrooms in Japan. It offers various mushrooms, including Eryngii, Maitake, Bunashimeji, Bunapi, and Shimofuri Hiratake. The company also molds and sells plastic products; produces and sells agricultural production materials and machines; and produces, processes, and sells agriculture products. It also operates in the United States, Taiwan, and Malaysia. The company was formerly known as Hokuto Industry Corporation and changed its name to Hokuto Corporation in October 2003. Hokuto Corporation was founded in 1964 and is headquartered in Nagano, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Nagano"
    },
    "1380.T": {
        "short_name": "AKIKAWA FOODS & FARMS",
        "long_name": "Akikawa Foods & Farms Co., Ltd.",
        "summary": "Akikawa Foods & Farms Co., Ltd. produces and sells food products. The company offers chicken, pork, beef, milk, yoghurt, eggs, vegetables, and frozen food, as well as processed food, etc. It also engages in breeding chickens, hens, and dairy cows; and production of vegetables and milk. The company was formerly known as Akikawa Food Co., Ltd. and changed its name to Akikawa Foods & Farms Co., Ltd. in 1993. Akikawa Foods & Farms Co., Ltd. was founded in 1932 and is headquartered in Yamaguchi, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Yamaguchi"
    },
    "1381.T": {
        "short_name": "AXYZ",
        "long_name": "AXYZ Co., Ltd.",
        "summary": "AXYZ Co., Ltd. manufactures and sells processed foods that are heated and seasoned for chilled and frozen chicken. The company was founded in 1962 and is headquartered in Kagoshima, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kagoshima"
    },
    "1382.T": {
        "short_name": "HOB CO.LTD",
        "long_name": "HOB Co.,Ltd.",
        "summary": "HOB Co.,Ltd. produces and sells seedlings and strawberries in Japan. The company also engages in the retail and wholesale of vegetables; and fruits, such as blueberries, mango, and kiwifruit. In addition, it imports and exports crops, fruits, and vegetables; and sells and rents agricultural equipment, materials, etc. Further, the company produces and sells seed potatoes; and purchases and sells fruit potatoes. Additionally, it offers transport and handling services for fruits and vegetables. HOB Co.,Ltd. was founded in 1987 and is headquartered in Kamikawa, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kamikawa"
    },
    "1384.T": {
        "short_name": "HOKURYO CO LTD",
        "long_name": "Hokuryo Co., Ltd.",
        "summary": "Hokuryo Co., Ltd., a livestock company, engages in the production and sale of eggs, processed eggs, and meat products in Japan. It offers broiler, pork, beef, and ham sausage products. The company was founded in 1949 and is headquartered in Sapporo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Sapporo"
    },
    "2003.T": {
        "short_name": "NITTO FUJI FLOUR MILLING CO",
        "long_name": "Nitto Fuji Flour Milling Co.,Ltd.",
        "summary": "Nitto Fuji Flour Milling Co.,Ltd. manufactures and sells flour products in Japan. The company offers wheat flour and bran products, as well as food and food-related stuff. It also provides warehousing and transportation services, and harbor facilities; and designs and installs machines and equipment. The company was founded in 1914 and is headquartered in Tokyo, Japan. Nitto Fuji Flour Milling Co.,Ltd. is a subsidiary of Mitsubishi Corporation.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "2055.T": {
        "short_name": "NICHIWA SANGYO CO",
        "long_name": "Nichiwa Sangyo Co., Ltd.",
        "summary": "Nichiwa Sangyo Co., Ltd. engages in the manufacture, consignment processing, and brokerage of compound feed products in Japan. The company is also involved in the manufacture and brokerage of livestock and poultry equipment; breeding of livestock and poultry; production, processing, and brokerage of livestock products and related foods; and sale of veterinary drugs, as well as in the brokerage of livestock medical care. Nichiwa Sangyo Co., Ltd. was founded in 1918 and is headquartered in Kobe, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kobe"
    },
    "2058.F": {
        "short_name": "HIGASHIMARU CO LTD",
        "long_name": "Higashimaru Co.,Ltd.",
        "summary": "Higashimaru Co.,Ltd. produces and sells marine and food products in Japan. It offers yellowtail and mixed feeds for various fish farms; and dried and instant noodles, dish udon, noodle soups, snacks, etc. The company also exports its products to 19 countries. Higashimaru Co., Ltd. was founded in 1947 and is headquartered in Kagoshima, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "FKA",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kagoshima"
    },
    "2060.T": {
        "short_name": "FEED ONE CO LTD",
        "long_name": "Feedone Co., Ltd.",
        "summary": "Feedone Co., Ltd. procures, produces, processes, and sells mixed, animal, and fishery feeds in Japan and internationally. The company offers livestock feed in mashes, pellets, crumbles, granules, flakes and pellets, and bulky forms for hogs, layers, broiler chickens, and dairy and beef cattle's. It also provides fishery feeds, including mash, granules, crumbles, and dry and extruder pellets, as well as feeds for marine larval fishes. In addition, the company offers feed for laboratory animals, such as mice and rat, rabbit, Guinea-pig, dog, monkey, miniature-pig, and suncus, as well as feed for livestock and poultry, and honeybees; and pet foods comprising foods for small animals, domestic birds, tropical fish and goldfish, small lives, zoos, and animal hospitals. Further, it engages in the provision of foods consisting of pork meat, hen's eggs, and fishes; and other ancillary businesses, such as arm-management consulting, management of veterinary examination and treatment facilities, etc. The company was formerly known as Feed One Holdings Co., Ltd. and changed its name to Feedone Co., Ltd. in October 2015. Feedone Co., Ltd. was incorporated in 2014 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "2924.T": {
        "short_name": "IFUJI SANGYO CO LTD",
        "long_name": "Ifuji Sangyo Co., Ltd.",
        "summary": "Ifuji Sangyo Co., Ltd. produces and sells egg products in Japan. The company offers liquid and frozen egg products to bakers, confectionery suppliers, prepared foods, etc.; and powder and granule seasonings products to food manufacturers. It also engages in the solar power generation activity. The company was founded in 1972 and is headquartered in Fukuoka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Fukuoka City"
    },
    "6MN.F": {
        "short_name": "MARUHA NICHIRO CORP.",
        "long_name": "Maruha Nichiro Corporation",
        "summary": "Maruha Nichiro Corporation engages in the fishing, fish farming, food processing, trading, meat products, and distribution businesses in Japan and internationally. The company offers seafood products; and operates Bluefin tuna and other farms. It also provides frozen and processed food products, including canned, fish sausage, nursing care, supplement, cosmetic, institutional, pet, and space food products, as well as desserts and retort pouch foods. In addition, the company engages in the trade and supply of shrimps and octopus; production of beef, pork, chicken, and processed products; distribution of fish; and development of freezing technology for a network of cold storage businesses. Maruha Nichiro Corporation was founded in 1880 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7443.T": {
        "short_name": "YOKOHAMA GYORUI CO",
        "long_name": "Yokohama Gyorui Co., Ltd.",
        "summary": "Yokohama Gyorui Co., Ltd. engages in the sale of fishery products to wholesalers and buyers in Japan. It also processes marine and other products. The company was founded in 1947 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "7555.T": {
        "short_name": "OTA FLORICULTURE AUCTION CO",
        "long_name": "Ota Floriculture Auction Co.,Ltd.",
        "summary": "Ota Floriculture Auction Co.,Ltd. engages in the wholesale floriculture products in Japan. The company offers floriculture products, such as cut flowers, potted plants, seedlings, turfs, bonsai, and other matting products. It also organizes auctions; and facilitates transshipment services. The company was incorporated in 1975 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8041.T": {
        "short_name": "OUG HOLDINGS",
        "long_name": "OUG Holdings Inc.",
        "summary": "OUG Holdings Inc., through its subsidiaries, engages in the wholesale of marine products in Japan. The company distributes marine products primarily to wholesalers; and mass retailers, such as supermarkets, restaurants, food and beverage shops, and processing companies. It also manufactures and sells fishery-related products; processes and sells fresh and frozen salmon-based fish, sushi and rice balls, and cut vegetables; and engages in sorting of marine and processed chilled products, as well as aquaculture business. In addition, the company is involved in the insurance agency and leasing businesses. The company was formerly known as Osaka Uoichiba Co., Ltd. and changed its name to OUG Holdings Inc. in October 2006. OUG Holdings Inc. was founded in 1946 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "9955.T": {
        "short_name": "YONKYU CO LTD",
        "long_name": "The Yonkyu Co.,Ltd.",
        "summary": "The Yonkyu Co.,Ltd. operates in the fishery industry in Japan. The company is involved in stocking, processing, and selling fresh fishes, living preys, blended feed, and moist pellets. It also involved in artificial hatching; and tuna and eel farming businesses. The company was founded in 1961 and is based in Uwajima, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Uwajima"
    }
}