{
    "1352.T": {
        "short_name": "HOHSUI CORP",
        "long_name": "Hohsui Corporation",
        "summary": "Hohsui Corporation engages in the refrigerated warehouse storage and fisheries food business primarily in Japan. It is involved in the refrigeration and refrigeration storage of livestock, agricultural, and processed products. The company also produces, processes, and sells seafood products, such as shrimp, crab, frozen fish, and fish eggs; and procures, processes, and delivers thick egg, anko, and marine paste products. Hohsui Corporation was founded in 1945 and is headquartered in Tokyo, Japan. Hohsui Corporation is a subsidiary of Chuo Gyorui Co., Ltd.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "2268.T": {
        "short_name": "BR 31 ICE CREAM CO.LTD",
        "long_name": "B-R 31 Ice Cream Co.,Ltd.",
        "summary": "B-R 31 Ice Cream Co.,Ltd. manufactures, imports, and sells ice cream products. The company offers cones or cups, sundaes, various packs, hand packs, ice cream cakes, ice cream drinks, crepes, and potion cups. The company provides its products through a chain of ice cream shops, including approximately 8,000 stores in 52 countries; and approximately 1,100 stores in Japan. B-R 31 Ice Cream Co.,Ltd. was founded in 1973 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "2281.T": {
        "short_name": "PRIMA MEAT PACKERS",
        "long_name": "Prima Meat Packers, Ltd.",
        "summary": "Prima Meat Packers, Ltd. manufactures and sells hams and sausages, fresh meats, processed foods, and other products in Japan. It is involved in the retailing of meat cuts, delicatessens processed foods, etc.; and live hog operation and slaughtering fabrication businesses, as well as meat distribution business. The company also operates convenience stores. Prima Meat Packers, Ltd. was founded in 1931 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "2294.T": {
        "short_name": "KAKIYASU HONTEN",
        "long_name": "Kakiyasu Honten Co., Ltd.",
        "summary": "Kakiyasu Honten Co., Ltd., a food company, produces and sells prepared food products in Japan. It offers dressed meat, such as beef, pork, and chicken under the Kakiyasugyu and Premium Agu brand names; western and Chinese style delicatessen; Japanese confectioneries, including Ohagi, Dango, and Daifuku through a network of 150 stores; and processed food products. The company also operates buffet style restaurants serving Japanese, Chinese, or western cuisine. Kakiyasu Honten Co., Ltd. was founded in 1871 and is headquartered in Kuwana, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kuwana"
    },
    "2586.T": {
        "short_name": "FRUTA FRUTA INC",
        "long_name": "Fruta Fruta Inc.",
        "summary": "Fruta Fruta Inc. markets fruits and foods in Japan. Its products include mixed beverage, frozen puree, diet food, freeze dried powder, chocolate, sherbet, vinegar, and granola; and raw materials, such as ground pulp, condensed extracts, pulverized pulp, agroforestry cacao beans, OMEGA oil, various fruit seed oils, etc. The company sells its products through retail, wholesale, e-commerce, TV shopping, and mail-order, as well as it exports its products. Fruta Fruta Inc. was founded in 2000 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "2683.T": {
        "short_name": "UOKI CO LTD",
        "long_name": "Uoki Co.,Ltd.",
        "summary": "Uoki Co.,Ltd. engages in the retail sale of seafood in Japan. It offers sushi and prepared side dishes. The company also operates restaurants. It operates 41 fresh fish retail stores and 6 restaurants. The company was formerly known as K.K. Uoki Suisan and changed its name to Uoki Co.,Ltd. in 1990. Uoki Co.,Ltd. was founded in 1971 and is headquartered in Fujisawa, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Fujisawa"
    },
    "2708.T": {
        "short_name": "KUZE CO LTD",
        "long_name": "Kuze Co., Ltd.",
        "summary": "Kuze Co., Ltd., together with its subsidiaries, engages in the food wholesale business for food service industries in Japan and internationally. It offers commercial ingredients and materials, such as Italian mix, grated radishes, smoked salmon slice, scrambled eggs, sauces, pork cutlets, kinpira burdock, potato salad, pate de campagne, beef steak slice, beef burger patty, beef hamburger, radish and bamboo shoots, boiled radish and carrot soup stock, extra virgin olive oil, tempura powder, hakata mentaiko barako, sauce fried noodles, fried chicken thighs, wheat scented baguette, shredded cheese, rich white miso, non-oil dressing Japanese style ginger, and grated onion dressing under the Kuze brand. The company also provides chiffon cakes, pound chocolate, danju, shortcakes, mousses, cakes, sponge sheets, base creams, and whipping creams under the Dolceze brand name; and commercial wraps, paper towels, chooking sheets and papers, aluminum foil, alcohol preparation spray bottle, neutral detergent, sterilizer / bleach, liquid detergent, dishwasher rinse, and hand wash. It distributes its products to hotels, halls, restaurants, taverns, fast foods restaurants, catering, delicatessens and prepared dishes, and inflight meal services. In addition, it proposes menus and offers products through catalog-sales system. The company was founded in 1934 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "2791.T": {
        "short_name": "DAIKOKUTENBUSSAN CO",
        "long_name": "Daikokutenbussan Co.,Ltd.",
        "summary": "Daikokutenbussan Co.,Ltd. engages in the retail of foodstuffs, fresh food, convenience goods, and other products. It is also involved in the wholesale of food products. The company was founded in 1986 and is headquartered in Kurashiki, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kurashiki"
    },
    "2816.T": {
        "short_name": "DAISHO CO LTD",
        "long_name": "Daisho Co.,Ltd.",
        "summary": "Daisho Co.,Ltd. produces and sells dipping sauce, soup, and seasoning ingredients in Japan. The company offers sauces, salt-pepper seasonings, soup mixes, pork stomach soup mixes, salad dressings, green vegetable juices, and other blended seasoning products. It also exports its products to Hong Kong, China, and North America. The company was formerly known as Daisho Shokuhin Co., Ltd. and changed its name to Daisho Co.,Ltd. in April 1994. Daisho Co.,Ltd. was founded in 1966 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3160.T": {
        "short_name": "OOMITSU CO.LTD",
        "long_name": "Oomitsu Co., Ltd.",
        "summary": "Oomitsu Co., Ltd. engages in the wholesale and retail of food products. The company was founded in 1948 and is headquartered in Ogaki, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Ogaki"
    },
    "3182.T": {
        "short_name": "OISIX RA DAICHI INC",
        "long_name": "Oisix ra daichi Inc.",
        "summary": "Oisix Ra Daichi Co., Ltd. engages in the online and catalogue sale of organic vegetables, agricultural products, additive free processed foods, and other food products and ingredients to general consumers in Japan. It also operates food stores and outlets. In addition, the company offers support solutions to companies for repeat sales, Website user interface/user experience enhancements, temperature-controlled food distribution, new online customer acquisitions, and know-how on omni-channel retailing, as well as grocery and online shopping consultancy, and B2C temperature-controlled food logistics services. The company was formerly known as Oisix.daichi Inc., and changed its name to Oisix Ra Daichi Co., Ltd. in July 2018. Oisix Ra Daichi Co., Ltd. was incorporated in 1997 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3541.T": {
        "short_name": "NOUSOUKEN CORPORATION",
        "long_name": "Nousouken Corporation",
        "summary": "Nousouken Corporation engages in the farmer's direct sales business. The company is also involved in the agricultural products distribution and agricultural consulting businesses. It operates in Japan and internationally. Nousouken Corporation was founded in 2007 and is headquartered in Wakayama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Wakayama"
    },
    "4837.T": {
        "short_name": "SHIDAX CORP",
        "long_name": "Shidax Corporation",
        "summary": "Shidax Corporation engages in the food service business in Japan. The company operates restaurants and hotels; canteens at offices, factories, and hospitals; cafeterias at schools and employee clubs; nursing homes for elderly; and fitness and sports clubs, culture schools, seminars, and culture clubs and halls, as well as offers travel agency services. It also engages in the eslogics; contract and medical food service; convenience store meal; vehicle operation management; construction engineering; social service; regional revitalization; and total outsourcing businesses. In addition, the company manufactures and sells wines and fruit juices. Further, it engages in the purchase of ingredients; sale of consumables and tableware and cooking utensils; operation of central kitchen and cook chill system; and web/smartphone application development/operation and digital marketing business. Additionally, it is involved in the customer information management; business card creation and printing; document creation, shredder, and disposal; DM shipping; and warehouse management businesses. The company was founded in 1959 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7451.T": {
        "short_name": "MITSUBISHI SHOKUHIN CO LTD",
        "long_name": "Mitsubishi Shokuhin Co., Ltd.",
        "summary": "Mitsubishi Shokuhin Co., Ltd. engages in the wholesale of processed foods, frozen and chilled foods, alcoholic beverages, and confectioneries in Japan and internationally. It is also involved in other business activities, including distribution and other services. The company was formerly known as Ryoshoku Ltd. and changed its name to Mitsubishi Shokuhin Co., Ltd. in July 2011. The company was incorporated in 1925 and is headquartered in Tokyo, Japan. Mitsubishi Shokuhin Co., Ltd. is a subsidiary of Mitsubishi Corporation.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7538.T": {
        "short_name": "DAISUI CO LTD",
        "long_name": "Daisui Co.,Ltd.",
        "summary": "Daisui Co.,Ltd. engages in the wholesale of fresh and frozen fish products in Japan. It also provides contract refrigeration and warehousing services. The company exports its products worldwide. Daisui Co.,Ltd. was founded in 1939 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "7559.T": {
        "short_name": "GLOBAL FOOD CREATORS CO",
        "long_name": "Global Food Creators Co., Ltd.",
        "summary": "Global Food Creators Co., Ltd. engages in the wholesale of commercial delicacies and Japanese cooking ingredients for business use in Japan and internationally. It supplies a range of Japanese food products, including sushi, kaiseki, Japanese confectioneries, seasonal food products, healthy food products, and seasonings, as well as ornaments. The company was founded in 1972 and is headquartered in Kasamatsu, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kasamatsu"
    },
    "7614.T": {
        "short_name": "OM2 NETWORK CO LTD",
        "long_name": "OM2 Network Co.,Ltd.",
        "summary": "OM2 Network Co.,Ltd. retails meat and prepared food products in Japan. The company is also involved in the meat manufacturing and processing activities. In addition, it operates various restaurants. The company was founded in 1959 and is headquartered in Tokyo, Japan. OM2 Network Co.,Ltd. is a subsidiary of S Foods Inc.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7686.T": {
        "short_name": "KAKUYASU GROUP CO LTD",
        "long_name": "Kakuyasu Group Co., Ltd.",
        "summary": "Kakuyasu Group Co., Ltd. operates beverages and food stores in Japan. It sells alcoholic beverages, soft drinks, seasonings, foods, materials, etc. to restaurants and individuals through its stores, as well as through online. The company was founded in 1921 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7687.T": {
        "short_name": "MICREED CO LTD",
        "long_name": "MICREED Co.,Ltd.",
        "summary": "MICREED Co.,Ltd. engages in the mail order sale of commercial ingredients for restaurants. It offers seafood, meat, vegetables, appetizers, skewers, fried food, meals, dairy products, desserts, beverages, cooking oil, seasonings and spices, dressings, and restaurant supplies, as well as dry, canned, and bottled food products. The company was founded in 1995 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7698.T": {
        "short_name": "ICECO INC",
        "long_name": "Iceco Inc.",
        "summary": "Iceco Inc. engages in the wholesale of frozen food and ice cream. Its business activities also include product planning and development, distribution, and retail store management. The company sells ice cream and frozen food for commercial use at retail stores, such as drug stores and food supermarkets. It also operates 8 supermarkets focuses on fresh products, such as fruits and vegetables, fresh fish, and meat under the Super Fresh House TAIGA name. The company was founded in 1948 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "8006.T": {
        "short_name": "YUASA FUNASHOKU CO",
        "long_name": "Yuasa Funashoku Co., Ltd.",
        "summary": "Yuasa Funashoku Co., Ltd. operates as a food trading company in Japan. The company offers processed foods, confectionery, pet food, liquor, frozen and chilled food, liquors, Wheat flour, starch, sugar, cooking oils, rice, brown rice, meat, and eggs, as well as petroleum, industrial chemicals, and chemical products to supermarkets, mass retailers and department stores, secondary wholesalers, food manufacturers, and other users. It is also involved in the management of hotels and restaurants; and rental of real estate properties, including commercial facilities, etc. Yuasa Funashoku Co., Ltd. was founded in 1936 and is headquartered in Funabashi, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Funabashi"
    },
    "8030.T": {
        "short_name": "CHUO GYORUI CO LTD",
        "long_name": "Chuo Gyorui Co., Ltd.",
        "summary": "Chuo Gyorui Co., Ltd. engages in the wholesale of seafood products in Japan. The company offers fresh fish products, including sardine, horse mackerel, mackerel, pacific saury, yellowtail, skipjack, sea bream, flounder, octopus, young yellowtail, Spanish mackerel, and others; and frozen seafood products, such as frozen Coho salmon, trout salmon, sockeye salmon, king crab, snow crab, black cod, octopus and salted salmon, salted Pollock roe, herring roe or salmon caviar, shrimps, etc. It also provides restaurant use seafood products comprising live fish consisting of young yellowtail, sea bream, amber jack, puffer fish, ark shell, abalone, scallop, sea urchin, oyster, eel, hair crab, king crab, snow crab, fresh water fish, and others; and tuna species, such as Bluefin tuna, big-eye tuna, yellowfin tuna, striped marlin, swordfish, and others. In addition, the company offers salted and dried seafood products, which include dried butterflied horse mackerel or pacific saury, wrapped dried mackerel, slices of various fish, dried squid, baby sardine, boiled and dried Baby sardine, dried capelin, fish paste and sausage, deep fried seafood, smoked salmon, steamed egg custard or Hamburg steak, etc. Chuo Gyorui Co., Ltd. was founded in 1947 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8038.T": {
        "short_name": "TOHTO SUISAN CO",
        "long_name": "Tohto Suisan Co., Ltd.",
        "summary": "Tohto Suisan Co., Ltd. engages in the wholesale of marine products in Japan and internationally. The company offers fresh and frozen tuna; fresh and farmed fishes; gourmet fishes, shellfishes, and live fishes; processed, preserved, and dried fishes; and frozen and salt cured fishes. It is also involved in the cold storage and related business; and real estate leasing business. The company was founded in 1935 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8039.T": {
        "short_name": "TSUKIJI UOICHIBA CO",
        "long_name": "Tsukiji Uoichiba Company, Limited",
        "summary": "Tsukiji Uoichiba Company, Limited engages in the consignment or purchase and sale of marine products in Japan. The company sells fresh fish, live fish, and specialty fish, as well as various kinds of frozen fish along with tuna, fish roe products, salmon, and trout. It also engages in the processing production, fishing, and importing of marine products; ice making, refrigerating, freezing, and sale of its products; real estate business; and wholesale of fresh processed marine products, as well as operates and manages cold storage warehouses. The company exports its products to Asia, North America, and internationally. Tsukiji Uoichiba Company, Limited was founded in 1948 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8079.T": {
        "short_name": "SHOEI FOODS CORP",
        "long_name": "Shoei Foods Corporation",
        "summary": "Shoei Foods Corporation engages in the import and sale of food products in Japan and internationally. The company offers fruits, such as prunes, raisins, cranberries, blueberries, strawberries, mangoes, figs, apples, wolfberries, goldenberries, bananas, amakusa bankan citrus peels, mixed fruits, and peaches; a range of nuts, including almonds and walnuts; and raw materials for confectionery and baking products. It also provides delicatessen and dessert ingredients; dairy products; and retail products for home use. In addition, the company operates as a food manufacturer. Shoei Foods Corporation was founded in 1904 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8108.T": {
        "short_name": "YAMAE HISANO CO",
        "long_name": "Yamae Hisano Co., Ltd.",
        "summary": "Yamae Hisano Co., Ltd., together with its subsidiaries, engages in the wholesale of food products in Japan. The company offers processed and frozen foods, grains, alcoholic beverages, feed, timber products, and construction materials. It also processes fresh vegetables to produce side dishes for convenience stores and mass retailers. The company serves retail and food manufacturing industries, as well as restaurants. Yamae Hisano Co., Ltd. was founded in 1950 and is headquartered in Fukuoka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Fukuoka City"
    },
    "8198.T": {
        "short_name": "MAXVALU TOKAI CO LTD",
        "long_name": "Maxvalu Tokai Co.,Ltd.",
        "summary": "Maxvalu Tokai Co.,Ltd. manages a chain of supermarkets. Its supermarkets offer food items. The company also operates Ion drip, a self-service drip coffee store; and online supermarket. The company was formerly known as K.K. Wada Shoji and changed its name to Maxvalu Tokai Co.,Ltd. in 2002. Maxvalu Tokai Co.,Ltd. was founded in 1930 and is headquartered in Sunto, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Sunto"
    },
    "9260.T": {
        "short_name": "NISHIMOTO CO LTD",
        "long_name": "Nishimoto Co., Ltd.",
        "summary": "Nishimoto Co., Ltd. develops and sells Asian foodstuffs in Japan and internationally. It imports and sells fruits, seafood, vegetables, frozen processed produce, and related processed products. The company also develops and sells products for seasonal events, such as Valentine's Day, Halloween, and Christmas, as well as sells food novelties; and operates world gift, retail stores, and medical supplement businesses. It serves the wholesale markets, volume sellers, restaurants, home-meal replacement industry, food manufacturers, etc. The company was formerly known as Nishimoto Trading Holding Co., Ltd. and changed its name to Nishimoto Co., Ltd. in January 2015. Nishimoto Co., Ltd. was founded in 1912 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9869.T": {
        "short_name": "KATO SANGYO CO",
        "long_name": "Kato Sangyo Co., Ltd.",
        "summary": "Kato Sangyo Co., Ltd. operates as a general food wholesaling company in Japan and internationally. The company's products include ambient temperature processed foods, frozen/chilled foods, confectionery, alcoholic beverages, etc. It also manufactures and sells food products, including Kanpy jams, gourmets, pasta, dried foods, condiments, grocery items, etc. In addition, the company offers retail support and logistics solutions. Kato Sangyo Co., Ltd. was founded in 1945 and is headquartered in Nishinomiya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Nishinomiya"
    },
    "9941.T": {
        "short_name": "TAIYO BUSSAN KAISHA",
        "long_name": "Taiyo Bussan Kaisha,Ltd.",
        "summary": "Taiyo Bussan Kaisha,Ltd. engages in trading food products. Its food products include beef, chicken, mutton, and duck and rabbit meat; processed meat products, processed foods, variety meat, and marine products; and pork. The company also trades in buckwheat, soybeans, soybeans meal, canola, wheat, peanuts, mung beans, vegetables and fruits, general merchandise, chemicals, materials for raw chemicals, supplements, specially-equipped vehicles, automobile parts, engines, construction machinery, industrial machine parts, valves, water disposal equipment, harf-sutaff of steer, license parts, and ship parts. It has operations in Asia, North America, Africa, Latin America, Europe, and Oceania. Taiyo Bussan Kaisha,Ltd. was founded in 1936 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9996.T": {
        "short_name": "SATOH & CO LTD",
        "long_name": "Satoh & Co., Ltd.",
        "summary": "Satoh & Co., Ltd. sells commercial food products in Japan. Its wholesale division sells and delivers confectionery bread and school lunch materials, restaurants, and other food dishes for retail stores. The retail division sells various commercial foods primarily cooked cold foods to individual business operators and general consumers at the commercial food direct sales center. It also processes and sells meat; conducts inspections of food, water quality, etc.; plans, develops, and sells menu databases and information systems; and provides logistics consignment services for commercial food. Satoh & Co., Ltd. was founded in 1950 and is headquartered in Sendai, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Sendai"
    },
    "TZ7.F": {
        "short_name": "TOHO CO. LTD.",
        "long_name": "Toho Co., Ltd.",
        "summary": "Toho Co., Ltd., through its subsidiaries, engages in food wholesale, cash and carry, and supermarket businesses primarily in Japan. It is involved in the development, procurement, and purchase of commercial food; and manufacture of coffee. The company also engages in the wholesale of commercial foods, and fruits and vegetables to the food service industry; operation of community based food supermarkets; entrustment of various office works; and provision of information systems for restaurants. In addition, it is involved in the interior design of restaurants; food related building design and maintenance; and store development, real estate brokerage, facility management, and daily/regular cleaning activities, as well as insurance agency activities. Further, the company engages in the import, manufacture, sale, and maintenance of commercial cooking equipment, coffee machines, confectionery equipment, etc., as well as quality control services. Toho Co., Ltd. was incorporated in 1929 and is headquartered in Kobe, Japan.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Kobe"
    }
}