{"2735.T": {"short_name": "WATTS CO LTD", "long_name": "Watts Co., Ltd.", "summary": "Watts Co., Ltd., together with its subsidiaries, engages in the wholesale and retail trade of daily necessities and miscellaneous goods in Japan, China, Malaysia, Peru, and internationally. It engages in the wholesale of imported interior products; import and export, and processing business of household goods; and general merchandise retail business. The company operates its stores under the 100-Yen shop brand. It also operates a grocery store under the Buona vita brand; miscellaneous goods under the AMANO brand; and uniform shop under the KOMONOYA and KOMONOKAEN brands. Watts Co., Ltd. was founded in 1995 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Consumer Defensive", "industry": "Grocery Stores", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "2742.T": {"short_name": "HALOWS CO LTD", "long_name": "Halows Co.,Ltd.", "summary": "Halows Co.,Ltd. operates a network of supermarket stores in Hiroshima, Okayama, Kagawa, Ehime, Tokushima, and Hyogo Prefectures of Japan. The company was formerly known as Fuchu Supermarket Co., Ltd. and changed its name to Halows Co.,Ltd. in March 1988. Halows Co.,Ltd. was founded in 1958 and is headquartered in Tsukubo, Japan.", "currency": "JPY", "sector": "Consumer Defensive", "industry": "Grocery Stores", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tsukubo"}, "2747.T": {"short_name": "HOKUYU LUCKY CO.LTD.", "long_name": "Hokuyu Lucky Co.,Ltd.", "summary": "Hokuyu Lucky Co.,Ltd. operates a supermarket primarily in Japan. Its supermarket offers food, clothing, and daily goods. The company was founded in 1982 and is headquartered in Sapporo, Japan.", "currency": "JPY", "sector": "Consumer Defensive", "industry": "Grocery Stores", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Sapporo"}, "3038.T": {"short_name": "KOBE BUSSAN CO LTD", "long_name": "Kobe Bussan Co., Ltd.", "summary": "Kobe Bussan Co., Ltd. operates, manages, and franchises retail stores in Japan. It also operates buffet franchise restaurants and fast food restaurants. In addition, the company operates renewable energy power plants. Kobe Bussan Co., Ltd. was founded in 1985 and is headquartered in Kako, Japan.", "currency": "JPY", "sector": "Consumer Defensive", "industry": "Grocery Stores", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kako"}, "59G.F": {"short_name": "KOBE BUSSAN CO. LTD", "long_name": "Kobe Bussan Co., Ltd.", "summary": "Kobe Bussan Co., Ltd. operates, manages, and franchises retail stores in Japan. It also operates buffet franchise restaurants and fast food restaurants. In addition, the company operates renewable energy power plants. Kobe Bussan Co., Ltd. was founded in 1985 and is headquartered in Kako, Japan.", "currency": "EUR", "sector": "Consumer Defensive", "industry": "Grocery Stores", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Kako"}, "5FV.F": {"short_name": "YAOKO CO. LTD", "long_name": "Yaoko Co.,Ltd.", "summary": "Yaoko Co.,Ltd. operates supermarkets in Japan. The company offers fresh, processed, and delicatessen food products; and housing related products. It also engages in the import and wholesale of food and beverages. As of March 2020, the company operated 178 stores. Yaoko Co.,Ltd. was founded in 1890 and is headquartered in Kawagoe, Japan.", "currency": "EUR", "sector": "Consumer Defensive", "industry": "Grocery Stores", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Kawagoe"}, "7515.T": {"short_name": "MARUYOSHI CENTER INC", "long_name": "Maruyoshi Center Inc.", "summary": "Maruyoshi Center Inc. operates supermarkets and restaurants in Japan. It operates 35 supermarkets and 1 restaurant. The company was formerly known as Y.K. Tokiwa Food Center and changed its name to Maruyoshi Center Inc. in 1970. Maruyoshi Center Inc. was founded in 1961 and is headquartered in Takamatsu, Japan.", "currency": "JPY", "sector": "Consumer Defensive", "industry": "Grocery Stores", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Takamatsu"}, "7596.T": {"short_name": "UORIKI CO LTD", "long_name": "Uoriki Co., Ltd.", "summary": "Uoriki Co., Ltd. engages in the retail, food and drink, and wholesale businesses in Japan and internationally. The company is involved in the retail of fresh fish and sushi products; and wholesale of fish and other products to supermarkets, restaurants, etc. It also operates restaurants. The company was founded in 1945 and is headquartered in Tachikawa, Japan.", "currency": "JPY", "sector": "Consumer Defensive", "industry": "Grocery Stores", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tachikawa"}, "8182.T": {"short_name": "INAGEYA CO LTD", "long_name": "Inageya Co., Ltd.", "summary": "Inageya Co., Ltd. engages in retail business in Japan. Its supermarket business offers fresh and general food products, household and clothing items, etc. The company also sells pharmaceutical and cosmetic products through drugstores. It operates 136 stores. Inageya Co., Ltd. was founded in 1900 and is headquartered in Tachikawa, Japan.", "currency": "JPY", "sector": "Consumer Defensive", "industry": "Grocery Stores", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tachikawa"}, "8279.T": {"short_name": "YAOKO CO LTD", "long_name": "Yaoko Co.,Ltd.", "summary": "Yaoko Co.,Ltd. operates supermarkets in Japan. The company offers fresh, processed, and delicatessen food products; and housing related products. It also engages in the import and wholesale of food and beverages. As of March 2020, the company operated 178 stores. Yaoko Co.,Ltd. was founded in 1890 and is headquartered in Kawagoe, Japan.", "currency": "JPY", "sector": "Consumer Defensive", "industry": "Grocery Stores", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kawagoe"}, "8287.T": {"short_name": "MAXVALU NISHINIHON", "long_name": "Maxvalu Nishinihon Co., Ltd.", "summary": "Maxvalu Nishinihon Co., Ltd. engages in the retail sale of grocery products and daily necessities products in Japan and China. The company was formerly known as Well Mart Co., Ltd. and changed its name to Maxvalu Nishinihon Co., Ltd. in May 2000. The company was founded in 1982 and is headquartered in Hiroshima, Japan.", "currency": "JPY", "sector": "Consumer Defensive", "industry": "Grocery Stores", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Hiroshima"}, "9823.T": {"short_name": "MAMMY MART CORP", "long_name": "Mammy Mart Corporation", "summary": "Mammy Mart Corporation operates a chain of fresh food based supermarkets in Japan. As of November 2019, it operated approximately 76 stores. The company was formerly known as Iwasaki Shoji Co., Ltd. and changed to Mammy Mart Corporation in April, 1988. Mammy Mart Corporation was founded in 1950 and is headquartered in Saitama, Japan.", "currency": "JPY", "sector": "Consumer Defensive", "industry": "Grocery Stores", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Saitama"}, "9846.T": {"short_name": "TENMAYA STORE CO", "long_name": "Tenmaya Store Co., Ltd.", "summary": "Tenmaya Store Co., Ltd. operates a chain of retail stores in Japan. The company's stores offer groceries, miscellaneous goods, and clothing products. As of June 1, 2020, it operated through 48 stores. The company was founded in 1969 and is headquartered in Okayama, Japan.", "currency": "JPY", "sector": "Consumer Defensive", "industry": "Grocery Stores", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Okayama"}, "9890.T": {"short_name": "MAKIYA CO LTD", "long_name": "Makiya Co., Ltd.", "summary": "Makiya Co., Ltd. engages in the wholesale and retail business of household goods in Japan. The company operates discount stores under the Espot name that offers outdoor, living room, alcoholic beverage, and fresh food products; cash and carry supermarkets; and community-based daily supermarkets under the POTATO name. It also operates hard off stores, which provide personal computers and AV equipment, as well as off house stores that offer furniture and household goods; and general merchandise shops, which provide interior and miscellaneous goods for adults. Makiya Co., Ltd. was incorporated in 1972 and is headquartered in Fuji, Japan.", "currency": "JPY", "sector": "Consumer Defensive", "industry": "Grocery Stores", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Fuji"}, "9974.T": {"short_name": "BELC CO LTD", "long_name": "Belc CO., LTD.", "summary": "Belc CO., LTD. manages a chain of food supermarkets. The company offers vegetables and fruits; sweets and desserts; meat and processed meat products; seafood products, eggs and dairy products; and processed and frozen food products, as well as beverages and liquor. It also provides clothing and housing products; agricultural, water, and livestock products; and chemical fertilizers, antibiotics, and synthetic additives under the TOPVALU brand name. The company was founded in 1959 and is headquartered in Tsurugashima, Japan.", "currency": "JPY", "sector": "Consumer Defensive", "industry": "Grocery Stores", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tsurugashima"}, "9977.T": {"short_name": "AOKI SUPER CO LTD", "long_name": "Aoki Super Co., LTD.", "summary": "Aoki Super Co., LTD. primarily operates a chain of supermarket in Japan. The company's supermarkets offer fresh and general food products, and daily goods, as well as gardening-related products. It also manages shopping center. The company was founded in 1972 and is headquartered in Nagoya, Japan.", "currency": "JPY", "sector": "Consumer Defensive", "industry": "Grocery Stores", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Nagoya"}, "9993.T": {"short_name": "YAMAZAWA CO LTD", "long_name": "Yamazawa Co., Ltd.", "summary": "Yamazawa Co., Ltd. engages in the retail business in Japan. The company primarily operates food supermarkets. It also operates drug stores; and manufacture and supplies milk, tofu, natto, noodles, rice, and sugar beet products. As of February 2019, the company operated 65 stores comprising 43 stores in Yamagata prefecture and 22 stores in Miyagi prefecture. Yamazawa Co., Ltd. was founded in 1977 and is headquartered in Yamagata, Japan.", "currency": "JPY", "sector": "Consumer Defensive", "industry": "Grocery Stores", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Yamagata"}, "FYRTY": {"short_name": "FAMILYMART CO LTD", "long_name": "FamilyMart Co., Ltd.", "summary": "FamilyMart Co., Ltd., together with its subsidiaries, operates as a convenience store franchise operator. It primarily operates convenience stores and general merchandise stores. The company is also involved in the provision of accounting and other store related services; manufacturing, processing, and wholesale of prepared dishes; boxed lunch home delivery business; and entertainment business, as well as provides fintech related services. As of February 28, 2019, it operated 16,430 stores in Japan and 7,384 stores in Taiwan, Thailand, China, Vietnam, Indonesia, the Philippines, and Malaysia. The company was formerly known as FamilyMart UNY Holdings Co., Ltd. and changed its name to FamilyMart Co., Ltd. in September 2019. The company was founded in 1973 and is headquartered in Tokyo, Japan. As of February 28, 2019, FamilyMart Co., Ltd. operates as a subsidiary of ITOCHU Corporation.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Grocery Stores", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "SVNDF": {"short_name": "SEVEN & I HOLDINGS CO LTD", "long_name": "Seven & i Holdings Co., Ltd.", "summary": "Seven & i Holdings Co., Ltd. engages in retail, food, financial, and IT businesses. The company's Domestic Convenience Store Operations segment operates convenience stores. As of May 31, 2018, it operated 19,943 franchised stores and 442 directly operated stores in Japan; and a number of 7-Eleven convenience stores in China and Hawaii. Its Overseas Convenience Store Operations segment engages in convenience store and gasoline retail businesses. As of March 31, 2018, it operated 7,166 franchised stores and 2,530 directly operated stores in the United States and Canada; and 35,548 7-Eleven licensed convenience stores. The company's Superstore Operations segment operates Ito-Yokado superstores, which offers food items, apparel, and household goods, as well as York-Benimaru, York Mart, and The Garden Jiyugaoka supermarkets in Japan. As of May 31, 2018, it operated Ito-Yokado stores in 164 locations. Its Department Store Operations operates department stores that provide apparel, luxury goods, cosmetics, specialty products, and food items. As of May 31, 2018, it operated 15 department stores under the Sogo and Seibu brands in Japan. The company's Financial Services segment offers banking, ATM, leasing, insurance, credit card, and e-money services. As of May 31, 2018, the Seven Bank operated 24,481 ATM locations in Japan; and March 31, 2018, it operated 13,413 ATMs in North America. Its Specialty Store Operations segment operates specialty retail stores; an online retailer under the Nissen name; and in restaurant, fast food, and contract businesses. As of May 31, 2018, it primarily operated 112 Akachan Honpo stores; 96 directly operated and 17 franchised stores under the THE LOFT name; and 12 Barneys New York branded stores, as well as February 28, 2018, it operated 488 restaurant and fast food locations. The company's others segment engages in real estate, publishing, and cultural education businesses. The company was founded in 2005 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Grocery Stores", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "SVNDY": {"short_name": "SEVEN & I HOLDINGS CO LTD", "long_name": "Seven & i Holdings Co., Ltd.", "summary": "Seven & i Holdings Co., Ltd. engages in retail, food, financial, and IT businesses. The company's Domestic Convenience Store Operations segment operates convenience stores. As of May 31, 2018, it operated 19,943 franchised stores and 442 directly operated stores in Japan; and a number of 7-Eleven convenience stores in China and Hawaii. Its Overseas Convenience Store Operations segment engages in convenience store and gasoline retail businesses. As of March 31, 2018, it operated 7,166 franchised stores and 2,530 directly operated stores in the United States and Canada; and 35,548 7-Eleven licensed convenience stores. The company's Superstore Operations segment operates Ito-Yokado superstores, which offers food items, apparel, and household goods, as well as York-Benimaru, York Mart, and The Garden Jiyugaoka supermarkets in Japan. As of May 31, 2018, it operated Ito-Yokado stores in 164 locations. Its Department Store Operations operates department stores that provide apparel, luxury goods, cosmetics, specialty products, and food items. As of May 31, 2018, it operated 15 department stores under the Sogo and Seibu brands in Japan. The company's Financial Services segment offers banking, ATM, leasing, insurance, credit card, and e-money services. As of May 31, 2018, the Seven Bank operated 24,481 ATM locations in Japan; and March 31, 2018, it operated 13,413 ATMs in North America. Its Specialty Store Operations segment operates specialty retail stores; an online retailer under the Nissen name; and in restaurant, fast food, and contract businesses. As of May 31, 2018, it primarily operated 112 Akachan Honpo stores; 96 directly operated and 17 franchised stores under the THE LOFT name; and 12 Barneys New York branded stores, as well as February 28, 2018, it operated 488 restaurant and fast food locations. The company's others segment engages in real estate, publishing, and cultural education businesses. The company was founded in 2005 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Grocery Stores", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}}