{
    "RUSI.ME": {
        "short_name": "INVESTMENT CO IC",
        "long_name": "Public Joint-Stock Company Investment Company IC Russ-Invest",
        "summary": "Public Joint-Stock Company Investment Company IC Russ-Invest, an investment company, operates in the financial market in Russia. It offers brokerage, trust management, online trading, sub-brokerage, financial consulting, corporate finance, depositary, and securities issuance services. The company also engages in the implementation of venture projects and IPOs; and sale of a business or part of a business, as well as for getting listed in the Russian stock exchange. The company was formerly known as Open Joint-Stock Company Investment Company IC Russ-Invest and changed its name to Public Joint-Stock Company Investment Company IC Russ-Invest in June 2016. Public Joint-Stock Company Investment Company IC Russ-Invest was founded in 1992 and is based in Moscow, Russia..",
        "currency": "RUB",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Moscow"
    },
    "UCSS.ME": {
        "short_name": "UNITED CREDIT SYS.",
        "long_name": "Public Joint Stock Company United Credit Systems",
        "summary": "Public Joint Stock Company United Credit Systems provides various banking and financial services in Russia. It provides banking services, which includes credit products, deposits, mortgage products, payment services, and money transfers, etc. The company also offers leasing services, such as trains, aircraft and vessels, commercial real estate, equipment, vehicles, and machinery. In addition, it engages in the purchase and sale of securities; and invests in securities and properties. The company is based in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Moscow"
    }
}