{
    "KMAZ.ME": {
        "short_name": "KAMAZ PTC",
        "long_name": "KAMAZ Publicly Traded Company",
        "summary": "KAMAZ Publicly Traded Company manufactures, markets, and sells trucks and spare parts. It offers buses; dump, high sided, and loader crane trucks; trailers; mixer trucks; engines; and chassis. The company is also involved in the manufacturing and sale of specialized machinery and spare parts; car components; water supply and electric power transmission activities; leasing of non-residential premises, trucks, and buses; provision of hotel and recreation resort services; provision of non-state pension fund and compulsory pension insurance; truck distribution and maintenance; and other activities. It offers its products through a distribution and service network in Russia, the Commonwealth of Independent States, and internationally. The company also exports its products. KAMAZ Publicly Traded Company was founded in 1969 and is based in Naberezhnye Chelny, Russia.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Naberezhnye Chelny",
        "zipcode": "423827",
        "website": "http://www.kamaz.ru",
        "full_time_employees": null
    },
    "TUZA.ME": {
        "short_name": "TUIMAZINSKIY ZAVOD",
        "long_name": "Tuimazinskiy Zavod Avtobetonovozov Publicly Traded Company",
        "summary": "Tuimazinskiy Zavod Avtobetonovozov Publicly Traded Company designs and manufactures special purpose machinery for concrete covering inclined-axis mixers, autoconcrete pumps, and booms. The company provides concrete mixers, stationary concrete pumps, trailers, trailer shorts, fire-fighting foam lifters, linear concrete pumps, and other products. It also offers capacitive equipment, metal structures, and steel castings, as well as plasma cutting and metalworking services. The company was formerly known as OAO Tuimazinskiy Zavod Avtobetonovozov and changed its name to Tuimazinskiy Zavod Avtobetonovozov Publicly Traded Company in November 2016. The company was founded in 1980 and is based in Tuymazy, Russia. Tuimazinskiy Zavod Avtobetonovozov Publicly Traded Company is a subsidiary of KAMAZ Publicly Traded Company.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Tuymazy",
        "zipcode": "452755",
        "website": "http://www.tzacom.ru",
        "full_time_employees": 642
    },
    "ZILL.ME": {
        "short_name": "LIKHACHOV PLANT PJ",
        "long_name": "Public Joint-Stock Company The Likhachov Plant",
        "summary": "Public Joint-Stock Company The Likhachov Plant produces and sells automobiles in Russia. It offers cars and spare parts. The company was founded in 1916 and is based in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "115280",
        "website": "http://www.amo-zil.ru/en/",
        "full_time_employees": 70
    }
}