{
    "H0H1.F": {
        "short_name": "HMS HYDR.MA.+SYS GDR REGS",
        "long_name": "HMS Hydraulic Machines & Systems Group plc",
        "summary": "HMS Hydraulic Machines & Systems Group plc, together with its subsidiaries, manufactures and repairs various pumps and pumping units, compressors, and modular equipment for oil and gas companies in Russia and internationally. It operates through four segments: Industrial Pumps, Oil and Gas Equipment and Projects, Compressors, and Construction. The company designs, manufactures, and supplies pumping equipment used in oil extraction process, oil and products transportation and processing, thermal and nuclear power generation, water supply, utilities and environment, chemical processing, steel and mining, pulp and paper, food, etc. It also offers compressor equipment used in various industries, such as a range of process gases, compressor systems and stations, and refrigerating machines and units. In addition, the company develops, produces, and delivers customized skid mounted modular equipment including water injection stations for oil formation and formation pressure maintenance; oil and gas pumping and processing stations; automated group measuring plants; chemical dosing units, and measuring and vessel equipment; and oilfield equipment used in oil exploration intensification and efficiency, current and work over repairs, isolation works, and fracturing, as well as provides complex maintenance and overhaul services for related equipment. Further, it offers engineering and construction services for oil, gas, and gas condensate fields development, as well as for production and infrastructural facilities erection in the oil and gas, and water industries. The company was founded in 1993 and is headquartered in Moscow, Russia. HMS Hydraulic Machines & Systems Group plc is a subsidiary of H.M.S Technologies Ltd.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "125047",
        "website": "http://www.grouphms.com",
        "market_cap": "Small Cap"
    },
    "KRKOP.ME": {
        "short_name": "KRASNY KOTELSHCHIK",
        "long_name": "Public Joint Stock Company The Taganrog Boiler-Making Works Krasny Kotelshchik",
        "summary": "Public Joint Stock Company The Taganrog Boiler-Making Works Krasny Kotelshchik engages in the design, manufacture, and integrated supply of equipment for thermal power industry. It manufactures and sells boilers comprising fired steam, waste-heat, biomass, and oil and gas industrial boilers, as well as boilers for burning municipal solid waste and biomass. The company also provides heat-exchange and auxiliary equipment; boilers components and equipment for boilers; heat recovery steam generators; heating surfaces; and connection parts and components of the pipelines. In addition, it offers various types of filters, including clarifying, sorption carbon, regenerative, and trapping; and exchangers, such as mixed bed ion, parallel flow ion, and counter flow ion, as well as hydraulic agitators and pressure tanks for the storage of concentrated agents. The company provides its products under TKZ brand name. Public Joint Stock Company The Taganrog Boiler-Making Works Krasny Kotelshchik was founded in 1896 and is based in Taganrog, Russia. The company is a subsidiary of PJSC EnergoMashinostroitelny Alliance.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Taganrog",
        "zipcode": null,
        "website": "http://www.tkz.su",
        "market_cap": "Mid Cap"
    },
    "OMZZP.ME": {
        "short_name": "UNITED HEAVY MACH",
        "long_name": "Open Joint Stock Company OMZ",
        "summary": "Open Joint Stock Company OMZ operates as a heavy machine-building company in Russia and internationally. The company manufactures equipment for nuclear power plants; and storing and transporting spent nuclear fuel, as well as provides investment engineering and servicing for nuclear power plants. It is involved in the development and implementation of technologies for the production of air separation equipment, supply of industrial gases, and development of comprehensive solutions for associated gas, natural gas, and liquefied natural gas. The company also manufactures equipment for nuclear power plants; and equipment for hydrocracking units, hydrotreating units, catalytic cracking units, and others. In addition, it produces special steels for power and nuclear power, metallurgical, mining, and petrochemical machine-building, as well as special-purpose items. Further, the company designs and produces general industrial and special-purpose valves, including shutoff, gate, butterfly, control, ball, check, swing check, hermetically sealed, relief, and instrumentation valves; and products for ship-building, such as autonomous, self-installing shaft line slip bearings. Additionally, it provides engineering integrated solutions and services. Open Joint Stock Company OMZ was founded in 1996 and is based in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "115035",
        "website": "http://www.omz.ru",
        "market_cap": "Large Cap"
    }
}