{
    "0RT7.L": {
        "short_name": "TENNECO INC TENNECO ORD SHS",
        "long_name": "Tenneco Inc.",
        "summary": "Tenneco Inc. designs, manufactures, and sells clean air, powertrain, and ride performance products and systems for light vehicle, commercial truck, off-highway, industrial, and aftermarket customers worldwide. The company operates through Clean Air, Powertrain, Ride Performance, and Motorparts segments. It offers clean air products and systems, including catalytic converters and diesel oxidation catalysts; diesel particulate filters(DPFs); burner systems; lean nitrogen oxide (NOx) traps; selective catalytic reduction (SCR) systems; hydrocarbon vaporizers and injectors; SCR-coated diesel particulate filters systems; urea dosing systems; four-way catalysts; alternative NOx reduction technologies; mufflers and resonators; fabricated exhaust manifolds; pipes; hydroformed assemblies; elastomeric hangers and isolators; and aftertreatment control units. The company also provides powertrain products and systems, such as pistons; piston rings; cylinder liners; valve seats and guides; bearings; spark plugs; valvetrain products; system protection products; and seals and gaskets. In addition, it offers motor parts, including steering and suspension, braking, sealing, engine, emission, and maintenance products, as well as shocks and struts; and ride performance products and systems comprising advanced suspension technologies, and ride control and braking products, as well as noise, vibration, and harshness performance materials. The company was formerly known as Tenneco Automotive Inc. and changed its name to Tenneco Inc. in 2005. Tenneco Inc. was founded in 1996 and is headquartered in Lake Forest, Illinois.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Auto Parts",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United States",
        "state": "IL",
        "city": "Lake Forest",
        "zipcode": "60045",
        "website": "http://www.tenneco.com",
        "market_cap": "Small Cap"
    },
    "AHII": {
        "short_name": "AMERICAN HERITAGE INTERNATIONAL",
        "long_name": "American Heritage International Inc.",
        "summary": "American Heritage International Inc. manufactures, distributes, and sells premium disposable electronic cigarettes under the American Heritage and America's Original E-Cig brand names. The company was formerly known as Cumberland Hills Ltd. and changed its name to American Heritage International Inc. in August 2013. American Heritage International Inc. was founded in 2010 and is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Cigarettes",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89145",
        "website": "http://www.americanheritageonline.com",
        "market_cap": "Small Cap"
    },
    "ATAR": {
        "short_name": "AVATAR VENTURES",
        "long_name": "Avatar Ventures Corp.",
        "summary": "Avatar Ventures Corp., a development stage company, focuses on developing aftermarket electronic accessories for consumer motor vehicles in China. The company is developing a cellular phone car adapter that enables cellular text messages and wireless emails to be displayed on a small liquid crystal display screen attached to the car's dashboard area. It also develops mobile marketing solutions, ranging from simple text messaging campaigns to robust mobile applications. In addition, the company develops iText Direct, a proprietary SMS solution; and a mobile Website intended to assist clients in navigating existing mobile Websites and/or build new mobile Websites. Avatar Ventures Corp. was founded in 2006 and is based in Carson City, Nevada.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Carson City",
        "zipcode": "89703",
        "website": "http://www.avatarventurescorp.com",
        "market_cap": "Small Cap"
    },
    "BKNG.MX": {
        "short_name": "BOOKING HOLDINGS INC",
        "long_name": "Booking Holdings Inc.",
        "summary": "Booking Holdings Inc. provides travel and restaurant online reservation and related services worldwide. The company operates Booking.com, which offers online accommodation reservations; Rentalcars.com that provides online rental car reservation services; Priceline, which offer online travel reservation services, including hotel, rental car and airline ticket reservation services, as well as vacation packages and cruises; and Agoda that provides online accommodation reservation services, as well as flight, ground transportation and activities reservation services. It also operates KAYAK, an online price comparison service that allows consumers to search and compare travel itineraries and prices, comprising airline ticket, accommodation reservation, and rental car reservation information; and OpenTable for booking online restaurant reservations. Further, it offers travel-related insurance products, and restaurant management services. The company was formerly known as The Priceline Group Inc. and changed its name to Booking Holdings Inc. in February 2018. Booking Holdings Inc. was founded in 1997 and is headquartered in Norwalk, Connecticut.",
        "currency": "MXN",
        "sector": "Consumer Goods",
        "industry": "Recreational Goods, Other",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CT",
        "city": "Norwalk",
        "zipcode": "06854",
        "website": "http://www.bookingholdings.com",
        "market_cap": "Large Cap"
    },
    "BNG.BA": {
        "short_name": "BUNGE LIMITED",
        "long_name": "Bunge Limited",
        "summary": "Bunge Limited operates as an agribusiness and food company worldwide. It operates through five segments: Agribusiness, Edible Oil Products, Milling Products, Fertilizer, and Sugar and Bioenergy. The Agribusiness segment purchases, stores, transports, processes, and sells agricultural commodities and commodity products, including oilseeds primarily soybeans, rapeseed, canola, and sunflower seeds, as well as grains primarily wheat and corn; and vegetable oils and protein meals. It provides its products for animal feed manufacturers, livestock producers, wheat and corn millers, and other oilseed processors, as well as third-party edible oil processing companies; and for industrial and biodiesel production applications. The Edible Oil Products segment provides packaged and bulk oils and fats, including cooking oils, shortenings, margarines, mayonnaise, and others for baked goods companies, snack food producers, confectioners, restaurant chains, foodservice operators, infant nutrition companies, and other food manufacturers, as well as grocery chains, wholesalers, distributors, and other retailers. The Milling Products segment offers wheat flours and bakery mixes; corn milling products that include dry-milled corn meals and flours, wet-milled masa and flours, and flaking and brewer's grits, as well as soy-fortified corn meal, corn-soy blends, and other products; and whole grain and fiber ingredients. The Fertilizer segment offers nitrogen, phosphate, and potassium fertilizers; and SSP, ammonia, ammonium thiosulfate, monoammonium phosphate, diammonium phosphate, triple superphosphate, urea, urea-ammonium nitrate, ammonium sulfate, and potassium chloride. The Sugar and Bioenergy segment produces sugar and ethanol; and generates electricity from burning sugarcane bagasse. The company was founded in 1818 and is headquartered in St. Louis, Missouri.",
        "currency": "ARS",
        "sector": "Consumer Goods",
        "industry": "Farm Products",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "state": "MO",
        "city": "Saint Louis",
        "zipcode": "63017",
        "website": "http://www.bunge.com",
        "market_cap": "Large Cap"
    },
    "EHOS": {
        "short_name": "EHOUSE GLOBAL INC",
        "long_name": "Ehouse Global, Inc.",
        "summary": "Ehouse Global, Inc., a development stage company, develops and sells nutraceutical vitamins, supplements, and functional beverage products for the consumer packaged goods industry. Its products include Airarmor, a herbal cold and flu defense; Cal Mag Zinc, a multi-benefit mineral supplement; Electric Energy, a natural concentrated energy shot; Kids Daily, a daily multivitamin for children; Lemonade Detox, a lemonade cleansing diet formula; Liquid Vitamin D3, a multi-benefit daily supplement; LiquidDaily, a daily multivitamin for adults; Omega369, a multi-benefit vegetarian omega 3-6-9 complex; PreFade, a hangover prevention product; Restera, a sleep aid; Sportflex for joint health with antioxident superfruit; and Trimlite natural caffeine-free diet aid/fat burner. The company intends to offer its products to online retailers, grocery stores, pharmacies, convenience stores, and big box retailers. Ehouse Global, Inc. is based in San Diego, California.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Packaging & Containers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Diego",
        "zipcode": "92131",
        "website": null,
        "market_cap": "Small Cap"
    },
    "FVRG": {
        "short_name": "FOREVERGREEN WORLD",
        "long_name": "ForeverGreen Worldwide Corporation",
        "summary": "ForeverGreen Worldwide Corporation, through its subsidiaries, produces and sells diet foods and beverages, and natural products to enhance health. It offers Prodigy-5, a nutritional product that provides vitamins, minerals, antioxidants, and energy; PowerStrips that offers temporary relief of minor aches and pains; and FrequenSea Pro, an instant nutritional beverage. The company also markets and distributes natural food products, oils, and bath salts. It sells its products in the United States, Mexico, Japan, Canada, Singapore, New Zealand, Australia, Germany, Japan, the Netherlands, the United Kingdom, and internationally. The company is headquartered in Lindon, Utah.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Processed & Packaged Goods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "UT",
        "city": "Lindon",
        "zipcode": "84042",
        "website": "http://www.forevergreen.org",
        "market_cap": "Small Cap"
    },
    "GPRO.MX": {
        "short_name": "GOPRO INC.",
        "long_name": "GoPro, Inc.",
        "summary": "GoPro, Inc. develops and sells cameras, drones, and mountable and wearable accessories in the United States and internationally. The company offers cloud connected HERO7 Silver, HERO7 Black, HERO8 Black, and HERO9 Black waterproof cameras; MAX, a 360-degree waterproof camera; GoPro, a subscription service that offers cloud-based storage solutions and enables subscribers to access, edit, and share content, as well camera protection plans; Quik, a video editing application; and GoPro App, a mobile app that allows users to share and edit their photos and videos. It also offers mounts and accessories comprising equipment-based mounts consisting of helmet, handlebar, roll bar, and tripod mounts that enable consumers to wear the mount on their bodies, such as wrist housings, magnetic swivel clips, chest harnesses, and head straps; media, display, and light mods; spare batteries, dive filters, and charging accessories and cables; and lifestyle gears. In addition, the company provides mobile, desktop, and web applications that provides media workflow for archiving, editing, multi-clip story creation, and sharing content on the fly. GoPro, Inc. markets and sells its products through retailers and distributors, as well as through its website. The company was formerly known as Woodman Labs, Inc. and changed its name to GoPro, Inc. in February 2014. GoPro, Inc. was founded in 2002 and is headquartered in San Mateo, California.",
        "currency": "MXN",
        "sector": "Consumer Goods",
        "industry": "Electronic Equipment",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "San Mateo",
        "zipcode": "94402",
        "website": "http://www.gopro.com",
        "market_cap": "Small Cap"
    },
    "NCLHN.MX": {
        "short_name": "NORWEGIAN CRUISE LINE HLDGS LTD",
        "long_name": "Norwegian Cruise Line Holdings Ltd.",
        "summary": "Norwegian Cruise Line Holdings Ltd., together with its subsidiaries, operates as a cruise company in the North America, Europe, the Asia-Pacific, and internationally. The company operates the Norwegian Cruise Line, Oceania Cruises, and Regent Seven Seas Cruises brands. It offers itineraries ranging from three days to a 180-days calling on various locations, including destinations in Scandinavia, Russia, the Mediterranean, the Greek Isles, Alaska, Canada and New England, India and the rest of Asia, Tahiti and the South Pacific, Australia and New Zealand, Africa, South America, the Panama Canal, and the Caribbean. As of December 31, 2020, the company had 28 ships with approximately 59,150 berths. It distributes its products through retail/travel advisor and onboard cruise sales channels, as well as meetings, incentives, and charters. The company was founded in 1966 and is based in Miami, Florida.",
        "currency": "MXN",
        "sector": "Consumer Goods",
        "industry": "Recreational Goods, Other",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "FL",
        "city": "Miami",
        "zipcode": "33126",
        "website": "http://www.nclhltd.com",
        "market_cap": "Mid Cap"
    },
    "PNGB": {
        "short_name": "PANGLOBAL BRANDS INC",
        "long_name": "Panglobal Brands, Inc.",
        "summary": "Panglobal Brands, Inc. engages in the design, production, and sale of clothing and accessories in the United States and internationally. It merchandises and sells junior T-shirts, junior denim, dresses, skirts, and knit and woven tops. The company sells its products under Sosik, Scrapbook, Scrapbook Originals, Crafty Couture, Tea and Honey, and Haven brand names. It sells its products through a network of wholesale accounts. The company is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Textile - Apparel Clothing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Angeles",
        "zipcode": "90023",
        "website": "http://www.panglobalbrand.com",
        "market_cap": "Small Cap"
    },
    "UMAM": {
        "short_name": "UMAMI SUSTAINABLE SEAFOOD INC",
        "long_name": "Umami Sustainable Seafood Inc.",
        "summary": "Umami Sustainable Seafood Inc. engages in the fishing, farming, and sale of Bluefin Tuna for sushi and sashimi markets in Japan and internationally. It owns and operates Kali Tuna, an Atlantic Bluefin Tuna farming operation located in the Adriatic Sea off the coast of Croatia; and Baja Aqua Farms, a Pacific Bluefin Tuna farming operation located in the Pacific Ocean off Baja California, Mexico. The company was founded in 1996 and is based in San Diego, California.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Farm Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Diego",
        "zipcode": "92101",
        "website": null,
        "market_cap": "Small Cap"
    },
    "WFCF": {
        "short_name": "Where Food Comes From, Inc.",
        "long_name": "Where Food Comes From, Inc.",
        "summary": "Where Food Comes From, Inc. provides verification and certification solutions for the agriculture, livestock, and food industries in the United States. The company operates through verification and Certification, and Software Sales and Related Consulting segments. It conducts on-site and desk audits to verify that claims made about livestock, crops, and other food products are accurate, as well as offers Where Food Comes From Source Verified retail and restaurant labeling program, which connects consumers directly to the source of the food they purchase through product labeling, and web-based information sharing and education. The company also offers sustainability programs, compliance management, and farming information management solutions as software-as-a-service; maintenance, support, and software-related consulting services; and web-hosting services, as well as sells hardware. It serves beef and pork packers, organic producers and processors, and specialty retail chains. The company was formerly known as Integrated Management Information, Inc. and changed its name to Where Food Comes From, Inc. in December 2012. Where Food Comes From, Inc. was founded in 1996 and is headquartered in Castle Rock, Colorado.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Farm Products",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Castle Rock",
        "zipcode": "80104",
        "website": "http://wherefoodcomesfrom.com",
        "market_cap": "Small Cap"
    }
}