{
    "0RT7.L": {
        "short_name": "TENNECO INC TENNECO ORD SHS",
        "long_name": "Tenneco Inc.",
        "summary": "Tenneco Inc. designs, manufactures, and sells clean air, powertrain, and ride performance products and systems for light vehicle, commercial truck, off-highway, industrial, and aftermarket customers worldwide. The company operates through Clean Air, Powertrain, Ride Performance, and Motorparts segments. It offers clean air products and systems, including catalytic converters and diesel oxidation catalysts; diesel particulate filters(DPFs); burner systems; lean nitrogen oxide (NOx) traps; selective catalytic reduction (SCR) systems; hydrocarbon vaporizers and injectors; SCR-coated diesel particulate filters systems; urea dosing systems; four-way catalysts; alternative NOx reduction technologies; mufflers and resonators; fabricated exhaust manifolds; pipes; hydroformed assemblies; elastomeric hangers and isolators; and aftertreatment control units. The company also provides powertrain products and systems, such as pistons; piston rings; cylinder liners; valve seats and guides; bearings; spark plugs; valvetrain products; system protection products; and seals and gaskets. In addition, it offers motor parts, including steering and suspension, braking, sealing, engine, emission, and maintenance products, as well as shocks and struts; and ride performance products and systems comprising advanced suspension technologies, and ride control and braking products, as well as noise, vibration, and harshness performance materials. The company was formerly known as Tenneco Automotive Inc. and changed its name to Tenneco Inc. in 2005. Tenneco Inc. was founded in 1996 and is headquartered in Lake Forest, Illinois.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Auto Parts",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United States",
        "state": "IL",
        "city": "Lake Forest",
        "zipcode": "60045",
        "website": "http://www.tenneco.com",
        "market_cap": "Small Cap"
    },
    "ATAR": {
        "short_name": "AVATAR VENTURES",
        "long_name": "Avatar Ventures Corp.",
        "summary": "Avatar Ventures Corp., a development stage company, focuses on developing aftermarket electronic accessories for consumer motor vehicles in China. The company is developing a cellular phone car adapter that enables cellular text messages and wireless emails to be displayed on a small liquid crystal display screen attached to the car's dashboard area. It also develops mobile marketing solutions, ranging from simple text messaging campaigns to robust mobile applications. In addition, the company develops iText Direct, a proprietary SMS solution; and a mobile Website intended to assist clients in navigating existing mobile Websites and/or build new mobile Websites. Avatar Ventures Corp. was founded in 2006 and is based in Carson City, Nevada.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Carson City",
        "zipcode": "89703",
        "website": "http://www.avatarventurescorp.com",
        "market_cap": "Nano Cap"
    }
}