{
    "BNG.BA": {
        "short_name": "BUNGE LIMITED",
        "long_name": "Bunge Limited",
        "summary": "Bunge Limited operates as an agribusiness and food company worldwide. It operates through five segments: Agribusiness, Edible Oil Products, Milling Products, Fertilizer, and Sugar and Bioenergy. The Agribusiness segment purchases, stores, transports, processes, and sells agricultural commodities and commodity products, including oilseeds primarily soybeans, rapeseed, canola, and sunflower seeds, as well as grains primarily wheat and corn; and vegetable oils and protein meals. It provides its products for animal feed manufacturers, livestock producers, wheat and corn millers, and other oilseed processors, as well as third-party edible oil processing companies; and for industrial and biodiesel production applications. The Edible Oil Products segment provides packaged and bulk oils and fats, including cooking oils, shortenings, margarines, mayonnaise, and others for baked goods companies, snack food producers, confectioners, restaurant chains, foodservice operators, infant nutrition companies, and other food manufacturers, as well as grocery chains, wholesalers, distributors, and other retailers. The Milling Products segment offers wheat flours and bakery mixes; corn milling products that include dry-milled corn meals and flours, wet-milled masa and flours, and flaking and brewer's grits, as well as soy-fortified corn meal, corn-soy blends, and other products; and whole grain and fiber ingredients. The Fertilizer segment offers nitrogen, phosphate, and potassium fertilizers; and SSP, ammonia, ammonium thiosulfate, monoammonium phosphate, diammonium phosphate, triple superphosphate, urea, urea-ammonium nitrate, ammonium sulfate, and potassium chloride. The Sugar and Bioenergy segment produces sugar and ethanol; and generates electricity from burning sugarcane bagasse. The company was founded in 1818 and is headquartered in St. Louis, Missouri.",
        "currency": "ARS",
        "sector": "Consumer Goods",
        "industry": "Farm Products",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "state": "MO",
        "city": "Saint Louis",
        "zipcode": "63017",
        "website": "http://www.bunge.com",
        "market_cap": "Large Cap"
    },
    "UMAM": {
        "short_name": "UMAMI SUSTAINABLE SEAFOOD INC",
        "long_name": "Umami Sustainable Seafood Inc.",
        "summary": "Umami Sustainable Seafood Inc. engages in the fishing, farming, and sale of Bluefin Tuna for sushi and sashimi markets in Japan and internationally. It owns and operates Kali Tuna, an Atlantic Bluefin Tuna farming operation located in the Adriatic Sea off the coast of Croatia; and Baja Aqua Farms, a Pacific Bluefin Tuna farming operation located in the Pacific Ocean off Baja California, Mexico. The company was founded in 1996 and is based in San Diego, California.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Farm Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Diego",
        "zipcode": "92101",
        "website": null,
        "market_cap": "Small Cap"
    },
    "WFCF": {
        "short_name": "Where Food Comes From, Inc.",
        "long_name": "Where Food Comes From, Inc.",
        "summary": "Where Food Comes From, Inc. provides verification and certification solutions for the agriculture, livestock, and food industries in the United States. The company operates through verification and Certification, and Software Sales and Related Consulting segments. It conducts on-site and desk audits to verify that claims made about livestock, crops, and other food products are accurate, as well as offers Where Food Comes From Source Verified retail and restaurant labeling program, which connects consumers directly to the source of the food they purchase through product labeling, and web-based information sharing and education. The company also offers sustainability programs, compliance management, and farming information management solutions as software-as-a-service; maintenance, support, and software-related consulting services; and web-hosting services, as well as sells hardware. It serves beef and pork packers, organic producers and processors, and specialty retail chains. The company was formerly known as Integrated Management Information, Inc. and changed its name to Where Food Comes From, Inc. in December 2012. Where Food Comes From, Inc. was founded in 1996 and is headquartered in Castle Rock, Colorado.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Farm Products",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Castle Rock",
        "zipcode": "80104",
        "website": "http://wherefoodcomesfrom.com",
        "market_cap": "Small Cap"
    }
}