{
    "TSN.MX": {
        "short_name": "TYSON FOODS INC",
        "long_name": "Tyson Foods, Inc.",
        "summary": "Tyson Foods, Inc., together with its subsidiaries, operates as a food company worldwide. It operates through four segments: Beef, Pork, Chicken, and Prepared Foods. The company processes live fed cattle and live market hogs; fabricates dressed beef and pork carcasses into primal and sub-primal meat cuts, as well as case ready beef and pork, and fully-cooked meats; raises and processes chickens into fresh, frozen, and value-added chicken products; and supplies poultry breeding stock; sells specialty products , such as hides and meats. It also manufactures and markets frozen and refrigerated food products, including ready-to-eat sandwiches, flame-grilled hamburgers, Philly steaks, pepperoni, bacon, breakfast sausage, turkey, lunchmeat, hot dogs, flour and corn tortilla products, appetizers, snacks, prepared meals, ethnic foods, side dishes, meat dishes, breadsticks, and processed meats under the Jimmy Dean, Hillshire Farm, Ball Park, Wright, State Fair, Aidells, and Gallo Salame brands. The company also offers its products under Tyson and ibp brands. It sells its products through its sales staff to grocery retailers, grocery wholesalers, meat distributors, warehouse club stores, military commissaries, industrial food processing companies, chain restaurants or their distributors, live markets, international export companies, and domestic distributors who serve restaurants and foodservice operations, such as plant and school cafeterias, convenience stores, hospitals, and other vendors, as well as through independent brokers and trading companies. The company was founded in 1935 and is headquartered in Springdale, Arkansas.",
        "currency": "MXN",
        "sector": "Consumer Goods",
        "industry": "Farm Products",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Springdale"
    },
    "UMAM": {
        "short_name": "UMAMI SUSTAINABLE SEAFOOD INC",
        "long_name": "Umami Sustainable Seafood Inc.",
        "summary": "Umami Sustainable Seafood Inc. engages in the fishing, farming, and sale of Bluefin Tuna for sushi and sashimi markets in Japan and internationally. It owns and operates Kali Tuna, an Atlantic Bluefin Tuna farming operation located in the Adriatic Sea off the coast of Croatia; and Baja Aqua Farms, a Pacific Bluefin Tuna farming operation located in the Pacific Ocean off Baja California, Mexico. The company was founded in 1996 and is based in San Diego, California.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Farm Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "San Diego"
    }
}