{
  "BKNG.MX": {
    "city": "Norwalk",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Recreational Goods, Other",
    "long_name": "Booking Holdings Inc.",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Goods",
    "short_name": "BOOKING HOLDINGS INC",
    "state": "CT",
    "summary": "Booking Holdings Inc. provides travel and restaurant online reservation and related services worldwide. The company operates Booking.com, which offers online accommodation reservations; Rentalcars.com that provides online rental car reservation services; Priceline, which offer online travel reservation services, including hotel, rental car and airline ticket reservation services, as well as vacation packages and cruises; and Agoda that provides online accommodation reservation services, as well as flight, ground transportation and activities reservation services. It also operates KAYAK, an online price comparison service that allows consumers to search and compare travel itineraries and prices, comprising airline ticket, accommodation reservation, and rental car reservation information; and OpenTable for booking online restaurant reservations. Further, it offers travel-related insurance products, and restaurant management services. The company was formerly known as The Priceline Group Inc. and changed its name to Booking Holdings Inc. in February 2018. Booking Holdings Inc. was founded in 1997 and is headquartered in Norwalk, Connecticut.",
    "website": "http://www.bookingholdings.com",
    "zipcode": "06854"
  },
  "NCLHN.MX": {
    "city": "Miami",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Recreational Goods, Other",
    "long_name": "Norwegian Cruise Line Holdings Ltd.",
    "market": "mx_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Goods",
    "short_name": "NORWEGIAN CRUISE LINE HLDGS LTD",
    "state": "FL",
    "summary": "Norwegian Cruise Line Holdings Ltd., together with its subsidiaries, operates as a cruise company in the North America, Europe, the Asia-Pacific, and internationally. The company operates the Norwegian Cruise Line, Oceania Cruises, and Regent Seven Seas Cruises brands. It offers itineraries ranging from three days to a 180-days calling on various locations, including destinations in Scandinavia, Russia, the Mediterranean, the Greek Isles, Alaska, Canada and New England, India and the rest of Asia, Tahiti and the South Pacific, Australia and New Zealand, Africa, South America, the Panama Canal, and the Caribbean. As of December 31, 2020, the company had 28 ships with approximately 59,150 berths. It distributes its products through retail/travel advisor and onboard cruise sales channels, as well as meetings, incentives, and charters. The company was founded in 1966 and is based in Miami, Florida.",
    "website": "http://www.nclhltd.com",
    "zipcode": "33126"
  }
}
