{
    "PNGB": {
        "short_name": "PANGLOBAL BRANDS INC",
        "long_name": "Panglobal Brands, Inc.",
        "summary": "Panglobal Brands, Inc. engages in the design, production, and sale of clothing and accessories in the United States and internationally. It merchandises and sells junior T-shirts, junior denim, dresses, skirts, and knit and woven tops. The company sells its products under Sosik, Scrapbook, Scrapbook Originals, Crafty Couture, Tea and Honey, and Haven brand names. It sells its products through a network of wholesale accounts. The company is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Textile - Apparel Clothing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Los Angeles"
    },
    "RL.MX": {
        "short_name": "RALPH LAUREN CORP",
        "long_name": "Ralph Lauren Corporation",
        "summary": "Ralph Lauren Corporation designs, markets, and distributes lifestyle products in North America, Europe, Asia, and internationally. The company offers apparel, including a range of men's, women's, and children's clothing accessories, which comprise sandals, eyewear, watches, fashion and fine jewelry, scarves, hats, gloves, umbrellas, and belts, as well as leather goods, such as handbags, luggage, small leather goods, and belts; home products consisting of bedding and bath products, furniture, fabrics and wallpapers, lightings, tabletops, floorcoverings, and giftware; and fragrances. It sells apparel and accessories under the Ralph Lauren Collection, Ralph Lauren Purple Label, Polo Ralph Lauren, Double RL, Lauren Ralph Lauren, Polo Golf Ralph Lauren, Ralph Lauren Golf, RLX Ralph Lauren, Polo Ralph Lauren Children, Chaps, Club Monaco, and other brand names; women's fragrances under the Ralph Lauren Collection, Woman by Ralph Lauren, Romance Collection, Ralph Collection, and Big Pony Women's brand names; and men's fragrances under the Polo Blue, Safari, Purple Label, Polo Red, Polo Green, Polo Black, Polo Supreme, Polo Sport, and Big Pony Men's brand names. The company's restaurant concepts include The Polo Bar in New York City; RL Restaurant in Chicago; Ralph's in Paris; and Ralph's Coffee concept. Ralph Lauren Corporation sells its products to department stores, specialty stores, and golf and pro shops, as well as directly to consumers through its retail stores, concession-based shop-within-shops, and its digital commerce sites. The company directly operates 530 retail stores and 654 concession-based shop-within-shops; and operates 80 Ralph Lauren stores, 31 Ralph Lauren concession shops, and 139 Club Monaco stores and shops through licensing partners. Ralph Lauren Corporation was founded in 1967 and is based in New York, New York.",
        "currency": "MXN",
        "sector": "Consumer Goods",
        "industry": "Textile - Apparel Clothing",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "New York"
    },
    "UAA.MX": {
        "short_name": "UNDER ARMOUR INC",
        "long_name": "Under Armour, Inc.",
        "summary": "Under Armour, Inc., together with its subsidiaries, develops, markets, and distributes branded performance apparel, footwear, and accessories for men, women, and youth primarily in North America, Europe, the Middle East, Africa, the Asia-Pacific, and Latin America. The company offers its apparel in compression, fitted, and loose types to be worn in hot and cold. It also provides various footwear products for running, basketball, cleated sports, training, and outdoor. In addition, the company offers accessories, which include gloves, bags, and headwear; and digital fitness subscriptions, as well as digital advertising through MapMyFitness, MyFitnessPal, and Endomondo platforms. It primarily offers its products under the HEATGEAR, COLDGEAR, RUSH or RECOVER, UA Logo, UNDER ARMOUR, UA, ARMOUR, PROTECT THIS HOUSE, I WILL, ARMOURBOX, ARMOUR BRA, and ARMOUR FLEECE, as well as MyFitnessPal, MapMyFitness, and UNDER ARMOUR CONNECTED FITNESS brands. The company sells its products through wholesale channels, including national and regional sporting goods chains, independent and specialty retailers, department store chains, institutional athletic departments, and leagues and teams, as well as independent distributors; and directly to consumers through a network of 388 brand and factory house stores, as well as through e-commerce websites. Under Armour, Inc. was founded in 1996 and is headquartered in Baltimore, Maryland.",
        "currency": "MXN",
        "sector": "Consumer Goods",
        "industry": "Textile - Apparel Clothing",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Baltimore"
    }
}