{"BLNG.ME": {"short_name": "BELON", "long_name": "Belon Joint Stock Company", "summary": "Belon Joint Stock Company extracts, processes, and produces coal and related products in Russia. It offers coking coal grades and concentrates. The company was founded in 1991 and is based in Belovo, Russia.", "currency": "RUB", "sector": "Energy", "industry": "Thermal Coal", "exchange": "MCX", "market": "ru_market", "country": "Russia", "city": "Belovo"}, "KBTK.ME": {"short_name": "KUZBASSKAYA TOP CO", "long_name": "Public Joint Stock Company \"Kuzbasskaya Toplivnaya Company\"", "summary": "Public Joint Stock Company 'Kuzbasskaya Toplivnaya Company', together with its subsidiaries, engages in the extraction and production of thermal coal. The company operates through four segments: Domestic Sales of Produced Coal, Export Sales of Produced Coal, Resale of Purchased Coal, and Other Operations. It operates open-pit mines located in the territory of the Kemerovo region in Russia. The company is also involved in the wholesale supply of coal in Russia and internationally. In addition, it engages in the retail sale of coal to households, and municipal and commercial boilers through its distribution networks located in the Kemerovo, Omsk, Novosibirsk, and Altai regions, as well as in Poland. Further, the company is involved in the resale of coal purchased from other coal producers; generation of electricity, heat power, and hot water; provision of storage and railroad transportation services; and lease of land. It has operations in Russia, the European Union, and Asia. The company was founded in 2000 and is headquartered in Kemerovo, Russia. As of February 27, 2020, Public Joint Stock Company 'Kuzbasskaya Toplivnaya Company' operates as a subsidiary of Kilton Overseas Limited.", "currency": "RUB", "sector": "Energy", "industry": "Thermal Coal", "exchange": "MCX", "market": "ru_market", "country": "Russia", "city": "Kemerovo"}, "TIG.AX": {"short_name": "TIG REALM FPO", "long_name": "Tigers Realm Coal Limited", "summary": "Tigers Realm Coal Limited engages in the identification, exploration, development, mining, and sale of coal deposits in Russia and Asia. The company holds 100% interest in the Amaam North Project; and 80% interests in the Amaam Project located in the Bering Basin in the Chukotka province, Russia. It also owns and operates the Beringovsky port and coal terminal located to the north east of the Amaam North deposit. The company was incorporated in 2010 and is headquartered in Moscow, the Russian Federation.", "currency": "AUD", "sector": "Energy", "industry": "Thermal Coal", "exchange": "ASX", "market": "au_market", "country": "Russia", "city": "Moscow"}, "UKUZ.ME": {"short_name": "SOUTHERN KUZBASS C", "long_name": "Southern Kuzbass Coal company Public joint-stock company", "summary": "Southern Kuzbass Coal company Public joint-stock company produces coking and steam coal in Russia. Its mines are located in Mezhdurechensk, Kemerovo region. The company was founded in 1993 and is based in Mezhdurechensk, Russia. Southern Kuzbass Coal company Public joint-stock company is a subsidiary of Mechel Mining OAO.", "currency": "RUB", "sector": "Energy", "industry": "Thermal Coal", "exchange": "MCX", "market": "ru_market", "country": "Russia", "city": "Mezhdurechensk"}}