{
    "AAAK.AT": {
        "short_name": "Tria Alfa (CR)",
        "long_name": "Wool Industry Tria Alfa S.A.",
        "summary": "Wool Industry Tria Alfa S.A. engages in the wholesale of fabrics. It offers disposable medical-hospital type mask and polo blouses. The company was founded in 1927 is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Textile Industrial",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "AAAP.AT": {
        "short_name": "Tria Alfa (PR)",
        "long_name": "Wool Industry Tria Alfa S.A.",
        "summary": "Wool Industry Tria Alfa S.A. engages in the wholesale of fabrics. It offers disposable medical-hospital type mask and polo blouses. The company was founded in 1927 is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Textile Industrial",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "AKRIT.AT": {
        "short_name": "AKRITAS S.A. (CR)",
        "long_name": "Akritas S.A.",
        "summary": "Akritas S.A. produces and sells artificial timber products in Greece and internationally. The company provides triple-layered chipboards under the AKRIPAN name, as well as waterproof chipboards under the HYDROPAN name; melamine sheets under the AKRITAS name; and doors, worktops-kitchen tops, and surfaces under the POLYTHETA name. It also offers EVROPANEL, a wood board material used for various constructions, such as shop fitting interior design and trade fair furnishings, interior doors, tables, shelves, home and offices interior design, and partition walls constructions, as well as for sound isolation and thermal applications; and pine and spruce woodworking panels. The company sells its products through distribution centers. Akritas S.A. was founded in 1977 and is headquartered in Alexandroupoli, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Building Materials",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Alexandroupoli"
    },
    "AVAX.AT": {
        "short_name": "AVAX S.A.  (CR)",
        "long_name": "Avax S.A.",
        "summary": "Avax S.A., together with its subsidiaries, operates as a construction company in Greece and internationally. It operates through four segments: Construction, Concessions, Energy, and Other Activities. The company constructs civil engineering projects, including airports, banks, buildings, education facilities, garages, hospitals, hotels, Olympic sports facilities, special projects, sports facilities, and other civil engineering projects. It also constructs energy and industrial projects, such as environmental plants; natural gas and petrochemical projects; and power plant projects; and infrastructure projects, such as bridges, harbors, railroads, roads, and other infrastructure projects. In addition, the company is involved in activities focusing on the residential development-urban and country/holiday homes and investing in commercial real estate; and vehicle technical inspection, and facility management services. The company was formerly known as J&P-AVAX S.A. and changed its name to Avax S.A. in April 2019. Avax S.A. was founded in 1986 and is headquartered in Marousi, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Contractors",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Marousi"
    },
    "BIOKA.AT": {
        "short_name": "BIOKARPET S.A. (CR)",
        "long_name": "Biokarpet S.A.",
        "summary": "Biokarpet S.A. engages in the metallurgy, textile, and information technology sectors in Greece, rest of European union, and internationally. The company produces and trades in handmade and machine-made carpets, moquettes, blankets, flokati rugs, and other products for flooring and home decoration. It also offers upholstery fabrics, curtains, throws, straw mats, decorative species, and furniture; linen and wall coverings for bed and bath; wall to wall carpets and carpet tiles; indoor and outdoor wooden floors; and linens and wallpapers, as well as carpet cleaning and storage services. In addition, it designs, produces, and trades in aluminum-extruded products for construction and industrial uses; aluminum frames, shop windows, blowers, glass panes, interior partitions, etc.; and modulated aluminum and steel sheets. Further, the company designs and develops tailor-made integral information systems for enterprises and organizations. Additionally, it produces and distributes electricity through renewable sources. The company operates stores in Greece, Romania, Bulgaria, Cyprus, Poland, and Albania, as well as offers its products online. It also exports its products. Biokarpet S.A. was founded in 1950 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Textile Industrial",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "BIOSK.AT": {
        "short_name": "UNIBIOS HOLDING S.A",
        "long_name": "Unibios Holdings S.A.",
        "summary": "Unibios Holdings S.A., through its subsidiaries, develops and installs water treatment and recycling systems in Europe, Africa, and the Middle East. It also offers heating and air conditioning equipment, as well as installs and rents facade scaffoldings. The company was formerly known as Biossol SA and changed its name to Unibios Holdings S.A. in July 2008. Unibios Holdings S.A. was founded in 1940 and is based in Ano Liosia, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Pollution & Treatment Controls",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Ano Liosia"
    },
    "DOMIK.AT": {
        "short_name": "DOMIKI KRITIS S.A. (CR)",
        "long_name": "Domiki Kritis S.A.",
        "summary": "Domiki Kritis S.A. primarily engages in the construction of heavy infrastructure projects for public and private sectors in Greece. The company undertakes infrastructure projects, including road, port, building, residential, industrial, energy, electromechanical, hydraulic, sewerage, water supply, solid and waste management, renewable energy, and greening projects. It also engages in the real estate development activities, and production of electricity from renewable energy sources. The company was founded in 1985 and is based in Heraklion, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Heavy Construction",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Heraklion"
    },
    "DOPPLER.AT": {
        "short_name": "DOPPLER S.A. (CR)",
        "long_name": "Doppler S.A.",
        "summary": "Doppler S.A. designs, sells, installs, maintains, and services lifts and lift components worldwide. It offers elevators, such as elevator cabins; passenger lifts; panoramic lifts; cargo and car lifts; elevators for high rise buildings, hospitals, and transport and public buildings; home lifts; dumbwaiters; and platform lifts, as well as accessories, including side walls, handrails, floors, and false ceilings. The company also provides escalators and moving walks for use in airports, super markets, shopping centers, metro stations; parking systems for use in shopping centers, public buildings, and residences; inclined lifts; robotic parking systems; customized products for cruise ships, cargo ships, ferries, luxurious yachts, and offshore rigs; and spare parts. Doppler S.A. was founded in 2000 and is headquartered in Polykastro, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Polykastro"
    },
    "EKTER.AT": {
        "short_name": "EKTER S.A. (CR)",
        "long_name": "Ekter SA",
        "summary": "Ekter SA operates as a construction company. It undertakes various construction projects, including infrastructure projects, hospitals, airport terminals, museums, buildings and renovations, hotels, medical and hotel equipment, ICU buildings, and other projects. The company was founded in 1959 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Contractors",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "EPIL.AT": {
        "short_name": "Selected Texttile Ind. Assoc.",
        "long_name": "Selected Textiles S.A.",
        "summary": "Selected Textiles S.A. engages in the ginning of seed cotton; and production, dyeing, and treatment of yarns in Greece. It offers ecrou, dyed, single, twisted, combed, carded, and gazed mercerized yarns; and seeding and filature cotton by-products. The company also exports its products. Selected Textiles S.A. was founded in 1970 and is headquartered in Acharnes, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Textile Industrial",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Acharnes"
    },
    "FRIGO.AT": {
        "short_name": "FRIGOGLASS S.A. (CR)",
        "long_name": "Frigoglass S.A.I.C.",
        "summary": "Frigoglass S.A.I.C., together with its subsidiaries, engages in the manufacturing, trading, and distribution of commercial refrigeration units and packaging materials for the beverage industry. The company operates through Ice Cold Merchandise Operations and Glass Operations segments. It also offers glass bottles and containers, primarily for soft drinks, beer, and spirits industries, as well as in the cosmetics and pharmaceutical industries; and produces plastic crates and metal crowns. In addition, the company provides integrated, standard and post warranty, repair call management, rebranding and refurbishment, one-to-one placement, spare parts management, preventive maintenance, and technical training services. It operates in east Europe, west Europe, Africa, the Middle East, Asia, Oceania, and the United States. The company was founded in 1996 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "GEKTERNA.AT": {
        "short_name": "GEK TERNA S.A",
        "long_name": "GEK TERNA Holdings, Real Estate, Construction S.A.",
        "summary": "GEK TERNA Holdings, Real Estate, Construction S.A., together with its subsidiaries, engages in the construction, energy, real estate, industrial, and concession businesses in Greece, the Balkans, the Middle East, Eastern Europe, and North America. It is involved in the construction of railway and highway networks, office buildings, hospitals, museums, resorts, hydro-electric plants, dams, harbors, industrial facilities, power plants, etc. for public and private sectors; and the financing, management, and commercial exploitation of concession projects, such as management and operation of car parking. The company also produces electricity through wind, solar, hydropower, and biomass with an installed capacity of 1,386.5 megawatts. In addition, it engages in the acquisition, investment, development, and exploitation of real estate properties, including business and logistic centers, industrial and entertainment parks, residential and commercial properties, hotels, parking stations, etc. Further, the company is involved in the production of quarry products; extraction and processing of magnesite products; and the operation of Borovets Euphoria Club Hotel & Spa in Bulgaria. It also owns two thermal power plants with a total installed capacity of 147 MW and 435 MW in Viotia, Greece; and undertakes waste management projects. The company was formerly known as Ermis Real Estate Constructions Enterprises S.A. and changed its name to GEK TERNA Holdings, Real Estate, Construction S.A. in 2008. GEK TERNA Holdings, Real Estate, Construction S.A. was founded in 1960 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Contractors",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "IKTIN.AT": {
        "short_name": "IKTINOS HELLAS S.A. (CR)",
        "long_name": "Iktinos Hellas S.A. Greek Marble Industry Technical and Touristic Company",
        "summary": "Iktinos Hellas S.A. Greek Marble Industry Technical and Touristic Company quarries, cuts, and processes marbles in Greece, the Euro Area, and internationally. The company operates through Marble, Wind Energy, and Real Estate segments. It imports and trades in marbles, granites, and rare decorative stones; and operates as a dealer for artificial rocks and fine mosaics made of natural rocks. The company also offers natural stones, including natural Greek marbles, natural imported marbles, granites, and onyx; synthetic materials, such as quarellas; and other decorative materials comprising travertino, sandstone, psammite, limestone, slate, graphite, glass stone, and gemstone. In addition, it engages in the aeolian energy and real estate businesses. Iktinos Hellas S.A. Greek Marble Industry Technical and Touristic Company was founded in 1974 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Building Materials",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "INKAT.AT": {
        "short_name": "INTRACOM CONSTRUCTIONS S.A(CR)",
        "long_name": "Intracom Constructions Societe Anonyme Technical and Steel Constructions",
        "summary": "Intracom Constructions Societe Anonyme Technical and Steel Constructions engages in the construction business in Europe and internationally. The company operates through Constructions and Steel Structures segments. It offers infrastructure projects, such as airport, road, rail road, water engineering, and marine projects; and buildings that include offices, professional infrastructures, shopping centers, educational and cultural buildings, hospitals, health centers, sports venues, and stadiums. The company also provides develops real estate properties, such as villas and boutique hotels; and undertakes industrial facilities for industrial projects and logistics buildings. In addition, it operates motorways, broadband, integrated passenger information systems, waste management, and parking services through public private partnership, and built transfer and operate agreements; and undertakes telecommunication projects, including broadband networks, mobile telephony base stations and networks, wireless transmission systems, and specialized projects, as well as maintenance services. Further, the company provides solid and waste management projects that include waste management, soil remediation and regeneration, water refinery, and waste water treatment. Additionally, it undertakes projects of wind farms, photovoltaic parks, and natural gases. The company was founded in 1987 and is headquartered in Paiania, Greece. Intracom Constructions Societe Anonyme Technical and Steel Constructions is a subsidiary of Intracom Holdings S.A.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Heavy Construction",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Paiania"
    },
    "KLM.AT": {
        "short_name": "K.L.M. S.A. (CR)",
        "long_name": "I.Kloukinas-I.Lappas S.A.",
        "summary": "I.Kloukinas-I.Lappas S.A. engages in the commerce and construction businesses in Greece. The company constructs complex and specialized technical projects, including showrooms and exhibition areas, industrial units and warehouses, office buildings, bank branches and buildings, department stores and super markets, food services courts, public buildings, hospital buildings, and residential developments, as well as undertakes redevelopment of listed buildings, etc. It also undertakes and constructs projects in the public sector. In addition, the company operates shops under the Mothercare brand in Athens, Thessaloniki, Crete, Patra, Larissa, Rhodes, Kavala, Xanthi, Kilkis, Veria, Kozani, Karditsa, Edessa, Lamia, and Bucharest. Further, it undertakes woodworking projects; and engages in the research, construction, operation, and management of hydroelectric projects. The company serves customers in the banking sector, retail trade sector, hospitals, and other companies. I.Kloukinas-I.Lappas S.A. was founded in 1986 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Contractors",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "LANAC.AT": {
        "short_name": "LANAKAM S.A. (CR)",
        "long_name": "Lanakam S.A.",
        "summary": "Lanakam S.A. distributes apparel and accessories in Greece and Cyprus. The company primarily distributes DOLCE & GABBANA, Coccinelle, Guess, Danielle Alessandrini, LIU JO, Gold Case, Frankie Morello, and other branded apparel. It also operates Coccinelle mono-brand shop in Athens; and distributes outdoor heating and cooling products. The company was founded in 1941 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Textile Industrial",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "MATHIO.AT": {
        "short_name": "MATHIOS REFRACTORY S.A.",
        "long_name": "Mathios Refractories S.A.",
        "summary": "Mathios Refractories S.A. engages in the production and sale of refractory materials and building products in Greece and internationally. The company offers stones, bricks, and pavers; building materials, including glass blocks, firebricks, mortars and additives, and flooring and thermal insulation products; heating solutions, such as eco fireplaces, eco stoves, heat backs, and bioethanole fireplaces; and landscaping products comprising mat grass, mat green, vermiculite, forest whisper, and garden steps. It also offers research and development, engineering, procurement, installation, and other support services. The company provides its products under the brand names of IDEAL, MAT, MAT PLUS, MAT CAST, MAT MICRON and MAT NANO, MAT SF, and MAT RAM. It serves cement, steel, ceramic, aluminum, glass power plant, refinery, wood, food, lime, and fertilizer industries. The company was founded in 1890 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Building Materials",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "MOYZK.AT": {
        "short_name": "EL. D. Mouzakis S.A. (CR)",
        "long_name": "EL. D. Mouzakis S.A.",
        "summary": "EL. D. Mouzakis S.A. engages in the production and sale of textile products in Greece and other Eurozone countries. It operates through two segments, Threads-Yarns and Property Leasing. The company offers spinning products, such as sewing thread, embroidery, and knitting in various shapes and colors; and cotton products for sewing and knitting under the D.M.C. brand name. It is also involved in the ginning cotton seed for private use and disposal. EL. D. Mouzakis S.A. was founded in 1968 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Textile Industrial",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "MPITR.AT": {
        "short_name": "BITROS HOLDING S.A. (CR)",
        "long_name": "Bitros Holding S.A.",
        "summary": "Bitros Holding S.A. operates in the metallurgy, real-estate development, and energy sectors. The company offers various services related to metal industry, such as cut-to-length line, slitting line, hollow sections and pipes line, shotblasting and painting line, flame cutting line NC, and saw cutting of long products. It also provides concrete reinforcing steel in bars and coils, antiseismic reinforcement products, cage for pile reinforcement, wire mess, wires for the tying of the re-bars, plain reinforcing bars, plastic spacers, and insulation materials. In addition, the company constructs buildings, luxury apartments, residential complexes, summer residences, hospitals, educational centers, school buildings, supermarkets, and olympic projects. Further, it produces electricity from photovoltaic systems. Bitros Holdings S.A. was founded in 1945 and is headquartered in Aspropyrgos, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Metal Fabrication",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Aspropyrgos"
    },
    "NAYP.AT": {
        "short_name": "NAFPAKTOS TEXTILE IND.",
        "long_name": "Nafpaktos Textile Industry S.A.",
        "summary": "Nafpaktos Textile Industry S.A. engages in the cotton ginning and production of cotton yarns in Greece. It also has a photovoltaic park of 1.3 MWp, which generates electricity and sells it to the network. In addition, the company's primary sectors consisting textile, agricultural products, and renewable energy sources. Further, it exports its products to Italy, Germany, Austria, Spain, Bulgaria, Turkey, and Indonesia. The company was formerly known as Nafpaktos Textile Industry George Polychronos S.A. and changed its name to Nafpaktos Textile Industry S.A. in July 2002. Nafpaktos Textile Industry S.A. was founded in 1964 and is headquartered in Pefki, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Textile Industrial",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Pefki"
    },
    "PRD.AT": {
        "short_name": "PROODEFTIKH TECHN CO S.A. (CR)",
        "long_name": "Proodeftiki S.A.",
        "summary": "Proodeftiki S.A. operates as a civil engineering and general construction company. It constructs bridges, dams, roads, buildings, tunnels, harbors, motorways, airports, and sports facilities, as well as irrigation network, hydraulic, and wastewater treatment projects. The company also engages in the real estate development business. It has operations in Greece, Romania, and Bulgaria. The company was founded in 1960 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Contractors",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "VARNH.AT": {
        "short_name": "VARVARESSOS S.A. (CR)",
        "long_name": "Varvaressos S.A. European Spinning Mills",
        "summary": "Varvaressos S.A. European Spinning Mills produces and sells yarns. The company offers yarns from cellulosic man-made fibers, blended yarns, and cotton yarns, as well as multicount yarns, slub yarns, and core spun yarns. It sells its products in 20 countries. The company was formerly known as Varvaressos S.A. Naoussa Spinning Mill and changed its name to Varvaressos S.A. European Spinning Mills in January 2003. Varvaressos S.A. European Spinning Mills was incorporated in 1974 and is based in Naousa, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Textile Industrial",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Naousa"
    },
    "XYLEK.AT": {
        "short_name": "INTERWOOD-XYLEMPORIA ATENE(CR)",
        "long_name": "Interwood-Xylemporia A.T.E.N.E.",
        "summary": "Interwood-Xylemporia A.T.E.N.E. engages in the manufacturing and trading of wood products in Greece. It offers soft timber and outdoor profiles; soft wood products, including spruce timber, pine timber, and soft American timber; melamines; hard wood products; panels comprising blockboards, HDF smaltines, MDF, OSB, veneer, veneer coated surfaces, and chipboards; gluelam and bilam beams; and flooring products, such as outdoor decks, laminate floors, pre-polished floors, soft wood floors, and indoor parquets. The company was formerly known as Xylemporia A.T.E.N.E. and changed its name to Interwood-Xylemporia A.T.E.N.E. in September 2009. The company was founded in 1983 and is headquartered in Eleusis, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Lumber, Wood Production",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Eleusis"
    },
    "XYLEP.AT": {
        "short_name": "INTERWOOD-XYLEMPORIA ATENE(PR)",
        "long_name": "Interwood-Xylemporia A.T.E.N.E.",
        "summary": "Interwood-Xylemporia A.T.E.N.E. engages in the manufacturing and trading of wood products in Greece. It offers soft timber and outdoor profiles; soft wood products, including spruce timber, pine timber, and soft American timber; melamines; hard wood products; panels comprising blockboards, HDF smaltines, MDF, OSB, veneer, veneer coated surfaces, and chipboards; gluelam and bilam beams; and flooring products, such as outdoor decks, laminate floors, pre-polished floors, soft wood floors, and indoor parquets. The company was formerly known as Xylemporia A.T.E.N.E. and changed its name to Interwood-Xylemporia A.T.E.N.E. in September 2009. The company was founded in 1983 and is headquartered in Eleusis, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Lumber, Wood Production",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Eleusis"
    }
}