{
    "DOPPLER.AT": {
        "short_name": "DOPPLER S.A. (CR)",
        "long_name": "Doppler S.A.",
        "summary": "Doppler S.A. designs, sells, installs, maintains, and services lifts and lift components worldwide. It offers elevators, such as elevator cabins; passenger lifts; panoramic lifts; cargo and car lifts; elevators for high rise buildings, hospitals, and transport and public buildings; home lifts; dumbwaiters; and platform lifts, as well as accessories, including side walls, handrails, floors, and false ceilings. The company also provides escalators and moving walks for use in airports, super markets, shopping centers, metro stations; parking systems for use in shopping centers, public buildings, and residences; inclined lifts; robotic parking systems; customized products for cruise ships, cargo ships, ferries, luxurious yachts, and offshore rigs; and spare parts. Doppler S.A. was founded in 2000 and is headquartered in Polykastro, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Polykastro",
        "zipcode": "61200",
        "website": "http://www.doppler.gr",
        "market_cap": 6572000
    },
    "FRIGO.AT": {
        "short_name": "FRIGOGLASS S.A. (CR)",
        "long_name": "Frigoglass S.A.I.C.",
        "summary": "Frigoglass S.A.I.C., together with its subsidiaries, manufactures, trades in, and distributes commercial refrigeration units and packaging materials for the beverage industry. The company operates through Ice Cold Merchandise Operations and Glass Operations segments. It also offers glass containers and bottles, plastic crates, metal crowns, and other containers primarily for soft drinks, beer, food, spirits, cosmetics, and pharmaceutical industries. In addition, the company provides integrated, standard and post warranty, repair call management, rebranding and refurbishment, one-to-one placement, spare parts management, preventive maintenance, and technical training services. It operates in east Europe, west Europe, Africa, the Middle East, and Asia. The company was founded in 1996 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "145 64",
        "website": "http://www.frigoglass.com",
        "market_cap": 46562380
    }
}