{
  "AVAX.AT": {
    "city": "Marousi",
    "country": "Greece",
    "currency": "EUR",
    "exchange": "ATH",
    "industry": "General Contractors",
    "long_name": "Avax S.A.",
    "market": "gr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrial Goods",
    "short_name": "AVAX S.A.  (CR)",
    "state": null,
    "summary": "Avax S.A., together with its subsidiaries, operates as a construction company in Greece and internationally. It operates through four segments: Construction, Concessions, Energy, and Other Activities. The company constructs civil engineering projects, including airports, banks, buildings, education facilities, garages, hospitals, hotels, Olympic sports facilities, special projects, sports facilities, and other civil engineering projects. It also constructs energy and industrial projects, such as environmental plants; natural gas and petrochemical projects; and power plant projects; and infrastructure projects, such as bridges, harbors, railroads, roads, and other infrastructure projects. In addition, the company is involved in activities focusing on the residential development-urban and country/holiday homes and investing in commercial real estate; and vehicle technical inspection, and facility management services. The company was formerly known as J&P-AVAX S.A. and changed its name to Avax S.A. in April 2019. Avax S.A. was founded in 1986 and is headquartered in Marousi, Greece.",
    "website": "http://www.avax.gr",
    "zipcode": "151 25"
  },
  "BIOT.AT": {
    "city": "Athens",
    "country": "Greece",
    "currency": "EUR",
    "exchange": "ATH",
    "industry": "General Contractors",
    "long_name": "Bioter S.A.",
    "market": "gr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrial Goods",
    "short_name": "BIOTER S.A.(CR)",
    "state": null,
    "summary": "Bioter S.A. operates as a technical construction company in Greece and internationally. It is involved in the execution of various projects, such as roads, ports, industrial-energy, electromechanical-communications, airports, war industries factories, etc., as well as private projects, such as offices, banks, car stations, etc. The company was founded in 1961 and is based in Athens, Greece.",
    "website": "http://www.bioter.gr",
    "zipcode": "11634"
  },
  "EKTER.AT": {
    "city": "Athens",
    "country": "Greece",
    "currency": "EUR",
    "exchange": "ATH",
    "industry": "General Contractors",
    "long_name": "Ekter SA",
    "market": "gr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrial Goods",
    "short_name": "EKTER S.A. (CR)",
    "state": null,
    "summary": "Ekter SA operates as a construction company. It undertakes various construction projects, including infrastructure projects, hospitals, airport terminals, museums, buildings and renovations, hotels, medical and hotel equipment, ICU buildings, and other projects. The company was founded in 1959 and is based in Athens, Greece.",
    "website": "http://www.ekter.gr",
    "zipcode": "105 57"
  },
  "GEKTERNA.AT": {
    "city": "Athens",
    "country": "Greece",
    "currency": "EUR",
    "exchange": "ATH",
    "industry": "General Contractors",
    "long_name": "GEK TERNA Holdings, Real Estate, Construction S.A.",
    "market": "gr_market",
    "market_cap": "Small Cap",
    "sector": "Industrial Goods",
    "short_name": "GEK TERNA S.A",
    "state": null,
    "summary": "GEK TERNA Holdings, Real Estate, Construction S.A., together with its subsidiaries, engages in the construction, energy, real estate, industrial, and concession businesses in Greece, the Balkans, the Middle East, Eastern Europe, the United States, and internationally. The company is involved in the construction of motorways, buildings, ports, and large energy projects; the financing, management, and commercial exploitation of concession projects, such as operation of car parking. It also constructs and operates wind farms, hydroelectric projects, pumping storage projects, hybrid stations, and photovoltaics, as well as the undertaking of integrated projects for waste management, biofuels, and other materials with an installed capacity of 1,363.7 MW; and trades in electric energy and natural gas. In addition, the company engages in the acquisition, development, and exploitation of real estate properties, including business centers, logistic centers, industrial parks, entertainment parks, residential properties, commercial properties, hotels, etc.; production of quarry products; and exploitation of magnesite products. Further, it operates Borovets Euphoria Club Hotel & Spa in Bulgaria; and owns two thermal power plants with a total installed capacity of 147 MW and 435 MW in Viotia, Greece. The company was formerly known as Ermis Real Estate Constructions Enterprises S.A. and changed its name to GEK TERNA Holdings, Real Estate, Construction S.A. in 2008. The company was founded in 1960 and is headquartered in Athens, Greece.",
    "website": "http://www.gekterna.com",
    "zipcode": "115 26"
  },
  "KLM.AT": {
    "city": "Athens",
    "country": "Greece",
    "currency": "EUR",
    "exchange": "ATH",
    "industry": "General Contractors",
    "long_name": "I.Kloukinas-I.Lappas S.A.",
    "market": "gr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrial Goods",
    "short_name": "K.L.M. S.A. (CR)",
    "state": null,
    "summary": "I.Kloukinas-I.Lappas S.A. engages in the commerce and construction businesses in Greece. The company constructs complex and specialized technical projects, including showrooms and exhibition areas, industrial units and warehouses, office buildings, bank branches and buildings, department stores and super markets, food services courts, public buildings, hospital buildings, and residential developments, as well as undertakes redevelopment of listed buildings, etc. It also undertakes and constructs projects in the public sector. In addition, the company operates shops under the Mothercare brand in Athens, Thessaloniki, Crete, Patra, Larissa, Rhodes, Kavala, Xanthi, Kilkis, Veria, Kozani, Karditsa, Edessa, Lamia, and Bucharest. Further, it undertakes woodworking projects; and engages in the research, construction, operation, and management of hydroelectric projects. The company serves customers in the banking sector, retail trade sector, hospitals, and other companies. I.Kloukinas-I.Lappas S.A. was founded in 1986 and is headquartered in Athens, Greece.",
    "website": "http://www.klmate.gr",
    "zipcode": "115 21"
  },
  "OLYMP.AT": {
    "city": "Athens",
    "country": "Greece",
    "currency": "EUR",
    "exchange": "ATH",
    "industry": "General Contractors",
    "long_name": "Technical Olympic S.A.",
    "market": "gr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrial Goods",
    "short_name": "TECHNICAL OLYMPICS S.A.",
    "state": null,
    "summary": "Technical Olympic S.A. engages in the construction, marina management, and other businesses in Greece and internationally. Technical Olympic S.A. was founded in 1965 and is headquartered in Athens, Greece.",
    "website": "http://www.techol.gr",
    "zipcode": "174 56"
  },
  "PRD.AT": {
    "city": "Athens",
    "country": "Greece",
    "currency": "EUR",
    "exchange": "ATH",
    "industry": "General Contractors",
    "long_name": "Proodeftiki S.A.",
    "market": "gr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrial Goods",
    "short_name": "PROODEFTIKH TECHN CO S.A. (CR)",
    "state": null,
    "summary": "Proodeftiki S.A. operates as a civil engineering and general construction company. It constructs bridges, dams, roads, buildings, tunnels, harbors, motorways, airports, and sports facilities, as well as irrigation network, hydraulic, and wastewater treatment projects. The company also engages in the real estate development business. It has operations in Greece, Romania, and Bulgaria. The company was founded in 1960 and is based in Athens, Greece.",
    "website": "http://www.proodeftiki.gr",
    "zipcode": "114 73"
  }
}
