{
    "DOMIK.AT": {
        "short_name": "DOMIKI KRITIS S.A. (CR)",
        "long_name": "Domiki Kritis S.A.",
        "summary": "Domiki Kritis S.A. primarily engages in the construction of heavy infrastructure projects for public and private sectors in Greece. The company undertakes infrastructure projects, including road, port, building, residential, industrial, energy, electromechanical, hydraulic, sewerage, water supply, solid and waste management, renewable energy, and greening projects. It also engages in the real estate development activities, and production of electricity from renewable energy sources. The company was founded in 1985 and is based in Heraklion, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Heavy Construction",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Heraklion",
        "zipcode": "712 02",
        "website": "http://www.domik.gr",
        "market_cap": 13242836
    },
    "INKAT.AT": {
        "short_name": "INTRACOM CONSTRUCTIONS S.A(CR)",
        "long_name": "Intracom Constructions Societe Anonyme Technical and Steel Constructions",
        "summary": "Intracom Constructions Societe Anonyme Technical and Steel Constructions engages in the construction business in Europe and internationally. The company operates through Constructions and Steel Structures segments. It offers infrastructure projects, such as airport, road, rail road, water engineering, and marine projects; and buildings that include offices, professional infrastructures, shopping centers, educational and cultural buildings, hospitals, health centers, sports venues, and stadiums. The company also provides develops real estate properties, such as villas and boutique hotels; and undertakes industrial facilities for industrial projects and logistics buildings. In addition, it operates motorways, broadband, integrated passenger information systems, waste management, and parking services through public private partnership, and built transfer and operate agreements; and undertakes telecommunication projects, including broadband networks, mobile telephony base stations and networks, wireless transmission systems, and specialized projects, as well as maintenance services. Further, the company provides solid and waste management projects that include waste management, soil remediation and regeneration, water refinery, and waste water treatment. Additionally, it undertakes projects of wind farms, photovoltaic parks, and natural gases. The company was founded in 1987 and is headquartered in Paiania, Greece. Intracom Constructions Societe Anonyme Technical and Steel Constructions is a subsidiary of Intracom Holdings S.A.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Heavy Construction",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Paiania",
        "zipcode": "190 02",
        "website": "http://www.intrakat.gr",
        "market_cap": 58363836
    }
}