{"DETEC.HE": {"short_name": "Detection Technology Oyj", "long_name": "Detection Technology Oyj", "summary": "Detection Technology Oyj provides X-ray detector solutions for medical, security, and industrial applications in approximately 40 countries. The company offers X-ray line detectors, detector cards, and flat panel detectors; X-ray detector components, such as arrays and preamplifier ASICs; backside and frontside illuminated photodiode arrays; electronics; mechanics; and software products. Its X-ray detectors are used in computed tomography, digital mammography, bone densitometry, chest X-ray, and other medical applications; and X-ray imaging subsystems are used in train, vehicle, container, air cargo, and baggage and parcel scanning, as well as portable and people scanning. The company's products are also used in the agriculture, defense and aerospace, forest, mining, pharmaceutical, renewable energy, automotive, food, industrial process control, oil and gas, and recycling and waste sorting industries. Detection Technology Oyj was founded in 1991 and is based in Espoo, Finland.", "currency": "EUR", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "HEL", "market": "fi_market", "country": "Finland", "city": "Espoo"}, "VAIAS.HE": {"short_name": "Vaisala Corporation A", "long_name": "Vaisala Oyj", "summary": "Vaisala Oyj engages in the weather and environmental, and industrial measurement business serving weather related and industrial markets. The company's products include industrial measurement systems, such as indoor measurement and process control instruments, continuous monitoring systems, instruments for power transformers, and technology for liquid concentration measurement; and weather and environmental solutions comprising sensors and instruments, systems and solutions, and digital and data as a service products. It also offers technical support, calibration and repair, system maintenance, consulting, training, project, modernization, and continuous monitoring system services, as well as online stores. The company serves weather-dependent markets, such as meteorology, ground transportation, aviation, railway, maritime, safety and security, renewable energy, and ambient air quality; and various industrial customers includes life science and power industry. It has operations Europe, the Middle East, Africa, North and South Americas, and the Asia Pacific. The company was founded in 1936 and is headquartered in Vantaa, Finland.", "currency": "EUR", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "HEL", "market": "fi_market", "country": "Finland", "city": "Vantaa"}, "VAYA.F": {"short_name": "VAISALA OY  A", "long_name": "Vaisala Oyj", "summary": "Vaisala Oyj engages in the weather and environmental, and industrial measurement business serving weather related and industrial markets. The company's products include industrial measurement systems, such as indoor measurement and process control instruments, continuous monitoring systems, instruments for power transformers, and technology for liquid concentration measurement; and weather and environmental solutions comprising sensors and instruments, systems and solutions, and digital and data as a service products. It also offers technical support, calibration and repair, system maintenance, consulting, training, project, modernization, and continuous monitoring system services, as well as online stores. The company serves weather-dependent markets, such as meteorology, ground transportation, aviation, railway, maritime, safety and security, renewable energy, and ambient air quality; and various industrial customers includes life science and power industry. It has operations Europe, the Middle East, Africa, North and South Americas, and the Asia Pacific. The company was founded in 1936 and is headquartered in Vantaa, Finland.", "currency": "EUR", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "FRA", "market": "dr_market", "country": "Finland", "city": "Vantaa"}}