{
    "CRDFA.IS": {
        "short_name": "CREDITWEST FAKTORING",
        "long_name": "Creditwest Faktoring Anonim Sirketi",
        "summary": "Creditwest Faktoring Anonim Sirketi provides factoring activities for domestic and international transactions. The company was formerly known as Creditwest Faktoring Hizmetleri A.S. and changed its name to Creditwest Faktoring Anonim Sirketi in July 2012. The company was founded in 1994 and is headquartered in Istanbul, Turkey. Creditwest Faktoring Anonim Sirketi is a subsidiary of ALTINBAS HOLDING A.S.",
        "currency": "TRY",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": null,
        "website": "http://www.creditwest.com.tr",
        "market_cap": "Small Cap"
    },
    "ISFIN.IS": {
        "short_name": "IS FIN.KIR.",
        "long_name": "Is Finansal Kiralama Anonim Sirketi",
        "summary": "Is Finansal Kiralama Anonim Sirketi, together with its subsidiaries, engages in leasing and factoring operations in Turkey and internationally. Its leasing products include sale and lease back, software leasing, and operational leasing. The company also provides second hand market services, insurance transactions, and after sales services. It operates through a network of 15 branches. The company serves micro businesses, SMEs, and corporate firms. Is Finansal Kiralama Anonim Sirketi was founded in 1988 and is headquartered in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34330",
        "website": "http://www.isleasing.com.tr",
        "market_cap": "Small Cap"
    },
    "LIDFA.IS": {
        "short_name": "LIDER FAKTORING",
        "long_name": "Lider Faktoring A.S.",
        "summary": "Lider Faktoring A.S. operates as a factoring company in Turkey. It engages in the factoring and debt management of credit impaired assets portfolios. The company was formerly known as Lider Faktoring Hizmetleri A.S. to Lider Faktoring A.S. in July 2013. Lider Faktoring A.S. was founded in 1992 and is headquartered in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34394",
        "website": "http://www.liderfaktoring.com.tr",
        "market_cap": "Small Cap"
    },
    "QNBFL.IS": {
        "short_name": "QNB FINANS FINANSAL KIRALAMA",
        "long_name": "QNB Finans Finansal Kiralama AS",
        "summary": "QNB Finans Finansal Kiralama AS provides financial leasing services in Turkey and internationally. The company offers finance leasing services for wind turbines and solar power plants, heavy machinery, automobiles, medical equipment, agricultural equipment, printing equipment, textile equipment, commercial vehicles, real estate, office equipment, manufacturing machines, and technological equipment. It serves corporations and self-employed professionals. The company was founded in 1990 and is headquartered in Istanbul, Turkey. QNB Finans Finansal Kiralama AS is a subsidiary of QNB Finansbank A.S.",
        "currency": "TRY",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34394",
        "website": "http://www.qnbfl.com",
        "market_cap": "Small Cap"
    },
    "SEKFK.IS": {
        "short_name": "SEKER FIN. KIR.",
        "long_name": "Seker Finansal Kiralama A.S.",
        "summary": "Seker Finansal Kiralama A.S. provides financial leasing services. It offers leasing services for production machinery, work machine and forklift, logistics transport equipment, commercial/passenger vehicle, agricultural equipment, medical devices, yacht and boat, and energy and technology, as well as workplaces, offices, factory building, and land leasing services. The company was founded in 1997 and is headquartered in Istanbul, Turkey. Seker Finansal Kiralama A.S. is a subsidiary of Sekerbank T.A.S.",
        "currency": "TRY",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34394",
        "website": "http://www.sekerleasing.com.tr",
        "market_cap": "Small Cap"
    }
}