{
    "DMW2.F": {
        "short_name": "FREEDOM HLDG  DL-,001",
        "long_name": "Freedom Holding Corp.",
        "summary": "Freedom Holding Corp., through its subsidiaries, provides retail securities brokerage, research, investment counseling, securities trading, market making, corporate investment banking, and underwriting services. The company offers investment brokerage services for exchange-traded and over-the-counter corporate equity and debt securities, money market instruments, exchange traded options and futures contracts, government bonds, and mutual funds; Margin Lending services collateralized by securities and cash in the customer's account; various investment education and training courses; and investment research services. It also provides capital raising solutions for corporate clients through initial public offerings and follow-on offerings; and debt capital markets solutions that focuses on structuring and distributing private and public debt for various purposes, including buyouts, acquisitions, growth capital financings, and recapitalizations. In addition, the company is involved in trading, investment, and brokerage activities. Further, it act as an intermediary between borrowers and lenders of short-term funds and provide funding for various inventory positions; and employs repurchase and reverse repurchase agreements in proprietary trading activities. It has operations primarily in Russia, Kazakhstan, Ukraine, Uzbekistan, Kyrgyzstan, and Cyprus. The company was formerly known as BMB Munai, Inc. and changed its name to Freedom Holding Corp. Freedom Holding Corp. was incorporated in 1981 and is headquartered in Almaty, Kazakhstan.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Kazakhstan",
        "city": "Almaty"
    },
    "FRHC": {
        "short_name": "Freedom Holding Corp.",
        "long_name": "Freedom Holding Corp.",
        "summary": "Freedom Holding Corp., through its subsidiaries, provides retail securities brokerage, research, investment counseling, securities trading, market making, corporate investment banking, and underwriting services. The company offers investment brokerage services for exchange-traded and over-the-counter corporate equity and debt securities, money market instruments, exchange traded options and futures contracts, government bonds, and mutual funds; Margin Lending services collateralized by securities and cash in the customer's account; various investment education and training courses; and investment research services. It also provides capital raising solutions for corporate clients through initial public offerings and follow-on offerings; and debt capital markets solutions that focuses on structuring and distributing private and public debt for various purposes, including buyouts, acquisitions, growth capital financings, and recapitalizations. In addition, the company is involved in trading, investment, and brokerage activities. Further, it act as an intermediary between borrowers and lenders of short-term funds and provide funding for various inventory positions; and employs repurchase and reverse repurchase agreements in proprietary trading activities. It has operations primarily in Russia, Kazakhstan, Ukraine, Uzbekistan, Kyrgyzstan, and Cyprus. The company was formerly known as BMB Munai, Inc. and changed its name to Freedom Holding Corp. Freedom Holding Corp. was incorporated in 1981 and is headquartered in Almaty, Kazakhstan.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Kazakhstan",
        "city": "Almaty"
    },
    "H4L1.F": {
        "short_name": "HALYK SAV.BK.GDRS/40 KT15",
        "long_name": "Joint Stock Company Halyk Savings Bank of Kazakhstan",
        "summary": "Joint Stock Company Halyk Savings Bank of Kazakhstan and its subsidiaries provides corporate and retail banking services primarily in the Republic of Kazakhstan, Russia, Kyrgyzstan, Tajikistan, Georgia, and Uzbekistan. It operates through four segments: Corporate Banking, Small and Medium Enterprises Banking (SME), Retail Banking, and Investment banking. The company originates loans and guarantees; collects deposits; trades in securities and foreign currencies; executes transfers; and offers cash and payment card processing, and other banking services. Its products and services include current and correspondent accounts; various deposit products; investment savings products; credit and debit cards; consumer loans and mortgages; custody, cash, and foreign currency related services; overdrafts; other credit facilities; and letters of credit, trade finance products, foreign exchange, documentary, and capital market services. In addition, it offers leasing, telecommunications, broker and dealer, cash collection, and asset management services; and property and casualty, liability, personal, and life insurance products, as well as Internet, online, mobile, and SMS banking services. The company serves individuals, corporate clients and financial organizations, and SME clients and individual entrepreneurs. As of December 31, 2019, it operated through its head office in Almaty and its 24 regional branches, 120 sub-regional offices, and 482 cash settlement units. The company was founded in 1923 and is headquartered in Almaty, the Republic of Kazakhstan. Joint Stock Company Halyk Savings Bank of Kazakhstan is a subsidiary of JSC HG Almex.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Kazakhstan",
        "city": "Almaty"
    }
}