{
    "CPGN.MX": {
        "short_name": "COMPASS GROUP PLC",
        "long_name": "Compass Group PLC",
        "summary": "Compass Group PLC, together with its subsidiaries, operates as a food and support services company in North America, Europe, and internationally. It serves business and industry; healthcare and senior living market; education; sports and leisure; and defense, offshore, and remote sectors. The company also offers support services, such as cleaning in hospitals; reception services at corporate headquarters; managing remote camps; grounds and facilities services at schools and universities; and others. Compass Group PLC was founded in 1941 and is based in Chertsey, the United Kingdom.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Restaurants",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Chertsey",
        "zipcode": "KT16 9BQ",
        "website": "http://www.compass-group.com",
        "full_time_employees": 548143
    },
    "ITRKN.MX": {
        "short_name": "INTERTEK GROUP",
        "long_name": "Intertek Group plc",
        "summary": "Intertek Group plc provides quality assurance solutions to various industries worldwide. It operates in three segments: Products, Trade, and Resources. The Products segment offers assurance, testing, inspection, and certification services (ATIC), including laboratory safety, quality and performance testing, second-party supplier auditing, sustainability analysis, products assurance, vendor compliance, process performance analysis, facility plant and equipment verification, and third party certification. This segment serves a range of industries, including textiles, footwear, toys, hardlines, home appliances, consumer electronics, information and communication technology, automotive, aerospace, lighting, building products, industrial and renewable energy products, food and hospitality, healthcare and beauty, and pharmaceuticals. The Trade segment provides cargo inspection, analytical assessment, calibration, and related research and technical services to the petroleum and biofuels industries; inspection services to governments and regulatory bodies to support trade activities; and analytical and testing services to agricultural trading companies and growers. The Resources segment offers technical inspection, asset integrity management, analytical testing, and ongoing training services for the oil, gas, nuclear, and power industries. This segment also provides a range of ATIC service solutions to the mining and minerals exploration industries covering the resource supply chain from exploration and resource development, through to production, shipping, and commercial settlement. The company also offers cyber security services. Intertek Group plc was founded in 1885 and is based in London, the United Kingdom.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Business Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1G 0PS",
        "website": "http://www.intertek.com",
        "full_time_employees": 43769
    },
    "OCDON.MX": {
        "short_name": "OCADO GROUP PLC",
        "long_name": "Ocado Group plc",
        "summary": "Ocado Group plc operates as an online grocery retailer in the United Kingdom and internationally. The company operates through three segments: Ocado Retail, UK Solutions & Logistics, and International Solutions. It also sells general merchandise products on its Ocado.com; provides online retail solutions; and offers customer fulfillment centre and logistics services. The company was founded in 2000 and is headquartered in Hatfield, the United Kingdom.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Grocery Stores",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Hatfield",
        "zipcode": "AL10 9UL",
        "website": "http://www.ocadogroup.com",
        "full_time_employees": 18618
    },
    "RELN.MX": {
        "short_name": "RELX PLC",
        "long_name": "RELX PLC",
        "summary": "RELX PLC provides information-based analytics and decision tools for professional and business customers in North America, Europe, and internationally. It operates through four segments: Scientific, Technical & Medical; Risk; Legal; and Exhibitions. The Scientific, Technical & Medical segment provides information and analytics that help institutions and professionals to progress in science and advance healthcare. The Risk segment offers information-based analytics and decision tools that combine public and industry specific content with technology and algorithms to assist clients in evaluating and predicting risk. The Legal segment provides legal, regulatory, and business information and analytics that help customers in decision-making, as well as enhance the productivity. The Exhibitions segment is involved in the events business. The company was formerly known as Reed Elsevier PLC and changed its name to RELX PLC in July 2015. The company was incorporated in 1903 and is headquartered in London, the United Kingdom.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Publishing - Newspapers",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "WC2N 5JR",
        "website": "http://www.relx.com",
        "full_time_employees": 33200
    },
    "TSCON.MX": {
        "short_name": "TESCO",
        "long_name": "Tesco PLC",
        "summary": "Tesco PLC, together with its subsidiaries, operates as a grocery retailer. The company operates through convenience and hypermarket store formats, as well as engages in the wholesale business. It also provides retail banking and insurance services. The company operates in the United Kingdom, the Republic of Ireland, the Czech Republic, Hungary, Poland, Slovakia, Malaysia, and Thailand. The company serves its customers through stores, as well as online. Tesco PLC was founded in 1919 and is headquartered in Welwyn Garden City, the United Kingdom.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Grocery Stores",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Welwyn Garden City",
        "zipcode": "AL7 1GA",
        "website": "http://www.tescoplc.com",
        "full_time_employees": 300000
    }
}