{
    "ITRKN.MX": {
        "short_name": "INTERTEK GROUP",
        "long_name": "Intertek Group plc",
        "summary": "Intertek Group plc provides quality assurance solutions to various industries worldwide. It operates in three segments: Products, Trade, and Resources. The Products segment offers assurance, testing, inspection, and certification services (ATIC), including laboratory safety, quality and performance testing, second-party supplier auditing, sustainability analysis, products assurance, vendor compliance, process performance analysis, facility plant and equipment verification, and third party certification. This segment serves a range of industries, including textiles, footwear, toys, hardlines, home appliances, consumer electronics, information and communication technology, automotive, aerospace, lighting, building products, industrial and renewable energy products, food and hospitality, healthcare and beauty, and pharmaceuticals. The Trade segment provides cargo inspection, analytical assessment, calibration, and related research and technical services to the petroleum and biofuels industries; inspection services to governments and regulatory bodies to support trade activities; and analytical and testing services to agricultural trading companies and growers. The Resources segment offers technical inspection, asset integrity management, analytical testing, and ongoing training services for the oil, gas, nuclear, and power industries. This segment also provides a range of ATIC service solutions to the mining and minerals exploration industries covering the resource supply chain from exploration and resource development, through to production, shipping, and commercial settlement. The company also offers cyber security services. Intertek Group plc was founded in 1885 and is based in London, the United Kingdom.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Business Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1G 0PS",
        "website": "http://www.intertek.com",
        "market_cap": null
    }
}