{
    "1010.SR": {
        "short_name": "Riyad Bank",
        "long_name": "Riyad Bank",
        "summary": "Riyad Bank provides various banking products and services in the Kingdom of Saudi Arabia. The company operates through Retail Banking, Investment Banking and Brokerage, Corporate Banking, and Treasury and Investments segments. The Retail Banking segment offers deposits, credit, and investment products for individuals and small to medium sized businesses. The Investment Banking and Brokerage segment provides investment management services; and asset management services related to dealing, managing, arranging, advising, and custody of securities. The Corporate Banking segment offers current accounts, deposits, loans, overdrafts, and other credit facilities. The Treasury and Investments segment offers money market, trading, and treasury and derivative products and services, as well as manages investment portfolios. The company also provides saving account and term deposit products; personal, car, and home finance; Islamic banking products and services; and digital banking services. In addition, it owns, buys, and sells real estate; and acts as an agent for insurance products. It operates through a network of approximately 341 branches in the Kingdom of Saudi Arabia; a branch in London, the United Kingdom; an agency in Houston, the United States; and a representative office in Singapore. Riyad Bank was founded in 1957 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11416",
        "website": "http://www.riyadbank.com",
        "market_cap": "Large Cap"
    },
    "1020.SR": {
        "short_name": "Bank AlJazira",
        "long_name": "Bank AlJazira",
        "summary": "Bank AlJazira provides a range of Shari'ah compliant banking products and services for individuals, corporates, small to medium sized businesses, and institutions in the Kingdom of Saudi Arabia. The company operates through Personal Banking, Corporate Banking, Treasury, Brokerage and Asset Management, and Takaful Ta'awuni segments. It offers various personal banking products and services, including saving and current accounts; real estate and personal financing services; safety deposits; money transfer; investment products; and ladies and e-banking services. The company also provides Islamic funding services; global transaction services, such as cash management, trade financing, and corporate payroll services; syndication financing services; and commercial and online banking services, as well as services for the public sector and financial institutions. In addition, it offers investment banking services comprising brokerage and asset management services, as well as corporate investment banking services through initial public offerings, private placement, capital increase, and underwriting. Further, the company provides private banking products and services, including ATM and credit cards, safe deposit lockers, trading commission, foreign currency exchange, short term deposits, and structured products; real-estates investments; wealth management services; and treasury services, including naqa'a and thrift saving programs, foreign exchange, FX forward, structured products, and hedging solutions, as well as margin financing services. As of December 31, 2020, it operated a network of 79 branches and 62 Fawri remittance centers. The company was incorporated in 1975 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": null,
        "website": "http://www.bankaljazira.com",
        "market_cap": "Mid Cap"
    },
    "1050.SR": {
        "short_name": "Banque Saudi Fransi",
        "long_name": "Banque Saudi Fransi",
        "summary": "Banque Saudi Fransi provides banking and financial services in the Kingdom of Saudi Arabia and internationally. Its deposit products include demand accounts, saving accounts, current accounts, money market deposits, term deposits, and notice deposits, as well as mada Pay and Apple Pay products. The company's loan portfolio comprises home and personal loans, consumer loans, overdrafts, corporate finance, working capital finance, contract finance, structured finance, trade finance, Islamic finance, project finance, and credit and debit cards, as well as other credit facilities. It also provides forex and derivative products; treasury services, such as trading activities, investment securities, capital markets, and bank's funding operations; and cash and wealth management services. In addition, the company provides investment management services; asset management activities related to dealing, managing, arranging, advising, and custody of securities; retail investment products; international and brokerage services; education, retirement, travel protection, and car protection insurance plans; and ATM, and Islamic and e-banking services. It operates through a network of 87 branches. Banque Saudi Fransi founded in 1977 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11554",
        "website": "http://www.alfransi.com.sa",
        "market_cap": "Large Cap"
    },
    "1090.SR": {
        "short_name": "SAMBA Financial Group",
        "long_name": "Samba Financial Group",
        "summary": "Samba Financial Group provides various banking products and services. The company operates through four segments: Consumer Banking, Corporate Banking, Treasury, and Investment Banking. The Consumer Banking segment offers individual customer time deposits, current, call, and savings accounts, as well as credit cards, retail investment products, and individual and consumer loans. The Corporate Banking segment provides corporate time deposits, current and call accounts, overdrafts, loans and other credit facilities, and corporate advisory services, as well as derivative portfolios. The Treasury segment primarily manages money market, foreign exchange, commission rate trading, and derivatives for corporate and institutional customers. The Investment Banking segment is involved in the investment management and asset management activities related to dealing, managing, arranging, advising, and custody businesses. The company also offers Islamic banking products, as well as manages real estate projects; and provides debit cards and online banking services. It operates 73 branches in the Kingdom of Saudi Arabia; and two overseas branches. Samba Financial Group was founded in 1955 and is headquartered in Riyadh, the Kingdom of Saudi Arabia. As of April 1, 2021, Samba Financial Group was acquired by The National Commercial Bank.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11421",
        "website": "http://www.samba.com",
        "market_cap": "Large Cap"
    },
    "1120.SR": {
        "short_name": "Al Rajhi Bank",
        "long_name": "Al Rajhi Banking and Investment Corporation",
        "summary": "Al Rajhi Banking and Investment Corporation, together with its subsidiaries, engages in banking and investment activities in the Kingdom of Saudi Arabia and internationally. The company operates through four segments: Retail, Corporate, Treasury, and Investment Services and Brokerage. It offers current, affluent, private, ladies, business, and escrow accounts; personal, auto, home, car, real estate, fleet, payroll, POS merchant, contract, invoice, and working capital finance services; credit and debit cards; and vehicle, property, family protection, medical, personal accident, travel, marine and cargo, engineering, machinery breakdown, and professional liability insurance products. The company also provides documentary collection, letters of credit, letters of guarantee, supply chain finance, and e-trade services; cash management services; and investment products. In addition, it offers various corporate products, such as Bai Al Ajel, a financing facility that provides cash to customers; Murabaha contracts that allow customers to purchase raw materials, capital goods, and other consumables from local and international markets; Musharaka that enables customers to import goods and equipment; Istisnaa for financing real estate projects; Akar for investing in properties; and Erad that provides credit facilities against the assignment of rental income for a specific period for those interested in financing a real estate purchase. Further, the company provides treasury products, including direct investment, FX, gold trading, and bank notes; and mutual funds, investment, and local and international share trading services. It operates through a network of 591 branches. The company was founded in 1957 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "12263-2743",
        "website": "http://www.alrajhibank.com.sa",
        "market_cap": "Large Cap"
    },
    "1140.SR": {
        "short_name": "Bank Albilad",
        "long_name": "Bank Albilad",
        "summary": "Bank Albilad provides various banking products and services in the Kingdom of Saudi Arabia. It operates through Retail Banking, Corporate Banking, Treasury, and Investment Banking and Brokerage segments. The Retail Banking segment offers deposits, financing, remittances, and currency exchange products and services to individuals. The Corporate Banking segment provides deposits, financing, and trade services to corporate customers. The Treasury segment offers money market and treasury services. The Investment Banking and Brokerage segment offers investment management services; and undertakes asset management activities related to dealing, managing, arranging, advising, and custody of securities. It also provides payroll payment and vendor registration services; and debit, credit, medad, and household labor cards, as well as e-services. It operates through a network of 111 banking branches and 177 exchange and remittance centers. The company was founded in 2004 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "3952-12711",
        "website": "http://www.bankalbilad.com",
        "market_cap": "Mid Cap"
    },
    "1150.SR": {
        "short_name": "Alinma Bank",
        "long_name": "Alinma Bank",
        "summary": "Alinma Bank provides banking and investment services in the Kingdom of Saudi Arabia. It operates through Retail Banking, Corporate Banking, Treasury, and Investment and Brokerage segments. The company provides various retail services, including current, family, education, and savings accounts; self-service banking, such as internet, mobile, and phone banking services; debit, credit, traveler, and prepaid cards; point of sale services; car, real estate, personal, and education financing; and bill payment services. It also offers treasury, letters of guarantee, documentary collection, import and export letters of credit, and guarantee verification services; cash management services; corporate partner services; finance and investment products; financial services to small and medium enterprises (SMEs); and payroll management, point of sale, and payment gateway services. In addition, the company provides investment management, asset management, custodianship, advisory, underwriting, and brokerage services; and operates as an insurance agent. Alinma Bank offers its services to individuals, corporates, SMEs, and institutional customers. As of December 31, 2020, the company served through its network of 98 branches. Alinma Bank was founded in 2006 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11586",
        "website": "http://www.alinma.com",
        "market_cap": "Large Cap"
    },
    "1182.SR": {
        "short_name": "Amlak International for Real Es",
        "long_name": "Amlak International for Real Estate Finance Company",
        "summary": "Amlak International for Real Estate Finance Company provides real estate finance in Saudi Arabia. The company operates through Retail and Corporate segments. It also provides finance products to small and medium sized businesses, and individuals; and financing products to corporate, high net worth individuals, and institutional customers. Amlak International for Real Estate Finance Company was founded in 2007 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Mortgage Finance",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": null,
        "website": "http://www.amlakint.com",
        "market_cap": "Small Cap"
    },
    "2140.SR": {
        "short_name": "AYYAN Investment Co.",
        "long_name": "Ayyan Investment Company",
        "summary": "Ayyan Investment Company, together with its subsidiaries, engages in the construction of non-residential buildings in the Kingdom of Saudi Arabia. Its non-residential buildings include schools, hospital, hotels, etc. The company also establishes and operates health, education, tourism, and agricultural facilities; and establishes cold storage facilities, transport fleets, and gas stations. In addition, it maintains, manages, and operates industrial and residential properties, as well as hospitals, clinics, medical centers, and dispensaries; owns lands; and invests in securities. Further, the company produces and sells dates and its derivatives. The company was formerly known as Al Ahsa Development Company and changed its name to Ayyan Investment Company in July 2020. Ayyan Investment Company was founded in 1993 and is headquartered in Al Khobar, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Al Khobar",
        "zipcode": "31952",
        "website": "http://ayyan.com.sa",
        "market_cap": "Small Cap"
    },
    "4331.SR": {
        "short_name": "AlJazira REIT",
        "long_name": "Aljazira Mawten REIT Fund",
        "summary": "Al - Jazira Mawten REIT Fund is a real estate investment trust managed by Al Jazira Capital Company, Asset Management Arm. The firm invests real estate markets of Saudi Arabia. It invests in income-generating property developments. The firm investments are mainly focused on the Jeddah-based Al-Khumra warehouses, which are wholly owned by AlJazira Mawten real estate income fund. Al - Jazira Mawten REIT Fund is based in Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": null,
        "website": null,
        "market_cap": "Micro Cap"
    },
    "8010.SR": {
        "short_name": "The Company for Coopetative Ins",
        "long_name": "The Company for Cooperative Insurance",
        "summary": "The Company for Cooperative Insurance provides various insurance and reinsurance solutions for individuals and companies in the Kingdom of Saudi Arabia. It operates through Medical, Motor, Property and Casualty, Protection and Saving, and Manafeth segments. The company offers motor, medical, property and casualty, takaful, engineering and contractors, industrial and energy, telecommunications and IT, financial and investment, transportation, retail and trading, fire, marine, aviation, liability, energy, general accidents, home, international travel, medical malpractice, shop owners, and protection and savings insurance products. It also provides third party liability insurance for foreign vehicles. The company was formerly known as National Company for Cooperative Insurance and changed its name to The Company for Cooperative Insurance in 2004. The Company for Cooperative Insurance was founded in 1986 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11632",
        "website": "http://www.tawuniya.com.sa",
        "market_cap": "Mid Cap"
    },
    "8012.SR": {
        "short_name": "Aljazira Takaful Taawuni Co.",
        "long_name": "Aljazira Takaful Taawuni Company",
        "summary": "Aljazira Takaful Taawuni Company provides various insurance products and services in the Kingdom of Saudi Arabia. Its Individual segment offers life insurance products, which include unit linked investment-oriented products on an individual basis. The Company's Group segment provides life protection programs to the members of organizations on a group basis, as well as credit protection benefits in respect of personal loan given by financing organization. This segment also includes protection benefits in respect of various credit facilities other than personal loans extended by the financing organizations to its customers. The company was founded in 2013 is based in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21422",
        "website": "http://www.ajt.com.sa",
        "market_cap": "Micro Cap"
    },
    "8020.SR": {
        "short_name": "Malath Cooperative Insurance Co",
        "long_name": "Malath Cooperative Insurance Company",
        "summary": "Malath Cooperative Insurance Company provides insurance products and related services to individuals and businesses in the Kingdom of Saudi Arabia. The company operates through Medical, Motor, Property & Casualty, and Protection & Savings segments. It offers marine cargo in transit and ships against marine perils insurance products; engineering insurance that provides coverage for loss or damage to construction works or erection and installation of plant and machinery; and health, motor vehicles, fire and burglary, public liability, personal accident, and workmen compensation insurance products. The company was incorporated in 2007 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Property & Casualty",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11625",
        "website": "http://www.malath.com.sa",
        "market_cap": "Small Cap"
    },
    "8030.SR": {
        "short_name": "The Mediterranean and Gulf Insu",
        "long_name": "The Mediterranean and Gulf Cooperative Insurance and Reinsurance Company",
        "summary": "The Mediterranean and Gulf Cooperative Insurance and Reinsurance Company provides insurance and reinsurance products and related activities in the Kingdom of Saudi Arabia. It offers motor third party liability and comprehensive motor insurance products, as well as group health insurance products. The company also provides protection and savings, travel, property, engineering, contractors' all risks, machinery breakdown, stock deterioration, contractors' equipment, erection all risks, electronic device, aviation and air transport, money, comprehensive bank, fidelity, personal accidents, professional and product liability, workers' compensation and employer liability, marine cargo, and marine hull insurance products. The Mediterranean and Gulf Cooperative Insurance and Reinsurance Company was founded in 2007 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11451",
        "website": "http://www.medgulf.com.sa",
        "market_cap": "Small Cap"
    },
    "8040.SR": {
        "short_name": "Allianz Saudi Fransi Cooperativ",
        "long_name": "Allianz Saudi Fransi Cooperative Insurance Company",
        "summary": "Allianz Saudi Fransi Cooperative Insurance Company provides insurance products to corporate and individual customers in the Kingdom of Saudi Arabia. The company offers motor, travel, medical, engineering, employee benefits, credit, fidelity guarantee, and protection and savings insurance, as well as property and casualty insurance, such as fire, burglary, money, construction/erection works, liability, and marine. The company was formerly known as Saudi Fransi Cooperative Insurance Company and changed its name to Allianz Saudi Fransi Cooperative Insurance Company in October 2010. Allianz Saudi Fransi Cooperative Insurance Company was founded in 2007 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11481",
        "website": "http://www.allianzsf.com",
        "market_cap": "Small Cap"
    },
    "8050.SR": {
        "short_name": "Salama Cooperative Insurance Co",
        "long_name": "Salama Cooperative Insurance Company",
        "summary": "Salama Cooperative Insurance Company provides insurance products and services in the United Arab Emirates, the Kingdom of Saudi Arabia, Algeria, Malaysia, Bahrain, Senegal, and Egypt. It operates through three segments: Medical, Motor, and Others. It offers motor insurance products that cover accident, fire, towing, malicious, theft, estimation, and medical expenses; and medical insurance for care, medicines, chronic diseases, vaccination, maternity and neonatal, physiotherapy, ophthalmology, dental care, oncology, and CCHI. The company also provides travel insurance comprising personal accidents, medical expenses, repatriation of mortal remains, lost baggage, passport loss, cash loss, personal liability, and accidental death; and malpractice insurance that provides specialties, flexible, and medical facilities coverage. In addition, it offers general insurance coverage, such as engineering, liability, marine, property, and general accident insurance products. The company was formerly known as Saudi IAIC Cooperative Insurance Company and changed its name to Salama Cooperative Insurance Company in 2012. Salama Cooperative Insurance Company was founded in 1979 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Property & Casualty",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21491",
        "website": "http://www.salama.com.sa",
        "market_cap": "Micro Cap"
    },
    "8060.SR": {
        "short_name": "Walaa Cooperative Insurance Co.",
        "long_name": "Walaa Cooperative Insurance Company",
        "summary": "Walaa Cooperative Insurance Company provides cooperative insurance and reinsurance products and services in the Kingdom of Saudi Arabia. It offers various property insurance products, including property all risk, fire and specified perils property damage, home, and loss of profit/business interruption insurance; and engineering insurance products, such as erection and construction all-risk, and contractor's plant and machinery/equipment insurance, as well as machinery breakdown insurance (MBD), loss of profit following MBD, and deterioration of stock following MBD. The company also provides motor insurance products, which include commercial and private motor comprehensive, and third party liability policies; marine insurance products, including marine cargo and hull insurance policies; medical insurance; and miscellaneous accidents insurance products, such as comprehensive general liability, professional indemnity, medical malpractice, directors and officers liability, privacy and network security cyber liability, fidelity guarantee, money, personal accident, workmen's compensation and employers liability, travel, aviation hull, and public and product liability insurance. The company was formerly known as Saudi United Cooperative Insurance Company and changed its name to Walaa Cooperative Insurance Company in May 2017. Walaa Cooperative Insurance Company was founded in 2007 and is headquartered in Al-Khobar, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Al Khobar",
        "zipcode": "31952",
        "website": "http://www.walaa.com",
        "market_cap": "Small Cap"
    },
    "8070.SR": {
        "short_name": "Arabian Shield Cooperative Insu",
        "long_name": "Arabian Shield Cooperative Insurance Company",
        "summary": "Arabian Shield Cooperative Insurance Company offers various insurance products to companies and individuals in the Kingdom of Saudi Arabia. It offers medical, motor, property, engineering, marine, liability, accident, casualty, protection and saving, travel, and medical malpractice insurance, as well as reinsurance products. The company was founded in 1998 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Property & Casualty",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11565",
        "website": "http://www.der3.com",
        "market_cap": "Micro Cap"
    },
    "8080.SR": {
        "short_name": "SABB Takaful Co.",
        "long_name": "SABB Takaful Company",
        "summary": "SABB Takaful Company provides a range of family and general insurance products to individual and corporate customers primarily in the Kingdom of Saudi Arabia. It operates through three segments: Individual Family Takaful, Group Family Takaful, and General Takaful. The company offers various protection plans, including travel, home, and personal accident takaful products; and wealth management plans consisting of investment, saving, education, and retirement takaful products. It also provides business protection products comprising marine cargo, business interruption or loss of profit, public liability, keyman protection, fire-property all risks, group creditors, SME package, fidelity guarantee, and money takaful plans; and employee benefits products, including group personal accident and care plans. The company was founded in 2006 is based in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11413",
        "website": "http://www.sabbtakaful.com",
        "market_cap": "Small Cap"
    },
    "8100.SR": {
        "short_name": "Saudi Arabian Cooperative Insur",
        "long_name": "Saudi Arabian Cooperative Insurance Company",
        "summary": "Saudi Arabian Cooperative Insurance Company engages in the insurance business in Saudi Arabia. The company provides group medical and life, motor and vehicle, power, aviation, fire, marine, engineering, hull and goods, property, and liability insurance products, as well as protection and savings insurance products. It serves corporates, SMEs, and individuals. The company was founded in 2006 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11594",
        "website": "http://www.saico.com.sa",
        "market_cap": "Micro Cap"
    },
    "8110.SR": {
        "short_name": null,
        "long_name": "Saudi Indian Company for Cooperative Insurance Wafa Insurance",
        "summary": "Saudi Indian Company for Cooperative Insurance Wafa Insurance provides general insurance, health insurance, and protection and savings products in the Kingdom of Saudi Arabia. The company operates through Motor, Health, and Other segments. It offers property, accident, and liability insurance comprising fire, property damage, business interruption, personal accident, fidelity, money, theft and burglary, comprehensive general liability, workmen's compensation, medical malpractice, and medical insurance products; comprehensive and third party motor insurance products; and marine cargo insurance products. The company's products also include engineering insurance, such as machinery breakdown, contractor's all risk, contractor's plant and machinery, erection all risks, and electronics equipment insurance products; medical insurance; individual protection and saving products; and individual and group protection plans, as well as a range of reinsurance products and services. Saudi Indian Company for Cooperative Insurance Wafa Insurance is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11333",
        "website": "http://www.wafainsurance.com",
        "market_cap": "Nano Cap"
    },
    "8120.SR": {
        "short_name": "Gulf Union Alahlia Cooperative ",
        "long_name": "Gulf Union Alahlia Cooperative Insurance Company",
        "summary": "Gulf Union Alahlia Cooperative Insurance Company provides various insurance products and services in the Kingdom of Saudi Arabia. It operates through Medical; Motor; Property and Casualty; and Protections and Savings segments. The company offers out-patient clinic treatment charges, property, marine cargo, third party liability, burglary, and group life and accident insurances; and individual insurances, including auto and health insurances, as well as reinsurance services. Gulf Union Alahlia Cooperative Insurance Company was founded in 1983 and is headquartered in Dammam, Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Dammam",
        "zipcode": null,
        "website": "http://www.gulfunion.com.sa",
        "market_cap": "Micro Cap"
    },
    "8130.SR": {
        "short_name": "Alahli Takaful Co.",
        "long_name": "AlAhli Takaful Company",
        "summary": "AlAhli Takaful Company provides protection and saving insurance products through insurance solutions for individuals and groups in the Kingdom of Saudi Arabia. The company operates in two segments, Insurance-Individual and Insurance-Group Life. The Insurance-Individual segment offers life insurance products on an individual basis, including unit linked investment-oriented products. The Insurance-Group Life segment provides life protection programs to the members of organizations on a group basis; and credit's protection benefits in respect of personal loan given by financing organization. This segment also offers protection benefits in respect of various credit facilities other than personal loans extended by the financing organizations to its customers. The company was incorporated in 2007 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "23423-3791",
        "website": "http://alahlitakaful.com",
        "market_cap": "Micro Cap"
    },
    "8150.SR": {
        "short_name": "Allied Cooperative Insurance Gr",
        "long_name": "Allied Cooperative Insurance Group",
        "summary": "Allied Cooperative Insurance Group engages in cooperative insurance operations and related activities in the Kingdom of Saudi Arabia. The company operates in four segments: Motor Insurance, Medical Insurance, General Accident Insurance, and Others. It provides motor comprehensive and third-party liability, medical, travel, home, shop, and visitor insurance products; general accident insurance products, such as money, fidelity guarantee, business all risk, business travel, and exhibition insurance; and liability insurance products, such as general third-party liability, product liability, workmen's compensation/employer's liability, and professional indemnity. The company also offers engineering insurance products comprising deterioration of stocks, machinery breakdown, electronic equipment, contractor's all risks, erection all risks, and loss of profit following machinery breakdown; and property all risks and fire insurance policies. In addition, it offers medical malpractice, personal accident, and medical and marine insurance products. The company was founded in 2006 and is based in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "11511",
        "website": "http://www.acig.com.sa",
        "market_cap": "Micro Cap"
    },
    "8160.SR": {
        "short_name": "Arabia Insurance Cooperative Co",
        "long_name": "Arabia Insurance Cooperative Company",
        "summary": "Arabia Insurance Cooperative Company provides insurance products and services in the Kingdom of Saudi Arabia. It offers motor, health, property, engineering, medical, general accident, fire, marine, and other insurance products, such as general and aviation, as well as protection and savings insurance. The company was founded in 2007 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Property & Casualty",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": null,
        "website": "http://www.aicc.com.sa",
        "market_cap": "Micro Cap"
    },
    "8170.SR": {
        "short_name": "Al-Etihad Cooperative Insurance",
        "long_name": "Al-Etihad Cooperative Insurance Company",
        "summary": "Al-Etihad Cooperative Insurance Company provides insurance services in the Kingdom of Saudi Arabia. It offers property, motor, marine and marine cargo, medical and health, general accident and liability, casualty, and engineering and construction insurance. The company was founded in 1983 and is headquartered in Dhahran, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Dhahran",
        "zipcode": "34232-4233",
        "website": "http://www.tuci-sa.com",
        "market_cap": "Micro Cap"
    },
    "8180.SR": {
        "short_name": "Al Sagr Cooperative Insurance C",
        "long_name": "Al Sagr Cooperative Insurance Company",
        "summary": "Al Sagr Cooperative Insurance Company provides insurance products and solutions in the Kingdom of Saudi Arabia and Singapore. The company operates through Medical, Motor, Property and Casualty, and Protection and Savings segments. It offers fire and allied perils, property all risks, and business interruption insurance products; marine cargo and hull insurance products; and engineering insurance products comprising contractor's all risks and erection all risks, contractors' plant and machinery, machinery breakdown, loss of profit due to machinery breakdown, boiler and pressure vessels, deterioration of stock, and electronics equipment insurance. The company also provides liability insurance products, such as workmen's compensation, employer liability, public liability, and professional indemnity insurance; onshore and offshore energy insurance products; and medical, travel, motor, and medical malpractice insurance products. In addition, it offers miscellaneous insurance products, including personal accident, money, fidelity guarantee, and burglary insurance. The company was founded in 1983 and is based in Dammam, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Dammam",
        "zipcode": null,
        "website": "http://www.alsagr.com",
        "market_cap": "Micro Cap"
    },
    "8200.SR": {
        "short_name": "Saudi Re for Cooperative Reinsu",
        "long_name": "Saudi Re for Cooperative Reinsurance Company",
        "summary": "Saudi Re for Cooperative Reinsurance Company provides various reinsurance products in the Kingdom of Saudi Arabia, rest of the Middle East, Africa, Asia, and internationally. The company underwrites engineering, property, marine, casualty, motor, retro, life, medical, fire, general accident, term and credit life, aviation, energy, agriculture, and political risk reinsurance products; and various reinsurance products for Takaful industry. Saudi Re for Cooperative Reinsurance Company was incorporated in 2008 and is based in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Reinsurance",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "13313-6684",
        "website": "http://www.saudire.net",
        "market_cap": "Small Cap"
    },
    "8210.SR": {
        "short_name": "Bupa Arabia for Cooperative Ins",
        "long_name": "Bupa Arabia for Cooperative Insurance Company",
        "summary": "Bupa Arabia for Cooperative Insurance Company underwrites medical insurance products for businesses and families in the Kingdom of Saudi Arabia. It issues short-term insurance contracts for providing health care services. The company was founded in 1997 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Specialty",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21436",
        "website": "http://www.bupa.com.sa",
        "market_cap": "Mid Cap"
    },
    "8230.SR": {
        "short_name": "Al-Rajhi Company for Cooperativ",
        "long_name": "Al Rajhi Company for Cooperative Insurance",
        "summary": "Al Rajhi Company for Cooperative Insurance provides various insurance products and services to individuals, SMEs,  and corporates in the Kingdom of Saudi Arabia. The company operates in four segments: General, Motor, Health, and Protection and Savings. It offers motor, unified health, domestic helper, travel, medical malpractice, visitor visa, personal accident, and home owners, as well as general insurance products, such as property all risks, workers injury compensation and employer's liability, fidelity guarantee, and public business liability. The company also provides liability, contractors risk, marine cargo, plant machinery, machinery breakdown, and erection all risk insurance products; and protection and savings products, such as education, marriage, retirement, and investment insurance policies. It is also involved in the re-insurance and agency activities. The company was founded in 2008 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11517",
        "website": "http://www.alrajhitakaful.com",
        "market_cap": "Small Cap"
    },
    "8240.SR": {
        "short_name": "CHUBB Arabia Cooperative Insura",
        "long_name": "Chubb Arabia Cooperative Insurance Company",
        "summary": "Chubb Arabia Cooperative Insurance Company operates as a multiline property and casualty insurer in the Kingdom of Saudi Arabia. The company offers property and casualty insurance products comprising property all risks, fire and allied perils, business interruption, householders', terrorism and sabotage, burglary and housebreaking, general liability, workmen's compensation and employer's liability, motor, plate glass, money, crime, fidelity guarantee/employee dishonesty, and travel insurance products. It also provides engineering insurance products comprising contractors all risk, erection all risks, machinery breakdown, business interruption due to machinery breakdown, and computer/electronic data processing, as well as machinery, plant, and equipment all risks insurance products. In addition, the company offers marine cargo, project cargo and DSU, inland transit, and marine hull insurance products; group life and group personal accident insurance products; and financial insurance products, such as bankers blanket bond, financial institutions professional indemnity, civil liability for financial institutions, electronic and computer crime, fraud protector, financial services industry insurance policy, and directors and officers liability insurance. It serves multinational corporations and local businesses, companies, and affinity groups. Chubb Arabia Cooperative Insurance Company was founded in 1974 and is headquartered in Al Khobar, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Al Khobar",
        "zipcode": "31952",
        "website": "http://www.chubb.com/sa-en",
        "market_cap": "Micro Cap"
    },
    "8250.SR": {
        "short_name": "AXA Cooperative Insurance Co.",
        "long_name": "AXA Cooperative Insurance Company",
        "summary": "AXA Cooperative Insurance Company provides various insurance and reinsurance products for individuals, SME, and business in Saudi Arabia. The company offers car, travel, home, personal accident, and SME fleet and health care insurance; and business insurance, including motor fleet, healthcare, business travel shield, marine, and group personal accident insurance, as well as visa extension services. It also provides money, business all risk, life, general third-party liability, product liability, workmen's compensation/employer's liability, contractors all risk, erection all risk, machinery and electronic equipment failure, death, and disability insurance. The company was founded in 2008 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11421",
        "website": "http://www.axa-cooperative.com",
        "market_cap": "Small Cap"
    },
    "8270.SR": {
        "short_name": "Buruj Cooperative Insurance Co.",
        "long_name": "Buruj Cooperative Insurance Company",
        "summary": "Buruj Cooperative Insurance Company provides various general insurance products to individuals and business entities in the Kingdom of Saudi Arabia. The company operates through five segments: Motor Insurance, Medical Products, Property, Marine Products, and Others. The company was incorporated in 2009 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11553",
        "website": "http://www.burujinsurance.com",
        "market_cap": "Micro Cap"
    },
    "8280.SR": {
        "short_name": "Al Alamiya for Cooperative Insu",
        "long_name": "Al Alamiya for Cooperative Insurance Company",
        "summary": "Al Alamiya for Cooperative Insurance Company engages in the insurance and reinsurance businesses primarily in the Kingdom of Saudi Arabia. The company operates in six segments: Property, Motor, Engineering, Medical, Marine, Group Life, and Others. It offers car, travel, home, and personal accident insurance products; and small and medium business, motor fleet, property, marine, engineering, life, workmen's compensation, liability, and general accident insurance products. The company was founded in 2009 and is headquartered in Riyadh, the Kingdom of Saudi Arabia. Al Alamiya for Cooperative Insurance Company is a subsidiary of Royal and Sun Alliance Insurance (Middle East) BSC(c).",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11442",
        "website": "http://www.alalamiya.sa",
        "market_cap": "Small Cap"
    },
    "8300.SR": {
        "short_name": "Wataniya Insurance Co.",
        "long_name": "Wataniya Insurance Company",
        "summary": "Wataniya Insurance Company provides a range of insurance products and services in the Kingdom of Saudi Arabia. It operates through Marine, Property, Motor, Engineering, Accident & Liability, Extended Warranty, and Term Life segments. It offers various insurance products, such as motor insurance; general accident and casualty insurance products, including fidelity guarantee, money, personal accident, public liability, work injury, medical malpractice, burglary, glass breakage, business all risk, business travel, and exhibition insurance products; and liability insurance includes general third-party liability, product liability, workmen's compensation/employer's liability, and professional indemnity. The company also provides marine cargo insurance products, which include land transit, marine cargo, and marine hull insurance; employee benefits insurance; and engineering insurance products comprising contractor all risk, construction, mechanical, electrical, contractors' plant and machinery, electronic equipment, erection all risk, machinery breakdown, and deterioration of stock insurance. In addition, it offers property insurance products comprising property all risk, fire and lightning, household comprehensive, and terrorism risk insurance; extended warranty coverage against damages to motor vehicles; and term life coverage against the insured's death. The was founded in 1975 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21432",
        "website": "http://www.wataniya.com.sa",
        "market_cap": "Micro Cap"
    },
    "8310.SR": {
        "short_name": "Amana Cooperative Insurance Co.",
        "long_name": "Amana Cooperative Insurance Company",
        "summary": "Amana Cooperative Insurance Company provides various insurance products and services to corporate and individual clients in the Kingdom of Saudi Arabia. The company offers engineering, fidelity, general, healthcare, marine cargo, money, motor, personal, property, travel, and workmen insurance products, as well as other specialized insurance solutions. Amana Cooperative Insurance Company was founded in 2010 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11427",
        "website": "http://www.amana.sa",
        "market_cap": "Micro Cap"
    },
    "8311.SR": {
        "short_name": "Saudi Enaya Cooperative Insuran",
        "long_name": "Saudi Enaya Cooperative Insurance Company",
        "summary": "Saudi Enaya Cooperative Insurance Company provides health insurance services in the Kingdom of Saudi Arabia. It primarily underwrites medical insurance products for group and individual clients. The company was incorporated in 2012 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Reinsurance",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "23435",
        "website": "http://www.saudienaya.com",
        "market_cap": "Micro Cap"
    },
    "8312.SR": {
        "short_name": "Alinma Tokio Marine Co.",
        "long_name": "Alinma Tokio Marine Company",
        "summary": "Alinma Tokio Marine Company provides various insurance products and services to individuals and corporates in the Kingdom of Saudi Arabia. It operates through Property and Casualty, Motor, Protection and Savings, and Medical segments. The company offers insurance products in the areas of protection and savings programs; motor; and fidelity guarantee, commercial general liability, trade credit, personal accident, money, bankers blanket bond, hauliers and public liability, and workers compensation. It also provides business interruption, fire and special perils, home package, and property all risk insurance products; health insurance products; marine cargo and cargo voyage risks insurance products; and boiler and pressure vessel, contractor's all risk, contractors' plant and machinery insurance, deterioration of stock in cold storage, electronic equipment, erection all risks, loss of profits following machinery breakdown, and machinery insurance. The company was founded in 2012 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11421",
        "website": "http://www.atmc.com.sa",
        "market_cap": "Small Cap"
    }
}