{
    "8020.SR": {
        "short_name": "Malath Cooperative Insurance Co",
        "long_name": "Malath Cooperative Insurance Company",
        "summary": "Malath Cooperative Insurance Company provides insurance products and related services to individuals and businesses in the Kingdom of Saudi Arabia. The company operates through Property, Engineering, Motor, Medical, and Others segments. It offers fire and property insurance; engineering insurance that provides coverage for builders' risks, construction, mechanical, electrical, electronic, and machinery breakdown; marine hull and cargo; travel and medical malpractice; and motor, health, and miscellaneous accident insurance products. The company also provides risk management, insurance consultation, and reinsurance services. Malath Cooperative Insurance Company was founded in 2007 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance—Property & Casualty",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "8050.SR": {
        "short_name": "Salama Cooperative Insurance Co",
        "long_name": "Salama Cooperative Insurance Company",
        "summary": "Salama Cooperative Insurance Company provides insurance products and services in the United Arab Emirates, the Kingdom of Saudi Arabia, Algeria, Malaysia, Bahrain, Senegal, and Egypt. It operates through three segments: Medical, Motor, and Others. It offers motor insurance products that cover accident, fire, towing, malicious, theft, estimation, and medical expenses; and medical insurance for care, medicines, chronic diseases, vaccination, maternity and neonatal, physiotherapy, ophthalmology, dental care, oncology, and CCHI. The company also provides travel insurance comprising personal accidents, medical expenses, repatriation of mortal remains, lost baggage, passport loss, cash loss, personal liability, and accidental death; and malpractice insurance that provides specialties, flexible, and medical facilities coverage. In addition, it offers general insurance coverage, such as engineering, liability, marine, property, and general accident insurance products. The company was formerly known as Saudi IAIC Cooperative Insurance Company and changed its name to Salama Cooperative Insurance Company in 2012. Salama Cooperative Insurance Company was founded in 1979 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance—Property & Casualty",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Jeddah"
    }
}