{
  "AFML": {
    "city": "Mississauga",
    "country": "Canada",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Aluminum",
    "long_name": "Aerofoam Metals Inc.",
    "market": "us_market",
    "market_cap": null,
    "sector": "Basic Materials",
    "short_name": "AEROFOAM METALS INC",
    "state": "ON",
    "summary": "Aerofoam Metals Inc. manufactures foamed aluminum products for applications in automotive, defense, and aerospace industries under the brand Aerometal. The company was incorporated in 2004 and is based in Mississauga, Canada.",
    "website": null,
    "zipcode": "L5L 5Z9"
  },
  "EORBF": {
    "city": "Laval",
    "country": "Canada",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Aluminum",
    "long_name": "Orbite Technologies Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "ORBITE TECHNOLOGIES INC",
    "state": "QC",
    "summary": "Orbite Technologies Inc. operates as a clean technology based mineral-processing and resource development company in Canada. It produces high-purity alumina, silica, hematite, magnesium oxide, titanium oxide, smelter-grade alumina, and rare earth and rare metal oxides from various feedstocks, including red mud, fly-ash, aluminous clays, mine tailings, bauxite, and kaolin clay, as well as serpentine residues from chrysotile processing sites. The company owns 100% interest in 99 mineral claims totaling approximately 55 square kilometers, as well as 1 mining lease of 98.5 hectares at a site near Grande-Vallée, Québec. It also owns 100% interest in 138 mineral claims covering approximately 78.4 square kilometers at sites near Rimouski and Cap-Chat, Québec. The company was formerly known as Orbite Aluminae Inc. and changed its name to Orbite Technologies Inc. in June 2015. Orbite Technologies Inc. was incorporated in 1983 and is headquartered in Laval, Canada.",
    "website": "http://www.orbitetech.com",
    "zipcode": "H7V 5B7"
  }
}
