{"1AH.F": {"short_name": "ABRAPLATA RES.CORP.  O.N.", "long_name": "AbraPlata Resource Corp.", "summary": "AbraPlata Resource Corp., a mineral exploration and development company, engages in the acquisition, exploration, and development of mineral resource properties in Argentina and Chile. The company primarily explores for copper, gold, and silver ores. It holds interests in the Diablillos property that covers an area of approximately 79 square kilometers located in the Salta province of northwestern Argentina; and the Aguas Perdidas property in Salta and Chubut Provinces, Argentina. The company also holds interests in the Arcas project located in the Antofagasta region of Chile; and an option agreement to acquire a 100% interest in the La Coipita project located in San Juan province, Argentina. AbraPlata Resource Corp. was incorporated in 1993 and is headquartered in Toronto, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "1QB1.F": {"short_name": "IDAHO CHAMP.GOLD MINES", "long_name": "Idaho Champion Gold Mines Canada Inc.", "summary": "Idaho Champion Gold Mines Canada Inc. engages in the acquisition, exploration, development, and extraction of precious metals in the United States. It primarily explores for gold and silver deposits. The company's project portfolio includes the Baner Project in Idaho County; the Champagne Project located in Butte County near Arco; and four cobalt properties in Lemhi County in the Idaho Cobalt Belt. The company is based in Toronto, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "1XC.SG": {"short_name": "ARCHON MINERALS LTD. Registered", "long_name": "Archon Minerals Limited", "summary": "Archon Minerals Limited explores for diamonds in Canada. It has interests in the Buffer Zone, WO Block, and Monument Diamond projects located in the Mackenzie Mining Division in the Northwest Territories. The company is based in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "STU", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "1XD.F": {"short_name": "MEDGOLD RESOURCES CORP.", "long_name": "Medgold Resources Corp.", "summary": "Medgold Resources Corp., an exploration stage company, engages in the acquisition and exploration of precious and base metal properties in Europe. It explores for gold, silver, lead, and zinc deposits. The company holds 100% interest in the Tlamino project comprising two contiguous licenses, such as Donje Tlamino and Surlica-Dukat covering an area of 192 square kilometers located in the far southeast of Serbia. It also holds interests in the Ljubata project, which consists of Ljubata and Radovnica licenses located adjacent to the borders of North Macedonia and Bulgaria. The company is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "1XD.SG": {"short_name": "Medgold Resources Corp. Registe", "long_name": "Medgold Resources Corp.", "summary": "Medgold Resources Corp., an exploration stage company, engages in the acquisition and exploration of precious and base metal properties in Europe. It explores for gold, silver, lead, and zinc deposits. The company holds 100% interest in the Tlamino project comprising two contiguous licenses, such as Donje Tlamino and Surlica-Dukat covering an area of 192 square kilometers located in the far southeast of Serbia. It also holds interests in the Ljubata project, which consists of Ljubata and Radovnica licenses located adjacent to the borders of North Macedonia and Bulgaria. The company is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "STU", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "1ZX.F": {"short_name": "CHAKANA COPPER CORP.", "long_name": "Chakana Copper Corp.", "summary": "Chakana Copper Corp. engages in the acquisition, exploration, and development of mineral properties. It holds an option to acquire a 100% interest in the Soledad project, a copper, gold, and silver project located in Central Peru. The company is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "20Q.F": {"short_name": "AURANIA RES CAD R.S.", "long_name": "Aurania Resources Ltd.", "summary": "Aurania Resources Ltd., a junior exploration mining company, engages in the identification, evaluation, acquisition, and exploration of mineral properties in Ecuador and Peru. The company explores for gold, silver, copper, and other precious metal deposits. Its flagship asset is the Lost Cities Â\u0096 Cutucu Project, which is located in the Jurassic Metallogenic Belt in the eastern foothills of the Andes mountain range of southeastern Ecuador. The company was formerly known as Urania Resources Ltd. and changed its name to Aurania Resources Ltd. in March 2012. Aurania Resources Ltd. was incorporated in 2007 and is based in Toronto, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "28U0.F": {"short_name": "LITHOQUEST RESOURCES INC.", "long_name": "Lithoquest Resources Inc.", "summary": "Lithoquest Resources Inc. engages in the acquisition, exploration, and development of mining properties. It holds a 100% interest in the North Kimberley diamond project located in the King George River region of Western Australia. The company was formerly known as Lithoquest Diamonds Inc. and changed its name to Lithoquest Resources Inc. in November 2020. Lithoquest Resources Inc. is headquartered in Salt Spring Island, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Salt Spring Island"}, "2CI.F": {"short_name": "CARTIER IRON CORP.", "long_name": "Cartier Iron Corporation", "summary": "Cartier Iron Corporation, an exploration stage company, engages in the acquisition, exploration, and development of iron ore properties in Canada. The company holds a 100% interest in the Big Easy property that consists of 507 mining claims covering an area of 126.8 square kilometers located in Newfoundland and Labrador. It also owns a 55% interest in the Round Lake and Jeannine Lake properties consisting of 141 claims covering an area of approximately 74.68 square kilometers located in the Fermont iron ore district in the Labrador Trough in northeastern Quebec. The company was formerly known as Northfield Metals Inc. and changed its name to Cartier Iron Corporation in January 2013. Cartier Iron Corporation was incorporated in 1985 and is headquartered in Toronto, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "35E.F": {"short_name": "EASTFIELD RESOURCES LTD", "long_name": "Eastfield Resources Ltd.", "summary": "Eastfield Resources Ltd., an exploration stage company, engages in the acquisition and exploration of mineral properties in Canada. It primarily explores for gold, copper, nickel, silver, molybdenum, cobalt, and platinum group metals. The company holds 100% interest in the Zymo, Iron Lake, Hidden One, and Big Valley properties; and 91.3% interest in the Indata property comprising 18 claims encompassing 3,189 hectares located in British Columbia. Eastfield Resources Ltd. was founded in 1987 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "3PG.F": {"short_name": "PROVENAN. GOLD CORP.", "long_name": "Provenance Gold Corp.", "summary": "Provenance Gold Corp., a junior exploration company, engages in the identification, acquisition, and exploration of mineral interests in the United States. The company explores for gold and silver. It holds an option to acquire a 100% interest in the Silver Bow property with 73 mineral claims and 10 claims in Golden Ridge Property located in Nevada; and an option to acquire a 100% interest in the White Rock Gold project consisting of 164 claims located in Nevada. The company was formerly known as Sparx Energy Corp. and changed its name to Provenance Gold Corp. in January 2017. Provenance Gold Corp. was incorporated in 2012 and is based in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "3RI.F": {"short_name": "TURMALINA METALS", "long_name": "Turmalina Metals Corp.", "summary": "Turmalina Metals is a TSXV-listed exploration company focused on developing our portfolio of high grade gold-copper-silver-molybdenum projects in South America. Our focus is on tourmaline breccias, a deposit style overlooked by many explorers. Turmalina Metals is led by a team responsible for multiple gold-copper molybdenum discoveries who are highly experienced in this deposit style. Our projects are characterized by open high-grade mineralization on established mining licenses that present compelling drill targets. The principle project held by Turmalina is the San Francisco project in San Juan, Argentina. For further information on the San Francisco Project, refer to the technical report entitled \"NI43-101 Technical Report San Francisco Copper Gold Project, San Juan Province, Argentina\" dated November 17, 2019 under the Corporation's profile at www.sedar.com.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "4VX.F": {"short_name": "ORIGEN RESOURCES INC.", "long_name": "Origen Resources Inc.", "summary": "Origen Resources Inc., an exploration stage company, engages in the acquisition, exploration, and evaluation of base and precious metal properties in Canada. It holds a property portfolio of four 100% owned precious and base metal projects in southern British Columbia; and a 100% interest in the LGM project that covers an area of 26,771 hectares. The company also holds an option to acquire a 100% interest in the Wishbone property that covers an area of 3,971 hectare located in the Golden Triangle of British Columbia; and an option to acquire a 100% interest in the 7,875 ha Middle Ridge Property located in Newfoundland. Origen Resources Inc. was founded in 2019 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "52IB.F": {"short_name": "REVELO RES CORP.", "long_name": "Revelo Resources Corp.", "summary": "Revelo Resources Corp. acquires and explores for precious and base metals in Chile. The company primarily explores for copper, gold, and silver deposits. It holds 100% interests in the Loro project, which covers an area of 4,800 hectares; Las Pampas project that covers an area of 21,800 hectares; Victoria Sur project covering an area of 6,600 hectares; Orca project covering an area of 5,400 hectares; Montezuma project, which covers an area of 16,300 hectares; Calvario project covering an area of 6,900 hectares; and Mirador project covering an area of 7,700 hectares located in Northern Chile. The company was formerly known as Iron Creek Capital Corp. and changed its name to Revelo Resources Corp. in December 2014. Revelo Resources Corp. was founded in 2003 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "5DD1.F": {"short_name": "KODIAK COPPER CORP.", "long_name": "Kodiak Copper Corp.", "summary": "Kodiak Copper Corp. primarily engages in the copper porphyry projects exploration business in Canada and the United States. Its principal project is the MPD copper-gold porphyry project that covers an area of approximately 9,733 hectares in southern British Columbia. The company also holds a 100% interest in the Mohave copper-molybdenum-silver porphyry project covering an area of approximately 10.4 square kilometers in Mohave County, Arizona, the United States; and a 100% interest in the Trapper copper-gold porphyry project covering approximately 37.5 square kilometers in the northern Golden Triangle region of British Columbia. In addition, it holds a 100% interest in the Kahuna diamond project located in Nunavut, Canada. The company was formerly known as Dunnedin Ventures Inc. and changed its name to Kodiak Copper Corp. in April 2020. Kodiak Copper Corp. was incorporated in 1987 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "5XL.F": {"short_name": "SABLE RESOURCES LTD", "long_name": "Sable Resources Ltd.", "summary": "Sable Resources Ltd. engages in the acquisition, exploration and development of mineral resource properties in Mexico, Argentina, and Peru. The company is involved in the exploration of the San Juan Regional program that includes Don Julio project covering an area of 58,000 hectares (ha) in San Juan Province, Argentina; and the Mexico Regional program, which includes the Margarita, Vinata and El Escarpe projects covering an area of 39,000 ha titled in Mexico. It also holds interest in the Scorpius project located in Peru; and option to acquire 100% interest in the Kirio project covering 2,900 ha located in Peru. The company was formerly known as Calico Silver Mines Ltd. and changed its name to Sable Resources Ltd. in 1978. Sable Resources Ltd. was incorporated in 1962 and is based in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "68B.F": {"short_name": "BATERO GOLD CORP.", "long_name": "Batero Gold Corp.", "summary": "Batero Gold Corp., together with its subsidiaries, engages in the exploration and development of mineral properties in Colombia. The company primarily explores for gold, copper, and silver deposits. It owns a 100% interest in the Batero-Quinchia project, which consists of 1,407-hectare tenement and two applications for a concession contract of 169 hectares situated in the municipality of Quinchia, Department of Risaralda, Colombia. The company was formerly known as Angus Resources Inc. and changed its name to Batero Gold Corp. in July 2010. Batero Gold Corp. was incorporated in 2008 and is headquartered in Toronto, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "7781.F": {"short_name": "MAVERIX METALS", "long_name": "Maverix Metals Inc.", "summary": "Maverix Metals Inc., a precious metals royalty and streaming company, engages in the exploration and development of mineral properties. The company explores for gold, silver, lead, zinc, and other metals. As of December 31, 2019, it owned approximately 100 royalties, streams, and other interests in North America, South America, Australia, and internationally. The company was formerly known as MacMillan Minerals Inc. Maverix Metals Inc. was founded in 2016 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "7NQ.F": {"short_name": "FABLED SILVER GOLD CORP", "long_name": "Fabled Silver Gold Corp.", "summary": "Fabled Silver Gold Corp. focuses on acquiring, exploring, and operating metal properties. It has an option agreement to acquire the Santa Maria Project, a silver-gold property located in the centre of the Mexican epithermal silver-gold belt. The company was formerly known as Fabled Copper Corp. and changed its name to Fabled Silver Gold Corp. in October 2020. Fabled Silver Gold Corp. is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "7VM.F": {"short_name": "VISCOUNT MINING CORP O.N.", "long_name": "Viscount Mining Corp.", "summary": "Viscount Mining Corp. explores for and evaluates mineral properties in the United States. It explores for gold, silver, precious, and base metals. The company's flagship property is the Silver Cliff project that consists of 96 lode claims located in Colorado. It also holds a 100% interest in the Cherry Creek project comprising 9,000 acres situated in White Pine County, Nevada. The company was incorporated in 2011 and is headquartered in North Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "North Vancouver"}, "8BX1.SG": {"short_name": "Brixton Metals Corp. Registered", "long_name": "Brixton Metals Corporation", "summary": "Brixton Metals Corporation, an exploration stage company, engages in the acquisition, exploration, development, and evaluation of mineral properties in Canada and the United States. The company primarily explores for gold, silver, copper, and cobalt deposits. It holds a 100% interest in the Thorn gold-copper-silver project located in Northwest British Columbia; the Hog Heaven Silver-Gold-Copper Project located in Northwest Montana; Langis-Hudson Bay Silver-Cobalt Project located in Northeast Ontario; and Atlin Goldfields Project in Northwest British Columbia. The company also holds a purchase agreement to acquire a 100% interest in the Trapper project covering an area of 3,756 hectares. Brixton Metals Corporation was incorporated in 2009 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "STU", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "8RR.F": {"short_name": "ROCKHAVEN RESOURCES LTD", "long_name": "Rockhaven Resources Ltd.", "summary": "Rockhaven Resources Ltd., an exploration stage company, engages in the acquisition, exploration, and evaluation of mineral properties in Canada. The company primarily explores for precious and base metal deposits. It holds a 100% interest in the Klaza gold-silver property, which consists of 1,478 mineral claims covering an area of 287 square kilometers located in the Whitehorse mining district, Yukon Territory. The company was incorporated in 2005 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "A0H.F": {"short_name": "AUXICO RESOURCES CANADA", "long_name": "Auxico Resources Canada Inc.", "summary": "Auxico Resources Canada Inc., together with its subsidiaries, engages in the acquisition, exploration, and development of mineral properties in Canada, Mexico, and Columbia. The company holds a 100% interest in the Zamora silver-gold property comprising five individual lots, including Zamora, Campanillas, San Felipe, Chio, and Gaby covering a total area of 3,376.6265 hectares located to the southeast of the city of Culiacan in the state of Sinaloa, Mexico. It also holds an option to acquire the La Franca silver-gold mine covering 12 hectares located in the state of Sinaloa, Mexico. The company was founded in 2014 and is headquartered in Montreal, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Montreal"}, "ABBRF": {"short_name": "ABRAPLATA RESOURCE CORP", "long_name": "AbraPlata Resource Corp.", "summary": "AbraPlata Resource Corp., a mineral exploration and development company, engages in the acquisition, exploration, and development of mineral resource properties in Argentina and Chile. The company primarily explores for copper, gold, and silver ores. It holds interests in the Diablillos property that covers an area of approximately 79 square kilometers located in the Salta province of northwestern Argentina; and the Aguas Perdidas property in Salta and Chubut Provinces, Argentina. The company also holds interests in the Arcas project located in the Antofagasta region of Chile; and an option agreement to acquire a 100% interest in the La Coipita project located in San Juan province, Argentina. AbraPlata Resource Corp. was incorporated in 1993 and is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "ABRA.V": {"short_name": "ABRAPLATA RESOURCE CORP", "long_name": "AbraPlata Resource Corp.", "summary": "AbraPlata Resource Corp., a mineral exploration and development company, engages in the acquisition, exploration, and development of mineral resource properties in Argentina and Chile. The company primarily explores for copper, gold, and silver ores. It holds interests in the Diablillos property that covers an area of approximately 79 square kilometers located in the Salta province of northwestern Argentina; and the Aguas Perdidas property in Salta and Chubut Provinces, Argentina. The company also holds interests in the Arcas project located in the Antofagasta region of Chile; and an option agreement to acquire a 100% interest in the La Coipita project located in San Juan province, Argentina. AbraPlata Resource Corp. was incorporated in 1993 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "ACKRF": {"short_name": "AMERICAN CREEK RESOURCE", "long_name": "American Creek Resources Ltd.", "summary": "American Creek Resources Ltd., a precious metals exploration company, engages in the acquisition, exploration, and development of mineral properties located in various regions of British Columbia in Canada. The company explores for gold, silver, zinc, lead, and copper deposits. It holds a 100% interest in the Gold Hill Project covering an area of approximately 836 hectares; 100% interest in the D-1 McBride Property; and 20% interest in the Treaty Creek Project covering an area of approximately 114 square kilometers located in British Columbia. The company also holds interest in the Dunwell Property covering an area of 1,560 hectares; Ample Goldmax Property covering an area of 1,044 hectares; and the Austruck-Bonanza, Glitter King, and Silver Side properties located in British Columbia. American Creek Resources Ltd. was founded in 2004 and is headquartered in Cardston, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Cardston"}, "ACS.V": {"short_name": "ARCHON MINERALS LIMITED", "long_name": "Archon Minerals Limited", "summary": "Archon Minerals Limited explores for diamonds in Canada. It has interests in the Buffer Zone, WO Block, and Monument Diamond projects located in the Mackenzie Mining Division in the Northwest Territories. The company is based in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "ADD.V": {"short_name": "ARCTIC STAR EXPLORATION CORP", "long_name": "Arctic Star Exploration Corp.", "summary": "Arctic Star Exploration Corp., a junior natural resource company, acquires, explores for, and develops mineral properties in Canada and Finland. The company primarily explores for diamond and niobium/rare earth deposits. Its flagship project is the Timantti diamond project covering an area of 243 hectares exploration permit and 193,700 hectares exploration reservation located in Finland. The company was formerly known as Arctic Star Diamond Corp. and changed its name to Arctic Star Exploration Corp. in July 2011. Arctic Star Exploration Corp. was incorporated in 2001 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "ADZ.V": {"short_name": "ADAMERA MINERALS CORP", "long_name": "Adamera Minerals Corp.", "summary": "Adamera Minerals Corp., an exploration stage company, acquires and explores for precious metals. It primarily explores for silver, gold, copper, lead, and zinc deposits. The company owns interests in the Cooke Mountain, Empire Creek, Flag Hill, and Talisman properties located in Washington, the United States. Adamera Minerals Corp. is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "AHNMF": {"short_name": "ARCHON MINERALS", "long_name": "Archon Minerals Limited", "summary": "Archon Minerals Limited explores for diamonds in Canada. It has interests in the Buffer Zone, WO Block, and Monument Diamond projects located in the Mackenzie Mining Division in the Northwest Territories. The company is based in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "AMK.V": {"short_name": "AMERICAN CREEK RESOURCES LTD.", "long_name": "American Creek Resources Ltd.", "summary": "American Creek Resources Ltd., a precious metals exploration company, engages in the acquisition, exploration, and development of mineral properties located in various regions of British Columbia in Canada. The company explores for gold, silver, zinc, lead, and copper deposits. It holds a 100% interest in the Gold Hill Project covering an area of approximately 836 hectares; 100% interest in the D-1 McBride Property; and 20% interest in the Treaty Creek Project covering an area of approximately 114 square kilometers located in British Columbia. The company also holds interest in the Dunwell Property covering an area of 1,560 hectares; Ample Goldmax Property covering an area of 1,044 hectares; and the Austruck-Bonanza, Glitter King, and Silver Side properties located in British Columbia. American Creek Resources Ltd. was founded in 2004 and is headquartered in Cardston, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Cardston"}, "AMZ.V": {"short_name": "AZUCAR MINERALS LTD", "long_name": "Azucar Minerals Ltd.", "summary": "Azucar Minerals Ltd. acquires, explores for, and evaluates mineral properties in Canada, the United States, and Mexico. It explores for gold, silver, and copper deposits. The company owns a 100% interest in the El Cobre property covering an area of 7,300 hectares located in Mexico. It also has an option to acquire 100% interest in the Los Venados project in Sonora State Mexico. The company was formerly known as Almadex Minerals Limited and changed its name to Azucar Minerals Ltd. in May 2018. Azucar Minerals Ltd. was incorporated in 2015 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "ANGCF": {"short_name": "ANGEL GOLD CORP", "long_name": "Angel Gold Corp.", "summary": "Angel Gold Corp. engages in the identification, acquisition, and exploration of mineral properties in Colombia. It explores for gold and silver deposits. The company also holds an option to acquire 100% interest in the El Porvenir gold property covering 59.5 square kilometer located in Segovia-Remedios gold belt, Colombia. It also holds interests in El Pino West and Heliconia properties in Colombia. The company was formerly known as Caerus Resource Corporation and changed its name to Angel Gold Corp. in October 2012. Angel Gold Corp. was incorporated in 1988 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "ANZ.V": {"short_name": "ALIANZA MINERALS LTD", "long_name": "Alianza Minerals Ltd.", "summary": "Alianza Minerals Ltd., an exploration stage company, acquires and explores mineral properties. The company explores for gold, copper, silver, zinc, molybdenum, and lead deposits. It holds interests in the properties located in Nevada, the United States; Yukon and British Columbia, Canada; and Peru. The company was formerly known as Tarsis Resources Ltd. and changed its name to Alianza Minerals Ltd. in April 2015. Alianza Minerals Ltd. was incorporated in 2005 and is based in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "APGO.V": {"short_name": "APOLLO GOLD AND SILVER CORP", "long_name": "Apollo Gold & Silver Corp.", "summary": "Apollo Gold & Silver Corp., an exploration company, engages in the investigation, acquisition, exploration, and development of mineral resource deposits in Canada. It has an option to acquire 90% interest in two prospective gold-silver properties located in the El Indio Gold Belt of central Chile. Its Apolo property consists of 1 exploration and 12 exploitation concessions totaling 2,730 hectares; and SancarrÃ³n property consists of 4 exploration and 6 exploitation concessions totaling 2,700 hectares. The company was formerly known as Apollo Gold Corp. and changed its name to Apollo Gold & Silver Corp. in January 2021. Apollo Gold & Silver Corp. was founded in 1999 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "APGOF": {"short_name": "APOLLO GOLD & SILVER CORP", "long_name": "Apollo Gold & Silver Corp.", "summary": "Apollo Gold & Silver Corp., an exploration company, engages in the investigation, acquisition, exploration, and development of mineral resource deposits in Canada. It has an option to acquire 90% interest in two prospective gold-silver properties located in the El Indio Gold Belt of central Chile. Its Apolo property consists of 1 exploration and 12 exploitation concessions totaling 2,730 hectares; and SancarrÃ³n property consists of 4 exploration and 6 exploitation concessions totaling 2,700 hectares. The company was formerly known as Apollo Gold Corp. and changed its name to Apollo Gold & Silver Corp. in January 2021. Apollo Gold & Silver Corp. was founded in 1999 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "AQM.F": {"short_name": "ADAMERA MINLS", "long_name": "Adamera Minerals Corp.", "summary": "Adamera Minerals Corp., an exploration stage company, acquires and explores for precious metals. It primarily explores for silver, gold, copper, lead, and zinc deposits. The company owns interests in the Cooke Mountain, Empire Creek, Flag Hill, and Talisman properties located in Washington, the United States. Adamera Minerals Corp. is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "ARU.V": {"short_name": "AURANIA RESOURCES LTD", "long_name": "Aurania Resources Ltd.", "summary": "Aurania Resources Ltd., a junior exploration mining company, engages in the identification, evaluation, acquisition, and exploration of mineral properties in Ecuador and Peru. The company explores for gold, silver, copper, and other precious metal deposits. Its flagship asset is the Lost Cities Â\u0096 Cutucu Project, which is located in the Jurassic Metallogenic Belt in the eastern foothills of the Andes mountain range of southeastern Ecuador. The company was formerly known as Urania Resources Ltd. and changed its name to Aurania Resources Ltd. in March 2012. Aurania Resources Ltd. was incorporated in 2007 and is based in Toronto, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "ASDZF": {"short_name": "ARCTIC STAR EXPLORATION CORP", "long_name": "Arctic Star Exploration Corp.", "summary": "Arctic Star Exploration Corp., a junior natural resource company, acquires, explores for, and develops mineral properties in Canada and Finland. The company primarily explores for diamond and niobium/rare earth deposits. Its flagship project is the Timantti diamond project covering an area of 243 hectares exploration permit and 193,700 hectares exploration reservation located in Finland. The company was formerly known as Arctic Star Diamond Corp. and changed its name to Arctic Star Exploration Corp. in July 2011. Arctic Star Exploration Corp. was incorporated in 2001 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "ATBHF": {"short_name": "ASTON BAY HOLDINGS INC", "long_name": "Aston Bay Holdings Ltd.", "summary": "Aston Bay Holdings Ltd., an exploration stage company, acquires, explores, and develops mineral properties in North America. The company explores for copper, zinc, lead, silver, gold, and precious metal deposits. It holds a 100% interest in the Storm Copper and Seal Zinc project that consists of 118 contiguous mining claims and 12 prospecting permits covering an area of approximately 381,468 hectares on Somerset Island, Nunavut, Canada, as well as holds an interest in the Blue Ridge Project located in central Virginia, the United States. The company is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "AUAG.CN": {"short_name": "AuxicoRes", "long_name": "Auxico Resources Canada Inc.", "summary": "Auxico Resources Canada Inc., together with its subsidiaries, engages in the acquisition, exploration, and development of mineral properties in Canada, Mexico, and Columbia. The company holds a 100% interest in the Zamora silver-gold property comprising five individual lots, including Zamora, Campanillas, San Felipe, Chio, and Gaby covering a total area of 3,376.6265 hectares located to the southeast of the city of Culiacan in the state of Sinaloa, Mexico. It also holds an option to acquire the La Franca silver-gold mine covering 12 hectares located in the state of Sinaloa, Mexico. The company was founded in 2014 and is headquartered in Montreal, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Montreal"}, "AUCU.CN": {"short_name": "InflectionRes", "long_name": "Inflection Resources Ltd.", "summary": "Inflection Resources Ltd., a junior resource company, engages in the exploration and evaluation of mineral properties hosting gold, copper, and base metals in New South Wales and Queensland, Australia. The company holds a portfolio of exploration licenses and applications totaling 600,000 hectares. Its principal property is the Northern NSW Romardo project consisting of seventeen non-contiguous exploration licenses (EL); and three EL applications located in the Lachlan Fold Belt region of New South Wales, Australia. The company was founded in 2017 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "AUCUF": {"short_name": "INFLECTION RESOURCES LTD", "long_name": "Inflection Resources Ltd.", "summary": "Inflection Resources Ltd., a junior resource company, engages in the exploration and evaluation of mineral properties hosting gold, copper, and base metals in New South Wales and Queensland, Australia. The company holds a portfolio of exploration licenses and applications totaling 600,000 hectares. Its principal property is the Northern NSW Romardo project consisting of seventeen non-contiguous exploration licenses (EL); and three EL applications located in the Lachlan Fold Belt region of New South Wales, Australia. The company was founded in 2017 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "AUIAF": {"short_name": "AURANIA RESOURCES LIMITED", "long_name": "Aurania Resources Ltd.", "summary": "Aurania Resources Ltd., a junior exploration mining company, engages in the identification, evaluation, acquisition, and exploration of mineral properties in Ecuador and Peru. The company explores for gold, silver, copper, and other precious metal deposits. Its flagship asset is the Lost Cities Â\u0096 Cutucu Project, which is located in the Jurassic Metallogenic Belt in the eastern foothills of the Andes mountain range of southeastern Ecuador. The company was formerly known as Urania Resources Ltd. and changed its name to Aurania Resources Ltd. in March 2012. Aurania Resources Ltd. was incorporated in 2007 and is based in Toronto, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "AUU.V": {"short_name": "GOLD79 MINES LTD", "long_name": "Gold79 Mines Ltd.", "summary": "Gold79 Mines Ltd. engages in the acquisition, exploration, and development of precious metal prospects in the Southwest United States. The company holds interests in three gold projects, including the Jefferson Canyon Gold Project and the Tip Top Gold Project located in Nevada, the United States; and the Gold Chain Project located in northern Arizona, the United States. It also holds interests in the Greyhound Project located in Nunavut, Canada; and the Taviche Project situated in Oaxaca, Mexico. The company was formerly known as Aura Resources Inc. and changed its name to Gold79 Mines Ltd. in August 2020. Gold79 Mines Ltd. is based in Ottawa, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Ottawa"}, "AUXIF": {"short_name": "AUXICO RESOURCES CANADA INC", "long_name": "Auxico Resources Canada Inc.", "summary": "Auxico Resources Canada Inc., together with its subsidiaries, engages in the acquisition, exploration, and development of mineral properties in Canada, Mexico, and Columbia. The company holds a 100% interest in the Zamora silver-gold property comprising five individual lots, including Zamora, Campanillas, San Felipe, Chio, and Gaby covering a total area of 3,376.6265 hectares located to the southeast of the city of Culiacan in the state of Sinaloa, Mexico. It also holds an option to acquire the La Franca silver-gold mine covering 12 hectares located in the state of Sinaloa, Mexico. The company was founded in 2014 and is headquartered in Montreal, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Montreal"}, "AUXRF": {"short_name": "AUX RESOURCES CORPORATION", "long_name": "AUX Resources Corporation", "summary": "AUX Resources Corporation engages in the acquisition, exploration, and evaluation of mineral properties in Canada. The company explores for gold and silver properties. It holds interests in the Georgie River (GR) project covering 7,936 hectares; American Creek project covering 3,024 hectares; Bear Pass project covering 6,400 hectares; Lower Bear project covering 3,836 hectares; Tide North project covering 2,204 hectares located in Stewart gold camp in the Golden Triangle region of northwest British Columbia; and Independence and Silver Crown properties that covers an area of 2,647 hectares located in Stewart, British Colombia. The company is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "AXDDF": {"short_name": "AZUCAR MINERALS LTD", "long_name": "Azucar Minerals Ltd.", "summary": "Azucar Minerals Ltd. acquires, explores for, and evaluates mineral properties in Canada, the United States, and Mexico. It explores for gold, silver, and copper deposits. The company owns a 100% interest in the El Cobre property covering an area of 7,300 hectares located in Mexico. It also has an option to acquire 100% interest in the Los Venados project in Sonora State Mexico. The company was formerly known as Almadex Minerals Limited and changed its name to Azucar Minerals Ltd. in May 2018. Azucar Minerals Ltd. was incorporated in 2015 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "AXU": {"short_name": "Alexco Resource Corp", "long_name": "Alexco Resource Corp.", "summary": "Alexco Resource Corp. engages in the mineral exploration, and mine development and operational activities primarily in Yukon Territory, Canada. The company explores for silver, lead, zinc, and gold deposits. It owns interests in the majority of the historic Keno Hill Silver District project that comprises the Flame & Moth, Bermingham, Lucky Queen, Bellekeno, and Onek deposits, as well as 725 quartz mining leases, 873 quartz claims, 24 placer mining claims, one quartz mining license and 50% of three quartz mining leases, and two crown grants 50% of three quartz mining leases covering an area of 233 square kilometers located in Yukon Territory. Alexco Resource Corp. was incorporated in 2004 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "ASE", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "AXU.TO": {"short_name": "ALEXCO RESOURCE CORP", "long_name": "Alexco Resource Corp.", "summary": "Alexco Resource Corp. engages in the mineral exploration, and mine development and operational activities primarily in Yukon Territory, Canada. The company explores for silver, lead, zinc, and gold deposits. It owns interests in the majority of the historic Keno Hill Silver District project that comprises the Flame & Moth, Bermingham, Lucky Queen, Bellekeno, and Onek deposits, as well as 725 quartz mining leases, 873 quartz claims, 24 placer mining claims, one quartz mining license and 50% of three quartz mining leases, and two crown grants 50% of three quartz mining leases covering an area of 233 square kilometers located in Yukon Territory. Alexco Resource Corp. was incorporated in 2004 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "AYA.TO": {"short_name": "AYA GOLD AND SILVER INC", "long_name": "Aya Gold & Silver Inc.", "summary": "Aya Gold & Silver Inc., together with its subsidiaries, engages in the acquisition, exploration, evaluation, and development of mining properties in Morocco. The company explores for gold, silver, zinc, lead, tungsten, molybdenum, uranium, and copper deposits. Its flagship project is the Zgounder property located in the Proterozoic Siroua Massif of the Anti-Atlas Range, Morocco. The company was formerly known as Maya Gold and Silver Inc. and changed its name to Aya Gold & Silver Inc. in July 2020. Aya Gold & Silver Inc. was incorporated in 2007 and is headquartered in Montreal, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Montreal"}, "AZGFF": {"short_name": "AZTECA GOLD CORPORATION", "long_name": "Azteca Gold Corp.", "summary": "Azteca Gold Corp., a development stage company, acquires, explores for, and develops gold and silver properties in the United States and Mexico. The company holds a 100% interest in the Marietta property consisting of 156 patented and unpatented claims located in Mineral County, Nevada; Two Mile property that consists of 725 unpatented claims and 1 patented claim covering approximately 15,000 acres located in Idaho; and Geroe Creek property comprising 25 State of Alaska unpatented claims that cover 4,000 acres located in Alaska. It also holds an interest in the Orange property consisting 147 claims covering 3,037 acres in Idaho; and Tres de Mayo concession located in the county of Guazapares, Chihuahua, Mexico. The company was formerly known as Hansa Corporation and changed its name to Azteca Gold Corp. in December 2006. Azteca Gold Corp. was incorporated in 1957 and is based in Calgary, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Calgary"}, "B4IF.F": {"short_name": "GOLIATH RES LTD", "long_name": "Goliath Resources Limited", "summary": "Goliath Resources Limited engages in the acquisition and exploration of mineral properties in British Columbia, Canada. The company explores for gold, silver, copper, and molybdenum. It has an option to acquire 100% interests in Luckystrike property, which covers 31,511 hectares located in the Ominica and Skeena Mining Divisions in British Columbia; and the Golddigger property, which covers 23,858.51 hectares located to the southeast of Stewart. The company also holds interests in the Nelligan Project consisting of 391 mineral claims covering an area of 340 square kilometers situated in Quebec, Canada. Goliath Resources Limited is headquartered in Toronto, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "BAT.V": {"short_name": "BATERO GOLD CORP.", "long_name": "Batero Gold Corp.", "summary": "Batero Gold Corp., together with its subsidiaries, engages in the exploration and development of mineral properties in Colombia. The company primarily explores for gold, copper, and silver deposits. It owns a 100% interest in the Batero-Quinchia project, which consists of 1,407-hectare tenement and two applications for a concession contract of 169 hectares situated in the municipality of Quinchia, Department of Risaralda, Colombia. The company was formerly known as Angus Resources Inc. and changed its name to Batero Gold Corp. in July 2010. Batero Gold Corp. was incorporated in 2008 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "BBB.V": {"short_name": "BRIXTON METALS CORPORATION", "long_name": "Brixton Metals Corporation", "summary": "Brixton Metals Corporation, an exploration stage company, engages in the acquisition, exploration, development, and evaluation of mineral properties in Canada and the United States. The company primarily explores for gold, silver, copper, and cobalt deposits. It holds a 100% interest in the Thorn gold-copper-silver project located in Northwest British Columbia; the Hog Heaven Silver-Gold-Copper Project located in Northwest Montana; Langis-Hudson Bay Silver-Cobalt Project located in Northeast Ontario; and Atlin Goldfields Project in Northwest British Columbia. The company also holds a purchase agreement to acquire a 100% interest in the Trapper project covering an area of 3,756 hectares. Brixton Metals Corporation was incorporated in 2009 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "BBBXF": {"short_name": "BRIXTON METALS CORP", "long_name": "Brixton Metals Corporation", "summary": "Brixton Metals Corporation, an exploration stage company, engages in the acquisition, exploration, and evaluation of mineral properties in Canada. The company primarily explores for gold, silver, copper, and cobalt minerals. It holds a 100% interest in the Thorn gold-copper-silver project located in British Columbia. The company also holds interests in the Atlin Gold project, which is located in Atlin, British Columbia; the Hog Heaven silver-gold project that is located in northwest Montana; and the Langis-Hudson Bay cobalt project, which is located in Ontario. In addition, it holds a purchase agreement to acquire a 100% interest in the Trapper project covering an area of 3,756 hectares. Brixton Metals Corporation is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "BFM.F": {"short_name": "DIOS EXPLORATION INC.", "long_name": "Dios Exploration Inc.", "summary": "Dios Exploration Inc. engages in the exploration and evaluation of mineral resource properties in Canada. The company explores for gold and diamond deposits. It holds interests in various projects that cover 624 mining claims in James Bay. The company is based in Montreal, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Montreal"}, "BG0A.F": {"short_name": "EXGEN RES INC.", "long_name": "ExGen Resources Inc.", "summary": "ExGen Resources Inc., a junior resource company, engages in the exploration of mineral properties. The company explores for copper and gold deposits. It has 6 projects in Canada and the United States. The company was formerly known as Boxxer Gold Corp. and changed its name to ExGen Resources Inc. in December 2014. ExGen Resources Inc. is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "BHT.V": {"short_name": "BRAVEHEART RESOURCES INC", "long_name": "Braveheart Resources Inc.", "summary": "Braveheart Resources Inc., an exploration stage company, locates, acquires, and explores for base and precious metals primarily in Canada. The company explores for gold, copper, and silver deposits. Its principal project is Bull River Mine, which is located in the Cranbrook, British Colombia. The company was formerly known as Rainbow Resources Inc. and changed its name to Braveheart Resources Inc. in November 2014. Braveheart Resources Inc. was incorporated in 2009 and is headquartered in Calgary, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "BME.V": {"short_name": "BARSELE MINERALS CORP", "long_name": "Barsele Minerals Corp.", "summary": "Barsele Minerals Corp., an exploration stage company, engages in the acquisition, exploration, and evaluation of mineral properties in Sweden. The company explores for gold, silver, copper, and zinc deposits. Its principal property is the Barsele gold project covering an area of approximately 47,000 hectares located in VÃ¤sterbottens LÃ¤n, Northern Sweden. Barsele Minerals Corp. was incorporated in 2013 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "BMEX.V": {"short_name": "BMEX GOLD INC", "long_name": "BMEX Gold Inc.", "summary": "BMEX Gold Inc., a junior mineral exploration company, engages in the acquisition, exploration, and development of gold and base metal properties in Canada. It holds an option to acquire 100% in the King Tut Gold property, comprising of 120 mineral claims that covers an area of 5,206 hectares located in in Quebec, Canada; and Dunlop Bay Gold project, consisting of 76 mineral claims covering an area of 4226 Hectares located in in Quebec, Canada.   The company was formerly known as Meridius Resources Limited. BMEX Gold Inc. was founded in 2017 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "BXXRF": {"short_name": "EXGEN RESOURCES INC", "long_name": "ExGen Resources Inc.", "summary": "ExGen Resources Inc., a junior resource company, engages in the exploration of mineral properties. The company explores for copper and gold deposits. It has 6 projects in Canada and the United States. The company was formerly known as Boxxer Gold Corp. and changed its name to ExGen Resources Inc. in December 2014. ExGen Resources Inc. is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "CAPTF": {"short_name": "CAPITAN MINING INC", "long_name": "Capitan Mining Inc.", "summary": "Capitan Mining Inc. operates as a mineral exploration company. It focuses on the 100% owned gold and silver Penoles project located in Durango, Mexico. The company was incorporated in 2019 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "CBG.V": {"short_name": "CHIBOUGAMAU INDEPENDENT MINES I", "long_name": "Chibougamau Independent Mines Inc.", "summary": "Chibougamau Independent Mines Inc. engages in the acquisition, exploration, and development of natural resource properties in Canada. It focuses on copper, gold, zinc, silver, iron, titanium, and vanadium deposits located in Chibougamau mining district, Quebec. The company was incorporated in 2010 and is headquartered in Rouyn-Noranda, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Rouyn-Noranda"}, "CGG.TO": {"short_name": "CHINA GOLD INT RESOURCES CORP.", "long_name": "China Gold International Resources Corp. Ltd.", "summary": "China Gold International Resources Corp. Ltd., a gold and base metal mining company, acquires, explores for, develops, and mines mineral properties in the People's Republic of China. It primarily holds 96.5% interest in the Chang Shan Hao gold mine covering an area of 36 square kilometers in the western part of Inner Mongolia, northern China; and 100% interest in the Jiama copper-gold polymetallic mine that hosts copper, gold, molybdenum, silver, lead, and zinc metals located in Metrokongka County, Tibet. The company was formerly known as Jinshan Gold Mines Inc. China Gold International Resources Corp. Ltd. was incorporated in 2000 and is headquartered in Vancouver, Canada. The company is considered as a Red Chip company due to its listing on the Hong Kong Stock Exchange.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "CHKKF": {"short_name": "CHAKANA COPPER CORP", "long_name": "Chakana Copper Corp.", "summary": "Chakana Copper Corp. engages in the acquisition, exploration, and development of mineral properties. It holds an option to acquire a 100% interest in the Soledad project, a copper, gold, and silver project located in Central Peru. The company is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "CHPGF": {"short_name": "CHESAPEAKE GOLD CORP", "long_name": "Chesapeake Gold Corp.", "summary": "Chesapeake Gold Corp., a development stage company, focuses on the exploration and development of precious metals in North and Central America. The company primarily explores for gold, silver, and zinc deposits. Its primary asset is the Metates project, which comprises 14 mineral concessions totaling 14,727 hectares located in Durango State, Mexico. The company was incorporated in 2002 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "CKG.F": {"short_name": "CHESAPEAKE GOLD CORP.", "long_name": "Chesapeake Gold Corp.", "summary": "Chesapeake Gold Corp., a development stage company, focuses on the exploration and development of precious metals in North and Central America. The company primarily explores for gold, silver, and zinc deposits. Its primary asset is the Metates project, which comprises 14 mineral concessions totaling 14,727 hectares located in Durango State, Mexico. The company was incorporated in 2002 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "CKG.V": {"short_name": "CHESAPEAKE GOLD CORP.", "long_name": "Chesapeake Gold Corp.", "summary": "Chesapeake Gold Corp., a development stage company, focuses on the exploration and development of precious metals in North and Central America. The company primarily explores for gold, silver, and zinc deposits. Its primary asset is the Metates project, which comprises 14 mineral concessions totaling 14,727 hectares located in Durango State, Mexico. The company was incorporated in 2002 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "CLL1.F": {"short_name": "CHIBOUGAMAU INDEP. MNS", "long_name": "Chibougamau Independent Mines Inc.", "summary": "Chibougamau Independent Mines Inc. engages in the acquisition, exploration, and development of natural resource properties in Canada. It focuses on copper, gold, zinc, silver, iron, titanium, and vanadium deposits located in Chibougamau mining district, Quebec. The company was incorporated in 2010 and is headquartered in Rouyn-Noranda, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Rouyn-Noranda"}, "CLL1.SG": {"short_name": "Chibougamau Independent Mines R", "long_name": "Chibougamau Independent Mines Inc.", "summary": "Chibougamau Independent Mines Inc. engages in the acquisition, exploration, and development of natural resource properties in Canada. It focuses on copper, gold, zinc, silver, iron, titanium, and vanadium deposits located in Chibougamau mining district, Quebec. The company was incorporated in 2010 and is headquartered in Rouyn-Noranda, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "STU", "market": "dr_market", "country": "Canada", "city": "Rouyn-Noranda"}, "CLRMF": {"short_name": "CLEAN AIR METALS INC", "long_name": "Clean Air Metals Inc.", "summary": "Clean Air Metals Inc., an exploration stage company, identifies, acquires, explores for, and develops mineral resource projects in Canada. It primarily explores for platinum and palladium deposits. Its flagship properties are the Thunder Bay North Property consists of 219 unpatented mining claims covering an area of approximately 40,816 hectares; and the Escape Lake project covering an area of approximately 220 hectares located in the Thunder Bay region of Ontario. The company was formerly known as Regency Gold Corp. and changed its name to Clean Air Metals Inc. in April 2020. Clean Air Metals Inc. was founded in 1987 and is based in Thunder Bay, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Thunder Bay"}, "CMIL.V": {"short_name": "CAPELLA MINERALS LIMITED", "long_name": "Capella Minerals Limited", "summary": "Capella Minerals Limited, together with its subsidiaries, acquires, explores for, evaluates, and develops mineral properties in Canada, Sweden, and Norway. It primarily explores for gold and copper deposits, as well as explores for silver and zinc deposits. The company holds interest in Domain, Manitoba, and Savant Lake high-grade gold projects in Ontario, Canada; and Southern Gold Line project in Sweden. It also holds interest in the LÃ¸kken and KjÃ¸li high-grade copper projects located in Norway. The company was formerly known as New Dimension Resources Ltd. and changed its name to Capella Minerals Limited in November 2020. Capella Minerals Limited was incorporated in 2005 and is based in Mission, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Mission"}, "CN.V": {"short_name": "CONDOR RESOURCES INC.", "long_name": "Condor Resources Inc.", "summary": "Condor Resources Inc., an exploration stage company, engages in the acquisition and exploration of mineral properties in Peru. It explores for gold, and other precious and base metals, as well as silver, copper, lead, and zinc deposits. The company's portfolio includes various projects, such as Chavin, Soledad, Quriurqu, HuiÃ±ac Punta, Ocros, Pucamayo, Humaya, Andrea, San Martin, Lucero, Quilisane, and Cobreorco. Condor Resources Inc. was incorporated in 2003 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "CNRIF": {"short_name": "CONDOR RESOURCES INC", "long_name": "Condor Resources Inc.", "summary": "Condor Resources Inc., an exploration stage company, engages in the acquisition and exploration of mineral properties in Peru. It explores for gold, and other precious and base metals, as well as silver, copper, lead, and zinc deposits. The company's portfolio includes various projects, such as Chavin, Soledad, Quriurqu, HuiÃ±ac Punta, Ocros, Pucamayo, Humaya, Andrea, San Martin, Lucero, Quilisane, and Cobreorco. Condor Resources Inc. was incorporated in 2003 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "CTIMF": {"short_name": "P2 GOLD INC", "long_name": "P2 Gold Inc.", "summary": "P2 Gold Inc., a junior mining company, engages in the acquisition, exploration, and development of mineral properties in Canada and the United States. It primarily explores for gold, copper, silver, lead, and zinc deposits. The company holds an interest in the Silver Reef project that consists of 17 contiguous mineral tenures covering an area of approximately 23,182.7 hectares; the BAM property, which includes ten mineral tenures that covers an area of approximately 8,100 hectares; and the Todd Creek property consists of 69 mineral tenures covering an area of approximately 32,000 hectares located in northwest British Columbia, Canada. It also holds an interest in the Stockade property consists of 261 unpatented lode mining claims that covers an area of approximately 6,790 acres located in Malheur County; and the Lost Cabin property consists of 106 unpatented lode mining claims covering an area of approximately 2,190 acres, located in Lake County, Oregon. The company was formerly known as Central Timmins Exploration Corp. and changed its name to P2 Gold Inc. in August 2020. P2 Gold Inc. was incorporated in 2017 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "CTM.V": {"short_name": "CANTERRA MINERALS CORPORATION", "long_name": "Canterra Minerals Corporation", "summary": "Canterra Minerals Corporation, a resource company, engages in the evaluation, acquisition, and exploration of mineral properties in Canada and the United States. The company focuses on diamond exploration primarily in the Northwest Territories and Alberta. The company was formerly known as Diamondex Resources Ltd. and changed its name to Canterra Minerals Corporation in December 2009. Canterra Minerals Corporation was founded in 1999 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "CTMCF": {"short_name": "CANTERRA MINERALS CORPORATION", "long_name": "Canterra Minerals Corporation", "summary": "Canterra Minerals Corporation, a resource company, engages in the evaluation, acquisition, and exploration of mineral properties in Canada and the United States. The company focuses on diamond exploration primarily in the Northwest Territories and Alberta. The company was formerly known as Diamondex Resources Ltd. and changed its name to Canterra Minerals Corporation in December 2009. Canterra Minerals Corporation was founded in 1999 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "DCY.V": {"short_name": "DISCOVERY-CORP. ENTERPRISES INC", "long_name": "Discovery-Corp Enterprises Inc.", "summary": "Discovery-Corp Enterprises Inc., an exploration stage company, explores for base and precious metals in Canada. The company focuses on gold and copper properties. It holds a 100% interest in the Galaxy property comprising seven mineral claims and two crown-granted mineral claims covering approximately 91 hectares located in the Kamloops Mining Division of British Columbia, Canada. It also holds an undivided 50% interest in the mineral rights associated with Rock Creek Ranch property located in Humboldt County, Nevada, the United States. The company was formerly known as Getchell Resources Incorporated and changed its name to Discovery-Corp Enterprises Inc. in 2000. Discovery-Corp Enterprises Inc. was incorporated in 1986 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "DDI.CN": {"short_name": "DebutDiamonds", "long_name": "Debut Diamonds Inc.", "summary": "Debut Diamonds Inc. does not have significant operations. Previously, the company was engaged in the acquisition, exploration, and development of diamond mineral properties. The company was formerly known as Debuts Diamonds Inc. and changed its name to Debut Diamonds Inc. in June 2011. The company was incorporated in 2007 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "DDNFF": {"short_name": "ADAMERA MINERALS CORP", "long_name": "Adamera Minerals Corp.", "summary": "Adamera Minerals Corp., an exploration stage company, acquires and explores for precious metals. It primarily explores for silver, gold, copper, lead, and zinc deposits. The company owns interests in the Cooke Mountain, Empire Creek, Flag Hill, and Talisman properties located in Washington, the United States. Adamera Minerals Corp. is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "DEF.V": {"short_name": "DEFIANCE SILVER CORP", "long_name": "Defiance Silver Corp.", "summary": "Defiance Silver Corp., an exploration stage company, engages in the acquisition, exploration, evaluation, and development of mineral properties primarily in Mexico. It primarily explores for gold, copper, and silver deposits. The company holds interest in the Tepal gold-copper project located in MichoacÃ¡n state, Mexico; and the Lagartos project that consists of 14 concessions with a total area of approximately 800 hectares located in Zacatecas Silver District. It also has an option to acquire a 100% interest in the San Acacio silver deposit that consists of 10 mining concessions located to the north of the city of Zacatecas, Mexico. The company was formerly known as Defiance Capital Corp. and changed its name to Defiance Silver Corp. in June 2011. Defiance Silver Corp. was incorporated in 2007 and is based in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "DHC.CN": {"short_name": "DeerHorn Cap", "long_name": "Deer Horn Capital Inc.", "summary": "Deer Horn Capital Inc. engages in the acquisition, exploration, and evaluation of mineral properties in Canada. It primarily explores for silver, tellurium, gold, copper, tungsten, copper porphyry, bismuth, lead, zinc, and molybdenum. The company principally holds a 50% interest in the Deer Horn Property covering 5,133 hectares located in north western British Columbia. The company was formerly known as Deer Horn Metals Inc. and changed its name to Deer Horn Capital Inc. in 2014. Deer Horn Capital Inc. was incorporated in 2004 and is headquartered in Delta, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Delta"}, "DIG-H.V": {"short_name": "DISTRICT MINES LTD", "long_name": "District Mines Ltd.", "summary": "District Mines Ltd. operates as a platinum group and precious metals exploration and development company. Its flagship project is the Night Owl palladium project located in West Kelowna, British Columbia. The company was formerly known as Catalina Gold Corp. and changed its name to District Mines Ltd. in April 2020. District Mines Ltd. was incorporated in 1987 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "DMI.V": {"short_name": "DIAMCOR MINING INC.", "long_name": "Diamcor Mining Inc.", "summary": "Diamcor Mining Inc., a junior mining and exploration company, identifies, acquires, explores for, evaluates, operates, and develops diamond based resource properties. It holds interests in the Krone-Endora at Venetia project that consists of Krone 104MS and Endora 66MS farms covering a combined surface area of approximately 5,888 hectares located in South Africa. The company is based in Kelowna, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Kelowna"}, "DMIFF": {"short_name": "DIAMCOR MINING INC", "long_name": "Diamcor Mining Inc.", "summary": "Diamcor Mining Inc., a junior mining and exploration company, identifies, acquires, explores for, evaluates, operates, and develops diamond based resource properties. It holds interests in the Krone-Endora at Venetia project that consists of Krone 104MS and Endora 66MS farms covering a combined surface area of approximately 5,888 hectares located in South Africa. The company is based in Kelowna, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Kelowna"}, "DNCVF": {"short_name": "DEFIANCE SILVER CORP", "long_name": "Defiance Silver Corp.", "summary": "Defiance Silver Corp., an exploration stage company, engages in the acquisition, exploration, evaluation, and development of mineral properties primarily in Mexico. It primarily explores for gold, copper, and silver deposits. The company holds interest in the Tepal gold-copper project located in MichoacÃ¡n state, Mexico; and the Lagartos project that consists of 14 concessions with a total area of approximately 800 hectares located in Zacatecas Silver District. It also has an option to acquire a 100% interest in the San Acacio silver deposit that consists of 10 mining concessions located to the north of the city of Zacatecas, Mexico. The company was formerly known as Defiance Capital Corp. and changed its name to Defiance Silver Corp. in June 2011. Defiance Silver Corp. was incorporated in 2007 and is based in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "DO51.F": {"short_name": "XIANA MINING", "long_name": "Xiana Mining Inc.", "summary": "Xiana Mining Inc., a natural resource company, engages in the acquisition, exploration, development, and production of mineral properties. The company mainly produces copper, silver, and gold concentrates. It holds 100% ownership of Minera Altos de Punitaqui, which comprises four producing copper-gold mines and covers an area of 11,838 hectares in Region IV, Chile. The company was formerly known as Dorato Resources Inc. and changed its name to Xiana Mining Inc. in October 2013. Xiana Mining Inc. was incorporated in 1981 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "DOS.V": {"short_name": "DIOS EXPLORATION INC", "long_name": "Dios Exploration Inc.", "summary": "Dios Exploration Inc. engages in the exploration and evaluation of mineral resource properties in Canada. The company explores for gold and diamond deposits. It holds interests in various projects that cover 624 mining claims in James Bay. The company is based in Montreal, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Montreal"}, "DRIFF": {"short_name": "XIANA MINING INC", "long_name": "Xiana Mining Inc.", "summary": "Xiana Mining Inc., a natural resource company, engages in the acquisition, exploration, development, and production of mineral properties. The company mainly produces copper, silver, and gold concentrates. It holds 100% ownership of Minera Altos de Punitaqui, which comprises four producing copper-gold mines and covers an area of 11,838 hectares in Region IV, Chile. The company was formerly known as Dorato Resources Inc. and changed its name to Xiana Mining Inc. in October 2013. Xiana Mining Inc. was incorporated in 1981 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "DXZB.F": {"short_name": "CANTERRA MINERALS CORP.", "long_name": "Canterra Minerals Corporation", "summary": "Canterra Minerals Corporation, a resource company, engages in the evaluation, acquisition, and exploration of mineral properties in Canada and the United States. The company focuses on diamond exploration primarily in the Northwest Territories and Alberta. The company was formerly known as Diamondex Resources Ltd. and changed its name to Canterra Minerals Corporation in December 2009. Canterra Minerals Corporation was founded in 1999 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "ELRFF": {"short_name": "EASTERN PLATINUM LTD", "long_name": "Eastern Platinum Limited", "summary": "Eastern Platinum Limited, together with its subsidiaries, engages in the mining, exploration, and development of platinum group metal (PGM) and chrome properties in South Africa. Its PGM deposits include platinum, palladium, rhodium, osmium, iridium, and ruthenium. The company principally holds a 87.5% interest in the Crocodile River Mine located on the western limb and the Kennedy's Vale project on the eastern limb of Bushveld Complex; a 87% interest in the Mareesburg project situated on the eastern limb of the Bushveld Complex; and a 93.4% interest in the Spitzkop project located on the eastern limb of the Bushveld Complex. Eastern Platinum Limited was founded in 1989 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "EMPYF": {"short_name": "EMPRESS ROYALTY CORP", "long_name": "Empress Royalty Corp.", "summary": "Empress Royalty Corp. acquires royalty and streaming interests in precious metal mines and mining projects. The company has a portfolio of 14 precious metals royalties in Canada. It has net smelter return royalty interests in the Pinos Royalty and McLeroy-Pinos Royalty on the Pinos gold-silver project in Mexico. Empress Royalty Corp. has a strategic alliance agreement with Accendo Banco, S.A. to acquire royalties and streams and invest in the Mexican mining sector. The company was incorporated in 2020 and is headquartered in White Rock, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "White Rock"}, "EQMEF": {"short_name": "EQUITY METALS CORPORATION", "long_name": "Equity Metals Corporation", "summary": "Equity Metals Corporation engages in the acquisition, exploration, and development of mineral properties in Canada. The company explores for gold, silver, zinc, copper, and diamond ores. It owns a 100% interest in the Silver Queen property covering an area of 18,852 hectares located in the Omineca Mining Division, near Owen Lake, British Columbia; 57.49% interest in the Monument Diamond property located on the south shore of Lac de Gras in the Northwest Territories; and 100% in Saskatchewan Silica Sand lease covering an area of 54 acres. The company was formerly known as New Nadina Explorations Limited and changed its name to Equity Metals Corporation in September 2019. Equity Metals Corporation was incorporated in 1964 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "EQTY.V": {"short_name": "EQUITY METALS CORPORATION", "long_name": "Equity Metals Corporation", "summary": "Equity Metals Corporation engages in the acquisition, exploration, and development of mineral properties in Canada. The company explores for gold, silver, zinc, copper, and diamond ores. It owns a 100% interest in the Silver Queen property covering an area of 18,852 hectares located in the Omineca Mining Division, near Owen Lake, British Columbia; 57.49% interest in the Monument Diamond property located on the south shore of Lac de Gras in the Northwest Territories; and 100% in Saskatchewan Silica Sand lease covering an area of 54 acres. The company was formerly known as New Nadina Explorations Limited and changed its name to Equity Metals Corporation in September 2019. Equity Metals Corporation was incorporated in 1964 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "ETF.V": {"short_name": "Eastfield Resources Ltd.", "long_name": "Eastfield Resources Ltd.", "summary": "Eastfield Resources Ltd., an exploration stage company, engages in the acquisition and exploration of mineral properties in Canada. It primarily explores for gold, copper, nickel, silver, molybdenum, cobalt, and platinum group metals. The company holds 100% interest in the Zymo, Iron Lake, Hidden One, and Big Valley properties; and 91.3% interest in the Indata property comprising 18 claims encompassing 3,189 hectares located in British Columbia. Eastfield Resources Ltd. was founded in 1987 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "ETFLF": {"short_name": "EASTFIELD RESOURCES", "long_name": "Eastfield Resources Ltd.", "summary": "Eastfield Resources Ltd., an exploration stage company, engages in the acquisition and exploration of mineral properties in Canada. It primarily explores for gold, copper, nickel, silver, molybdenum, cobalt, and platinum group metals. The company holds 100% interest in the Zymo, Iron Lake, Hidden One, and Big Valley properties; and 91.3% interest in the Indata property comprising 18 claims encompassing 3,189 hectares located in British Columbia. Eastfield Resources Ltd. was founded in 1987 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "EXG.V": {"short_name": "EXGEN RESOURCES INC", "long_name": "ExGen Resources Inc.", "summary": "ExGen Resources Inc., a junior resource company, engages in the exploration of mineral properties. The company explores for copper and gold deposits. It has 6 projects in Canada and the United States. The company was formerly known as Boxxer Gold Corp. and changed its name to ExGen Resources Inc. in December 2014. ExGen Resources Inc. is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "FBSGF": {"short_name": "FABLED SILVER GOLD", "long_name": "Fabled Silver Gold Corp.", "summary": "Fabled Silver Gold Corp. focuses on acquiring, exploring, and operating metal properties. It has an option agreement to acquire the Santa Maria Project, a silver-gold property located in the centre of the Mexican epithermal silver-gold belt. The company was formerly known as Fabled Copper Corp. and changed its name to Fabled Silver Gold Corp. in October 2020. Fabled Silver Gold Corp. is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "FCO.V": {"short_name": "FABLED SILVER GOLD CORP", "long_name": "Fabled Silver Gold Corp.", "summary": "Fabled Silver Gold Corp. focuses on acquiring, exploring, and operating metal properties. It has an option agreement to acquire the Santa Maria Project, a silver-gold property located in the centre of the Mexican epithermal silver-gold belt. The company was formerly known as Fabled Copper Corp. and changed its name to Fabled Silver Gold Corp. in October 2020. Fabled Silver Gold Corp. is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "FYL.V": {"short_name": "FINLAY MINERALS LTD.", "long_name": "Finlay Minerals Ltd.", "summary": "Finlay Minerals Ltd. engages in the acquisition and exploration of base and precious metal deposits in northern British Columbia, Canada. It focuses on the exploration for gold-rich copper porphyry, epithermal gold, and mesothermal silver-copper targets, as well as lead, zinc, arsenic, bismuth, and tellurium deposits. The company holds interests in the Silver Hope property with 29 mineral tenures covering an area of 10,039 hectares located to the southeast of Houston, British Columbia; the Atty property with 13 mineral tenure claims covering an area of 3,393 hectares situated in the Toodoggone mining district; and the PIL Property with 48 tenures covering an area of 17,006 hectares located in north-central British Columbia. Finlay Minerals Ltd. was incorporated in 1999 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "GBRRF": {"short_name": "GABRIEL RESOURCES", "long_name": "Gabriel Resources Ltd.", "summary": "Gabriel Resources Ltd. engages in the exploration, evaluation, and development of precious metal mining properties in Romania. The company primarily explores for gold, silver, and copper deposits. It primarily holds interest in the Bucium exploration concession covering an area of 2,325 hectares located in Western Transylvania. The company was formerly known as Starx Resource Corp. and changed its name to Gabriel Resources Ltd. in April 1997. Gabriel Resources Ltd. was founded in 1986 and is based in Whitehorse, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Whitehorse"}, "GBRX.CN": {"short_name": "GoldenBirchRes.", "long_name": "Golden Birch Resources Inc.", "summary": "Golden Birch Resources Inc., a mineral exploration company, acquires, explores for, and develops mineral properties. The company primarily explores for copper and gold deposits. Its flagship project is the Keveri project that includes two exploration licenses located in Papua New Guinea. The company was incorporated in 2017 and is headquartered in Timmins, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Timmins"}, "GBU.V": {"short_name": "GABRIEL RESOURCES LTD", "long_name": "Gabriel Resources Ltd.", "summary": "Gabriel Resources Ltd. engages in the exploration, evaluation, and development of precious metal mining properties in Romania. The company primarily explores for gold, silver, and copper deposits. It primarily holds interest in the Bucium exploration concession covering an area of 2,325 hectares located in Western Transylvania. The company was formerly known as Starx Resource Corp. and changed its name to Gabriel Resources Ltd. in April 1997. Gabriel Resources Ltd. was founded in 1986 and is based in Whitehorse, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Whitehorse"}, "GDP.V": {"short_name": "GOLDEN PURSUIT RESOURCES LTD", "long_name": "Golden Pursuit Resources Ltd.", "summary": "Golden Pursuit Resources Ltd., a mineral exploration company, engages in the acquisition, exploration, and development of mineral properties, primarily precious metals in Nevada. It holds interests in various territorial and federal mineral claims located in Gordon Lake. The company was formerly known as Silver Pursuit Resources Ltd. and changed its name to Golden Pursuit Resources Ltd. in June 2018. Golden Pursuit Resources Ltd. was founded in 1992 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "GFX1.F": {"short_name": "GITENNES EXPL. INC.", "long_name": "Gitennes Exploration Inc.", "summary": "Gitennes Exploration Inc., a junior mineral exploration company, explores for mineral deposits in Peru and Canada. The company explores for gold and silver properties. It holds an option to acquire a 100% interest in the Snowbird gold exploration property in British Columbia; and a royalty interest in the Urumalqui silver project in Peru. The company also has an option to acquire three gold properties and a polymetallic property in the Val-d'Or region. Gitennes Exploration Inc. is based in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "GGD.F": {"short_name": "GOGOLD RESOURCES INC.", "long_name": "GoGold Resources Inc.", "summary": "GoGold Resources Inc. engages in the exploration, development, and production of gold and silver primarily in Mexico. The company holds an interest in the Parral Tailings project, which covers an area of 141 hectares located in the state of Chihuahua, Mexico. It also holds an option to acquire 100% concessions of the Los Ricos project, which covers 42 concessions with an area of approximately 22,000 hectares situated in the Jalisco State, Mexico. The company is headquartered in Halifax, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Halifax"}, "GGD.TO": {"short_name": "GOGOLD RESOURCES INC", "long_name": "GoGold Resources Inc.", "summary": "GoGold Resources Inc. engages in the exploration, development, and production of gold and silver primarily in Mexico. The company holds an interest in the Parral Tailings project, which covers an area of 141 hectares located in the state of Chihuahua, Mexico. It also holds an option to acquire 100% concessions of the Los Ricos project, which covers 42 concessions with an area of approximately 22,000 hectares situated in the Jalisco State, Mexico. The company is headquartered in Halifax, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Halifax"}, "GGL.V": {"short_name": "GGL RESOURCES CORP", "long_name": "GGL Resources Corp.", "summary": "GGL Resources Corp., an exploration stage company, engages in the acquisition, exploration, and evaluation of mineral properties in Canada. It owns claims prospective for gold, copper, silver, zinc, lead, nickel, and volcanogenic massive sulphide deposits, as well as diamonds in the Northwest Territories, Nunavut, and British Columbia, Canada. The company was formerly known as GGL Diamond Corp. and changed its name to GGL Resources Corp. in August 2009. GGL Resources Corp. was incorporated in 1981 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "GHR.V": {"short_name": "GOLDEN HARP RESOURCES INC", "long_name": "Golden Harp Resources Inc.", "summary": "Golden Harp Resources Inc. engages in the acquisition, exploration, and development of mineral properties in Canada. The company primarily explores for gold and base metals. It holds an interest in the Copper Hill project that covers 145 square kilometers in the prolific Abitibi Greenstone Belt in Northern Ontario. The company was incorporated in 2006 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "GIDMF": {"short_name": "GOLDEN INDEPENDENCE MINING CORP", "long_name": "Golden Independence Mining Corp.", "summary": "Golden Independence Mining Corp. engages in the acquisition and exploration of mineral property assets in Canada. It explores for gold and silver ores. The company's flagship property is the Independence gold project with 640 acres of lode and mill-site claims located in Battle Mountain, Nevada. The company was formerly known as 66 Resources Corp. and changed its name to Golden Independence Mining Corp. in September 2020. Golden Independence Mining Corp. was incorporated in 2017 and is based in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "GILXF": {"short_name": "GITENNES EXPLORATION INC", "long_name": "Gitennes Exploration Inc.", "summary": "Gitennes Exploration Inc., a junior mineral exploration company, explores for mineral deposits in Peru and Canada. The company explores for gold and silver properties. It holds an option to acquire a 100% interest in the Snowbird gold exploration property in British Columbia; and a royalty interest in the Urumalqui silver project in Peru. The company also has an option to acquire three gold properties and a polymetallic property in the Val-d'Or region. Gitennes Exploration Inc. is based in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "GIT.V": {"short_name": "GITENNES EXPLORATION INC.", "long_name": "Gitennes Exploration Inc.", "summary": "Gitennes Exploration Inc., a junior mineral exploration company, explores for mineral deposits in Peru and Canada. The company explores for gold and silver properties. It holds an option to acquire a 100% interest in the Snowbird gold exploration property in British Columbia; and a royalty interest in the Urumalqui silver project in Peru. The company also has an option to acquire three gold properties and a polymetallic property in the Val-d'Or region. Gitennes Exploration Inc. is based in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "GLDN.V": {"short_name": "GOLDEN RIDGE RESOURCES LTD", "long_name": "Golden Ridge Resources Ltd.", "summary": "Golden Ridge Resources Ltd. engages in the acquisition, exploration, and development of mineral properties in Canada. The company explores for gold, silver, copper, lead, zinc, and other precious metal deposits. Its flagship project is the Hank property that covers approximately 1,700 hectares in the Golden Triangle district of British Colombia. The company is headquartered in Kelowna, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Kelowna"}, "GLDRF": {"short_name": "IDAHO CHAMPION GLD MINES CANADA", "long_name": "Idaho Champion Gold Mines Canada Inc.", "summary": "Idaho Champion Gold Mines Canada Inc. engages in the acquisition, exploration, development, and extraction of precious metals in the United States. It primarily explores for gold and silver deposits. The company's project portfolio includes the Baner Project in Idaho County; the Champagne Project located in Butte County near Arco; and four cobalt properties in Lemhi County in the Idaho Cobalt Belt. The company is based in Toronto, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "GLGDF": {"short_name": "GOGOLD RESOURCES INC", "long_name": "GoGold Resources Inc.", "summary": "GoGold Resources Inc. engages in the exploration, development, and production of gold and silver primarily in Mexico. The company holds an interest in the Parral Tailings project, which covers an area of 141 hectares located in the state of Chihuahua, Mexico. It also holds an option to acquire 100% concessions of the Los Ricos project, which covers 42 concessions with an area of approximately 22,000 hectares situated in the Jalisco State, Mexico. The company is headquartered in Halifax, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Halifax"}, "GMIN.V": {"short_name": "G MINING VENTURES CORP", "long_name": "G Mining Ventures Corp.", "summary": "G Mining Ventures Corp., an exploration stage company, engages in the acquisition, exploration, and evaluation of mineral properties. The company has an option to acquire 100% interest in Cameron Lake project that comprises mineral claims located in the province of Quebec. The company was formerly known as Kanadario Gold Inc. G Mining Ventures Corp. was incorporated in 2017 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "GNC.V": {"short_name": "GAINEY CAPITAL CORP", "long_name": "Gainey Capital Corp.", "summary": "Gainey Capital Corp., a gold and silver exploration company, engages in the acquisition and exploration of mineral properties. The company owns the El Colomo project covering an area of 18,766 hectares; and a mill in the gold/silver-rich Sierra Madre Occidental trend in western Mexico. It also has an option to own a 100% interest in the Las Margaritas property, which consists of two mineral concessions encompassing a total of 500 hectares located in the State of Durango, Mexico. The company was incorporated in 2011 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "GNYPF": {"short_name": "GAINEY CAPITAL CORPORATION", "long_name": "Gainey Capital Corp.", "summary": "Gainey Capital Corp., a gold and silver exploration company, engages in the acquisition and exploration of mineral properties. The company owns the El Colomo project covering an area of 18,766 hectares; and a mill in the gold/silver-rich Sierra Madre Occidental trend in western Mexico. It also has an option to own a 100% interest in the Las Margaritas property, which consists of two mineral concessions encompassing a total of 500 hectares located in the State of Durango, Mexico. The company was incorporated in 2011 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "GORIF": {"short_name": "GOLDEN RIDGE RES LTD", "long_name": "Golden Ridge Resources Ltd.", "summary": "Golden Ridge Resources Ltd. engages in the acquisition, exploration, and development of mineral properties in Canada. The company explores for gold, silver, copper, lead, zinc, and other precious metal deposits. Its flagship project is the Hank property that covers approximately 1,700 hectares in the Golden Triangle district of British Colombia. The company is headquartered in Kelowna, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Kelowna"}, "GOT.V": {"short_name": "GOLIATH RESOURCES LIMITED", "long_name": "Goliath Resources Limited", "summary": "Goliath Resources Limited engages in the acquisition and exploration of mineral properties in British Columbia, Canada. The company explores for gold, silver, copper, and molybdenum. It has an option to acquire 100% interests in Luckystrike property, which covers 31,511 hectares located in the Ominica and Skeena Mining Divisions in British Columbia; and the Golddigger property, which covers 23,858.51 hectares located to the southeast of Stewart. The company also holds interests in the Nelligan Project consisting of 391 mineral claims covering an area of 340 square kilometers situated in Quebec, Canada. Goliath Resources Limited is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "GOTRF": {"short_name": "GOLIATH RESOURCES LIMITED", "long_name": "Goliath Resources Limited", "summary": "Goliath Resources Limited engages in the acquisition and exploration of mineral properties in British Columbia, Canada. The company explores for gold, silver, copper, and molybdenum. It has an option to acquire 100% interests in Luckystrike property, which covers 31,511 hectares located in the Ominica and Skeena Mining Divisions in British Columbia; and the Golddigger property, which covers 23,858.51 hectares located to the southeast of Stewart. The company also holds interests in the Nelligan Project consisting of 391 mineral claims covering an area of 340 square kilometers situated in Quebec, Canada. Goliath Resources Limited is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "GPMI.CN": {"short_name": "GoldPlusMng", "long_name": "Gold Plus Mining Inc.", "summary": "Gold Plus Mining Inc. engages in the acquisition, exploration, and development of mineral properties in Canada. It holds a 100% undivided interests in the Pluto Gold and Base Metals Property that comprises of 58 claims covering an area of approximately 3,223 hectares. The company was formerly known as SYD Financial Inc. and changed its name to Gold Plus Mining Inc. in February 2020. Gold Plus Mining Inc. is headquartered in Vancouver, British Columbia.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "GRZ.F": {"short_name": "GABRIEL RESOURCES LTD.", "long_name": "Gabriel Resources Ltd.", "summary": "Gabriel Resources Ltd. engages in the exploration, evaluation, and development of precious metal mining properties in Romania. The company primarily explores for gold, silver, and copper deposits. It primarily holds interest in the Bucium exploration concession covering an area of 2,325 hectares located in Western Transylvania. The company was formerly known as Starx Resource Corp. and changed its name to Gabriel Resources Ltd. in April 1997. Gabriel Resources Ltd. was founded in 1986 and is based in Whitehorse, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Whitehorse"}, "GSPR.V": {"short_name": "GSP RESOURCE CORP", "long_name": "GSP Resource Corp.", "summary": "GSP Resource Corp. engages in the acquisition and exploration of mineral properties in Canada. It primarily explores for copper, gold, silver, molybdenum, and palladium deposits. The company has an option to acquire a 100% interest in the Alwin project covering an area of 575.72 hectares located in Logan Lake, British Columbia; and the Olivine Mountain property that consists of an area of 3021.87 hectares situated in the Similkameen Mining District of British Columbia. GSP Resource Corp. was incorporated in 2018 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "GSRCF": {"short_name": "GSP RESOURCE CORP", "long_name": "GSP Resource Corp.", "summary": "GSP Resource Corp. engages in the acquisition and exploration of mineral properties in Canada. It primarily explores for copper, gold, silver, molybdenum, and palladium deposits. The company has an option to acquire a 100% interest in the Alwin project covering an area of 575.72 hectares located in Logan Lake, British Columbia; and the Olivine Mountain property that consists of an area of 3021.87 hectares situated in the Similkameen Mining District of British Columbia. GSP Resource Corp. was incorporated in 2018 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "GUN.V": {"short_name": "GUNPOINT EXPLORATION LTD.", "long_name": "Gunpoint Exploration Ltd.", "summary": "Gunpoint Exploration Ltd. engages in the acquisition and exploration of precious metal properties in the United States, Mexico, and Guatemala. It primarily holds a 100% interest in the Talapoosa gold-silver project comprising 509 unpatented lode mining claims covering an area of approximately 14,870 acres located in Lyon County, Nevada. The company is headquartered in Vancouver, Canada. Gunpoint Exploration Ltd. is a subsidiary of Chesapeake Gold Corp.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "GVR.V": {"short_name": "GROSVENOR RESOURCES CORPORATION", "long_name": "Grosvenor Resource Corporation", "summary": "Grosvenor Resource Corporation, a natural resource company, engages in the acquisition and exploration of mineral properties in Canada. It holds a 100% interest in the Powder gold-silver property. The company was formerly known as Reva Resources Corp. and changed its name to Grosvenor Resource Corporation in August 2016. The company was incorporated in 2004 and is headquartered in West Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "West Vancouver"}, "HAWK.V": {"short_name": "HAWKEYE GOLD AND DIAMOND INC", "long_name": "Hawkeye Gold & Diamond Inc.", "summary": "Hawkeye Gold & Diamond Inc., a junior mineral exploration and development company, acquires, explores for, and develops natural resources in North America. The company explores for copper, gold, silver, zinc, and magnetite deposits. Its precious and base metals properties are located in the Golden Triangle of northwest BC. The company was founded in 1988 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "HBEIF": {"short_name": "HONEY BADGER SILVER INC", "long_name": "Honey Badger Silver Inc.", "summary": "Honey Badger Silver Inc. acquires, explores for, and develops mineral properties in Canada. The company primarily explores for silver, cobalt, gold, zinc, lead, diamond, and barite deposits. Its flagship project is the Thunder Bay Polymetallic Silver Project covering an area of 37,850 hectares located in norther Ontario. The company was formerly known as Honey Badger Exploration Inc. and changed its name to Honey Badger Silver Inc. in November 2020. Honey Badger Silver Inc. was founded in 1992 and is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "HEG.F": {"short_name": "BARSELE MINERALS", "long_name": "Barsele Minerals Corp.", "summary": "Barsele Minerals Corp., an exploration stage company, engages in the acquisition, exploration, and evaluation of mineral properties in Sweden. The company explores for gold, silver, copper, and zinc deposits. Its principal property is the Barsele gold project covering an area of approximately 47,000 hectares located in VÃ¤sterbottens LÃ¤n, Northern Sweden. Barsele Minerals Corp. was incorporated in 2013 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "HGT.F": {"short_name": "HAWKEYE GOLD + DIAM.", "long_name": "Hawkeye Gold & Diamond Inc.", "summary": "Hawkeye Gold & Diamond Inc., a junior mineral exploration and development company, acquires, explores for, and develops natural resources in North America. The company explores for copper, gold, silver, zinc, and magnetite deposits. Its precious and base metals properties are located in the Golden Triangle of northwest BC. The company was founded in 1988 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "I970.F": {"short_name": null, "long_name": "Xali Gold Corp.", "summary": "Xali Gold Corp., together with its subsidiaries, engages in the exploration and development of mineral properties in Mexico and Peru. Its principal asset is the El Oro gold-silver property located in Mexico. The company has an agreement with Magellan Acquisition Corp. to earn up to a 100% interest in the San Dieguito de Arriba beneficiation plant and take over their rights to a lease agreement on the El Dorado Property located in Nayarit State, Mexico. The company was formerly known as Candente Gold Corp. and changed its name to Xali Gold Corp. in January 2021. Xali Gold Corp. was founded in 2009 and is headquartered in Vancouver, Canada.", "currency": "None", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "IGLD.CN": {"short_name": "GoldenIndMing", "long_name": "Golden Independence Mining Corp.", "summary": "Golden Independence Mining Corp. engages in the acquisition and exploration of mineral property assets in Canada. It explores for gold and silver ores. The company's flagship property is the Independence gold project with 640 acres of lode and mill-site claims located in Battle Mountain, Nevada. The company was formerly known as 66 Resources Corp. and changed its name to Golden Independence Mining Corp. in September 2020. Golden Independence Mining Corp. was incorporated in 2017 and is based in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "IRLB.F": {"short_name": "NOMAD ROYALTY COMPANY", "long_name": "Nomad Royalty Company Ltd.", "summary": "Nomad Royalty Company Ltd. operates as a gold and silver royalty company that purchases rights to the gold or silver produced from a mine. It owns a portfolio of 10 royalty, stream, and gold loan assets. The company is based in Montreal, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Montreal"}, "IRVA.F": {"short_name": "INTEGRA RES CORP.", "long_name": "Integra Resources Corp.", "summary": "Integra Resources Corp., a development stage company, engages in the acquisition, exploration, and development of mineral properties in the Americas. The company primarily focuses on the DeLamar project that consists of DeLamar and Florida Mountain gold and silver deposits located in the Owyhee County, southwestern Idaho. It also has an option agreement to acquire War Eagle Gold-Silver Deposit. The company was formerly known as Mag Copper Limited and changed its name to Integra Resources Corp. in August 2017. Integra Resources Corp. was incorporated in 1997 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "ITKO.CN": {"short_name": "IdahoChamp", "long_name": "Idaho Champion Gold Mines Canada Inc.", "summary": "Idaho Champion Gold Mines Canada Inc. engages in the acquisition, exploration, development, and extraction of precious metals in the United States. It primarily explores for gold and silver deposits. The company's project portfolio includes the Baner Project in Idaho County; the Champagne Project located in Butte County near Arco; and four cobalt properties in Lemhi County in the Idaho Cobalt Belt. The company is based in Toronto, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "ITRG": {"short_name": "Integra Resources Corp.", "long_name": "Integra Resources Corp.", "summary": "Integra Resources Corp., a development stage company, engages in the acquisition, exploration, and development of mineral properties in the Americas. The company primarily focuses on the DeLamar project that consists of DeLamar and Florida Mountain gold and silver deposits located in the Owyhee County, southwestern Idaho. It also has an option agreement to acquire War Eagle Gold-Silver Deposit. The company was formerly known as Mag Copper Limited and changed its name to Integra Resources Corp. in August 2017. Integra Resources Corp. was incorporated in 1997 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "ASE", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "J6W.F": {"short_name": "ALEXCO RESOURCE", "long_name": "Alexco Resource Corp.", "summary": "Alexco Resource Corp. engages in the mineral exploration, and mine development and operational activities primarily in Yukon Territory, Canada. The company explores for silver, lead, zinc, and gold deposits. It owns interests in the majority of the historic Keno Hill Silver District project that comprises the Flame & Moth, Bermingham, Lucky Queen, Bellekeno, and Onek deposits, as well as 725 quartz mining leases, 873 quartz claims, 24 placer mining claims, one quartz mining license and 50% of three quartz mining leases, and two crown grants 50% of three quartz mining leases covering an area of 233 square kilometers located in Yukon Territory. Alexco Resource Corp. was incorporated in 2004 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "JADE.V": {"short_name": "JADE LEADER CORP", "long_name": "Jade Leader Corp.", "summary": "Jade Leader Corp. engages in the exploration and development of mineral properties in Canada and the United States. The company primarily explores for gold, copper, nickel, zinc, nephrite jade, and silver deposits. It holds a 100% interest in the Tell property that consists of 193 claims covering an area of 4,000 hectares located to the east of Mayo, Yukon; the DJ Jade project, which covers an area of approximately 140 hectares located in Washington State; and the Wyoming Jade Fields that consists of 89 mineral lode claims covering an area of 1,800 acres located in Wyoming. The company is headquartered in Calgary, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "JDN.V": {"short_name": "JAYDEN RESOURCES INC", "long_name": "Jayden Resources Inc.", "summary": "Jayden Resources Inc., an exploration stage company, engages in the acquisition, exploration, and development of interests in mining projects. The company was formerly known as Pinnacle Mines Ltd. and changed its name to Jayden Resources Inc. in June 2010. Jayden Resources Inc. is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "JINFF": {"short_name": "CHINA GOLD INTERNATIONAL RESOUR", "long_name": "China Gold International Resources Corp. Ltd.", "summary": "China Gold International Resources Corp. Ltd., a gold and base metal mining company, acquires, explores for, develops, and mines mineral properties in the People's Republic of China. It primarily holds 96.5% interest in the Chang Shan Hao gold mine covering an area of 36 square kilometers in the western part of Inner Mongolia, northern China; and 100% interest in the Jiama copper-gold polymetallic mine that hosts copper, gold, molybdenum, silver, lead, and zinc metals located in Metrokongka County, Tibet. The company was formerly known as Jinshan Gold Mines Inc. China Gold International Resources Corp. Ltd. was incorporated in 2000 and is headquartered in Vancouver, Canada. The company is considered as a Red Chip company due to its listing on the Hong Kong Stock Exchange.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "JY21.F": {"short_name": "JAYDEN RES INC.", "long_name": "Jayden Resources Inc.", "summary": "Jayden Resources Inc., an exploration stage company, engages in the acquisition, exploration, and development of interests in mining projects. The company was formerly known as Pinnacle Mines Ltd. and changed its name to Jayden Resources Inc. in June 2010. Jayden Resources Inc. is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "KANAF": {"short_name": "G MINING VENTURES CORP", "long_name": "G Mining Ventures Corp.", "summary": "G Mining Ventures Corp., an exploration stage company, engages in the acquisition, exploration, and evaluation of mineral properties. The company has an option to acquire 100% interest in Cameron Lake project that comprises mineral claims located in the province of Quebec. The company was formerly known as Kanadario Gold Inc. G Mining Ventures Corp. was incorporated in 2017 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "KDK.V": {"short_name": "KODIAK COPPER CORP", "long_name": "Kodiak Copper Corp.", "summary": "Kodiak Copper Corp. primarily engages in the copper porphyry projects exploration business in Canada and the United States. Its principal project is the MPD copper-gold porphyry project that covers an area of approximately 7,850 hectares in southern British Columbia. The company also holds a 100% interest in the Mohave copper-molybdenum-silver porphyry project covering an area of approximately 10.4 square kilometers in Mohave County, Arizona, the United States; and a 100% interest in the Trapper copper-gold porphyry project covering approximately 38 square kilometers in the northern Golden Triangle region of British Columbia. In addition, it holds a 100% interest in the Kahuna diamond project located in Nunavut, Canada. The company was formerly known as Dunnedin Ventures Inc. and changed its name to Kodiak Copper Corp. in April 2020. Kodiak Copper Corp. was incorporated in 1987 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "KGS.V": {"short_name": "KINGMAN MINERALS LTD", "long_name": "Kingman Minerals Ltd.", "summary": "Kingman Minerals Ltd., an exploration stage company, sources and explores for mineral properties. The company explores for gold deposits. It has an option agreement to acquire 100% interest in 52 lode claims covering an area of 1,071.2 acres, located in Mohave County, Arizona. The company was formerly known as Astorius Resources Ltd. And changed its name to Kingman Minerals Ltd. in April 2020. Kingman Minerals Ltd. was incorporated in 2007 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "KWY1.F": {"short_name": "METALEX VENTURES LTD", "long_name": "Metalex Ventures Ltd.", "summary": "Metalex Ventures Ltd., an exploration stage company, engages in the acquisition, exploration, and development of mineral properties primarily in Canada. The company primarily explores for kimberlite hosted diamond deposits. Its principal projects are the Kyle Lake, Ring of Fire, Attawapiskat, and Wawa projects in Ontario; and the James Bay Lowlands project in western Quebec. The company is headquartered in Kelowna, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Kelowna"}, "LBCMF": {"short_name": "LIBERO COPPER & GOLD CORP", "long_name": "Libero Copper & Gold Corporation", "summary": "Libero Copper & Gold Corporation engages in the acquisition, exploration, and development of mineral properties in Canada, the United States, and Colombia. The company holds an option to acquire a 100% interest in the Tomichi porphyry copper-molybdenum deposit consisting of 49 unpatented lode mining claims with a total area of 409 hectares located in the Tomichi Mining District, Gunnison County, Southwestern Colorado; and an option to acquire a 100% interest in the Big Red porphyry copper-gold property comprising 20 contiguous claims totaling 26,000 hectares in northwestern British Columbia. It also owns 100% interest in the Mocoa porphyry copper-molybdenum deposit located in the Eastern Cordillera of Colombia. The company was formerly known as Libero Copper Corporation and changed its name to Libero Copper & Gold Corporation in September 2019. Libero Copper & Gold Corporation was incorporated in 2008 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "LDI.V": {"short_name": "LITHOQUEST RESOURCES INC", "long_name": "Lithoquest Resources Inc.", "summary": "Lithoquest Resources Inc. engages in the acquisition, exploration, and development of mining properties. It holds a 100% interest in the North Kimberley diamond project located in the King George River region of Western Australia. The company was formerly known as Lithoquest Diamonds Inc. and changed its name to Lithoquest Resources Inc. in November 2020. Lithoquest Resources Inc. is headquartered in Salt Spring Island, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Salt Spring Island"}, "LECR.CN": {"short_name": "LeocorGoldInc", "long_name": "Leocor Gold Inc.", "summary": "Leocor Gold Inc., a mineral exploration company, engages in the acquisition and exploration precious metal projects in Canada. It explores for copper, molybdenum, gold, and silver deposits. The company has an option to acquire 100% interest in the Shotgun Project consisting of five mineral titles covering an area of approximately 1,930.13 hectares located to the north-west of the town of Pemberton, British Columbia. It also holds an option to acquire a 100% interest in Nexus' Dorset gold project located in Newfoundland and Labrador; and an option agreement to acquire a 100% interest in the Copper Creek and Five Mile Brook projects located north-central portion of the Baie Verte Peninsula, Newfoundland. The company was formerly known as Leocor Ventures Inc. and changed its name to Leocor Gold Inc. in August 2020. Leocor Gold Inc. was incorporated in 2018 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "LGO.F": {"short_name": "LEOCOR GOLD INC.", "long_name": "Leocor Gold Inc.", "summary": "Leocor Gold Inc., a mineral exploration company, engages in the acquisition and exploration precious metal projects in Canada. It explores for copper, molybdenum, gold, and silver deposits. The company has an option to acquire 100% interest in the Shotgun Project consisting of five mineral titles covering an area of approximately 1,930.13 hectares located to the north-west of the town of Pemberton, British Columbia. It also holds an option to acquire a 100% interest in Nexus' Dorset gold project located in Newfoundland and Labrador; and an option agreement to acquire a 100% interest in the Copper Creek and Five Mile Brook projects located north-central portion of the Baie Verte Peninsula, Newfoundland. The company was formerly known as Leocor Ventures Inc. and changed its name to Leocor Gold Inc. in August 2020. Leocor Gold Inc. was incorporated in 2018 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "LKT.F": {"short_name": "LUCARA DIAMOND CORP.", "long_name": "Lucara Diamond Corp.", "summary": "Lucara Diamond Corp., a diamond mining company, engages in the acquisition, exploration, development, and operation of diamond properties in Africa. The company holds 100% interests in the Karowe mine located in Botswana. It also operates a digital diamond sales platform. The company was formerly known as Bannockburn Resources Limited and changed its name to Lucara Diamond Corp. in August 2007. Lucara Diamond Corp. was incorporated in 1981 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "LSX.V": {"short_name": "LASALLE EXPLORATION CORP", "long_name": "LaSalle Exploration Corp.", "summary": "LaSalle Exploration Corp., a junior mining exploration company, engages in the identification, acquisition, evaluation, and exploration of mineral properties in Canada. The company explores for gold, copper, silver, nickel, and platinum group elements. It holds 100% interest in the Radisson property comprising 86 designated claims covering a total area of 4,450.88 hectares located in the town of Matagami in Abitibi, Quebec; Blakelock property consisting of 230 cell claims covering an area of 3,700 hectare situated in the district of Cochrane, Ontario; and Selbaie property comprising 6 claims located in Matagami, QuÃ©bec. The company also holds an option to acquire a 100% interest in the Egan gold property covering an area of 4,720 hectares located in the Abitibi Greenstone Belt of northeastern Ontario. LaSalle Exploration Corp. was founded in 2011 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "LSXEF": {"short_name": "LASALLE EXPLORATION CORP", "long_name": "LaSalle Exploration Corp.", "summary": "LaSalle Exploration Corp., a junior mining exploration company, engages in the identification, acquisition, evaluation, and exploration of mineral properties in Canada. The company explores for gold, copper, silver, nickel, and platinum group elements. It holds 100% interest in the Radisson property comprising 86 designated claims covering a total area of 4,450.88 hectares located in the town of Matagami in Abitibi, Quebec; Blakelock property consisting of 230 cell claims covering an area of 3,700 hectare situated in the district of Cochrane, Ontario; and Selbaie property comprising 6 claims located in Matagami, QuÃ©bec. The company also holds an option to acquire a 100% interest in the Egan gold property covering an area of 4,720 hectares located in the Abitibi Greenstone Belt of northeastern Ontario. LaSalle Exploration Corp. was founded in 2011 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "LUC.ST": {"short_name": "Lucara Diamond Corp", "long_name": "Lucara Diamond Corp.", "summary": "Lucara Diamond Corp., a diamond mining company, engages in the acquisition, exploration, development, and operation of diamond properties in Africa. The company holds 100% interests in the Karowe mine located in Botswana. It also operates a digital diamond sales platform. The company was formerly known as Bannockburn Resources Limited and changed its name to Lucara Diamond Corp. in August 2007. Lucara Diamond Corp. was incorporated in 1981 and is headquartered in Vancouver, Canada.", "currency": "SEK", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "STO", "market": "se_market", "country": "Canada", "city": "Vancouver"}, "LUC.TO": {"short_name": "LUCARA DIAMOND CORP", "long_name": "Lucara Diamond Corp.", "summary": "Lucara Diamond Corp., a diamond mining company, engages in the acquisition, exploration, development, and operation of diamond properties in Africa. The company holds 100% interests in the Karowe mine located in Botswana. It also operates a digital diamond sales platform. The company was formerly known as Bannockburn Resources Limited and changed its name to Lucara Diamond Corp. in August 2007. Lucara Diamond Corp. was incorporated in 1981 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "LUCRF": {"short_name": "LUCARA DIAMOND CORP", "long_name": "Lucara Diamond Corp.", "summary": "Lucara Diamond Corp., a diamond mining company, engages in the acquisition, exploration, development, and operation of diamond properties in Africa. The company holds 100% interests in the Karowe mine located in Botswana. It also operates a digital diamond sales platform. The company was formerly known as Bannockburn Resources Limited and changed its name to Lucara Diamond Corp. in August 2007. Lucara Diamond Corp. was incorporated in 1981 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "M0RA.F": {"short_name": "MAMMOTH RES CORP.", "long_name": "Mammoth Resources Corp.", "summary": "Mammoth Resources Corp., an exploration stage company, engages in the acquisition, exploration, and evaluation of mining properties in Mexico. It holds a 100% interest in the Tenoriba property consisting of four concessions, including Mapy, Mapy 2, Mapy 3, and Fernanda covering a land package of approximately 5,333 hectares located in the Sierra Madre precious metal belt in southwestern Chihuahua State, Mexico. The company was formerly known as Mammoth Capital Corp. and changed its name to Mammoth Resources Corp. in December 2011. Mammoth Resources Corp. was founded in 2011 and is headquartered in Toronto, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "M8R.F": {"short_name": "MIRASOL RESOURCES LTD", "long_name": "Mirasol Resources Ltd.", "summary": "Mirasol Resources Ltd. engages in the acquisition and exploration of mineral properties primarily in Chile and Argentina. It explores for gold, silver, and copper deposits. The company holds 100% interests in the Gorbea gold project, the Los Amarillos gold-silver project, the Altazor gold project, and the Zeus gold project located in Northern Chile. It also owns 100% interests in the Claudia, Virginia, La Curva, Santa Rita, Sascha, and other projects located in the Santa Cruz province of Argentina. In addition, the company holds an option to acquire the Inca gold project in Northern Chile. Mirasol Resources Ltd. was founded in 2003 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "MED.V": {"short_name": "MEDGOLD RESOURCES CORP", "long_name": "Medgold Resources Corp.", "summary": "Medgold Resources Corp., an exploration stage company, engages in the acquisition and exploration of precious and base metal properties in Europe. It explores for gold, silver, lead, and zinc deposits. The company holds 100% interest in the Tlamino project comprising two contiguous licenses, such as Donje Tlamino and Surlica-Dukat covering an area of 192 square kilometers located in the far southeast of Serbia. It also holds interests in the Ljubata project, which consists of Ljubata and Radovnica licenses located adjacent to the borders of North Macedonia and Bulgaria. The company is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "MEXGF": {"short_name": "MEXICAN GOLD MINING CORP", "long_name": "Mexican Gold Mining Corp.", "summary": "Mexican Gold Mining Corp. engages in the acquisition, exploration, and evaluation of resource properties. It holds a 100% interest in the Las Minas project consists of six mineral concessions located in the state of Veracruz, Mexico. The company was formerly known as Mexican Gold Corp. and changed its name to Mexican Gold Mining Corp. in February 2020. Mexican Gold Mining Corp. was founded in 2006 and is based in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "MLRKF": {"short_name": "MILLROCK RESOURCES INC", "long_name": "Millrock Resources Inc.", "summary": "Millrock Resources Inc. engages in the acquisition and exploration of mineral properties. It deposits for gold, copper, porphyry, silver, and other metals. The company holds an interest in the Liberty Bell property covering an area of approximately 6,151 hectares; 64North Gold project covering an area of approximately 1,860 hectares; Chisna DragonSlayer project; and Apex El Nido covering an area of approximately 315 hectares located in Alaska. It also holds an interest in the El Batamote project covering a surface area of 5,796 hectares situated in Mexico. Millrock Resources Inc. was founded in 1979 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "MMG.V": {"short_name": "METALLIC MINERALS CORP", "long_name": "Metallic Minerals Corp.", "summary": "Metallic Minerals Corp. acquires, explores for, and develops mineral properties. The company explores for silver, gold, copper, lead, and zinc deposits. Its flagship project is the 100% owned Keno silver project covering an area of 166 square kilometers located in the Keno Hill silver district, Yukon Territory, Canada. The company was formerly known as Monster Mining Corp. and changed its name to Metallic Minerals Corp. in September 2016. Metallic Minerals Corp. was incorporated in 2007 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "MMMRF": {"short_name": "MAMMOTH RESOURCES CORP", "long_name": "Mammoth Resources Corp.", "summary": "Mammoth Resources Corp., an exploration stage company, engages in the acquisition, exploration, and evaluation of mining properties in Mexico. It holds a 100% interest in the Tenoriba property consisting of four concessions, including Mapy, Mapy 2, Mapy 3, and Fernanda covering a land package of approximately 5,333 hectares located in the Sierra Madre precious metal belt in southwestern Chihuahua State, Mexico. The company was formerly known as Mammoth Capital Corp. and changed its name to Mammoth Resources Corp. in December 2011. Mammoth Resources Corp. was founded in 2011 and is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "MMNGF": {"short_name": "METALLIC MINERALS CORP", "long_name": "Metallic Minerals Corp.", "summary": "Metallic Minerals Corp. acquires, explores for, and develops mineral properties. The company explores for silver, gold, copper, lead, and zinc deposits. Its flagship project is the 100% owned Keno silver project covering an area of 166 square kilometers located in the Keno Hill silver district, Yukon Territory, Canada. The company was formerly known as Monster Mining Corp. and changed its name to Metallic Minerals Corp. in September 2016. Metallic Minerals Corp. was incorporated in 2007 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "MMX": {"short_name": "Maverix Metals Inc.", "long_name": "Maverix Metals Inc.", "summary": "Maverix Metals Inc., a precious metals royalty and streaming company, engages in the exploration and development of mineral properties. The company explores for gold, silver, lead, zinc, and other metals. As of December 31, 2019, it owned approximately 100 royalties, streams, and other interests in North America, South America, Australia, and internationally. The company was formerly known as MacMillan Minerals Inc. Maverix Metals Inc. was founded in 2016 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "ASE", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "MMX.TO": {"short_name": "MAVERIX METALS INC", "long_name": "Maverix Metals Inc.", "summary": "Maverix Metals Inc., a precious metals royalty and streaming company, engages in the exploration and development of mineral properties. The company explores for gold, silver, lead, zinc, and other metals. As of December 31, 2019, it owned approximately 100 royalties, streams, and other interests in North America, South America, Australia, and internationally. The company was formerly known as MacMillan Minerals Inc. Maverix Metals Inc. was founded in 2016 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "MONGF": {"short_name": "MONTEGO RESOURCES INC", "long_name": "Montego Resources Inc.", "summary": "Montego Resources Inc., a junior mineral exploration company, acquires, explores for, and evaluates natural resource properties. The company was incorporated in 2012 and is based in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "MPG.F": {"short_name": "MOUNT.PROV.D.", "long_name": "Mountain Province Diamonds Inc.", "summary": "Mountain Province Diamonds Inc., through its subsidiaries, focuses on the mining and marketing of rough diamonds worldwide. Its primary asset is its 49% interest in the Gahcho KuÃ© diamond; and holds a 100% interest in the Kennady North Project consisting of 22 federal leases and 58 claims covering an area of 67,164 hectares located in the Northwest Territories, Canada. The company was formerly known as Mountain Province Mining Inc. and changed its name to Mountain Province Diamonds Inc. in October 2000. Mountain Province Diamonds Inc. was founded in 1986 and is headquartered in Toronto, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "MPVD.TO": {"short_name": "MOUNTAIN PROVINCE DIAMONDS INC", "long_name": "Mountain Province Diamonds Inc.", "summary": "Mountain Province Diamonds Inc., through its subsidiaries, focuses on the mining and marketing of rough diamonds worldwide. Its primary asset is its 49% interest in the Gahcho KuÃ© diamond; and holds a 100% interest in the Kennady North Project consisting of 22 federal leases and 58 claims covering an area of 67,164 hectares located in the Northwest Territories, Canada. The company was formerly known as Mountain Province Mining Inc. and changed its name to Mountain Province Diamonds Inc. in October 2000. Mountain Province Diamonds Inc. was founded in 1986 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "MPVDF": {"short_name": "MOUNTAIN PROVINCE DIAMONDS INC", "long_name": "Mountain Province Diamonds Inc.", "summary": "Mountain Province Diamonds Inc., through its subsidiaries, focuses on the mining and marketing of rough diamonds worldwide. Its primary asset is its 49% interest in the Gahcho KuÃ© diamond; and holds a 100% interest in the Kennady North Project consisting of 22 federal leases and 58 claims covering an area of 67,164 hectares located in the Northwest Territories, Canada. The company was formerly known as Mountain Province Mining Inc. and changed its name to Mountain Province Diamonds Inc. in October 2000. Mountain Province Diamonds Inc. was founded in 1986 and is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "MRIRF": {"short_name": "BMEX GOLD INC", "long_name": "BMEX Gold Inc.", "summary": "BMEX Gold Inc., a junior mineral exploration company, engages in the acquisition, exploration, and development of gold and base metal properties in Canada. It holds an option to acquire 100% in the King Tut Gold property, comprising of 120 mineral claims that covers an area of 5,206 hectares located in in Quebec, Canada; and Dunlop Bay Gold project, consisting of 76 mineral claims covering an area of 4226 Hectares located in in Quebec, Canada.   The company was formerly known as Meridius Resources Limited. BMEX Gold Inc. was founded in 2017 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "MRO.V": {"short_name": "MILLROCK RESOURCES INC.", "long_name": "Millrock Resources Inc.", "summary": "Millrock Resources Inc. engages in the acquisition and exploration of mineral properties. It deposits for gold, copper, porphyry, silver, and other metals. The company holds an interest in the Liberty Bell property covering an area of approximately 6,151 hectares; 64North Gold project covering an area of approximately 1,860 hectares; Chisna DragonSlayer project; and Apex El Nido covering an area of approximately 315 hectares located in Alaska. It also holds an interest in the El Batamote project covering a surface area of 5,796 hectares situated in Mexico. Millrock Resources Inc. was founded in 1979 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "MRZ.V": {"short_name": "MIRASOL RESOURCES LTD.", "long_name": "Mirasol Resources Ltd.", "summary": "Mirasol Resources Ltd. engages in the acquisition and exploration of mineral properties primarily in Chile and Argentina. It explores for gold, silver, and copper deposits. The company holds 100% interests in the Gorbea gold project, the Los Amarillos gold-silver project, the Altazor gold project, and the Zeus gold project located in Northern Chile. It also owns 100% interests in the Claudia, Virginia, La Curva, Santa Rita, Sascha, and other projects located in the Santa Cruz province of Argentina. In addition, the company holds an option to acquire the Inca gold project in Northern Chile. Mirasol Resources Ltd. was founded in 2003 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "MRZLF": {"short_name": "MIRASOL RESOURCES LIMITED", "long_name": "Mirasol Resources Ltd.", "summary": "Mirasol Resources Ltd. engages in the acquisition and exploration of mineral properties primarily in Chile and Argentina. It explores for gold, silver, and copper deposits. The company holds 100% interests in the Gorbea gold project, the Los Amarillos gold-silver project, the Altazor gold project, and the Zeus gold project located in Northern Chile. It also owns 100% interests in the Claudia, Virginia, La Curva, Santa Rita, Sascha, and other projects located in the Santa Cruz province of Argentina. In addition, the company holds an option to acquire the Inca gold project in Northern Chile. Mirasol Resources Ltd. was founded in 2003 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "MTA": {"short_name": "Metalla Royalty & Streaming Ltd", "long_name": "Metalla Royalty & Streaming Ltd.", "summary": "Metalla Royalty & Streaming Ltd., a precious metals royalty and streaming company, engages in the acquisition and management of precious metal royalties, streams, and related production-based interests in Canada and Australia. The company was formerly known as Excalibur Resources Ltd. and changed its name to Metalla Royalty & Streaming Ltd. in December 2016. Metalla Royalty & Streaming Ltd. was incorporated in 1983 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "ASE", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "MTA.V": {"short_name": "METALLA ROYALTY AND STREAMING L", "long_name": "Metalla Royalty & Streaming Ltd.", "summary": "Metalla Royalty & Streaming Ltd., a precious metals royalty and streaming company, engages in the acquisition and management of precious metal royalties, streams, and related production-based interests in Canada and Australia. The company was formerly known as Excalibur Resources Ltd. and changed its name to Metalla Royalty & Streaming Ltd. in December 2016. Metalla Royalty & Streaming Ltd. was incorporated in 1983 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "MTH.V": {"short_name": "MAMMOTH RESOURCES CORP", "long_name": "Mammoth Resources Corp.", "summary": "Mammoth Resources Corp., an exploration stage company, engages in the acquisition, exploration, and evaluation of mining properties in Mexico. It holds a 100% interest in the Tenoriba property consisting of four concessions, including Mapy, Mapy 2, Mapy 3, and Fernanda covering a land package of approximately 5,333 hectares located in the Sierra Madre precious metal belt in southwestern Chihuahua State, Mexico. The company was formerly known as Mammoth Capital Corp. and changed its name to Mammoth Resources Corp. in December 2011. Mammoth Resources Corp. was founded in 2011 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "MTN-H.V": {"short_name": "MARTINA MINERALS CORP", "long_name": "Martina Minerals Corp.", "summary": "Martina Minerals Corp., a junior exploration and evaluation company, focuses on acquiring an interest in precious and base metal exploration properties. The company is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "MUX": {"short_name": "McEwen Mining Inc.", "long_name": "McEwen Mining Inc.", "summary": "McEwen Mining Inc. engages in the exploration, development, production, and sale of gold and silver in the United States, Canada, Mexico, and Argentina. The company explores for copper deposits. It owns 100% interests in the El Gallo and Fenix projects located in Mexico; and the Black Fox Mine and Stock Mill, Grey Fox, and Froome and Tamarack properties in Canada. The company also owns interests in the Fuller, Davidson-Tisdale, Buffalo Ankerite, and Paymaster exploration properties located in Canada; and a 49% interest in the San JosÃ© mine located in Argentina. In addition, it owns 100% interests in the Gold Bar and Tonkin properties located in Eureka County, Nevada; and interests in the Los Azules copper project located in the cordilleran region in the province of San Juan, Argentina. The company was formerly known as US Gold Corporation and changed its name to McEwen Mining Inc. in January 2012. McEwen Mining Inc. was founded in 1979 and is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "NYQ", "market": "us_market", "country": "Canada", "city": "Toronto"}, "MUX.MX": {"short_name": "MCEWEN MINING INC", "long_name": "McEwen Mining Inc.", "summary": "McEwen Mining Inc. engages in the exploration, development, production, and sale of gold and silver in the United States, Canada, Mexico, and Argentina. The company explores for copper deposits. It owns 100% interests in the El Gallo and Fenix projects located in Mexico; and the Black Fox Mine and Stock Mill, Grey Fox, and Froome and Tamarack properties in Canada. The company also owns interests in the Fuller, Davidson-Tisdale, Buffalo Ankerite, and Paymaster exploration properties located in Canada; and a 49% interest in the San JosÃ© mine located in Argentina. In addition, it owns 100% interests in the Gold Bar and Tonkin properties located in Eureka County, Nevada; and interests in the Los Azules copper project located in the cordilleran region in the province of San Juan, Argentina. The company was formerly known as US Gold Corporation and changed its name to McEwen Mining Inc. in January 2012. McEwen Mining Inc. was founded in 1979 and is headquartered in Toronto, Canada.", "currency": "MXN", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "MEX", "market": "mx_market", "country": "Canada", "city": "Toronto"}, "MUX.TO": {"short_name": "MCEWEN MINING INC", "long_name": "McEwen Mining Inc.", "summary": "McEwen Mining Inc. engages in the exploration, development, production, and sale of gold and silver in the United States, Canada, Mexico, and Argentina. The company explores for copper deposits. It owns 100% interests in the El Gallo and Fenix projects located in Mexico; and the Black Fox Mine and Stock Mill, Grey Fox, and Froome and Tamarack properties in Canada. The company also owns interests in the Fuller, Davidson-Tisdale, Buffalo Ankerite, and Paymaster exploration properties located in Canada; and a 49% interest in the San JosÃ© mine located in Argentina. In addition, it owns 100% interests in the Gold Bar and Tonkin properties located in Eureka County, Nevada; and interests in the Los Azules copper project located in the cordilleran region in the province of San Juan, Argentina. The company was formerly known as US Gold Corporation and changed its name to McEwen Mining Inc. in January 2012. McEwen Mining Inc. was founded in 1979 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "MUX.VI": {"short_name": "MCEWEN MINING INC", "long_name": "McEwen Mining Inc.", "summary": "McEwen Mining Inc. engages in the exploration, development, production, and sale of gold and silver in the United States, Canada, Mexico, and Argentina. The company explores for copper deposits. It owns 100% interests in the El Gallo and Fenix projects located in Mexico; and the Black Fox Mine and Stock Mill, Grey Fox, and Froome and Tamarack properties in Canada. The company also owns interests in the Fuller, Davidson-Tisdale, Buffalo Ankerite, and Paymaster exploration properties located in Canada; and a 49% interest in the San JosÃ© mine located in Argentina. In addition, it owns 100% interests in the Gold Bar and Tonkin properties located in Eureka County, Nevada; and interests in the Los Azules copper project located in the cordilleran region in the province of San Juan, Argentina. The company was formerly known as US Gold Corporation and changed its name to McEwen Mining Inc. in January 2012. McEwen Mining Inc. was founded in 1979 and is headquartered in Toronto, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VIE", "market": "at_market", "country": "Canada", "city": "Toronto"}, "MY-X.CN": {"short_name": "MontegoRes", "long_name": "Montego Resources Inc.", "summary": "Montego Resources Inc., a junior mineral exploration company, acquires, explores for, and evaluates natural resource properties. The company was incorporated in 2012 and is based in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "N7D2.F": {"short_name": "CAPELLA MINERALS LTD", "long_name": "Capella Minerals Limited", "summary": "Capella Minerals Limited, together with its subsidiaries, acquires, explores for, evaluates, and develops mineral properties in Canada, Sweden, and Norway. It primarily explores for gold and copper deposits, as well as explores for silver and zinc deposits. The company holds interest in Domain, Manitoba, and Savant Lake high-grade gold projects in Ontario, Canada; and Southern Gold Line project in Sweden. It also holds interest in the LÃ¸kken and KjÃ¸li high-grade copper projects located in Norway. The company was formerly known as New Dimension Resources Ltd. and changed its name to Capella Minerals Limited in November 2020. Capella Minerals Limited was incorporated in 2005 and is based in Mission, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Mission"}, "NEE.V": {"short_name": "NORTHERN VERTEX MINING CORP", "long_name": "Northern Vertex Mining Corp.", "summary": "Northern Vertex Mining Corp. acquires, explores for, develops, and operates mineral properties in the United States and Canada. Its flagship project is the Moss mine gold-silver deposit located in Mohave County, Arizona. The company was formerly known as Northern Vertex Capital Inc. and changed its name to Northern Vertex Mining Corp. in February 2012. Northern Vertex Mining Corp. was incorporated in 2007 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "NHVCF": {"short_name": "NORTHERN VERTEX MNG CORP", "long_name": "Northern Vertex Mining Corp.", "summary": "Northern Vertex Mining Corp. acquires, explores for, develops, and operates mineral properties in the United States and Canada. Its flagship project is the Moss mine gold-silver deposit located in Mohave County, Arizona. The company was formerly known as Northern Vertex Capital Inc. and changed its name to Northern Vertex Mining Corp. in February 2012. Northern Vertex Mining Corp. was incorporated in 2007 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "NOC.V": {"short_name": "NORSEMAN SILVER INC", "long_name": "Norseman Silver Inc.", "summary": "Norseman Silver Inc., a junior natural resource company, engages in the acquisition, exploration, and development of mineral properties. It also holds an option agreement to acquire a 100% interest in certain mining claims located in the Province of British Columbia. The company was formerly known as Norseman Capital Ltd. and changed its name to Norseman Silver Inc. in September 2020. Norseman Silver Inc. was incorporated in 1985 and is based in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "NOCSF": {"short_name": "NORSEMAN SILVER INC", "long_name": "Norseman Silver Inc.", "summary": "Norseman Silver Inc., a junior natural resource company, engages in the acquisition, exploration, and development of mineral properties. It also holds an option agreement to acquire a 100% interest in certain mining claims located in the Province of British Columbia. The company was formerly known as Norseman Capital Ltd. and changed its name to Norseman Silver Inc. in September 2020. Norseman Silver Inc. was incorporated in 1985 and is based in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "NSR.TO": {"short_name": "NOMAD ROYALTY COMPANY LTD", "long_name": "Nomad Royalty Company Ltd.", "summary": "Nomad Royalty Company Ltd. operates as a gold and silver royalty company that purchases rights to the gold or silver produced from a mine. It owns a portfolio of 10 royalty, stream, and gold loan assets. The company is based in Montreal, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Montreal"}, "NSRXF": {"short_name": "NOMAD ROYALTY COMPANY LTD", "long_name": "Nomad Royalty Company Ltd.", "summary": "Nomad Royalty Company Ltd. operates as a gold and silver royalty company that purchases rights to the gold or silver produced from a mine. It owns a portfolio of 10 royalty, stream, and gold loan assets. The company is based in Montreal, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Montreal"}, "NUAG.TO": {"short_name": "NEW PACIFIC METALS CORP", "long_name": "New Pacific Metals Corp.", "summary": "New Pacific Metals Corp., together with its subsidiaries, engages in the exploration and development of mineral properties in Bolivia and Canada. The company explores for silver, gold, lead, and zinc deposits. Its flagship property is the Silver Sand property covering an area of 5.42 square kilometers located in the PotosÃ­ Department, Bolivia. The company was formerly known as New Pacific Holdings Corp. and changed its name to New Pacific Metals Corp. in July 2017. New Pacific Metals Corp. is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "NUPMF": {"short_name": "NEW PAC METALS CORP", "long_name": "New Pacific Metals Corp.", "summary": "New Pacific Metals Corp., together with its subsidiaries, engages in the exploration and development of mineral properties in Bolivia and Canada. The company explores for silver, gold, lead, and zinc deposits. Its flagship property is the Silver Sand property covering an area of 5.42 square kilometers located in the PotosÃ­ Department, Bolivia. The company was formerly known as New Pacific Holdings Corp. and changed its name to New Pacific Metals Corp. in July 2017. New Pacific Metals Corp. is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "O6M.F": {"short_name": "ORVANA MINLS CORP.", "long_name": "Orvana Minerals Corp.", "summary": "Orvana Minerals Corp., a mining and exploration company, engages in the evaluation, development, and mining of precious and base metal deposits. The company owns and operates the gold, copper, and silver El Valle Mine and CarlÃ©s Mine in the Rio Narcea Gold Belt in northern Spain. It also owns gold and copper concessions in the Don Mario Mine located in Don Mario district in southeastern Bolivia. The company is headquartered in Toronto, Canada. Orvana Minerals Corp. is a subsidiary of Fabulosa Mines Limited.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "OAC.F": {"short_name": "AMERIC.CREEK RESOURC.LTD", "long_name": "American Creek Resources Ltd.", "summary": "American Creek Resources Ltd., a precious metals exploration company, engages in the acquisition, exploration, and development of mineral properties located in various regions of British Columbia in Canada. The company explores for gold, silver, zinc, lead, and copper deposits. It holds a 100% interest in the Gold Hill Project covering an area of approximately 836 hectares; 100% interest in the D-1 McBride Property; and 20% interest in the Treaty Creek Project covering an area of approximately 114 square kilometers located in British Columbia. The company also holds interest in the Dunwell Property covering an area of 1,560 hectares; Ample Goldmax Property covering an area of 1,044 hectares; and the Austruck-Bonanza, Glitter King, and Silver Side properties located in British Columbia. American Creek Resources Ltd. was founded in 2004 and is headquartered in Cardston, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Cardston"}, "OBNNF": {"short_name": "OSISKO MINING INC", "long_name": "Osisko Mining Inc.", "summary": "Osisko Mining Inc., a mineral exploration company, engages in the acquisition, exploration, and development of precious metals resource properties in Canada. The company primarily explores for gold and silver. Its flagship project is the Windfall Lake property that consists of 285 mining claims covering an area of approximately 12,467 hectares located in the Abitibi greenstone belt, Urban Township, Eeyou Istchee James Bay, Quebec. The company was formerly known as Oban Mining Corporation and changed its name to Osisko Mining Inc. in June 2016. Osisko Mining Inc. was incorporated in 2010 and is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "OLV.V": {"short_name": "OLIVUT RESOURCES LTD.", "long_name": "Olivut Resources Ltd.", "summary": "Olivut Resources Ltd. engages in the acquisition, exploration, and development of mineral properties in Canada. The company mines for diamonds. Its principal asset is the HOAM project that consist of 2 prospecting permits covering an area of approximately 90,927 acres located in the Mackenzie Region, Northwest Territories, Canada. The company was incorporated in 2000 and is headquartered in Jasper East, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Jasper East"}, "OLVRF": {"short_name": "OLIVUT RESOURCES LTD", "long_name": "Olivut Resources Ltd.", "summary": "Olivut Resources Ltd. engages in the acquisition, exploration, and development of mineral properties in Canada. The company mines for diamonds. Its principal asset is the HOAM project that consist of 2 prospecting permits covering an area of approximately 90,927 acres located in the Mackenzie Region, Northwest Territories, Canada. The company was incorporated in 2000 and is headquartered in Jasper East, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Jasper East"}, "ORAGF": {"short_name": "MONARCA MINERALS INC", "long_name": "Monarca Minerals Inc.", "summary": "Monarca Minerals Inc. engages in the acquisition, exploration, and development of silver properties in Mexico. Its flagship property is the Tejamen silver property consisting of 23 mineral concessions covering an area of approximately 1,685 hectares located to the northwest of Durango. It also has an option agreement to acquire a 100% interest in the San Jose Project covering approximately an area of 5,580 hectares located in Chihuahua, northern Mexico. The company was formerly known as Oremex Silver Inc. and changed its name to Monarca Minerals Inc. in August 2016. Oremex Silver Inc. was incorporated in 1995 and is based in Toronto, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "ORGN.CN": {"short_name": "OrigenResInc", "long_name": "Origen Resources Inc.", "summary": "Origen Resources Inc., an exploration stage company, engages in the acquisition, exploration, and evaluation of base and precious metal properties in Canada. It holds a property portfolio of four 100% owned precious and base metal projects in southern British Columbia; and a 100% interest in the LGM project that covers an area of 26,771 hectares. The company also holds an option to acquire a 100% interest in the Wishbone property that covers an area of 3,971 hectare located in the Golden Triangle of British Columbia; and an option to acquire a 100% interest in the 7,875 ha Middle Ridge Property located in Newfoundland. Origen Resources Inc. was founded in 2019 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "ORV.TO": {"short_name": "ORVANA MINERALS J", "long_name": "Orvana Minerals Corp.", "summary": "Orvana Minerals Corp., a mining and exploration company, engages in the evaluation, development, and mining of precious and base metal deposits. The company owns and operates the gold, copper, and silver El Valle Mine and CarlÃ©s Mine in the Rio Narcea Gold Belt in northern Spain. It also owns gold and copper concessions in the Don Mario Mine located in Don Mario district in southeastern Bolivia. The company is headquartered in Toronto, Canada. Orvana Minerals Corp. is a subsidiary of Fabulosa Mines Limited.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "ORVMF": {"short_name": "ORVANA MINERALS", "long_name": "Orvana Minerals Corp.", "summary": "Orvana Minerals Corp., a mining and exploration company, engages in the evaluation, development, and mining of precious and base metal deposits. The company owns and operates the gold, copper, and silver El Valle Mine and CarlÃ©s Mine in the Rio Narcea Gold Belt in northern Spain. It also owns gold and copper concessions in the Don Mario Mine located in Don Mario district in southeastern Bolivia. The company is headquartered in Toronto, Canada. Orvana Minerals Corp. is a subsidiary of Fabulosa Mines Limited.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "OSK.TO": {"short_name": "OSISKO MINING INC", "long_name": "Osisko Mining Inc.", "summary": "Osisko Mining Inc., a mineral exploration company, engages in the acquisition, exploration, and development of precious metals resource properties in Canada. The company primarily explores for gold and silver. Its flagship project is the Windfall Lake property that consists of 285 mining claims covering an area of approximately 12,467 hectares located in the Abitibi greenstone belt, Urban Township, Eeyou Istchee James Bay, Quebec. The company was formerly known as Oban Mining Corporation and changed its name to Osisko Mining Inc. in June 2016. Osisko Mining Inc. was incorporated in 2010 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "OWC.F": {"short_name": "METALCORP LTD", "long_name": "MetalCorp Limited", "summary": "MetalCorp Limited, a junior exploration company, engages in the acquisition, exploration, and evaluation of mineral properties in the Northwestern Ontario region of Canada. It explores for gold, copper, zinc, silver, molybdenum, rhenium, platinum, diamond, and base metals. The company has 100% interests in the Hemlo East property, Black Bear Gold property, Big Lake property, Greater North Rock property, Pickle Lake (Gold) property, and River Gold (Gold) and Moly (Molybdenum) property. MetalCorp Limited was founded in 2002 and is based in Thunder Bay, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Thunder Bay"}, "PAN.V": {"short_name": "PANGOLIN DIAMONDS CORP", "long_name": "Pangolin Diamonds Corp.", "summary": "Pangolin Diamonds Corp., together with its subsidiaries, engages in the acquisition, exploration, and development of mineral properties in Botswana. It holds 100% interest in eight diamond properties that include Tsabong North, Jwaneng South, Lorolwane, Mmadinare, Malatswae, Rehoboth, Machaneng South, and Motloutse River properties covering an area of approximately 10,705 square kilometers in Botswana. It also holds interest in Malatswae Diamond Property. The company was incorporated in 2011 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "PERU.V": {"short_name": "CHAKANA COPPER CORP", "long_name": "Chakana Copper Corp.", "summary": "Chakana Copper Corp. engages in the acquisition, exploration, and development of mineral properties. It holds an option to acquire a 100% interest in the Soledad project, a copper, gold, and silver project located in Central Peru. The company is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "PGLD.V": {"short_name": "P2 GOLD INC", "long_name": "P2 Gold Inc.", "summary": "P2 Gold Inc., a junior mining company, engages in the acquisition, exploration, and development of mineral properties in Canada and the United States. It primarily explores for gold, copper, silver, lead, and zinc deposits. The company holds an interest in the Silver Reef project that consists of 17 contiguous mineral tenures covering an area of approximately 23,182.7 hectares; the BAM property, which includes ten mineral tenures that covers an area of approximately 8,100 hectares; and the Todd Creek property consists of 69 mineral tenures covering an area of approximately 32,000 hectares located in northwest British Columbia, Canada. It also holds an interest in the Stockade property consists of 261 unpatented lode mining claims that covers an area of approximately 6,790 acres located in Malheur County; and the Lost Cabin property consists of 106 unpatented lode mining claims covering an area of approximately 2,190 acres, located in Lake County, Oregon. The company was formerly known as Central Timmins Exploration Corp. and changed its name to P2 Gold Inc. in August 2020. P2 Gold Inc. was incorporated in 2017 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "PLA.V": {"short_name": "PLATA LATINA MINERALS CORP", "long_name": "Plata Latina Minerals Corporation", "summary": "Plata Latina Minerals Corporation engages in acquiring, exploring, and evaluating mineral properties in Canada. The company explores for silver and gold properties. Plata Latina Minerals Corporation was incorporated in 2010 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "PLG": {"short_name": "Platinum Group Metals Ltd.", "long_name": "Platinum Group Metals Ltd.", "summary": "Platinum Group Metals Ltd. engages in the acquisition, exploration, and development of platinum and palladium properties. It explores for platinum, palladium, rhodium, gold, ruthenium, iridium, copper, and nickel deposits. The company holds 50.02% interest in the Waterberg project located on the North Limb of the Western Bushveld complex, South Africa. It also develops next-generation battery technology using platinum and palladium. Platinum Group Metals Ltd. was founded in 2000 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "ASE", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "PM3.F": {"short_name": "PANGOLIN DIAMONDS", "long_name": "Pangolin Diamonds Corp.", "summary": "Pangolin Diamonds Corp., together with its subsidiaries, engages in the acquisition, exploration, and development of mineral properties in Botswana. It holds 100% interest in eight diamond properties that include Tsabong North, Jwaneng South, Lorolwane, Mmadinare, Malatswae, Rehoboth, Machaneng South, and Motloutse River properties covering an area of approximately 10,705 square kilometers in Botswana. It also holds interest in Malatswae Diamond Property. The company was incorporated in 2011 and is headquartered in Toronto, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "POUQ.F": {"short_name": "PROSPERO SILVER CORP.", "long_name": "Prospero Silver Corp.", "summary": "Prospero Silver Corp. acquires, explores for, and develops mineral properties. The company was founded in 2008 and is based in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "PPX.V": {"short_name": "PPX MINING CORP", "long_name": "PPX Mining Corp.", "summary": "PPX Mining Corp. engages in acquiring, exploring, and evaluating mineral properties in Peru. The company explores for gold and silver deposits. Its flagship property is the 100% owned Igor project with 4 concessions covering an area of approximately 1,300 hectares located in northern Peru. The company was formerly known as Peruvian Precious Metals Corp. and changed its name to PPX Mining Corp. in August 2016. PPX Mining Corp. was incorporated in 1987 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "PSL-H.V": {"short_name": "PROSPERO SILVER CORP", "long_name": "Prospero Silver Corp.", "summary": "Prospero Silver Corp. acquires, explores for, and develops mineral properties. The company was founded in 2008 and is based in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "QGLDF": {"short_name": "Q-GOLD RESOURCES LTD", "long_name": "Q-Gold Resources Ltd.", "summary": "Q-Gold Resources Ltd. explores for and develops mineral properties in Canada and the United States. It primarily explores for gold, silver, and precious metal deposits. The company owns interests in the Foley gold mine and the McKenzie Gray gold/ silver zone located in Mine Centre, Ontario. It also holds an option agreement to acquire a 100% interest in the Surupana silver property located in central Puno province of southern Peru. The company was formerly known as Q-Gold and changed its name to Q-Gold Resources Ltd. in January 2004. Q-Gold Resources Ltd. was incorporated in 1998 and is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "QGR.V": {"short_name": "Q GOLD RESOURCES LTD", "long_name": "Q-Gold Resources Ltd.", "summary": "Q-Gold Resources Ltd. explores for and develops mineral properties in Canada and the United States. It primarily explores for gold, silver, and precious metal deposits. The company owns interests in the Foley gold mine and the McKenzie Gray gold/ silver zone located in Mine Centre, Ontario. It also holds an option agreement to acquire a 100% interest in the Surupana silver property located in central Puno province of southern Peru. The company was formerly known as Q-Gold and changed its name to Q-Gold Resources Ltd. in January 2004. Q-Gold Resources Ltd. was incorporated in 1998 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "QX9G.F": {"short_name": "Q-GOLD RES", "long_name": "Q-Gold Resources Ltd.", "summary": "Q-Gold Resources Ltd. explores for and develops mineral properties in Canada and the United States. It primarily explores for gold, silver, and precious metal deposits. The company owns interests in the Foley gold mine and the McKenzie Gray gold/ silver zone located in Mine Centre, Ontario. It also holds an option agreement to acquire a 100% interest in the Surupana silver property located in central Puno province of southern Peru. The company was formerly known as Q-Gold and changed its name to Q-Gold Resources Ltd. in January 2004. Q-Gold Resources Ltd. was incorporated in 1998 and is headquartered in Toronto, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "R52.F": {"short_name": "RICHMOND MINERALS", "long_name": "Richmond Minerals Inc.", "summary": "Richmond Minerals Inc. engages in the exploration and development of base and precious metals in northern Ontario and Quebec, Canada. It primarily focuses on the 100% owned Ridley Lake Gold Property, which consists of a 196 contiguous mining claims located in Raney and Rollo Townships, Ontario. The company also holds interests in the Oberzeiring Polymetallic Property that covers an area of approximately 3,000 hectares, which is located near the town of Oberzeiring in the province of Styria. Richmond Minerals Inc. is headquartered in Toronto, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "RAYN.CN": {"short_name": "RaindropVent", "long_name": "Raindrop Ventures Inc.", "summary": "Raindrop Ventures Inc. explores for and develops mineral properties in Canada and the United States. The company explores for silver, gold, and base metal properties. Its principal projects include the Silver Star property, which consists of 4 claims totaling 1,487 hectares located to the Southeast of Houston, British Columbia; and the Clover Mountain property consisting of 43 claims totaling 348 hectares located to the south west of Boise, Idaho. The company was founded in 2018 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "RIINF": {"short_name": "BRAVEHEART RESOURCES INC", "long_name": "Braveheart Resources Inc.", "summary": "Braveheart Resources Inc., an exploration stage company, locates, acquires, and explores for base and precious metals primarily in Canada. The company explores for gold, copper, and silver deposits. Its principal project is Bull River Mine, which is located in the Cranbrook, British Colombia. The company was formerly known as Rainbow Resources Inc. and changed its name to Braveheart Resources Inc. in November 2014. Braveheart Resources Inc. was incorporated in 2009 and is headquartered in Calgary, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Calgary"}, "RJX-A.V": {"short_name": "RJK EXPLORATIONS LTD., CL.A, SV", "long_name": "RJK Explorations Ltd.", "summary": "RJK Explorations Ltd., a mineral exploration company, acquires, explores for, and develops mineral resource properties in Canada. The company primarily explores for diamond, gold, silver, and base metals. It holds interests in the Rolling Pond property that consists of 242 contiguous claims covering 6,050 hectares; and the Bishop Nipissing Diamond property, which covers an area of approximately 2,090 hectares located in Cobalt, Ontario, as well as other properties. The company was founded in 1922 and is headquartered in Kirkland Lake, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Kirkland Lake"}, "RK.V": {"short_name": "ROCKHAVEN RESOURCES LTD.", "long_name": "Rockhaven Resources Ltd.", "summary": "Rockhaven Resources Ltd., an exploration stage company, engages in the acquisition, exploration, and evaluation of mineral properties in Canada. The company primarily explores for precious and base metal deposits. It holds a 100% interest in the Klaza gold-silver property, which consists of 1,478 mineral claims covering an area of 287 square kilometers located in the Whitehorse mining district, Yukon Territory. The company was incorporated in 2005 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "RLYG.V": {"short_name": "RILEY GOLD CORP", "long_name": "Riley Gold Corp.", "summary": "Riley Gold Corp., a precious metals exploration company, engages in the acquisition and exploration of mineral properties in the United States. The company has an option agreement in the East Manhattan Wash property that comprises of 6 unpatented lode mining claims located in Nye County, Nevada. The company was formerly known as Riley Resources Corp. and changed its name to Riley Gold Corp. in October 2020. Riley Gold Corp. was incorporated in 2011 and is based in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "RMD.V": {"short_name": "RICHMOND MINERALS INC.", "long_name": "Richmond Minerals Inc.", "summary": "Richmond Minerals Inc. engages in the exploration and development of base and precious metals in northern Ontario and Quebec, Canada. It primarily focuses on the 100% owned Ridley Lake Gold Property, which consists of a 196 contiguous mining claims located in Raney and Rollo Townships, Ontario. The company also holds interests in the Oberzeiring Polymetallic Property that covers an area of approximately 3,000 hectares, which is located near the town of Oberzeiring in the province of Styria. Richmond Minerals Inc. is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "RRI.V": {"short_name": "RIVERSIDE RESOURCES INC.", "long_name": "Riverside Resources Inc.", "summary": "Riverside Resources Inc., an exploration stage company, engages in the acquisition, exploration, and development of exploration and evaluation assets in North America. The company primarily explores for gold, silver, and copper deposits. It holds interests in the Oakes, Longrose, Pichette, and High Lake Greenstone Belt projects located in Canada; and the La Silla, Sandy, Tajitos, and Ariel projects located in Mexico. Riverside Resources Inc. was founded in 2006 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "RV0.F": {"short_name": "RAINDROP VENTURES INC.", "long_name": "Raindrop Ventures Inc.", "summary": "Raindrop Ventures Inc. explores for and develops mineral properties in Canada and the United States. The company explores for silver, gold, and base metal properties. Its principal projects include the Silver Star property, which consists of 4 claims totaling 1,487 hectares located to the Southeast of Houston, British Columbia; and the Clover Mountain property consisting of 43 claims totaling 348 hectares located to the south west of Boise, Idaho. The company was founded in 2018 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "RVL.V": {"short_name": "REVELO RESOURCES CORP", "long_name": "Revelo Resources Corp.", "summary": "Revelo Resources Corp. acquires and explores for precious and base metals in Chile. The company primarily explores for copper, gold, and silver deposits. It holds 100% interests in the Loro project, which covers an area of 4,800 hectares; Las Pampas project that covers an area of 21,800 hectares; Victoria Sur project covering an area of 6,600 hectares; Orca project covering an area of 5,400 hectares; Montezuma project, which covers an area of 16,300 hectares; Calvario project covering an area of 6,900 hectares; and Mirador project covering an area of 7,700 hectares located in Northern Chile. The company was formerly known as Iron Creek Capital Corp. and changed its name to Revelo Resources Corp. in December 2014. Revelo Resources Corp. was founded in 2003 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "RVSDF": {"short_name": "RIVERSIDE RES INC", "long_name": "Riverside Resources Inc.", "summary": "Riverside Resources Inc., an exploration stage company, engages in the acquisition, exploration, and development of exploration and evaluation assets in North America. The company primarily explores for gold, silver, and copper deposits. It holds interests in the Oakes, Longrose, Pichette, and High Lake Greenstone Belt projects located in Canada; and the La Silla, Sandy, Tajitos, and Ariel projects located in Mexico. Riverside Resources Inc. was founded in 2006 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "S06.F": {"short_name": "SILVER VIPER MINER. CORP.", "long_name": "Silver Viper Minerals Corp.", "summary": "Silver Viper Minerals Corp. engages in the acquisition and exploration of mineral properties in Mexico. The company holds 100% interest in the La Virginia Gold-Silver Project that comprises six mineral concessions covering an area of 35,598 hectares located in Sonora, Mexico. Silver Viper Minerals Corp. was incorporated in 2016 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "SAE.V": {"short_name": "SABLE RESOURCES LTD", "long_name": "Sable Resources Ltd.", "summary": "Sable Resources Ltd. engages in the acquisition, exploration and development of mineral resource properties in Mexico, Argentina, and Peru. The company is involved in the exploration of the San Juan Regional program that includes Don Julio project covering an area of 58,000 hectares (ha) in San Juan Province, Argentina; and the Mexico Regional program, which includes the Margarita, Vinata and El Escarpe projects covering an area of 39,000 ha titled in Mexico. It also holds interest in the Scorpius project located in Peru; and option to acquire 100% interest in the Kirio project covering 2,900 ha located in Peru. The company was formerly known as Calico Silver Mines Ltd. and changed its name to Sable Resources Ltd. in 1978. Sable Resources Ltd. was incorporated in 1962 and is based in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "SBLRF": {"short_name": "SABLE RESOURCES", "long_name": "Sable Resources Ltd.", "summary": "Sable Resources Ltd. engages in the acquisition, exploration and development of mineral resource properties in Mexico, Argentina, and Peru. The company is involved in the exploration of the San Juan Regional program that includes Don Julio project covering an area of 58,000 hectares (ha) in San Juan Province, Argentina; and the Mexico Regional program, which includes the Margarita, Vinata and El Escarpe projects covering an area of 39,000 ha titled in Mexico. It also holds interest in the Scorpius project located in Peru; and option to acquire 100% interest in the Kirio project covering 2,900 ha located in Peru. The company was formerly known as Calico Silver Mines Ltd. and changed its name to Sable Resources Ltd. in 1978. Sable Resources Ltd. was incorporated in 1962 and is based in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "SCTSF": {"short_name": "SCOTTIE RESOURCES CORP", "long_name": "Scottie Resources Corp.", "summary": "Scottie Resources Corp., an exploration stage company, acquires, explores, and evaluates mineral properties in Canada. The company explores for gold, silver, and copper deposits. It holds a 100% interest in the Scottie property that consists of 14 crown granted claims and 2 modified grid system (MGS) claims covering an area of 107 hectares of MGS claims and 213 hectares of crown granted claims; the Ruby Silver property that covers an area of 4,300 hectares; and the Black Hills property, which covers 1,252 hectares located in the Golden Triangle, British Columbia. The company also holds an interest in the Stock property covering 2,506.11 hectares located in the Golden Triangle, British Columbia. In addition, it has an option to acquire 100% interest in the Bow property that covers an area of 471.92 hectares located in the Golden Triangle, British Columbia; the Summit Lake property comprising 1,583 hectares mineral claims; and the Bitter Creek property in 42 mineral claims covering 4,832 hectares. The company was formerly known as Rotation Minerals Ltd. and changed its name to Scottie Resources Corp. in January 2019. The company was incorporated in 2009 and is based in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "SDC.V": {"short_name": "SOLIDUSGOLD INC", "long_name": "SolidusGold Inc.", "summary": "SolidusGold Inc. focuses on the exploration and development of precious and base metals. It holds a 100% interest in the Honeymoon Property, an early stage gold-silver-copper property that comprises four mineral claims totaling approximately 3,415 hectares located on the west side of Adams Lake, British Columbia. The company was formerly known as Mantra Capital Inc. and changed its name to SolidusGold Inc. in September 2014. SolidusGold Inc. was incorporated in 2011 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "SGO.V": {"short_name": "SONORO GOLD CORP", "long_name": "Sonoro Gold Corp.", "summary": "Sonoro Gold Corp., an exploration stage company, engages in the acquisition, exploration, and development of mineral properties in Mexico. It primarily explores for gold and silver. The company holds interest in the San Marcial project covering an area of approximately 1,000 hectares located in Sonora, Mexico. It also has an option to earn a 100% interest in the Cerro Caliche Group of Concessions that covers an area of approximately 1,400 hectares located in the municipality of Cucurpe, Mexico. The company was formerly known as Sonoro Metals Corp. and changed its name to Sonoro Gold Corp. in August 2020. Sonoro Gold Corp. is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "SILV": {"short_name": "SilverCrest Metals Inc.", "long_name": "SilverCrest Metals Inc.", "summary": "SilverCrest Metals Inc. acquires, explores for, and develops precious metal properties in Mexico. It primarily explores for silver and gold properties. The company's principal property is the Las Chispas project that consists of 28 concessions totaling of 1400.96 hectares located in Sonora, Mexico. SilverCrest Metals Inc. was incorporated in 2015 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "ASE", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "SLSSF": {"short_name": "SOLARIS RESOURCES INC", "long_name": "Solaris Resources Inc.", "summary": "Solaris Resources Inc., engages in acquisition, exploration, and development of mineral properties. It focuses on exploring copper, molybdenum, gold, lead, zinc, and silver. The company primarily holds interest in Warintza property covering an area of 26,777 hectares located in southeastern Ecuador. It holds 100% interest in Ricardo property covering an area of 16,000 hectares located in Chile; 75% interest in Tamarugo property covering an area of 5100 hectare located in northern Chile; and holds interest in Capricho project covering an area of 4600 hectares and Paco Orco project covering an area of 4,400 hectares located in Peru. The company was formerly known as Solaris Copper Inc. and changed its name to Solaris Resources Inc. in December 2019. The company was incorporated in 2018 and is based in Vancouver, Canada. Solaris Resources Inc. is a subsidiary of Equinox Gold Corp.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "SLVTF": {"short_name": "SILVER TIGER METALS INC", "long_name": "Silver Tiger Metals Inc.", "summary": "Silver Tiger Metals Inc. engages in the exploration of mineral properties in Mexico. The company primarily explores for gold and silver, as well as for copper, zinc, and lead deposits. It holds a 100% interest in the El Tigre property that covers an area of 28,414 hectares located in Sonora, Mexico. The company was formerly known as Oceanus Resources Corporation and changed its name to Silver Tiger Metals Inc. in May 2020. Silver Tiger Metals Inc. was incorporated in 2010 and is headquartered in Halifax, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Halifax"}, "SMG-H.V": {"short_name": "SIERRA MADRE DEVELOPMENTS INC", "long_name": "Sierra Madre Developments Inc.", "summary": "Sierra Madre Developments Inc. operates as a gold and silver exploration company in Canada. The company was founded in 2009 and is headquartered in Mission, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Mission"}, "SMOFF": {"short_name": "SONORO GOLD CORP", "long_name": "Sonoro Gold Corp.", "summary": "Sonoro Gold Corp., an exploration stage company, engages in the acquisition, exploration, and development of mineral properties in Mexico. It primarily explores for gold and silver. The company holds interest in the San Marcial project covering an area of approximately 1,000 hectares located in Sonora, Mexico. It also has an option to earn a 100% interest in the Cerro Caliche Group of Concessions that covers an area of approximately 1,400 hectares located in the municipality of Cucurpe, Mexico. The company was formerly known as Sonoro Metals Corp. and changed its name to Sonoro Gold Corp. in August 2020. Sonoro Gold Corp. is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "SNLRF": {"short_name": "SENTINEL RESOURCES CORP", "long_name": "Sentinel Resources Corp.", "summary": "Sentinel Resources Corp. engages in the acquisition, evaluation, and exploration of mineral properties in Canada. The company explores for gold, silver, and copper deposits. Its property portfolio includes the Waterloo, Pass, and Little Bear projects in British Columbia, Canada; and the Salama gold project located in Peru. The company also owns silver-focused exploration concessions totaling approximately 38,600 hectares located in New South Wales, Australia. Sentinel Resources Corp. was incorporated in 2018 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "SOC.V": {"short_name": "SONORA GOLD & SILVER CORP.", "long_name": "Sonora Gold & Silver Corp.", "summary": "Sonora Gold & Silver Corp., an exploration stage company, engages in the exploration and development of precious and base metal projects. The company primarily focuses on the exploration of gold and silver mineral properties. It holds interests in the Handeni concession located in Tanzania. The company was formerly known as Mont Blanc Resources and changed its name to Sonora Gold & Silver Corp. in July 2008. Sonora Gold & Silver Corp. was incorporated in 1983 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "SSRSF": {"short_name": "SILVER SANDS RESOURCES CORP", "long_name": "Silver Sands Resources Corp.", "summary": "Silver Sands Resources Corp. engages in the acquisition and exploration of mineral resource properties in Canada. The company holds an option to acquire 51% interest in the Coastal Copper Claim located near Maple Bay area, Stewart district, British Columbia; and holds an option to acquire 100% interest in the Virginia silver project covering an area of 73,411 hectares located in Santa Cruz Province of Argentina, as well as holds interest in Maple Bay property located 60 km south of Stewart BC. The company was formerly known as Golden Opportunity Resources Corp. and changed its name to Silver Sands Resources Corp. in June 2020. Silver Sands Resources Corp. was incorporated in 2018 and is based in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "SSV.V": {"short_name": "SOUTHERN SILVER EXPLORATION COR", "long_name": "Southern Silver Exploration Corp.", "summary": "Southern Silver Exploration Corp., an exploration stage company, engages in the acquisition, exploration, and development of precious/base metal properties in North America. The company explores for gold, silver, copper, lead, and zinc ores. Its flagship property is the Cerro Las Minitas project that comprises 25 concessions totaling approximately 34,415 hectares, which is located in Durango State, Mexico. The company was formerly known as Newcoast Silver Mines Ltd. and changed its name to Southern Silver Exploration Corp. in July 2004. Southern Silver Exploration Corp. is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "SSVFF": {"short_name": "SOUTHERN SILVER EXPLORATION COR", "long_name": "Southern Silver Exploration Corp.", "summary": "Southern Silver Exploration Corp., an exploration stage company, engages in the acquisition, exploration, and development of precious/base metal properties in North America. The company explores for gold, silver, copper, lead, and zinc ores. Its flagship property is the Cerro Las Minitas project that comprises 25 concessions totaling approximately 34,415 hectares, which is located in Durango State, Mexico. The company was formerly known as Newcoast Silver Mines Ltd. and changed its name to Southern Silver Exploration Corp. in July 2004. Southern Silver Exploration Corp. is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "SSVR.V": {"short_name": "SUMMA SILVER CORP", "long_name": "Summa Silver Corp.", "summary": "Summa Silver Corp. engages in the gold and silver exploration business. The company holds a 100% interest in the Hughes Property consisting of 57 patented mining claims and 103 un-patented mining claims with an area of 2,547 acres located in central Nevada. It also has an option to earn a 100% interest in the Mogollon Property located in New Mexico. The company was formerly known as Pinnacle North Gold Corp. and changed its name to Summa Silver Corp. in April 2020. Summa Silver Corp. was incorporated in 2018 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "SSVRF": {"short_name": "SUMMA SILVER CORP", "long_name": "Summa Silver Corp.", "summary": "Summa Silver Corp. engages in the gold and silver exploration business. The company holds a 100% interest in the Hughes Property consisting of 57 patented mining claims and 103 un-patented mining claims with an area of 2,547 acres located in central Nevada. It also has an option to earn a 100% interest in the Mogollon Property located in New Mexico. The company was formerly known as Pinnacle North Gold Corp. and changed its name to Summa Silver Corp. in April 2020. Summa Silver Corp. was incorporated in 2018 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "SUNPF": {"short_name": "SUN PEAK METALS CORP", "long_name": "Sun Peak Metals Corp.", "summary": "Sun Peak Metals Corp., a junior mining company, focuses on the exploration and discovery of gold and copper deposits. Its flagship project is the Shire project that comprises four exploration licenses, including Nefasit, Adi Dairo, Terer, and Meli covering approximately 900 square kilometers located in northern Ethiopia. The company was incorporated in 2016 and is headquartered in White Rock, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "White Rock"}, "SWLF.V": {"short_name": "SILVER WOLF EXPLORATION LTD", "long_name": "Silver Wolf Exploration Ltd.", "summary": "Silver Wolf Exploration Ltd., an exploration stage company, engages in the exploration and development of mineral properties in Canada. It holds interest in the Silver Stream property covering an area of 632 hectares located in the Lillooet mining district of British Columbia. The company also holds interest in the Ana Maria property that consists of 9 mining concessions covering an area of 2,549 hectares located in the municipality of GÃ³mez Palacio, Mexico; and El Laberinto Project that covers an area of 91.7 hectares located in the municipality of Panuco de Coronad. The company was formerly known as Gray Rock Resources Ltd. and changed its name to Silver Wolf Exploration Ltd. in October 2020. Silver Wolf Exploration Ltd. was incorporated in 1950 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "SWYDF": {"short_name": "STORNOWAY DIAMOND CORPORATION", "long_name": "Stornoway Diamond Corporation", "summary": "Stornoway Diamond Corporation engages in the mining, acquisition, and exploration of diamond properties in Canada. Its principal project is the Renard mine located in north-central Quebec. The company was founded in 1986 and is headquartered in Longueuil, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Longueuil"}, "TAI.CN": {"short_name": "TalmoraDiamond", "long_name": "Talmora Diamond Inc.", "summary": "Talmora Diamond Inc. explores for and evaluates mineral exploration properties in Canada. The company primarily explores for diamonds. It holds interests in Horton River project consisting of five prospecting permits covering 142,118.28 hectares and 30 claims covering 2,570.88 hectares on the Horton River area, south of Paulatuk in the Northwest Territories. The company was incorporated in 1996 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "TARSF": {"short_name": "ALIANZA MINERALS LTD", "long_name": "Alianza Minerals Ltd.", "summary": "Alianza Minerals Ltd., an exploration stage company, acquires and explores mineral properties. The company explores for gold, copper, silver, zinc, molybdenum, and lead deposits. It holds interests in the properties located in Nevada, the United States; Yukon and British Columbia, Canada; and Peru. The company was formerly known as Tarsis Resources Ltd. and changed its name to Alianza Minerals Ltd. in April 2015. Alianza Minerals Ltd. was incorporated in 2005 and is based in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "TBX.V": {"short_name": "TURMALINA METALS CORP", "long_name": "Turmalina Metals Corp.", "summary": "Turmalina Metals is a TSXV-listed exploration company focused on developing our portfolio of high grade gold-copper-silver-molybdenum projects in South America. Our focus is on tourmaline breccias, a deposit style overlooked by many explorers. Turmalina Metals is led by a team responsible for multiple gold-copper molybdenum discoveries who are highly experienced in this deposit style. Our projects are characterized by open high-grade mineralization on established mining licenses that present compelling drill targets. The principle project held by Turmalina is the San Francisco project in San Juan, Argentina. For further information on the San Francisco Project, refer to the technical report entitled \"NI43-101 Technical Report San Francisco Copper Gold Project, San Juan Province, Argentina\" dated November 17, 2019 under the Corporation's profile at www.sedar.com.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "TBXXF": {"short_name": "TURMALINA METALS CORP", "long_name": "Turmalina Metals Corp.", "summary": "Turmalina Metals is a TSXV-listed exploration company focused on developing our portfolio of high grade gold-copper-silver-molybdenum projects in South America. Our focus is on tourmaline breccias, a deposit style overlooked by many explorers. Turmalina Metals is led by a team responsible for multiple gold-copper molybdenum discoveries who are highly experienced in this deposit style. Our projects are characterized by open high-grade mineralization on established mining licenses that present compelling drill targets. The principle project held by Turmalina is the San Francisco project in San Juan, Argentina. For further information on the San Francisco Project, refer to the technical report entitled \"NI43-101 Technical Report San Francisco Copper Gold Project, San Juan Province, Argentina\" dated November 17, 2019 under the Corporation's profile at www.sedar.com.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "TEUTF": {"short_name": "TEUTON RESOURCES CORP", "long_name": "Teuton Resources Corp.", "summary": "Teuton Resources Corp., an exploration stage company, acquires, explores for, and deals in mineral properties in the province of British Columbia, Canada. The company explores for gold, silver, and copper deposits. It holds interests in various properties in the Skeena Mining Division, British Columbia; Roman Property in New Westminster Mining Division, British Columbia; and Yellow Chris Property in Liard Mining Division, British Columbia. Teuton Resources Corp. was founded in 1981 and is headquartered in Victoria, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Victoria"}, "TFE1.F": {"short_name": "TEUTON RES CORP.", "long_name": "Teuton Resources Corp.", "summary": "Teuton Resources Corp., an exploration stage company, acquires, explores for, and deals in mineral properties in the province of British Columbia, Canada. The company explores for gold, silver, and copper deposits. It holds interests in various properties in the Skeena Mining Division, British Columbia; Roman Property in New Westminster Mining Division, British Columbia; and Yellow Chris Property in Liard Mining Division, British Columbia. Teuton Resources Corp. was founded in 1981 and is headquartered in Victoria, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Victoria"}, "TGX.V": {"short_name": "TRUE NORTH GEMS INC", "long_name": "True North Gems Inc.", "summary": "True North Gems Inc. engages in the acquisition, exploration, and development of mineral properties. The company has an option to acquire up to a 70% working interest in the True Blue rare earth element property comprising 300 claims located to the south of Ross River, Yukon. True North Gems Inc. was founded in 2001 and is based in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "TNO-H.V": {"short_name": "TERRENO RESOURCES CORP", "long_name": "Terreno Resources Corp.", "summary": "Terreno Resources Corp. engages in the acquisition, exploration, and development of mineral properties. It has an option to acquire a 60% interest in the Las Cucharas gold and silver project consisting of 17 concessions covering an area of approximately 4,445 hectares located in Mexico. The company was formerly known as Mega Moly Inc. and changed its name to Terreno Resources Corp. in August 2010. Terreno Resources Corp. was incorporated in 1995 and is based in Toronto, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "TRS.V": {"short_name": "TRES OR RESOURCES LTD", "long_name": "Tres-Or Resources Ltd.", "summary": "Tres-Or Resources Ltd., a resource company, engages in the exploration and development of mineral properties in Canada. The company explores for gold, diamond, cobalt, sliver, and base metal properties. Its flagship project is Fontana Gold Project that covers an area of 8,700 hectares located in Duverny Township, Quebec. The company is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "TSDRF": {"short_name": "TSODILO RESOURCES LIMITED", "long_name": "Tsodilo Resources Limited", "summary": "Tsodilo Resources Limited, an exploration stage company, acquires, explores, and develops mineral properties in the Republic of Botswana. It explores for diamond, and base and precious metals. The company owns 100% interests in the Gcwihaba project comprising 7 base, precious, platinum group, and rare earth metal prospecting licenses located in the North-West District of Botswana; and BK16 kimberlite project located in the Orapa Kimberlite Field in Botswana. It also holds an interest in the gold and silver exploration license located in the Barberton area of South Africa. The company was formerly known as Trans Hex International Ltd. and changed its name to Tsodilo Resources Limited in April 2002. Tsodilo Resources Limited was incorporated in 1995 and is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "TUF.V": {"short_name": "HONEY BADGER SILVER INC", "long_name": "Honey Badger Silver Inc.", "summary": "Honey Badger Silver Inc. acquires, explores for, and develops mineral properties in Canada. The company primarily explores for silver, cobalt, gold, zinc, lead, diamond, and barite deposits. Its flagship project is the Thunder Bay Polymetallic Silver Project covering an area of 37,850 hectares located in norther Ontario. The company was formerly known as Honey Badger Exploration Inc. and changed its name to Honey Badger Silver Inc. in November 2020. Honey Badger Silver Inc. was founded in 1992 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "TUO.V": {"short_name": "TEUTON RESOURCES CORP", "long_name": "Teuton Resources Corp.", "summary": "Teuton Resources Corp., an exploration stage company, acquires, explores for, and deals in mineral properties in the province of British Columbia, Canada. The company explores for gold, silver, and copper deposits. It holds interests in various properties in the Skeena Mining Division, British Columbia; Roman Property in New Westminster Mining Division, British Columbia; and Yellow Chris Property in Liard Mining Division, British Columbia. Teuton Resources Corp. was founded in 1981 and is headquartered in Victoria, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Victoria"}, "TZO.F": {"short_name": "TSODILO RESOURCES LTD", "long_name": "Tsodilo Resources Limited", "summary": "Tsodilo Resources Limited, an exploration stage company, acquires, explores, and develops mineral properties in the Republic of Botswana. It explores for diamond, and base and precious metals. The company owns 100% interests in the Gcwihaba project comprising 7 base, precious, platinum group, and rare earth metal prospecting licenses located in the North-West District of Botswana; and BK16 kimberlite project located in the Orapa Kimberlite Field in Botswana. It also holds an interest in the gold and silver exploration license located in the Barberton area of South Africa. The company was formerly known as Trans Hex International Ltd. and changed its name to Tsodilo Resources Limited in April 2002. Tsodilo Resources Limited was incorporated in 1995 and is headquartered in Toronto, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "US8A.F": {"short_name": "MCEWEN MINING INC.", "long_name": "McEwen Mining Inc.", "summary": "McEwen Mining Inc. engages in the exploration, development, production, and sale of gold and silver in the United States, Canada, Mexico, and Argentina. The company explores for copper deposits. It owns 100% interests in the El Gallo and Fenix projects located in Mexico; and the Black Fox Mine and Stock Mill, Grey Fox, and Froome and Tamarack properties in Canada. The company also owns interests in the Fuller, Davidson-Tisdale, Buffalo Ankerite, and Paymaster exploration properties located in Canada; and a 49% interest in the San JosÃ© mine located in Argentina. In addition, it owns 100% interests in the Gold Bar and Tonkin properties located in Eureka County, Nevada; and interests in the Los Azules copper project located in the cordilleran region in the province of San Juan, Argentina. The company was formerly known as US Gold Corporation and changed its name to McEwen Mining Inc. in January 2012. McEwen Mining Inc. was founded in 1979 and is headquartered in Toronto, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "VIPR.V": {"short_name": "SILVER VIPER MINERALS CORP", "long_name": "Silver Viper Minerals Corp.", "summary": "Silver Viper Minerals Corp. engages in the acquisition and exploration of mineral properties in Mexico. The company holds 100% interest in the La Virginia Gold-Silver Project that comprises six mineral concessions covering an area of 35,598 hectares located in Sonora, Mexico. Silver Viper Minerals Corp. was incorporated in 2016 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "VIPRF": {"short_name": "SILVER VIPER MINERALS CORP", "long_name": "Silver Viper Minerals Corp.", "summary": "Silver Viper Minerals Corp. engages in the acquisition and exploration of mineral properties in Mexico. The company holds 100% interest in the La Virginia Gold-Silver Project that comprises six mineral concessions covering an area of 35,598 hectares located in Sonora, Mexico. Silver Viper Minerals Corp. was incorporated in 2016 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "VLMGF": {"short_name": "VISCOUNT MINING CORPORATION", "long_name": "Viscount Mining Corp.", "summary": "Viscount Mining Corp. explores for and evaluates mineral properties in the United States. It explores for gold, silver, precious, and base metals. The company's flagship property is the Silver Cliff project that consists of 96 lode claims located in Colorado. It also holds a 100% interest in the Cherry Creek project comprising 9,000 acres situated in White Pine County, Nevada. The company was incorporated in 2011 and is headquartered in North Vancouver, Canada.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "North Vancouver"}, "VML.V": {"short_name": "VISCOUNT MINING CORP", "long_name": "Viscount Mining Corp.", "summary": "Viscount Mining Corp. explores for and evaluates mineral properties in the United States. It explores for gold, silver, precious, and base metals. The company's flagship property is the Silver Cliff project that consists of 96 lode claims located in Colorado. It also holds a 100% interest in the Cherry Creek project comprising 9,000 acres situated in White Pine County, Nevada. The company was incorporated in 2011 and is headquartered in North Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "North Vancouver"}, "VTJ1.F": {"short_name": "NORTH ARROW MINERALS", "long_name": "North Arrow Minerals Inc.", "summary": "North Arrow Minerals Inc. engages in the acquisition and exploration of diamond properties in Canada. It primarily holds interests in the Naujaat, Mel, and Luxx projects located in Nunavut; the Pikoo project located in Saskatchewan; and the Loki and Lac de Gras projects located in Northwest Territories. The company is based in Vancouver, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "WRI.V": {"short_name": "WASECO RESOURCES INC", "long_name": "Waseco Resources Inc.", "summary": "Waseco Resources Inc., an exploration stage company, engages in the acquisition and exploration of mineral properties. It mainly explores for gold deposit. The company holds interest in the Battle Mountain Ridge project with 29 claims located in Lander County, Nevada. It also holds interests in exploration prospects located in Quebec, Canada; and holds 5% interest in a diamond exploration project located in the Attawapiskat region of Northern Ontario. Waseco Resources Inc. is based in Toronto, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "WSE.F": {"short_name": "WASECO RESOURCES INC.", "long_name": "Waseco Resources Inc.", "summary": "Waseco Resources Inc., an exploration stage company, engages in the acquisition and exploration of mineral properties. It mainly explores for gold deposit. The company holds interest in the Battle Mountain Ridge project with 29 claims located in Lander County, Nevada. It also holds interests in exploration prospects located in Quebec, Canada; and holds 5% interest in a diamond exploration project located in the Attawapiskat region of Northern Ontario. Waseco Resources Inc. is based in Toronto, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "XGC.V": {"short_name": "XALI GOLD CORP", "long_name": "Xali Gold Corp.", "summary": "Xali Gold Corp., together with its subsidiaries, engages in the exploration and development of mineral properties in Mexico and Peru. Its principal asset is the El Oro gold-silver property located in Mexico. The company has an agreement with Magellan Acquisition Corp. to earn up to a 100% interest in the San Dieguito de Arriba beneficiation plant and take over their rights to a lease agreement on the El Dorado Property located in Nayarit State, Mexico. The company was formerly known as Candente Gold Corp. and changed its name to Xali Gold Corp. in January 2021. Xali Gold Corp. was founded in 2009 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "XIA.V": {"short_name": "XIANA MINING INC", "long_name": "Xiana Mining Inc.", "summary": "Xiana Mining Inc., a natural resource company, engages in the acquisition, exploration, development, and production of mineral properties. The company mainly produces copper, silver, and gold concentrates. It holds 100% ownership of Minera Altos de Punitaqui, which comprises four producing copper-gold mines and covers an area of 11,838 hectares in Region IV, Chile. The company was formerly known as Dorato Resources Inc. and changed its name to Xiana Mining Inc. in October 2013. Xiana Mining Inc. was incorporated in 1981 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "XPLR.V": {"short_name": "XPLORE RESOURCES CORP", "long_name": "Xplore Resources Corp.", "summary": "Xplore Resources Corp., a mining exploration company, focuses on the acquisition and development of copper and gold projects in the Americas. It holds 100% interest in the Valk project covering an area of 1,614 hectare located in British Columbia, Canada. The company is based in Toronto Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "XTR.F": {"short_name": "X-TERRA RES INC.", "long_name": "X-Terra Resources Inc.", "summary": "X-Terra Resources Inc., an exploration stage company, acquires, explores, and develops mining, and oil and gas properties in Canada. It explores for gold, copper, silver, and nickel deposits. The company holds 100% interests in the Troilus East property located in north central QuÃ©bec, Canada; and the Ducran property comprising of 75 mining claims covering an area of 4160 hectares situated in QuÃ©bec, Canada. It also holds an option to acquire 70% interest in the Grog and Northwest property that consists of 38 claims covering an area of 28,000 hectares located in north eastern New Brunswick, Canada, as well holds interests in the Veronneau property situated in the sub province of Opatica and Nemiscau. The company was incorporated in 2013 and is headquartered in Rouyn-Noranda, Canada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Rouyn-Noranda"}, "XTT.V": {"short_name": "X TERRA RESOURCES INC", "long_name": "X-Terra Resources Inc.", "summary": "X-Terra Resources Inc., an exploration stage company, acquires, explores, and develops mining, and oil and gas properties in Canada. It explores for gold, copper, silver, and nickel deposits. The company holds 100% interests in the Troilus East property located in north central QuÃ©bec, Canada; and the Ducran property comprising of 75 mining claims covering an area of 4160 hectares situated in QuÃ©bec, Canada. It also holds an option to acquire 70% interest in the Grog and Northwest property that consists of 38 claims covering an area of 28,000 hectares located in north eastern New Brunswick, Canada, as well holds interests in the Veronneau property situated in the sub province of Opatica and Nemiscau. The company was incorporated in 2013 and is headquartered in Rouyn-Noranda, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Rouyn-Noranda"}}