{
    "0Y8.SG": {
        "short_name": "EcoSynthetix Inc. Registered Sh",
        "long_name": "EcoSynthetix Inc.",
        "summary": "EcoSynthetix Inc., a renewable chemicals company, develops and commercializes bio-based technologies that are used as replacement solutions for synthetic, petrochemical-based adhesives, and other related products in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company offers EcoMer biomonomer for use in pressure sensitive adhesives, ink, toner resins, and paints; EcoSphere biolatex, a bio-based latex binder used in paper and paperboard coatings; EcoStix, a family of pressure-sensitive adhesives, which include customizable resin grades and formulated grades; and DuraBind engineered biopolymers that enable manufacturers of building products, such as wood composites to decrease the amount of highly regulated chemicals, including formaldehyde and methyl diphenyl diisocyanate in their formulation. Its products are used in various industries, such as paper and paper board; building materials; adhesives, paints, and coatings; labels and stamps; and personal care products. EcoSynthetix Inc. was founded in 1996 and is headquartered in Burlington, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Canada",
        "city": "Burlington"
    },
    "2S1.F": {
        "short_name": "AIRBOSS OF AMERICA",
        "long_name": "AirBoss of America Corp.",
        "summary": "AirBoss of America Corp., through its subsidiaries, designs, develops, manufactures, and sells rubber compounds and specialty finished products to industrial, automotive, defense, first response, and healthcare markets primarily in Canada and the United States. The company operates through three segments: Rubber Solutions, Engineered Products, and AirBoss Defense Group. The Rubber Solutions segment develops, manufactures custom rubber compounds, calendered and extruded materials, and molded products for use in various applications and industries, including mining, transportation, industrial rubber products, military, automotive, conveyor belting, and oil and gas; and sources chemicals. The Engineered Products segment designs, engineers, manufactures, and sells rubber, synthetic rubber, and rubber-to-metal bonded products that are used to eliminate or control undesired vibration and noise. The AirBoss Defense Group segment develops, manufactures, and sells chemical, biological, radiological, and nuclear protective equipment and related products for military, first response, and healthcare applications. The company was formerly known as IATCO Industries Inc. and changed its name to AirBoss of America Corp. in April 1994. AirBoss of America Corp. is headquartered in Newmarket, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Newmarket"
    },
    "ABSSF": {
        "short_name": "AIRBOSS OF AMERICA CORP",
        "long_name": "AirBoss of America Corp.",
        "summary": "AirBoss of America Corp., through its subsidiaries, designs, develops, manufactures, and sells rubber compounds and specialty finished products to industrial, automotive, defense, first response, and healthcare markets primarily in Canada and the United States. The company operates through three segments: Rubber Solutions, Engineered Products, and AirBoss Defense Group. The Rubber Solutions segment develops, manufactures custom rubber compounds, calendered and extruded materials, and molded products for use in various applications and industries, including mining, transportation, industrial rubber products, military, automotive, conveyor belting, and oil and gas; and sources chemicals. The Engineered Products segment designs, engineers, manufactures, and sells rubber, synthetic rubber, and rubber-to-metal bonded products that are used to eliminate or control undesired vibration and noise. The AirBoss Defense Group segment develops, manufactures, and sells chemical, biological, radiological, and nuclear protective equipment and related products for military, first response, and healthcare applications. The company was formerly known as IATCO Industries Inc. and changed its name to AirBoss of America Corp. in April 1994. AirBoss of America Corp. is headquartered in Newmarket, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Newmarket"
    },
    "ALB.TO": {
        "short_name": "ALLBANC SPLIT BANC CORP II",
        "long_name": "Allbanc Split Corp. II",
        "summary": "Allbanc Split Corp. II is an equity mutual fund launched and managed by Scotiabank Global Banking and Markets. The fund invests in the public equity markets of Canada. It seeks to invest in stocks of companies operating in the banking sector. The fund primarily invests in stocks of the Bank of Montreal, Canadian Imperial Bank of Commerce, National Bank of Canada, The Bank of Nova Scotia, Royal Bank of Canada, and The Toronto-Dominion Bank. It benchmarks the performance of its portfolio against the S&P/TSX 60 Index. Allbanc Split Corp. II was formed on December 7, 2005 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "BOS.TO": {
        "short_name": "AIRBOSS AMERICA J",
        "long_name": "AirBoss of America Corp.",
        "summary": "AirBoss of America Corp., through its subsidiaries, designs, develops, manufactures, and sells rubber compounds and specialty finished products to industrial, automotive, defense, first response, and healthcare markets primarily in Canada and the United States. The company operates through three segments: Rubber Solutions, Engineered Products, and AirBoss Defense Group. The Rubber Solutions segment develops, manufactures custom rubber compounds, calendered and extruded materials, and molded products for use in various applications and industries, including mining, transportation, industrial rubber products, military, automotive, conveyor belting, and oil and gas; and sources chemicals. The Engineered Products segment designs, engineers, manufactures, and sells rubber, synthetic rubber, and rubber-to-metal bonded products that are used to eliminate or control undesired vibration and noise. The AirBoss Defense Group segment develops, manufactures, and sells chemical, biological, radiological, and nuclear protective equipment and related products for military, first response, and healthcare applications. The company was formerly known as IATCO Industries Inc. and changed its name to AirBoss of America Corp. in April 1994. AirBoss of America Corp. is headquartered in Newmarket, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Newmarket"
    },
    "CHE-UN.TO": {
        "short_name": "CHEMTRADE LOGISTICS INCOME FUND",
        "long_name": "Chemtrade Logistics Income Fund",
        "summary": "Chemtrade Logistics Income Fund provides industrial chemicals and services in Canada, the United States, and South America. It operates through Sulphur Products and Performance chemicals (SPPC), Water Solutions and Specialty Chemicals (WSSC), and Electrochemicals (EC) segments. The SPPC segment removes and/or produces merchant, regenerated, and ultra-pure sulphuric acid, sodium hydrosulphite, elemental sulphur, liquid sulphur dioxide, hydrogen sulphide, sodium bisulphite, and sulphides. This segment also offers industrial services, such as processing by-products and waste streams. Its WSSC segment manufactures and markets various inorganic coagulants used in water treatment, including aluminum sulphate, aluminum chlorohydrate, polyaluminum chloride, and ferric sulphate; and a range of specialty chemicals, such as sodium nitrite, potassium chloride, phosphorus pentasulphide, and vaccine adjuvants. The EC segment manufactures and markets sodium chlorate and chlor-alkali products, including caustic soda, chlorine, and hydrochloric acid for the pulp and paper, oil and gas, and water treatment industries. Chemtrade Logistics Income Fund was founded in 2001 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "ECO.TO": {
        "short_name": "ECOSYNTHETIX INC",
        "long_name": "EcoSynthetix Inc.",
        "summary": "EcoSynthetix Inc., a renewable chemicals company, develops and commercializes bio-based technologies that are used as replacement solutions for synthetic, petrochemical-based adhesives, and other related products in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company offers EcoMer biomonomer for use in pressure sensitive adhesives, ink, toner resins, and paints; EcoSphere biolatex, a bio-based latex binder used in paper and paperboard coatings; EcoStix, a family of pressure-sensitive adhesives, which include customizable resin grades and formulated grades; and DuraBind engineered biopolymers that enable manufacturers of building products, such as wood composites to decrease the amount of highly regulated chemicals, including formaldehyde and methyl diphenyl diisocyanate in their formulation. Its products are used in various industries, such as paper and paper board; building materials; adhesives, paints, and coatings; labels and stamps; and personal care products. EcoSynthetix Inc. was founded in 1996 and is headquartered in Burlington, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Burlington"
    },
    "ECSNF": {
        "short_name": "ECOSYNTHETIX INC",
        "long_name": "EcoSynthetix Inc.",
        "summary": "EcoSynthetix Inc., a renewable chemicals company, develops and commercializes bio-based technologies that are used as replacement solutions for synthetic, petrochemical-based adhesives, and other related products in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company offers EcoMer biomonomer for use in pressure sensitive adhesives, ink, toner resins, and paints; EcoSphere biolatex, a bio-based latex binder used in paper and paperboard coatings; EcoStix, a family of pressure-sensitive adhesives, which include customizable resin grades and formulated grades; and DuraBind engineered biopolymers that enable manufacturers of building products, such as wood composites to decrease the amount of highly regulated chemicals, including formaldehyde and methyl diphenyl diisocyanate in their formulation. Its products are used in various industries, such as paper and paper board; building materials; adhesives, paints, and coatings; labels and stamps; and personal care products. EcoSynthetix Inc. was founded in 1996 and is headquartered in Burlington, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Burlington"
    },
    "ETEK": {
        "short_name": "ECO-TEK GROUP INC",
        "long_name": "Eco-Tek Group, Inc.",
        "summary": "Eco-Tek Group, Inc. manufactures and distributes synthetic lubricants, filtration systems, and other products in North America. The company offers synthetic base motor oil, fuel treatment products, engine flush products, synthetic oil stabilizers, bypass and magnetic oil filtration products, hand cleaners, and non-toxic lubricants. Its products are used in cars, vans, sport utility vehicles, light trucks, heavy-duty industrial equipment, commercial and heavy transport vehicles, farm equipment, 4-cylinder lawn and garden equipment, compressors, and generators. The company markets and sells its products under the Eco-Tek brand name through independent sales agents and distributors, as well as through auto centers and oil change businesses. Eco-Tek Group, Inc. was founded in 2005 and is based in Woodbridge, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Woodbridge"
    },
    "FPLSF": {
        "short_name": "5N PLUS INC",
        "long_name": "5N Plus Inc.",
        "summary": "5N Plus Inc. produces and sells engineered materials and specialty chemicals in Europe, Asia, the Americas, and internationally. It operates in two segments, Electronic Materials and Eco-Friendly Materials. The Electronic Materials segment manufactures and sells refined metals, compounds, and alloys, which are primarily used in a range of electronic applications covering various end-markets consisting of security, aerospace, sensing and imaging, renewable energy, and technical materials; and provides recycling services. Its products are associated with various metals, including cadmium, gallium, germanium, indium, and tellurium. The Eco-Friendly Materials segment principally manufactures and sells refined bismuth and bismuth chemicals, low melting-point and optical alloys, and refined selenium and selenium chemicals. Its products are used in the pharmaceutical, animal health, electronics, and industrial applications, as well as in the animal-feed industry. The company also offers semiconductor compounds and wafers; and fine metallic powders. 5N Plus Inc. has a strategic relationship with Microbion Corporation for the development, manufacturing, and commercial drug substance supply of Microbion's new class of antibiotic and antibiofilm drugs. The company is headquartered in Montreal, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Montreal"
    },
    "FSI": {
        "short_name": "Flexible Solutions Internationa",
        "long_name": "Flexible Solutions International Inc.",
        "summary": "Flexible Solutions International Inc., together with its subsidiaries, develops, manufactures, and markets specialty chemicals that slow the evaporation of water in Canada, the United States, and internationally. The company operates in two segments, Energy and Water Conservation Products, and Biodegradable Polymers. The company offers thermal polyaspartates (TPAs) for oilfields to reduce scale and corrosion in various water systems; and for the agricultural industry to reduce fertilizer crystallization before, during, and after application, as well as to prevent crystal formation between fertilizer and minerals present in the soil. It also provides TPAs for irrigation to prevent early plugging of drip irrigation ports, reduce maintenance costs, and lengthen the life of equipment; and TPAs as additives for household laundry detergents, consumer care products, and pesticides. In addition, the company offers nitrogen conservation products for agriculture that slow down nitrogen loss from fields. Further, it provides HEATSAVR, a chemical product for use in swimming pools and spas that forms a thin and transparent layer on the water's surface; and WATERSAVR to reduce water evaporation in reservoirs, potable water storage tanks, livestock watering ponds, aqueducts, canals, and irrigation ditches, as well as for lawn and turf care, and potted and bedding plants. The company is headquartered in Taber, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "ASE",
        "market": "us_market",
        "country": "Canada",
        "city": "Taber"
    },
    "HYPF": {
        "short_name": "HYPOWER FUEL INC",
        "long_name": "Hypower Fuel, Inc.",
        "summary": "Hypower Fuel, Inc., a development stage company, focuses on developing and supplying alternative fuel sources in North America. It specializes in hydrogen production and hydrogen related products. The company developed proprietary technologies to reduce dependence on fossil fuels, as well as to eliminate harmful toxic emissions that threaten environment. Its products include the Hydro Power Pak (HPP), a retrofit hydrogen insertion device for use on tractor trailer rigs, as well as on stationary diesel engines to enhance fuel economy, reduce harmful emissions, and enhance engine performance and horsepower; and Hydrogen Reactor under development to produce hydrogen on board to power a gasoline engine. Hypower Fuel's product portfolio also consists of an interface control module (ICM) to work in either a stand-alone application with an engine's fuel delivery system or in conjunction with the HPP under programming and testing stage for applications in the trucking industry. ICM's capabilities include enhanced horsepower rating, monitoring engine operations, data acquisition, and global positioning systems. The company also developed a manufacturing process to produce an organic diesel fuel lubrication additive, Bio-Lube, for enhancing lubricity to protect diesel fuel injectors and pumps; and replacing hydrocarbon two stroke oils to reduce harmful toxic emissions and provide enhanced lubrication. Hypower Fuel, Inc. was incorporated in 1987 and is headquartered in High River, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "High River"
    },
    "IPD.V": {
        "short_name": "International Parkside Products",
        "long_name": "International Parkside Products Inc.",
        "summary": "International Parkside Products Inc. produces and markets optical, screen cleaning, and eyeglass cleaning products in North America, Europe, Japan and rest of Asia, Russia, Australia, New Zealand, and internationally. The company offers lens and filter cleaning products, computer/smartphone cleaning products, DSLR sensor cleaning products, cleaning kits, and glass cleaning products. Its optical lens cleaning devices include LensPen, PEEPS, DigiKlear, Mini-Pro, Mini-Pro II, MicroPro, Smartphone camera cleaner, Laptop Pro, ScreenKlean, FilterKlear, DSLR Pro Kit, SensorKlear, SensorKlear Loupe Kit, SmartKlear, HunterPro Kits, Outdoor Pro Kits, FogKlear, Photo Pro Kits, Hurricane blower, and Microfiber cloth. The company markets its products through wholesale distributors. International Parkside Products Inc. was incorporated in 1983 and is headquartered in Richmond, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Richmond"
    },
    "IZCFF": {
        "short_name": "INTERNATIONAL ZEOLITE CORP",
        "long_name": "International Zeolite Corp.",
        "summary": "International Zeolite Corp. explores for and develops mineral properties in Canada. It operates in two segments, Exploration and Development, and Retail and Commercial. The company also produces and distributes natural zeolite and zeolite-infused products for agriculture, water treatment, aquaculture, and industrial applications; and develops, markets, and sells industrial commercial products from the production of its properties and supply of raw materials from third party suppliers. It has interests in the Bromley Creek zeolite project, which consists of one mineral lease and four mineral claims covering 1,492.02 hectares located near Princeton, British Columbia; and the Sun Group zeolite project covering an area of 948.935 hectares in British Columbia. The company was formerly known as Canadian Zeolite Corp. and changed its name to International Zeolite Corp. in March 2018. International Zeolite Corp. was incorporated in 1987 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "LBMB.F": {
        "short_name": "NANO ONE MATERIALS",
        "long_name": "Nano One Materials Corp.",
        "summary": "Nano One Materials Corp. engages in the production of high performance cathode materials used in lithium ion batteries in Canada. It serves the energy storage, specialty ceramics, pharmaceutical, semiconductors, aerospace, dental, catalysts, and communications markets. The company has a strategic agreement with Pulead Technology Industry Co., Ltd. to develop, evaluate and optimize scaled-up production of Pulead's lithium iron phosphate cathode materials for use in lithium ion batteries. Nano One Materials Corp. was incorporated in 1987 and is headquartered in Burnaby, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Burnaby"
    },
    "LOOP": {
        "short_name": "Loop Industries, Inc.",
        "long_name": "Loop Industries, Inc.",
        "summary": "Loop Industries, Inc. focuses on depolymerizing waste polyethylene terephthalate (PET) plastics and polyester fibers into base building blocks. It polymerized monomers into virgin-quality PET plastic for use in food-grade plastic packaging, such as water and carbonated soft drinks bottles, and containers for food and other consumer products; and polyester fibers comprising carpets, clothing, and other polyester textile to consumer goods companies. The company is based in Terrebonne, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "city": "Terrebonne"
    },
    "NNO.V": {
        "short_name": "NANO ONE MATERIALS CORP",
        "long_name": "Nano One Materials Corp.",
        "summary": "Nano One Materials Corp. engages in the production of high performance cathode materials used in lithium ion batteries in Canada. It serves the energy storage, specialty ceramics, pharmaceutical, semiconductors, aerospace, dental, catalysts, and communications markets. The company has a strategic agreement with Pulead Technology Industry Co., Ltd. to develop, evaluate and optimize scaled-up production of Pulead's lithium iron phosphate cathode materials for use in lithium ion batteries. Nano One Materials Corp. was incorporated in 1987 and is headquartered in Burnaby, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Burnaby"
    },
    "NNOMF": {
        "short_name": "NANO ONE MATLS CORP",
        "long_name": "Nano One Materials Corp.",
        "summary": "Nano One Materials Corp. engages in the production of high performance cathode materials used in lithium ion batteries in Canada. It serves the energy storage, specialty ceramics, pharmaceutical, semiconductors, aerospace, dental, catalysts, and communications markets. The company has a strategic agreement with Pulead Technology Industry Co., Ltd. to develop, evaluate and optimize scaled-up production of Pulead's lithium iron phosphate cathode materials for use in lithium ion batteries. Nano One Materials Corp. was incorporated in 1987 and is headquartered in Burnaby, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Burnaby"
    },
    "NSLSF": {
        "short_name": "ENSSOLUTIONS GROUP INC",
        "long_name": "Enssolutions Group Inc.",
        "summary": "Enssolutions Group Inc. does not have significant operations. Previously, the company was engaged in manufacturing and distributing organic liquid pine rosin emulsions for the industrial and commercial markets in the United States and Canada. Enssolutions Group Inc. is based in Beamsville, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Beamsville"
    },
    "SYBF": {
        "short_name": "SYNTEC BIOFUEL INC",
        "long_name": "Syntec Biofuel Inc.",
        "summary": "Syntec Biofuel Inc., a renewable energy company, develops and commercializes biofuel technology and processes to convert waste cellulosic biomass into ethanol and other high-value alcohols. It also offers consulting services, including project evaluation, technology assessments, project development and advisory, site selection and evaluation, program management, business development, financial and market analysis, risk management, engineering and construction, and strategy and marketing services. In addition, it offers various biofuels, including ethanol, an alcohol-based fuel; methanol that is used as a fuel and antifreeze, and to make formaldehyde and bio-diesel; butanol, a flammable liquid that is used as a fuel and as an industrial solvent; and propanol, a colorless volatile liquid that is used as a solvent and antiseptic. The company was formerly known as NetCo Investments Inc. and changed its name to Syntec Biofuel Inc. in July 2006. The company was founded in 2000 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "VNP.TO": {
        "short_name": "5N PLUS INC.",
        "long_name": "5N Plus Inc.",
        "summary": "5N Plus Inc. produces and sells engineered materials and specialty chemicals in Europe, Asia, the Americas, and internationally. It operates in two segments, Electronic Materials and Eco-Friendly Materials. The Electronic Materials segment manufactures and sells refined metals, compounds, and alloys, which are primarily used in a range of electronic applications covering various end-markets consisting of security, aerospace, sensing and imaging, renewable energy, and technical materials; and provides recycling services. Its products are associated with various metals, including cadmium, gallium, germanium, indium, and tellurium. The Eco-Friendly Materials segment principally manufactures and sells refined bismuth and bismuth chemicals, low melting-point and optical alloys, and refined selenium and selenium chemicals. Its products are used in the pharmaceutical, animal health, electronics, and industrial applications, as well as in the animal-feed industry. The company also offers semiconductor compounds and wafers; and fine metallic powders. 5N Plus Inc. has a strategic relationship with Microbion Corporation for the development, manufacturing, and commercial drug substance supply of Microbion's new class of antibiotic and antibiofilm drugs. The company is headquartered in Montreal, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Montreal"
    }
}