{
    "000037.SZ": {
        "short_name": "SHENZHEN NANSHAN P",
        "long_name": "Shenzhen Nanshan Power Co., Ltd.",
        "summary": "Shenzhen Nanshan Power Co., Ltd., together with its subsidiaries, produces and sells power and heat. It operates through three segments: Power and Heat Supply, Fuel Oil Trade, and Other Business. The company generates power using gas turbine and waste heat, as well as operates natural gas and cogeneration power plants. It is also involved in the sludge drying activities; the design and operations management of sludge treatment and disposal facilities and engineering; and the provision of environmental pollution control and utilization domain technology development, transfer, and advisory services. In addition, the company offers technical advisory service for the construction projects of gas-steam combined cycle power plant; undertakes the maintenance and overhaul of the operating equipment of gas-steam combined cycle power plant; and imports and exports goods and technologies. Further, it engages in the fuel oil self-supporting or import agent business; trading diesel, lubricating oil, liquefied petroleum gas, natural gas, compressed gas and liquefied gas, and chemical products; the provision of investment, construction, and technical services for liquefied petroleum gas, natural gas, and related facilities; and leasing wharfs and oil depots. Additionally, the company offers fuel oil warehousing, freight transportation, and gas turbine spare parts agency services. Shenzhen Nanshan Power Co., Ltd. was founded in 1990 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518053",
        "website": "http://www.nsrd.com.cn",
        "market_cap": "Small Cap"
    },
    "000040.SZ": {
        "short_name": "TUNGHSU AZURE RENE",
        "long_name": "Tunghsu Azure Renewable Energy Co.,Ltd.",
        "summary": "Tunghsu Azure Renewable Energy Co.,Ltd. provides energy services in China. It operates photovoltaic and wind power stations; and provides smart energy services and clean energy materials, as well as offers ecological management, water environment restoration and operation, soil and mine restoration, and hazardous and solid waste treatment services. The company was formerly known as Baoan Hongji Real Estate Group Co., Ltd. and changed its name to Tunghsu Azure Renewable Energy Co.,Ltd. in July 2016. Tunghsu Azure Renewable Energy Co.,Ltd. was founded in 1950 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.dongxulantian.com",
        "market_cap": "Small Cap"
    },
    "000531.SZ": {
        "short_name": "GUANGZHOU HENGYUN",
        "long_name": "Guangzhou Hengyun Enterprises Holding Ltd",
        "summary": "Guangzhou Hengyun Enterprises Holding Ltd. generates and sells power and heat in China. It operates coal-fired units with a total installed capacity of 1.08 million kilowatts. The company was founded in 1987 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510730",
        "website": "http://www.hengyun.com.cn",
        "market_cap": "Small Cap"
    },
    "000534.SZ": {
        "short_name": "WEDGE INDUSTRIAL C",
        "long_name": "Wedge Industrial Co., Ltd.",
        "summary": "Wedge Industrial Co., Ltd. invests in, develops, sells, and operates real estate properties in China. It also engages in power generation and steam heat supply activities. The company was formerly known as Guangdong Wanze Industrial Co., Ltd. and changed its name to Wedge Industrial Co., Ltd. in May 2013. The company was founded in 1992 and is based in Shantou, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shantou",
        "zipcode": "515041",
        "website": "http://www.wedgeind.com",
        "market_cap": "Small Cap"
    },
    "000543.SZ": {
        "short_name": "AN HUI WENERGY CO",
        "long_name": "An Hui Wenergy Company Limited",
        "summary": "An Hui Wenergy Company Limited produces and supplies electricity and heat in China. The company generates electricity through thermal power, hydropower, nuclear power, and environmental protection power units. It also invests in, develops, and manages high-tech and foreign exchange earning projects; and undertakes power, heat, energy, and related projects, as well as power construction related to the development of raw materials. The company was founded in 1993 and is based in Hefei, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": "230011",
        "website": "http://www.wenergy.cn",
        "market_cap": "Small Cap"
    },
    "000593.SZ": {
        "short_name": "SICHUAN DATONG GAS",
        "long_name": "Sichuan Datong Gas Development Co.,Ltd.",
        "summary": "Sichuan Datong Gas Development Co.,Ltd. engages in the supply and distribution of natural gas through pipelines for households and industrial users in China. It also operates hotels; invests in, develops, and manages properties; and provides interior decoration services. The company is headquartered in Chengdu, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610051",
        "website": "http://www.dtrq.com",
        "market_cap": "Micro Cap"
    },
    "000598.SZ": {
        "short_name": "CHENGDU XINGRONG E",
        "long_name": "Chengdu Xingrong Environment Co., Ltd.",
        "summary": "Chengdu Xingrong Environment Co., Ltd. provides water utilities and environmental services in China. It produces, distributes, and markets tap water; and operates and manages sewage treatment services comprising municipal sewage, rural sewage, and industrial wastewater services. The company also engages in the investment, design, construction, operation management, technical development and consultation, and technical services of reclaimed water-related projects, as well as maintenance and repair of reclaimed water facilities; and sale of reclaimed water. In addition, it is involved in the design, construction, and consulting of water supply and drainage services; and provides pipeline technical services, such as water supply pipeline leakage control engineering, drainage pipeline inspection, repair and cleaning, pressure pipeline leak point positioning, underground pipeline detection, engineering measurement, data test of pipe networks, and other related technical and consultation services. The company operates 8 waterworks, 13 sewage treatment plants, 2 waste-to-energy plants, 2 leachate treatment plants, and 1 sewage sludge treatment plant. The company was formerly known as Chengdu Xingrong Investment Co., Ltd. and changed its name to Chengdu Xingrong Environment Co., Ltd. in June 2015. Chengdu Xingrong Environment Co., Ltd. was founded in 1995 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610041",
        "website": "http://www.cdxrec.com",
        "market_cap": "Mid Cap"
    },
    "000600.SZ": {
        "short_name": "H/JIONTO ENERGY IN",
        "long_name": "Jointo Energy Investment Co., Ltd. Hebei",
        "summary": "Jointo Energy Investment Co., Ltd. Hebei invests in, constructs, operates, and manages energy projects primarily based on electricity production. The company focuses on coal-fired power generation and heating, as well as nuclear power, wind power, hydropower, etc. As of December 31, 2019, it controlled operating installed capacity of 8.15 million kilowatts, controlled installed capacity of 350,000 kilowatts, and equity operating installed capacity of 8.67 million kilowatts. The company was founded in 1994 and is based in Shijiazhuang, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shijiazhuang",
        "zipcode": "050051",
        "website": "http://www.jei.com.cn",
        "market_cap": "Small Cap"
    },
    "000601.SZ": {
        "short_name": "GUANGDONG SHAONENG",
        "long_name": "Guangdong Shaoneng Group Co., Ltd.",
        "summary": "Guangdong Shaoneng Group Co., Ltd. engages in hydropower and biomass power generation activities in China. It has a total installed capacity of approximately 1.03 million kilowatts. The company was founded in 1993 and is headquartered in Shaoguan, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shaoguan",
        "zipcode": null,
        "website": "http://www.shaoneng.com.cn",
        "market_cap": "Small Cap"
    },
    "000605.SZ": {
        "short_name": "BOHAI WATER INDUST",
        "long_name": "Bohai Water Industry Co.,Ltd",
        "summary": "Bohai Water Industry Co.,Ltd engages in water supply and sewage treatment businesses. The company is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "101100",
        "website": "http://www.bohai-water.com",
        "market_cap": "Small Cap"
    },
    "000685.SZ": {
        "short_name": "ZHONGSHAN PUBLIC",
        "long_name": "Zhongshan Public Utilities Group Co.,Ltd.",
        "summary": "Zhongshan Public Utilities Group Co., Ltd. provides environmental protection and water services in China. The company is involved in the urban water supply and sewage treatment activities; urban cleaning, and garbage collection and transportation activities; and waste treatment, leakage treatment, and power generation activities. Its water supply coverage area comprises of approximately 2,000 square kilometers. The company also operates and manages farmers' market; and constructs passenger service hub ports. In addition, it undertakes construction projects, including municipal, construction, decoration, fire, electrical and mechanical, and urban and road lighting projects, as well as installs and reconstructs gas pipeline. Further, the company engages in financial investment businesses. The company was formerly known as Zhongshan Public Utilities Science and Technology Company Limited and changed its name to Zhongshan Public Utilities Group Co., Ltd. in August 2008. Zhongshan Public Utilities Group Co., Ltd. was founded in 1998 and is based in Zhongshan, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhongshan",
        "zipcode": "528403",
        "website": "http://www.zpug.net",
        "market_cap": "Small Cap"
    },
    "000690.SZ": {
        "short_name": "GUANGDONG BAOLIHUA",
        "long_name": "Guangdong Baolihua New Energy Stock Co., Ltd.",
        "summary": "Guangdong Baolihua New Energy Stock Co., Ltd. engages in the power and finance business in China. The company generates power using coal and wind sources. It also provides financial investment services; and constructs houses, as well as provides highway and pavement engineering contracting services. The company is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510623",
        "website": "http://www.baolihua.com.cn",
        "market_cap": "Small Cap"
    },
    "000692.SZ": {
        "short_name": "S/HT THERMAL POWER",
        "long_name": "Shenyang Huitian Thermal Power Co.,Ltd",
        "summary": "Shenyang Huitian Thermal Power Co.,Ltd operates as central heating company in China. It is also involved in the installation of equipment, construction of industrial pipelines, and civil engineering activities. In addition, the company manufactures and installs non-standard structural parts; sells ammonium sulfate; and retails plumbing materials. It operates three branches. The company was formerly known as Shenyang Thermal Power Co., Ltd. and changed its name to Shenyang Huitian Thermal Power Co.,Ltd in January 1997. Shenyang Huitian Thermal Power Co.,Ltd was founded in 1980 and is based in Shenyang, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenyang",
        "zipcode": "110014",
        "website": "http://www.htrd.cn",
        "market_cap": "Small Cap"
    },
    "000695.SZ": {
        "short_name": "TIANJIN BINHAI E&D",
        "long_name": "Tianjin Binhai Energy & Development Co.,Ltd",
        "summary": "Tianjin Binhai Energy & Development Co.,Ltd produces and sells steam, electricity, and related products in China. The company's products are used in heating, non-electric air-conditioning refrigeration, equipment and process heating, disinfection, air purification, automotive, electronics, pharmaceutical, food, chemical, and other industries. The company was formerly known as Tianjin Lighthouse Paint and Coatings Co., Ltd. Tianjin Binhai Energy & Development Co.,Ltd is based in Tianjin, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300457",
        "website": "http://www.binhaienergy.com",
        "market_cap": "Micro Cap"
    },
    "000767.SZ": {
        "short_name": "SHANXI ZHANGZE ELE",
        "long_name": "Jinneng Holding Shanxi Electric Power Co.,LTD.",
        "summary": "Jinneng Holding Shanxi Electric Power Co.,LTD. engages in the production and sale of power and thermal products. It is also involved in the development and sale of fuel, materials, high-tech electricity, and power supplies. The company develops high-parameter, low-energy, low-emission power plants near coal-mines; and constructs two 1000000-kilowatt-class ultra-supercritical coal-fired power projects in Changzhi. It also provides financial and new energy services; and develops 300,000 kilowatts of thermal power plants, as well as downstream electrolytic aluminum and other high-load projects. In addition, the company researches and develops fly ash disposal and utilization; and develops power engineering, high technology, energy saving, coal logistics, and other businesses. The company was founded in 1985 and is headquartered in Taiyuan, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taiyuan",
        "zipcode": "030006",
        "website": "http://www.zhangzepower.com",
        "market_cap": "Small Cap"
    },
    "000791.SZ": {
        "short_name": "GEPIC ENERGY DEVEL",
        "long_name": "GEPIC Energy Development Co., Ltd.",
        "summary": "GEPIC Energy Development Co., Ltd. invests in and develops new energy and hydroelectric renewable energy projects in China. The company also engages in the high-tech research and development; and provision of production and operation related information consulting services. It operates a hydropower plant with a total installed capacity of 1,476,700 kilowatts; a wind power plant with a total installed capacity of 803,500 kilowatts; and a photovoltaic plant with a total installed capacity of 8.6 million kilowatts. The company was formerly known as Northwest Yongxin Chemical Industry Co., Ltd. and changed its name to GEPIC Energy Development Co., Ltd. in December 2012. GEPIC Energy Development Co., Ltd. was founded in 1997 and is based in Lanzhou, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lanzhou",
        "zipcode": "730046",
        "website": "http://www.gepiced.com",
        "market_cap": "Small Cap"
    },
    "000875.SZ": {
        "short_name": "JILIN ELECTRIC POW",
        "long_name": "Jilin Electric Power Co.,Ltd.",
        "summary": "Jilin Electric Power Co.,Ltd. engages in the power generation and heating businesses in China. The company produces, distributes, places, and sells electric power; produces and sells civilian and industrial heat; develops and constructs power stations; and offers after services. It generates electricity from thermal power, wind power, and photovoltaic sources. The company was founded in 1993 and is based in Changchun, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changchun",
        "zipcode": "130022",
        "website": "http://www.spicjl.com",
        "market_cap": "Mid Cap"
    },
    "000899.SZ": {
        "short_name": "JIANGXI GANNENG CO",
        "long_name": "Jiangxi Ganneng Co., Ltd.",
        "summary": "Jiangxi Ganneng Co., Ltd. engages in the generation of thermal and hydro electric power in China. The company has an installed capacity of 1500 MW, including 1400MW of thermal power and 100MW of hydropower. It also provides boiler installation and maintenance services. The company is based in Nanchang, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanchang",
        "zipcode": "330096",
        "website": "http://www.000899.com",
        "market_cap": "Small Cap"
    },
    "000966.SZ": {
        "short_name": "GUODIAN C/EL POWER",
        "long_name": "Guodian Changyuan Electric Power Co., Ltd.",
        "summary": "Guodian Changyuan Electric Power Co., Ltd. engages in the development of electric power, heat, and new energy businesses in China. It generates electricity through thermal, wind, and biomass sources. Guodian Changyuan Electric Power Co., Ltd. was founded in 1995 and is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430066",
        "website": "http://www.cydl.com.cn",
        "market_cap": "Mid Cap"
    },
    "000993.SZ": {
        "short_name": "FUJIAN MINDONG ELE",
        "long_name": "Fujian Mindong Electric Power Limited Company",
        "summary": "Fujian Mindong Electric Power Limited Company generates hydroelectric and wind power in China. It is also involved in the real estate development, hotel operation, finance, shipping, mining, tourism, trade, distribution, power maintenance, and lithium battery businesses. The company was founded in 1998 and is based in Ningde, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningde",
        "zipcode": "352100",
        "website": "http://www.mdep.com.cn",
        "market_cap": "Small Cap"
    },
    "001896.SZ": {
        "short_name": "HENAN YUNENG HLDG",
        "long_name": "Henan Yuneng Holdings Co.,Ltd.",
        "summary": "Henan Yuneng Holdings Co.,Ltd., through its subsidiaries, invests in, develops, generates, and sells electricity in China. The company generates electricity through coal. It also develops and promotes high technology; sells power materials and fly ash; and provides power environmental protection and energy-saving technological transformation services. The company was founded in 1997 and is based in Zhengzhou, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhengzhou",
        "zipcode": "450008",
        "website": "http://www.yuneng.com.cn",
        "market_cap": "Small Cap"
    },
    "002039.SZ": {
        "short_name": "GUIZHOU QIANYUAN P",
        "long_name": "GuiZhou QianYuan Power Co., Ltd.",
        "summary": "GuiZhou QianYuan Power Co., Ltd. engages in the development, construction, and production management of hydropower stations in China. It operates nine large and medium-size hydropower stations with an installed capacity of 3230.5 MW. The company was founded in 1993 and is based in Guiyang, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guiyang",
        "zipcode": "550002",
        "website": "http://www.gzqydl.cn",
        "market_cap": "Small Cap"
    },
    "002479.SZ": {
        "short_name": "ZHEJIANG FUCHUN.EN",
        "long_name": "Zhejiang Fuchunjiang Environmental Thermoelectric Co.,LTD.",
        "summary": "Zhejiang Fuchunjiang Environmental Thermoelectric Co., Ltd. generates and sells electricity and heat in China. It generates power using solid waste and garbage resources. The company was founded in 2003 and is based in Fuyang, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuyang",
        "zipcode": null,
        "website": "http://www.zhefuet.com",
        "market_cap": "Small Cap"
    },
    "002608.SZ": {
        "short_name": "JIANGSU GUOXIN COR",
        "long_name": "Jiangsu Guoxin Corp. Ltd.",
        "summary": "Jiangsu Guoxin Corp. Ltd. provides thermal power and fiduciary services in China. The company engages in the electricity and thermal production, and relevant electricity services. It also provides financial trust services. The company was formerly known as Sainty Marine Corporation Ltd. and changed its name to Jiangsu Guoxin Corp. Ltd. in March 2017. Jiangsu Guoxin Corp. Ltd. was founded in 2003 and is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": null,
        "website": "http://jsgxgf.com",
        "market_cap": "Mid Cap"
    },
    "002700.SZ": {
        "short_name": "XINJIANG HAOYUAN N",
        "long_name": "Xinjiang Haoyuan Natural Gas Co. ,Ltd.",
        "summary": "Xinjiang Haoyuan Natural Gas Co. ,Ltd. engages in the transmission, distribution, and sale of natural gas; and home installation business in China. It operates long-distance gas pipelines, high and medium voltage municipal pipelines, gas stations, and CNG refueling mother station, as well as CNG trucks and tractors. The company was formerly known as Aksu Haoyuan Natural Gas Co., Ltd. And changed its name to Xinjiang Haoyuan Natural Gas Co. ,Ltd. The company was founded in 2006 and is based in Aksu, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Aksu",
        "zipcode": null,
        "website": "http://www.hytrq.com",
        "market_cap": "Micro Cap"
    },
    "002893.SZ": {
        "short_name": "BEIJING HUAYUANYIT",
        "long_name": "Beijing Huayuanyitong Thermal Technology Co., Ltd.",
        "summary": "Beijing Huayuanyitong Thermal Technology Co., Ltd. engages in the heating business in China. It is involved in heating project investment, heating contracting operation, contract energy management, heating and energy-saving technology research and development activities, as well as provides heating management consulting services. The company was founded in 2002 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.huatongreli.com",
        "market_cap": "Small Cap"
    },
    "003035.SZ": {
        "short_name": "CHINA SOUTHERN POW",
        "long_name": "China Southern Power Grid Energy Efficiency&Clean Energy Co.,Ltd.",
        "summary": "China Southern Power Grid Energy Efficiency&Clean Energy Co.,Ltd. provides energy-saving services. The company provides integrated energy-saving services, such as diagnosis, design, transformation, integrated energy project investment, and operation and maintenance for customers energy use. It offers contract energy management services, such as industrial, building, and urban lighting energy efficiency; consulting and engineering services comprising energy saving renovation and consulting; and resource utilization services comprising biomass utilization and agricultural photovoltaic hybrid business. The company was founded in 2010 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510000",
        "website": "http://ny.csg.cn",
        "market_cap": "Mid Cap"
    },
    "003039.SZ": {
        "short_name": "GUANGDONG SHUNKONG",
        "long_name": "Guangdong Shunkong Development Co. Ltd.",
        "summary": "Guangdong Shunkong Development Co. Ltd. engages in the urban water supply business. It also offers solid waste treatment, municipal engineering, environmental testing and management consulting, and domestic garbage and sludge treatment services. The company was founded in 2015 and is based in Foshan, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Foshan",
        "zipcode": null,
        "website": "http://www.gdskfz.com",
        "market_cap": "Mid Cap"
    },
    "0090.HK": {
        "short_name": "PUXING ENERGY",
        "long_name": "Puxing Energy Limited",
        "summary": "Puxing Energy Limited develops, operates, and manages natural gas-fired power plants in Zhejiang province. As of December 31, 2020, it owns five natural gas-fired power plants with a total installed capacity of approximately 687.73W, including 731kW photovoltaic power generation scale; and a heating capacity of approximately 360 tons per hour. The company was formerly known as Puxing Clean Energy Limited and changed its name to Puxing Energy Limited in June 2020. Puxing Energy Limited was incorporated in 2008 and is headquartered in Hangzhou, the People's Republic of China. Puxing Energy Limited is a subsidiary of Puxing International Limited.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310007",
        "website": "http://www.pxcleanenergy.com",
        "market_cap": "Micro Cap"
    },
    "0579.HK": {
        "short_name": "JNCEC",
        "long_name": "Beijing Jingneng Clean Energy Co., Limited",
        "summary": "Beijing Jingneng Clean Energy Co., Limited generates gas-fired power and heat energy, wind power, photovoltaic power, and hydropower in the People's Republic of China. As of December 31, 2019, the company had an installed capacity of 10,861 megawatt (MW), including seven gas-fired power cogeneration plants with 4,702 MW; wind power generation capacity of 2,797 MW; photovoltaic power generation installed capacity of 2,912 MW; and hydropower installed capacity of 450 MW. It sells electricity to local grid companies. It also offers repair and maintenance; investment management; and finance leasing services. The company was formerly known as Beijing Jingneng Energy Technology Investment Co., Ltd. and changed its name to Beijing Jingneng Clean Energy Co., Limited in August 2010. The company was founded in 2010 and is based in Beijing, the People' Republic of China. Beijing Jingneng Clean Energy Co., Limited is a subsidiary of Beijing Energy Holding Co., Ltd.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.jncec.com",
        "market_cap": "Small Cap"
    },
    "0902.HK": {
        "short_name": "HUANENG POWER",
        "long_name": "Huaneng Power International, Inc.",
        "summary": "Huaneng Power International, Inc., together with its subsidiaries, generates and sells electricity and heat to the regional or provincial grid companies in the People's Republic of China and internationally. It is involved in the development, investment, construction, operation, and management of power plants and related projects; and generation, wholesale, and retail of power and other relating utilities. The company generates power from gas turbine, hydro, wind, photovoltaic, biomass, coal, solar, and oil resources. It is also involved in the sale of coal ash and lime; provision of cargo loading and storage, port, warehousing, and conveying services; photovoltaic power generation projects development and construction; and provision of thermal energy and cold energy services, as well as thermal heating services. In addition, the company engages in the repair of power equipment; provision of water supply and transportation services; construction and operation of electricity distribution networks and heating pipe networks; energy supply, energy transmission, and substation project contracting activities; cargo transportation; and port management, investment, and development activities. Further, it is involved in the management of industrial water and waste, as well as provides environment engineering, and information technology and management consulting services. Additionally, it sells raw and processed coal; and provides central heat, and plumbing and pipe installation services, as well as desalinated water. As of December 31, 2020, the company had a controlled generating capacity of 113,357 megawatts and an equity-based installed capacity of 98,948 megawatts. Huaneng Power International, Inc. was incorporated in 1994 and is based in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100031",
        "website": "http://www.hpi.com.cn",
        "market_cap": "Mid Cap"
    },
    "0916.HK": {
        "short_name": "CHINA LONGYUAN",
        "long_name": "China Longyuan Power Group Corporation Limited",
        "summary": "China Longyuan Power Group Corporation Limited generates and sells wind and coal power in the People's Republic of China. It operates through segments, Wind Power and Coal Power. The company designs, develops, constructs, manages, and operates wind and coal power plants. It also operates other power projects, such as thermal, solar, tidal, biomass, and geothermal solar power. In addition, the company is involved in the coal trading business. Further, it manufactures and sells power equipment; provides consulting, maintenance, and training services to wind and other renewable power generation plants; and generates electric power for external power grid companies. The company was formerly known as China Longyuan Electric Power Group Corporation and changed its name to China Longyuan Power Group Corporation Limited in July 2009. The company was founded in 1993 and is headquartered in Beijing, the People's Republic of China. China Longyuan Power Group Corporation Limited is a subsidiary of China Energy Investment Group Co., Ltd.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.clypg.com.cn",
        "market_cap": "Large Cap"
    },
    "0956.HK": {
        "short_name": "CHINA SUNTIEN",
        "long_name": "China Suntien Green Energy Corporation Limited",
        "summary": "China Suntien Green Energy Corporation Limited, together with its subsidiaries, develops and utilizes clean energy in Mainland China. The company operates through three segments: Natural Gas, Wind/Solar Power, and Other. The Natural Gas segment sells natural gas and gas appliances, as well as provides construction and connection services for natural gas pipelines. The Wind/Solar Power segment engages in the development, management, and operation of wind farm and solar power plants; and generates and sells electric power for power grid companies. The Other segment engages in the property leasing business. As of December 31, 2020, the company owned 6 long-distance natural gas transmission pipelines, 18 high-pressure branch pipelines, 30 urban gas projects, 22 distribution stations, 18 gate stations, 7 compressed natural gas (CNG) primary filling stations, 7 CNG secondary filling stations, and 3 liquefied natural gas filling station. It also had wind power consolidated installed capacity of 5,471.95 megawatts (MW), as well as attributable installed capacity of 4,965.90 MW. It also engages in the provision of project investment, investment management, and technical development services; and investment and sale of solar energy appliances. The company was incorporated in 2010 and is headquartered in Shijiazhuang, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shijiazhuang",
        "zipcode": null,
        "website": "http://www.suntien.com",
        "market_cap": "Mid Cap"
    },
    "0991.HK": {
        "short_name": "DATANG POWER",
        "long_name": "Datang International Power Generation Co., Ltd.",
        "summary": "Datang International Power Generation Co., Ltd., together with its subsidiaries, engages in power generation and power plant development activities in the People's Republic of China. The company operates through Power and heat generation, Coal, and Other segments. It generates electricity through various sources, such as coal-fired, thermal, hydro, wind, nuclear, biomass, and solar. As of December 31, 2019, the company managed an installed capacity of approximately 68,278.10 MW. It also engages in heat supply; the import of power related fuel; coal mining and trading; silicon and aluminum smelting; production and sale of alumina; cargo shipping; sale of coal ash and integrated application of solid waste; power plant construction and operation; repair and testing of power equipment; research and development activities; and provision of power related technical services. The company was formerly known as Beijing Datang Power Generation Co., Ltd and changed its name to Datang International Power Generation Co, Ltd. in April 2004. The company was founded in 1994 and is headquartered in Beijing, the People's Republic of China. Datang International Power Generation Co., Ltd. is a subsidiary of China Datang Corporation Limited.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100033",
        "website": "http://www.dtpower.com",
        "market_cap": "Mid Cap"
    },
    "1071.HK": {
        "short_name": "HUADIAN POWER",
        "long_name": "Huadian Power International Corporation Limited",
        "summary": "Huadian Power International Corporation Limited, together with its subsidiaries, engages in the generation and sale of electricity and heat to power grid companies in the People's Republic of China. The company is involved in the construction and operation of power plants, including coal- or gas-fired generating units and various renewable energy projects. It also engages in the production and sale of coal; construction and operation of ports; and sale of mining equipment and components. In addition, the company invests in coal, electricity, and heat industries, as well as power resources; and provides coal mine improvement services. As of December 31, 2020, it had 67 controlled power plants with a total installed capacity of 58,448 MW, including a total of 43,160 MW through coal-fired generating units and 7,340 MW through gas-fired generating units; and 7,948 MW through renewable energy generating units, such as hydro, wind, and solar power. The company was incorporated in 1994 and is based in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.hdpi.com.cn",
        "market_cap": "Mid Cap"
    },
    "1265.HK": {
        "short_name": "TIANJINJINRAN",
        "long_name": "Tianjin Jinran Public Utilities Company Limited",
        "summary": "Tianjin Jinran Public Utilities Company Limited engages in the operation and management of gas pipeline infrastructure, and the sale and distribution of piped gas to industrial and commercial users, and residential users in Mainland China. It operates through five segments: Sales of Piped Gas; Gas Connection; Gas Transportation; Sales of Gas Appliances and Others; and Gas Pipelines Rent. The company also provides piped gas connection services in Tianjin City and Jining, Inner Mongolia; leases pipelines, gas station facilities, and self-owned buildings; transports gas; and sells and installs gas appliances. In addition, it engages in the investment, urban gas operation, import and export, pipeline project, investment consultation, and mining investment activities. The company was formerly known as Tianjin Tianlian Public Utilities Company Limited and changed its name to Tianjin Jinran Public Utilities Company Limited in June 2012. The company is headquartered in Tianjin, the People's Republic of China. Tianjin Jinran Public Utilities Company Limited is a subsidiary of Tianjin Gas Group Company Limited.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": null,
        "website": "http://www.jinrangongyong.com",
        "market_cap": "Micro Cap"
    },
    "1281.HK": {
        "short_name": "LT SMART ENERGY",
        "long_name": "LongiTech Smart Energy Holding Limited",
        "summary": "LongiTech Smart Energy Holding Limited, together with its subsidiaries, engages in the smart energy and public infrastructure construction businesses in the People's Republic of China. The company offers smart energy comprehensive utilization services, which include multi-energy complementation of electricity, heat, and gas; smart operation and maintenance; energy trade; energy efficiency analysis; and consultancy management. It is also involved in the operation of solar power plants; investment and post-construction operation management business; and other clean energy business. The company was formerly known as Long Ji Tai He Holding Limited and changed its name to LongiTech Smart Energy Holding Limited in August 2016. LongiTech Smart Energy Holding Limited was incorporated in 2011 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.longitech.hk",
        "market_cap": "Nano Cap"
    },
    "1430.HK": {
        "short_name": "SUCHUANG GAS",
        "long_name": "Suchuang Gas Corporation Limited",
        "summary": "Suchuang Gas Corporation Limited, an investment holding company, engages in the distribution and sale of piped natural gas to industrial, commercial, and residential users in Mainland China and internationally. It also provides natural gas transmission services; operates as a contractor for the construction and installation of gas pipelines; and constructs and operates natural gas filling stations. As of December 31, 2019, the company operated 5 compressed natural gas (CNG) /liquefied natural gas (LNG) refueling stations, including three stations in Guangyuan; 1 station in Taicang; and 1 station in Suzho; and served 595 commercial and industrial customers, and 250,000 residential customers. In addition, it promotes technologies for nitrogen and carbon dioxide; invests in the upstream asset; and offers technical, consulting, transfer, and development services, as well as sells chemicals. Further, the company is involved in the port facilities, contract energy management, project construction, and industrial investment businesses. Suchuang Gas Corporation Limited was founded in 2002 and is headquartered in Suzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215400",
        "website": "http://www.suchuanggas.com",
        "market_cap": "Micro Cap"
    },
    "1542.HK": {
        "short_name": "TAIZHOU WATER",
        "long_name": "Taizhou Water Group Co., Ltd.",
        "summary": "Taizhou Water Group Co., Ltd. engages in supplying municipal, tap, and raw water in Mainland China. It is also involved in installation of water pipelines. The company was founded in 1993 and is headquartered in Taizhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Taizhou",
        "zipcode": "318020",
        "website": "http://www.zjtzwater.com",
        "market_cap": "Micro Cap"
    },
    "1635.HK": {
        "short_name": "DZUG",
        "long_name": "Shanghai Dazhong Public Utilities(Group) Co.,Ltd.",
        "summary": "Shanghai Dazhong Public Utilities (Group) Co., Ltd., an investment holding company, engages in the piped gas supply and wastewater treatment activities in the People's Republic of China. The company operates four segments: Piped Gas Supply; Wastewater Treatment; Public Infrastructure Projects; and Transportation Services. It sells, distributes, and supplies piped natural gas; constructs and installs gas pipelines; treats wastewater and handles urban wastewater; rents cars, taxies, and tourist cars; and offers freight transport, relocation, liquefied petroleum gas delivery, and tourism services, as well as operates Dazhong Chuxing platform that provides online car hailing services. The company also offers infrastructure investment, construction, operation maintenance, and protection services; public infrastructure project services; and transportation, storage and, postal services, as well as sells gas related products. In addition, it provides financial services, including financial leasing, pre-paid cards, etc.; and scientific research and technological services, as well as invests in venture capital enterprises. Further, the company engages in the municipal road operation; agriculture development; payment; assets management; and financial consultancy activities. It owns approximately 6,826 kilometers of underground pipelines; and 900 operating vehicles. The company was formerly known as Shanghai Pudong Dazhong Taxi Co., Ltd. and changed its name to Shanghai Dazhong Public Utilities (Group) Co., Ltd. in May 2003. The company was founded in 1991 and is based in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200235",
        "website": "http://www.dzug.cn",
        "market_cap": "Small Cap"
    },
    "1671.HK": {
        "short_name": "TIANBAO ENERGY",
        "long_name": "Tianjin Tianbao Energy Co., Ltd.",
        "summary": "Tianjin Tianbao Energy Co., Ltd. generates and supplies power in the People's Republic of China. The company operates through three segments: Electricity Dispatch and Sale, Power Generation and Supply, and Other. It generates and supplies steam, heating, and cooling to industrial and commercial customers; and purchases, dispatches, and sells electricity. The company also provides power facility construction, and industrial facilities operation and maintenance; and trades in electrical components. It operates two back-pressure cogeneration units with a total installed capacity of 30 megawatts. The company was founded in 1992 and is headquartered in Tianjin, the People's Republic of China. Tianjin Tianbao Energy Co., Ltd. is a subsidiary of Tianjin Tianbao Holdings Limited.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300461",
        "website": "http://www.tjtbny.com",
        "market_cap": "Nano Cap"
    },
    "1798.HK": {
        "short_name": "DATANG RENEW",
        "long_name": "China Datang Corporation Renewable Power Co., Limited",
        "summary": "China Datang Corporation Renewable Power Co., Limited, together with its subsidiaries, generates and sells wind power and other renewable power in the People's Republic of China. The company develops, invests in, constructs, and manages wind power and other renewable energy sources, including solar power and biomass. It also engages in the research and development, application, and promotion of low carbon technology; research, sale, testing, and maintenance of renewable energy-related equipment; power generation; and design, construction and installation, repair, and maintenance of domestic and international power projects. In addition, the company provides import and export services for renewable energy equipment and technologies; foreign investments; and renewable energy-related consulting services. As of December 31, 2020, it had consolidated installed capacity of 12,229.52 megawatts (MW), including 11,171.05 MW of wind power installed capacity. The company was formerly known as Datang Chifeng Saihanba Wind Power Generation Co., Ltd. and changed its name to China Datang Corporation Renewable Power Co., Limited in March 2009. The company was founded in 2004 and is headquartered in Beijing, the People's Republic of China. China Datang Corporation Renewable Power Co., Limited is a subsidiary of China Datang Corporation Ltd.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100053",
        "website": "http://www.cdt-re.com",
        "market_cap": "Small Cap"
    },
    "1853.HK": {
        "short_name": "CHUNCHENG HEAT",
        "long_name": "Jilin Province Chuncheng Heating Company Limited",
        "summary": "Jilin Province Chuncheng Heating Company Limited provides heat supply services in the People's Republic of China. The company is involved in the provision, distribution, and transmission of heat; and pipeline connection activities. As of December 31, 2019, its heat service area consisted of approximately 39.5 million square meters. The company also offers engineering construction and maintenance; design, consulting, and feasibility studies related to heating projects; electrical and instrument maintenance and repair services; and supplies biomass heat. It serves approximately 320,000 residential and non-residential users. The company was founded in 1998 and is headquartered in Changchun, China. Jilin Province Chuncheng Heating Company Limited is a subsidiary of Changchun Heating Power (Group) Company Limited.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Changchun",
        "zipcode": null,
        "website": "http://www.cc-tp.com.cn",
        "market_cap": "Micro Cap"
    },
    "1940.HK": {
        "short_name": "CGII HLDGS",
        "long_name": "China Gas Industry Investment Holdings Co. Ltd.",
        "summary": "China Gas Industry Investment Holdings Co., Ltd., an investment holding company, produces and sells industrial gas in the People's Republic of China. The company provides industrial gas products, which include oxygen, nitrogen, argon, hydrogen and carbon dioxide. It primarily engages in the supply of pipeline industrial gas, as well as liquefied industrial gas (LNG) principally to offsite independent third parties through road tanker delivery; and LNG-related business, which includes the supply of LNG and provision of gas transmission services. In addition, the company operates an automobile LNG filling station; and constructs industrial gas projects. It sells its liquefied industrial gas to customers in a range of industries, including medical, shipping, engineering, photovoltaic, food, and automotive. The company was founded in 2004 and is headquartered in Tangshan, China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Tangshan",
        "zipcode": null,
        "website": "http://cgiiholdings.com/web/index.html",
        "market_cap": "Small Cap"
    },
    "200037.SZ": {
        "short_name": "SHENZHEN NANSHAN P",
        "long_name": "Shenzhen Nanshan Power Co., Ltd.",
        "summary": "Shenzhen Nanshan Power Co., Ltd., together with its subsidiaries, produces and sells power and heat. It operates through three segments: Power and Heat Supply, Fuel Oil Trade, and Other Business. The company generates power using gas turbine and waste heat, as well as operates natural gas and cogeneration power plants. It is also involved in the sludge drying activities; the design and operations management of sludge treatment and disposal facilities and engineering; and the provision of environmental pollution control and utilization domain technology development, transfer, and advisory services. In addition, the company offers technical advisory service for the construction projects of gas-steam combined cycle power plant; undertakes the maintenance and overhaul of the operating equipment of gas-steam combined cycle power plant; and imports and exports goods and technologies. Further, it engages in the fuel oil self-supporting or import agent business; trading diesel, lubricating oil, liquefied petroleum gas, natural gas, compressed gas and liquefied gas, and chemical products; the provision of investment, construction, and technical services for liquefied petroleum gas, natural gas, and related facilities; and leasing wharfs and oil depots. Additionally, the company offers fuel oil warehousing, freight transportation, and gas turbine spare parts agency services. Shenzhen Nanshan Power Co., Ltd. was founded in 1990 and is headquartered in Shenzhen, China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518053",
        "website": "http://www.nsrd.com.cn",
        "market_cap": "Small Cap"
    },
    "2281.HK": {
        "short_name": "XINGLU WATER",
        "long_name": "Luzhou Xinglu Water (Group) Co., Ltd.",
        "summary": "Luzhou Xinglu Water (Group) Co., Ltd., an integrated municipal water service provider, together with its subsidiaries, engages in the tap water supply and wastewater treatment businesses in China. It also provides tap water supply related installation and maintenance services; and construction and upgrading services related to tap water supply and wastewater treatment infrastructure. The company owns 10 tap water plants with a daily supply capacity of approximately 491,500 tons; and has a total of 9 wastewater treatment plants with an aggregate wastewater treatment capacity of 301,000 tons per day. It serves urban and rural residents, industrial and commercial users, local governments, and other institutions. The company was founded in 1958 and is headquartered in Luzhou, the People's Republic of China. Luzhou Xinglu Water (Group) Co., Ltd. is a subsidiary of Luzhou City Xinglu Investment Group Co., Ltd.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Luzhou",
        "zipcode": null,
        "website": "http://www.lzss.com",
        "market_cap": "Micro Cap"
    },
    "2688.HK": {
        "short_name": "ENN ENERGY",
        "long_name": "ENN Energy Holdings Limited",
        "summary": "ENN Energy Holdings Limited, an investment holding company, engages in the investment, construction, operation, and management of gas pipeline infrastructures; and integrated energy, and vehicle and ship refueling stations in the People's Republic of China. It operates through Retail Gas Sales Business, Integrated Energy Business, Wholesale of Gas, Construction and Installation, and Value Added Business segments. The company also sells and distributes piped gas, liquefied natural gas, and other multi-energy products; and provides other services in relation to energy supply. In addition, it is involved in the business of energy trading; retail of gas pipelines, and related materials and equipment; transportation of oil products and gas; and sourcing of compressed pipeline gas, as well as wholesale and retail of LNG, CNG, gas equipment, appliances, and others; and provision of financial services. As of December 31, 2020, the company served approximately 23.21 million residential customers and 177,128 commercial/industrial customers. The company was formerly known as XinAo Gas Holdings Limited and changed its name to ENN Energy Holdings Limited in September 2010. ENN Energy Holdings Limited was founded in 1992 and is headquartered in Langfang, China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Langfang",
        "zipcode": "065001",
        "website": "http://www.ennenergy.com",
        "market_cap": "Large Cap"
    },
    "27K.SG": {
        "short_name": "Kangda Intl Environmen.Co.Ltd.R",
        "long_name": "Kangda International Environmental Company Limited",
        "summary": "Kangda International Environmental Company Limited, an investment holding company, engages in the urban water treatment, water environment comprehensive remediation, and rural water improvement businesses in People's Republic of China. Its Urban Water Treatment segment is involved in the design, construction, upgradation, and operation of waste water treatment plants (WTP), reclaimed water treatment plants, sludge treatment plants, and water distribution plants; and the operation and maintenance of waste water treatment facilities entrusted by governments. The company's Water Environment Comprehensive Remediation segment engages in the river harnessing and improvement, foul water body treatment, and sponge city construction. Its Rural Water Improvement segment is involved in the construction and operation of water environment facilities in villages, including waste water treatment, pipeline construction for collecting waste water, and rural living environment activities. The company also constructs municipal infrastructure; invests and manages environmental and public infrastructure projects; develops and sells WTP equipment; develops computer software; and sells water purifying materials. It serves municipal, district, or county level governments, as well as their designees. The company was founded in 1996 and is headquartered in Chongqing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "STU",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": null,
        "website": "http://www.kangdaep.com",
        "market_cap": "Micro Cap"
    },
    "300021.SZ": {
        "short_name": "DAYU WATER-SAVING",
        "long_name": "Dayu Water-saving Group Co., Ltd",
        "summary": "Dayu Water-saving Group Co., Ltd engages in the research and development, manufacture, and sale of water-saving irrigation materials in China and internationally. The company offers internal inlay drip tapes, pressure compensated drip tapes, filter systems, irrigation automatic control systems, PE and PVC pipes, drip irrigation fittings, spray irrigation products, PE and PVC pipe fittings, PP connection fittings, sprinklers, and integrated water-fertilizer irrigation systems. It also provides project design, construction, and servicing of water-saving irrigation projects. The company was founded in 1999 and is based in Tianjin, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "301712",
        "website": "http://www.gsdyjsgs.com",
        "market_cap": "Small Cap"
    },
    "300055.SZ": {
        "short_name": "BEIJING WATER BUSI",
        "long_name": "Beijing Water Business Doctor Co., Ltd.",
        "summary": "Beijing Water Business Doctor Co., Ltd. engages in the industrial and municipal water supply business in China. It is also involved in the provision of sewage treatment, industrial production, sludge treatment, and garbage disposal facilities; sewage solutions for hazardous waste treatment plant; coking wastewater solution; petrochemical wastewater solutions; and provision of energy-saving equipment, as well as environmental protection equipment manufacturing activities. The company was founded in 1998 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100024",
        "website": "http://www.waterbd.cn",
        "market_cap": "Small Cap"
    },
    "300262.SZ": {
        "short_name": "SHANGHAII SAFBON W",
        "long_name": "SafBon Water Service (Holding) Inc.,Shanghai",
        "summary": "SafBon Water Service (Holding) Inc.,Shanghai provides water treatment services in China. The company offers industrial waste water treatment solutions, including lime technology for reclaimed water treatment, membrane bio-reactor technology for reclaimed water treatment, flue gas desulfurization wastewater treatment, zero liquid discharge, and oily water separation technology; municipal water treatment solutions comprising drinking water purification systems and processes, BIOBON process with biological suspending chain aeration system, precoat filtration technology, low impact development system, and sewage treatment for municipal waste water; and membrane and ion exchange solutions, including hi-tower regeneration, power coated, and demineralized water treatment technology. It also provides solid waste treatment solutions, such as hazardous incineration, and the thin film sludge dryer technology; seawater desalination solutions comprising membrane and containerized desalination technology; compressed natural gas (CNG)/liquefied natural gas (LNG) filling stations, LNG gasification stations, natural gas regulation stations, and long distance gas pipelines, as well as combined cooling, heating, and power systems; and sea water flue gas desulfurization technology. In addition, the company offers ceramic flat membrane systems, which removes pollutants like particles and microorganisms and produces clear water free from biological and toxic hazards; and dissolved air flotation systems that treats water and waste water. SafBon Water Service (Holding) Inc.,Shanghai is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.safbon.com",
        "market_cap": "Small Cap"
    },
    "300961.SZ": {
        "short_name": "HYNAR WATER GROUP",
        "long_name": "Hynar Water Group Co., Ltd.",
        "summary": "Hynar Water Group Co., Ltd. provides industrial wastewater treatment and water supply services. The company offers investment, design, construction, and operation services for industrial parks, and industrial sewage treatment plants and related supporting pipe networks, as well as drinking water supply facilities. It also provides sludge treatment and disposal system solutions. The company provides industrial wastewater treatment services for the pharmaceutical, printing and dyeing, chemical, and other industries. Hynar Water Group Co., Ltd. was founded in 2001 is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518052",
        "website": "http://www.hainawater.com",
        "market_cap": "Small Cap"
    },
    "3768.HK": {
        "short_name": "DCWT",
        "long_name": "Kunming Dianchi Water Treatment Co., Ltd.",
        "summary": "Kunming Dianchi Water Treatment Co., Ltd., together with its subsidiaries, design, develop, construct, operate, and maintain water supply and wastewater treatment facilities in the People's Republic of China. It operates through Wastewater Treatment, Water Supply, and Others segments. It designs, constructs, operates, and maintains wastewater treatment or water supply facilities under the transfer-operate-transfer and build-operate-transfer concession agreements. The company is also involved in the reclaimed water supply and running water supply; municipal wastewater treatment; water quality testing; provision of logistics and leasing services, and professional training; and manufacture and sale of chemical products. In addition, it provides management, transportation, watershed management, sludge resource utilization, mine restoration, and solid waste treatment and disposal services, as well as engages in thermal production activities. The company was founded in 1989 and is headquartered in Kunming, the People's Republic of China. Kunming Dianchi Water Treatment Co., Ltd. is a subsidiary of Kunming Dianchi Investment Co., Ltd.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Kunming",
        "zipcode": "650000",
        "website": "http://www.kmdcwt.com",
        "market_cap": "Micro Cap"
    },
    "3868.HK": {
        "short_name": "XINYI ENERGY",
        "long_name": "Xinyi Energy Holdings Limited",
        "summary": "Xinyi Energy Holdings Limited, an investment holding company, owns, operates, and manages solar farms in the People's Republic of China. The company operates approximately 16 solar farms with an installed capacity of 1,514 megawatts. It sells electricity to the State grid companies. The company was incorporated in 2015 and is based in Wuhu, the People's Republic of China. Xinyi Energy Holdings Limited is a subsidiary of Xinyi Solar Holdings Limited.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Wuhu",
        "zipcode": null,
        "website": "http://www.xinyienergy.com",
        "market_cap": "Mid Cap"
    },
    "600011.SS": {
        "short_name": "HUANENG POWER INTERNATIONAL INC",
        "long_name": "Huaneng Power International, Inc.",
        "summary": "Huaneng Power International, Inc., together with its subsidiaries, generates and sells electricity and heat to the regional or provincial grid companies in the People's Republic of China and internationally. It is involved in the development, investment, construction, operation, and management of power plants and related projects; and generation, wholesale, and retail of power and other relating utilities. The company generates power from gas turbine, hydro, wind, photovoltaic, biomass, coal, solar, and oil resources. It is also involved in the sale of coal ash and lime; provision of cargo loading and storage, port, warehousing, and conveying services; photovoltaic power generation projects development and construction; and provision of thermal energy and cold energy services, as well as thermal heating services. In addition, the company engages in the repair of power equipment; provision of water supply and transportation services; construction and operation of electricity distribution networks and heating pipe networks; energy supply, energy transmission, and substation project contracting activities; cargo transportation; and port management, investment, and development activities. Further, it is involved in the management of industrial water and waste, as well as provides environment engineering, and information technology and management consulting services. Additionally, it sells raw and processed coal; and provides central heat, and plumbing and pipe installation services, as well as desalinated water. As of December 31, 2020, the company had a controlled generating capacity of 113,357 megawatts and an equity-based installed capacity of 98,948 megawatts. Huaneng Power International, Inc. was incorporated in 1994 and is based in Beijing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100031",
        "website": "http://www.hpi.com.cn",
        "market_cap": "Large Cap"
    },
    "600023.SS": {
        "short_name": "ZHEJIANG ZHENENG ELECTRIC POWER",
        "long_name": "Zhejiang Zheneng Electric Power Co., Ltd.",
        "summary": "Zhejiang Zheneng Electric Power Co., Ltd. engages in thermal power generation business in China. It also provides thermal products, as well as invests and manages gas power and nuclear power projects. The company is based in Hangzhou, China. Zhejiang Zheneng Electric Power Co., Ltd. is a subsidiary of Zhejiang Provincial Energy Group Company Ltd.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310007",
        "website": "http://www.zzepc.com.cn",
        "market_cap": "Mid Cap"
    },
    "600025.SS": {
        "short_name": "HUANENG LANCANG RIVER HYDROPOWE",
        "long_name": "Huaneng Lancang River Hydropower Inc.",
        "summary": "Huaneng Lancang River Hydropower Inc. invests, develops, constructs, operates, and manages hydropower projects in China. The company was founded in 2001 and is based in Kunming, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunming",
        "zipcode": "650214",
        "website": "http://www.hnlcj.cn",
        "market_cap": "Large Cap"
    },
    "600027.SS": {
        "short_name": "HUADIAN POWER INTERNATIONAL COR",
        "long_name": "Huadian Power International Corporation Limited",
        "summary": "Huadian Power International Corporation Limited, together with its subsidiaries, engages in the generation and sale of electricity and heat to power grid companies in the People's Republic of China. The company is involved in the construction and operation of power plants, including coal- or gas-fired generating units and various renewable energy projects. It also engages in the production and sale of coal; construction and operation of ports; and sale of mining equipment and components. In addition, the company invests in coal, electricity, and heat industries, as well as power resources; and provides coal mine improvement services. As of December 31, 2020, it had 67 controlled power plants with a total installed capacity of 58,448 MW, including a total of 43,160 MW through coal-fired generating units and 7,340 MW through gas-fired generating units; and 7,948 MW through renewable energy generating units, such as hydro, wind, and solar power. The company was incorporated in 1994 and is based in Beijing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.hdpi.com.cn",
        "market_cap": "Mid Cap"
    },
    "600098.SS": {
        "short_name": "GUANGZHOU DEVELOPMENT GROUP INC",
        "long_name": "Guangzhou Development Group Incorporated",
        "summary": "Guangzhou Development Group Incorporated engages in the integrated energy business in China. The company generates and sells thermal electricity with an installed capacity of 4,045,800 kilowatts; distributes natural gas through pipeline network; supplies coal; and constructs oil depots. It also generates electricity using wind, waste, biomass, and solar resources, as well as engages in other renewable energy business. Guangzhou Development Group Incorporated was founded in 1997 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.gdg.com.cn",
        "market_cap": "Mid Cap"
    },
    "600101.SS": {
        "short_name": "SICHUAN MINGXING ELECTRIC POWER",
        "long_name": "Sichuan Mingxing Electric Power Co., Ltd.",
        "summary": "Sichuan Mingxing Electric Power Co., Ltd. produces and supplies electricity and water in China. It is also involved in the construction of power transmission and transformation projects, and hydropower projects; provision of equipment installation services; production and supply of natural gas; provision of hotel services; and mineral resources development activities. The company was founded in 1988 and is based in Suining, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suining",
        "zipcode": "629000",
        "website": "http://www.mxdl.com.cn",
        "market_cap": "Small Cap"
    },
    "600116.SS": {
        "short_name": "CHONGQING THREE GORGES WATER CO",
        "long_name": "Chongqing Three Gorges Water Conservancy and Electric Power Co., Ltd.",
        "summary": "Chongqing Three Gorges Water Conservancy and Electric Power Co., Ltd., together with its subsidiaries, primarily engages in the power generation and supply business in China. It owns hydropower stations with an installed capacity of 750,000 kW; and operates 9 110KV substations and 19 35KV substations with total capacity of 1137.05MVA. The company is also involved in the electrical and mechanical equipment installation, maintenance, and commissioning activities. In addition, it operates as an electrical engineering, and urban and road lighting engineering contractor; and constructs water conservancy and hydropower projects. Further, it offers heating and power supply related services. Chongqing Three Gorges Water Conservancy and Electric Power Co., Ltd. was founded in 1929 and is headquartered in Chongqing, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "401121",
        "website": "http://www.cqsxsl.com",
        "market_cap": "Mid Cap"
    },
    "600163.SS": {
        "short_name": "ZHONGMIN ENERGY CO LTD",
        "long_name": "Zhongmin Energy Co., Ltd.",
        "summary": "Zhongmin Energy Co., Ltd. focuses on the development and construction of power generation projects in China. It generates electricity from wind, solar, and other energy sources. The company was formerly known as Nanzhi Co Ltd. and changed its name to Zhongmin Energy Co., Ltd. in December 2015. Zhongmin Energy Co., Ltd. is based in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": "350003",
        "website": "http://www.zhongminenergy.com",
        "market_cap": "Small Cap"
    },
    "600167.SS": {
        "short_name": "LUENMEI QUANTUM CO LTD",
        "long_name": "Luenmei Quantum Co.,Ltd",
        "summary": "Luenmei Quantum Co.,Ltd engages in heat supplying and heat power grid installation businesses in China. It is also involved in enterprise assets management and civil engineering construction operations. The company was formerly known as Luenmei Holding Co., Ltd and changed its name to Luenmei Quantum Co.,Ltd in November 2016. Luenmei Quantum Co.,Ltd is based in Shenyang, China. As on October 25, 2018, Luenmei Quantum Co.,Ltd operates as a subsidiary of Lianzhong New Energy Co., Ltd.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenyang",
        "zipcode": "110168",
        "website": null,
        "market_cap": "Mid Cap"
    },
    "600168.SS": {
        "short_name": "WUHAN SANZHEN INDUSTRY HOLDING ",
        "long_name": "Wuhan Sanzhen Industry Holding Co.,Ltd",
        "summary": "Wuhan Sanzhen Industry Holding Co., Ltd. engages in water production and supply, and sewage treatment activities in China. It is also involved in the construction and operation of tunnels and other infrastructure. The company is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430062",
        "website": "http://www.600168.com.cn",
        "market_cap": "Small Cap"
    },
    "600187.SS": {
        "short_name": "HEILONGJIANG INTERCHINA WATER C",
        "long_name": "Heilongjiang Interchina Water Treatment Co.,Ltd.",
        "summary": "Heilongjiang Interchina Water Treatment Co.,Ltd. engages in the construction and operation of water project in China. The company is involved in the purification and supply of water. It also offers sewage treatment, drainage integration, engineering, and technical services. In addition, the company provides green sustainable energy and project construction services. The company was founded in 1998 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201112",
        "website": "http://www.interchinawater.com",
        "market_cap": "Small Cap"
    },
    "600236.SS": {
        "short_name": "GUANGXI GUIGUAN ELECTRIC POWER ",
        "long_name": "Guangxi Guiguan Electric PowerCo.,Ltd.",
        "summary": "Guangxi Guiguan Electric PowerCo.,Ltd. engages in the generation of electricity in China. As of December 31, 2018, it had an installed capacity of 11.8381 million kilowatts, including 10.26 million kilowatts of hydropower, 1.33 million kilowatts of thermal power, and 281,500 kilowatts of wind power. The company was founded in 1992 and is based in Nanning, China. Guangxi Guiguan Electric PowerCo.,Ltd. is a subsidiary of China Datang Corporation.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanning",
        "zipcode": "530022",
        "website": "http://www.ggep.com.cn",
        "market_cap": "Mid Cap"
    },
    "600290.SS": {
        "short_name": "HUAYI ELECTRIC CO. LTD.",
        "long_name": "Huayi Electric Company Limited",
        "summary": "Huayi Electric Company Limited primarily operates in the electric equipment industry in China and internationally. It produces wind turbine generator systems; outdoor circuit breakers, automatic circuit sectionalizers and reclosers, outdoor load break switches, outdoor disconnect switches, and power transformers; MV and LV switchgears and compact substations; medium voltage switches; low voltage apparatus; meters and relays; current and potential transformers; and power lines and accessories. The company also engages in the measurement and evaluation of wind resources; constructing and operating wind farm projects; and provision of technical advisory services on wind farm construction and operations. In addition, it is involved in the sewage treatment and ecological remediation of contaminated soil, atmospheric environment, solid waste disposal, and ecological engineering and environmental businesses, as well as operates as a small loan company. The company is headquartered in Yueqing, China. Huayi Electric Company Limited is a subsidiary of Huayi Group. Co., Ltd.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yueqing",
        "zipcode": "325600",
        "website": "http://www.heag.com",
        "market_cap": "Micro Cap"
    },
    "600292.SS": {
        "short_name": "SPIC YUANDA ENVIRONMENTAL PROTE",
        "long_name": "Spic Yuanda Environmental-Protection Co., Ltd.",
        "summary": "Spic Yuanda Environmental-Protection Co., Ltd. provides energy conservation and environmental protection services in China and internationally. The company offers environmental engineering, desulfurization and denitrification franchising, nuclear facilities decommissioning and radioactive waste disposal, and sewage treatment and reclaimed water reuse. It also manufactures environmental protection equipment and products; and develops energy-saving technologies. The company was formerly known as CPI Yuanda Environmental Protection (Group) Co., Ltd. and changed its name to Spic Yuanda Environmental-Protection Co., Ltd. in May 2016. Spic Yuanda Environmental-Protection Co., Ltd. was founded in 1994 and is based in Chongqing, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "401122",
        "website": "http://www.zdydep.com",
        "market_cap": "Small Cap"
    },
    "600310.SS": {
        "short_name": "GUANGXI GUIDONG ELECTRIC POWER",
        "long_name": "Guangxi Guidong Electric Power Co., Ltd.",
        "summary": "Guangxi Guidong Electric Power Co., Ltd. together with its subsidiaries, engages in the supply of electric power in China. It is also involved in securities, oil trading, and other activities. As of December 31, 2018, the company had an installed capacity of 377,600 kilowatts. The company was founded in 1998 and is based in Hezhou, China. Guangxi Guidong Electric Power Co., Ltd. is a subsidiary of Guangxi Zhengrun Development Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hezhou",
        "zipcode": "542899",
        "website": "http://www.gdep.com.cn",
        "market_cap": "Small Cap"
    },
    "600323.SS": {
        "short_name": "GRANDBLUE ENVIRONMENT CO LTD",
        "long_name": "Grandblue Environment Co., Ltd.",
        "summary": "Grandblue Environment Co., Ltd. engages in the water supply, sewage treatment, solid waste treatment, and gas supply businesses in China. The company provides water supply services, including water intake, production, and delivery to end-customers; sewage treatment services, such as sewage treatment pipe network maintenance, pumping station management, and sewage treatment plant operation and management; and gas supply services. It also offers solid waste treatment services comprising sanitation cleaning, garbage sorting, garbage collection, garbage transfer, incineration power generation, sanitary landfill, leachate treatment, fly ash treatment, slag treatment, waste treatment, sludge treatment, manure treatment, hazardous waste treatment, etc., as well as domestic and kitchen cooking waste treatment. The company was formerly known as Nanhai Development Co. Ltd. and changed its name to Grandblue Environment Co., Ltd. in December 2013. Grandblue Environment Co., Ltd. was founded in 1992 and is based in Foshan, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Foshan",
        "zipcode": "528200",
        "website": "http://www.grandblue.cn",
        "market_cap": "Mid Cap"
    },
    "600333.SS": {
        "short_name": "CHANGCHUN GAS CO",
        "long_name": "Changchun Gas Co., Ltd.",
        "summary": "Changchun Gas Co., Ltd. provides gas to urban, industrial, commercial, automotive, and other end customers in China. It engages in the storage and transportation of natural gas; and operation of gas pipelines. The company was founded in 1924 and is based in Changchun, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changchun",
        "zipcode": null,
        "website": "http://www.ccrq.com.cn",
        "market_cap": "Small Cap"
    },
    "600396.SS": {
        "short_name": "SHENYANG JINSHAN ENERGY CO LTD",
        "long_name": "Shenyang Jinshan Energy Co., Ltd.",
        "summary": "Shenyang Jinshan Energy Co., Ltd. produces and sells electricity and heat in the Liaoning and Inner Mongolia regions of China. The company was formerly known as Shenyang Jinshan Thermoelectric Co., Ltd. The company was founded in 1998 and is headquartered in Shenyang, China. Shenyang Jinshan Energy Co., Ltd. is a subsidiary of Huadian Jinshan Energy Co., Ltd.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenyang",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "600452.SS": {
        "short_name": "CHONGQING FULING ELECTRIC POWER",
        "long_name": "Chongqing Fuling Electric Power Industrial Co., Ltd.",
        "summary": "Chongqing Fuling Electric Power Industrial Co., Ltd. engages in the power supply business in the Fuling district of Chongqing. The company is based in Chongqing, China. Chongqing Fuling Electric Power Industrial Co., Ltd. operates as a subsidiary of Chongqing Chuandong Electric Power Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "408000",
        "website": "http://www.flepc.com.cn",
        "market_cap": "Small Cap"
    },
    "600461.SS": {
        "short_name": "JIANGXI HONGCHENG ENVIRONMENT C",
        "long_name": "Jiangxi Hongcheng Environment Co.,Ltd.",
        "summary": "Jiangxi Hongcheng Environment Co., Ltd. engages in the production and supply of water in China. It is also involved in the operation of sewage treatment plants. The company was formerly known as Jiangxi Hongcheng Waterworks Co.,Ltd. and changed its name to Jiangxi Hongcheng Environment Co., Ltd. in February 2021. The company is based in Nanchang, China. Jiangxi Hongcheng Environment Co., Ltd. is a subsidiary of Nanchang Waterworks Group Ltd.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanchang",
        "zipcode": "330025",
        "website": "http://www.jxhcsy.com",
        "market_cap": "Small Cap"
    },
    "600483.SS": {
        "short_name": "FUJIAN FUNENG CO LTD",
        "long_name": "Fujian Funeng Co., Ltd.",
        "summary": "Fujian Funeng Co., Ltd, together with its subsidiaries, generates electricity primarily in China. It generates electricity through natural gas, wind, and other diversified sources, as well as operates heat and power generating units. The company has a total installed capacity of 3144 MW. It also produces and sells cotton yarn, PU synthetic leather, PU leather, health materials, environmental protection filter materials, automotive materials, nonwoven, and knitted fabrics. The company is based in Fuzhou, China. Fujian Funeng Co., Ltd is a subsidiary of Fujian Energy Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": "350001",
        "website": "http://www.fjec.com.cn",
        "market_cap": "Mid Cap"
    },
    "600505.SS": {
        "short_name": "SICHUAN XICHANG POWER JOINT STO",
        "long_name": "Sichuan Xichang Electric Power Co.,Ltd.",
        "summary": "Sichuan Xichang Electric Power Co.,Ltd. generates and distributes electric power in Liangshan prefecture, Sichuan province, China. It operates hydro power plants with an installed capacity of 124,800 kilowatts. The company was formerly known as Liangshan Xichang Electric Power Co., Ltd. Sichuan Xichang Electric Power Co.,Ltd. was founded in 1980 and is based in Xichang, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xichang",
        "zipcode": null,
        "website": "http://www.scxcdl.com",
        "market_cap": "Small Cap"
    },
    "600509.SS": {
        "short_name": "XINJIANG TIANFU ENERGY CO LTD",
        "long_name": "Xinjiang Tianfu Energy Co., Ltd.",
        "summary": "Xinjiang Tianfu Energy Co., Ltd. generates and distributes electric power and heat in China. The company also supplies natural gas. It develops and supplies approximately 10 billion kilowatt hours of electric power. The company was formerly known as Xinjiang Tianfu Thermoelectric Co., Ltd. and changed its name to Xinjiang Tianfu Energy Co., Ltd. in July 2014. Xinjiang Tianfu Energy Co., Ltd. was founded in 1999 and is based in Shihezi, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shihezi",
        "zipcode": "832000",
        "website": "http://www.tfny.com",
        "market_cap": "Small Cap"
    },
    "600578.SS": {
        "short_name": "BEIJING JINGNENG POWER CO LTD",
        "long_name": "Beijing Jingneng Power Co., Ltd.",
        "summary": "Beijing Jingneng Power Co., Ltd. generates and distributes electricity in China. It generates electricity from coal and thermal resources. The company is also involved in the steam and heat supply activities. Beijing Jingneng Power Co., Ltd. is based in Beijing, China. Beijing Jingneng Power Co., Ltd. was formerly a subsidiary of Beijing Jingneng Clean Energy Co., Limited.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100025",
        "website": "http://www.jingnengpower.com",
        "market_cap": "Mid Cap"
    },
    "600635.SS": {
        "short_name": "SHANGHAI DAZHONG PUBLIC UTILITI",
        "long_name": "Shanghai Dazhong Public Utilities(Group) Co.,Ltd.",
        "summary": "Shanghai Dazhong Public Utilities (Group) Co., Ltd., an investment holding company, engages in the piped gas supply and wastewater treatment activities in the People's Republic of China. The company operates four segments: Piped Gas Supply; Wastewater Treatment; Public Infrastructure Projects; and Transportation Services. It sells, distributes, and supplies piped natural gas; constructs and installs gas pipelines; treats wastewater and handles urban wastewater; rents cars, taxies, and tourist cars; and offers freight transport, relocation, liquefied petroleum gas delivery, and tourism services, as well as operates Dazhong Chuxing platform that provides online car hailing services. The company also offers infrastructure investment, construction, operation maintenance, and protection services; public infrastructure project services; and transportation, storage and, postal services, as well as sells gas related products. In addition, it provides financial services, including financial leasing, pre-paid cards, etc.; and scientific research and technological services, as well as invests in venture capital enterprises. Further, the company engages in the municipal road operation; agriculture development; payment; assets management; and financial consultancy activities. It owns approximately 6,826 kilometers of underground pipelines; and 900 operating vehicles. The company was formerly known as Shanghai Pudong Dazhong Taxi Co., Ltd. and changed its name to Shanghai Dazhong Public Utilities (Group) Co., Ltd. in May 2003. The company was founded in 1991 and is based in Shanghai, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200235",
        "website": "http://www.dzug.cn",
        "market_cap": "Small Cap"
    },
    "600642.SS": {
        "short_name": "SHENERGY COMPANY LIMITED",
        "long_name": "Shenergy Company Limited",
        "summary": "Shenergy Company Limited engages in the investment, construction, operation, and management of electric power, petroleum, and natural gas units in China. It has installed capacity of equity-participating generator units of 7.27 million KW; and installed capacity of controlled generator units of 6.67 million KW. The company is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201103",
        "website": "http://www.shenergy.net.cn",
        "market_cap": "Mid Cap"
    },
    "600644.SS": {
        "short_name": "LESHAN ELECTRIC POWER",
        "long_name": "Leshan Electric Power Co., Ltd.",
        "summary": "Leshan Electric Power Co., Ltd. operates as a power company in China. It also operates in the natural gas, tap water, hotel, photovoltaic energy, and other fields. The company was founded in 1988 and is based in Leshan, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Leshan",
        "zipcode": "614000",
        "website": "http://www.lsep.com.cn",
        "market_cap": "Small Cap"
    },
    "600674.SS": {
        "short_name": "SICHUAN CHUANTOU ENERGY CO LTD",
        "long_name": "Sichuan Chuantou Energy Co.,Ltd.",
        "summary": "Sichuan Chuantou Energy Co.,Ltd. engages in the hydropower, clean energy development, and railway information system businesses in China. It generates power with an installed capacity of 28.30 million kilowatts. The company was formerly known as Sichuan Chuantou Holding Company Limited and changed its name to Sichuan Chuantou Energy Co.,Ltd. in May 2005. Sichuan Chuantou Energy Co.,Ltd. was founded in 1988 and is headquartered in Chengdu, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610041",
        "website": "http://www.ctny.com.cn",
        "market_cap": "Mid Cap"
    },
    "600681.SS": {
        "short_name": "BESTSUN ENERGY CO LTD",
        "long_name": "Bestsun Energy Co., Ltd.",
        "summary": "Bestsun Energy Co., Ltd. operates in the gas sector. The company sells natural gas and heating energy; and transports gas, as well as provides gas connections and appliances. It operates in the Hebei and Shaanxi provinces, as well as Tianjin, China. The company was formerly known as Wuhan Winowner Group Co., Ltd. and changed its name to Bestsun Energy Co., Ltd. in August 2004. Bestsun Energy Co., Ltd. was founded in 1992 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.bestsungas.com",
        "market_cap": "Small Cap"
    },
    "600719.SS": {
        "short_name": "DALIAN THERMAL POWER CO LTD",
        "long_name": "Dalian Thermal Power Co.,Ltd.",
        "summary": "Dalian Thermal Power Co.,Ltd. generates thermal power and heat in China. The company offers steam, hot water, and heat. It also operates five thermal power plants with a total installed capacity of 328.25 MW; and total heat supply of hot water boilers with 443.2 MW. The company was founded in 2000 and is based in Dalian, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": "116001",
        "website": "http://www.dlrd.com",
        "market_cap": "Micro Cap"
    },
    "600726.SS": {
        "short_name": "HUADIAN ENERGY CO. LTD.",
        "long_name": "Huadian Energy Company Limited",
        "summary": "Huadian Energy Company Limited generates electric power in China. The company generates electric power through thermal sources. It has an installed capacity of 6.15 million kilowatts of thermal power. The company was formerly known as Heilongjiang Electric Power Co. Ltd. and changed its name to Huadian Energy Company Limited in July 2004. Huadian Energy Company Limited was founded in 1993 and is based in Harbin, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Harbin",
        "zipcode": "150001",
        "website": "http://www.hdenergy.com",
        "market_cap": "Small Cap"
    },
    "600744.SS": {
        "short_name": "DATANG HUAYIN ELECTRIC POWER CO",
        "long_name": "DaTang HuaYin Electric Power Co., LTD",
        "summary": "DaTang HuaYin Electric Power Co., Ltd. engages in the production of power in Hunan province and other regions in China. It also develops various power point and non-electric projects. The company's transportation capacity is 6100.5 MW. DaTang HuaYin Electric Power Co., Ltd. was founded in 1993 and is based in Changsha, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": "410007",
        "website": "http://www.hypower.com.cn",
        "market_cap": "Mid Cap"
    },
    "600758.SS": {
        "short_name": "LIAONING ENERGY INDUSTRY CO LTD",
        "long_name": "Liaoning Hongyang Energy Resource Invest Co.,Ltd",
        "summary": "Liaoning Hongyang Energy Resource Invest Co., Ltd engages in bituminous coal mining. The company was founded in 1993 and is based in Shenyang, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenyang",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "600780.SS": {
        "short_name": "SHANXI TOP ENERGY CO",
        "long_name": "Top Energy Company Ltd.Shanxi",
        "summary": "Top Energy Company Ltd.Shanxi operates coal power plants in China. The company was founded in 1992 and is based in Taiyuan, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taiyuan",
        "zipcode": null,
        "website": "http://www.600780.com.cn",
        "market_cap": "Small Cap"
    },
    "600856.SS": {
        "short_name": "ZHONGXING TIANHENG ENERGY TECHN",
        "long_name": "Zhongxing Tianheng Energy Technology (Beijing) Co., Ltd.",
        "summary": "Zhongxing Tianheng Energy Technology (Beijing) Co., Ltd. operates in the natural gas industry in China and internationally. The company produces and sells natural gases, such as CNG and LNG; invests in, constructs, and operates CNG refueling stations and substations, and LNG liquefaction plants and receiving stations; operates LNG storage and distribution stations, and gas supply stations; and develops and operates oil and gas assets internationally. It also engages in the crude oil refining activities. The company was formerly known as Changchun Sinoenergy Corporation and changed its name to Zhongxing Tianheng Energy Technology (Beijing) Co., Ltd. in October 2020. Zhongxing Tianheng Energy Technology (Beijing) Co., Ltd. is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.snencn.cn",
        "market_cap": "Small Cap"
    },
    "600863.SS": {
        "short_name": "INNER MONGOLIA MENGDIAN HN(THE)",
        "long_name": "Inner Mongolia MengDian HuaNeng Thermal Power Corporation Limited",
        "summary": "Inner Mongolia MengDian HuaNeng Thermal Power Corporation Limited engages in electric power generation business. The company is based in Hohhot, China. Inner Mongolia MengDian HuaNeng Thermal Power Corporation Limited operates as a subsidiary of North United Power Corporation.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hohhot",
        "zipcode": null,
        "website": "http://www.nmhdwz.com",
        "market_cap": "Mid Cap"
    },
    "600864.SS": {
        "short_name": "HARBIN HATOU INVESTMENT CO.",
        "long_name": "Harbin Hatou Investment Co.,Ltd",
        "summary": "Harbin Hatou Investment Co.,Ltd. produces and supplies heat and electric power primarily in the People's Republic of China and the Russian Federation. The company operates through Power, Heat, Construction Materials, Real Estate, Forest Cutting, Chemicals, and Construction. It offers cement, network support, wood materials, and fertilizers. The company is also involved in electricity, heat supply, and steam business; and project installation activities. In addition, it engages in energy, mining, real estate, construction, technology, and agricultural investment businesses. The company was formerly known as Harbin Sui Bao Re Dian Co., Ltd. and changed its name to Harbin Hatou Investment Co.,Ltd. in November 2007. Harbin Hatou Investment Co.,Ltd. is headquartered in Harbin, the People's Republic of China. Harbin Hatou Investment Co.,Ltd. is a subsidiary of Harbin Investment Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Harbin",
        "zipcode": "150028",
        "website": null,
        "market_cap": "Mid Cap"
    },
    "600868.SS": {
        "short_name": "GUANGDONG MEIYAN JIXIANG HYDROP",
        "long_name": "Guangdong Meiyan Jixiang Hydropower Co., Ltd.",
        "summary": "Guangdong Meiyan Jixiang Hydropower Co., Ltd. generates hydroelectric power in China. The company operates six hydropower stations with an installed capacity of 151,000 kilowatts. It also offers education services, as well as cement. The company was founded in 1993 and is based in Meizhou, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Meizhou",
        "zipcode": "514787",
        "website": "http://www.chinameiyan.com",
        "market_cap": "Small Cap"
    },
    "600886.SS": {
        "short_name": "SDIC POWER HOLDINGS CO LTD",
        "long_name": "SDIC Power Holdings CO., LTD.",
        "summary": "SDIC Power Holdings CO., LTD. engages in the electricity business in China. It generates electricity with an installed capacity of 16.72 million kilowatts of hydropower; 11.765 million kilowatts of thermal power; and 808,500 kilowatts of wind and photovoltaic power. The company is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100034",
        "website": "http://www.sdicpower.com",
        "market_cap": "Large Cap"
    },
    "600900.SS": {
        "short_name": "CHINA YANGTZE POWER CO",
        "long_name": "China Yangtze Power Co., Ltd.",
        "summary": "China Yangtze Power Co.,Ltd., together with its subsidiaries, engages in operation, management, consultation, investment, and financing of hydropower stations in the People's Republic of China. The company owns, operates, and manages hydropower generation assets in the Three Gorges, Gezhouba, Xiluodu, and Xiangjiaba with an installed capacity of 45,495 MW. It is also involved in production and distribution of power, electricity, and heat business; and provision of high-technology and software development services. The company was founded in 2002 and is based in Beijing, the People's Republic of China. China Yangtze Power Co.,Ltd. is a subsidiary of China Three Gorges Corporation.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100032",
        "website": "http://www.cypc.com.cn",
        "market_cap": "Large Cap"
    },
    "600956.SS": {
        "short_name": "CHINA SUNTIEN GREEN ENERGY CORP",
        "long_name": "China Suntien Green Energy Corporation Limited",
        "summary": "China Suntien Green Energy Corporation Limited, together with its subsidiaries, develops and utilizes clean energy in Mainland China. The company operates through three segments: Natural Gas, Wind/Solar Power, and Other. The Natural Gas segment sells natural gas and gas appliances, as well as provides construction and connection services for natural gas pipelines. The Wind/Solar Power segment engages in the development, management, and operation of wind farm and solar power plants; and generates and sells electric power for power grid companies. The Other segment engages in the property leasing business. As of December 31, 2020, the company owned 6 long-distance natural gas transmission pipelines, 18 high-pressure branch pipelines, 30 urban gas projects, 22 distribution stations, 18 gate stations, 7 compressed natural gas (CNG) primary filling stations, 7 CNG secondary filling stations, and 3 liquefied natural gas filling station. It also had wind power consolidated installed capacity of 5,471.95 megawatts (MW), as well as attributable installed capacity of 4,965.90 MW. It also engages in the provision of project investment, investment management, and technical development services; and investment and sale of solar energy appliances. The company was incorporated in 2010 and is headquartered in Shijiazhuang, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shijiazhuang",
        "zipcode": null,
        "website": "http://www.suntien.com",
        "market_cap": "Mid Cap"
    },
    "600969.SS": {
        "short_name": "HUNAN CHENDIAN INTL DEV SHS-HOL",
        "long_name": "Hunan Chendian International Development co.,ltd",
        "summary": "Hunan Chendian International Development co.,ltd engages in the power supply, urban water supply, and industrial gas production businesses primarily in China. It also provides small and medium-sized hydropower development, exchange, and information consulting services. The company was founded in 2000 and is based in Chenzhou, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chenzhou",
        "zipcode": "423000",
        "website": "http://www.chinacdi.com",
        "market_cap": "Small Cap"
    },
    "600979.SS": {
        "short_name": "SICHUAN GUANGAN AAA PUBLIC CO",
        "long_name": "Sichuan Guangan AAAPublic Co.,Ltd",
        "summary": "Sichuan Guangan AAAPublic Co.,Ltd operates in the electricity, gas, and water businesses in China. The company generates and supplies hydroelectric power; and supplies natural gas, electricity, and drinking water. The company operates 12 waterworks and 1 sewage treatment plant; and 13 hydropower stations with an installed capacity of 491,200 kilowatts, as well as 11 110kV and 23 35kV substations, and 35kV switch stations. It also operates 8 gas storage and distribution stations, including 5 LNG storage and distribution stations; 13 gas distribution stations; 12 pressure regulating stations; 4 CNG filling stations; and 1 desulfurization station. The company was founded in 2002 and is based in Guang'an, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guang'an",
        "zipcode": null,
        "website": "http://www.sc-aaa.com",
        "market_cap": "Small Cap"
    },
    "600995.SS": {
        "short_name": "YUNNAN WENSHAN ELECTRIC POWER C",
        "long_name": "Yunnan Wenshan Electric Power Co.,Ltd.",
        "summary": "Yunnan Wenshan Electric Power Co.,Ltd generates and distributes hydro electric power. It distributes its electric power for life, industrial, commercial, and other uses in Wenshan, China, as well as in Vietnam. The company is based in Wenshan, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wenshan",
        "zipcode": "663000",
        "website": "http://www.wsdl.com.cn",
        "market_cap": "Small Cap"
    },
    "601016.SS": {
        "short_name": "CECEP WIND-POWER CORPORATION",
        "long_name": "CECEP Wind-power Corporation Co.,Ltd.",
        "summary": "CECEP Wind-power Corporation Co.,Ltd. develops, invests in, manages, constructs, operates, and maintains wind power projects primarily in China. It owns and operates wind power projects with total installed and under construction capacity of approximately 1900 megawatts. CECEP Wind-power Corporation Co.,Ltd. was founded in 2006 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100082",
        "website": "http://www.cecwpc.cn",
        "market_cap": "Mid Cap"
    },
    "601199.SS": {
        "short_name": "JIANGSU JIANGNAN WATER CO LTD",
        "long_name": "Jiangsu Jiangnan Water Co., Ltd.",
        "summary": "Jiangsu Jiangnan Water Co., Ltd. supplies water in China. It engages in the drainage and water treatment-related business; water supply engineering design and technical advice; water quality testing; measuring and testing water meters; and public infrastructure investing business. The company owns four ground water plants in Xiaowan, Xiaoshan, Chengxi, and Ligang, with a daily water supply capacity of 1.16 million cubic meters. It also manages and constructs drainage network and pumping stations; offers maintenance and dredging services; manages sewage treatment related facilities; provides sewage treatment and industrial water purification services; designs and constructs water supply and drainage pipelines; installs water supply and drainage equipment; constructs urban road projects, public squares, and pipeline parts and components; and offers pipe network repairs and other services. The company was founded in 1966 and is based in Jiangyin, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiangyin",
        "zipcode": null,
        "website": "http://www.jsjnsw.com",
        "market_cap": "Small Cap"
    },
    "601368.SS": {
        "short_name": "GUANGXI NANNING WATERWORKS CO L",
        "long_name": "Guangxi Nanning Waterworks Co., Ltd.",
        "summary": "Guangxi Nanning Waterworks Co., Ltd. produces and sells water in China. It is also involved in sewage treatment activities; and the construction and operation of water supply and drainage facilities. The company was founded in 2006 and is based in Nanning, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanning",
        "zipcode": "530031",
        "website": "http://www.gxlcwater.com",
        "market_cap": "Small Cap"
    },
    "601619.SS": {
        "short_name": "NINGXIA JIAZE RENEWABLES CORPOR",
        "long_name": "Ningxia Jiaze Renewables Corporation Limited",
        "summary": "Ningxia Jiaze Renewables Corporation Limited invests in, constructs, develops, operates, and manages energy projects. It operates wind power, photovoltaic, solar power, and micro-grid projects. The company was formerly known as Ningxia Jiaze Power Generation Co., Ltd. and changed its name to Ningxia Jiaze Renewables Corporation Limited in August 2015. Ningxia Jiaze Renewables Corporation Limited was founded in 2010 and is headquartered in Yinchuan, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yinchuan",
        "zipcode": null,
        "website": "http://www.jzne.net.cn",
        "market_cap": "Small Cap"
    },
    "601985.SS": {
        "short_name": "CHINA NATIONAL NUCLEAR POWER CO",
        "long_name": "China National Nuclear Power Co., Ltd.",
        "summary": "China National Nuclear Power Co., Ltd. invests in, develops, constructs, operates, and manages nuclear power projects in the People's Republic of China. The company also provides nuclear power project related technical and consultancy services. It operates 14 nuclear power units with an installed capacity of 11,512 MWe. The company is headquartered in Beijing, the People's Republic of China. China National Nuclear Power Co., Ltd. is a subsidiary of China National Nuclear Corporation.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100822",
        "website": "http://www.cnnp.com.cn",
        "market_cap": "Large Cap"
    },
    "603080.SS": {
        "short_name": "XINJIANG TORCH GAS CO LTD",
        "long_name": "Xinjiang Torch Gas Co., Ltd",
        "summary": "Xinjiang Torch Gas Co., Ltd engages in the natural gas transmission and distribution activities in China. The company also provides sales and home installation services. It owns approximately 120 kilometers of long-distance pipeline and 1 CNG parent station, as well as offers CNG refueling services. The company was founded in 2003 and is based in Kashi, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kashi",
        "zipcode": "844000",
        "website": "http://www.zw.org.cn/hjrq",
        "market_cap": "Micro Cap"
    },
    "603126.SS": {
        "short_name": "SINOMA ENERGY CONSERVATION LTD",
        "long_name": "Sinoma Energy Conservation Ltd.",
        "summary": "Sinoma Energy Conservation Ltd. provides technical, engineering, and investment services in the fields of industrial energy conservation, building energy conservation, energy comprehensive management, and environmental protection services in China and internationally. It designs, constructs, finances, and operates waste heat power generation projects on build-operate-transfer basis. The company also undertakes energy management contracts; offers engineering, procurement, and construction services for waste heat power generation projects; provides engineering design and consultation services for waste heat power generation projects; and undertakes clean development mechanism projects. It serves cement, steel, metallurgy, chemical, and other industries. The company is based in Tianjin, China. Sinoma Energy Conservation Ltd. is a subsidiary of China National Building Material Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300400",
        "website": "http://www.sinoma-ec.cn",
        "market_cap": "Small Cap"
    },
    "603393.SS": {
        "short_name": "XINJIANG XINTAI NATURAL GAS CO ",
        "long_name": "Xinjiang Xintai Natural Gas Co., Ltd.",
        "summary": "Xinjiang Xintai Natural Gas Co., Ltd. engages in the transmission, distribution, and sale of natural gas in China. It serves civil, commercial, automotive, and industrial parks. The company was formerly known as Xinjiang Xintai Investment (Group) Co., Ltd. and changed its name to Xinjiang Xintai Natural Gas Co., Ltd. in December 2012. Xinjiang Xintai Natural Gas Co., Ltd. was founded in 2000 and is based in Urumqi, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Urumqi",
        "zipcode": "831400",
        "website": "http://www.xjxtrq.com",
        "market_cap": "Small Cap"
    },
    "603817.SS": {
        "short_name": "FUJIAN HAIXIA ENVIRONMENTAL PRO",
        "long_name": "Fujian Haixia Environmental Protection Group Co.,Ltd.",
        "summary": "Fujian Haixia Environmental Protection Group Co.,Ltd. provides environmental services in China. It offers single and municipal sewage treatment, garbage leachate treatment, industrial wastewater treatment, township sewage treatment, sludge treatment and disposal, solid and hazardous waste disposal, and linen washing services, as well as resource utilization of muck and construction waste. The company was founded in 2002 and is based in Fuzhou, China. Fujian Haixia Environmental Protection Group Co.,Ltd. is a subsidiary of Fuzhou Water Affairs Investment and Development Co., Ltd.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": null,
        "website": "http://www.fjhxhb.com",
        "market_cap": "Small Cap"
    },
    "605368.SS": {
        "short_name": "HENAN LANTIAN GAS CO LTD",
        "long_name": "Henan Lantian Gas Co.,Ltd.",
        "summary": "Henan Lantian Gas Co.,Ltd. transports and sells natural gas pipelines. It also offers gas pipeline installation services. The company was founded in 2002 and is based in Zhumadian City, China. Henan Lantian Gas Co., Ltd. operates as a subsidiary of Henan Lantian Group CO.,LTD.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhumadian City",
        "zipcode": "463000",
        "website": "http://www.hnltrq.com.cn",
        "market_cap": "Small Cap"
    },
    "6136.HK": {
        "short_name": "KANGDA ENV",
        "long_name": "Kangda International Environmental Company Limited",
        "summary": "Kangda International Environmental Company Limited, an investment holding company, engages in the urban water treatment, water environment comprehensive remediation, and rural water improvement businesses in People's Republic of China. Its Urban Water Treatment segment is involved in the design, construction, upgradation, and operation of waste water treatment plants (WTP), reclaimed water treatment plants, sludge treatment plants, and water distribution plants; and the operation and maintenance of waste water treatment facilities entrusted by governments. The company's Water Environment Comprehensive Remediation segment engages in the river harnessing and improvement, foul water body treatment, and sponge city construction. Its Rural Water Improvement segment is involved in the construction and operation of water environment facilities in villages, including waste water treatment, pipeline construction for collecting waste water, and rural living environment activities. The company also constructs municipal infrastructure; invests and manages environmental and public infrastructure projects; develops and sells WTP equipment; develops computer software; and sells water purifying materials. It serves municipal, district, or county level governments, as well as their designees. The company was founded in 1996 and is headquartered in Chongqing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": null,
        "website": "http://www.kangdaep.com",
        "market_cap": "Micro Cap"
    },
    "6839.HK": {
        "short_name": "YUNNAN WATER",
        "long_name": "Yunnan Water Investment Co., Limited",
        "summary": "Yunnan Water Investment Co., Limited, an investment holding company, designs, develops, constructs, operates, and maintains municipal water supply and solid wastewater treatment facilities in the People's Republic of China and internationally. It operates through five segments: Wastewater Treatment, Water Supply, Solid Waste Treatment Construction and Sales of Equipment, and Others. It constructs and operates wastewater treatment projects, water supply projects, and solid waste treatment projects; undertakes build and transfer (BT) projects, and engineering-procurement-construction (EPC) projects; and produces, installs, and sells equipment for wastewater treatment, water supply, solid waste treatment, and other infrastructure facilities. The company undertakes operation and maintenance (O&M) projects for wastewater treatment, water supply, and solid waste treatment facilities owned by third parties; and offers technical and consultancy services. As at 31 December 2019, it had 124 concession wastewater treatment projects, including 7 build-own-operate (BOO), 69 build-operate-transfer (BOT), 2 transfer-own-operate (TOO), 21 transfer-operate-transfer (TOT) projects, 2 rehabilitate-operate-transfer (ROT), and 23 municipal environment comprehensive treatment projects, with total daily treatment capacity of approximately 3,380,400 tonnes; 66 concession water supply projects comprising, 15 BOO projects, 35 BOT projects, 11 TOT projects, and 4 municipal environment comprehensive treatment projects with total daily capacity of approximately 224,100 tonnes; 21 solid waste treatment projects with annual treatment capacity of approximately 3,571,000 tonnes; 11 BT projects and 10 EPC projects; and 30 O&M projects. The company was formerly known as Yunnan Water Industry Investment and Development Co., Ltd. and changed its name to Yunnan Water Investment Company Limited in July 2014. The company was founded in 2009 and is headquartered in Kunming, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Kunming",
        "zipcode": null,
        "website": "http://www.yunnanwater.cn",
        "market_cap": "Micro Cap"
    },
    "688096.SS": {
        "short_name": "JIANGSU JINGYUAN ENVIRONMENTAL ",
        "long_name": "Jiangsu Jingyuan Environmental Protection Co., Ltd.",
        "summary": "Jiangsu Jingyuan Environmental Protection Co., Ltd. provides professional and integrated water treatment solutions for customers in China and internationally. The company offers industrial waste sewage treatment equipment and systems, including coal-containing wastewater treatment, desulfurization wastewater treatment, zero-emissions, electrocatalytic oxidation treatment, and reclaimed water processing and reuse systems, etc. for use in the wastewater treatment and zero-emission treatment stages. It also provides water supply treatment equipment and systems, such as raw water pretreatment and desalinated water preparation systems that are used in the water supply treatment stage. In addition, the company engages in the consulting, integration, and sales and engineering contracting business. Jiangsu Jingyuan Environmental Protection Co., Ltd. was founded in 1999 and is based in Nantong, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nantong",
        "zipcode": "226000",
        "website": "http://www.jsjyep.com",
        "market_cap": "Micro Cap"
    },
    "688101.SS": {
        "short_name": "SUNTAR ENVIRONMENTAL TECHNOLOGY",
        "long_name": "Suntar Environmental Technology Co., Ltd.",
        "summary": "Suntar Environmental Technology Co., Ltd. provides industrial membrane separation solutions in China. It offers It offers ceramic, spiral, and PP/PE membrane separation; and flow-cel membrane, solvent recovery, membrane bioreactor, and continuous chromatography separation and ion exchange technologies. The company also provides ceramic, spiral wound, hollow fiber, and spiral membranes, as well as lab equipment and IMBRs. It serves customers in biological, chemical engineering, pharmaceutical, and food and beverage industries. The company was founded in 2005 and is based in Xiamen, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "716000",
        "website": "http://www.suntar.com",
        "market_cap": "Small Cap"
    },
    "688156.SS": {
        "short_name": "ROAD ENVIRONMENT TECHNOLOGY CO ",
        "long_name": "Road Environment Technology.,Ltd",
        "summary": "Road Environment Technology.,Ltd provides solid wastewater treatment and disposal services in China. It offers river and lake slit, engineering mud, industrial slag and sludge, and municipal sludge treatment services. The company was founded in 2006 and is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430075",
        "website": "http://www.road-group.com",
        "market_cap": "Micro Cap"
    },
    "688196.SS": {
        "short_name": "LONGYAN ZHUOYUE NEW ENERGY CO L",
        "long_name": "Longyan Zhuoyue New Energy Co., Ltd.",
        "summary": "Longyan Zhuoyue New Energy Co., Ltd., a renewable energy company, produces biodiesel in Europe, East Asia, and North America. It also offers oleic acid methyl ester, C16C18 fatty acid methyl ester, coconut oil methyl ester, and glycerin. The company was founded in 2001 and is based in Longyan, China. Longyan Zhuoyue New Energy Co., Ltd. operates as a subsidiary of China Biodiesel International Holdings Co. Ltd.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Longyan",
        "zipcode": "364000",
        "website": "http://www.zyxny.com",
        "market_cap": "Small Cap"
    },
    "6WX.F": {
        "short_name": "CHIN.LONGYUAN PWR G.H YC1",
        "long_name": "China Longyuan Power Group Corporation Limited",
        "summary": "China Longyuan Power Group Corporation Limited generates and sells wind and coal power in the People's Republic of China. It operates through segments, Wind Power and Coal Power. The company designs, develops, constructs, manages, and operates wind and coal power plants. It also operates other power projects, such as thermal, solar, tidal, biomass, and geothermal solar power. In addition, the company is involved in the coal trading business. Further, it manufactures and sells power equipment; provides consulting, maintenance, and training services to wind and other renewable power generation plants; and generates electric power for external power grid companies. The company was formerly known as China Longyuan Electric Power Group Corporation and changed its name to China Longyuan Power Group Corporation Limited in July 2009. The company was founded in 1993 and is headquartered in Beijing, the People's Republic of China. China Longyuan Power Group Corporation Limited is a subsidiary of China Energy Investment Group Co., Ltd.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.clypg.com.cn",
        "market_cap": "Large Cap"
    },
    "6WX0.F": {
        "short_name": "CN LGY.PWR.GR.UNSP.ADR/10",
        "long_name": "China Longyuan Power Group Corporation Limited",
        "summary": "China Longyuan Power Group Corporation Limited generates and sells wind and coal power in the People's Republic of China. It operates through segments, Wind Power and Coal Power. The company designs, develops, constructs, manages, and operates wind and coal power plants. It also operates other power projects, such as thermal, solar, tidal, biomass, and geothermal solar power. In addition, the company is involved in the coal trading business. Further, it manufactures and sells power equipment; provides consulting, maintenance, and training services to wind and other renewable power generation plants; and generates electric power for external power grid companies. The company was formerly known as China Longyuan Electric Power Group Corporation and changed its name to China Longyuan Power Group Corporation Limited in July 2009. The company was founded in 1993 and is headquartered in Beijing, the People's Republic of China. China Longyuan Power Group Corporation Limited is a subsidiary of China Energy Investment Group Co., Ltd.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.clypg.com.cn",
        "market_cap": "Large Cap"
    },
    "900957.SS": {
        "short_name": "SHANGHAI LINGYUN INDUSTRIES DEV",
        "long_name": "Shanghai Lingyun Industries Development Co., Ltd",
        "summary": "Shanghai Lingyun Industries Development Co., Ltd constructs and operates photovoltaic power generation projects. It operates a 100 megawatts photovoltaic power station in Baiyin, China. The company was incorporated in 1998 and is based in Shanghai, China.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200122",
        "website": "http://www.elingyun.com",
        "market_cap": "Micro Cap"
    },
    "9908.HK": {
        "short_name": "JIAXING GAS",
        "long_name": "JiaXing Gas Group Co., Ltd.",
        "summary": "JiaXing Gas Group Co., Ltd. operates as a piped natural gas (PNG) operator in the People's Republic of China. The company sells PNG, liquefied natural gas (LNG), and liquefied petroleum gas (LPG) to residential and non-residential users; provides construction and installation services for gas pipeline network and gas facilities to property developers and owners, or occupants of residential and non-residential properties; and distributes and sells gas pipes and equipment. It also provides gas technology consulting services; constructs and operates new energy facilities, as well as LNG storage and transportation station; transports LNG and compressed natural gas; sells vapour and construction materials; and leases properties. The company serves customers in the Jiaxing port and urban areas. JiaXing Gas Group Co., Ltd. was founded in 1998 and is headquartered in Jiaxing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Jiaxing",
        "zipcode": null,
        "website": "http://www.jxrqgs.com",
        "market_cap": "Micro Cap"
    },
    "9AE.F": {
        "short_name": "PUXING ENERGY LTD.  HD-10",
        "long_name": "Puxing Energy Limited",
        "summary": "Puxing Energy Limited develops, operates, and manages natural gas-fired power plants in Zhejiang province. As of December 31, 2020, it owns five natural gas-fired power plants with a total installed capacity of approximately 687.73W, including 731kW photovoltaic power generation scale; and a heating capacity of approximately 360 tons per hour. The company was formerly known as Puxing Clean Energy Limited and changed its name to Puxing Energy Limited in June 2020. Puxing Energy Limited was incorporated in 2008 and is headquartered in Hangzhou, the People's Republic of China. Puxing Energy Limited is a subsidiary of Puxing International Limited.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310007",
        "website": "http://www.pxcleanenergy.com",
        "market_cap": "Micro Cap"
    },
    "9C6.F": {
        "short_name": "CN.SUNTIEN GR.ENRGY H YC1",
        "long_name": "China Suntien Green Energy Corporation Limited",
        "summary": "China Suntien Green Energy Corporation Limited, together with its subsidiaries, develops and utilizes clean energy in Mainland China. The company operates through three segments: Natural Gas, Wind/Solar Power, and Other. The Natural Gas segment sells natural gas and gas appliances, as well as provides construction and connection services for natural gas pipelines. The Wind/Solar Power segment engages in the development, management, and operation of wind farm and solar power plants; and generates and sells electric power for power grid companies. The Other segment engages in the property leasing business. As of December 31, 2020, the company owned 6 long-distance natural gas transmission pipelines, 18 high-pressure branch pipelines, 30 urban gas projects, 22 distribution stations, 18 gate stations, 7 compressed natural gas (CNG) primary filling stations, 7 CNG secondary filling stations, and 3 liquefied natural gas filling station. It also had wind power consolidated installed capacity of 5,471.95 megawatts (MW), as well as attributable installed capacity of 4,965.90 MW. It also engages in the provision of project investment, investment management, and technical development services; and investment and sale of solar energy appliances. The company was incorporated in 2010 and is headquartered in Shijiazhuang, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shijiazhuang",
        "zipcode": null,
        "website": "http://www.suntien.com",
        "market_cap": "Mid Cap"
    },
    "AJ2.SI": {
        "short_name": "Ouhua Energy",
        "long_name": "Ouhua Energy Holdings Limited",
        "summary": "Ouhua Energy Holdings Limited, an investment holding company, engages in the import, processing, and wholesale of liquefied petroleum gas (LPG) in the People's Republic of China. The company imports raw materials, including butane and propane, and processes these products into LPG; and purchases and sells LPG. It also exports its products to Vietnam, the Philippines, and Thailand in Southeast Asia. The company was founded in 2000 and is based in Chaozhou, the People's Republic of China. Ouhua Energy Holdings Limited is a subsidiary of High Tree Worldwide Ltd.",
        "currency": "SGD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "state": null,
        "city": "Chaozhou",
        "zipcode": null,
        "website": "http://www.ohwa.com.sg",
        "market_cap": "Nano Cap"
    },
    "BEH.SI": {
        "short_name": "China Intl",
        "long_name": "China International Holdings Limited",
        "summary": "China International Holdings Limited, an investment holding company, engages in the water supply services and land development businesses in the People's Republic of China. The company's Water Supply Services segment constructs water pipelines and supplies gray water. Its Land Development segment provides engineering and land leveling services for preliminary land development projects. The company is also involved in the investment of properties; and energy and natural resources business. China International Holdings Limited is based in Beijing, the People's Republic of China.",
        "currency": "SGD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100081",
        "website": "http://www.cihgrp.net",
        "market_cap": "Nano Cap"
    },
    "BJ6.F": {
        "short_name": "BEIJ.JINGNENG CL.ERG.HYC1",
        "long_name": "Beijing Jingneng Clean Energy Co., Limited",
        "summary": "Beijing Jingneng Clean Energy Co., Limited generates gas-fired power and heat energy, wind power, photovoltaic power, and hydropower in the People's Republic of China. As of December 31, 2019, the company had an installed capacity of 10,861 megawatt (MW), including seven gas-fired power cogeneration plants with 4,702 MW; wind power generation capacity of 2,797 MW; photovoltaic power generation installed capacity of 2,912 MW; and hydropower installed capacity of 450 MW. It sells electricity to local grid companies. It also offers repair and maintenance; investment management; and finance leasing services. The company was formerly known as Beijing Jingneng Energy Technology Investment Co., Ltd. and changed its name to Beijing Jingneng Clean Energy Co., Limited in August 2010. The company was founded in 2010 and is based in Beijing, the People' Republic of China. Beijing Jingneng Clean Energy Co., Limited is a subsidiary of Beijing Energy Holding Co., Ltd.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.jncec.com",
        "market_cap": "Small Cap"
    },
    "BJI.F": {
        "short_name": "DATANG INTL POW.GE.-H-YC1",
        "long_name": "Datang International Power Generation Co., Ltd.",
        "summary": "Datang International Power Generation Co., Ltd., together with its subsidiaries, engages in power generation and power plant development activities in the People's Republic of China. The company operates through Power and heat generation, Coal, and Other segments. It generates electricity through various sources, such as coal-fired, thermal, hydro, wind, nuclear, biomass, and solar. As of December 31, 2019, the company managed an installed capacity of approximately 68,278.10 MW. It also engages in heat supply; the import of power related fuel; coal mining and trading; silicon and aluminum smelting; production and sale of alumina; cargo shipping; sale of coal ash and integrated application of solid waste; power plant construction and operation; repair and testing of power equipment; research and development activities; and provision of power related technical services. The company was formerly known as Beijing Datang Power Generation Co., Ltd and changed its name to Datang International Power Generation Co, Ltd. in April 2004. The company was founded in 1994 and is headquartered in Beijing, the People's Republic of China. Datang International Power Generation Co., Ltd. is a subsidiary of China Datang Corporation Limited.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100033",
        "website": "http://www.dtpower.com",
        "market_cap": "Mid Cap"
    },
    "BWM.SI": {
        "short_name": "Zheneng Jinjiang",
        "long_name": "Zheneng Jinjiang Environment Holding Company Limited",
        "summary": "Zheneng Jinjiang Environment Holding Company Limited generates and sells electricity and steam in the People's Republic of China, India, and internationally. The company operates through Waste-To-Energy Project Construction and Operation; and Project Technical and Management Service, Equipment Selection, and EMC Business segments. The company also provides waste treatment services; project management, technical consulting and advisory, equipment selection, and energy management contracting services; and construction services under service concession arrangement. In addition, it operates thermal power plants. As of December 31, 2020, it operated 22 waste-to-energy facilities, an organic waste treatment facility, and 6 resource recycling projects in 13 provinces, autonomous regions, and centrally-administered municipalities in China with a total waste treatment capacity of 38,060 tons/day and an installed electricity power generation capacity of 718 MW. The company was formerly known as China Jinjiang Environment Holding Company Limited and changed its name to Zheneng Jinjiang Environment Holding Company Limited in November 2019. Zheneng Jinjiang Environment Holding Company Limited was founded in 1998 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "SGD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310011",
        "website": "http://www.jinjiang-env.com",
        "market_cap": "Small Cap"
    },
    "CHNGQ": {
        "short_name": "CHINA NATURAL GAS INC",
        "long_name": "China Natural Gas, Inc.",
        "summary": "China Natural Gas, Inc., an integrated natural gas operator, engages in the sale and distribution of natural gas and gasoline to commercial, industrial, and residential customers in the People's Republic of China. The company is primarily involved in the distribution of compressed natural gas (CNG) through its variable interest entity-owned CNG fueling stations. As of December 31, 2012, it operated 31 CNG fueling stations, including 20 CNG fueling stations in Shaanxi Province, 10 CNG fueling stations in Henan Province, and 1 CNG fueling station in Hubei Province. It also installs natural gas pipelines, as well as distributes and sells piped natural gas to residential and commercial customers through a high pressure pipeline network of approximately 120 kilometers in the city of Xi'an in Shaanxi Province, including Lantian County; the districts of Lintong and Baqiao in Shaanxi Province; and the city of Lingbao in Henan Province. As of the above date, the company had approximately 122,020 residential and commercial customers for its pipeline network, as well as operated 4 automobile conversion sites for converting gasoline-fueled vehicles to hybrid (natural gas/gasoline) powered vehicles. The company is based in Xi'an, the People's Republic of China. On July 2, 2014, the involuntary petition of China Natural Gas, Inc. for reorganization under Chapter 11 was converted to Chapter 7. The involuntary petition was filed under Chapter 11 on February 8, 2013.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Xiâ\u0080\u0099an",
        "zipcode": "710065",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "CLPXF": {
        "short_name": "CHINA LONGYUAN POWER GROUP CORP",
        "long_name": "China Longyuan Power Group Corporation Limited",
        "summary": "China Longyuan Power Group Corporation Limited generates and sells wind and coal power in the People's Republic of China. It operates through segments, Wind Power and Coal Power. The company designs, develops, constructs, manages, and operates wind and coal power plants. It also operates other power projects, such as thermal, solar, tidal, biomass, and geothermal solar power. In addition, the company is involved in the coal trading business. Further, it manufactures and sells power equipment; provides consulting, maintenance, and training services to wind and other renewable power generation plants; and generates electric power for external power grid companies. The company was formerly known as China Longyuan Electric Power Group Corporation and changed its name to China Longyuan Power Group Corporation Limited in July 2009. The company was founded in 1993 and is headquartered in Beijing, the People's Republic of China. China Longyuan Power Group Corporation Limited is a subsidiary of China Energy Investment Group Co., Ltd.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.clypg.com.cn",
        "market_cap": "Large Cap"
    },
    "CLPXY": {
        "short_name": "CHINA LONGYUAN POWER GROUP CORP",
        "long_name": "China Longyuan Power Group Corporation Limited",
        "summary": "China Longyuan Power Group Corporation Limited generates and sells wind and coal power in the People's Republic of China. It operates in two segments, Wind Power and Coal Power. The company designs, develops, constructs, manages, and operates wind and coal power plants. It also operates other power projects, such as thermal, solar, tidal, biomass, and geothermal solar power. In addition, the company is involved in the coal trading business. Further, it manufactures and sells power equipment, as well as provides consulting, maintenance, and training services to wind and other renewable power generation plants. The company was formerly known as China Longyuan Electric Power Group Corporation and changed its name to China Longyuan Power Group Corporation Limited in July 2009. China Longyuan Power Group Corporation Limited was founded in 1993 and is headquartered in Beijing, the People's Republic of China. China Longyuan Power Group Corporation Limited is a subsidiary of China Energy Investment Corporation Limited.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.clypg.com.cn",
        "market_cap": "Large Cap"
    },
    "CNER": {
        "short_name": "CHINA NEW ENERGY GROUP COMPANY",
        "long_name": "China New Energy Group Co.",
        "summary": "China New Energy Group Company, a natural gas company, engages in the development, construction, and operation of natural gas distribution networks. It also distributes natural gas to residential, industrial, and commercial customers in small and medium sized cities in China. The company owns the rights to develop distribution networks to provide natural gas in the cities of Dashiqiao, Nandaihe, Zhanhua, and Wuyuan. Its distribution networks provide natural gas to an aggregate of approximately 64,000 consumers. The company is headquartered in Tianjin, China.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300042",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "CR9.F": {
        "short_name": "CHINA RECYCL. NEW DL-,001",
        "long_name": "China Recycling Energy Corporation",
        "summary": "China Recycling Energy Corporation engages in the recycling energy business in China. The company designs, finances, constructs, installs, operates, and transfers waste energy recycling projects to mid- to large-size enterprises involved in high energy-consuming businesses. It provides waste pressure-to-energy solutions, including the Blast Furnace Top Gas Recovery Turbine Unit, a system that utilizes high pressure gas emitted from the blast furnace top to drive turbine units and generate electricity; and waste heat-to-energy solutions, such as heat power generation projects for applications in cement, steel, coking coal, and nonferrous metal industries, which collect the residual heat from various manufacturing processes. The company also offers waste gas-to-energy solutions comprising the Waste Gas Power Generation system that utilizes flammable waste gas from coal mining, petroleum exploitation, refinery processing, or other sources as a fuel source to generate electricity; and the Combined Cycle Power Plant, which employs power generating cycle to utilize the waste gas that generates electricity by burning the flammable waste gas in a gas turbine, as well as uses the waste heat from burning the gas to make steam to generate additional electricity through a steam turbine. In addition, it provides project investment, investment management, economic information consulting, technical, financial leasing, and financial leasing transactions consulting services; sells and leases energy saving systems and equipment; and purchases, repairs, and disposes financial leasing assets. The company was formerly known as China Digital Wireless, Inc. and changed its name to China Recycling Energy Corporation in March 2007. China Recycling Energy Corporation was incorporated in 1980 and is headquartered in Xi'an, China.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": "710075",
        "website": "http://www.creg-cn.com",
        "market_cap": "Nano Cap"
    },
    "CREG": {
        "short_name": "China Recycling Energy Corporat",
        "long_name": "China Recycling Energy Corporation",
        "summary": "China Recycling Energy Corporation engages in the recycling energy business in China. The company designs, finances, constructs, installs, operates, and transfers waste energy recycling projects to mid- to large-size enterprises involved in high energy-consuming businesses. It provides waste pressure-to-energy solutions, including the Blast Furnace Top Gas Recovery Turbine Unit, a system that utilizes high pressure gas emitted from the blast furnace top to drive turbine units and generate electricity; and waste heat-to-energy solutions, such as heat power generation projects for applications in cement, steel, coking coal, and nonferrous metal industries, which collect the residual heat from various manufacturing processes. The company also offers waste gas-to-energy solutions comprising the Waste Gas Power Generation system that utilizes flammable waste gas from coal mining, petroleum exploitation, refinery processing, or other sources as a fuel source to generate electricity; and the Combined Cycle Power Plant, which employs power generating cycle to utilize the waste gas that generates electricity by burning the flammable waste gas in a gas turbine, as well as uses the waste heat from burning the gas to make steam to generate additional electricity through a steam turbine. In addition, it provides project investment, investment management, economic information consulting, technical, financial leasing, and financial leasing transactions consulting services; sells and leases energy saving systems and equipment; and purchases, repairs, and disposes financial leasing assets. The company was formerly known as China Digital Wireless, Inc. and changed its name to China Recycling Energy Corporation in March 2007. China Recycling Energy Corporation was incorporated in 1980 and is headquartered in Xi'an, China.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NCM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": "710075",
        "website": "http://www.creg-cn.com",
        "market_cap": "Nano Cap"
    },
    "CYZB.F": {
        "short_name": "CN YANGT.PWR GDR REG S/A",
        "long_name": "China Yangtze Power Co., Ltd.",
        "summary": "China Yangtze Power Co., Ltd., together with its subsidiaries, engages in operation, management, consultation, investment, and financing of hydropower stations in the People's Republic of China. The company owns, operates, and manages hydropower generation assets in the Three Gorges, Gezhouba, Xiluodu, and Xiangjiaba with an installed capacity of 45,495 MW. It is also involved in production and distribution of power, electricity, and heat business; and provision of high-technology and software development services. The company was founded in 2002 and is based in Beijing, the People's Republic of China. China Yangtze Power Co., Ltd. is a subsidiary of China Three Gorges Corporation.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100032",
        "website": "http://www.cypc.com.cn",
        "market_cap": "Large Cap"
    },
    "DIPGY": {
        "short_name": "DATANG INTERNATIONAL POWER GENE",
        "long_name": "Datang International Power Generation Co., Ltd.",
        "summary": "Datang International Power Generation Co., Ltd., together with its subsidiaries, engages in power generation and power plant development activities in the People's Republic of China. The company operates through Power and heat generation, Coal, and Other segments. It generates electricity through various sources, such as coal-fired, thermal, hydro, wind, nuclear, biomass, and solar. As of December 31, 2019, the company managed an installed capacity of approximately 68,278.10 MW. It also engages in heat supply; the import of power related fuel; coal mining and trading; silicon and aluminum smelting; production and sale of alumina; cargo shipping; sale of coal ash and integrated application of solid waste; power plant construction and operation; repair and testing of power equipment; research and development activities; and provision of power related technical services. The company was formerly known as Beijing Datang Power Generation Co., Ltd and changed its name to Datang International Power Generation Co, Ltd. in April 2004. The company was founded in 1994 and is headquartered in Beijing, the People's Republic of China. Datang International Power Generation Co., Ltd. is a subsidiary of China Datang Corporation Limited.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100033",
        "website": "http://www.dtpower.com",
        "market_cap": "Mid Cap"
    },
    "DT7.F": {
        "short_name": "CN.DATANG CRP.RENEW.PWR H",
        "long_name": "China Datang Corporation Renewable Power Co., Limited",
        "summary": "China Datang Corporation Renewable Power Co., Limited, together with its subsidiaries, generates and sells wind power and other renewable power in the People's Republic of China. The company develops, invests in, constructs, and manages wind power and other renewable energy sources, including solar power and biomass. It also engages in the research and development, application, and promotion of low carbon technology; research, sale, testing, and maintenance of renewable energy-related equipment; power generation; and design, construction and installation, repair, and maintenance of domestic and international power projects. In addition, the company provides import and export services for renewable energy equipment and technologies; foreign investments; and renewable energy-related consulting services. As of December 31, 2020, it had consolidated installed capacity of 12,229.52 megawatts (MW), including 11,171.05 MW of wind power installed capacity. The company was formerly known as Datang Chifeng Saihanba Wind Power Generation Co., Ltd. and changed its name to China Datang Corporation Renewable Power Co., Limited in March 2009. The company was founded in 2004 and is headquartered in Beijing, the People's Republic of China. China Datang Corporation Renewable Power Co., Limited is a subsidiary of China Datang Corporation Ltd.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100053",
        "website": "http://www.cdt-re.com",
        "market_cap": "Small Cap"
    },
    "DT7.SG": {
        "short_name": "Chin.Datang Corp.Renew.Pwr Co.R",
        "long_name": "China Datang Corporation Renewable Power Co., Limited",
        "summary": "China Datang Corporation Renewable Power Co., Limited, together with its subsidiaries, generates and sells wind power and other renewable power in the People's Republic of China. The company develops, invests in, constructs, and manages wind power and other renewable energy sources, including solar power and biomass. It also engages in the research and development, application, and promotion of low carbon technology; research, sale, testing, and maintenance of renewable energy-related equipment; power generation; and design, construction and installation, repair, and maintenance of domestic and international power projects. In addition, the company provides import and export services for renewable energy equipment and technologies; foreign investments; and renewable energy-related consulting services. As of December 31, 2020, it had consolidated installed capacity of 12,229.52 megawatts (MW), including 11,171.05 MW of wind power installed capacity. The company was formerly known as Datang Chifeng Saihanba Wind Power Generation Co., Ltd. and changed its name to China Datang Corporation Renewable Power Co., Limited in March 2009. The company was founded in 2004 and is headquartered in Beijing, the People's Republic of China. China Datang Corporation Renewable Power Co., Limited is a subsidiary of China Datang Corporation Ltd.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "STU",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100053",
        "website": "http://www.cdt-re.com",
        "market_cap": "Small Cap"
    },
    "FEWP": {
        "short_name": "FAR EAST WIND POWER CORP",
        "long_name": "Far East Wind Power Corp.",
        "summary": "Far East Wind Power Corp., a development stage company, focuses on the development, construction, and operation of utility-scale wind energy projects primarily in the People's Republic of China. The company was formerly known as Celestial Delights USA Corp. and changed its name to Far East Wind Power Corp. in February 2010. Far East Wind Power Corp. was founded in 2008 and is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100020",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "HNP": {
        "short_name": "Huaneng Power Intl",
        "long_name": "Huaneng Power International, Inc.",
        "summary": "Huaneng Power International, Inc., together with its subsidiaries, generates and sells electricity and heat to the regional or provincial grid companies in the People's Republic of China and internationally. It is involved in the development, investment, construction, operation, and management of power plants and related projects; and generation, wholesale, and retail of power and other relating utilities. The company generates power from gas turbine, hydro, wind, photovoltaic, biomass, coal, solar, and oil resources. It is also involved in the sale of coal ash and lime; provision of cargo loading and storage, port, warehousing, and conveying services; photovoltaic power generation projects development and construction; and provision of thermal energy and cold energy services, as well as thermal heating services. In addition, the company engages in the repair of power equipment; provision of water supply and transportation services; construction and operation of electricity distribution networks and heating pipe networks; energy supply, energy transmission, and substation project contracting activities; cargo transportation; and port management, investment, and development activities. Further, it is involved in the management of industrial water and waste, as well as provides environment engineering, and information technology and management consulting services. Additionally, it sells raw and processed coal; and provides central heat, and plumbing and pipe installation services, as well as desalinated water. As of December 31, 2020, the company had a controlled generating capacity of 113,357 megawatts and an equity-based installed capacity of 98,948 megawatts. Huaneng Power International, Inc. was incorporated in 1994 and is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100031",
        "website": "http://www.hpi.com.cn",
        "market_cap": "Mid Cap"
    },
    "HUNGF": {
        "short_name": "HUANENG POWER INTERNATIONAL INC",
        "long_name": "Huaneng Power International, Inc.",
        "summary": "Huaneng Power International, Inc., together with its subsidiaries, generates and sells electricity and heat to the regional or provincial grid companies in the People's Republic of China and internationally. It is involved in the development, investment, construction, operation, and management of power plants and related projects; and generation, wholesale, and retail of power and other relating utilities. The company generates power from gas turbine, hydro, wind, photovoltaic, biomass, coal, solar, and oil resources. It is also involved in the sale of coal ash and lime; provision of cargo loading and storage, port, warehousing, and conveying services; photovoltaic power generation projects development and construction; and provision of thermal energy and cold energy services, as well as thermal heating services. In addition, the company engages in the repair of power equipment; provision of water supply and transportation services; construction and operation of electricity distribution networks and heating pipe networks; energy supply, energy transmission, and substation project contracting activities; cargo transportation; and port management, investment, and development activities. Further, it is involved in the management of industrial water and waste, as well as provides environment engineering, and information technology and management consulting services. Additionally, it sells raw and processed coal; and provides central heat, and plumbing and pipe installation services, as well as desalinated water. As of December 31, 2020, the company had a controlled generating capacity of 113,357 megawatts and an equity-based installed capacity of 98,948 megawatts. Huaneng Power International, Inc. was incorporated in 1994 and is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100031",
        "website": "http://www.hpi.com.cn",
        "market_cap": "Mid Cap"
    },
    "HUP.F": {
        "short_name": "HUANENG PWR H YC 1 ADR/40",
        "long_name": "Huaneng Power International, Inc.",
        "summary": "Huaneng Power International, Inc., together with its subsidiaries, generates and sells electricity and heat to the regional or provincial grid companies in the People's Republic of China and internationally. It is involved in the development, investment, construction, operation, and management of power plants and related projects; and generation, wholesale, and retail of power and other relating utilities. The company generates power from gas turbine, hydro, wind, photovoltaic, biomass, coal, solar, and oil resources. It is also involved in the sale of coal ash and lime; provision of cargo loading and storage, port, warehousing, and conveying services; photovoltaic power generation projects development and construction; and provision of thermal energy and cold energy services, as well as thermal heating services. In addition, the company engages in the repair of power equipment; provision of water supply and transportation services; construction and operation of electricity distribution networks and heating pipe networks; energy supply, energy transmission, and substation project contracting activities; cargo transportation; and port management, investment, and development activities. Further, it is involved in the management of industrial water and waste, as well as provides environment engineering, and information technology and management consulting services. Additionally, it sells raw and processed coal; and provides central heat, and plumbing and pipe installation services, as well as desalinated water. As of December 31, 2020, the company had a controlled generating capacity of 113,357 megawatts and an equity-based installed capacity of 98,948 megawatts. Huaneng Power International, Inc. was incorporated in 1994 and is based in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100031",
        "website": "http://www.hpi.com.cn",
        "market_cap": "Mid Cap"
    },
    "HUP1.F": {
        "short_name": "HUANENG PWR INTL H  YC 1",
        "long_name": "Huaneng Power International, Inc.",
        "summary": "Huaneng Power International, Inc., together with its subsidiaries, generates and sells electricity and heat to the regional or provincial grid companies in the People's Republic of China and internationally. It is involved in the development, investment, construction, operation, and management of power plants and related projects; and generation, wholesale, and retail of power and other relating utilities. The company generates power from gas turbine, hydro, wind, photovoltaic, biomass, coal, solar, and oil resources. It is also involved in the sale of coal ash and lime; provision of cargo loading and storage, port, warehousing, and conveying services; photovoltaic power generation projects development and construction; and provision of thermal energy and cold energy services, as well as thermal heating services. In addition, the company engages in the repair of power equipment; provision of water supply and transportation services; construction and operation of electricity distribution networks and heating pipe networks; energy supply, energy transmission, and substation project contracting activities; cargo transportation; and port management, investment, and development activities. Further, it is involved in the management of industrial water and waste, as well as provides environment engineering, and information technology and management consulting services. Additionally, it sells raw and processed coal; and provides central heat, and plumbing and pipe installation services, as well as desalinated water. As of December 31, 2020, the company had a controlled generating capacity of 113,357 megawatts and an equity-based installed capacity of 98,948 megawatts. Huaneng Power International, Inc. was incorporated in 1994 and is based in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100031",
        "website": "http://www.hpi.com.cn",
        "market_cap": "Mid Cap"
    },
    "JKSN.MX": {
        "short_name": "JINKOSOLAR HOLDING CO LTD",
        "long_name": "JinkoSolar Holding Co., Ltd.",
        "summary": "JinkoSolar Holding Co., Ltd., together with its subsidiaries, engages in the design, development, production, and marketing of photovoltaic products. The company offers solar modules, silicon wafers, solar cells, recovered silicon materials, and silicon ingots. It also provides solar system integration services; and develops commercial solar power projects. The company sells its products to distributors, project developers, and system integrators; and utility, commercial, and residential customers under the JinkoSolar brand, as well as on an original equipment manufacturer basis. As of December 31, 2020, it had an integrated annual capacity of 22 gigawatt (GW) for mono wafers; 11 GW for solar cells; and 31 GW for solar modules. The company has operations in the People's Republic of China, the United States, Japan, Germany, the United Kingdom, Chile, South Africa, India, Mexico, Brazil, the United Arab Emirates, Italy, Spain, France, Belgium, and internationally. JinkoSolar Holding Co., Ltd. was founded in 2006 and is based in Shangrao, the People's Republic of China.",
        "currency": "MXN",
        "sector": "Utilities",
        "industry": "Diversified Utilities",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "China",
        "state": null,
        "city": "Shangrao",
        "zipcode": "334100",
        "website": "http://www.jinkosolar.com",
        "market_cap": "Micro Cap"
    },
    "KOJ5.F": {
        "short_name": "KONG SUN (BL25000)",
        "long_name": "Kong Sun Holdings Limited",
        "summary": "Kong Sun Holdings Limited, an investment holding company, invests in, operates, and maintains solar power plants in the People's Republic of China. The company operates in four segments: Solar Power Plants, Liquefied Natural Gas, Financial Services, and Others segments. It generates and sells electricity through solar power plants. As of December 31, 2019, the company owned 45 solar power plants with a total installed capacity of approximately 1,629.3 megawatts. The company also trades in liquefied natural gas and solar energy related products; provides various loans; and leases properties, as well as manufactures and sells life-like plants. The company was founded in 1955 and is headquartered in Beijing, China. Kong Sun Holdings Limited is a subsidiary of Pohua JT Private Equity Fund L.P.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.kongsun.com",
        "market_cap": "Micro Cap"
    },
    "SHX.F": {
        "short_name": "HUADIAN POWER INTL H YC 1",
        "long_name": "Huadian Power International Corporation Limited",
        "summary": "Huadian Power International Corporation Limited, together with its subsidiaries, engages in the generation and sale of electricity and heat to power grid companies in the People's Republic of China. The company is involved in the construction and operation of power plants, including coal- or gas-fired generating units and various renewable energy projects. It also engages in the production and sale of coal; construction and operation of ports; and sale of mining equipment and components. In addition, the company invests in coal, electricity, and heat industries, as well as power resources; and provides coal mine improvement services. As of December 31, 2020, it had 67 controlled power plants with a total installed capacity of 58,448 MW, including a total of 43,160 MW through coal-fired generating units and 7,340 MW through gas-fired generating units; and 7,948 MW through renewable energy generating units, such as hydro, wind, and solar power. The company was incorporated in 1994 and is based in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.hdpi.com.cn",
        "market_cap": "Mid Cap"
    },
    "TLJ.F": {
        "short_name": "CN TIAN LUN GAS HL.HD-,01",
        "long_name": "China Tian Lun Gas Holdings Limited",
        "summary": "China Tian Lun Gas Holdings Limited, together with its subsidiaries, engages in the transportation, distribution, and sale of natural gas and compressed natural gas through its gas pipeline connections in the People' Republic of China. The company provides construction, designing, laying, installation, and maintenance services for gas pipeline connections. It also constructs and operates gas filling stations; produces and sells liquefied natural gas in bulk and in cylinders; sells gas equipment; provides engineering design and consulting, and new energy technology development services; trades in natural gas equipment; invests in equity and assets; and sells urban gas and gas appliances. The company serves to residential, vehicles, commercial, and industrial sectors. It owns 51 gas refilling stations. The company was founded in 2002 and is headquartered in Zhengzhou, the People's Republic of China. China Tian Lun Gas Holdings Limited is a subsidiary of Tian Lun Group Limited.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Zhengzhou",
        "zipcode": "450003",
        "website": "http://www.tianlungas.com",
        "market_cap": "Small Cap"
    },
    "XGH.F": {
        "short_name": "ENN ENERGY HLDGS  HD-,10",
        "long_name": "ENN Energy Holdings Limited",
        "summary": "ENN Energy Holdings Limited, an investment holding company, engages in the investment, construction, operation, and management of gas pipeline infrastructures; and integrated energy, and vehicle and ship refueling stations in the People's Republic of China. It operates through Retail Gas Sales Business, Integrated Energy Business, Wholesale of Gas, Construction and Installation, and Value Added Business segments. The company also sells and distributes piped gas, liquefied natural gas, and other multi-energy products; and provides other services in relation to energy supply. In addition, it is involved in the business of energy trading; retail of gas pipelines, and related materials and equipment; transportation of oil products and gas; and sourcing of compressed pipeline gas, as well as wholesale and retail of LNG, CNG, gas equipment, appliances, and others; and provision of financial services. As of December 31, 2020, the company served approximately 23.21 million residential customers and 177,128 commercial/industrial customers. The company was formerly known as XinAo Gas Holdings Limited and changed its name to ENN Energy Holdings Limited in September 2010. ENN Energy Holdings Limited was founded in 1992 and is headquartered in Langfang, China.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Langfang",
        "zipcode": "065001",
        "website": "http://www.ennenergy.com",
        "market_cap": "Large Cap"
    },
    "XNGSF": {
        "short_name": "ENN ENERGY HOLDINGS LTD",
        "long_name": "ENN Energy Holdings Limited",
        "summary": "ENN Energy Holdings Limited, an investment holding company, engages in the investment, construction, operation, and management of gas pipeline infrastructures; and integrated energy, and vehicle and ship refueling stations in the People's Republic of China. It operates through Retail Gas Sales Business, Integrated Energy Business, Wholesale of Gas, Construction and Installation, and Value Added Business segments. The company also sells and distributes piped gas, liquefied natural gas, and other multi-energy products; and provides other services in relation to energy supply. In addition, it is involved in the business of energy trading; retail of gas pipelines, and related materials and equipment; transportation of oil products and gas; and sourcing of compressed pipeline gas, as well as wholesale and retail of LNG, CNG, gas equipment, appliances, and others; and provision of financial services. As of December 31, 2020, the company served approximately 23.21 million residential customers and 177,128 commercial/industrial customers. The company was formerly known as XinAo Gas Holdings Limited and changed its name to ENN Energy Holdings Limited in September 2010. ENN Energy Holdings Limited was founded in 1992 and is headquartered in Langfang, China.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Langfang",
        "zipcode": "065001",
        "website": "http://www.ennenergy.com",
        "market_cap": "Large Cap"
    },
    "XNGSY": {
        "short_name": "ENN ENERGY HOLDINGS LTD",
        "long_name": "ENN Energy Holdings Limited",
        "summary": "ENN Energy Holdings Limited, an investment holding company, engages in the investment, construction, operation, and management of gas pipeline infrastructures; and integrated energy, and vehicle and ship refueling stations in the People's Republic of China. It operates through Retail Gas Sales Business, Integrated Energy Business, Wholesale of Gas, Construction and Installation, and Value Added Business segments. The company also sells and distributes piped gas, liquefied natural gas, and other multi-energy products; and provides other services in relation to energy supply. In addition, it is involved in the business of energy trading; retail of gas pipelines, and related materials and equipment; transportation of oil products and gas; and sourcing of compressed pipeline gas, as well as wholesale and retail of LNG, CNG, gas equipment, appliances, and others; and provision of financial services. As of December 31, 2020, the company served approximately 23.21 million residential customers and 177,128 commercial/industrial customers. The company was formerly known as XinAo Gas Holdings Limited and changed its name to ENN Energy Holdings Limited in September 2010. ENN Energy Holdings Limited was founded in 1992 and is headquartered in Langfang, China.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Langfang",
        "zipcode": "065001",
        "website": "http://www.ennenergy.com",
        "market_cap": "Large Cap"
    },
    "ZHYLF": {
        "short_name": "ZHAOHENG HYDROPOWER LIMITED",
        "long_name": "Zhaoheng Hydropower Ltd.",
        "summary": "Zhaoheng Hydropower Ltd. engages in the generation and supply of hydropower in southwestern and midwestern China. The company involves in the investment, operation, and development of small- to medium-sized hydropower plants. It serves primarily power grid companies that engage in electricity transmission and distribution. As of December 31, 2008, Zhaoheng Hydropower owned and operated 17 generating units with an installed capacity of approximately 132.85 megawatts. The company is headquartered in Shenzhen, People's Republic of China.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518015",
        "website": "http://www.zhyp.hk/en",
        "market_cap": "Nano Cap"
    }
}