{
    "0902.HK": {
        "short_name": "HUANENG POWER",
        "long_name": "Huaneng Power International, Inc.",
        "summary": "Huaneng Power International, Inc., together with its subsidiaries, generates and sells electricity and heat to the regional or provincial grid companies in the People's Republic of China and internationally. It is involved in the development, investment, construction, operation, and management of power plants and related projects; and generation, wholesale, and retail of power and other relating utilities. The company generates power from gas turbine, hydro, wind, photovoltaic, biomass, coal, solar, and oil resources. It is also involved in the sale of coal ash and lime; provision of cargo loading and storage, port, warehousing, and conveying services; photovoltaic power generation projects development and construction; and provision of thermal energy and cold energy services, as well as thermal heating services. In addition, the company engages in the repair of power equipment; provision of water supply and transportation services; construction and operation of electricity distribution networks and heating pipe networks; energy supply, energy transmission, and substation project contracting activities; cargo transportation; and port management, investment, and development activities. Further, it is involved in the management of industrial water and waste, as well as provides environment engineering, and information technology and management consulting services. Additionally, it sells raw and processed coal; and provides central heat, and plumbing and pipe installation services, as well as desalinated water. As of December 31, 2020, the company had a controlled generating capacity of 113,357 megawatts and an equity-based installed capacity of 98,948 megawatts. Huaneng Power International, Inc. was incorporated in 1994 and is based in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "0991.HK": {
        "short_name": "DATANG POWER",
        "long_name": "Datang International Power Generation Co., Ltd.",
        "summary": "Datang International Power Generation Co., Ltd., together with its subsidiaries, engages in power generation and power plant development activities in the People's Republic of China. The company operates through Power and heat generation, Coal, and Other segments. It generates electricity through various sources, such as coal-fired, thermal, hydro, wind, nuclear, biomass, and solar. As of December 31, 2019, the company managed an installed capacity of approximately 68,278.10 MW. It also engages in heat supply; the import of power related fuel; coal mining and trading; silicon and aluminum smelting; production and sale of alumina; cargo shipping; sale of coal ash and integrated application of solid waste; power plant construction and operation; repair and testing of power equipment; research and development activities; and provision of power related technical services. The company was formerly known as Beijing Datang Power Generation Co., Ltd and changed its name to Datang International Power Generation Co, Ltd. in April 2004. The company was founded in 1994 and is headquartered in Beijing, the People's Republic of China. Datang International Power Generation Co., Ltd. is a subsidiary of China Datang Corporation Limited.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "1281.HK": {
        "short_name": "LT SMART ENERGY",
        "long_name": "LongiTech Smart Energy Holding Limited",
        "summary": "LongiTech Smart Energy Holding Limited, together with its subsidiaries, engages in the smart energy and public infrastructure construction businesses in the People's Republic of China. The company offers smart energy comprehensive utilization services, which include multi-energy complementation of electricity, heat, and gas; smart operation and maintenance; energy trade; energy efficiency analysis; and consultancy management. It is also involved in the operation of solar power plants; investment and post-construction operation management business; and other clean energy business. The company was formerly known as Long Ji Tai He Holding Limited and changed its name to LongiTech Smart Energy Holding Limited in August 2016. LongiTech Smart Energy Holding Limited was incorporated in 2011 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "1671.HK": {
        "short_name": "TIANBAO ENERGY",
        "long_name": "Tianjin Tianbao Energy Co., Ltd.",
        "summary": "Tianjin Tianbao Energy Co., Ltd. generates and supplies power in the People's Republic of China. The company operates through three segments: Electricity Dispatch and Sale, Power Generation and Supply, and Other. It generates and supplies steam, heating, and cooling to industrial and commercial customers; and purchases, dispatches, and sells electricity. The company also provides power facility construction, and industrial facilities operation and maintenance; and trades in electrical components. It operates two back-pressure cogeneration units with a total installed capacity of 30 megawatts. The company was founded in 1992 and is headquartered in Tianjin, the People's Republic of China. Tianjin Tianbao Energy Co., Ltd. is a subsidiary of Tianjin Tianbao Holdings Limited.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Tianjin"
    },
    "1853.HK": {
        "short_name": "CHUNCHENG HEAT",
        "long_name": "Jilin Province Chuncheng Heating Company Limited",
        "summary": "Jilin Province Chuncheng Heating Company Limited provides heat supply services in the People's Republic of China. The company is involved in the provision, distribution, and transmission of heat; and pipeline connection activities. As of December 31, 2019, its heat service area consisted of approximately 39.5 million square meters. The company also offers engineering construction and maintenance; design, consulting, and feasibility studies related to heating projects; electrical and instrument maintenance and repair services; and supplies biomass heat. It serves approximately 320,000 residential and non-residential users. The company was founded in 1998 and is headquartered in Changchun, China. Jilin Province Chuncheng Heating Company Limited is a subsidiary of Changchun Heating Power (Group) Company Limited.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Changchun"
    },
    "600011.SS": {
        "short_name": "HUANENG POWER INTERNATIONAL INC",
        "long_name": "Huaneng Power International, Inc.",
        "summary": "Huaneng Power International, Inc., together with its subsidiaries, generates and sells electricity and heat to the regional or provincial grid companies in the People's Republic of China and internationally. It is involved in the development, investment, construction, operation, and management of power plants and related projects; and generation, wholesale, and retail of power and other relating utilities. The company generates power from gas turbine, hydro, wind, photovoltaic, biomass, coal, solar, and oil resources. It is also involved in the sale of coal ash and lime; provision of cargo loading and storage, port, warehousing, and conveying services; photovoltaic power generation projects development and construction; and provision of thermal energy and cold energy services, as well as thermal heating services. In addition, the company engages in the repair of power equipment; provision of water supply and transportation services; construction and operation of electricity distribution networks and heating pipe networks; energy supply, energy transmission, and substation project contracting activities; cargo transportation; and port management, investment, and development activities. Further, it is involved in the management of industrial water and waste, as well as provides environment engineering, and information technology and management consulting services. Additionally, it sells raw and processed coal; and provides central heat, and plumbing and pipe installation services, as well as desalinated water. As of December 31, 2020, the company had a controlled generating capacity of 113,357 megawatts and an equity-based installed capacity of 98,948 megawatts. Huaneng Power International, Inc. was incorporated in 1994 and is based in Beijing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "600023.SS": {
        "short_name": "ZHEJIANG ZHENENG ELECTRIC POWER",
        "long_name": "Zhejiang Zheneng Electric Power Co., Ltd.",
        "summary": "Zhejiang Zheneng Electric Power Co., Ltd. engages in thermal power generation business in China. It also provides thermal products, as well as invests and manages gas power and nuclear power projects. The company is based in Hangzhou, China. Zhejiang Zheneng Electric Power Co., Ltd. is a subsidiary of Zhejiang Provincial Energy Group Company Ltd.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "600578.SS": {
        "short_name": "BEIJING JINGNENG POWER CO LTD",
        "long_name": "Beijing Jingneng Power Co., Ltd.",
        "summary": "Beijing Jingneng Power Co., Ltd. generates and distributes electricity in China. It generates electricity from coal and thermal resources. The company is also involved in the steam and heat supply activities. Beijing Jingneng Power Co., Ltd. is based in Beijing, China. Beijing Jingneng Power Co., Ltd. was formerly a subsidiary of Beijing Jingneng Clean Energy Co., Limited.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "600674.SS": {
        "short_name": "SICHUAN CHUANTOU ENERGY CO LTD",
        "long_name": "Sichuan Chuantou Energy Co.,Ltd.",
        "summary": "Sichuan Chuantou Energy Co.,Ltd. engages in the hydropower, clean energy development, and railway information system businesses in China. It generates power with an installed capacity of 28.30 million kilowatts. The company was formerly known as Sichuan Chuantou Holding Company Limited and changed its name to Sichuan Chuantou Energy Co.,Ltd. in May 2005. Sichuan Chuantou Energy Co.,Ltd. was founded in 1988 and is headquartered in Chengdu, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Chengdu"
    },
    "600719.SS": {
        "short_name": "DALIAN THERMAL POWER CO LTD",
        "long_name": "Dalian Thermal Power Co.,Ltd.",
        "summary": "Dalian Thermal Power Co.,Ltd. generates thermal power and heat in China. The company offers steam, hot water, and heat. It also operates five thermal power plants with a total installed capacity of 328.25 MW; and total heat supply of hot water boilers with 443.2 MW. The company was founded in 2000 and is based in Dalian, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Dalian"
    },
    "600726.SS": {
        "short_name": "HUADIAN ENERGY CO. LTD.",
        "long_name": "Huadian Energy Company Limited",
        "summary": "Huadian Energy Company Limited generates electric power in China. The company generates electric power through thermal sources. It has an installed capacity of 6.15 million kilowatts of thermal power. The company was formerly known as Heilongjiang Electric Power Co. Ltd. and changed its name to Huadian Energy Company Limited in July 2004. Huadian Energy Company Limited was founded in 1993 and is based in Harbin, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Harbin"
    },
    "600863.SS": {
        "short_name": "INNER MONGOLIA MENGDIAN HN(THE)",
        "long_name": "Inner Mongolia MengDian HuaNeng Thermal Power Corporation Limited",
        "summary": "Inner Mongolia MengDian HuaNeng Thermal Power Corporation Limited engages in electric power generation business. The company is based in Hohhot, China. Inner Mongolia MengDian HuaNeng Thermal Power Corporation Limited operates as a subsidiary of North United Power Corporation.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Hohhot"
    },
    "600900.SS": {
        "short_name": "CHINA YANGTZE POWER CO",
        "long_name": "China Yangtze Power Co., Ltd.",
        "summary": "China Yangtze Power Co.,Ltd., together with its subsidiaries, engages in operation, management, consultation, investment, and financing of hydropower stations in the People's Republic of China. The company owns, operates, and manages hydropower generation assets in the Three Gorges, Gezhouba, Xiluodu, and Xiangjiaba with an installed capacity of 45,495 MW. It is also involved in production and distribution of power, electricity, and heat business; and provision of high-technology and software development services. The company was founded in 2002 and is based in Beijing, the People's Republic of China. China Yangtze Power Co.,Ltd. is a subsidiary of China Three Gorges Corporation.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "601985.SS": {
        "short_name": "CHINA NATIONAL NUCLEAR POWER CO",
        "long_name": "China National Nuclear Power Co., Ltd.",
        "summary": "China National Nuclear Power Co., Ltd. invests in, develops, constructs, operates, and manages nuclear power projects in the People's Republic of China. The company also provides nuclear power project related technical and consultancy services. It operates 14 nuclear power units with an installed capacity of 11,512 MWe. The company is headquartered in Beijing, the People's Republic of China. China National Nuclear Power Co., Ltd. is a subsidiary of China National Nuclear Corporation.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "900957.SS": {
        "short_name": "SHANGHAI LINGYUN INDUSTRIES DEV",
        "long_name": "Shanghai Lingyun Industries Development Co., Ltd",
        "summary": "Shanghai Lingyun Industries Development Co., Ltd constructs and operates photovoltaic power generation projects. It operates a 100 megawatts photovoltaic power station in Baiyin, China. The company was incorporated in 1998 and is based in Shanghai, China.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "BJI.F": {
        "short_name": "DATANG INTL POW.GE.-H-YC1",
        "long_name": "Datang International Power Generation Co., Ltd.",
        "summary": "Datang International Power Generation Co., Ltd., together with its subsidiaries, engages in power generation and power plant development activities in the People's Republic of China. The company operates through Power and heat generation, Coal, and Other segments. It generates electricity through various sources, such as coal-fired, thermal, hydro, wind, nuclear, biomass, and solar. As of December 31, 2019, the company managed an installed capacity of approximately 68,278.10 MW. It also engages in heat supply; the import of power related fuel; coal mining and trading; silicon and aluminum smelting; production and sale of alumina; cargo shipping; sale of coal ash and integrated application of solid waste; power plant construction and operation; repair and testing of power equipment; research and development activities; and provision of power related technical services. The company was formerly known as Beijing Datang Power Generation Co., Ltd and changed its name to Datang International Power Generation Co, Ltd. in April 2004. The company was founded in 1994 and is headquartered in Beijing, the People's Republic of China. Datang International Power Generation Co., Ltd. is a subsidiary of China Datang Corporation Limited.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "CYZB.F": {
        "short_name": "CN YANGT.PWR GDR REG S/A",
        "long_name": "China Yangtze Power Co., Ltd.",
        "summary": "China Yangtze Power Co., Ltd., together with its subsidiaries, engages in operation, management, consultation, investment, and financing of hydropower stations in the People's Republic of China. The company owns, operates, and manages hydropower generation assets in the Three Gorges, Gezhouba, Xiluodu, and Xiangjiaba with an installed capacity of 45,495 MW. It is also involved in production and distribution of power, electricity, and heat business; and provision of high-technology and software development services. The company was founded in 2002 and is based in Beijing, the People's Republic of China. China Yangtze Power Co., Ltd. is a subsidiary of China Three Gorges Corporation.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "DIPGY": {
        "short_name": "DATANG INTERNATIONAL POWER GENE",
        "long_name": "Datang International Power Generation Co., Ltd.",
        "summary": "Datang International Power Generation Co., Ltd., together with its subsidiaries, engages in power generation and power plant development activities in the People's Republic of China. The company operates through Power and heat generation, Coal, and Other segments. It generates electricity through various sources, such as coal-fired, thermal, hydro, wind, nuclear, biomass, and solar. As of December 31, 2019, the company managed an installed capacity of approximately 68,278.10 MW. It also engages in heat supply; the import of power related fuel; coal mining and trading; silicon and aluminum smelting; production and sale of alumina; cargo shipping; sale of coal ash and integrated application of solid waste; power plant construction and operation; repair and testing of power equipment; research and development activities; and provision of power related technical services. The company was formerly known as Beijing Datang Power Generation Co., Ltd and changed its name to Datang International Power Generation Co, Ltd. in April 2004. The company was founded in 1994 and is headquartered in Beijing, the People's Republic of China. Datang International Power Generation Co., Ltd. is a subsidiary of China Datang Corporation Limited.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "HNP": {
        "short_name": "Huaneng Power Intl",
        "long_name": "Huaneng Power International, Inc.",
        "summary": "Huaneng Power International, Inc., together with its subsidiaries, generates and sells electricity and heat to the regional or provincial grid companies in the People's Republic of China and internationally. It is involved in the development, investment, construction, operation, and management of power plants and related projects; and generation, wholesale, and retail of power and other relating utilities. The company generates power from gas turbine, hydro, wind, photovoltaic, biomass, coal, solar, and oil resources. It is also involved in the sale of coal ash and lime; provision of cargo loading and storage, port, warehousing, and conveying services; photovoltaic power generation projects development and construction; and provision of thermal energy and cold energy services, as well as thermal heating services. In addition, the company engages in the repair of power equipment; provision of water supply and transportation services; construction and operation of electricity distribution networks and heating pipe networks; energy supply, energy transmission, and substation project contracting activities; cargo transportation; and port management, investment, and development activities. Further, it is involved in the management of industrial water and waste, as well as provides environment engineering, and information technology and management consulting services. Additionally, it sells raw and processed coal; and provides central heat, and plumbing and pipe installation services, as well as desalinated water. As of December 31, 2020, the company had a controlled generating capacity of 113,357 megawatts and an equity-based installed capacity of 98,948 megawatts. Huaneng Power International, Inc. was incorporated in 1994 and is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "HUNGF": {
        "short_name": "HUANENG POWER INTERNATIONAL INC",
        "long_name": "Huaneng Power International, Inc.",
        "summary": "Huaneng Power International, Inc., together with its subsidiaries, generates and sells electricity and heat to the regional or provincial grid companies in the People's Republic of China and internationally. It is involved in the development, investment, construction, operation, and management of power plants and related projects; and generation, wholesale, and retail of power and other relating utilities. The company generates power from gas turbine, hydro, wind, photovoltaic, biomass, coal, solar, and oil resources. It is also involved in the sale of coal ash and lime; provision of cargo loading and storage, port, warehousing, and conveying services; photovoltaic power generation projects development and construction; and provision of thermal energy and cold energy services, as well as thermal heating services. In addition, the company engages in the repair of power equipment; provision of water supply and transportation services; construction and operation of electricity distribution networks and heating pipe networks; energy supply, energy transmission, and substation project contracting activities; cargo transportation; and port management, investment, and development activities. Further, it is involved in the management of industrial water and waste, as well as provides environment engineering, and information technology and management consulting services. Additionally, it sells raw and processed coal; and provides central heat, and plumbing and pipe installation services, as well as desalinated water. As of December 31, 2020, the company had a controlled generating capacity of 113,357 megawatts and an equity-based installed capacity of 98,948 megawatts. Huaneng Power International, Inc. was incorporated in 1994 and is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "HUP.F": {
        "short_name": "HUANENG PWR H YC 1 ADR/40",
        "long_name": "Huaneng Power International, Inc.",
        "summary": "Huaneng Power International, Inc., together with its subsidiaries, generates and sells electricity and heat to the regional or provincial grid companies in the People's Republic of China and internationally. It is involved in the development, investment, construction, operation, and management of power plants and related projects; and generation, wholesale, and retail of power and other relating utilities. The company generates power from gas turbine, hydro, wind, photovoltaic, biomass, coal, solar, and oil resources. It is also involved in the sale of coal ash and lime; provision of cargo loading and storage, port, warehousing, and conveying services; photovoltaic power generation projects development and construction; and provision of thermal energy and cold energy services, as well as thermal heating services. In addition, the company engages in the repair of power equipment; provision of water supply and transportation services; construction and operation of electricity distribution networks and heating pipe networks; energy supply, energy transmission, and substation project contracting activities; cargo transportation; and port management, investment, and development activities. Further, it is involved in the management of industrial water and waste, as well as provides environment engineering, and information technology and management consulting services. Additionally, it sells raw and processed coal; and provides central heat, and plumbing and pipe installation services, as well as desalinated water. As of December 31, 2020, the company had a controlled generating capacity of 113,357 megawatts and an equity-based installed capacity of 98,948 megawatts. Huaneng Power International, Inc. was incorporated in 1994 and is based in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "HUP1.F": {
        "short_name": "HUANENG PWR INTL H  YC 1",
        "long_name": "Huaneng Power International, Inc.",
        "summary": "Huaneng Power International, Inc., together with its subsidiaries, generates and sells electricity and heat to the regional or provincial grid companies in the People's Republic of China and internationally. It is involved in the development, investment, construction, operation, and management of power plants and related projects; and generation, wholesale, and retail of power and other relating utilities. The company generates power from gas turbine, hydro, wind, photovoltaic, biomass, coal, solar, and oil resources. It is also involved in the sale of coal ash and lime; provision of cargo loading and storage, port, warehousing, and conveying services; photovoltaic power generation projects development and construction; and provision of thermal energy and cold energy services, as well as thermal heating services. In addition, the company engages in the repair of power equipment; provision of water supply and transportation services; construction and operation of electricity distribution networks and heating pipe networks; energy supply, energy transmission, and substation project contracting activities; cargo transportation; and port management, investment, and development activities. Further, it is involved in the management of industrial water and waste, as well as provides environment engineering, and information technology and management consulting services. Additionally, it sells raw and processed coal; and provides central heat, and plumbing and pipe installation services, as well as desalinated water. As of December 31, 2020, the company had a controlled generating capacity of 113,357 megawatts and an equity-based installed capacity of 98,948 megawatts. Huaneng Power International, Inc. was incorporated in 1994 and is based in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    }
}