{
  "0239.HK": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "Pak Fah Yeow International Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "PAK FAH YEOW",
    "state": null,
    "summary": "Pak Fah Yeow International Limited, an investment holding company, together with its subsidiaries, manufactures, markets, and distributes healthcare products under the Hoe Hin brand name in the People's Republic of China, Hong Kong, Macau, Southeast Asia, North America, the United Kingdom, and internationally. It operates through three segments: Healthcare, Property Investments, and Treasury Investments. The company offers white flower embrocation medicated oils, strain relief products, and ointments under the under the Hoe Hin brand name, as well as Fúzai 239, a floral-scented white flower embrocation. In addition, it invests in commercial, industrial, residential, and car park properties; and provides advertising agency services. The company was founded in 1927 and is headquartered in Wan Chai, Hong Kong.",
    "website": "http://www.pakfahyeow.com",
    "zipcode": null
  },
  "0241.HK": {
    "city": "Causeway Bay",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Alibaba Health Information Technology Limited",
    "market": "hk_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "ALI HEALTH",
    "state": null,
    "summary": "Alibaba Health Information Technology Limited, an investment holding company, engages in the pharmaceutical e-commerce, intelligent medicine, and product tracking platform businesses in the People's Republic of China. It engages in business-to-customer (B2C) retail activities; advertisement business; and business-to-business (B2B) centralized procurement distribution business. The company also provides pharmaceutical and healthcare products through its online stores on Tmall.com and offline pharmacy outlets to B2C and B2B customers; marketing services; health consultation services; outsourced and value-added services to the Tmall entities; and telemedicine services. In addition, it trades in pharmaceutical products; and provides network hospital services. The company was formerly known as CITIC 21CN Company Limited and changed its name to Alibaba Health Information Technology Limited in September 2014. The company is based in Causeway Bay, Hong Kong. Alibaba Health Information Technology Limited is a subsidiary of Perfect Advance Holding Limited.",
    "website": "http://www.alihealth.cn",
    "zipcode": null
  },
  "0286.HK": {
    "city": "Kowloon Bay",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Medical Care Facilities",
    "long_name": "Aidigong Maternal & Child Health Limited",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "AIDIGONG",
    "state": null,
    "summary": "Aidigong Maternal & Child Health Limited, an investment holding company, provides postpartum care and healthcare services in the People's Republic of China and Hong Kong. It operates through Postpartum Care Services, Health Industry, and Other segments. The company offers maternal and child healthcare services; medical anti-aging services; healthcare industry investment services; and healthcare property development services, as well as trades in natural health food and pharmaceutical products. It also offers precision life healthcare, bio-medical technology, management, and aesthetic and beauty treatment services, as well as investment and finance services. The company was formerly known as Common Splendor International Health Industry Group Limited and changed its name to Aidigong Maternal & Child Health Limited in December 2019. Aidigong Maternal & Child Health Limited is based in Kowloon Bay, Hong Kong.",
    "website": "http://www.aidigong.hk",
    "zipcode": null
  },
  "0401.HK": {
    "city": "Kowloon",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Medical Distribution",
    "long_name": "Wanjia Group Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "WANJIA GROUP",
    "state": null,
    "summary": "Wanjia Group Holdings Limited, an investment holding company, engages in pharmaceutical wholesale and distribution business in the People's Republic of China and Hong Kong. It also offers hemodialysis treatment and consultancy services. The company sells its products to hospitals and healthcare institutions; and companies operating pharmaceutical retail chain stores, independent pharmacies, outpatient departments of community hospitals, healthcare service stations, and clinics in Fujian province. Wanjia Group Holdings Limited was founded in 2004 and is headquartered in Kowloon, Hong Kong.",
    "website": "http://www.wanjia-gp.com",
    "zipcode": null
  },
  "0455.HK": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "Tianda Pharmaceuticals Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "TIANDA PHARMA",
    "state": null,
    "summary": "Tianda Pharmaceuticals Limited, an investment holding company, engages in the research and development, production, and sale of pharmaceutical, biotechnology, and healthcare products in Mainland China, Hong Kong, and Australia. Its product range includes Chinese and western medicines and biochemical drugs, etc., such as cardio-cerebrovascular drugs, pediatric drugs, anti-flu and respiratory system drugs, anti-infection drugs, detoxification agents, and other pharmaceutical products. The company offers its health care products under the Herb Valley brand name. It also engages in the sale and wholesale of Chinese herbal medicines, traditional Chinese medicine decoction pieces and Chinese medicines; property holding business; provision of Chinese medical services; and trading of agricultural by-products. The company was formerly known as Tianda Holdings Limited and changed its name to Tianda Pharmaceuticals Limited in September 2012. The company is headquartered in Central, Hong Kong. Tianda Pharmaceuticals Limited is a subsidiary of Tianda Group Limited.",
    "website": "http://www.tiandapharma.com",
    "zipcode": null
  },
  "0460.HK": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "Sihuan Pharmaceutical Holdings Group Ltd.",
    "market": "hk_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "SIHUAN PHARM",
    "state": null,
    "summary": "Sihuan Pharmaceutical Holdings Group Ltd., an investment holding company, engages in the research and development, manufacture, and sale of pharmaceutical products in the People's Republic of China. The company offers cardio-cerebral vascular system, digestive system, metabolism, anti-infective, respiratory, neurology, and other drugs. It also engages in the marketing of pharmaceutical products; manufacture of pharmaceutical materials and medical instruments; project preparation for the manufacture of pharmaceutical products; promotion of technology, biotechnology, and consulting services; and construction of medical projects, as well as the provision of information support, research and development, business and development, and general hospital and hospital management services. In addition, the company invests in property; constructs environmental protection projects; and wholesales chemical raw materials and medical devices. The company was founded in 2001 and is based in Wanchai, Hong Kong.",
    "website": "http://www.sihuanpharm.com",
    "zipcode": null
  },
  "0574.HK": {
    "city": "Kwun Tong",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Pa Shun International Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "PASHUN INT'L",
    "state": null,
    "summary": "Pa Shun International Holdings Limited, an investment holding company, engages in the pharmaceutical distribution activities in the People's Republic of China. It operates through three segments: Pharmaceutical Distribution, Self-Operated Retail Pharmacies, and Pharmaceutical Manufacturing. The Pharmaceutical Distribution segment sells pharmaceutical products to wholesalers, franchise retail pharmacy chain stores, and hospitals and other medical institutions in rural areas. The Self-Operated Retail Pharmacies segment engages in the sale of pharmaceutical and healthcare products, cosmetic products, and daily necessities in self-operated retail pharmacies. The Pharmaceutical Manufacturing segment sells pharmaceutical products manufactured by the company. The company was formerly known as Pa Shun Pharmaceutical International Holdings Limited and changed its name to Pa Shun International Holdings Limited in June 2017. The company was incorporated in 2011 and is based in Kwun Tong, Hong Kong. Pa Shun International Holdings Limited is a subsidiary of Praise Treasure Limited.",
    "website": "http://www.pashun.com.cn",
    "zipcode": null
  },
  "0722.HK": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Medical Care Facilities",
    "long_name": "UMP Healthcare Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "UMP",
    "state": null,
    "summary": "UMP Healthcare Holdings Limited, an investment holding company, provides a range of medical and healthcare services in the People's Republic of China. It operates through two segments, Corporate Healthcare Solution Services and Clinical Healthcare Services. The company offers virtual care; family medicine; specialist consultation services, including internal medicine, surgery, pediatrics, cardiology, dermatology, otorhinolaryngology, orthopedics, ophthalmology, urology, gastroenterology and hepatology, radiology, endocrinology, and diabetes; and dental care services, such as dental implant, cosmetic dentistry, periodontal treatments, and orthodontics, as well as traditional Chinese medicines. It also provides physiotherapy services comprises muscle-strengthening, limb function, eye-hand coordination, and hand function trainings; day surgery and endoscopy; diagnostic imaging and laboratory; health assessment; visa medical examination; vaccination and consultation; vision care and optometry; plastic, head, and neck surgeries; dermatology and aesthetics; chronic disease management; and child health and development services. In addition, the company engages in the provision of day surgery, endoscopy, and healthcare training services. It serves insurance companies and corporations, and self-paid patients. As of June 30, 2020, the company operated a network of approximately 800 self-owned and affiliated service points. UMP Healthcare Holdings Limited was founded in 1990 and is headquartered in Central, Hong Kong.",
    "website": "http://www2.ump.com.hk",
    "zipcode": null
  },
  "0858.HK": {
    "city": "Quarry Bay",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "Extrawell Pharmaceutical Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "EXTRAWELL PHAR",
    "state": null,
    "summary": "Extrawell Pharmaceutical Holdings Limited, an investment holding company, develops, manufactures, and sells pharmaceutical products in the People's Republic of China. It operates through Manufacturing, Trading, and Gene Development segments. The company offers transfer factor oral solution, a dual immune regulator for the treatment of diseases caused by virus infection and weak cellular immune system; and Wisk for the treatment of II-III degree of radio-injury of skin, normal common burn, actinic dermatitis, various infectious ulcers, and oral ulcers, as well as for trauma and post operation wound healing. It also provides ZhouBang, a thromboxane synthetase inhibitor to prevent the coagulation of platelets and facilitate relaxation of blood vessels. In addition, the company is involved in the marketing and distribution of imported pharmaceutical products, including GM-1 to treat lesions of central nervous system caused due to vascular or traumatic events, and Parkinson's disease; Millibar for the treatment of high blood pressure; and Skin-Cap for use in the treatment of psoriasis, dandruff, dermatitis, atopic dermatitis, eczema, and tinea. Further, it engages in the commercial exploitation and development of genome-related technology; provision of agency services; property investment business; and holds gene invention rights. The company is headquartered in Quarry Bay, Hong Kong.",
    "website": "http://www.extrawell.com.hk",
    "zipcode": null
  },
  "0876.HK": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Kaisa Health Group Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "KAISA HEALTH",
    "state": null,
    "summary": "Kaisa Health Group Holdings Limited, an investment holding company, manufactures and trades in dental prosthetics in the People's Republic of China and internationally. The company offers dental prosthetics, including crowns and bridges, removable full and partial dentures, implants, and full-cast restorations, as well as provides public health and medical services. It is also involved in the investment holding of convertible bonds and promissory notes, as well as provision of medical technology and health care project development, medical consultation, and other medical services. The company was formerly known as Mega Medical Technology Limited and changed its name to Kaisa Health Group Holdings Limited in January 2018. Kaisa Health Group Holdings Limited was founded in 1971 and is headquartered in Central, Hong Kong.",
    "website": "http://www.kaisahealth.com",
    "zipcode": null
  },
  "0897.HK": {
    "city": "Kowloon Bay",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "Wai Yuen Tong Medicine Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "WAI YUEN TONG",
    "state": null,
    "summary": "Wai Yuen Tong Medicine Holdings Limited, an investment holding company, manufactures, processes, and retails traditional Chinese medicine, western pharmaceutical products, and health food and personal products in Hong Kong, Mainland China, Macau, and internationally. The company offers Chinese medicines and health food products under the Wai Yuen Tong brand name; and western pharmaceutical and personal care products under the Madame Pearl's and Pearl's brands. It also engages in the investment, holding, and selling of properties; provision of financial services; and agricultural produce exchange market operation. It operates approximately 55 retail stores in Hong Kong. The company was founded in 1897 and is headquartered in Kowloon Bay, Hong Kong. Wai Yuen Tong Medicine Holdings Limited is a subsidiary of Rich Time Strategy Limited.",
    "website": "http://www.wyth.net",
    "zipcode": null
  },
  "0907.HK": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Elegance Optical International Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "ELEGANCEOPTICAL",
    "state": null,
    "summary": "Elegance Optical International Holdings Limited, an investment holding company, manufactures and trades in optical frames and sunglasses in the United States, Europe, the People's Republic of China, other Asian countries, and internationally. The company operates through four segments: Manufacturing and Trading, Property Investment, Debts and Securities Investment, and Film Investment and Distribution. It is also involved in property leasing and investment businesses; securities investment activities; investing in financial instruments and quoted shares; money lending and loan financing activities; film right and movie investment and distribution activities; and trading of bags. The company was formerly known as Elegance International Holdings Limited and changed its name to Elegance Optical International Holdings Limited in September 2013. Elegance Optical International Holdings Limited was founded in 1975 and is headquartered in Wan Chai, Hong Kong.",
    "website": "http://www.elegance-group.com",
    "zipcode": null
  },
  "0911.HK": {
    "city": "Sheung Wan",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "Qianhai Health Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "QIANHAI HEALTH",
    "state": null,
    "summary": "Qianhai Health Holdings Limited, an investment holding company, engages in the sale of health products in Hong Kong. It operates through Health-Care Products and Electronic Component Products segments. The company offers Chinese herbal medicines, and skin-care and other health-care products to wholesalers and retailers. It offers American ginseng, an herbaceous perennial plant, which includes cultivated and wild ginseng; and ginseng wine. The company is also involved in the sale of information technology components, such as central processing units and semi-conductors. In addition, it engages in the property and other assets holding, and property leasing activities; and money lending business through the provision of secured and unsecured loans. The company was formerly known as Hang Fat Ginseng Holdings Company Limited and changed its name to Qianhai Health Holdings Limited in September 2016. The company was founded in 1989 and is based in Sheung Wan, Hong Kong. Qianhai Health Holdings Limited is a subsidiary of Explorer Rosy Limited.",
    "website": "http://www.qianhaihealth.com.hk",
    "zipcode": null
  },
  "1134.HK": {
    "city": "Sha Tin",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Kelfred Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "KELFRED",
    "state": null,
    "summary": "Kelfred Holdings Limited, an investment holding company, manufactures and sells eyewear products. It produces a range of spectacle frames and sunglasses primarily through original design manufacturing and original equipment manufacturing business models. The company also offers original brand manufacturing products under the Miga brand. Its services include product design and development, raw materials procurement, production, quality control, packaging, and delivery. The company is operates in Italy, the United Kingdom, the Netherlands, Hong Kong, France, Spain, Hungary, the United States, and internationally. Kelfred Holdings Limited was founded in 1986 and is headquartered in Sha Tin, Hong Kong.",
    "website": "http://www.kelfred.com.hk",
    "zipcode": null
  },
  "1498.HK": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "PuraPharm Corporation Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "PURAPHARM",
    "state": null,
    "summary": "PuraPharm Corporation Limited, an investment holding company, researches, develops, produces, and sells concentrated Chinese medicine granule (CCMG) and Chinese healthcare products in Hong Kong, Mailand China, and internationally. The company operates through five segments: China CCMG, Hong Kong CCMG, Chinese Healthcare Products, Clinics, and Plantation. It offers holistic products under the PuraGold, Haveron, CardioClear, PuraPharm Lingzhi, and Arashi Kuni names; and various therapeutic products under the Nong's, Oncozac, and Immuzac names for Chinese medicine practitioners. It also provides Chinese medicine clinic management system for general clinic management; and operates Chinese medicine clinics under the Nong's name that provide Chinese medicine services and concentrated Chinese medicine granules (CCMG) products. In addition, the company engages in the plantation and trading of raw Chinese herbs; and manufacture and sale of traditional Chinese medicine decoction pieces. Further, it researches, develops, and trades in modernized Chinese medicines; and provides Chinese medical diagnostic services. The company sells its products to hospitals, medical institutions, and medicine practitioners, as well as operates an online store. As of December 31, 2019, the company operated 67 Nong's clinics in Hong Kong and 1 Nong's clinic in Guangxi, China. The company was founded in 1998 and is headquartered in Central, Hong Kong.",
    "website": "http://www.purapharm.com",
    "zipcode": null
  },
  "1612.HK": {
    "city": "Hung Hom",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Medical Devices",
    "long_name": "Vincent Medical Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "VINCENT MED",
    "state": null,
    "summary": "Vincent Medical Holdings Limited, an investment holding company, researches, develops, manufactures, markets, and sells medical devices. It operates in two segments, Original Equipment Manufacturing (OEM) and Original Brand Manufacturing. The company develops medical devices focusing on respiratory products; imaging contrast media power injector disposables; and orthopedic and rehabilitation products for OEM customers. Its respiratory products portfolio includes humidification systems, nCPAP interface systems, respiratory care units, electronic air-oxygen blenders, and anesthesia systems. The company's orthopedic and rehabilitation products comprise various adjustable rehabilitation braces for support and protection, and rehabilitation of various skeletomuscular parts after injury or surgery. It also develops robotic hand training devices. Vincent Medical Holdings Limited sells its products under the Inspired Medical, Hand of Hope, and Hypnus brand names in the People's Republic of China, the United States, the Netherlands, Australia, Japan, and internationally. The company was founded in 1997 and is headquartered in Hung Hom, Hong Kong. Vincent Medical Holdings Limited is a subsidiary of Vincent Raya International Limited.",
    "website": "http://www.vincentmedical.com",
    "zipcode": null
  },
  "2005.HK": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "SSY Group Limited",
    "market": "hk_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "SSY GROUP",
    "state": null,
    "summary": "SSY Group Limited, an investment holding company, researches, develops, manufactures, and sells various pharmaceutical products to hospitals and distributors in the People's Republic of China and internationally. The company offers intravenous infusion solutions, including non-PVC soft bags, upright soft bags, PP plastic bottles, and glass bottle infusion solutions, as well as ampoule injections. It also provides small volume injections, oral preparations, Chinese medicine preparations, and biological preparations, as well as bulk pharmaceutical products and medical materials. In addition, the company is involved in the research, development, and consulting of pharmaceutical technology; provision of logistics services for pharmaceutical products; and food, beverages, and catering business. It sells its products under Shimen brand name. The company was formerly known as Lijun International Pharmaceutical (Holding) Co., Ltd. and changed its name to SSY Group Limited in May 2015. The company was incorporated in 2004 and is headquartered in Wanchai, Hong Kong. SSY Group Limited is a subsidiary of China Pharmaceutical Co., Ltd.",
    "website": "http://www.ssygroup.com.hk",
    "zipcode": null
  },
  "2161.HK": {
    "city": "Kwun Tong",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Pharmaceutical Retailers",
    "long_name": "JBM (Healthcare) Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "JBM HEALTHCARE",
    "state": null,
    "summary": "JBM (Healthcare) Limited develops, manufactures, distributes, and markets healthcare and wellness products in Asia. It offers consumer healthcare and proprietary Chinese medicines, such as over-the-counter medicines, and medicated and non-medicated solutions, as well as diagnostic devices. The company was incorporated in 2020 and is headquartered in Kwun Tong, Hong Kong. JBM (Healthcare) Limited operates as a subsidiary of JBM Group (BVI) Limited.",
    "website": "http://www.jbmhealthcare.com.hk",
    "zipcode": null
  },
  "2189.HK": {
    "city": "Tuen Mun",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Medical Care Facilities",
    "long_name": "Kato (Hong Kong) Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "KATO (HK) HLDGS",
    "state": null,
    "summary": "Kato (Hong Kong) Holdings Limited operates residential care homes for the elderly in Hong Kong. The company provides a range of residential care services for the elderly, including accommodation, professional nursing and care-taking, nutritional management, medical, physiotherapy and occupational therapy, psychological and social care, individual care, and recreational services; and sells healthcare and medical goods, as well as offers add-on healthcare services to its residents. As of March 31, 2020, it operated eight care and attention homes for the elderly with 1,129 residential care places across four districts in Hong Kong under the Fai To, Kato, Happy Luck Home, Tsuen Wan Centre, and Pine Villa brand names. The company was founded in 1991 and is based in Tuen Mun, Hong Kong. Kato (Hong Kong) Holdings Limited is a subsidiary of Sheung Fung Limited.",
    "website": "http://www.elderlyhk.com",
    "zipcode": null
  },
  "2293.HK": {
    "city": "Tsim Sha Tsui",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Medical Care Facilities",
    "long_name": "Bamboos Health Care Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "BAMBOOSHEALTH",
    "state": null,
    "summary": "Bamboos Health Care Holdings Limited, an investment holding company, provides healthcare staffing solution services in Hong Kong. It offers 24-hour private nursing services; home care and consultation solutions; nursing and rehabilitation assessment; and physiotherapy and occupational therapy solutions. The company also provides healthcare personnel and healthcare staffing solutions; and marketing and consulting services, as well as operates aesthetic clinic. It serves individuals and institutional clients, including hospitals, social service organizations, and clinics. The company was founded in 2009 and is headquartered in Tsim Sha Tsui, Hong Kong.",
    "website": "http://www.bamboos.com.hk",
    "zipcode": null
  },
  "2348.HK": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "Dawnrays Pharmaceutical (Holdings) Limited",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "DAWNRAYS PHARMA",
    "state": null,
    "summary": "Dawnrays Pharmaceutical (Holdings) Limited, an investment holding company, develops, manufactures, and sells non-patented pharmaceutical medicines in Mainland China and internationally. The company operates in two segments, Intermediates and Bulk Medicines, and Finished Drugs. It offers antibiotics, including pharmaceutical intermediates, bulk medicines, powder for injections, and oral antibiotics; and system specific medicines for various therapeutic areas comprising cardiovascular system, anti-allergic, anti-HBV, digestive system, urinary system, anti-pyretic analgesic, respiratory, and endocrine system drugs in the form of tablets, capsules, and granules. The company was founded in 1995 and is headquartered in Wanchai, Hong Kong. Dawnrays Pharmaceutical (Holdings) Limited is a subsidiary of Fortune United Group Limited.",
    "website": "http://www.dawnrays.com",
    "zipcode": null
  },
  "2633.HK": {
    "city": "Kwun Tong",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "Jacobson Pharma Corporation Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "JACOBSON PHARMA",
    "state": null,
    "summary": "Jacobson Pharma Corporation Limited, through its subsidiaries, manufactures and trades in generic drugs and proprietary medicines in Hong Kong, China, Macau, Singapore, and internationally. The company offers generic drugs for various therapeutic categories, including respiratory, cardiovascular, central nervous system, gastrointestinal, scar treatment, and oral anti-diabetics, anti-infective, diltiazem controlled release, dihydrocodeine, perindopril tablets. propranolol oral solution, mesalazine enteric coated tablets 500mg and finasteride tablets dermatological, and anti-allergic drugs. It also provides proprietary Chinese medicines, such as Po Chai pills, Ho Chai Kung Tji Thung San, Tong Tai Chung Woodlok oil, Flying Eagle Woodlok Oil, Saplingtan/Shiling oil, and Col-gan tablet. In addition, it trades in medical supplies. Jacobson Pharma Corporation Limited sells its products to hospitals and clinics, and registered pharmacies, as well as to doctors in private and retail outlets, and trading companies. The company was incorporated and is headquartered in Kwun Tong, Hong Kong. Jacobson Pharma Corporation Limited is a subsidiary of Kingshill Development Limited.",
    "website": "http://www.jacobsonpharma.com",
    "zipcode": null
  },
  "300639.SZ": {
    "city": "Sheung Wan",
    "country": "Hong Kong",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Diagnostics & Research",
    "long_name": "Guangdong Hybribio Biotech Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "GUANGDONG HYBRIBIO",
    "state": null,
    "summary": "Guangdong Hybribio Biotech Co.,Ltd. engages in the research and development, manufacture, sale, marketing, and after-sales technical support services of in-vitro diagnostic products for hospitals and medical institutes. It provides in-vitro diagnostic kits for human papilloma virus, sexually transmitted diseases, thalassemia, and prenatal neonatal. The company also offers female sample collection kits; DNA extraction kits, such as hepatitis B virus real-time PCR kits and thalassemia gene diagnostic kits; and devices/instruments, including flow-through hybridization, auto DNA extraction, and fluorescent quantitative detection systems. Its products are used in the fields of clinical detection, large scale screening, research, and prenatal and neonatal management applications. The company operates in the Asia Pacific, the South East Asia, the Middle East, Europe, Africa, and South America. Guangdong Hybribio Biotech Co.,Ltd. is based in Sheung Wan, Hong Kong.",
    "website": "http://www.hybribio.cn",
    "zipcode": null
  },
  "3390.HK": {
    "city": "Sha Tin",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Tycoon Group Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "TYCOON GROUP",
    "state": null,
    "summary": "Tycoon Group Holdings Limited, an investment holding company, distributes a suite of health and well-being related products in Hong Kong, Mainland China, Macau, and Singapore. It operates through Distribution, Retail Stores, and Online Stores segments. The company offers proprietary Chinese medicine, health supplement, skin care, personal care, and other healthcare products under the third-party and private label brands. It sells its products to chain retailers, non-chain retailers, and traders; and individual customers through two brick-and-mortar retail stores and online stores. The company was founded in 2015 and is headquartered in Shatin, Hong Kong.",
    "website": "http://www.tycoongroup.com.hk",
    "zipcode": null
  },
  "3600.HK": {
    "city": "Kowloon",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Modern Dental Group Limited",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "MODERN DENTAL",
    "state": null,
    "summary": "Modern Dental Group Limited, an investment holding company, produces and distributes dental prosthetic devices in Europe, Greater China, North America, Australia, and internationally. It operates through three segments: Fixed Prosthetic Devices, Removable Prosthetic Devices, and Others. The Fixed Prosthetic Devices segment offers restorative dental procedures, such as metal-ceramic crowns and bridges, metal crowns and bridges, metal-free crowns and bridges, and custom implant abutments devices. The Removable Prosthetic Devices segment produces full and partial dentures with and without metal frameworks. The Others segment offers orthodontic devices, sports guards, anti-snoring devices, raw materials, and dental equipment. This segment also provides services for educational events and seminars. The company sells its products to dentists, dental clinics, hospitals, distributors, and other customers under the Permadental & Semperdent, Elysee, Labocast, Modern Dental Laboratory, Yangzhijing, Southern Cross Dental, Andent, Gold & Ceramics, Precision Dental, Modern Dental USA, MicroDental, Sundance Dental, Quantum Dental, Labo Ocean Indien, and Digitek Dental brands. Modern Dental Group Limited was founded in 1986 and is based in Kowloon, Hong Kong.",
    "website": "http://www.moderndentalgp.com",
    "zipcode": null
  },
  "3613.HK": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Beijing Tong Ren Tang Chinese Medicine Company Limited",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "TONGRENTANGCM",
    "state": null,
    "summary": "Beijing Tong Ren Tang Chinese Medicine Company Limited, together with its subsidiaries, engages in the manufacture, retail, and wholesale of Chinese medicine and healthcare products to wholesalers and individuals. The company operates in three segments: Hong Kong, PRC, and Overseas. It also offers Chinese medical consultation and treatment services. The company operates 71 retail outlets in 20 countries and regions. It markets its products under the Tong Ren Tang brand. The company was founded in 1669 and is based in Wanchai, Hong Kong. Beijing Tong Ren Tang Chinese Medicine Company Limited is a subsidiary of Tong Ren Tang Technologies Co., Ltd.",
    "website": "http://www.tongrentangcm.com",
    "zipcode": null
  },
  "3681.HK": {
    "city": "Tai Po",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Biotechnology",
    "long_name": "SinoMab BioScience Limited",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "SINOMAB BIO-B",
    "state": null,
    "summary": "SinoMab BioScience Limited, a biopharmaceutical company, engages in the research, development, manufacture, and commercialization of therapeutics for the treatment of immunological diseases, primarily mAb-based biologics. Its flagship product is SM03, a first-in-target anti-CD22 mAb, which is in Phase III clinical trial for the treatment of rheumatoid arthritis (RA), as well as in various clinical stages for other immunological diseases, such as systemic lupus erythematosus (SLE), Sjogren's syndrome (SS), and non-Hodgkin's lymphoma (NHL). The company also focuses on developing SN1011, a BTK inhibitor, which is Phase I clinical trial for the treatment of RA, SLE, pemphigus, and other immunological diseases. Its products under preclinical stage comprise SM17 for the treatment of asthma and idiopathic pulmonary fibrosis; SM09 that is used for the treatment of NHL and RA; SM06 for use in treating RA, NHL, SLE, and SS; and TNF2 for the treatment of RA. The company operates in Mainland China and Hong Kong. SinoMab BioScience Limited was incorporated in 2001 and is headquartered in Pak Shek Kok, Hong Kong.",
    "website": "http://www.sinomab.com",
    "zipcode": null
  },
  "6CB.F": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Diagnostics & Research",
    "long_name": "Global Cord Blood Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "GLOBAL CORD BLOOD DL-0001",
    "state": null,
    "summary": "Global Cord Blood Corporation, together with its subsidiaries, provides umbilical cord blood storage and ancillary services in the People's Republic of China. The company offers cord blood testing, processing, and storage services under the direction of subscribers; and tests, processes, and stores donated cord blood, as well as provides matching services. As of March 31, 2020, it had three operating cord blood banks in the Beijing municipality; one in the Guangdong province; and one in the Zhejiang province. The company was formerly known as China Cord Blood Corporation and changed its name to Global Cord Blood Corporation in March 2018. Global Cord Blood Corporation is based in Central, Hong Kong.",
    "website": "http://www.globalcordbloodcorp.com",
    "zipcode": null
  },
  "8143.HK": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Medical Care Facilities",
    "long_name": "Good Fellow Healthcare Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "GF HEALTHCARE",
    "state": null,
    "summary": "Good Fellow Healthcare Holdings Limited, an investment holding company, provides general hospital services in Mainland China and internationally. Its general hospital services include medical and surgical wards, and medical checkup and examination. As of March 31, 2020, the company operated three general hospitals in Jiaxing, Zhuhai, and Beijing. It also provides medical investment and hospital management services. The company was formerly known as Hua Xia Healthcare Holdings Limited and changed its name to Good Fellow Healthcare Holdings Limited in February 2019. The company was incorporated in 2001 and is headquartered in Central, Hong Kong. Good Fellow Healthcare Holdings Limited is a subsidiary of Solar Star Global Limited.",
    "website": "http://www.gf-healthcare.com",
    "zipcode": null
  },
  "8158.HK": {
    "city": "Tsim Sha Tsui",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Biotechnology",
    "long_name": "China Regenerative Medicine International Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "CRMI",
    "state": null,
    "summary": "China Regenerative Medicine International Limited, an investment holding company, engages in the research and development of bio-medical and healthcare products, and medical techniques. It operates through Cell Products and Services, Cosmetic Products and Services, and Healthcare Products and Services segments. The company offers health management services, such as assessment of health situation, treatment for detox, balance of inner body, nourishing organs, and enhancement of immune system; and beauty services comprising non-surgical medical aesthetic services, basic skincare, solutions for youthful skin, hair revitalizing, lines firming, partial remodelling, and intimate repairing services. It also provides skincare and cosmetic products, including facial and eye creams, serums, moisturizing spray, tonic water, etc., under the Ascara brand. In addition, the company engages in the research and development, and applications of cell culture equipment and cell products; provision of cell-related outsourcing technical services; human cell separation, purification, cultivation, amplification, storage, and transportation; development and production of automated closed cell bioreactors; cellular therapy, cell storage, genetic testing, and biological agents manufacturing; cell preparation processes; technology platforms for clinical application transformation; developing of cell culture devices; separation, isolation, expansion, cryo-storage, and transportation of human cells; development and production of automated closed system cell expansion equipment. Further, it provides bio-engineered cornea, tissue engineering skin related products, and stem cell operation services. The company was formerly known as China Bio-Med Regeneration Technology Limited and changed its name to China Regenerative Medicine International Limited in March 2015. China Regenerative Medicine International Limited was founded in 1995 and is headquartered in Tsim Sha Tsui, Hong Kong.",
    "website": "http://www.crmi.hk",
    "zipcode": null
  },
  "8307.HK": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Medical Care Facilities",
    "long_name": "Medicskin Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "MEDICSKIN",
    "state": null,
    "summary": "Medicskin Holdings Limited, an investment holding company, provides medical skin care services in Hong Kong. The company operates Medicskin centers, which provides various medical skin care services for the treatment of skin diseases and problems, such as acne, pigmentation, rosacea, dermatitis, eczema, and warts, as well as improvement of appearance through skin rejuvenation, facial sculpturing, and body contouring treatments; and treatment of acne scars and enlarged pores, removal of undesirable naevi, and hair removal. It is also involved in the sale of skincare products; provision of skin care and health management services; beauty spa services; and property holding activities. The company was founded in 2000 and is headquartered in Central, Hong Kong. Medicskin Holdings Limited is a subsidiary of Topline Worldwide Limited.",
    "website": "http://www.medicskin.com",
    "zipcode": null
  },
  "8372.HK": {
    "city": "Tsuen Wan",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Medical Distribution",
    "long_name": "Grand Brilliance Group Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "GBG HOLDINGS",
    "state": null,
    "summary": "Grand Brilliance Group Holdings Limited, an investment holding company, engages in supplying of medical devices in Hong Kong. The company offers medical consumables; medical instruments; and medical equipment, as well as develops healthcare products. In addition, it provides medical device solutions, such as market trend analysis, sourcing of medical devices, after-sale services, technical support and training services, medical devices leasing services, and quality assurance services; and holds trademarks, as well as provides maintenance services. Grand Brilliance Group Holdings Limited sells its products to various private hospitals, public hospitals, private clinics, non-profit organizations, universities, and individual end-users. The company was founded in 1997 and is based in Tsuen Wan, Hong Kong. Grand Brilliance Group Holdings Limited is a subsidiary of B&A Success Limited.",
    "website": "http://www.grandbrilliancegroup.com",
    "zipcode": null
  },
  "8622.HK": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "Huakang Biomedical Holdings Company Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "HUAKANG BIOMED",
    "state": null,
    "summary": "Huakang Biomedical Holdings Company Limited, a medical device company, engages in the research, development, manufacture, marketing, and sale of in-vitro diagnostic (IVD) reagents in the People's Republic of China. It offers male and female fertility IVD, parasite antibody detection, and Epstein-Barr virus antibody detection reagents; and auxiliary reproductive supplies and equipment. The company sells its products directly to hospitals and medical institutions, as well as to distributors. Huakang Biomedical Holdings Company Limited was founded in 1992 and is headquartered in Wan Chai, Hong Kong.",
    "website": "http://www.huakangbiomedical.com",
    "zipcode": null
  },
  "ALBHF": {
    "city": "Causeway Bay",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Alibaba Health Information Technology Limited",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "ALIBABA HEALTH INFORMATION TECH",
    "state": null,
    "summary": "Alibaba Health Information Technology Limited, an investment holding company, engages in the pharmaceutical e-commerce, intelligent medicine, and product tracking platform businesses in the People's Republic of China. It engages in business-to-customer (B2C) retail activities; advertisement business; and business-to-business (B2B) centralized procurement distribution business. The company also provides pharmaceutical and healthcare products through its online stores on Tmall.com and offline pharmacy outlets to B2C and B2B customers; marketing services; health consultation services; outsourced and value-added services to the Tmall entities; and telemedicine services. In addition, it trades in pharmaceutical products; and provides network hospital services. The company was formerly known as CITIC 21CN Company Limited and changed its name to Alibaba Health Information Technology Limited in September 2014. The company is based in Causeway Bay, Hong Kong. Alibaba Health Information Technology Limited is a subsidiary of Perfect Advance Holding Limited.",
    "website": "http://www.alihealth.cn",
    "zipcode": null
  },
  "BJTRF": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Beijing Tong Ren Tang Chinese Medicine Company Limited",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "BEIJING TONG REN TANG CHINESE M",
    "state": null,
    "summary": "Beijing Tong Ren Tang Chinese Medicine Company Limited, together with its subsidiaries, engages in the manufacture, retail, and wholesale of Chinese medicine and healthcare products to wholesalers and individuals. The company operates in three segments: Hong Kong, PRC, and Overseas. It also offers Chinese medical consultation and treatment services. The company operates 71 retail outlets in 20 countries and regions. It markets its products under the Tong Ren Tang brand. The company was founded in 1669 and is based in Wanchai, Hong Kong. Beijing Tong Ren Tang Chinese Medicine Company Limited is a subsidiary of Tong Ren Tang Technologies Co., Ltd.",
    "website": "http://www.tongrentangcm.com",
    "zipcode": null
  },
  "CO": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Diagnostics & Research",
    "long_name": "Global Cord Blood Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "Global Cord Blood Corporation",
    "state": null,
    "summary": "Global Cord Blood Corporation, together with its subsidiaries, provides umbilical cord blood storage and ancillary services in the People's Republic of China. The company offers cord blood testing, processing, and storage services under the direction of subscribers; and tests, processes, and stores donated cord blood, as well as provides matching services. As of March 31, 2020, it had three operating cord blood banks in the Beijing municipality; one in the Guangdong province; and one in the Zhejiang province. The company was formerly known as China Cord Blood Corporation and changed its name to Global Cord Blood Corporation in March 2018. Global Cord Blood Corporation is based in Central, Hong Kong.",
    "website": "http://www.globalcordbloodcorp.com",
    "zipcode": null
  },
  "H7T1.F": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Biotechnology",
    "long_name": "HUTCHMED (China) Limited",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "HUTCHMED (CHINA)  LS-,10",
    "state": null,
    "summary": "HUTCHMED (China) Limited discovers, develops, and commercializes targeted therapeutics and immunotherapies for cancer and immunological diseases worldwide. It operates in two segments, Oncology/Immunology and Other Ventures. It manufactures, distributes, markets, and sells prescription and over-the-counter pharmaceutical, and consumer health products. The company is developing Savolitinib, an inhibitor for non-small cell lung cancer (NSCLC), papillary and clear cell renal cell carcinoma, colorectal cancer (CRC), and gastric cancer (GC); and Fruquintinib, an inhibitor for CRC, breast cancer, GC, endometrial cancer (EMC), NSCLC, hepatocellular carcinoma, and gastrointestinal and solid tumors. It also develops Surufatinib, an inhibitor for neuroendocrine tumors (NET), pancreatic NET, non-pancreatic NET, biliary tract cancer, sarcoma, neuroendocrine neoplasm, esophageal cancer, small cell lung cancer, GC, thyroid cancer, EMC, NSCLC, and solid tumors; HMPL-523, an inhibitor for indolent non-Hodgkin's lymphoma (NHL), B-cell malignancies, and immune thrombocytopenic purpura; and HMPL-689 for indolent non-Hodgkin's, follicular, marginal zone, mantle cell, diffuse large B cell, chronic lymphocytic leukemia/small lymphocytic, and Hodgkin's lymphoma. The company is developing HMPL-453, an inhibitor for intrahepatic cholangiocarcinoma; HMPL-306, an inhibitor for hematological malignancies, gliomas, and solid tumors; HMPL-295 for solid tumors; and HMPL-813 and HMPL-309 EGFR inhibitors. HUTCHMED (China) Limited has collaboration agreements with AstraZeneca AB (publ), Lilly (Shanghai) Management Company Limited, BeiGene, Inmagene Biopharmaceuticals Co. Ltd., Innovent Biologics (Suzhou) Co., Inc., Genor Biopharma Co. Ltd., and Shanghai Junshi Biosciences Co. Ltd. The company was formerly known as Hutchison China MediTech Limited and changed its name to HUTCHMED (China) Limited in May 2021. HUTCHMED (China) Limited was incorporated in 2000 and is headquartered in Central, Hong Kong.",
    "website": "http://www.hutch-med.com",
    "zipcode": null
  },
  "H7T2.F": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Biotechnology",
    "long_name": "HUTCHMED (China) Limited",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "HUTCHMED (CHINA)  LS-,1",
    "state": null,
    "summary": "HUTCHMED (China) Limited discovers, develops, and commercializes targeted therapeutics and immunotherapies for cancer and immunological diseases worldwide. It operates in two segments, Oncology/Immunology and Other Ventures. It manufactures, distributes, markets, and sells prescription and over-the-counter pharmaceutical, and consumer health products. The company is developing Savolitinib, an inhibitor for non-small cell lung cancer (NSCLC), papillary and clear cell renal cell carcinoma, colorectal cancer (CRC), and gastric cancer (GC); and Fruquintinib, an inhibitor for CRC, breast cancer, GC, endometrial cancer (EMC), NSCLC, hepatocellular carcinoma, and gastrointestinal and solid tumors. It also develops Surufatinib, an inhibitor for neuroendocrine tumors (NET), pancreatic NET, non-pancreatic NET, biliary tract cancer, sarcoma, neuroendocrine neoplasm, esophageal cancer, small cell lung cancer, GC, thyroid cancer, EMC, NSCLC, and solid tumors; HMPL-523, an inhibitor for indolent non-Hodgkin's lymphoma (NHL), B-cell malignancies, and immune thrombocytopenic purpura; and HMPL-689 for indolent non-Hodgkin's, follicular, marginal zone, mantle cell, diffuse large B cell, chronic lymphocytic leukemia/small lymphocytic, and Hodgkin's lymphoma. The company is developing HMPL-453, an inhibitor for intrahepatic cholangiocarcinoma; HMPL-306, an inhibitor for hematological malignancies, gliomas, and solid tumors; HMPL-295 for solid tumors; and HMPL-813 and HMPL-309 EGFR inhibitors. HUTCHMED (China) Limited has collaboration agreements with AstraZeneca AB (publ), Lilly (Shanghai) Management Company Limited, BeiGene, Inmagene Biopharmaceuticals Co. Ltd., Innovent Biologics (Suzhou) Co., Inc., Genor Biopharma Co. Ltd., and Shanghai Junshi Biosciences Co. Ltd. The company was formerly known as Hutchison China MediTech Limited and changed its name to HUTCHMED (China) Limited in May 2021. HUTCHMED (China) Limited was incorporated in 2000 and is headquartered in Central, Hong Kong.",
    "website": "http://www.hutch-med.com",
    "zipcode": null
  },
  "HCM": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Biotechnology",
    "long_name": "Hutchison China MediTech Limited",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "Hutchison China MediTech Limite",
    "state": null,
    "summary": "Hutchison China MediTech Limited, a commercial-stage biopharmaceutical company, discovers, develops, and commercializes targeted therapeutics and immunotherapies for cancer and immunological diseases worldwide. It operates in two segments, Oncology/Immunology and Other Ventures. It offers research and development services; and manufactures, distributes, markets, and sells prescription and over-the-counter pharmaceutical, and consumer health products. The company is developing Savolitinib, an inhibitor for non-small cell lung cancer (NSCLC), papillary and clear cell renal cell carcinoma, colorectal cancer (CRC), and gastric cancer (GC); and Fruquintinib, an inhibitor for CRC, breast cancer, GC, endometrial cancer (EMC), NSCLC, hepatocellular carcinoma, and gastrointestinal and solid tumors. It also develops Surufatinib, an inhibitor for neuroendocrine tumors (NET), pancreatic NET, non-pancreatic NET, biliary tract cancer, sarcoma and soft tissue sarcoma, neuroendocrine neoplasms, esophageal cancer, small cell lung cancer, GC, thyroid cancer, EMC, NSCLC, and solid tumors; HMPL-523, an inhibitor for indolent non-Hodgkin's lymphoma (NHL), B-cell malignancies, and immune thrombocytopenic purpura; and HMPL-689 for indolent non-Hodgkin's, follicular, marginal zone, mantle cell, diffuse large B cell, chronic lymphocytic leukemia/small lymphocytic, and Hodgkin's lymphoma. The company is developing HMPL-453, an inhibitor for intrahepatic cholangiocarcinoma; HMPL-306, an inhibitor for hematological malignancies, gliomas, and solid tumors; HMPL-295 for solid tumors; and HMPL-813 and HMPL-309 EGFR inhibitors. Hutchison China MediTech Limited has collaboration agreement with AstraZeneca AB (publ), Lilly (Shanghai) Management Company Limited, BeiGene, Inmagene Biopharmaceuticals Co. Ltd., Innovent Biologics (Suzhou) Co., Inc., Genor Biopharma Co. Ltd., and Shanghai Junshi Biosciences Co. Ltd. The company was incorporated in 2000 and is headquartered in Central, Hong Kong.",
    "website": "http://www.hutch-med.com",
    "zipcode": null
  },
  "HCM.L": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Biotechnology",
    "long_name": "HUTCHMED (China) Limited",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "HUTCHMED (CHINA) LIMITED ORD US",
    "state": null,
    "summary": "HUTCHMED (China) Limited discovers, develops, and commercializes targeted therapeutics and immunotherapies for cancer and immunological diseases worldwide. It operates in two segments, Oncology/Immunology and Other Ventures. It manufactures, distributes, markets, and sells prescription and over-the-counter pharmaceutical, and consumer health products. The company is developing Savolitinib, an inhibitor for non-small cell lung cancer (NSCLC), papillary and clear cell renal cell carcinoma, colorectal cancer (CRC), and gastric cancer (GC); and Fruquintinib, an inhibitor for CRC, breast cancer, GC, endometrial cancer (EMC), NSCLC, hepatocellular carcinoma, and gastrointestinal and solid tumors. It also develops Surufatinib, an inhibitor for neuroendocrine tumors (NET), pancreatic NET, non-pancreatic NET, biliary tract cancer, sarcoma, neuroendocrine neoplasm, esophageal cancer, small cell lung cancer, GC, thyroid cancer, EMC, NSCLC, and solid tumors; HMPL-523, an inhibitor for indolent non-Hodgkin's lymphoma (NHL), B-cell malignancies, and immune thrombocytopenic purpura; and HMPL-689 for indolent non-Hodgkin's, follicular, marginal zone, mantle cell, diffuse large B cell, chronic lymphocytic leukemia/small lymphocytic, and Hodgkin's lymphoma. The company is developing HMPL-453, an inhibitor for intrahepatic cholangiocarcinoma; HMPL-306, an inhibitor for hematological malignancies, gliomas, and solid tumors; HMPL-295 for solid tumors; and HMPL-813 and HMPL-309 EGFR inhibitors. HUTCHMED (China) Limited has collaboration agreements with AstraZeneca AB (publ), Lilly (Shanghai) Management Company Limited, BeiGene, Inmagene Biopharmaceuticals Co. Ltd., Innovent Biologics (Suzhou) Co., Inc., Genor Biopharma Co. Ltd., and Shanghai Junshi Biosciences Co. Ltd. The company was formerly known as Hutchison China MediTech Limited and changed its name to HUTCHMED (China) Limited in May 2021. HUTCHMED (China) Limited was incorporated in 2000 and is headquartered in Central, Hong Kong.",
    "website": "http://www.hutch-med.com",
    "zipcode": null
  },
  "LSI.F": {
    "city": "Tai Po",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Biotechnology",
    "long_name": "CK Life Sciences Int'l., (Holdings) Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "CK LIFE SCIENCES  HD-,10",
    "state": null,
    "summary": "CK Life Sciences Int'l., (Holdings) Inc., an investment holding company, researches, develops, manufactures, commercializes, markets, and sells health and agriculture-related products in the Asia Pacific and North America. It manufactures and markets plant protection products and soluble fertilizers; manufactures, blends, distributes, and sells fertilizers, pesticides, and related agricultural products; manufactures and distributes horticultural products for the home gardening market; and produces non-sterile prescription and over-the-counter medicines. The company is also involved in the contract manufacturing of complementary healthcare medicines, vitamins, nutritional supplements, and cosmetics; licensing of registration activities and the importation of finished agricultural goods; holding land and building; financing activities; investment in financial instruments and vineyards; trading of biotechnology products and nutritional supplements; and manufacturing, wholesaling, retailing, and distribution of nutraceutical products. In addition, it distributes turf management machinery, hardware, equipment, and accessories, as well as turf fertilizers, chemicals, and professional pest products; produces, refines, and distributes salt products; and provides research and development services for biotechnology and life sciences technology products. Further, it researches, develops, manufactures, and commercializes drug products to treat pain and melanoma; and supplies raw materials for nutritional health, pharmaceutical, cosmetics, personal care, and food segments. Additionally, the company offers packing and asset management services. CK Life Sciences Int'l., (Holdings) Inc. was founded in 1999 and is headquartered in Tai Po, Hong Kong.",
    "website": "http://www.ck-lifesciences.com",
    "zipcode": null
  },
  "MSIU": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Medical Devices",
    "long_name": "Medical Supply International USA, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "MEDICAL SUPPLY INTL USA INC",
    "state": null,
    "summary": "Medical Supply International USA, Inc., together with its subsidiaries, provides rehabilitation services and specialized hospital services in the healthcare industry in the People's Republic of China. It operates rehabilitative center, and maternity and specialized service hospital. The rehabilitative center serves patients who have survived from a serious injury or illness or an addiction and are seeking therapeutic or medical treatment. The company also operates outpatient clinic and offers other services, including private outpatients and health check-up services, and obstetrics and gynecology services. It offers 4-D ultrasound system applications for scanning for medical purposes, IPL system applications for treatment various kinds of skin disorder, and cosmetic surgery. The company was formerly known as Master Spirit International USA Inc. and changed its name to Medical Supply International USA, Inc. in October 2018. Medical Supply International USA, Inc. was founded in 2001 and is headquartered in Wan Chai, Hong Kong.",
    "website": null,
    "zipcode": null
  },
  "SBHMY": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Biotechnology",
    "long_name": "Sino Biopharmaceutical Limited",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "SINO BIOPHARMACEUTICAL",
    "state": null,
    "summary": "Sino Biopharmaceutical Limited, an investment holding company, together with its subsidiaries, operates as a research and development pharmaceutical conglomerate in the People's Republic of China. It operates in three segments: Modernised Chinese Medicines and Chemical Medicines, Investment, and Others. The company's principal products include hepatitis medicines, such as Tianqingganmei injections and Tianqingganping enteric capsules; oncology medicines comprising Saiweijian injections, Qingkeshu tablets, Qianping injections, Anxian capsules, Yinishu tablets, Genike capsules, Shoufu tablets, Jizhi tablets, and Leweixin injection; cardio-cerebral medicines, including Yilunping tablets, Tuotuo tablets, Sacubatro/Valsartan tablets, Tolvaptan tablets, Rivaroxaban tablets, Edaravone injections, Esmolol Hydrochloride injections, Esmolol Hydrochloride and Sodium Chloride injections, Polidocanol injections, Sacubitril Valsartan Sodium tablets, Urapidil Hydrochloride injections, and Kaina tablets; and orthopedic medicines, such as Gaisanchun capsules, Taiyan tablets, Zoledronic Acid injections, and Yigu injections. Its principal products also comprise digestive system medicines that consists of Aisuping injections, Getai tablets, and Deyou granules; anti-infectious medicines that include Tianjie injections, Fengruineng injections, Tianli injections, and Tianming injections; respiratory system medicines, such as Tianqingsule inhalation powder; and others comprising Debaian cataplasms, and Qingliming injections. In addition, the company engages in property holding activities; the retail and distribution of pharmaceutical products; optometry for optical glasses and sale of ophthalmic products; the provision of medical management consultancy services; and outpatient and surgical procedure. Further, it manufactures, sells, and distributes health food; and develops medical technology. The company was incorporated in 2000 and is headquartered in Wan Chai, Hong Kong.",
    "website": "http://www.sinobiopharm.com",
    "zipcode": null
  },
  "SBMFF": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Biotechnology",
    "long_name": "Sino Biopharmaceutical Limited",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "SINO BIOPHARMACEUTICAL",
    "state": null,
    "summary": "Sino Biopharmaceutical Limited, an investment holding company, together with its subsidiaries, operates as a research and development pharmaceutical conglomerate in the People's Republic of China. It operates in three segments: Modernised Chinese Medicines and Chemical Medicines, Investment, and Others. The company's principal products include hepatitis medicines, such as Tianqingganmei injections and Tianqingganping enteric capsules; oncology medicines comprising Saiweijian injections, Qingkeshu tablets, Qianping injections, Anxian capsules, Yinishu tablets, Genike capsules, Shoufu tablets, Jizhi tablets, and Leweixin injection; cardio-cerebral medicines, including Yilunping tablets, Tuotuo tablets, Sacubatro/Valsartan tablets, Tolvaptan tablets, Rivaroxaban tablets, Edaravone injections, Esmolol Hydrochloride injections, Esmolol Hydrochloride and Sodium Chloride injections, Polidocanol injections, Sacubitril Valsartan Sodium tablets, Urapidil Hydrochloride injections, and Kaina tablets; and orthopedic medicines, such as Gaisanchun capsules, Taiyan tablets, Zoledronic Acid injections, and Yigu injections. Its principal products also comprise digestive system medicines that consists of Aisuping injections, Getai tablets, and Deyou granules; anti-infectious medicines that include Tianjie injections, Fengruineng injections, Tianli injections, and Tianming injections; respiratory system medicines, such as Tianqingsule inhalation powder; and others comprising Debaian cataplasms, and Qingliming injections. In addition, the company engages in property holding activities; the retail and distribution of pharmaceutical products; optometry for optical glasses and sale of ophthalmic products; the provision of medical management consultancy services; and outpatient and surgical procedure. Further, it manufactures, sells, and distributes health food; and develops medical technology. The company was incorporated in 2000 and is headquartered in Wan Chai, Hong Kong.",
    "website": "http://www.sinobiopharm.com",
    "zipcode": null
  },
  "SKYI": {
    "city": "Tsim Sha Tsui",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "Sky Century Investment, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "SKY CENTURY INVESTMENT INC",
    "state": null,
    "summary": "Sky Century Investment, Inc., a development stage company, intends to find and manage new music talents and bands in China. The company was formerly known as Band Rep Management, Inc. and changed its name to Sky Century Investment, Inc. in May 2017. The company was founded in 2012 and is based in Tsim Sha Tsui, Hong Kong.",
    "website": "http://skycenturygroup.com",
    "zipcode": null
  },
  "SMIF.F": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Medical Care Facilities",
    "long_name": "China Medical & HealthCare Group Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "CHINA MED.+HLTH.G.HD-0005",
    "state": null,
    "summary": "China Medical & HealthCare Group Limited, an investment holding company, primarily operates hospitals in the Hong Kong and People's Republic of China. It operates through six segments: Healthcare, Eldercare, Property Development, Property Investment, Financial Services, and Securities Trading and Investments. The company is also involved in the property development of independent living units; and project management of health campus with a focus on elderly care and retirement community comprising elderly nursing homes, service apartments, and independent living units, as well as a shopping mall, retail shops, and club hall facilities. In addition, it develops and sells properties and land; leases residential and office properties; and provides money lending, financial and strategic investment, and healthcare services. Further, the company is involved in trading of medical equipment and related supplies. Additionally, it invests and trades in securities. The company is also involved in trading of securities listed in overseas exchange. The company was formerly known as COL Capital Limited and changed its name to China Medical & HealthCare Group Limited in February 2016. The company is headquartered in Wanchai, Hong Kong.",
    "website": "http://www.cmhg.com.hk",
    "zipcode": null
  },
  "SMZ1.F": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Biotechnology",
    "long_name": "Sino Biopharmaceutical Limited",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "SINO BIOPH.SUBDIV.HD-,025",
    "state": null,
    "summary": "Sino Biopharmaceutical Limited, an investment holding company, together with its subsidiaries, operates as a research and development pharmaceutical conglomerate in the People's Republic of China. It operates in three segments: Modernised Chinese Medicines and Chemical Medicines, Investment, and Others. The company's principal products include hepatitis medicines, such as Tianqingganmei injections and Tianqingganping enteric capsules; oncology medicines comprising Saiweijian injections, Qingkeshu tablets, Qianping injections, Anxian capsules, Yinishu tablets, Genike capsules, Shoufu tablets, Jizhi tablets, and Leweixin injection; cardio-cerebral medicines, including Yilunping tablets, Tuotuo tablets, Sacubatro/Valsartan tablets, Tolvaptan tablets, Rivaroxaban tablets, Edaravone injections, Esmolol Hydrochloride injections, Esmolol Hydrochloride and Sodium Chloride injections, Polidocanol injections, Sacubitril Valsartan Sodium tablets, Urapidil Hydrochloride injections, and Kaina tablets; and orthopedic medicines, such as Gaisanchun capsules, Taiyan tablets, Zoledronic Acid injections, and Yigu injections. Its principal products also comprise digestive system medicines that consists of Aisuping injections, Getai tablets, and Deyou granules; anti-infectious medicines that include Tianjie injections, Fengruineng injections, Tianli injections, and Tianming injections; respiratory system medicines, such as Tianqingsule inhalation powder; and others comprising Debaian cataplasms, and Qingliming injections. In addition, the company engages in property holding activities; the retail and distribution of pharmaceutical products; optometry for optical glasses and sale of ophthalmic products; the provision of medical management consultancy services; and outpatient and surgical procedure. Further, it manufactures, sells, and distributes health food; and develops medical technology. The company was incorporated in 2000 and is headquartered in Wan Chai, Hong Kong.",
    "website": "http://www.sinobiopharm.com",
    "zipcode": null
  },
  "SMZU.F": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Biotechnology",
    "long_name": "Sino Biopharmaceutical Limited",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "SINO BIOPHARM. UNS.ADR/20",
    "state": null,
    "summary": "Sino Biopharmaceutical Limited, an investment holding company, together with its subsidiaries, operates as a research and development pharmaceutical conglomerate in the People's Republic of China. It operates in three segments: Modernised Chinese Medicines and Chemical Medicines, Investment, and Others. The company's principal products include hepatitis medicines, such as Tianqingganmei injections and Tianqingganping enteric capsules; oncology medicines comprising Saiweijian injections, Qingkeshu tablets, Qianping injections, Anxian capsules, Yinishu tablets, Genike capsules, Shoufu tablets, Jizhi tablets, and Leweixin injection; cardio-cerebral medicines, including Yilunping tablets, Tuotuo tablets, Sacubatro/Valsartan tablets, Tolvaptan tablets, Rivaroxaban tablets, Edaravone injections, Esmolol Hydrochloride injections, Esmolol Hydrochloride and Sodium Chloride injections, Polidocanol injections, Sacubitril Valsartan Sodium tablets, Urapidil Hydrochloride injections, and Kaina tablets; and orthopedic medicines, such as Gaisanchun capsules, Taiyan tablets, Zoledronic Acid injections, and Yigu injections. Its principal products also comprise digestive system medicines that consists of Aisuping injections, Getai tablets, and Deyou granules; anti-infectious medicines that include Tianjie injections, Fengruineng injections, Tianli injections, and Tianming injections; respiratory system medicines, such as Tianqingsule inhalation powder; and others comprising Debaian cataplasms, and Qingliming injections. In addition, the company engages in property holding activities; the retail and distribution of pharmaceutical products; optometry for optical glasses and sale of ophthalmic products; the provision of medical management consultancy services; and outpatient and surgical procedure. Further, it manufactures, sells, and distributes health food; and develops medical technology. The company was incorporated in 2000 and is headquartered in Wan Chai, Hong Kong.",
    "website": "http://www.sinobiopharm.com",
    "zipcode": null
  },
  "TBET": {
    "city": "Wanchai",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Drugs - Generic",
    "long_name": "Tibet Pharmaceuticals, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "TIBET PHARMACEUTICALS INC",
    "state": null,
    "summary": "Tibet Pharmaceuticals, Inc., a specialty pharmaceutical company, engages in the research, development, manufacture, marketing, and sale of traditional Tibetan medicines. The company, through its operational entity, Yunnan Shangri-La Tibetan Pharmaceutical Group Limited (YSTP), develops products in China for promoting health in human respiratory, digestive, urinary, and reproductive systems. Its commercialized products include 25 Ingredients Mandrake Pill, which is used to regulate menses to treat endometritis, pelvic inflammations, and women's anemia; 15 Ingredients Gentiana Pill to treat bronchitis, emphysema, asthma, and hoarseness; 28 Ingredients Pinang Pill for treating cold waist hip pain, pus hematuria, and testis swelling; 18 Ingredients Chebulic (Myrobalan) Frusemide Pill for the treatment of kidney problems, lumbar and kidney pain, frequent urination, turbid urine, diabetes, and spermatorrhea; and Pomegranate Nichirin Pill to treat indigestion, back and leg pain, frequent urination, foot edema, impotence, and nocturnal emission. The company also develops Xuezang Guben pill indicated for the treatment of neurasthenia, insomnia, frequent urination, nocturnal emission, and women's menopausal symptoms; Shengke I that is in Phase III clinical testing for treating type II diabetes; Shengke II, which is in Phase II clinical testing for treating impotence and premature ejaculation, prostrate disease, and memory loss; Jiuzan pill that is in Phase II clinical testing for the treatment of chronic gastroenteritis and peptic ulcers; and Antai pill, a pre-clinical stage product for treating hepatitis B. In addition, it focuses to commercialize Wupeng Pill for treating echimococosis, pandora tingling disease, diphtheria, anthrax, yellow water disease, and leprosy. The company was formerly known as Shangri-La Tibetan Pharmaceuticals, Inc. and changed its name to Tibet Pharmaceuticals Inc. in July 2010. Tibet Pharmaceuticals, Inc. is headquartered in Wanchai, Hong Kong.",
    "website": null,
    "zipcode": null
  },
  "TEL1.F": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "Sihuan Pharmaceutical Holdings Group Ltd.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "SIHUAN PHARMAC.GRP HD-,01",
    "state": null,
    "summary": "Sihuan Pharmaceutical Holdings Group Ltd., an investment holding company, engages in the research and development, manufacture, and sale of pharmaceutical products in the People's Republic of China. The company offers cardio-cerebral vascular system, digestive system, metabolism, anti-infective, respiratory, neurology, and other drugs. It also engages in the marketing of pharmaceutical products; manufacture of pharmaceutical materials and medical instruments; project preparation for the manufacture of pharmaceutical products; promotion of technology, biotechnology, and consulting services; and construction of medical projects, as well as the provision of information support, research and development, business and development, and general hospital and hospital management services. In addition, the company invests in property; constructs environmental protection projects; and wholesales chemical raw materials and medical devices. The company was founded in 2001 and is based in Wanchai, Hong Kong.",
    "website": "http://www.sihuanpharm.com",
    "zipcode": null
  },
  "TK1.SG": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Medical Distribution",
    "long_name": "China Health Group Limited",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "China Health Group Ltd. Registe",
    "state": null,
    "summary": "China Health Group Limited, an investment holding company, engages in the operation and management of hospitals, and medical equipment and consumables trading businesses in the People's Republic of China. It is also involved in business factoring business, as well as property investment business. The company was formerly known as China HealthCare Holdings Limited and changed its name to China Health Group Limited in September 2015. China Health Group Limited is headquartered in Central, Hong Kong.",
    "website": "http://www.ch-groups.com",
    "zipcode": null
  },
  "TNHA.F": {
    "city": "Sha Tin",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Medical Care Facilities",
    "long_name": "Town Health International Medical Group Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "TOWN HEALTH INTL M.GR.NEW",
    "state": null,
    "summary": "Town Health International Medical Group Limited, an investment holding company, invests in, manages, and provides healthcare and related services in the People's Republic of China and Hong Kong. The company operates through Hong Kong Medical Services; Hong Kong Managed Care Business; Mainland Hospital Management and Medical Services; and Others segments. It provides primary and specialty care, managed care operation, medical diagnostic, health check, medical dermatology, corporate advisory and consultation, etc.; and third-party medical network administrator and miscellaneous healthcare related services. The company also offers medical healthcare and dental consultation, property investment, and medical tourism services; and management and training, and arranging technical exchange for the medical professionals. In addition, it trades in listed securities; leases properties; offers beauty and cosmetic medical, laboratory, hospital management, and business advisory services. Further, the company engages in the operation of beauty mobile application; and trading of medical equipment. As of December 31, 2020, it had 463 healthcare service points covering multiple practices, including 265 general practice service points, 80 specialist service points, 24 dental service points, and 94 auxiliary service points. The company was formerly known as Town Health International Investments Limited and changed its name to Town Health International Medical Group Limited in March 2014. Town Health International Medical Group Limited was founded in 1989 and is headquartered in Shatin, Hong Kong.",
    "website": "http://www.townhealth.com",
    "zipcode": null
  },
  "TQR.F": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Beijing Tong Ren Tang Chinese Medicine Company Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "BEIJ.TONG R.T.CHIN.",
    "state": null,
    "summary": "Beijing Tong Ren Tang Chinese Medicine Company Limited, together with its subsidiaries, engages in the manufacture, retail, and wholesale of Chinese medicine and healthcare products to wholesalers and individuals. The company operates in three segments: Hong Kong, PRC, and Overseas. It also offers Chinese medical consultation and treatment services. The company operates 71 retail outlets in 20 countries and regions. It markets its products under the Tong Ren Tang brand. The company was founded in 1669 and is based in Wanchai, Hong Kong. Beijing Tong Ren Tang Chinese Medicine Company Limited is a subsidiary of Tong Ren Tang Technologies Co., Ltd.",
    "website": "http://www.tongrentangcm.com",
    "zipcode": null
  },
  "TWY.F": {
    "city": "Causeway Bay",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Alibaba Health Information Technology Limited",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "ALIBABA HLTH INFO.T.HD-01",
    "state": null,
    "summary": "Alibaba Health Information Technology Limited, an investment holding company, engages in the pharmaceutical e-commerce, intelligent medicine, and product tracking platform businesses in the People's Republic of China. It engages in business-to-customer (B2C) retail activities; advertisement business; and business-to-business (B2B) centralized procurement distribution business. The company also provides pharmaceutical and healthcare products through its online stores on Tmall.com and offline pharmacy outlets to B2C and B2B customers; marketing services; health consultation services; outsourced and value-added services to the Tmall entities; and telemedicine services. In addition, it trades in pharmaceutical products; and provides network hospital services. The company was formerly known as CITIC 21CN Company Limited and changed its name to Alibaba Health Information Technology Limited in September 2014. The company is based in Causeway Bay, Hong Kong. Alibaba Health Information Technology Limited is a subsidiary of Perfect Advance Holding Limited.",
    "website": "http://www.alihealth.cn",
    "zipcode": null
  },
  "TWY.SG": {
    "city": "Causeway Bay",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Alibaba Health Information Technology Limited",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "Alibaba Health Inform.Tech.LtdR",
    "state": null,
    "summary": "Alibaba Health Information Technology Limited, an investment holding company, engages in the pharmaceutical e-commerce, intelligent medicine, and product tracking platform businesses in the People's Republic of China. It engages in business-to-customer (B2C) retail activities; advertisement business; and business-to-business (B2B) centralized procurement distribution business. The company also provides pharmaceutical and healthcare products through its online stores on Tmall.com and offline pharmacy outlets to B2C and B2B customers; marketing services; health consultation services; outsourced and value-added services to the Tmall entities; and telemedicine services. In addition, it trades in pharmaceutical products; and provides network hospital services. The company was formerly known as CITIC 21CN Company Limited and changed its name to Alibaba Health Information Technology Limited in September 2014. The company is based in Causeway Bay, Hong Kong. Alibaba Health Information Technology Limited is a subsidiary of Perfect Advance Holding Limited.",
    "website": "http://www.alihealth.cn",
    "zipcode": null
  },
  "UNJ.F": {
    "city": "Yuen Long",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Drug Manufacturers - General",
    "long_name": "The United Laboratories International Holdings Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "UNITED LABS INTL  HD -,01",
    "state": null,
    "summary": "The United Laboratories International Holdings Limited, an investment holding company, engages in the research, development, manufacture, distribution, and sale of pharmaceutical products. It operates through three segments: Intermediate Products, Bulk Medicine, and Finished Products. The company offers oral antibiotics, antimicrobials for injection, anti-cold products, cough medicines, ophthalmic drugs, antiviral drugs, anti-hepatitis B drugs, diabetes drugs, skin drugs for external use, cardiovascular and cerebrovascular drugs, nervous system drugs, vitamins, and vacant gelatin capsules, as well as API and intermediate products. It also manufactures and sells soft capsules casings and organic fertilizers; holds trademarks; trades in pharmaceutical products; and engages in the food production activities. In addition, the company provides management services. It has operations in the People's Republic of China, Europe, India, the Middle East, South America, other Asian regions, and internationally. The company was founded in 1990 and is headquartered in Yuen Long, Hong Kong.",
    "website": "http://www.tul.com.cn",
    "zipcode": null
  }
}
