{
  "1612.HK": {
    "city": "Hung Hom",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Medical Devices",
    "long_name": "Vincent Medical Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "VINCENT MED",
    "state": null,
    "summary": "Vincent Medical Holdings Limited, an investment holding company, researches, develops, manufactures, markets, and sells medical devices. It operates in two segments, Original Equipment Manufacturing (OEM) and Original Brand Manufacturing. The company develops medical devices focusing on respiratory products; imaging contrast media power injector disposables; and orthopedic and rehabilitation products for OEM customers. Its respiratory products portfolio includes humidification systems, nCPAP interface systems, respiratory care units, electronic air-oxygen blenders, and anesthesia systems. The company's orthopedic and rehabilitation products comprise various adjustable rehabilitation braces for support and protection, and rehabilitation of various skeletomuscular parts after injury or surgery. It also develops robotic hand training devices. Vincent Medical Holdings Limited sells its products under the Inspired Medical, Hand of Hope, and Hypnus brand names in the People's Republic of China, the United States, the Netherlands, Australia, Japan, and internationally. The company was founded in 1997 and is headquartered in Hung Hom, Hong Kong. Vincent Medical Holdings Limited is a subsidiary of Vincent Raya International Limited.",
    "website": "http://www.vincentmedical.com",
    "zipcode": null
  },
  "MSIU": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Medical Devices",
    "long_name": "Medical Supply International USA, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "MEDICAL SUPPLY INTL USA INC",
    "state": null,
    "summary": "Medical Supply International USA, Inc., together with its subsidiaries, provides rehabilitation services and specialized hospital services in the healthcare industry in the People's Republic of China. It operates rehabilitative center, and maternity and specialized service hospital. The rehabilitative center serves patients who have survived from a serious injury or illness or an addiction and are seeking therapeutic or medical treatment. The company also operates outpatient clinic and offers other services, including private outpatients and health check-up services, and obstetrics and gynecology services. It offers 4-D ultrasound system applications for scanning for medical purposes, IPL system applications for treatment various kinds of skin disorder, and cosmetic surgery. The company was formerly known as Master Spirit International USA Inc. and changed its name to Medical Supply International USA, Inc. in October 2018. Medical Supply International USA, Inc. was founded in 2001 and is headquartered in Wan Chai, Hong Kong.",
    "website": null,
    "zipcode": null
  }
}
