{
    "0876.HK": {
        "short_name": "KAISA HEALTH",
        "long_name": "Kaisa Health Group Holdings Limited",
        "summary": "Kaisa Health Group Holdings Limited, an investment holding company, manufactures and trades in dental prosthetics in the People's Republic of China and internationally. The company offers dental prosthetics, including crowns and bridges, removable full and partial dentures, implants, and full-cast restorations, as well as provides public health and medical services. It is also involved in the investment holding of convertible bonds and promissory notes, as well as provision of medical technology and health care project development, medical consultation, and other medical services. The company was formerly known as Mega Medical Technology Limited and changed its name to Kaisa Health Group Holdings Limited in January 2018. Kaisa Health Group Holdings Limited was founded in 1971 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.kaisahealth.com",
        "market_cap": "Small Cap"
    },
    "0907.HK": {
        "short_name": "ELEGANCEOPTICAL",
        "long_name": "Elegance Optical International Holdings Limited",
        "summary": "Elegance Optical International Holdings Limited, an investment holding company, manufactures and trades in optical frames and sunglasses in the United States, Europe, the People's Republic of China, other Asian countries, and internationally. The company operates through four segments: Manufacturing and Trading, Property Investment, Debts and Securities Investment, and Film Investment and Distribution. It is also involved in property leasing and investment businesses; securities investment activities; investing in financial instruments and quoted shares; money lending and loan financing activities; film right and movie investment and distribution activities; and trading of bags. The company was formerly known as Elegance International Holdings Limited and changed its name to Elegance Optical International Holdings Limited in September 2013. Elegance Optical International Holdings Limited was founded in 1975 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.elegance-group.com",
        "market_cap": "Small Cap"
    },
    "1134.HK": {
        "short_name": "KELFRED",
        "long_name": "Kelfred Holdings Limited",
        "summary": "Kelfred Holdings Limited, an investment holding company, manufactures and sells eyewear products. It produces a range of spectacle frames and sunglasses primarily through original design manufacturing and original equipment manufacturing business models. The company also offers original brand manufacturing products under the Miga brand. Its services include product design and development, raw materials procurement, production, quality control, packaging, and delivery. The company is operates in Italy, the United Kingdom, the Netherlands, Hong Kong, France, Spain, Hungary, the United States, and internationally. Kelfred Holdings Limited was founded in 1986 and is headquartered in Sha Tin, Hong Kong.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sha Tin",
        "zipcode": null,
        "website": "http://www.kelfred.com.hk",
        "market_cap": "Small Cap"
    },
    "3600.HK": {
        "short_name": "MODERN DENTAL",
        "long_name": "Modern Dental Group Limited",
        "summary": "Modern Dental Group Limited, an investment holding company, produces and distributes dental prosthetic devices in Europe, Greater China, North America, Australia, and internationally. It operates through three segments: Fixed Prosthetic Devices, Removable Prosthetic Devices, and Others. The Fixed Prosthetic Devices segment offers restorative dental procedures, such as metal-ceramic crowns and bridges, metal crowns and bridges, metal-free crowns and bridges, and custom implant abutments devices. The Removable Prosthetic Devices segment produces full and partial dentures with and without metal frameworks. The Others segment offers orthodontic devices, sports guards, anti-snoring devices, raw materials, and dental equipment. This segment also provides services for educational events and seminars. The company sells its products to dentists, dental clinics, hospitals, distributors, and other customers under the Permadental & Semperdent, Elysee, Labocast, Modern Dental Laboratory, Yangzhijing, Southern Cross Dental, Andent, Gold & Ceramics, Precision Dental, Modern Dental USA, MicroDental, Sundance Dental, Quantum Dental, Labo Ocean Indien, and Digitek Dental brands. Modern Dental Group Limited was founded in 1986 and is based in Kowloon, Hong Kong.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.moderndentalgp.com",
        "market_cap": "Small Cap"
    }
}